{"jobTitle": "Merchandise Planner", "company": {"name": "Lamps Plus", "location": "Chatsworth, CA"}, "location": "Chatsworth, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "Lamps Plus is looking for a *Merchandise Planner* to take plan ownership and analyze Omni-channel historical data and current trend data to identify risks and opportunities; inventory levels compare to sales data of the planned segments to company targets and provide action plans to reconcile deviations. This position will also manage a Replenishment & Allocation Analyst, in addition to the sales and inventory at segment level and ensure that the merchandise, sales and KPI targets will be met on a monthly, quarterly, and annual basis.<br/><br/>**Responsibilities**<br/><br/><ul><li>Analyze historical data and trends to develop category, ladder, and product-level inventory plans supporting company objectives.</li><li>Monitor inventory positions to identify opportunities for reorders, markdowns, turnover and margin optimization.</li><li>Collaborate with the Buying Team to manage inventory reconciliation on an ongoing basis as well as recurring OTB and reporting metric reviews.</li><li>Monitor sales channel performance and report performance based KPIs regularly.</li><li>Maintain SKU-level forecasts and coordinate product purchase needs with the Replenishment & Allocation Analyst.</li><li>Collaborate with the Retail Merchants team to ensure consistency of information and share best practices.</li><li>Generate New and Test Purchase Requests.</li><li>Support inventory management between retail, e-commerce, and wholesale channels.</li><li>Identify opportunities for process improvement.</li><li>Support the Retail Operations and Supply Chain teams with other duties as needed.</li><li>Partner with the Director of Planning and Merchants to provide ongoing strategic direction.</li><li>Develop annual financial budgets and in-season forecasts by Department/Class/Brand.</li><li>Provide mentoring, training, and coaching to Replenishment & Allocation Analyst.</li><li>Review financial analysis and deliverables from the team, providing direction and feedback as necessary.</li><li>Impact and optimize merchandise assortment plan through segmentation, brand, category, and trend analysis.</li><li>Equip the Buying Team with necessary data and analysis for vendor negotiations.</li><li>Ensure proper breadth and depth in merchandise assortment and alignment with replenishment model expectations<br/><br/></li></ul>**What You Bring To The Table**<br/><br/><ul><li>2+ years of quantitative analytical experience with a proven track record of achieving successful results.</li><li>Solid experience with designing and building Excel spreadsheet models.</li><li>Bachelor’s Degree or Master’s Degree required.</li><li>Strong aptitude with numbers and clear understanding of retail math.</li><li>Strong organizational skills - ability to manage multiple projects, prioritize, and meet deadlines.</li><li>Ability to communicate persuasively, influentially, and responsibly across cross-functional teams.</li><li>Excels in team environments and in building / developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals.</li><li>Ability to demonstrate logical thinking and problem-solving skills multi-tasking, time management, self-motivation, persistence, and takes full ownership of their success.</li><li>Advanced knowledge and understanding of Microsoft Excel and Office Suite</li><li>SQL experience a plus<br/><br/></li></ul>**What’s In It For You**<br/><br/><ul><li>Medical, Dental, Vision</li><li> Dependent Care Flexible Spending Account, Flexible Spending Account, Health Reimbursement Account, and Employee Assistance Program</li><li>Paid time off, 401(k), Sponsored/Voluntary life and AD&D</li><li>Voluntary Short/Long-Term Disability and Voluntary Accident Insurance</li><li>Voluntary Pet Insurance</li><li>Voluntary Critical Illness, Voluntary Hospital Indemnity</li><li>Commuter Benefits</li><li>Employee Discounts and Recreation Discounts</li><li>Ongoing professional development training, career advancement opportunities and more!<br/><br/></li></ul>**Who We Are**<br/><br/><ul><li>Great Things Happen Here!</li><li>We Believe in Helping People Create the Homes of Their Dreams</li><li>Housewares/Home Furnishings retailer by Digital Commerce 360</li><li>Ongoing career growth opportunities and competitive benefits package </li><li>1000s of exclusive products designed and manufactured by in-house teams<br/><br/></li></ul>Compensation: $70,000-$80,000 annually, depending on experience", "responsibilities": "Analyze historical data and trends to develop category, ladder, and product-level inventory plans supporting company objectives. Monitor inventory positions to identify opportunities for reorders, markdowns, turnover and margin optimization. Collaborate with the Buying Team to manage inventory reconciliation on an ongoing basis as well as recurring OTB and reporting metric reviews. Monitor sales channel performance and report performance based KPIs regularly. Maintain SKU-level forecasts and coordinate product purchase needs with the Replenishment & Allocation Analyst. Collaborate with the Retail Merchants team to ensure consistency of information and share best practices. Generate New and Test Purchase Requests. Support inventory management between retail, e-commerce, and wholesale channels. Identify opportunities for process improvement. Support the Retail Operations and Supply Chain teams with other duties as needed. Partner with the Director of Planning and Merchants to provide ongoing strategic direction. Develop annual financial budgets and in-season forecasts by Department/Class/Brand. Provide mentoring, training, and coaching to Replenishment & Allocation Analyst. Review financial analysis and deliverables from the team, providing direction and feedback as necessary. Impact and optimize merchandise assortment plan through segmentation, brand, category, and trend analysis. Equip the Buying Team with necessary data and analysis for vendor negotiations. Ensure proper breadth and depth in merchandise assortment and alignment with replenishment model expectations", "qualifications": {"required": "2+ years of quantitative analytical experience with a proven track record of achieving successful results. Solid experience with designing and building Excel spreadsheet models. Bachelor’s Degree or Master’s Degree required. Strong aptitude with numbers and clear understanding of retail math. Strong organizational skills - ability to manage multiple projects, prioritize, and meet deadlines. Ability to communicate persuasively, influentially, and responsibly across cross-functional teams. Excels in team environments and in building / developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals. Ability to demonstrate logical thinking and problem-solving skills multi-tasking, time management, self-motivation, persistence, and takes full ownership of their success. Advanced knowledge and understanding of Microsoft Excel and Office Suite. SQL experience a plus", "preferred": ""}, "skills": ["Excel", "SQL"], "postedDate": "5 months ago", "benefits": "Medical, Dental, Vision, Dependent Care Flexible Spending Account, Flexible Spending Account, Health Reimbursement Account, and Employee Assistance Program, Paid time off, 401(k), Sponsored/Voluntary life and AD&D, Voluntary Short/Long-Term Disability and Voluntary Accident Insurance, Voluntary Pet Insurance, Voluntary Critical Illness, Voluntary Hospital Indemnity, Commuter Benefits, Employee Discounts and Recreation Discounts, Ongoing professional development training, career advancement opportunities and more!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3859829855"}