{"jobTitle": "Warehouse Clerk", "company": {"name": "REVOLVE", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "Meet REVOLVE<br/><br/>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand, and a go-to online source for discovery and inspiration, we deliver an engaging customer experience from a vast yet curated offering totaling over 45,000 apparel, footwear, accessories and beauty styles. Our dynamic platform connects a deeply engaged community of millions of consumers, thousands of global fashion influencers, and more than 500 emerging, established and owned brands. Through 20 years of continued investment in technology, data analytics, and innovative marketing and merchandising strategies, we have built a powerful platform and brand that we believe is connecting with the next generation of consumers and is redefining fashion retail for the 21st century. For more information please visit www.revolve.com.<br/><br/>At REVOLVE the most successful team members have the thirst and creativity to redefine fashion retail for the 21st century, making REVOLVE the leading online retail destination targeted towards Millennial and Generation Z consumers seeking premium fashion. With a team of 1,000 strong, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment.<br/><br/>Some of the sweetest perks we offer aren’t in a typical benefit package like hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.<br/><br/>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or .<br/><br/>Are you ready to set the standard for Premium apparel?<br/><br/>Main Purpose Of The Warehouse Associate Role<br/><br/>This is a full time position for a candidate who is task and deadline driven. The person in this role will work 40+ hours per week. Overtime will be assigned on an as needed basis.<br/><br/>This position is temporary for the first 60 days. Upon successful completion of 60 days the position becomes a permanent addition to staff.<br/><br/>The Details<br/><br/>Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li>Prepare orders for shipment to customers in a timely manner </li><li>Fill pick ticket orders to pack </li><li>Stock merchandise and keep accurate inventory records </li><li>Receive goods and count units for accuracy </li><li>Identify and communicate potential inventory issues found while picking and packing </li><li>Research discrepancies and advise Management of any problems as required.<br/><br/></li></ul>Required Competencies<br/><br/>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/><ul><li>Organized with great attention to detail</li><li>Excellent verbal and written </li><li>Able to collaborate in a fast-paced and changing environment<br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li>High School Diploma or Equivalent </li><li>Ability to bend, lift, open and move product up to 50 lbs.</li><li>Ability to stand and walk, bend, use hands to finger, handle or feel; required to talk and hear </li><li>Ability to be flexible and willing to work extended hours when necessary</li><li>Must be physically capable of working in conditions normally associated with a merchandise warehouse or distribution center, such as, but not limited to, warm and cold temperatures<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Bilingual in English and Spanish </li><li>Distribution Center/Warehouse experience </li><li>Knowledge of apparel industry </li><li>Basic knowledge of Microsoft Excel <br/><br/></li></ul>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day.<br/><br/>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.<br/><br/>A reasonable estimate of the current base hourly/salary range is $32,240/per year to $33,280/per year.<br/><br/>Attention<br/><br/>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.<br/><br/>The following job description contains representative examples of work that will be performed in positions allocated to this classification. It is not required that any position perform all of the duties listed, so long as primary responsibilities are consistent with the work as described. Roles and responsibilities can often be expanded to accommodate changing business conditions and goals, as well as to tap into the skills and talents of the individuals in the company. Accordingly, associates may be asked to perform duties that are outside the specific functions that are listed.", "responsibilities": "Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li>Prepare orders for shipment to customers in a timely manner </li><li>Fill pick ticket orders to pack </li><li>Stock merchandise and keep accurate inventory records </li><li>Receive goods and count units for accuracy </li><li>Identify and communicate potential inventory issues found while picking and packing </li><li>Research discrepancies and advise Management of any problems as required.<br/><br/></li></ul>", "qualifications": {"required": "High School Diploma or Equivalent, Ability to bend, lift, open and move product up to 50 lbs., Ability to stand and walk, bend, use hands to finger, handle or feel; required to talk and hear, Ability to be flexible and willing to work extended hours when necessary, Must be physically capable of working in conditions normally associated with a merchandise warehouse or distribution center, such as, but not limited to, warm and cold temperatures<br/><br/>", "preferred": "Bilingual in English and Spanish, Distribution Center/Warehouse experience, Knowledge of apparel industry, Basic knowledge of Microsoft Excel <br/><br/>"}, "skills": ["Microsoft Excel"], "postedDate": "5 months ago", "salary": {"amount": "32,240.00/yr - 33,280.00/yr", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3860948325"}