{"jobTitle": "Operations Manager", "company": {"name": "Italic", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value.<br/><br/>We are seeking an experienced Operations Manager to join our team and oversee all interactions with our third-party logistics (3PL) warehouse, logistics, shipment, contract, and relationship. The ideal candidate should have a strong background in 3PL and logistics management, with experience managing teams and processes. As an Operations Manager, you will be responsible for ensuring the smooth running of our supply chain operations, optimizing processes to increase efficiency and productivity and ensuring that we meet our contractual obligations.<br/><br/><strong>Responsibilities:<br/><br/></strong><em>3PL Warehouse &amp; Logistics Management<br/><br/></em><ul><li> Manage and lead a team of warehouse staff, including hiring, training, and performance management. </li><li> Monitor and evaluate the effectiveness of order fulfillment processes and procedures, and make recommendations for improvements. </li><li> Develop and maintain positive and productive relationships with our warehouse partners and logistics providers. </li><li> Ensure that our 3PL warehouse partners and logistics providers are delivering to agreed service levels and contractual obligations. </li><li> Develop and implement operational processes and procedures to optimize efficiency and productivity. <br/><br/></li></ul><em>Inventory Management &amp; Reporting<br/><br/></em><ul><li>Overseeing inventory management and devising strategies for inventory balancing</li><li>Providing comprehensive reports on inventory, logistics, and overall operations performance</li><li>Analyzing data to identify bottlenecks, foresee potential issues, and suggest improvements<br/><br/></li></ul><em>Contract Management<br/><br/></em><ul><li> Manage the contractual relationship between our company and our warehouse partners and logistics providers. </li><li> Ensure that all contractual obligations are met by both parties. </li><li> Develop and maintain strong relationships with key stakeholders and decision-makers within our 3PL warehouse partners and logistics providers. <br/><br/></li></ul><em>Project Management<br/><br/></em><ul><li> Plan and oversee the implementation of operational projects related to warehouse and logistics management, ensuring that they are delivered on time and within budget. </li><li> Identify and manage project risks and issues, and develop contingency plans where necessary. </li><li> Collaborate with cross-functional teams to ensure effective communication and coordination. <br/><br/></li></ul><strong>Requirements:<br/><br/></strong><em>Soft Skills:<br/><br/></em><ul><li> Excellent communication, collaboration, and interpersonal skills. </li><li> Strong leadership skills and ability to manage teams effectively. </li><li> Strong problem-solving skills and ability to think creatively. </li><li> Ability to work independently and as part of a team. </li><li> Positive attitude and willingness to learn. <br/><br/></li></ul><em>Technical Skills:<br/><br/></em><ul><li> Strong proficiency in project management tools and software. </li><li> Experience with 3PL and logistics management. </li><li> Familiarity with regulatory and legal requirements in the relevant industry. <br/><br/></li></ul><em>Mentality:<br/><br/></em><ul><li> Proactive and self-motivated with a willingness to take initiative. </li><li> Strong attention to detail and accuracy. </li><li> Flexibility to adapt to changing priorities and deadlines. </li><li> Passion for operations management and eagerness to stay up-to-date with emerging trends and best practices. <br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li> Minimum of 5 years of experience in operations management, with a proven track record of managing 3PL warehouse and logistics teams and processes (e-commerce experience is a must)</li><li> Demonstrated experience in developing and implementing operational processes and procedures related to 3PL warehouse and logistics management. </li><li> A bachelor's degree in business administration, management, operations management, or a related field is preferred. <br/><br/></li></ul>This is a full-time position with a competitive salary and benefits package. If you meet the qualifications and are interested in this opportunity, please submit your resume and cover letter for consideration.<br/><br/><strong>Culture<br/><br/></strong><em>Great Brands Start With Great People<br/><br/></em>Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision-making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in.<br/><br/><em>Inputs Over Outputs<br/><br/></em>We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment.<br/><br/><em>Flat Hierarchy<br/><br/></em>Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company.<br/><br/><em>Small Team, Big Opportunities<br/><br/></em>As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance.", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3860726283"}