{"jobTitle": "Business Operations & Strategy", "company": {"name": "Hang", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Consulting, Information Technology, and Sales", "industry": "Technology, Information and Internet", "description": "Hang is building the future of loyalty for brands. Hang is the next generation brand loyalty & membership platform. By harnessing the power of personalization, gamification, and its integrations ecosystem, Hang provides brands with a radically new type of loyalty experience for their customers. Today, they work with a variety of major brands (such as Ulta Beauty, Budweiser, Flipkart, and more), as well as multiple well-known, up-and-coming restaurant chains (Boba Guys, Roam Artisan Burger, and Williamsburg Pizza, among several others). Hang draws from years of deep expertise in loyalty, game design, and finance with employees from leading companies like Google, Amazon, Apple, Meta, LinkedIn, Coinbase, Square, and Goldman Sachs. Hang raised a $16 million Series A led by Paradigm last summer, with participation from Tiger Global, Howard Schultz, Kevin Durant, Mr. Beast, and the founders of Warby Parker, Allbirds, and Bombas, among others. As our first Business Operations & Strategy hire, we are looking for a jack-of-all-trades who will help us solve our most pressing business and operational issues (e.g. defining our pricing strategy, running our strategic planning process, building out new functions, etc.). The ideal candidate is a high IQ/high EQ generalist with extraordinary horsepower and a bias towards getting things done. In this role, you will work closely with our CEO and you will get exposure to every part of our business. We are a high-growth, early stage startup and over time this role will present potential internal pathways to leadership roles for new functions as they are developed.", "responsibilities": "You will partner closely with Hang’s leadership team to identify and solve the most pressing problems at the company. You will personally manage and drive key operational and strategic initiatives across the business. You will partner with every function in the business and act as a “hub” who helps drive our strategy by synthesizing insights and setting actionable plans. You will create and maintain the financial model and track key company-level success metrics. You will help prepare external presentations (board & investor decks, strategic presentations, etc.)", "qualifications": {"required": "2+ years of experience at a top-tier consulting firm, investment bank or private equity firm (or equivalent analytical and strategic role at top-tier organization) or 4+ years of experience at a high-growth technology company, ideally in a BizOps or Strategy role. You are capable of producing high-quality slide decks, financial models and analytical memos with minimal guidance or supervision. You are the ultimate project manager, able to prioritize and execute on multiple important projects in parallel. You believe the best way to learn something new is by doing it and you are eager to expand your skillset.", "preferred": "You have an MBA or similar advanced degree. You have a passion for consumer brands."}, "skills": ["Business Operations", "Strategy", "Project Management", "Financial Modeling", "Analytical Skills"], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Top-tier health, vision, and dental, including plans with $0 employee cost. Unlimited PTO / sick leave. Competitive salary & equity compensation. Quarterly company offsites.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3860725189"}