{"jobTitle": "Junior Buyer, 1st Shift", "company": {"name": "Brasstech, Inc.", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "16.50/hr - $22.55/hr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Manufacturing", "description": "<strong>Job Summary<br/><br/></strong>The Junior Buyer works from the material requirement planning outputs and other system-generated documents to plan/schedule and purchase materials at the most favorable price consistent with quality, quantity and delivery requirements for the organization. This position will also be responsible for processing Outside Processing PO’s for domestic suppliers as well as assist with the purchase of Maintenance, Repair, and Operating Supplies (MRO) requirements<br/><br/><strong>ESSENTIAL DUTIES AND RESPONSIBLITIES<br/><br/></strong><li>Coordinate material requirements with approved vendors on a daily/weekly basis.</li><ul><li>Monitor safety stock, EOQ’s and lead-times on all assigned product lines.</li><li>Responsible for maintaining inventory levels consistent with company goals.</li><li>Coordinate sources and purchase all MRO requirements for production and maintenance department.</li><li>Ensure purchasing documents are complete and accurate; and include appropriate and reasonable terms and conditions.</li><li>Primarily responsible for domestic suppliers, may also manage international suppliers with limited volume and spend.</li><li>Performs other duties as required.<br/><br/></li></ul><strong>MINIMUM REQUIRED QUALIFICATIONS<br/><br/></strong><strong>Educations and/or Experience<br/><br/></strong><ul><li>Bachelor’s Degree in Business related field or combination related work experience and higher education preferred</li><li>1 – 2 years of related purchasing experience is required<br/><br/></li></ul><strong>SKILLS, KNOWLEDGE, AND ABILITIES<br/><br/></strong><ul><li>Knowledge of purchasing procedures and policies</li><li>Ability to read blueprints</li><li>Ability to analyze the impact of business decisions before executing them</li><li>Ability to manage multiple tasks and projects simultaneously</li><li>Ability to effectively communicate with all levels of the organization</li><li>Ability to work with a diverse workforce</li><li>Excellent organization skills and attention to detail</li><li>Excellent interpersonal and customer service skills<br/><br/></li></ul><strong>Computer Skills<br/><br/></strong><ul><li>Microsoft Office (Outlook, Word, Excel)</li><li>Intermediate MS Excel (VLOOKUP function, sorting and filtering data)</li><li>Familiarity with an Enterprise Resource Planning (ERP) and Material Requirement Planning (MRP) system<br/><br/></li></ul><strong>Language Skills<br/><br/></strong><ul><li>English (reading, writing, verbal)<br/><br/></li></ul><strong>Mathematical Skills<br/><br/></strong><ul><li>Basic math skills (add, subtract, divide, multiply)<br/><br/></li></ul><strong>Other Skills<br/><br/></strong><ul><li>Must be able to work all shifts, including weekends and holiday hours.</li><li>Ability to legally work without sponsorship for employment visa status.<br/><br/></li></ul><strong>PREFERRED QUALIFICATIONS (only Provide If Needed)<br/><br/></strong><strong>Certificates, License, Registrations or Professional Designations<br/><br/></strong><ul><li>APICS or ISM certification a plus<br/><br/></li></ul><strong>Educations And/or Experience<br/><br/></strong><ul><li>Purchasing experience in the plumbing industry is a plus<br/><br/></li></ul><strong>Language Skills<br/><br/></strong><ul><li>Bilingual (English and Spanish or English/Chinese) is a plus<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong>While performing the duties of this job, the employee uses his/her hands to finger, handle or feel objects, tools or controls; reach with hands and arms; talk or hear. This is a largely sedentary role; however, standing and walking up and down stairs may be required. The employee will occasionally be required to complete some filing. This would require the ability to lift files, open filing cabinets and bend or stand on a stool as necessary. Individuals may need to sit or stand as needed. This position may require reaching above shoulder heights or below the waist or lifting as required to file documents or store materials throughout the workday. Proper lifting techniques are required. This position may occasionally lift up to 25 pounds.<br/><br/><strong>WORK ENVIRONMENT<br/><br/></strong>While performing the duties of this job, the employee will work in an office environment or enclosed office space; and can be exposed to a warehouse environment on a frequent basis. The ambient conditions are moderate, and the noise level in the work environment is moderate. Artificial lighting and air conditioning is found within the environment.<br/><br/><strong>Company: Brasstech<br/><br/></strong>Shift 1 (United States of America)Full time<br/><br/>Hiring Range: $16.50 - $22.55<br/><br/>Actual compensation may vary based on various factors including experience, education, geographic location, and/or skills.<br/><br/><em>Brasstech</em> <em>(the “Company”) is an equal opportunity employer and we want to have the best available persons in every job. The Company makes employment decisions only based on merit. It is the Company’s policy to prohibit discrimination in any employment opportunity (including but not limited to recruitment, employment, promotion, salary increases, benefits, termination and all other terms and conditions of employment) based on race, color, sex, sexual orientation, gender, gender identity, gender expression, genetic information, pregnancy, religious creed, national origin, ancestry, age, physical/mental disability, medical condition, marital/domestic partner status, military and veteran status, height, weight or any other such characteristic protected by federal, state or local law. The Company is committed to complying with all applicable laws providing equal employment opportunities. This commitment applies to all persons involved in the operations of the Company regardless of where the employee is located and prohibits unlawful discrimination by any employee of the Company.<br/><br/></em><em>Brasstech is an E-Verify employer. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that allows participating employers to electronically verify the employment eligibility of their newly hired employees in the United States. Please click on the following links for more information.<br/><br/></em><em>E-Verify Participation Poster: </em>English &amp; Spanish<br/><br/><em>E-verify Right to Work Poster: English, Spanish</em>", "responsibilities": "The Junior Buyer works from the material requirement planning outputs and other system-generated documents to plan/schedule and purchase materials at the most favorable price consistent with quality, quantity and delivery requirements for the organization. This position will also be responsible for processing Outside Processing PO’s for domestic suppliers as well as assist with the purchase of Maintenance, Repair, and Operating Supplies (MRO) requirements", "qualifications": {"required": "Bachelor’s Degree in Business related field or combination related work experience and higher education preferred\n1 – 2 years of related purchasing experience is required", "preferred": "APICS or ISM certification a plus\nPurchasing experience in the plumbing industry is a plus\nBilingual (English and Spanish or English/Chinese) is a plus"}, "skills": ["Purchasing", "MRP", "ERP", "Microsoft Office", "Excel", "Blueprints", "Communication", "Organization", "Customer Service"], "postedDate": "5 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3860979082"}