{"jobTitle": "Senior Manager, Real Estate", "company": {"name": "Sony", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Management", "industry": "Entertainment Providers", "description": "<strong>Sony Corporation of America</strong>, located in New York, NY, is the U.S. headquarters of Sony Group Corporation, based in Tokyo, Japan. Sony's principal U.S. businesses include Sony Electronics Inc., Sony Interactive Entertainment LLC, Sony Music Entertainment, Sony Music Publishing and Sony Pictures Entertainment Inc. With some 900 million Sony devices in hands and homes worldwide today, a vast array of Sony movies, television shows and music, and the PlayStation Network, Sony creates and delivers more entertainment experiences to more people than anyone else on earth. To learn more: <strong>www.sony.com/en</strong>.<br/><br/><strong>Department Overview<br/><br/></strong>The Corporate Real Estate department is responsible for managing the global real estate portfolio of Sony Corporation of America and its affiliated companies. The department provides strategic planning, transaction management, project management, lease administration, and facilities management services to support Sony's business objectives and optimize its real estate assets. The department works closely with various internal and external stakeholders.<br/><br/><strong>Position Summary<br/><br/></strong>Sony Corporation of America (SCA) is seeking a Senior Manager of Real Estate to serve on an enterprise-wide domestic and international real estate strategy and transaction team. This position will report to the VP of Corporate Real Estate and will be located in Culver City, CA. The position will plan, manage, perform and direct all aspects of real estate transactions related to the acquisition, disposition, leasing, licensing and subleasing of properties throughout the Asia Pacific region and select western US markets for SONY subsidiaries and affiliated companies. Additionally, the Senior Manager will manage cost containment projects involving operating expense CAM and property tax reviews/audits using third party consultants. The Senior Manager will lead projects to a successful conclusion meeting established schedule and budget KPIs.<br/><br/>This position will provide a leadership role with respect to strategic property reviews, real estate consolidations, corporate real estate transactions, strategy, and project management for a range of property types including office, industrial, studio, production, and specialty projects. The Senior Manager will identify and implement real estate solutions that adapt to and support the business strategy at an optimum cost. The successful candidate must be a self-starter and fully engaged to support ongoing department or portfolio-wide projects and processes.<br/><br/><strong>This position will be on a Hybrid schedule with 3 days per week in the Culver City office <br/><br/></strong><strong>Job Responsibilities<br/><br/></strong><ul><li>As a knowledge expert, assist business units with management of Asia Pacific real estate portfolios and development of real estate strategies aligned with individual business goals and objectives </li><li>Identify and implement opportunities to consolidate, co-locate, utilize vacant or underutilized space and to take advantage of market trends which benefit the corporation (with a focus on reduction in overall occupancy costs) </li><li>Utilizing existing resources, identify project service providers (i.e. marketing, brokerage, legal, etc.) and evaluate consultant proposals. Negotiate and administer consultant contracts to ensure quality performance within budget constraints. </li><li>Prepare and negotiate RFP’s, term sheets, leases, work letters, and other real estate agreements. </li><li>Perform pre-lease due diligence, site selection and market analysis. </li><li>Investigate, evaluate and present alternative sites to senior management. </li><li>Prepare project schedules, financial analyses, and real estate documents for review by senior management. </li><li>Obtain all necessary project approvals from senior management working with user groups and Sony Real Estate team leader. Upon approval, manage resources (both internal and external) to bring projects to satisfactory completion to meet business needs and to insure adherence to legal documents, schedule, specifications and budget. </li><li>For select US properties, review annual landlord operating expense and real estate tax estimates, and annual landlord CAM reconciliation statements to ensure accuracy and lease compliance. </li><li>Initiate and manage CAM Audits using third party vendors for select US properties </li><li>Effectively manage high volume concurrent assignments with different product types in multiple Asia Pacific and select US markets. </li><li>Perform other related duties as assigned by management such as monthly reports, strategic property reviews, lease abstracts, project completion and closeout requirements, and cost savings reports. </li><li>Collaborate cross functionally with internal teams. </li><li>Available to travel, including internationally, up to 25%. <br/><br/></li></ul><strong>Qualifications For Position<br/><br/></strong><strong>Your qualifications and experience should include:</strong> <br/><br/><ul><li>Undergraduate degree and/or advanced degree in related discipline (business, real estate, engineering, or law). </li><li>7+ years of work experience including 5+ years of corporate/commercial real estate experience and negotiating commercial leases in Asia Pacific and the Americas. </li><li>Extensive background in negotiating and documenting real estate transactions throughout the Asia Pacific region. Existing Relationships with service providers across the region desirable. </li><li>Thorough understanding of legal and financial aspects of a Real Estate transaction. </li><li>Strong written and oral communications. </li><li>Advanced computer skills (analytical, report writing, Microsoft Word, Excel, OneNote, and PowerPoint) necessary. </li><li>Knowledge of real estate database applications with preference for CoStar Real Estate Manager. </li><li>Foreign language skills preferred. </li><li>Familiarity with FASB, GAAP and IFRS accounting rules for real estate desirable </li><li>Must be eligible to work unrestricted in the USA. <br/><br/></li></ul>In addition to competitive pay and benefits, we offer an environment and culture that promotes Diversity, Equity, and Inclusion. We are committed to creating an inclusive employee experience for you to thrive as part of Sony’s purpose to “fill the world with emotion through the power of creativity and technology.” <br/><br/><strong>Benefits:  </strong>  <br/><br/>SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.   <br/><br/> <br/><br/> <strong>What we offer you:</strong> <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)   </li><li>Employee assistance plan and comprehensive behavioral health benefits  </li><li>Fertility benefits, including, surrogacy, and adoption assistance programs    </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children   </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance   </li><li>Short-term &amp; long-term disability plans    </li><li>Up to 12 weeks of paid parental and caregiver leave    </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting  </li><li>Education assistance and student loan programs     <br/><br/></li></ul>  <br/><br/><strong>Other Programs:</strong>  <br/><br/><ul><li>  Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>Referral bonuses (subject to eligibility)    </li><li>Matching gift program    </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products, offered exclusively to Sony employees  </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)    <br/><br/></li></ul><em>The anticipated annual base salary for this position is $160,000 to $170,000. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. <br/><br/></em>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/><strong>Disability Accommodation for Applicants to Sony Corporation of America<br/><br/></strong>Sony Corporation of America provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at careers@sonyusa.com or by mail to: Sony Corporation of America, Human Resources Department, 25 Madison Avenue, New York, NY 10010. Please indicate the position you are applying for.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)<br/><br/><em>While SCA does not require employees to be vaccinated against COVID-19, there are certain Sony offices that require employees to be vaccinated in order to enter. If you will be located at or travel to those offices, you will be required to be fully vaccinated to enter. The Company will consider requests for reasonable accommodations for documented medical reasons and for sincerely held religious beliefs in accordance with applicable law. Please do not include proof of vaccination status or any indication of a possible request for a vaccination accommodation when submitting your application materials. If applicable, the Company will follow up with you directly to request proof of vaccination and to discuss any potential accommodations.</em>", "responsibilities": "<ul><li>As a knowledge expert, assist business units with management of Asia Pacific real estate portfolios and development of real estate strategies aligned with individual business goals and objectives </li><li>Identify and implement opportunities to consolidate, co-locate, utilize vacant or underutilized space and to take advantage of market trends which benefit the corporation (with a focus on reduction in overall occupancy costs) </li><li>Utilizing existing resources, identify project service providers (i.e. marketing, brokerage, legal, etc.) and evaluate consultant proposals. Negotiate and administer consultant contracts to ensure quality performance within budget constraints. </li><li>Prepare and negotiate RFP’s, term sheets, leases, work letters, and other real estate agreements. </li><li>Perform pre-lease due diligence, site selection and market analysis. </li><li>Investigate, evaluate and present alternative sites to senior management. </li><li>Prepare project schedules, financial analyses, and real estate documents for review by senior management. </li><li>Obtain all necessary project approvals from senior management working with user groups and Sony Real Estate team leader. Upon approval, manage resources (both internal and external) to bring projects to satisfactory completion to meet business needs and to insure adherence to legal documents, schedule, specifications and budget. </li><li>For select US properties, review annual landlord operating expense and real estate tax estimates, and annual landlord CAM reconciliation statements to ensure accuracy and lease compliance. </li><li>Initiate and manage CAM Audits using third party vendors for select US properties </li><li>Effectively manage high volume concurrent assignments with different product types in multiple Asia Pacific and select US markets. </li><li>Perform other related duties as assigned by management such as monthly reports, strategic property reviews, lease abstracts, project completion and closeout requirements, and cost savings reports. </li><li>Collaborate cross functionally with internal teams. </li><li>Available to travel, including internationally, up to 25%. <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Undergraduate degree and/or advanced degree in related discipline (business, real estate, engineering, or law). </li><li>7+ years of work experience including 5+ years of corporate/commercial real estate experience and negotiating commercial leases in Asia Pacific and the Americas. </li><li>Extensive background in negotiating and documenting real estate transactions throughout the Asia Pacific region. Existing Relationships with service providers across the region desirable. </li><li>Thorough understanding of legal and financial aspects of a Real Estate transaction. </li><li>Strong written and oral communications. </li><li>Advanced computer skills (analytical, report writing, Microsoft Word, Excel, OneNote, and PowerPoint) necessary. </li><li>Knowledge of real estate database applications with preference for CoStar Real Estate Manager. </li><li>Foreign language skills preferred. </li><li>Familiarity with FASB, GAAP and IFRS accounting rules for real estate desirable </li><li>Must be eligible to work unrestricted in the USA. <br/><br/></li></ul>", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "benefits": "SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.   <br/><br/> <br/><br/> <strong>What we offer you:</strong> <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)   </li><li>Employee assistance plan and comprehensive behavioral health benefits  </li><li>Fertility benefits, including, surrogacy, and adoption assistance programs    </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children   </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance   </li><li>Short-term &amp; long-term disability plans    </li><li>Up to 12 weeks of paid parental and caregiver leave    </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting  </li><li>Education assistance and student loan programs     <br/><br/></li></ul>  <br/><br/><strong>Other Programs:</strong>  <br/><br/><ul><li>  Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>Referral bonuses (subject to eligibility)    </li><li>Matching gift program    </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products, offered exclusively to Sony employees  </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)    <br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "160,000.00 to 170,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3861706818"}