{"jobTitle": "Job Opportunity for the role of Supply chain Manager in Santa Ana CA", "company": {"name": "Intellectt Inc", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Hello,<br/><br/>Hope you are doing well.<br/><br/>This is Jahera and I'm a recruiter at Intellectt, Inc. Please find the job description and reach out to me with an updated copy of your resume. You can send it to jahera@intellectt.com or call me at +1(732) 276-1791<br/><br/>Role: <strong>Mgr, Supply Chain<br/><br/></strong>Location: <strong>Santa Ana, CA - 92705<br/><br/></strong>Duration: <strong>18 Months <br/><br/></strong><strong>Job Description<br/><br/></strong>The main function of a Global Trade Compliance Manager is to assess and lead actions required to ensure the compliance of the organization, its Vendors, and entities with all government import, export, and trade compliance laws and regulations globally.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Trade Compliance Management: Evaluate, assess, and resolve trade compliance issues for the organization and vendor facilities globally.</li><li>Strategy and Process Development: Develop strategies and processes for import brokerage and export licensing at global locations.</li><li>Government Notification: Notify U.S. and global government agencies about the movement of goods across countries.</li><li>Product Classification: Analyze and determine the appropriate classification of products to meet import and export requirements of U.S. and global governments, including Schedule B, Harmonized Tariff Schedule (HTS), Export Control Classification Number (ECCN), and Toxic Substances Control Act (TSCA).</li><li>Product Qualification: Establish processes to determine and document how products qualify for preferential treatment under various government Free Trade Agreements (FTAs).</li><li>System Management: Serve as a super user for trade compliance systems, including configuration, writing test scripts, performing testing, and leading implementations globally.</li><li>Regulatory Guidance: Apply laws and regulations while providing guidance to various departments (e.g., Customer Service, Sales, Marketing, Distribution, Logistics, Regulatory) within the organization seeking to move products between countries.</li><li>Project Management: Handle other projects and incidental duties as assigned.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor's Degree required.</li><li>Understanding of and experience with U.S. and global trade compliance laws and regulations required.</li><li>2+ years of import and export experience or Customs Brokerage experience preferred.</li></ul>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3862260508"}