{"jobTitle": "Supply Chain Manager", "company": {"name": "Intellectt Inc", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Role:<strong> Supply Chain Mgr.<br/><br/></strong>Location: <strong>Santa Ana, CA - 92705<br/><br/></strong>Duration: <strong>18 Months <br/><br/></strong><strong>Job Description<br/><br/></strong>The main function of a Global Trade Compliance Manager is to assess and lead actions required to ensure the compliance of the organization, its Vendors, and entities with all government import, export, and trade compliance laws and regulations globally.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Evaluate, assess and resolve trade compliance issues for Global organization and vendor facilities.</li><li>Create and establish strategies and processes for import brokerage and export licensing at global locations.</li><li>Provide notification to the U.S. and global government agencies regarding movement of goods in and out of the countries.</li><li>Product Classification – Analyze and determine appropriate classification of product to meet U.S. and global government import and export requirements including the Schedule B, Harmonized Tariff Schedule (HTS), Export Control Classification Number (ECCN), and Toxic Substances Control Act (TSCA).</li><li>Product Qualification – Create and establish processes to determine and document how product qualifies for preferential treatment under various government Free Trade Agreements (FTAs).</li><li>Systems Super User – Configure, write test scripts, perform testing, and lead implementations of automated trade compliance systems globally.</li><li>Apply laws and regulations while providing guidance to departments (e.g. Customer Service, Sales, Marketing, Distribution, Logistics, Regulatory) seeking to move products between countries.</li><li>Other projects and incidental duties, as assigned.<br/><br/></li></ul><strong>Additional Skills<br/><br/></strong><ul><li>Capable of performing audits and developing well written, user-friendly compliance processes, procedures, and manuals.</li><li>Strong communication (verbal and written), presentation, attention to detail, interpersonal, and systems skills are key.</li><li>Experience as systems super user or related web design/webmaster experience a plus.</li><li>Good problem-solving and critical thinking skills.</li><li>Good knowledge and understanding of policies, procedures and guidelines relevant to local and/or global supply chain including FDA and ISO laws and regulations applicable to the medical device industry.</li><li>Good problem-solving skills.</li><li>Strict attention to detail.</li><li>Ability to interact professionally with all organizational levels.</li><li>Ability to manage competing priorities in a fast-paced environment.</li><li>Must be able to work in a team environment, including immediate supervisor, other team members in the section or group, and vendors/suppliers.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor's Degree required.</li><li>Understanding of and experience with U.S. and global trade compliance laws and regulations required.</li><li>2+ years of import and export experience or Customs Brokerage experience preferred.</li></ul>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3862255085"}