{"jobTitle": "Demand Planning Manager", "company": {"name": "Bonduelle Fresh Americas", "location": "Baldwin Park, CA", "industry": "Food and Beverage Manufacturing"}, "location": "Baldwin Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "130,000.00/yr - 160,000.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain, Manufacturing, and Strategy/Planning", "industry": "Food and Beverage Manufacturing", "description": "<strong>Position: Demand Planning Manager (IBP)</strong><p><strong>Department: Supply Chain</strong></p><p><strong>Reports To: Vice President, Supply Chain</strong></p><p><strong>Salary Type: Exempt</strong></p><p><strong>Location: Irwindale, California</strong></p><p><br/></p><p><strong>Compensation</strong></p><p>The listed range for this position is <strong>$130,000-$160,000 </strong>but the actual package offered may vary depending on different factors, including job-related knowledge, skills, and experience. The total compensation for this position would include other elements which include a yearly bonus.</p><p><br/></p><p><strong>Groupe Bonduelle is a company that is making a positive impact</strong></p><p>Groupe Bonduelle is the world leader in ready-to-use plant-rich food. By joining our company you will have an opportunity to make a positive and sustainable impact on yourself, others and the planet. You will play an active part in our mission to inspire the transition toward a plant-rich diet to contribute to people's well-being and planet health.</p><p>Groupe Bonduelle Fresh Americas is the U.S. business unit of France based Groupe Bonduelle (BON.PA). We are the first business unit of Groupe Bonduelle to become a Certified B Corporation. We operate three processing facilities throughout the U.S. and employ nearly 3,000 Associates who focus on producing and bringing to market fresh vegetable products, prepared salads and plant-rich meal solutions.</p><p>Groupe Bonduelle is a 170 year old French family-owned company that has been at the forefront of plant-rich food innovations since 1853. Our ready-to-use plant-rich food products are grown on 168,000 acres by our grower partners and marketed in nearly 100 countries. The company currently employees more than 11,000 Associates globally.</p><p><br/></p><p><strong>Position Summary:</strong></p><p>Join our team as a Demand Planning Manager with a primary focus on executing the Demand Review step within the Integrated Business Planning (IBP) process. As a pivotal member of our Finance team, you will play a crucial role in driving Bonduelle's financial activities, specifically contributing to the success of our emerging IBP process.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Spearhead and execute the Demand Review step of the IBP process, collaborating closely with Sales and Operational functions (Procurement, Manufacturing, Planning, Engineering, etc.).</li><li>Actively engage in the development of regular budgeting and forecasting financials, including long-term plan views, with a special emphasis on the demand perspective.</li><li>Scenario build to guide executive decision making, meticulously capturing risks and opportunities in the buy/make/move spectrum.</li><li>Establish and maintain the one source of truth for financial translation during the Demand Review, ensuring accuracy and coherence.</li><li>Identify potential financial deviations in the demand plan and formulate effective remedial actions, providing valuable insights for gap-closing strategies.</li><li>Challenge existing processes, foster innovation, and communicate proactively about risks and opportunities associated with demand planning.</li><li>Collaborate in the Master Business Review, contributing insights gained from the Demand Review step.</li></ul><p><br/></p><p><strong>Additionally:</strong></p><ul><li>Contribute to ad-hoc analyses and projects, focusing on optimizing the Demand Review process within the broader IBP framework.</li><li>Support environmental and social initiatives aligned with our 2025 corporate social responsibility and B Corp certification ambitions. This role presents a unique opportunity to lead and refine the Demand Review process within the IBP framework, making a significant impact on managing supply and demand at one of the world’s leading supplier of fresh cut salads, bowls and blends.</li></ul><p><br/></p><p><strong>Desired Qualifications:</strong></p><ul><li>Bachelor’s Degree with 5+ years of relevant experience. A part of your career has been in a position of Integrated Business Planning (IBP), ideally for an Fast Moving Consumer Goods (FMCG) environment.</li><li>Ability to develop solutions and implement action plans</li><li>Pragmatic, customer-centric, persuasive</li><li>Demonstrated knowledge working with multiple stakeholders while driving one common goal</li><li>Courage to make tough decisions, challenge current processes and to deliver difficult messages with professionalism</li><li>A passion for learning and a craving to work in a fun culture</li><li>Systems: Logility or similar Supply Chain system, JDE or similar ERP system experience. Tableau or similar reporting database experience.</li></ul><p><br/></p><p><br/></p><p>Bonduelle Fresh Americas does not require employees to be COVID-19 vaccinated and/or boostered at this time, but does require disclosure of vaccination status and supporting documents. Bonduelle Fresh Americas reserves the right to modify any internal policies, including safety policies, as needed and in compliance with all applicable laws.</p><p><em>Bonduelle Fresh Americas is proud to be an Equal Opportunity Employer. We believe in hiring individuals from diverse backgrounds and experiences to create a workforce that truly reflects our communities. All applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), age, sexual orientation, national origin, marital status, parental status, ancestry, disability, gender identity, veteran status, genetic information, other distinguishing characteristics of diversity and inclusion, or any other legally protected status. We are committed to providing reasonable accommodation to veterans and individuals with disabilities or special needs during the application process and employment. If you need assistance, please contact us at (626) 856-8686 or bfa-info@bonduelle.com</em></p>", "responsibilities": "Spearhead and execute the Demand Review step of the IBP process, collaborating closely with Sales and Operational functions (Procurement, Manufacturing, Planning, Engineering, etc.).\nActively engage in the development of regular budgeting and forecasting financials, including long-term plan views, with a special emphasis on the demand perspective.\nScenario build to guide executive decision making, meticulously capturing risks and opportunities in the buy/make/move spectrum.\nEstablish and maintain the one source of truth for financial translation during the Demand Review, ensuring accuracy and coherence.\nIdentify potential financial deviations in the demand plan and formulate effective remedial actions, providing valuable insights for gap-closing strategies.\nChallenge existing processes, foster innovation, and communicate proactively about risks and opportunities associated with demand planning.\nCollaborate in the Master Business Review, contributing insights gained from the Demand Review step.\nContribute to ad-hoc analyses and projects, focusing on optimizing the Demand Review process within the broader IBP framework.\nSupport environmental and social initiatives aligned with our 2025 corporate social responsibility and B Corp certification ambitions. This role presents a unique opportunity to lead and refine the Demand Review process within the IBP framework, making a significant impact on managing supply and demand at one of the world’s leading supplier of fresh cut salads, bowls and blends.", "qualifications": {"required": "Bachelor’s Degree with 5+ years of relevant experience. A part of your career has been in a position of Integrated Business Planning (IBP), ideally for an Fast Moving Consumer Goods (FMCG) environment.", "preferred": "Ability to develop solutions and implement action plans\nPragmatic, customer-centric, persuasive\nDemonstrated knowledge working with multiple stakeholders while driving one common goal\nCourage to make tough decisions, challenge current processes and to deliver difficult messages with professionalism\nA passion for learning and a craving to work in a fun culture\nSystems: Logility or similar Supply Chain system, JDE or similar ERP system experience. Tableau or similar reporting database experience."}, "skills": ["Integrated Business Planning", "Demand Planning", "Supply Chain", "Financial Forecasting", "Scenario Planning", "Risk Management", "Communication", "Collaboration", "Problem Solving", "Process Improvement", "Logility", "JDE", "Tableau"], "postedDate": "1 month ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3863253280"}