{"jobTitle": "Director of Development", "company": {"name": "Petersen Automotive Museum", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Other", "industry": "Museums, Historical Sites, and Zoos", "description": "<strong>Job Summary<br/><br/></strong>The Director of Development will serve as a fundraising partner to the Executive Director and COO and will be responsible for donor cultivation, solicitation, and relations. This is a key, high-profile position representing the Petersen Automotive Museum across the organization and to all internal and external stakeholders. The ideal candidate will have a solid understanding of executive administration, prior experience supporting a board of directors, and a passion for customer service. The ability to self-start, coupled with a natural ability to be flexible and handle anything that might come their way is a must. A strong commitment to continuous improvement and the ability to contribute to the overall success of the Museum is imperative.<br/><br/>The Director of Development is responsible for creating and implementing the comprehensive development strategy for the Petersen Automotive Museum, in partnership with the Executive Director and COO. The Development Director is the lead professional responsible for achieving the Museum’s fundraising goals and engaging donors in ongoing programs and activities. These efforts will include leveraging key relationships and contacts within and outside of the Museum’s network to ensure capital and operating fundraising goals are met and surpassed.<br/><br/><strong>Duties/Responsibilities<br/><br/></strong><ul><li>Supervision of the Development and Membership team</li><li>Setting and meeting aggressive fundraising goals</li><li>Managing meeting and appointment schedules, travel arrangements, correspondence, and various reporting requirements</li><li>Oversight and support of all administrative duties in the office to ensure the smooth operation of office needs including staff supervision and supply inventory</li><li>Designing, implementing and managing all fundraising activities including annual giving, endowment and capital campaigns, membership, special projects, and other related solicitations in coordination with the ED and COO</li><li>Developing and executing strategic plans for donor identification, cultivation, solicitation, and ongoing engagement, including personal engagement with major and mid-level prospects</li><li>Maintaining contact with and developing grant proposals for foundation, corporations and government funding sources</li><li>Developing a comprehensive planned giving program</li><li>Producing all development reports, including reports for the Executive Director, Board of Directors, and other agencies as requested</li><li>Assisting Board, ED &amp; COO with research and identification of potential new major donors and board members</li><li>Creating and/or supervising personnel and office systems to support all development projects and operations</li><li>Overseeing the management of membership and donor databases and all records, files, and gift processing</li><li>Ensuring all donors are kept informed about museum initiatives, activities, and events in coordination with the Marketing Dept</li><li>Organizing annual donor appreciation events</li><li>Collaborating with the Marketing department to develop a public relations plan and an advertising plan that promote the Museum’s fundraising goals</li><li>Working closely with the COO in the design and production of all major publications, including the Annual Report and digital marketing initiatives<br/><br/></li></ul><strong>Required Skills/Abilities<br/><br/></strong><ul><li>Ability to communicate a compelling case for donations to a charitable organization</li><li>A record of fundraising success for a single organization over 3 or more years</li><li>Proven success in designing and managing donor and/or member relation programs</li><li>Experience with developing and maintaining productive working relationships with board members and donors</li><li>Excellent verbal and written communication skills</li><li>Ability to work as a leader and as part of a team</li><li>In a fast-paced, ever-changing environment, must have the ability to effectively multi-task, pivot effectively between projects, maintain strong attention to detail, is goal oriented and able to meet deadlines<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><strong>Minimum Education (or substitute experience) required:<br/><br/></strong><ul><li>Bachelor’s degree in related areas. CFRE designation preferred.<br/><br/></li></ul><strong>Minimum Experience Required<br/><br/></strong><ul><li>5 years of experience in non-profit fundraising, including a track record of successful planning, implementing, follow-up and closing gifts</li></ul>", "postedDate": "5 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3863565809"}