{"jobTitle": "Data Analyst", "company": {"name": "V Technology Solutions LLC", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Information Technology", "industry": "Information Technology & Services", "description": "<strong>data analyst<br/><br/></strong><strong>Local Candidates<br/><br/></strong><strong>Must have tech: SQL, ETL, Data warehousing/ modelling, AWS<br/><br/></strong>Workspace: hybrid at Irvine, CA - 92697<br/><br/>client - will let u know<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Work with Business Analyst to design dimensional model and source to target (ETL) specifications documentation</li><li> Analyze and understand source data and business processes that may affect the model</li><li> Analysis of Source system data, including data profiling</li><li> Creates DDLs for creating/modifying database objects</li><li> Documents Source to Target ETL Specifications</li><li> Creates Technical specifications that show data flow process</li><li> Define and implement data integration strategies, best practices, and standards to ensure data quality, consistency, and integrity.</li><li> Design and development of ODS Unit test of all ETL development Peer review of ETL development Design and optimize views<br/><br/></li></ul><strong>Required<br/><br/></strong><strong>Experience Skillset Required: <br/><br/></strong><ul><li> In depth experience with SQL programming and relational database management systems such as Oracle, Microsoft SQL Server, or DB2</li><li> Experience with business intelligence technologies and tools, such as IBM Cognos, Business Objects, Oracle Business Intelligence (OBIEE), and Tableau</li><li> Expertise in data profiling/analysis Data modelling experience</li><li> Direct experience working with business and technical users on extracting data quality requirements Excellent problem-solving skills, critical thinking skills and attention to detail</li><li> Demonstrated ability to work with others from diverse backgrounds.</li><li> Demonstrated effective communication and interpersonal skills.</li><li> Demonstrated service orientation skills</li><li> Demonstrated ability to communicate technical information to technical and non-technical personnel at various levels in the organization</li><li> Strong organizational skills and Ability to manage multiple priorities and meet project deadlines</li><li> Thorough knowledge of data management systems, practices, and standards</li><li> Self-motivated and works independently and as part of a team</li><li> Ability to work in UCI Science library office (Local candidate) Monday through Friday during working hours<br/><br/></li></ul><strong>Preferred Experience<br/><br/></strong><ul><li> Experience in a higher education environment, especially working with student, employee and financial data Knowledge of and experience with standard data warehousing techniques, data modeling, star and snowflake schema design and implementation, and design patterns</li><li> Experience in IICS Direct experience implementing data lakes, data virtualization, and/or big data solutions</li><li> Experience working on agile development projects</li><li> Knowledge of FERPA, HIPAA and SB1386 Security laws and other legislation governing security of IT activity.</li><li> Knowledge of Tibco</li></ul>", "skills": ["SQL", "ETL", "Data warehousing", "Data modelling", "AWS", "IBM Cognos", "Business Objects", "Oracle Business Intelligence", "Tableau", "Data profiling", "Data analysis", "Data management", "Agile development", "FERPA", "HIPAA", "SB1386 Security laws", "Tibco"], "postedDate": "5 months ago", "url": "https://www.linkedin.com/jobs/view/3863399020"}