{"jobTitle": "Coordinator, Clinical Operations, Logistics", "company": {"name": "VARITE INC", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Health Care Provider", "industry": "Information Technology & Services", "description": "<strong>True Job Title: Coordinator, Clinical Operations, Logistics (Contractor)<br/></strong><strong>Location: Hybrid 3 days a week. 100% remote will be considered.<br/></strong> <br/><strong>Summary:<br/></strong>The Clinical Logistics Coordinator is responsible for investigational product cell journey logistics, chain of custody, and chain of identity. In so doing, this role collaborates with several cross functional stakeholders, including clinical trial personnel, Clinical Operations, Data Management, Clinical Development, Medical Affairs, Regulatory Affairs, Technical Operations, Manufacturing, MSAT, and Quality. This role is a part of the study management team and reports to the Clinical Operations Logistics Manager.<br/> <br/><strong>Responsibilities (include but are not limited to):</strong><ul><li>Arranges product cell journey logistics: all transport legs, customs, courier, and broker interactions</li><li>Communicates study enrollment requirements pertaining to the cell journey</li><li>Contributing member of Clinical Trial study teams</li><li>Drives the cell journey for assigned primary and backup studies</li><li>Engages Contract Research Organizations to facilitate the cell journey</li><li>Interacts with investigational site medical personnel</li><li>Maintains product chain of identity and chain of custody</li><li>Participates in 24/7 on-call response program</li><li>Provides training at study trial meetings as needed</li><li>Tracks and prepares cell journey information utilizing databases, spreadsheets, and other tools</li><li>Utilizes vendor/supplier systems to place relevant orders</li><li>Works cross-functionally with Technical Operations, Manufacturing, Quality and other depts to facilitate the clinical product cell journey</li><li>Arranges meetings, agendas, and minutes</li><li>Travel as needed</li><li>Other duties as assigned</li></ul> <br/><strong>Basic Qualifications:</strong><ul><li>4+ years of relevant clinical or logistics experience</li><li>2+ years of relevant clinical or logistics experience with a BS/BA</li><li>0 years of relevant clinical or logistics experience with a MS/MA</li></ul> <br/><strong>Preferred Qualifications:<br/></strong>• Detail oriented<br/>• Able to work independently and as part of a team<br/>• Excellent verbal and written communication<br/>• Experience with Agile change control management a plus<br/>• Experience with courier services<br/>• Experience with CRM systems: Salesforce, Oracle, SAP a plus<br/>• Experience with ERP systems: Oracle, SAP a plus<br/>• Familiar with domestic and international logistics/transport of biologic material (IATA, ICAO, ADR, DOT, WHO).<br/>• Knowledge of biological tissue transportation and logistics<br/> <br/><strong>Required Years of Experience:</strong> 2-5 years<br/> <br/><strong>Top 3 Required Skill Sets:</strong> Logistics background, clinical trial experience, ability to be on call when needed<br/> <br/><strong>Top 3 Nice to Have Skill Sets:</strong> Comparator drug sourcing, demand planning, IT experience<br/> <br/><strong>Unique Selling Point of this role:</strong> Ability to work with our clinical trial sites and manage patients cell journey for treatment.<br/> <br/><strong>Required Degree or Certification?</strong> College degree preferred<br/> <br/><strong>Any Disqualifiers?</strong> None at this time<br/>Disqualifiers? None at this time", "postedDate": "5 months ago", "skills": ["Logistics", "Clinical Trial", "On-Call"], "url": "https://www.linkedin.com/jobs/view/3863697235"}