{"jobTitle": "Head of Influencer & Social Strategy", "company": {"name": "Alo Yoga", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Other", "industry": "Retail Apparel and Fashion", "description": "<strong>WHY JOIN ALO?<br/><br/></strong>Mindful movement. It’s at the core of why we do what we do at Alo—it’s our calling. Because mindful movement in the studio leads to better living. It changes who yogis are off the mat, making their lives and their communities better. That’s the real meaning of studio-to-street: taking the consciousness from practice on the mat and putting it into practice in life.<br/><br/>Job Title: Head of Influencer and Social Strategy<br/><br/>Location: Beverly Hills<br/><br/>Company: Alo<br/><br/>Job Description:<br/><br/>As we continue to inspire mindful movement around the globe, we are seeking a dynamic and experienced Head of Brand Communications and Social Strategy to join our team. As a social-first company, there is an opportunity to play a critical role in the growth trajectory of the brand. Reporting directly to the SVP of Brand Marketing this role will be responsible for overseeing organic social media, public relations, and influencer marketing initiatives to drive brand awareness, engagement, and loyalty.<br/><br/>Responsibilities:<br/><br/><ul><li>Innovate and execute a distinct channel strategy that sets us apart, weaving together organic social media, public relations, and influencer marketing to elevate brand visibility, engagement, and conversion.</li><li>Lead the strategic planning and execution of channel-specific initiatives with a collective mindset, ensuring they resonate deeply with our brand values while driving toward shared objectives and key performance indicators.</li><li>Champion a culture of collaboration and growth within the brand communications and social strategy team, recognizing and nurturing the strengths of each individual to cultivate a winning environment where everyone thrives.</li><li>Define clear, ambitious goals and metrics for each channel and adapt strategies accordingly to maximize impact and return on investment.</li><li>Embrace our value of \"see the good in others\" by providing mentorship, support, and opportunities for professional development to empower team members to reach their full potential and contribute meaningfully to our shared success.</li><li>Stay ahead of the curve in our ever-evolving industry, harnessing emerging trends, technologies, and consumer insights to inform channel strategy and inspire innovation in content creation, distribution, and engagement.</li><li>Inspire creativity and excellence in all aspects of communication, setting a high standard for quality, authenticity, and impact that reflects our commitment to being different.</li><li>Cultivate strategic alliances and partnerships with external collaborators who share our values and vision, leveraging their expertise and influence to amplify our brand message and expand our reach to new and diverse audiences.<br/><br/></li></ul><strong>QUALIFICATIONS<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Communications, Public Relations, or related field. </li><li>10+ years of experience in brand communications, social media management, and/or public relations, with a proven track record of success in a fast-paced environment.</li><li>Strong leadership and managerial skills, with the ability to inspire and motivate a team towards achieving common goals.</li><li>Excellent written and verbal communication skills, with a keen eye for detail and creativity in storytelling.</li><li>Deep understanding of social media platforms, trends, and best practices, with experience in developing and executing successful social media campaigns.</li><li>Extensive knowledge of PR strategies and tactics, including media relations, press release writing, and crisis management.</li><li>Demonstrated experience in influencer marketing, including setting comprehensive strategies with clear KPIs for success. </li><li>Analytical mindset with proficiency in social media analytics tools and reporting metrics.</li><li>Proactive problem-solving abilities and the ability to thrive in a dynamic and evolving industry.</li><li>Approaches discussions and decision-making with humility, embracing diverse perspectives and remaining open-minded to robust opinions.</li><li>Passion for wellness and a genuine commitment to the brand's mission and values.<br/><br/></li></ul>Please review our company California Job Applicant Privacy Policy HERE.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3864586533"}