{"jobTitle": "Strategy and Operations Senior Associate", "company": {"name": "Google", "location": "Los Angeles, CA", "industry": "Information Services and Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "114,000.00/yr - 167,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>New York, NY, USA; Redwood City, CA, USA; Los Angeles, CA, USA; San Francisco, CA, USA; Mountain View, CA, USA; Chicago, IL, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>4 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 2 years of experience with an advanced degree.</li><li>2 years of experience working with executive stakeholders.</li><li>2 years of experience developing business strategies or managing cross-functional initiatives.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>2 years of experience generating insights from analysis on large data sets to drive business decisions.</li><li>Experience collaborating with multiple stakeholders across organizational boundaries.</li><li>Experience in advertising, consultative sales, business development, or a digital media environment for a complex organization.</li><li>Structured problem solving skills, combined with strong business acumen.</li><li>Excellent communication and presentation skills with the ability to take complex, ambiguous topics and turn them into compelling narratives for different audiences.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>The GCS Sales and Strategy teams provide business critical insights using analytics, ensure cross-functional alignment of goals and execution, help teams drive strategic partnerships and new initiatives forward, and drive sustainable business growth and product adoption. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives. Team members are experienced in business strategy and operations, analytical and strategic, yet highly pragmatic and results-oriented.<br/><br/>The US base salary range for this full-time position is $114,000-$167,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Draw interpretable insights from sophisticated business analyses and advanced modeling.</li><li>Design processes, tools, and operating cadences to achieve organizational outcomes.</li><li>Develop comprehensive sales, product or business strategies that solve complex business challenges and address the needs of customers and stakeholders across various functions to drive incremental growth.</li><li>Communicate data-driven recommendations to leadership and to the broader organization by preparing polished presentations and identifying key takeaways.</li><li>Define actionable plans and roadmaps and align cross-functional stakeholders to drive successful implementation of change initiatives.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Draw interpretable insights from sophisticated business analyses and advanced modeling.</li><li>Design processes, tools, and operating cadences to achieve organizational outcomes.</li><li>Develop comprehensive sales, product or business strategies that solve complex business challenges and address the needs of customers and stakeholders across various functions to drive incremental growth.</li><li>Communicate data-driven recommendations to leadership and to the broader organization by preparing polished presentations and identifying key takeaways.</li><li>Define actionable plans and roadmaps and align cross-functional stakeholders to drive successful implementation of change initiatives.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n4 years of experience in management consulting, sales operations, business strategy, investment banking, venture capital, private equity or corporate advisory, or 2 years of experience with an advanced degree.\n2 years of experience working with executive stakeholders.\n2 years of experience developing business strategies or managing cross-functional initiatives.", "preferred": "2 years of experience generating insights from analysis on large data sets to drive business decisions.\nExperience collaborating with multiple stakeholders across organizational boundaries.\nExperience in advertising, consultative sales, business development, or a digital media environment for a complex organization.\nStructured problem solving skills, combined with strong business acumen.\nExcellent communication and presentation skills with the ability to take complex, ambiguous topics and turn them into compelling narratives for different audiences."}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3864439872"}