{"jobTitle": "Director of  Operations", "company": {"name": "Scott Manufacturing Solutions, Inc.", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000 - $115,000", "currency": "yearly"}, "jobFunction": "Management and Manufacturing", "industry": "Electric Power Transmission, Control, and Distribution", "description": "At Scott Manufacturing Solutions, Inc., our strength is in efficiently delivering leading-edge products and exceptional customer support. We are proud to set the standard for success in our industry. To help us continue growing, we seek an experienced Director of Operations to join our highly skilled team. Our ideal candidate will have senior management experience in a progressive environment. Along with the ability to develop innovative solutions that push boundaries. This role requires outstanding organizational, communication, and leadership skills. The director of operations will work closely with executives to execute long-term plans that usher in new levels of productivity and success for the company.<br/><br/>Considering our employees are our most valued asset, we can guarantee that the development of your leadership skills will be exponential. Our employee-centric atmosphere allows your unique talents to thrive, resulting in job satisfaction and overall success for the company. You will ensure that the productivity of our daily operation is well-coordinated by managing its procedures, providing direction, and coaching with positive feedback.<br/><br/>Accountability, humility, motivation, and emotional intelligence are prime qualities to bring to the team. This role has a broad range of responsibilities requiring a thorough knowledge of various company processes. You will oversee the operations team and establish direct reports to improve efficiency and reduce costs as needed. An ideal applicant must be proficient and have the ability to construct a variety of operational projects. We require efficient execution of these strategies to meet the demands of our substantial growth.<br/><br/><strong>Position Summary<br/><br/></strong>The Director of Operations will ensure efficient workflows to maximize the company’s productivity and performance by managing and leading the departments that follow:<br/><br/><ul><li>Procurement</li><li>Warehouse and Materials Control</li><li>Production/Manufacturing</li><li>Planning</li><li>Quality Systems and Quality Control</li><li>Facilities and Maintenance</li><li>Other non-operations departmental interactions/dependencies<br/><br/></li></ul>Objectives of this role<br/><br/><ul><li>Collaborate with executive management in the execution of performance goals and long-term operational plans.</li><li>Analyze processes, collaborate interdepartmentally, and set strategic goals for efficiency and productivity.</li><li>Work with department managers in the development of budgetary plans.</li><li>Evaluate current operational processes and performance and suggest solutions for improvement wherever deemed necessary.</li><li>Build strong professional bonds both internally and externally.<br/><br/></li></ul><strong>A STATEMENT FROM SCOTT MANUFACTURING SOLUTIONS <br/><br/></strong><strong>HUMAN ASSETS DEPARTMENT<br/><br/></strong>Scott Manufacturing Solutions has partnered with E-Verify to verify work eligibility in the United States. E-Verify compares employee data from Form I-9 and Employment Eligibility Verification to records held by the DHS and SSA.<br/><br/><strong>WHAT IS E-VERIFY?<br/><br/></strong>E-Verify is an Internet-based system that compares information entered by an employer from an employee’s Form I-9, Employment Eligibility Verification, to records available to the U.S. Department of Homeland Security and the Social Security Administration to confirm employment eligibility.<br/><br/>E-Verify is administered by SSA and U.S. Citizenship and Immigration Services.<br/><br/>Compensation: $100,000 - $115,000 yearly", "postedDate": "5 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3864320801"}