{"jobTitle": "Store Manager", "company": {"name": "Buck Mason", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "75,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "Buck Mason is on the hunt for a Store Manager who lives and breathes our culture, customer experience, and lifestyle. If you're a born leader with a knack for driving business, fostering a killer team, and creating unforgettable experiences for our customers, we want you at the helm. Responsibilities:<br/><br/><ul><li>Embody the four pillars of a Buck Mason Leader: Business Creation, Adaptability, Merchandising &amp; Operations, and Focus &amp; Prioritization</li><li>Keep Buck Mason’s brand identity at the forefront, driving engagement, knowledge, and passion among your team</li><li>Set daily store goals and individual targets for each team member, keeping everyone focused and motivated</li><li>Be a shining example on the shop floor, acting as a brand ambassador and modeling Buck Mason leadership behaviors</li><li>Coach, mentor, and provide feedback to your team, ensuring every customer has an exceptional experience</li><li>Maintain a top-notch work environment, executing and maintaining Visual Merchandising guidelines with precision</li><li>Harness the power of digital assets to enhance the customer experience and drive sales</li><li>Foster talent retention and development, continuously elevating the capabilities of your team</li><li>Seek feedback from your team, peers, and superiors, always striving to improve and grow</li><li>Lead, inspire, and manage a high-performing, positive store team, driving excellence every step of the way<br/><br/><br/></li></ul>Who you are:<br/><br/><ul><li>Customer service is your middle name – you're all about creating memorable experiences for every shopper</li><li>You've got a keen eye for business, always staying ahead of the game and driving results</li><li>Clothing is your passion, and you bring a high-touch ethos to everything you do</li><li>Flexibility is your jam – you're ready to roll up your sleeves and do whatever it takes to make the store shine</li><li>Digitally savvy – you're comfortable navigating social media and e-commerce platforms with ease</li><li>Experience in Womenswear or Womenswear retail environments is a big plus – you know your stuff</li><li>You've got the chops for retail management, with a track record of success that speaks for itself<br/><br/><br/></li></ul>Founded in 2013 by Sasha Koehn and Erik Allen Ford, Buck Mason makes simplified clothing for the modern man and woman. At the heart of everything we do is the unclouded California ethos of quality, restraint, and integrity. We take iconic pieces and reconstruct them in hard-wearing fabrics, with timeless details, and the perfect fit. Our goal is to offer fashion that is less complicated, building pared-down essentials that live beyond a single season. With its corporate offices headquartered in Los Angeles, Buck Mason's retail footprint extends from sea to sea, through e-commerce and brick-and-mortar locations in Los Angeles, San Francisco, New York, Brooklyn, and more. Here at Buck Mason, we're all about transparency and fairness, especially when it comes to compensation. While the base salary range for this role is $75k-$95k, your total compensation package will include an annual bonus of no less than 2% of your store's net profit in addition to applicable bonuses.", "responsibilities": "Buck Mason is on the hunt for a Store Manager who lives and breathes our culture, customer experience, and lifestyle. If you're a born leader with a knack for driving business, fostering a killer team, and creating unforgettable experiences for our customers, we want you at the helm. Responsibilities:<br/><br/><ul><li>Embody the four pillars of a Buck Mason Leader: Business Creation, Adaptability, Merchandising &amp; Operations, and Focus &amp; Prioritization</li><li>Keep Buck Mason’s brand identity at the forefront, driving engagement, knowledge, and passion among your team</li><li>Set daily store goals and individual targets for each team member, keeping everyone focused and motivated</li><li>Be a shining example on the shop floor, acting as a brand ambassador and modeling Buck Mason leadership behaviors</li><li>Coach, mentor, and provide feedback to your team, ensuring every customer has an exceptional experience</li><li>Maintain a top-notch work environment, executing and maintaining Visual Merchandising guidelines with precision</li><li>Harness the power of digital assets to enhance the customer experience and drive sales</li><li>Foster talent retention and development, continuously elevating the capabilities of your team</li><li>Seek feedback from your team, peers, and superiors, always striving to improve and grow</li><li>Lead, inspire, and manage a high-performing, positive store team, driving excellence every step of the way<br/><br/><br/></li></ul>", "qualifications": {"required": "Customer service is your middle name – you're all about creating memorable experiences for every shopper<br/>You've got a keen eye for business, always staying ahead of the game and driving results<br/>Clothing is your passion, and you bring a high-touch ethos to everything you do<br/>Flexibility is your jam – you're ready to roll up your sleeves and do whatever it takes to make the store shine<br/>Digitally savvy – you're comfortable navigating social media and e-commerce platforms with ease<br/>Experience in Womenswear or Womenswear retail environments is a big plus – you know your stuff<br/>You've got the chops for retail management, with a track record of success that speaks for itself"}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3864582924"}