{"jobTitle": "Junior Project Coordinator", "company": {"name": "Clutch", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Remote", "jobType": "Contract", "employmentType": "Temp-to-perm", "experienceLevel": "Entry level", "salary": {"amount": "Up to $30/hourly", "currency": "USD"}, "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Clutch Creative is a rapidly growing staffing agency. We support our clients by identifying unreachable talent that helps their businesses grow. Our candidates work with us because they know we have the best opportunities available to them and will help them navigate their next career move. We care, we're honest, and we hustle—that's what makes us Clutch. Clutch is looking for a Junior Project Coordinator with agency experience for a client of ours.", "responsibilities": "Assist Project Managers in the planning, coordination, and execution of experiential marketing campaigns (think: pop-up shops, product launches, brand activations). Manage project timelines, budgets, and resources. Create and maintain project documentation (schedules, task lists, status reports). Facilitate communication between internal teams (creative, production, account management) and external vendors (fabricators, venues, etc.). Assist with logistics and travel arrangements for events. Prepare presentations and reports for clients. Conduct research and source materials as needed. Stay up-to-date on industry trends and best practices.", "qualifications": {"required": "Bachelor's degree in Marketing, Communications, Events Management, or a related field (or equivalent experience). Strong organizational, time management, and communication skills. Excellent attention to detail and ability to multi-task. Proficient in Microsoft Office Suite (Word, Excel, PowerPoint). Experience with project management tools (Asana, Trello, Basecamp) a plus. A passion for experiential marketing and the creative process.", "preferred": ""}, "skills": ["Organizational skills", "Time management", "Communication skills", "Attention to detail", "Microsoft Office Suite", "Project management tools"], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3864657492"}