{"jobTitle": "Assistant Project Manager", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Staffing and Recruiting", "description": "We have 300+ employees with presences throughout Southern/Northern California, and Hawaii. We've completed hundreds of commercial and industrial projects. No project is too small or big. We're seeking an experienced Assistant Project Manager to join our team.<br/><br/><strong>Position overview:</strong> The Assistant Project Manager will work with the Project Manager to coordinate the successful completion of projects. This will include overseeing multiple projects, creating project plans and budgets, and managing subcontractors.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Help create project plans, timelines, and budgets.</li><li>Oversee multiple concurrent projects.</li><li>Monitor progress and address any delays or issues.</li><li>Manage subcontractors and ensure quality of their work.</li><li>Communicate project updates to clients.</li><li>Keep accurate records of all project documents.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelors degree in Construction Management or a related field.</li><li>1-3 years of experience in a Project Engineer or APM role.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>PTO/Holidays</li><li>Comprehensive Healthcare Options</li><li>Potential for Bonuses<br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>kyle.kubo@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PV2-1793457L007 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Kyle Kubo - Recruiting Manager<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.<br/><br/>", "responsibilities": "Help create project plans, timelines, and budgets. Oversee multiple concurrent projects. Monitor progress and address any delays or issues. Manage subcontractors and ensure quality of their work. Communicate project updates to clients. Keep accurate records of all project documents.", "qualifications": {"required": "Bachelors degree in Construction Management or a related field. 1-3 years of experience in a Project Engineer or APM role.", "preferred": null}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": null, "benefits": "PTO/Holidays Comprehensive Healthcare Options Potential for Bonuses", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3866172991"}