{"jobTitle": "Fully Remote Sales Executive", "company": {"name": "Pierre Strand", "industry": "Internet Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Are you on the lookout for your next thrilling career opportunity in the world of sales? Look no further, as your journey brings you here. We are in pursuit of enthusiastic and driven individuals, just like you, to become integral members of our dynamic team as Remote Sales Executive. Prepare to unlock your full earning potential, as we stand by your side every step of the way, all while enjoying a rewarding and fulfilling career path.", "responsibilities": "Proactively identifying and engaging potential clients through various channels, Cultivating and nurturing strong relationships with existing clients, Mastering the understanding and presentation of our products and services to potential clients, Skillfully conveying the value proposition to potential customers, Achieving the closure of sales deals and exceeding monthly/quarterly sales targets, Maintaining meticulous records of sales activities and customer information.", "qualifications": {"required": "No prior sales experience is required; we offer comprehensive training to ensure you are fully prepared for success in your role.", "preferred": "Not specified"}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Bid farewell to income restrictions; our uncapped commission structure in this 1099 position allows you to reap the rewards of your hard work, Embrace the complete flexibility of remote work, adapting your work hours to your lifestyle, all from the comfort of your own home, No more cold calling; we provide access to the best leads allowing you to concentrate on closing deals and realizing your full potential.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3867747009"}