{"jobTitle": "Sr Analyst, People Analytics / Data: Workday matrix / composite reports (60%) / data visualization (40% / Power BI preferred)", "company": {"name": "KORE1", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "125,000.00/yr - $133,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "<strong>THIS JOB IS FULLY ONSITE IN IRVINE, CA.<br/><br/></strong>KORE1, a nationwide provider of staffing and recruiting solutions, has an immediate opening for a <strong>Sr Analyst, People Analytics / Data: Workday matrix / composite reports (60%) / data visualization (40% / Power BI preferred)<br/><br/></strong>The primary responsibility of the Sr. Analyst, People Analytics and Data is to provide analytical expertise identifying, evaluating, and developing strategic analytics for all people systems technology. They are responsible for building the story behind the data to turn into tactical results. The Sr Analyst will be required to use judgment to determine the most appropriate methods to extract and analyze company data and proposed strategic analysis which provides actionable intel for internal customers. Reporting to the People System Director, this role sits within the HRIS function and will be the go-to person for all People System reporting and data accuracy. In addition, is responsible to integrate for facilitating and working on projects.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Analyze people data to generate meaningful business insights for strategic analysis. </li><li>Identify/build tools to bring our workforce insights to our leaders and a wide audience to drive actions from people data and insights. </li><li>Use Data to help the company understand our internal workforce, our potential external future workforce and know how we can best manage our team members to drive real business results and value. </li><li>Produce and deliver standard (monthly, quarterly, and annual) and customized People reports. </li><li>Collaborates with systems team and develops the framework on how People data is structured and how it interacts with systems outside of the People team, while providing recommendations to improve data quality. </li><li>Works with various internal customers to adequately define their problems and document business requirements. These will be problems and questions that range from mundane to highly complex. </li><li>Understands the various types of company data and platforms, how it is created and the potential for bad data. </li><li>Develops effective and practical approaches to solving complex problems and takes a new perspective on existing solutions. </li><li>Documents requirements, approach, and assumptions. Performs gap analysis by comparing current state to future/desired state. </li><li>Develops departmental and executive level reports and presentations to communicate work status and results. </li><li>Partners with Data Warehouse team to understand how people data is being captured and used to present an accurate story for people data. </li><li>Partners and collaborates with all departments and all levels of management within the company and conducts themselves in a highly professional manner. </li><li>Will participate on larger projects representing people systems Data &amp; Analytics. May provide project coordination, and coordination of user acceptance testing, including Alphas, Betas, and full Deployment. </li><li>Other duties as assigned by Management. </li><li>Subject matter expert in development of reports and dashboards. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in business administration, Data Management, Statistics, Decision Science, or related field. In lieu of degree, +5 years of professional experience is required. </li><li>4-6 years of proven successful experience performing business analysis. </li><li>Minimum 5 years of experience in building and maintaining Advanced Matrix and composite reports and dashboards within Workday Report Writer and minimal intermittent level in core Workday architecture and configuration. (60% of time spent is Workday reporting) </li><ul><li>Prism Analytics is a plus. </li><li>Workday is used for payroll, time tracking, benefits, compensation / advanced compensation, and core HR. </li></ul><li>Configuration experience with a data visualization tool (for reporting) required. Power BI strongly preferred (40% of time spent is Power BI reporting) </li><li>Skills develop and maintaining SQL, Power BI reporting solutions for cross functional department usage and data management. </li><li>Excellent analytics ability with a focus on analyzing, interpreting, and extracting insights from large amounts of data, and developing recommendations &amp; improvement opportunities. </li><li>Proficient in process, system, and financial business analysis. </li><li>Familiarity with Robotic Process Automation (RPA) is helpful (will partner w/ our RPA person to automate things)</li><li>Advanced skills in Office 365. <br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Master's degree in business administration. </li><li>Advanced degree in mathematics, statistics, or a related quantitative field. </li><li>Familiarity with inferential statistics. </li><li>Certified Workday Reporting PRO. </li><li>Advanced Power BI skills. <br/><br/></li></ul><strong>Knowledge/Skills/Abilities<br/><br/></strong><ul><li>Excels at problem solving, probability and statistical analysis. </li><li>Ability to multi-task effectively without compromising the quality of the work. </li><li>Excellent communication and presentation skills. </li><li>Problem solving skills to gather &amp; analyze information to identify and resolve problems in a timely manner arrive at valid conclusions, recommendations, and plans of action. </li><li>Detail oriented, organized, process focused, problem solver, self-motivated, proactive, ambitious, customer service focused. </li><li>Must have ownership mentality and ability to work independently and as part of a team. </li><li>Ability to draw conclusions and make independent decisions with limited information. </li><li>Ability to respond to common inquiries from customers, staff, regulatory agencies, vendors, and other members of the business community. </li><li>Self-motivated, reliable individual capable of working independently as well as part of a team. </li><li>Project management knowledge, SDLC capabilities under SCRUM / Agile methodologies. <br/><br/></li></ul>Compensation depends on experience but is typically $125-133K plus 10% bonus.<br/><br/><strong>About Kore1<br/><br/></strong>Specializing in professional and technical recruiting, KORE1 is committed to supporting top IT, Engineering, Creative, Scientific, Accounting and Finance professionals in their career paths. We build deep relationships with leading companies, connecting them to exceptional talent every day. With extensive industry expertise and unmatched opportunities, our goal is to provide a unique experience for our contractors and consultants as they prepare for their next role. We are passionate about matching the right people with the right companies.<br/><br/><strong>Kore1 provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Kore1 complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Kore1 expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Kore1's employees to perform their job duties may result in discipline up to and including discharge.</strong>", "responsibilities": "Analyze people data to generate meaningful business insights for strategic analysis. \nIdentify/build tools to bring our workforce insights to our leaders and a wide audience to drive actions from people data and insights. \nUse Data to help the company understand our internal workforce, our potential external future workforce and know how we can best manage our team members to drive real business results and value. \nProduce and deliver standard (monthly, quarterly, and annual) and customized People reports. \nCollaborates with systems team and develops the framework on how People data is structured and how it interacts with systems outside of the People team, while providing recommendations to improve data quality. \nWorks with various internal customers to adequately define their problems and document business requirements. These will be problems and questions that range from mundane to highly complex. \nUnderstands the various types of company data and platforms, how it is created and the potential for bad data. \nDevelops effective and practical approaches to solving complex problems and takes a new perspective on existing solutions. \nDocuments requirements, approach, and assumptions. Performs gap analysis by comparing current state to future/desired state. \nDevelops departmental and executive level reports and presentations to communicate work status and results. \nPartners with Data Warehouse team to understand how people data is being captured and used to present an accurate story for people data. \nPartners and collaborates with all departments and all levels of management within the company and conducts themselves in a highly professional manner. \nWill participate on larger projects representing people systems Data & Analytics. May provide project coordination, and coordination of user acceptance testing, including Alphas, Betas, and full Deployment. \nOther duties as assigned by Management. \nSubject matter expert in development of reports and dashboards. ", "qualifications": {"required": "Bachelor's degree in business administration, Data Management, Statistics, Decision Science, or related field. In lieu of degree, +5 years of professional experience is required. \n4-6 years of proven successful experience performing business analysis. \nMinimum 5 years of experience in building and maintaining Advanced Matrix and composite reports and dashboards within Workday Report Writer and minimal intermittent level in core Workday architecture and configuration. (60% of time spent is Workday reporting) \nPrism Analytics is a plus. \nWorkday is used for payroll, time tracking, benefits, compensation / advanced compensation, and core HR. \nConfiguration experience with a data visualization tool (for reporting) required. Power BI strongly preferred (40% of time spent is Power BI reporting) \nSkills develop and maintaining SQL, Power BI reporting solutions for cross functional department usage and data management. \nExcellent analytics ability with a focus on analyzing, interpreting, and extracting insights from large amounts of data, and developing recommendations & improvement opportunities. \nProficient in process, system, and financial business analysis. \nFamiliarity with Robotic Process Automation (RPA) is helpful (will partner w/ our RPA person to automate things)\nAdvanced skills in Office 365. ", "preferred": "Master's degree in business administration. \nAdvanced degree in mathematics, statistics, or a related quantitative field. \nFamiliarity with inferential statistics. \nCertified Workday Reporting PRO. \nAdvanced Power BI skills. "}, "skills": ["Workday", "Power BI", "SQL", "Business Analysis", "Data Analysis", "Data Visualization", "Reporting", "Problem Solving", "Communication", "Presentation Skills", "Process Improvement", "Project Management", "Agile Methodologies", "Office 365", "Robotic Process Automation (RPA)"], "postedDate": "5 months ago", "benefits": "Compensation depends on experience but is typically $125-133K plus 10% bonus.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3869977936"}