{"jobTitle": "RN Manager - Operating Room - Full Time, Day Shift", "company": {"name": "Veracity Software Inc", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Information Technology & Services", "description": "Santa Monica, California - Full time onsite<br/><br/>Under the supervision of the Director of Surgical Services, the Manager Surgical Services is accountable for managing and coordinating quality patient care in a cost-effective manner, complying with patient care standards and job-specific performance standards through observation of clinical practice and implementation of quality assurance. Supervises operating room clinical staff. Manages the professional nursing care for patients in Surgical and procedurals areas. Assesses, plans, evaluates and documents the Nursing process in the assigned unit as needed. Functions as a resource person with primary responsibility for staff's performance and development. Demonstrates behavior practices that reflect the mission and vision of our sponsors, Swedish Edmonds and our Standards of Conduct and Civility in the workplace guidelines. Under the supervision of the Director of Surgical Services, the Manager Surgical Services is accountable for managing and coordinating quality patient care in a cost-effective manner, complying with patient care standards and job-specific performance standards through observation of clinical practice and implementation of quality assurance. Supervises operating room clinical staff. Manages the professional nursing care for patients in Surgical and procedurals areas. Assesses, plans, evaluates and documents the Nursing process in the assigned unit as needed. Functions as a resource person with primary responsibility for staff's performance and development. Demonstrates behavior practices that reflect the mission and vision of our sponsors, Swedish Edmonds and our Standards of Conduct and Civility in the workplace guidelines.<br/><br/>Providence caregivers are not simply valued - they're invaluable. Join our team at Saint Johns Health Center and thrive in our culture of patient-focused, whole-person care built on understanding, commitment, and mutual respect. Your voice matters here, because we know that to inspire and retain the best people, we must empower them.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>Bachelor's Degree in Nursing</li><li>California Registered Nurse License upon hire</li><li>National Provider BLS - American Heart Association upon hire</li><li>3 years of progressively responsible nursing management experience (leadership experience such as Charge Nurse or Nursing Supervisor in an acute care hospital)<br/><br/></li></ul><strong>Preferred Qualification:<br/><br/></strong><ul><li>CNOR and/or CPAN certification upon hire<br/><br/></li></ul><strong>SKILLS AND CERTIFICATIONS <br/><br/></strong><ul><li>Bachelor's Degree in Nursing</li><li>California Registered Nurse License upon hire.</li><li>National Provider BLS - American Heart Association upon hire.</li><li>3 years of progressively responsible nursing management experience (leadership experience such as Ch</li></ul>", "postedDate": "4 months ago", "skills": ["Nursing", "Management", "BLS", "CNOR", "CPAN"], "url": "https://www.linkedin.com/jobs/view/3870773046"}