{"jobTitle": "Retail Supervisor - Glendale Galleria, 6538, Glendale, CA", "company": {"name": "adidas", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "21.01 - 27.32", "currency": "USD"}, "jobFunction": "Sales and Customer Service", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "description": "At adidas we have been challenging the status quo for over 70 years and we’re not done yet.\n\nWe are calling all Supervisors who don’t accept what “was” or what “is,” but those who want to create what will be, and who share our desire to make a difference. We believe sport has the power to change lives. To bring this mission to life we foster a culture centered on creativity, confidence, and collaboration, and while we will never rest on our laurels, we are humbled that this has allowed us to be recognized as one of the “world’s most attractive employers.”\n\nWe also understand that the future runs on diverse and fresh perspectives. True to this spirit, we believe in assembling talented teams from far and wide and unite by a common goal: to be the best sports company in the world.\n\nAbout\n\nWe could list tired, old bullet points about supervisor tasks but we’re confident you already know that. Here’s a bit about the kind of Supervisors we are looking for:\n\nCreators- If you want to build a tomorrow better than the day that came before, you’re a creator. Creators find inspiration in unlikely places, look at the world in their own unique way, are confident and have an uncanny ability to connect dots that others just don’t see.\n\nConfidence- Use your retail experience to exceed customer expectations and help guide store associates. Create an emotional connection with every customer by being a passionate and enthusiastic adidas Brand ambassador.\n\nCollaborator – You thrive on building relationships and working with your team.\n\nReady to apply? Here’s what you need to know:\n\n<ul><li> Availability must be flexible and include evenings and weekends.</li><li> Must possess and consistently exhibit the competencies relative to the position.</li><li> Skilled in operating personal computers, POS systems, and various software packages including MS office.</li><li> Ability to learn and adapt quickly in a fast-paced environment.</li><li> Strong interpersonal and communication skills including the ability to lead discussions in diverse groups of varying size.</li><li> Ability to operate independently and with discretion and work effectively under pressure.</li><li> Demonstrates an inspirational attitude that contributes to a positive team environment.</li><li> Ability to build and maintain effective working relationships with team members along with willingness to set and maintain high standards of performance.</li><li> Well developed ability to speak, read, comprehend, and write English</li><li> Ability to maintain reliable and consistent attendance and punctuality.</li><li> While performing the duties of this job, the employee is occasionally exposed to outside weather conditions. The noise level in the work environment is usually moderate.</li><li> While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device.</li><li> The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.</li><li> Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and ability to adjust focus.</li><li> Must be 18 years or older.</li><li> High school diploma or general education degree (GED)</li><li> Minimum 12 months experience working in a retail environment.</li><li> Advanced selling experience and comprehensive product, retail and industry understanding.<br/><br/></li></ul>Why adidas? Here’s just some of the rewards:\n\n<ul><li>Diversity, Equity, and Inclusion at adidas means championing individual uniqueness and cultivating a culture of belonging in which everyone can create at their best.  We embrace diverse backgrounds, experiences, and perspectives and seek to create a workforce that reflects our consumers and communities. </li><li>adidas offers robust and progressive medical, including HSA (Health Savings Account) with employer funding or FSA (Flexible Spending Account) options, dental, vision, prescription drug coverage, adoption, with surrogate and fertility support, short and long-term disability, and basic life and AD&amp;D insurance, which can be supplemented with employee-paid coverage. Employees are able to enroll in adidas’ 401k plan and Stock Purchase Plan with employer match. Full-time employees are eligible for education assistance and generous Leave policies including 12 weeks of paid parental leave. </li><li>Employees are eligible to earn monthly and quarterly incentives. Employees accrue prorated flexible time off in the amount .3512 hours per day that increases with years of service, seven paid holidays throughout the calendar year and Service Time Off during milestone years. </li><li>The anticipated low and high end of the base pay range for this position is $22.00 - $28.60. Actual salary will be based on various factors, such as a candidate’s experience, qualifications, skills and competencies, proficiency for the role. </li><li>Though our teammates hail from all corners of the world, our working language is English. <br/><br/></li></ul>adidas participates in E-Verify. For more information, visit https://www.uscis.gov/e-verify.\n\nThe anticipated low and high end of the base pay range for this position is $21.01 - $27.32. Actual salary will be based on various factors, such as a candidate’s experience, qualifications, skills and competencies, and proficiency for the role.", "responsibilities": "Creators- If you want to build a tomorrow better than the day that came before, you’re a creator. Creators find inspiration in unlikely places, look at the world in their own unique way, are confident and have an uncanny ability to connect dots that others just don’t see.\n\nConfidence- Use your retail experience to exceed customer expectations and help guide store associates. Create an emotional connection with every customer by being a passionate and enthusiastic adidas Brand ambassador.\n\nCollaborator – You thrive on building relationships and working with your team.", "qualifications": {"required": "Availability must be flexible and include evenings and weekends.\nMust possess and consistently exhibit the competencies relative to the position.\nSkilled in operating personal computers, POS systems, and various software packages including MS office.\nAbility to learn and adapt quickly in a fast-paced environment.\nStrong interpersonal and communication skills including the ability to lead discussions in diverse groups of varying size.\nAbility to operate independently and with discretion and work effectively under pressure.\nDemonstrates an inspirational attitude that contributes to a positive team environment.\nAbility to build and maintain effective working relationships with team members along with willingness to set and maintain high standards of performance.\nWell developed ability to speak, read, comprehend, and write English\nAbility to maintain reliable and consistent attendance and punctuality.\nWhile performing the duties of this job, the employee is occasionally exposed to outside weather conditions. The noise level in the work environment is usually moderate.\nWhile performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device.\nThe employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.\nSpecific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and ability to adjust focus.\nMust be 18 years or older.\nHigh school diploma or general education degree (GED)\nMinimum 12 months experience working in a retail environment.\nAdvanced selling experience and comprehensive product, retail and industry understanding.", "preferred": ""}, "skills": ["MS Office", "POS Systems", "Communication", "Leadership", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Diversity, Equity, and Inclusion at adidas means championing individual uniqueness and cultivating a culture of belonging in which everyone can create at their best.  We embrace diverse backgrounds, experiences, and perspectives and seek to create a workforce that reflects our consumers and communities. \nadidas offers robust and progressive medical, including HSA (Health Savings Account) with employer funding or FSA (Flexible Spending Account) options, dental, vision, prescription drug coverage, adoption, with surrogate and fertility support, short and long-term disability, and basic life and AD&amp;D insurance, which can be supplemented with employee-paid coverage. Employees are able to enroll in adidas’ 401k plan and Stock Purchase Plan with employer match. Full-time employees are eligible for education assistance and generous Leave policies including 12 weeks of paid parental leave. \nEmployees are eligible to earn monthly and quarterly incentives. Employees accrue prorated flexible time off in the amount .3512 hours per day that increases with years of service, seven paid holidays throughout the calendar year and Service Time Off during milestone years.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3870280472"}