{"jobTitle": "Sr Supply Chain Analyst", "company": {"name": "Intellectt Inc", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Hello Everyone.<br/><br/>Greetings of the day.<br/><br/>This is Vydehi from Intellectt Inc. We currently have an opening for a <strong>Sr Analyst, Supply Chain</strong> with one of our medical device clients. If you or anyone you know is interested in this opportunity, please feel free to send your updated resume to vydehi@intellectt.com or reach out to me directly at +1 732 355 7412.<br/><br/>Role: <strong>Sr Analyst, Supply Chain<br/><br/></strong>Location: <strong>Irvine, CA <br/><br/></strong>Duration: <strong>9 Months <br/><br/></strong><strong>Space Designation: Flex = no dedicated workspace, worker onsite as needed <br/><br/></strong><strong>Job Description<br/><br/></strong>The main function of a supply chain analyst is to assess and ensure the compliance of Client, its Vendors and entities of Client with all government import or export laws within assigned countries and regions.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Execute processes and procedures (e.g., SOPs, work instructions) and may provide recommendations for updates for applicable Supply Chain functions</li><li>Collaborate with departments (such as, clinical, sales, marketing, legal, etc.) within Client in order to assess needs and perform actions required, across the entire supply chain continuum (e.g., plan, source, make and deliver) seeking to manage product flow including issues with limited scope</li><li>Assess global vendors to ensure cost, quality, delivery, technical, and service capabilities to meet Client requirements in collaboration with team members; identify and resolve supply chain issues</li><li>Perform routine analysis to improve supply chain operations</li><li>Execute supply chain related projects (e.g., NPD introductions)</li><li>Other incidental duties assigned by Leadership<br/><br/></li></ul><strong>Additional Skills<br/><br/></strong><ul><li>Good computer skills including Microsoft Office Suite, Global Supply Chain, and Quality systems (e.g., JDE) preferred</li><li>Good written and verbal communication skills and interpersonal relationship skills including negotiating and relationship management skills</li><li>Ability to develop compliance processes and procedures</li><li>Good problem-solving and critical thinking skills</li><li>Good knowledge and understanding of Client policies, procedures and guidelines relevant to local and/or global supply chain including FDA and ISO laws and regulations applicable to medical device industry</li><li>Good problem-solving skills</li><li>Strict attention to detail</li><li>Ability to interact professionally with all organizational levels</li><li>Ability to manage competing priorities in a fast paced environment</li><li>Must be able to work in a team environment, including immediate supervisor, other team members in the section or group, and vendors/suppliers</li><li>Adhere to all EHS rules and requirements and take adequate control measures in preventing injuries to themselves and others as well as to the protection of environment and prevention of pollution under their span of influence/control<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor's Degree in Business or related field preferred</li><li>5-7 years of experience required</li></ul>", "responsibilities": "The main function of a supply chain analyst is to assess and ensure the compliance of Client, its Vendors and entities of Client with all government import or export laws within assigned countries and regions.", "qualifications": {"required": "5-7 years of experience required", "preferred": "Bachelor's Degree in Business or related field preferred"}, "skills": ["Microsoft Office Suite", "Global Supply Chain", "Quality systems", "FDA", "ISO"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3871185496"}