{"jobTitle": "Clinic Scheduler", "company": {"name": "Integrated Resources, Inc ( IRI )", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Staffing and Recruiting", "description": "\"The Front Office Assistant performs a variety of clerical duties and front office operations in support of the patient care activities ensuring even patient flow and continuous communication within the department, referring physician offices and organization staff. Interacts with patients, their family members or surrogate decision makers, and the public courteously and according to established standards. Greets visitors and answers telephones. May collect Copays, close the Cash Drawer and prepare Month End deposits. Collects initial demographic and clinical patient information and accurately enters into the medical record.  Compiles and prepares charts.  Assists with coordination and execution of patient scheduling including confirmations, cancellations and rescheduling. Follows through with prompt communication of schedule changes to all appropriate locations and individuals including clinical staff/Supervisors. Maintains accurate information and utilizes various software, including department specific programs, to schedule, enter charges, find and scan documents, and accurately enter patient information. Ensures the patient chart has all the required paperwork prior to the patient’s procedure.  As directed by medical staff orders patient tests to be performed as needed during patient stay.<br/>    The position may work in various Departments as needed. Assist clinical staff as needed with patients and family members. Always maintains patient confidentiality. Participates in the continuous quality improvement process. Performs other duties as assigned. \"<br/> <br/>  Knowledge of Microsoft Office Suite, including Outlook, Word, Excel, required", "postedDate": "5 months ago", "url": "https://www.linkedin.com/jobs/view/3871612365"}