{"jobTitle": "Vice President, Merchandising", "company": {"name": "FIGS", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "192,500.00/yr - 275,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "We are looking for a talented Vice President, Merchandising with a proven track record of driving results to lead our merchandising strategy and execution on a global scale. This leader will be pivotal in shaping our product architecture, assortment and line plans that are deeply rooted in the needs of our Awesome Humans. As a critical member of the product team, the Vice President, Merchandising will work closely with cross-functional teams to drive brand growth and profitability while ensuring our product portfolio aligns with our brand values. They will also lead an incredible Merchandising team across e-commerce, stores, International and Teams.<br/><br/><strong>What You’ll Do:<br/><br/></strong><ul><li>Merchandising Strategy: Develop and execute a comprehensive global merchandising strategy that aligns with FIGS’ brand, longer-term growth strategies, and target markets. Own the product architecture, including the lifecycle and the seasonal line plans, that is maniacally focused on the needs of healthcare professionals.</li><li>Long-Term Product Architecture: Own the forward-looking product architecture strategy that outlines the evolution of our product offerings over multiple years. Collaborate with Product Creation, Brand &amp; CX teams to ensure that the product architecture aligns with market trends, innovation, and customer preferences.</li><li>Product Lifecycle Planning: Design a product lifecycle management strategy that maximizes the lifespan and profitability of each product. This includes planning for product launches, growth phases, and eventual discontinuation. Partner with planning to minimize excess inventory and markdowns through effective end-of-life product strategies.</li><li>Product Seasonal Life Planning: In partnership with Design, create a comprehensive seasonal life cycle plan for products, outlining the product assortment, launches, and promotions throughout the year. </li><li>Product Assortment: Curate and manage the product assortment, ensuring it meets HCP demands and trends. Continuously analyze market trends and customer feedback to make data-driven and insights-informed assortment decisions.</li><li>Pricing Strategy: Develop and implement pricing strategies that optimize margins while remaining competitive. Monitor and adjust pricing strategies based on market dynamics and customer behavior.</li><li>Merchandising Planning: Own selecting, managing, and pricing products in a manner that brings in maximum returns on investment, value addition to the brand name by satisfying the consumer needs while avoiding the creation of excess inventory. Moreover, merchandise planning is about striving to make the right product available, at the right time, in the right place, in the right quantities, and at the right price. </li><li>Market Research and Competitive Analysis: Continuously conduct market research and competitive analysis to identify gaps and opportunities in the product portfolio. Stay informed about emerging trends and HCP preferences to inform product architecture and lifecycle planning. Utilize data and analytics to make informed decisions, track performance metrics, and identify opportunities for improvement.</li><li>Team Leadership: Lead and inspire a high-performing merchandising team, providing guidance, coaching, and development opportunities.</li><li>Cross-functional Collaboration: Closely partner with product creation, marketing, operations, finance, and other departments to align merchandising efforts with overall business strategies. Ensure seamless communication and cooperation across teams.<br/><br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Bachelor's degree in business, merchandising, or a related field; MBA preferred.</li><li>Proven experience (15+ years) in merchandising leadership roles </li><li>Experience working within retail stores, e-commerce, and DTC channels</li><li>Strategic thinker with a track record of driving business growth through merchandising strategies.</li><li>Passion for the DTC industry with and a deep understanding of customer preferences and trends.</li><li>Exceptional analytical and problem-solving skills.</li><li>Excellent leadership and team management abilities.</li><li>Demonstrated ability to position yourself as a collaborative and trusted business partner. Ability to establish strong relationships at all levels throughout the organization and cross-functionally.<br/><br/><br/></li></ul><strong>FIGS Compensation And Benefits<br/><br/></strong><em>Pay Range<br/><br/></em><ul><li>At FIGS, your base salary is one part of your total compensation package. This role's base salary range is between $192,500 and $275,000. Actual base salary is determined based on a number of factors, including but not limited to your relevant skills, qualifications, and years of experience. <br/><br/><br/></li></ul><strong>Additional Compensation And Benefits<br/><br/></strong><li>Equity: All FIGS employees have the opportunity to own shares of FIGS stock through our new-hire equity program. Additionally, FIGS provides a discount when purchasing FIGS stock voluntarily through our FIGS Employee Stock Purchase Plan </li><li>Annual bonus: This position is eligible to participate in the FIGS annual bonus program</li><li>Other compensation and benefits offered include: </li><ul><li>Comprehensive benefits and perks package focused on your well-being, including premium medical, dental and vision coverage, and full access to wellness services through Breethe and Classpass. 100% FIGS-sponsored life insurance and disability insurance </li><li>Amazing 401(k) program, with a company match up to the first 6% of your contribution</li><li>Generous paid time off - We have 12 company holidays. For salaried team members, we offer flexible vacation. For our hourly team members, we offer up to 3 weeks of accrued vacation</li><li>Meaningful time away for baby bonding, including parental leave, new parent care meals, and a transition back to work for primary caregivers</li><li>FIGS sponsored Uber Eats voucher for in-office weeks</li><li>Personalized discount code for 50% off all FIGS products, along with a separate code to share with family and friends to enjoy a 25% discount site-wide</li><li>Access to FIGS Vet, Discounted Pet Daycare, Discounted Pet Insurance, and so much more…</li><li>Benefits eligibility is determined by hour requirements and length of service <br/><br/><br/></li></ul><strong>A Little Bit About Us…<br/><br/></strong>FIGS, Inc. is a founder-led, direct-to-consumer healthcare apparel and lifestyle brand that seeks to celebrate, empower and serve current and future generations of healthcare professionals. We redefine what scrubs are by creating technically advanced apparel and products that feature an unmatched combination of comfort, durability, function and style, all at an affordable price. With the largest DTC platform in healthcare apparel, we sell our products to a rapidly growing community of loyal customers. Through these customer relationships, FIGS has built a community and lifestyle around a profession, revolutionizing the large and fragmented healthcare apparel market and becoming the industry’s category-defining healthcare apparel and lifestyle brand.<br/><br/>Our Threads for Threads initiative is integral to our mission to improve the lives of healthcare professionals on a global scale. Founded alongside FIGS in 2013, Threads for Threads donates scrubs to healthcare professionals working in resource-poor countries around the world.<br/><br/>For information about how we process information in connection with your application, view our Employee &amp; Applicant Privacy Policy linked in the footer below.<br/><br/>", "responsibilities": "Merchandising Strategy: Develop and execute a comprehensive global merchandising strategy that aligns with FIGS’ brand, longer-term growth strategies, and target markets. Own the product architecture, including the lifecycle and the seasonal line plans, that is maniacally focused on the needs of healthcare professionals.\nLong-Term Product Architecture: Own the forward-looking product architecture strategy that outlines the evolution of our product offerings over multiple years. Collaborate with Product Creation, Brand &amp; CX teams to ensure that the product architecture aligns with market trends, innovation, and customer preferences.\nProduct Lifecycle Planning: Design a product lifecycle management strategy that maximizes the lifespan and profitability of each product. This includes planning for product launches, growth phases, and eventual discontinuation. Partner with planning to minimize excess inventory and markdowns through effective end-of-life product strategies.\nProduct Seasonal Life Planning: In partnership with Design, create a comprehensive seasonal life cycle plan for products, outlining the product assortment, launches, and promotions throughout the year. \nProduct Assortment: Curate and manage the product assortment, ensuring it meets HCP demands and trends. Continuously analyze market trends and customer feedback to make data-driven and insights-informed assortment decisions.\nPricing Strategy: Develop and implement pricing strategies that optimize margins while remaining competitive. Monitor and adjust pricing strategies based on market dynamics and customer behavior.\nMerchandising Planning: Own selecting, managing, and pricing products in a manner that brings in maximum returns on investment, value addition to the brand name by satisfying the consumer needs while avoiding the creation of excess inventory. Moreover, merchandise planning is about striving to make the right product available, at the right time, in the right place, in the right quantities, and at the right price. \nMarket Research and Competitive Analysis: Continuously conduct market research and competitive analysis to identify gaps and opportunities in the product portfolio. Stay informed about emerging trends and HCP preferences to inform product architecture and lifecycle planning. Utilize data and analytics to make informed decisions, track performance metrics, and identify opportunities for improvement.\nTeam Leadership: Lead and inspire a high-performing merchandising team, providing guidance, coaching, and development opportunities.\nCross-functional Collaboration: Closely partner with product creation, marketing, operations, finance, and other departments to align merchandising efforts with overall business strategies. Ensure seamless communication and cooperation across teams.", "qualifications": {"required": "Bachelor's degree in business, merchandising, or a related field; MBA preferred.\nProven experience (15+ years) in merchandising leadership roles \nExperience working within retail stores, e-commerce, and DTC channels\nStrategic thinker with a track record of driving business growth through merchandising strategies.\nPassion for the DTC industry with and a deep understanding of customer preferences and trends.\nExceptional analytical and problem-solving skills.\nExcellent leadership and team management abilities.\nDemonstrated ability to position yourself as a collaborative and trusted business partner. Ability to establish strong relationships at all levels throughout the organization and cross-functionally.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Equity: All FIGS employees have the opportunity to own shares of FIGS stock through our new-hire equity program. Additionally, FIGS provides a discount when purchasing FIGS stock voluntarily through our FIGS Employee Stock Purchase Plan \nAnnual bonus: This position is eligible to participate in the FIGS annual bonus program\nOther compensation and benefits offered include: \nComprehensive benefits and perks package focused on your well-being, including premium medical, dental and vision coverage, and full access to wellness services through Breethe and Classpass. 100% FIGS-sponsored life insurance and disability insurance \nAmazing 401(k) program, with a company match up to the first 6% of your contribution\nGenerous paid time off - We have 12 company holidays. For salaried team members, we offer flexible vacation. For our hourly team members, we offer up to 3 weeks of accrued vacation\nMeaningful time away for baby bonding, including parental leave, new parent care meals, and a transition back to work for primary caregivers\nFIGS sponsored Uber Eats voucher for in-office weeks\nPersonalized discount code for 50% off all FIGS products, along with a separate code to share with family and friends to enjoy a 25% discount site-wide\nAccess to FIGS Vet, Discounted Pet Daycare, Discounted Pet Insurance, and so much more…\nBenefits eligibility is determined by hour requirements and length of service", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3872220734"}