{"jobTitle": "Senior Relatioship Manager", "company": {"name": "Avior Executive Search, Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Business Development and Sales", "industry": "Fundraising, Law Practice, and Sports Teams and Clubs", "description": "<strong>Senior Relationship Manager<br/><br/></strong><strong>Nationwide opportunities <br/><br/></strong>New York, Philadelphia, Washington, Boston, Atlanta, Miami, Cleveland, Minneapolis, Dallas, Denver, Houston, Los Angeles, Nashville, San Diego &amp; San Francisco, Seattle<br/><br/>Our client is a boutique culture driven investment management firm with over $600 billion in AUM. The firm has evolved into an organization which ranks among the most prominent investment firms in the world. The value proposition for the client is quite simple. Taking care of each client’s individual needs within a local market with the best financial resources available globally.<br/><br/><strong>Responsibilities<br/><br/></strong>The principal role of the Senior Relationship Manager is to develop new clients by cultivating their personal and professional networks and leveraging relationships with centers of influence (COI’s). In addition, the position also is responsible for maintaining close, ongoing relationships with existing clients.<br/><br/>The SRM works closely with HNW/UHNW clients with complex investment needs. The SRM partners with the internal planning and investment team to do a detailed needs analysis that delves into client’s values, legacy, and philanthropic goals. The answers, which often differ across generations, allow the SRM to work with clients on implementing investment strategies tied to these objectives and help clients cultivate the next generation as stewards of family wealth.<br/><br/><strong>Candidate Profile<br/><br/></strong>The Senior Relationship Manager profile are as varied and diverse as the clients in which they serve. Most successful advisors tend to focus their practices around their passions and as a result work with entrepreneurs, business owners, nonprofit organizations, professional athletes, global families, artists, and collectors.<br/><br/><ul><li> An existing network that can be cultivated and expanded within the community</li><li> Proven ability to build and maintain relationships with centers of influence such as attorneys, accountants, and business advisors</li><li> Experience advising and being regarded as a trusted advisor, not only with financial decisions but for meaningful life and business decisions</li><li> Comfortable interacting with individuals of significant wealth</li><li> Personal integrity that is beyond reproach</li><li> Strong academic credentials</li><li> A minimum of seven years of relevant work experience in finance, legal/trust, real estate, philanthropy, fundraising, auction/fine art, entertainment, sales, entrepreneurship, or private wealth management</li></ul>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3873357809"}