{"jobTitle": "Production Supervisor, Plating Department, 1st Shift", "company": {"name": "Brasstech, Inc.", "industry": "Manufacturing", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,500.00 - $107,690.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "The Supervisor is responsible for the supervision of the Plating department work area, including the use of equipment and safety. In partnership with other company Supervisors, this position will develop and execute department goals and objectives as they relate to safety, production, quality, shipping and receiving within the Finishing Process. Supervises all functions of the work area including safety and training.", "responsibilities": "Manages hourly workforce in designated department and workflow of production lines. Schedules production lines, maintains and improves productivity. Maintains accurate computerized inventory control and cycle counts. Develops and maintains performance measurements and work schedules. Provides training to direct reports in the areas of production, material handling, equipment, safety and hazardous materials. Sorts and disposes of non-conforming materials in accordance with established procedures. Maintains the production area in good housekeeping order according to OSHA guidelines. Adheres to and promotes all company safety rules and requirements. Oversees the maintenance of chemical process tanks to obtain high quality results. Oversees the finishing process, which includes electro plating, antique finishes and coating process. Performs other duties as required.", "qualifications": {"required": "HS Diploma or equivalent is required. 1-2 years supervisory experience in a manufacturing environment. 1-2 years experience in electro and oxide plating. 1-2 years experience in coating process.", "preferred": "Bilingual preferred – English and Spanish (reading, writing, verbal)"}, "skills": ["Ability to plan, organize and direct production workflow in finishing process", "Ability to communicate effectively", "Written and verbal communication skills", "Ability to lead a team", "Ability to execute math equations", "Proven experience in the finishing process (antique finishes, electro plating, coating)", "Exposure to interacting with state and federal regulatory agencies", "Microsoft Office (Outlook, Word, Excel)", "Basic MS Excel (Sorting and filtering data)"], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3873562857"}