{"jobTitle": "Client Success Manager, Speech Tech - Los Angeles, CA", "company": {"name": "PTW", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Position: Client Success Manager, Speech Tech<br/><br/>Location: Remote, Anywhere in Canada/North America (We do not provide visa sponsorship, only local candidates in NA will be accepted)<br/><br/>Department: Account Management, Game Services<br/><br/>PTW is looking for an Client Success Manager to manage our speech tech clients. This individual must be a consultative and highly motivated Relationship Manager, who will cultivate and build long term relationships with developers and publishers, present PTW services, liaise with operations, negotiate, and manage client relationships.<br/><br/>This position is perfect for an engaging, personable, enthusiastic, and results-orientated individual, with an eye for detail. Growth will be driven through relationship building and surpassing existing business revenue targets. The successful candidate will have a track record in surpassing expectations through cultivating and growing relationships. They will have an in-depth knowledge of Speech tech, an understanding of the challenges clients face, and a genuine passion for games.<br/><br/>This is an individual contributor role and candidates must have knowledge of speech tech.<br/><br/>What you'll be doing<br/><br/>Managing relationships with our existing business accounts within the speech tech line of business.<br/><br/>Attending client meetings, presentations, trade shows, etc.<br/><br/>Presenting PTW services in line with briefs<br/><br/>Creating effective solutioning which matches back to client requirements<br/><br/>Cross-selling PTW services to our existing clients<br/><br/>Working with Delivery and several support teams to maximize time spent engaging with clients<br/><br/><strong>Requirements<br/><br/></strong>5 years experience in account management and/ or speech tech<br/><br/><strong>Speech Tech Experience Is Essential For This Role<br/><br/></strong>Excellent presentation, communication and interpersonal skills<br/><br/>Ability to forecast opportunities<br/><br/>Must be self-motivated<br/><br/>An organized individual with a passion for gaming and experience of CRM tools<br/><br/>Motivation, creativity, adaptability, unquestionable ethics, integrity and team player.<br/><br/>Strong 360-degree strategic thinking.<br/><br/>The ability to influence and drive results in a complex business environment, including the ability to communicate and influence all levels from senior executives to working groups and all functions.<br/><br/><strong>Benefits<br/><br/></strong>Competitive Salary<br/><br/>Medical, Dental, Vision, 401K with matching<br/><br/>Dynamic and entrepreneurial culture<br/><br/>Video games focused environment<br/><br/>The opportunity to work with video games pioneers creating cutting edge interactive entertainment<br/><br/>Who we are<br/><br/>PTW is a boutique games services company that provides custom solutions worldwide. We believe in accelerating innovation across the globe. We started more than 25 years ago and since then, have grown exponentially year-on-year to who we are today. Our history is in gaming, and we are still gamers at heart. In our time within the games industry, we have worked on over 1,500 titles across all genres and all platforms.<br/><br/>We have grown rapidly over the past few years and now have 16 sites spanning the globe. The PTW umbrella of companies includes SIDE, 1518, OR Esports, and Entalize. SIDE works at the cutting edge of interactive media as a provider of audio services for the global entertainment market. 1518 is known industry wide for world-class art and is also our in-house game and product development studio.<br/><br/>Basically, anywhere in the world, any platform, any genre, we can help come up with a custom solution to make games run better, get to market faster, and enhance the lives of more players.<br/><br/>In summary, we connect and bring fun to the world.<br/><br/>Welcome to PTW, Family of Brands", "responsibilities": "Managing relationships with our existing business accounts within the speech tech line of business.<br/><br/>Attending client meetings, presentations, trade shows, etc.<br/><br/>Presenting PTW services in line with briefs<br/><br/>Creating effective solutioning which matches back to client requirements<br/><br/>Cross-selling PTW services to our existing clients<br/><br/>Working with Delivery and several support teams to maximize time spent engaging with clients", "qualifications": {"required": "5 years experience in account management and/ or speech tech<br/><br/>Excellent presentation, communication and interpersonal skills<br/><br/>Ability to forecast opportunities<br/><br/>Must be self-motivated<br/><br/>An organized individual with a passion for gaming and experience of CRM tools<br/><br/>Motivation, creativity, adaptability, unquestionable ethics, integrity and team player.<br/><br/>Strong 360-degree strategic thinking.<br/><br/>The ability to influence and drive results in a complex business environment, including the ability to communicate and influence all levels from senior executives to working groups and all functions.", "preferred": ""}, "skills": ["Account Management", "Speech Tech", "CRM", "Relationship Management", "Presentation Skills", "Communication Skills", "Interpersonal Skills", "Forecasting", "Self-Motivation", "Organization", "Gaming", "Strategic Thinking", "Influence"], "postedDate": "4 months ago", "benefits": "Competitive Salary<br/><br/>Medical, Dental, Vision, 401K with matching<br/><br/>Dynamic and entrepreneurial culture<br/><br/>Video games focused environment<br/><br/>The opportunity to work with video games pioneers creating cutting edge interactive entertainment", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3874388429"}