{"jobTitle": "Sales Associate (Brick Specialist) – Arrowhead, AZ", "company": {"name": "the LEGO Group", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative and Customer Service", "industry": "Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Sales Associate (Brick Specialist) – Arrowhead, AZ<br/><br/></strong><strong>Are you excited to deliver inspirational retail experiences to</strong> <strong>LEGO®</strong> <strong>fans of all ages? <br/><br/></strong>Join the LEGO® Brand Retail team as a Seasonal “Brick Specialist” and provide inspirational guest experiences in an interactive and vibrant store environment. We are looking for energetic, enthusiastic individuals to join us on a seasonal, part-time basis.<br/><br/><strong>Exceed our guests’ expectations through fun and meaningful interactions<br/><br/></strong><ul><br/><br/><li>Ensure a signature experience for every guest that visits our LEGO stores by greeting every guest in your location, performing all cash register functions and portraying a professional, gracious, friendly and engaging manner at all times (80%)</li><li>Provide a clean, safe and visually stimulating environment by performing daily cleaning duties, maintaining store displays and learning and executing LEGO Brand Retail visual standards (10%)</li><li>Safely and efficiently operate the store stockroom as you assist in the receiving of merchandise, maintain the stockroom to LBR standards, know and abide by all safety regulations and notify management of potential shortage situations (10%)<br/><br/><br/><br/></li></ul><strong>Deliver Inspirational Retail Experiences Built On LEGO Brand Values<br/><br/></strong>The LEGO® Group is a family-owned, international business and collaboration shapes everything we do. It’s all about a shared vision to launch inspiring products that will shape the future of play. You’ll be part of a uniquely creative organization that gives you the freedom to make a real impact on our performance — and have fun while you’re doing it. LEGO Brand Retail strives to foster relationships with our guests that transcend generations and are as timeless as the products we sell.<br/><br/><strong>Do you have what it takes to inspire and develop the builders of tomorrow?<br/><br/></strong><ul><br/><br/><li>Communicate effectively with team members and guests</li><li>Process information/merchandise through the register system</li><li>Work various hours, days, nights and weekends as business dictates</li><li>Freely access all areas of the store including sales floor, stock areas, register areas, and loading dock area</li><li>Physical specifications Constant moving, talking, hearing, reaching, grabbing and standing for at least two consecutive hours. May occasionally involve stooping, kneeling, crouching, and climbing ladders. Vision abilities include close vision, depth perception, and ability to adjust focus. Involves lifting at least 30 lbs</li><li>There is potential for this to become a regular role for excellent performers<br/><br/><br/><br/></li></ul><strong>We want you to join the LEGO Brand Retail team!<br/><br/></strong>If you are confident that you have what it takes to succeed in this seasonal part-time role, use the <strong>APPLY NOW </strong>button above or below.<br/><br/><strong>BRINGING IT TO LIFE<br/><br/></strong>“<em>The reason LEGO® exists is because of what they are doing for children around the globe. Everyone in the company, at all levels, feels privileged to be part of a company with such an inspiring vision”</em>. VP of Operations in Americas &amp; Pacific<br/><br/><strong>Additional Details<br/><br/></strong>We conduct drug screening as a part of our drug free workplace policy and in support of our commitment to the health and safety of our employees.<br/><br/>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.<br/><br/>Online Application Accessibility Statement; which is intended for those with disabilities - LEGO systems endeavors to make www.LEGO.com/jobs accessible to any and all users. If you would like to contact us regarding the accessibility of our web site or need assistance completing the application process, please contact the HR Service Desk at 860-763-7777, Option 4 (for TTY, dial 711) or RS_US@LEGO.com. Please note, these communication channels should be used for those having difficulty accessing our on-line channels, not to inquire about job opportunities.<br/><br/><br/>Core Responsibilities<br/><br/>Tasks will be assigned by floor leader in duty.<br/><br/><ul><br/><br/><li> Ensure a signature experience for every guest that visits our LEGO stores by greeting every guest in your location, performing all cash register functions and portraying a professional, gracious, friendly and engaging manner at all times</li><li> Provide a clean, safe and visually stimulating environment by performing daily cleaning duties, maintaining store displays and learning and executing LEGO Brand Retail visual standards</li><li> Safely and efficiently operate the store stockroom as you assist in the receiving of merchandise, maintain the stockroom to LBR standards, know and abide by all safety regulations and notify management of potential shortage situations<br/><br/><br/><br/></li></ul><strong>Join the global LEGO® team<br/><br/></strong>We strive to create a diverse, dynamic and inclusive culture of play at the LEGO Group, where everyone feels safe, valued and they belong.<br/><br/>The LEGO Group is proud to be an equal opportunity and an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.<br/><br/>We support our employees in being there for the moments that matter in life and celebrate families of all kinds, the loved ones that make us who we are. Being part of the LEGO Group also means taking part in our annual Play Day, playing a part in building a sustainable future and continuing our mission to “inspire and develop the builders of tomorrow.”<br/><br/>The LEGO Group is fully committed to Children’s Rights and Child Wellbeing across the globe. Candidates offered positions with high engagement with children are required to take part in Child Safeguarding Background Screening, as a condition of the offer.<br/><br/>Thank you for sharing our global commitment to Children’s Rights.<br/><br/>Build your career brick by brick at the LEGO Group.<br/><br/>We conduct drug screening as a part of our drug free workplace policy and in support of our commitment to the health and safety of our employees.<br/><br/>Online Application Accessibility Statement; which is intended for those with disabilities - LEGO systems endeavors to make www.LEGO.com/jobs accessible to any and all users. If you would like to contact us regarding the accessibility of our web site or need assistance completing the application process, please contact the HR Service Desk at 1.860-763-7777, option #3. Please note, these communication channels should be used for those having difficulty accessing our on-line channels, not to inquire about job opportunities.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3877215531"}