{"jobTitle": "Production Coordinator", "company": {"name": "Fashion Nova", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail Apparel and Fashion", "description": "<strong>About Us<br/><br/></strong>Fashion Nova is an inclusive fashion-forward and trend-driven apparel and lifestyle brand that celebrates all dimensions of confidence. We use our platform to spread positivity with brands for women, men, curve, luxe, sport, swim, beauty, and kids. We are obsessed with creating the best experience available for our customers and employees.<br/><br/>Fashion Nova was built on the backbone of individuality and inclusiveness. Our brands are worn and celebrated worldwide by customers, celebrities, and influencers because of our uniquely creative and talented employees.<br/><br/><strong>Role Overview<br/><br/></strong>The Production Coordinator is responsible for supporting the Production team with all pre-production tasks, including but not limited to: lab dip approvals; bulk fabric|trim|wash approvals; tracking pre-production|TOP samples; maintaining the work-in-progress (WIP) report; reviewing|maintaining packing lists in NetSuite.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Download production reports and review WIP report with Sr. Production Manager</li><li>Communicate daily with domestic and overseas manufacturers</li><li>Maintain weekly production WIP reports from each vendor</li><li>Engage with vendors on submittals of all fabric, lab dips|strike off, accessories and trim layout, fit|prototype samples, pre-production samples, and production samples to ensure production deadlines are adhered to</li><li>Assist with the approval process of all bulk submissions</li><li>Audit the submissions on packing list with vendors and review for unit volume accuracy</li><li>Provide updates|alerts any late deliveries or shortages</li><li>Attend necessary pre-production and production meetings and prepare required reports</li><li>Process TOP samples and verify that these samples match the bulk approvals</li><li>Ensure the internal design team is providing tech packs and any updates or comments needed for the vendors in a timely manner</li><li>Confirm the tech team is providing fit comments and any updates or comments needed for the vendors in a timely manner</li><li>Issue shipping labels to route the development samples|color standards to vendors, and enter all details into sample tracking tools</li><li>Aid in creating buy sheets</li><li>Prepare samples for presentation meetings (HANG, TAG, STEAM, PHOTO)<br/><br/><br/></li></ul><strong>Role Requirements<br/><br/></strong><ul><li>Basic understanding of G-Suite and Microsoft Office</li><li>Excellent time-management and organization skills to consistently meet deadlines</li><li>Effective verbal and written communication skills</li><li>Attention to detail</li><li>Ability to work efficiently and quickly without compromising quality</li><li>Exceptional attention to detail and quality control</li><li>Adeptness to organize, prioritize, and pivot workload in a dynamic environment</li><li>Capacity for working both independently and as part of a collaborative team</li><li>BA in Fashion or equivalent work experience</li><li>English, additional language(s) an advantage</li><li>Schedule of this position: Monday – Friday | Core business hours | Onsite<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Formalized career paths</li><li>Flat management platform</li><li>Manager Training Academy</li><li>Creative Development Internship Program</li><li>Fashion Nova Cares Program </li><li>Flexible Paid Time Off (PTO)</li><li>Medical, Dental and Vision Coverage</li><li>401k match, with immediate vesting upon eligibility</li><li>Stocked kitchens with gratis snacks and drinks</li><li>Weekly catered lunches</li><li>Summer Fridays at Headquarters</li><li>Team bonding events and programs</li><li>Employee discounts<br/><br/><br/></li></ul>Fashion Nova, LLC, and subsidiaries thereof, is an Equal Opportunity Employer. We are steadfast in our commitment to equal employment opportunities and pledge that these objectives are reflected in all aspects of our daily operations. We will continue to recruit, hire, train, and advance in employment qualified individuals in all job titles without regard to race, color, national origin, gender, sexual orientation, gender identity, religion, age, status as a protected veteran, criminal history, or status as an individual with a disability; and shall not discriminate against any individual, any such characteristic, nor any other classification protected by local, state and|or federal law.<br/><br/><strong>NOTICE AT COLLECTION</strong>", "responsibilities": "The Production Coordinator is responsible for supporting the Production team with all pre-production tasks, including but not limited to: lab dip approvals; bulk fabric|trim|wash approvals; tracking pre-production|TOP samples; maintaining the work-in-progress (WIP) report; reviewing|maintaining packing lists in NetSuite.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Download production reports and review WIP report with Sr. Production Manager</li><li>Communicate daily with domestic and overseas manufacturers</li><li>Maintain weekly production WIP reports from each vendor</li><li>Engage with vendors on submittals of all fabric, lab dips|strike off, accessories and trim layout, fit|prototype samples, pre-production samples, and production samples to ensure production deadlines are adhered to</li><li>Assist with the approval process of all bulk submissions</li><li>Audit the submissions on packing list with vendors and review for unit volume accuracy</li><li>Provide updates|alerts any late deliveries or shortages</li><li>Attend necessary pre-production and production meetings and prepare required reports</li><li>Process TOP samples and verify that these samples match the bulk approvals</li><li>Ensure the internal design team is providing tech packs and any updates or comments needed for the vendors in a timely manner</li><li>Confirm the tech team is providing fit comments and any updates or comments needed for the vendors in a timely manner</li><li>Issue shipping labels to route the development samples|color standards to vendors, and enter all details into sample tracking tools</li><li>Aid in creating buy sheets</li><li>Prepare samples for presentation meetings (HANG, TAG, STEAM, PHOTO)<br/><br/><br/></li></ul>", "qualifications": {"required": "Basic understanding of G-Suite and Microsoft Office, Excellent time-management and organization skills to consistently meet deadlines, Effective verbal and written communication skills, Attention to detail, Ability to work efficiently and quickly without compromising quality, Exceptional attention to detail and quality control, Adeptness to organize, prioritize, and pivot workload in a dynamic environment, Capacity for working both independently and as part of a collaborative team, BA in Fashion or equivalent work experience, English, additional language(s) an advantage, Schedule of this position: Monday – Friday | Core business hours | Onsite<br/><br/><br/>", "preferred": null}, "skills": ["G-Suite", "Microsoft Office", "Time Management", "Organization", "Communication", "Detail", "Quality Control", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Formalized career paths, Flat management platform, Manager Training Academy, Creative Development Internship Program, Fashion Nova Cares Program, Flexible Paid Time Off (PTO), Medical, Dental and Vision Coverage, 401k match, with immediate vesting upon eligibility, Stocked kitchens with gratis snacks and drinks, Weekly catered lunches, Summer Fridays at Headquarters, Team bonding events and programs, Employee discounts<br/><br/><br/>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3877404135"}