{"jobTitle": "Contracts Manager", "company": {"name": "Amazon", "industry": "Software Development", "size": "Large", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,400.00 - $146,300.00", "currency": "USD"}, "jobFunction": "Legal and Information Technology", "industry": "Software Development", "description": "Amazon’s Kindle, Web Services, and Consumer/B2B retail businesses are seeking talented Contracts Managers for positions across our various teams. The successful candidate has excellent communication skills, and will support reviewing, drafting, and negotiating contracts for an assigned business team. You will also participate in team-wide meetings, departmental goals and collaborative projects, and have access and visibility to business leadership. Amazon offers its Contracts Managers the opportunity to develop their experience and career with one of the world’s most recognized and dynamic brands.", "responsibilities": "", "qualifications": {"required": "5+ years of contracts management, paralegal, or other comparable experience within a law firm, government agency, or in-house legal department, with responsibility for reviewing, drafting, and negotiating the legal terms of a broad range of standard commercial contracts. Experience working with MS office, including Excel, Powerpoint, Sharepoint.", "preferred": "Previous in-house legal experience a plus. Experience related to technology companies is a plus. Excellent organizational, interpersonal and communications skills. High attention to detail and proven ability to manage multiple competing priorities simultaneously. Excellent analytical skills and the ability to use data to measure results. Ability to create new procedures and workflows. Organized self-starter with a focus on excellence and entrepreneurship."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3877278525"}