{"jobTitle": "Assistant Store Manager - Robert Graham - Glendale, CA", "company": {"name": "Centric Brands", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": " \n<p><span><strong>Robert Graham</strong>, founded in 2001, is an American eclectic luxury men's and women's apparel and accessories brand. Robert Graham offers excellent career growth opportunities, competitive salaries and benefits within a dynamic work environment. </span></p><p><span> </span></p><p><span>The Assistant Store Manager plays a key role in assisting with the overall performance of the store by promoting a sales culture to build productivity and passion for the brand. In this role, you will ensure customers receive exemplary service and a positive brand experience. You will assist in leading and motivating the team.</span></p><p> </p><p><span>SALES GENERATION:</span></p><ul><li><span>Lead by example to assist in achieving sales goals and KPI’s</span></li><li><span>Assist Store Manager in utilizing reports to identify opportunities (best sellers, product sell through, stock levels, employee productivity)</span></li><li><span>Set measurable performance standards and goals based on Company’s expectations and metrics</span></li><li><span>Work with Store Manager to identify marketing opportunities to build customer base and local market</span></li><li><span>Create additional business opportunities by ensuring team members focus on maintaining strong customer relationships</span></li></ul><p><span>CUSTOMER SERVICE:</span></p><ul><li><span>Ensure all associates provide the highest level of customer service to achieve World Class Service standards</span></li><li><span>Ensure staff maintains constant client communication through utilizing their client books and client database</span></li><li><span>Resolve all client problems and complaints quickly and effectively</span></li><li><span>Assist sales associates with various customer service issues i.e. dissatisfied customers, returns, defective</span></li><li><span>Empower associates to make decisions in the customer's best interest that also support the Company's philosophy</span></li></ul><p><span>OPERATIONS:</span></p><ul><li><span>Ensure facility maintenance, presentation and organization</span></li><li><span>Ensure cash control procedures are properly followed including: bank deposits, safe funds and petty cash</span></li><li><span>Control store expenses and maintain budgets, continually striving to reduce costs</span></li><li><span>Ensure deliveries are properly processed in a timely manner</span></li><li><span>Monitor the movement of all inventory and ensure that staff adheres to all Shipping/Receiving policies and procedures</span></li><li><span>Meet inventory accuracy and shrink requirements</span></li><li><span>Ensure staff is trained in all areas of appropriate register usage and maintenance</span></li><li><span>Understand and properly execute all management register functions</span></li><li><span>Support, promote and assume responsibility for loss prevention in all areas of risk management, physical security, store cash controls, inventory management, inter-store communication</span></li><li><span>Build and maintain good communication with members of corporate office, regional office, mall office and other stores</span></li><li><span>Exhibit proficiency in computer programs used by the Company including: Word, Excel, Outlook</span></li></ul><p><span>MERCHANDISING/VISUAL:</span></p><ul><li><span>Maintain all merchandising directives and ensure execution of effective merchandising strategies</span></li><li><span>Partner with logistics, product teams and supervisor to ensure appropriate assortment for the store</span></li><li><span>Ensure the selling floor is neat, clean, organized and reflects the correct visual image at all times</span></li><li><span>Ensure presentation of all displays, fixtures and all visual areas are reflective of current visual direction</span></li><li><span>Identify and communicate product concerns in a timely manner</span></li><li><span>Communicate inventory needs to the corporate retail team in order to support the business goal</span></li></ul><p><span>HUMAN RESOURCES:</span></p><ul><li><span>Communicate all human resources issues to the Store Manager in a timely and effective manner</span></li><li><span>Assist Store Manager with the payroll process</span></li><li><span>Ensure image and grooming standards are professional, reflective of the brand image and Dress Code Policy is adhered to at all times</span></li></ul><p> </p><ul><li><span>Preferred minimum 3 years luxury retail management experience leading a sales team.</span></li><li><span>Superb communication skills - verbal and written</span></li><li><span>PC literate - Excel, Word, Outlook</span></li></ul><p><span>EDUCATION: College Degree preferred but not mandatory</span></p><p><span> </span></p><p><span>CORE COMPETENCIES AND TRAITS:</span></p><ul><li><span>Sales and Goal Oriented - Must have the ability to maintain and communicate company's commitment to goals, drive sales, and measure team's performance. Developmental and Training</span></li><li><span>Skills - The ability to recognize and recruit talent, delegate responsibility, and work with staff and coach them to help them grow. Able to motivate staff and provide helpful, behaviorally specific feedback.</span></li><li><span>Performance Management Skills - Must be able to take responsibility for one's own performance and all teams performance by setting clear goals and expectations, tracking progress against goals, ensuring feedback, and addressing performance problems and issues promptly. Clarify expectations and provide resources and training needed to achieve goals.</span></li><li><span>Customer Focus - Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</span></li></ul><p><span><strong>*This commission eligible position will receive a generous employee discount at Robert Graham. </strong></span></p><p> </p><p><span><span><span>Salary Range: $18.00-$26.00</span></span></span></p><p> </p><p><span><span><span>At Centric Brands, we believe our people are our greatest asset, and we seek to structure competitive compensation offers to ensure that we are able to attract and retain the best talent.  Our job postings include a base hourly range at the time of employment.  The stated base hourly range represents our good faith estimate as to what candidates are likely to expect, and we tailor our offers within the range based on several factors, including the selected candidate's educational and professional experience, industry knowledge, location, technical and communication skills, and other factors that may prove relevant during the selection process.  Base salary is a part of a total compensation package, which, depending on the position, may also include commission earnings, bonus and other Centric Brands sponsored benefit programs. </span></span></span></p><p> </p><p><span>Centric Brands Inc. is an Equal Opportunity Employer.</span></p><p></p><span></span>", "responsibilities": "The Assistant Store Manager plays a key role in assisting with the overall performance of the store by promoting a sales culture to build productivity and passion for the brand. In this role, you will ensure customers receive exemplary service and a positive brand experience. You will assist in leading and motivating the team.", "qualifications": {"preferred": "Preferred minimum 3 years luxury retail management experience leading a sales team.\nSuperb communication skills - verbal and written\nPC literate - Excel, Word, Outlook\nEDUCATION: College Degree preferred but not mandatory", "required": ""}, "skills": ["Sales", "Customer Service", "Operations", "Merchandising", "Visual Merchandising", "Human Resources", "Leadership", "Teamwork", "Communication", "Goal Setting", "Performance Management", "Customer Focus", "Excel", "Word", "Outlook"], "postedDate": "4 months ago", "salary": {"amount": "18.00-26.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3878820813"}