{"jobTitle": "PMO- International Program Manager", "company": {"name": "Panda Restaurant Group", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Restaurants", "description": "<strong>Summary of Job Description:</strong>\n<p>The International Program Manager is responsible for leading cross-functional International projects with internal and external stakeholders to ensure that all initiatives are aligned with the International Team’s strategy and goals. This position will work under the oversight of the Senior Manager, Program Management Office (PMO) to create new processes, provide data intelligence, and manage key relationships with International Partners. The International Program Manager oversees the creation of project plans and determines project scope and deliverables as well as resource allocation for multiple connected projects. This position will serve as a central hub for program oversight, governance, and support for Panda’s International Core Team and International Operations Team.</p>\n<p><strong>You’ll get a chance to:</strong></p>\n<ul>\n<li>Create, execute, and monitor cross-functional international project plans, including the creation of any required documentation.</li>\n<li>Provide project and business leadership under the oversight of the Senior Manager, PMO.</li>\n<li>Determine project scope and deliverables.</li>\n<li>Oversee creation of project plans and resource allocation.</li>\n<li>Assign responsibilities and develops timeframes to facilitate successful completion of projects.</li>\n<li>Collect, maintain, and analyze reporting data to share with International Core Team and International Partners to create solutions to better support each market.</li>\n<li>Create and manage tools to optimize same.</li>\n<li>Define and manage project risk and risk mitigation processes.</li>\n<li>Keep stakeholders informed of progress, changes, and risks.</li>\n<li>Work with International Operations Team to resolve new and ongoing issues.</li>\n<li>Communicate effectively with the International Core Team, International Operations Team, international licensees and partners, and vendors/consultants to build and maintain close relationships and evaluate alternative business solutions.</li>\n<li>Track and share new knowledge with the Senior Manager, PMO and team members.</li>\n<li>Develop/mentor less experienced project management associates to help them achieve their potential.</li>\n</ul>\n<p><strong>Work Environment </strong></p>\n<ul>\n<li>Office conditions; broad international travel: 15% - 20%; flexible schedule outside normal business hours to accommodate different time zones</li>\n</ul>\n<p><strong>How we reward you:</strong></p>\n<p>Hybrid Work schedule</p>\n<p>401K with company match</p>\n<p>Yearly bonus opportunity*</p>\n<p>Full medical, dental, and vision insurance *</p>\n<p>On-site fitness center, biometric screen, and flu shot clinic</p>\n<p>Discounts at Panda restaurants, theme parks, and gym memberships</p>\n<p>Paid time off starting at 15 days with 7 federal holidays*</p>\n<p>Continuous education assistance and scholarships*</p>\n<p>Income protection including Disability, Life and AD&amp;D insurance*</p>\n<p>Bereavement leave*</p>\n<ul>\n<li>Benefits available for eligible permanent full time associates</li>\n</ul>\n<p><strong>Your background and experience: </strong></p>\n<ul>\n<li>Bachelor’s degree required, preferably Business, Economics, or Finance</li>\n<li>Minimum five years of project management experience with increasing program management responsibility, preferably in a restaurant business environment</li>\n<li>Successful completion of initial and periodically required trainings.</li>\n<li>Obtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position.</li>\n</ul>\n<p><strong>Panda Strong since 1983</strong></p>\n<p>Founded in Glendale, California, we are now the largest family-owned American Chinese Restaurant concept in America. With close to 2,000 locations globally, we continue our mission of delivering exceptional Asian dining experiences by building an organization where people are inspired to better their lives. Whether it’s impacting our team or the communities we work in, we’re proud to be an organization that embraces family values.</p>\n<p><strong>You’re wanted here</strong></p>\n<p>We value diversity in all forms and know the strength it brings. Workplace equality allows for creative ideas to blossom, diverse points of view to be heard, and improves overall happiness. We like the sound of that.</p>\n<p><em>Panda Restaurant Group, Inc. is an Equal Opportunity Employer and prohibits discrimination and harassment on the basis of race, color, religion, sex, national origin, disability, age and any other basis protected by the laws which apply where we operate. Panda provides accommodations for disabilities and religious observance purposes as required by law.</em></p>\n<p><br/></p>\n<p><strong>Pay Range</strong> M2: $112,500 - $158,000 / Annual</p>\n<p>* Within the range, individual pay is determined using various factors, including work location and experience.</p>", "responsibilities": "The International Program Manager is responsible for leading cross-functional International projects with internal and external stakeholders to ensure that all initiatives are aligned with the International Team’s strategy and goals. This position will work under the oversight of the Senior Manager, Program Management Office (PMO) to create new processes, provide data intelligence, and manage key relationships with International Partners. The International Program Manager oversees the creation of project plans and determines project scope and deliverables as well as resource allocation for multiple connected projects. This position will serve as a central hub for program oversight, governance, and support for Panda’s International Core Team and International Operations Team.", "qualifications": {"required": "Bachelor’s degree required, preferably Business, Economics, or Finance\nMinimum five years of project management experience with increasing program management responsibility, preferably in a restaurant business environment\nSuccessful completion of initial and periodically required trainings.\nObtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Hybrid Work schedule\n401K with company match\nYearly bonus opportunity*\nFull medical, dental, and vision insurance *\nOn-site fitness center, biometric screen, and flu shot clinic\nDiscounts at Panda restaurants, theme parks, and gym memberships\nPaid time off starting at 15 days with 7 federal holidays*\nContinuous education assistance and scholarships*\nIncome protection including Disability, Life and AD&amp;D insurance*\nBereavement leave*", "remoteWork": "No", "salary": {"amount": "112,500.00 - 158,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3879522918"}