{"jobTitle": "Production Supervisor - TST", "company": {"name": "TST Inc.", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Mining", "description": "<strong>Summary<br/><br/></strong>Supervises and coordinates activities of workers assigned to the production departments and other departments during off-shift operations when the supervisor or managers of other departments is not present in the plant; carries out managerial responsibilities in accordance with company policies and applicable laws.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Examines materials and products at various stages of production to evaluate conformance to specifications.</li><li>Inspects set up of machines and casting equipment.</li><li>Observes machines and equipment and takes action to correct malfunction as necessary. </li><li>Executes production schedules and estimates worker hour requirements for completion of job assignments.</li><li>Enforces employee company policies and takes corrective action in conjunction with department manager and HR manager as necessary </li><li>Ensures that customer specification and job orders are met by directing and coordinating production workers </li><li>Executes and adjusts work procedures to meet production schedules.</li><li>Recommends measures to improve production methods, equipment performance, and quality of product.</li><li>Suggests changes to improve department efficiency </li><li>Analyzes and resolves work problems and assists workers in conjunction with foreman.</li><li>Practices employee motivation techniques to influence positive work behavior </li><li>Prepares attendance, time and production records.</li><li>Prepares requisitions and orders supplies and materials as necessary</li><li>Confers with other supervisors to coordinate activities of other departments and shifts</li><li>Prepares performance reports and presents them to department manager on a daily basis </li><li>Executes all administrative duties in production department</li><li>Performs other duties as assigned by Management.</li><li>SHIFT: FLOATING- 6days a week. Tues &amp; Wed 7am-3:30pm, Thurs &amp; Fri 3pm-11:30pm, Sat &amp; Sun 11pm-7:30am<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Bachelor’s degree in Engineering required plus 3 or more years of related experience and/or training; or equivalent combination of education and experience.<br/><br/><strong>Skills And Abilities<br/><br/></strong><ul><li>Ability to read and comprehend instructions, correspondence, and memos. Ability to write correspondences. Ability to effectively present information in one-on-one and small group situations to customers, clients, and other employees of the organization. </li><li>Ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume. Ability to apply concepts of basic algebra and geometry.</li><li>Ability to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.</li><li>Wide variety of routine tasks that involve some choice of action within limits.<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong>While performing normal duties, the employee is regularly required to stand, walk, climb or balance, stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. Reasonable accommodations will be made for individuals with disabilities in accordance to legal requirements.<br/><br/><strong>WORK ENVIRONMENT<br/><br/></strong>The employee may be exposed to moving mechanical parts and outside weather conditions. The employee is occasionally exposed to wet and/or humid conditions, fumes or airborne particles and extreme heat. Noise level is usually loud requiring hearing protection. Reasonable accommodations will be made for individuals with disabilities in accordance to legal requirements.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Vacation / Sick Pay</li><li>Medical / Dental/ Vision</li><li>401K / Life Insurance</li><li>Short Term Disability</li><li>Flexible Spending Account</li><li>Employee assistance Program</li><li>Tuition Reimbursement Program</li><li>Employee Wellness Program</li><li>Employee of the Month Recognition</li><li>Company Open House</li><li>Employee luncheons</li><li>Company Picnic</li><li>Employee Engagement Programs: Employee of the Month, Years of Service and Employee of the Year</li></ul>", "postedDate": "4 months ago", "qualifications": {"required": "Bachelor’s degree in Engineering required plus 3 or more years of related experience and/or training; or equivalent combination of education and experience.", "preferred": null}, "skills": ["Engineering"], "benefits": "<ul><li>Vacation / Sick Pay</li><li>Medical / Dental/ Vision</li><li>401K / Life Insurance</li><li>Short Term Disability</li><li>Flexible Spending Account</li><li>Employee assistance Program</li><li>Tuition Reimbursement Program</li><li>Employee Wellness Program</li><li>Employee of the Month Recognition</li><li>Company Open House</li><li>Employee luncheons</li><li>Company Picnic</li><li>Employee Engagement Programs: Employee of the Month, Years of Service and Employee of the Year</li></ul>", "url": "https://www.linkedin.com/jobs/view/3879981347"}