{"jobTitle": "Merchandiser - NO NIGHTS OR WEEKENDS", "company": {"name": "Jacent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$18.00 - $20.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "<strong>Merchandiser<br/><br/></strong>The Merchandiser role consists of an individual who can improve the consumer buying experience by creating merchandising solutions in their assigned stores. The retail merchandiser’s duties include but are not limited to cultivating relationships with in-store management, executing merchandising resets, building retail displays, and managing the merchandising of impulse items displayed on clip strips &amp; j-hooks in specific areas of supermarkets. They are also responsible for the proper implementation of plan-o-grams, new item placement, void corrections, stock rotation, and building displays. The ideal candidate is a self-starter, quick learner, has a strong attention to detail, and works well in independent situations. They must possess excellent organizational skills, strong communication skills and the ability to build relationships with business partners.<br/><br/><strong>Why Jacent?<br/><br/></strong><ul><li>Daytime hours and a predictable schedule</li><li>Best in class paid training and scheduled touch bases during new hire period</li><li>Mileage and travel time paid between stores</li><li>Fun Perks like TicketsatWork and cellular plan discounts</li><li>Advancement opportunities</li><li>Opportunities to participate in feedback sessions with leadership</li><li>$18.00 - $20.00 based on experience</li><li>20-25 hours per week<br/><br/></li></ul><strong>Who We’re Looking For<br/><br/></strong><ul><li>A self-starter and quick learner who enjoys working both independently and in a team setting</li><li>Someone who is comfortable in changing environments</li><li>Someone who is able to meet the physical requirements of the role , with or without a reasonable accommodation, which include:</li><ul><li>Standing and walking 3-8hrs</li><li>Lifting up to 40 lbs</li><li>Crouching, bending, twisting, and repetitive hand movements</li></ul><li>Possesses excellent organizational skills</li><li>A strong communicator with the ability to build relationships with business partners</li><li>Resides within 20 miles of Venice ,CA 90291<br/><br/></li></ul><strong>What You’ll Be Doing<br/><br/></strong>Our Merchandisers improve the consumer buying experience by creating merchandising solutions in their assigned stores. The retail merchandiser's duties include, but are not limited to:<br/><br/><ul><li>Cultivating relationships with in-store management</li><li>Managing the merchandising of impulse items displayed on clip strips &amp; j-hooks in designated areas of supermarkets as well as participating in merchandising resets and building retail displays</li><li>Implementation of plan-o-grams, new item placement, void corrections, and stock rotation<br/><br/></li></ul><strong>Who We Are<br/><br/></strong>Jacent Strategic Merchandising, LLC is the industry leader in strategic impulse merchandising solutions with over 60 years of experience. As the premier impulse merchandising partner to retailers, Jacent sources, warehouses, stocks, and merchandises over 3,500 impulse items to more than 15,000 retail stores across the United States, Canada, and Puerto Rico.<br/><br/>Jacent creates a strategic merchandising plan for each store and places the right impulse product in the right location within the store to drive enhanced customer experiences, sales and profitability. With its national direct store delivery (“DSD”) network and team members, Jacent reorders, restocks, and merchandises each store to provide a customized, turn-key solution that drives incremental impulse sales for its blue-chip customers. In addition to the core impulse business, Jacent offers other retail services and data insights to its customers to help maximize the retailer’s profitability from their partnership with Jacent.<br/><br/><strong>EOE Statement<br/><br/></strong>The Company will make all employment decisions regarding employees and applicants for employment without discrimination or harassment based on race, color, religion, gender, national origin, sexual orientation, age, disability, pregnancy, marital status, veteran status, alienage or citizenship status, creed, genetic predisposition or carrier status, status as a victim of domestic violence, or any other category protected by federal, state, or local law.<br/><br/>Powered by JazzHR<br/><br/>ff2jOWZw5D", "responsibilities": "The Merchandiser role consists of an individual who can improve the consumer buying experience by creating merchandising solutions in their assigned stores. The retail merchandiser’s duties include but are not limited to cultivating relationships with in-store management, executing merchandising resets, building retail displays, and managing the merchandising of impulse items displayed on clip strips &amp; j-hooks in specific areas of supermarkets. They are also responsible for the proper implementation of plan-o-grams, new item placement, void corrections, stock rotation, and building displays.", "qualifications": {"required": "A self-starter and quick learner who enjoys working both independently and in a team setting, Someone who is comfortable in changing environments, Someone who is able to meet the physical requirements of the role , with or without a reasonable accommodation, which include: Standing and walking 3-8hrs, Lifting up to 40 lbs, Crouching, bending, twisting, and repetitive hand movements, Possesses excellent organizational skills, A strong communicator with the ability to build relationships with business partners, Resides within 20 miles of Venice ,CA 90291"}, "skills": [], "postedDate": "4 months ago", "applicationDeadline": "", "benefits": "Daytime hours and a predictable schedule, Best in class paid training and scheduled touch bases during new hire period, Mileage and travel time paid between stores, Fun Perks like TicketsatWork and cellular plan discounts, Advancement opportunities, Opportunities to participate in feedback sessions with leadership, $18.00 - $20.00 based on experience, 20-25 hours per week", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3880301766"}