{"jobTitle": "Stock Associate", "company": {"name": "CB2", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "15.50/hr - 22.50/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "CB2 is transforming the perception of home design for today's modern consumer. Born out of Crate and Barrel, CB2 is committed to high-quality, sophisticated design at an approachable price. Located in downtown Chicago, CB2 offers an engaging, collaborative work environment. If you're creative, team spirited and have a passion for modern design, then join the team as a Stock Associate.<br/><br/>We’re here for it. We think you should be too. We’re looking for a driven professional with an inclusive mindset to join our team as a <strong>Stock Assocaite<br/><br/></strong><strong> A day in the life as a Stock Associate... <br/><br/></strong><ul><li> Assist the team with ensuring product and displays on the sales floor are stocked appropriately and available for customers to purchase </li><li> Perform duties associated with receiving and processing incoming shipments. Process all incoming and outgoing packages, including customer curbside pick-up orders, ship from store, buy online pickup in store, in a timely manner </li><li> Assist in preparing the stockroom for inventory and perform assigned inventory duties </li><li> Perform prompt and accurate stock checks, while maintaining an organized and efficient stockroom </li><li> Greet and receive customers in a welcoming manner, respond to customer questions, and involve higher level management, as appropriate </li><li> Maintain an awareness of loss prevention, security and safety following the guidelines provided by management or the Human Resources Department and/or as outlined in the Associate Policy Guide </li><li> Organize and maintain the stockroom with the Operations Team </li><li> Work closely with the Sales Associates, Visual Merchant and management team to maintain the sales area, including merchandise and the physical space </li><li> Assist the Visual Merchant to support seasonal floor changes, as needed </li><li> Inform the Operations Team and the Visual Merchant of the receipt of any new items, any overages or shortages of merchandise, and/or the condition of merchandise <br/><br/></li></ul><strong>What You’ll Bring To The Table…<br/><br/></strong><ul><li> Excellent interpersonal skills and ability to build rapport with customers and other associates </li><li> Good reading and written language skills (English), strong communication skills, basic arithmetic, interpersonal skills, telephone presence, data entry skills </li><li> Ability to work in a flexible environment, shift quickly as our business evolves, and focus on continuous learning </li><li> Engage in, maintain and support store safety standards and training <br/><br/></li></ul><strong> We’d love to hear from you if you have… <br/><br/></strong><ul><li> Ability to move merchandise up to and over 70 lbs </li><li> Retail and customer service experience preferred </li><li> Full-Time roles: Open availability to work flexible hours on weekdays, evenings and weekends </li><li> Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and/or Sunday) and at least one weekday or night <br/><br/></li></ul><strong>Minimum Starting Rate:</strong> $15.50 Hourly<strong>Up to:</strong> $22.50 HourlyPay ranges will be adjusted upward as needed to comply with applicable state and local law. In addition to your salary, based on your role, associates may be eligible for other compensation including bonuses, sales incentives, and long term incentives.<br/><br/>", "responsibilities": "<ul><li> Assist the team with ensuring product and displays on the sales floor are stocked appropriately and available for customers to purchase </li><li> Perform duties associated with receiving and processing incoming shipments. Process all incoming and outgoing packages, including customer curbside pick-up orders, ship from store, buy online pickup in store, in a timely manner </li><li> Assist in preparing the stockroom for inventory and perform assigned inventory duties </li><li> Perform prompt and accurate stock checks, while maintaining an organized and efficient stockroom </li><li> Greet and receive customers in a welcoming manner, respond to customer questions, and involve higher level management, as appropriate </li><li> Maintain an awareness of loss prevention, security and safety following the guidelines provided by management or the Human Resources Department and/or as outlined in the Associate Policy Guide </li><li> Organize and maintain the stockroom with the Operations Team </li><li> Work closely with the Sales Associates, Visual Merchant and management team to maintain the sales area, including merchandise and the physical space </li><li> Assist the Visual Merchant to support seasonal floor changes, as needed </li><li> Inform the Operations Team and the Visual Merchant of the receipt of any new items, any overages or shortages of merchandise, and/or the condition of merchandise <br/><br/></li></ul>", "qualifications": {"required": "Excellent interpersonal skills and ability to build rapport with customers and other associates, Good reading and written language skills (English), strong communication skills, basic arithmetic, interpersonal skills, telephone presence, data entry skills, Ability to work in a flexible environment, shift quickly as our business evolves, and focus on continuous learning, Engage in, maintain and support store safety standards and training", "preferred": "Ability to move merchandise up to and over 70 lbs, Retail and customer service experience preferred, Full-Time roles: Open availability to work flexible hours on weekdays, evenings and weekends, Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and/or Sunday) and at least one weekday or night"}, "skills": ["Customer Service", "Retail"], "postedDate": "2 months ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3880497950"}