{"jobTitle": "Office Manager - USC Galen Center", "company": {"name": "Aramark", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26.00/hr - 29.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Hospitality", "description": "<strong>Job Description<br/><br/></strong>Do you love a job that is constantly evolving and changing? Looking for a full time position with an amazing company?<br/><br/>The Office Manager is responsible for assisting management with administrative tasks including, but not limited to accounting processes, ordering, data entry, filing, and hiring processes.<br/><br/>The Office Manager will be required to work well with customers, visitors, and employees in a professional and cheerful manner. The Office Manager is responsible for the supervision and control of general office functions, including light Human Resource administration including union administration duties (where applicable). Assists management in the completion of standard monthly management reports.<br/><br/>Essential functions and responsibilities of the position may vary by Aramark location based on client requirements and business needs.<br/><br/>COMPENSATION: The hourly rate for this position ranges from $26.00 to $29.00, depending on circumstances including an applicant?s skills and qualifications, certain degrees and certifications, prior job experience, market data, and other relevant factors. Additional compensation may include a bonus or commission (if relevant). This is Aramark?s good faith and reasonable estimate of the range of compensation for this position as of the time of posting.<br/><br/>If hired, employee will be in an ?at-will position? and Aramark reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time AND FOR ANY REASON, including, BUT NOT LIMITED TO for reasons related to individual performance, Aramark or individual department/team performance, and market factors.<br/><br/>Job Responsibilities<br/><br/><ul><li>Assists unit management with clerical tasks in relation to accounting, payroll, receiving, and/or human resources including filing, data entry, record review and maintenance, etc.</li><ul><li>accounts payable processing including matching invoices and data-entry in systems</li><li>tracking Labor Union dues and fees as required</li><li>tracking expenditures for maintenance and confirm completion </li><li>accounts receivable processing for catering services including matching payments to events</li><li>post payments to deposit log track and reconcile sales and tips on a per day/per event basis </li><li>assist with inventory : counting, balancing and system entry</li></ul><li>Operate technology, systems, and software such as voicemail systems, copy/scanners, personal computers, and MS Office <br/></li></ul>At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Prior administrative experience preferred </li><li>The ideal candidate will have a solid understanding of Microsoft applications, including but not limited to: Outlook, Word, PowerPoint, and Excel </li><li>Ability to learn new computer based systems with minimal direction </li><li>Demonstrates interpersonal and communication skills, both verbal and written</li><li>Demonstrates strong interpersonal skills, accuracy, and attention to detail<br/><br/></li></ul>Education<br/><br/><strong>About Aramark<br/><br/></strong><strong>Our Mission<br/><br/></strong>Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.<br/><br/>At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law.<br/><br/><strong><strong>About Aramark<br/><br/></strong></strong>The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at http://www.aramarkcareers.com or connect with us on Facebook, Instagram and Twitter.", "responsibilities": "<ul><li>Assists unit management with clerical tasks in relation to accounting, payroll, receiving, and/or human resources including filing, data entry, record review and maintenance, etc.</li><ul><li>accounts payable processing including matching invoices and data-entry in systems</li><li>tracking Labor Union dues and fees as required</li><li>tracking expenditures for maintenance and confirm completion </li><li>accounts receivable processing for catering services including matching payments to events</li><li>post payments to deposit log track and reconcile sales and tips on a per day/per event basis </li><li>assist with inventory : counting, balancing and system entry</li></ul><li>Operate technology, systems, and software such as voicemail systems, copy/scanners, personal computers, and MS Office <br/></li></ul>At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.", "qualifications": {"preferred": "Prior administrative experience preferred ", "required": "<ul><li>The ideal candidate will have a solid understanding of Microsoft applications, including but not limited to: Outlook, Word, PowerPoint, and Excel </li><li>Ability to learn new computer based systems with minimal direction </li><li>Demonstrates interpersonal and communication skills, both verbal and written</li><li>Demonstrates strong interpersonal skills, accuracy, and attention to detail<br/><br/></li></ul>Education"}, "skills": ["Microsoft Office", "Outlook", "Word", "PowerPoint", "Excel"], "postedDate": "5 months ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3880974890"}