{"jobTitle": "Medical Staff Credentialing Specialist - Administrative", "company": {"name": "Ampcus Inc", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "30.00/hr - 32.00/hr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong><em>REQUIRED: 3 yrs. healthcare credentialing, working with MD Staff, exp with Primary Source Verification. See attached for additional details</em> <br/><br/></strong><strong>Job Description<br/><br/></strong>Under the direction of the Program Manager for Credentialing Quality/Process Improvement, the Medical Staff Credentialing Coordinator provides support to the medical staff organization activities in a high volume, goal driven environment. By being the point of contact with department management, medical staff and hospital leadership to ensure compliance and optimal efficiency for appropriate membership and privileges throughout the tenure of a providers tenure with Health, Advanced Health Professionals and CVO contracted facilities. First responder to maintaining the privileging process for members of the Medical Staff as well as performing auditing functions pursuant to facility Bylaws, Rules and Regulations; Credentialing Policy and Procedures; and other applicable accreditation/payor standards. The Medical Staff Coordinator is expected to work independently and collaboratively at all times with colleagues in the Medical Staff Office, Credentials Verification office, Clinical Service Coordinators, and other staff within the Medical Center while facilitating continuous process improvement efforts to achieve department and organization initiatives.<br/><br/><strong>Required<br/><br/></strong><strong>Qualifications <br/><br/></strong><ul><li>Three years experience in healthcare credentialing (i.e. credentials verification organization, or Medical Staff Office)</li><li>Working knowledge of the health care and credentialing industry, regulatory agencies, and other national standards (TJC, NCQA, AAAHC)</li><li>Experience working with MDStaff</li><li>Experience with Primary Source Verification, principles pertaining to FPPE, OPPE and Privileging</li><li>Experience working with Microsoft Office (Excel, Word, Outlook) and Adobe Acrobat<br/><br/></li></ul><strong>Preferred Experience<br/><br/></strong><ul><li>Certified Provider Credentialing Specialist (CPCS) or Certified Professional Medical Services Management (CPMSM)</li><li>Previous experience with auditing Initial and Reappointment files for Physicians, Dentist and APPs</li></ul>", "postedDate": "4 months ago", "skills": ["Healthcare Credentialing", "Primary Source Verification", "Microsoft Office", "Adobe Acrobat", "TJC", "NCQA", "AAAHC", "FPPE", "OPPE", "Privileging", "Auditing", "Process Improvement"], "url": "https://www.linkedin.com/jobs/view/3881402009"}