{"jobTitle": "Senior Financial Analyst - Accounting", "company": {"name": "Ampcus Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Finance and Sales", "industry": "Hospitals and Health Care", "description": "REMOTE DURATION:  26 weeks with a possible extension<br/><br/>SHIFT: M-F 8-5 <br/><br/>REQUIRED EXP:  The candidate must have a bachelors degree and a background in healthcare accounting or healthcare finance AND hospital net revenue experience over a 7 year period <br/><br/>The team consists of 4 Reimbursement Managers and 1 Director, everyone works remote so it will be important that the candidate can work independently and remain productive.<br/><br/>Job Description<br/><br/><ul><li>Collaborate closely with budget, contract management, revenue cycle, operations, and decision support to resolve net revenue issues.</li><li>Responsible for determining contractual and bad debt reserve estimates using the Crowe RCA tool and our accounts receivable model.</li><li>Prepare the annual system-wide net revenue budget</li><li>Analyze reports and variances to determine deviations from trend/budget</li><li>Prepare month-end journal entries to report the value of Medicare, Medi-Cal, contracts, and other payor revenue and accounts receivable</li><li>Ensure fee-for-service estimates are correct</li><li>Perform quarterly analysis of FTEs for GME/IME reporting</li><li>Provide training to staff on specific areas of expertise<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Self-motivated, detail-oriented, and highly-analytical</li><li>Bachelors degree in accounting, business, economics, math, or a related field</li><li>Seven or more years of directly-related experience</li><li>Five or more years of experience in revenue/accounts receivable financial analysis, claims or billing analysis, decision support, or economics in a healthcare setting</li><li>Experience with net revenue, Crowe revenue analytics tool, and provider enrollment preferred</li><li>Knowledge of clinical operations, billing, and coding</li><li>Familiarity with CPT, HCPCS, ICD-10 coding, revenue codes, and hospital billing/claims processing</li><li>Knowledge of Medi-Cal financing rules and regulations and Medi-Cal waiver reimbursement</li><li>Strong critical thinking, financial analysis, and problem-solving abilities</li><li>Computer proficiency with Microsoft Office</li><li>Background in report writing and working with large data preferred</li><li>Excellent communication and leadership skills<br/><br/></li></ul>Interview Process<br/><br/>There will be two, possibly three at the most interviews all done via Zoom. The first interview will be with the Director, the second interview will be with the entire reimbursement team. If requested, either the controller and/or CFO may ask to interview", "postedDate": "4 months ago", "salary": {"amount": "45.00/hr - 50.00/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3881095640"}