{"jobTitle": "Warehouse Manager", "company": {"name": "UNIS", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $70,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "<strong>Job Details<br/><br/></strong>Job Location<br/><br/>Valley View, Buena Park, CA - Buena Park, CA<br/><br/>Salary Range<br/><br/>$70,000.00 - $70,000.00 Salary/year<br/><br/><strong>Description<br/><br/></strong><strong>Job description<br/><br/></strong><strong> Superior Technology - Smarter Supply Chains - Faster Execution <br/><br/></strong>Founded in 1989, UNIS LLC has grown into a major, nationally recognized Third-Party Logistics Provider (3PL). From humble beginnings with just a few trucks operating in Southern California, UNIS has expanded into all major US markets, impacting the successful flow of commerce with superior technology, smarter supply chains and faster execution. We credit our growth to an agile, customer-driven mindset, and strategic investments in technologies that give our clients the visibility and operational insights they require in today’s dynamic supply chain environment.<br/><br/>Our growing 3PL Network is expanding and we are looking for skilled Manager to help with our tremendous growth.<br/><br/>Warehouse Managers are responsible to assist in the overall management of the warehouse operation and provide strategic direction and leadership for all warehouse activities associated with order fulfillment, packing, value added functions, shipping, receiving, warehousing, and inventory management. Objectives, goals, strategies, and measures will be provided, and your efforts will be required to plan for continuous improvement to create new and innovative strategies necessary to consistently meet our customer's expectations.<br/><br/>Other responsibilities include leading the development of a high-performance work environment, concentrated efforts of staff building and detailed scheduling to meet both our budgets and planned activities are expected.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li> Able to make quick and precise decisions</li><li> Manage specific warehouse activities including but not limited to order planning, releasing orders to the fulfillment floor, following up on pickers completion of assigned tasks, ensuring the packing stations complete orders on a timely basis.</li><li> Reviews and implements efficient and effective department processes, policies, and procedures.</li><li> Build Teams that are consistent, effective and exceed expectations in all areas, create bench strength within the staff community</li><li> Ensure to maintain and exceed KPI measurements, meet all customer agreed upon SLA’s, to include labor control, inbound/outbound metrics, order fulfillment and inventory accuracies.</li><li> Ensures the physical condition of warehouse and equipment are properly maintained and documented</li><li> Partners with senior management to implement and maintain proper layout of warehouse and product placement.</li><li> Performs ABC cycle counts, quarterly and/or annual physical inventories; provides inventory reports as needed.</li><li> Identifies, documents, and implements opportunities for continuous improvement.</li><li></li><li> Maintains a working knowledge of all operating systems pertaining to the work area and updates SOP’s as needed</li><li> Mentoring, training, motivating are key components and crucial to staff building for the overall success of the business. Additionally, must manage schedules and workflow in order to control costs and meet overall expectations</li><li> Assigns duties and monitors quality of work; assures staff conforms to organizational policies and procedures and government regulations including TAPA, AIB, OSHA, etc.</li><li> Keeps up to date on overall activities of the team, identifying problem areas and taking corrective actions.</li><li> Performs other related duties as required and assigned by management.</li><li> Be a partner in our Safety programs and lead by example in order to provide the highest standards in our facility<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Background Required:<br/><br/></strong><ul><li> Minimum 3 years of experience in Third Party Logistics (3PL) required</li><li> High proficient in MS Office, Excel, Word, and PowerPoint.</li><li> Experience with labor/workforce management and warehouse management systems (i.e. SAP, Red Prairie, Manhattan, JDA, etc.)</li><li> Lean certifications preferred</li><li> 70k Salary</li></ul>", "responsibilities": "Warehouse Managers are responsible to assist in the overall management of the warehouse operation and provide strategic direction and leadership for all warehouse activities associated with order fulfillment, packing, value added functions, shipping, receiving, warehousing, and inventory management. Objectives, goals, strategies, and measures will be provided, and your efforts will be required to plan for continuous improvement to create new and innovative strategies necessary to consistently meet our customer's expectations.<br/><br/>Other responsibilities include leading the development of a high-performance work environment, concentrated efforts of staff building and detailed scheduling to meet both our budgets and planned activities are expected.", "qualifications": {"required": "Minimum 3 years of experience in Third Party Logistics (3PL) required\nHigh proficient in MS Office, Excel, Word, and PowerPoint.\nExperience with labor/workforce management and warehouse management systems (i.e. SAP, Red Prairie, Manhattan, JDA, etc.)", "preferred": "Lean certifications preferred"}, "skills": ["MS Office", "Excel", "Word", "PowerPoint", "SAP", "Red Prairie", "Manhattan", "JDA"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3882259709"}