{"jobTitle": "Transportation Supervisor", "company": {"name": "UNIS", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "The <strong>1st Shift Transportation Supervisor</strong> will directly manage the daily delivery process in accordance with company policies and procedure to ensure the timely and efficient delivery of products.<br/><br/><strong>Shift Hours</strong>: 06:00-16.00<br/><br/><strong>Duties Include, But Are Not Limited To<br/><br/></strong><ul><li> Driving a culture of operational excellence and model compliance within terminal staff </li><li> Manage nightly operation of the facility and any driver that is on duty </li><li> Oversee the monitoring process for hours of service daily and enforce Company policy corrective action procedures for non-compliance </li><li> Monitor, report and manage delivery on-time performance standards as established </li><li> Provide constant communications of service issues, both outbound and inbound, to appropriate personnel and departments </li><li> Training and development of drivers and any additional staff that is on duty, while also playing an active role in development and discipline </li><li> Communicate company objectives across all levels of the facility </li><li> Oversee the daily reconciliation of all paperwork including BOLs, delivery receipts and any other documents and other administrative duties as required </li><li> Performs other related duties as assigned </li><li> 2+ years experience in LTL, distribution/logistics, transportation or operations management </li><li> Knowledge of computer systems and handheld scanning technology </li><li> Knowledge of Microsoft programs (excel, word, teams &amp; office) </li><li> Bachelors degree is preferred but not required </li><li> Proven track record of managing resources and efficiencies </li><li> Experience managing CDL-A drivers. </li><li> Ability to multitask and continually prioritize a changing workload </li><li> Ability to meet frequent deadlines </li><li> Strong organizational skills and attention to detail <br/><br/></li></ul><strong>Our Benefits Package Includes<br/><br/></strong>Paid Holidays<br/><br/>Paid Sick Days<br/><br/>Paid Vacation Days<br/><br/>Competitive Compensation<br/><br/>Retirement 401k Plan<br/><br/>Medical / Prescription Drug / Dental / Vision Plans<br/><br/>Voluntary Life and AD&amp;D Insurance<br/><br/>EEO/AA/M/F/Vet/Disability<br/><br/>Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, protected veteran status or disability.", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3882965735"}