{"jobTitle": "Senior Manager, Loyalty and Digital Strategy", "company": {"name": "sweetgreen", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Food and Beverage Services", "description": "As the Senior Manager of Loyalty and Digital Strategy, you will play an integral role in managing and evolving the Sweetpass Loyalty program and the digital ordering experience. You will be responsible for analyzing and reporting on current Loyalty metrics and play a key role in developing the future Loyalty program strategy. This includes research and analysis to understand current customer experiences and pain points, competitive analysis and understanding of industry trends, and making recommendations that create frictionless customer experiences and deliver business results. This position will also be responsible for the analysis and strategy related to order ahead, native delivery, and the digital app/web experience.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Loyalty Strategy<br/><br/><ul><li>Insights &amp; Research: Conduct research to understand our Sweetgreen customer and our digital customer, connecting insights to recommendations</li><li>Financial Acumen: Understand Loyalty program economics and measurement, helping to evolve current program understanding and future evolution</li><li>Strategy: Synthesize complex, multi faceted projects and programs, driving priority and clarity for both leadership and cross functional teams</li><li>Creative Briefing/Content: Lead creative look and feel for customer lifecycle communications within owned channels, creating a holistic and relevant experience rooted in our brand voice</li><li>Technology: Work cross functionally to prioritize new product/feature development, communicating requirements while also helping to paint a clear picture of long term strategy against clear business objectives <br/><br/></li></ul>Digital Strategy<br/><br/><ul><li>Channel Strategy: Lead strategy to understand customer friction points and business opportunities, developing recommendations to improve channel revenue through customer trial, repeat purchases, and overall satisfaction</li><li>Data and Insights: Develop measurement approach and reporting template to monitor health of digital channels</li><li>App Strategy: Work cross functionally to evolve the app experience, ensuring new features are rooted in insights and setting clear prioritization against key objectives</li><li>Marketing/Content: Lead creative strategy both within the app experience and through campaigns to drive trial/repeat through owned channels</li><li>Promotion Calendar: Plan and implement marketing campaigns to drive customer trial/repeat/order channel leveraging offers and discounts while maximizing ROI<br/><br/></li></ul><strong>Drive Business Results<br/><br/></strong><ul><li>Capture more digital transactions</li><li>Increase revenue through in store (scan to earn), order ahead, and native delivery</li><li>Maximize channel economics, understanding margin and incrementality</li><li>Acquire new Loyalty customers</li><li>Drive customer LTV</li><li>Maintain/Improve Loyalty program economics</li><li>Maximize discount ROI<br/><br/></li></ul><strong>Desired Traits<br/><br/></strong><ul><li>5+ years of Loyalty/Rewards program experience</li><li>Experience with mobile ordering/native delivery and digital customer experience strategy</li><li>Data and research driven - curious and analytical, rooting strategy in clear insights</li><li>Strategic - skilled at adding structure to complex, multi faceted programs and projects</li><li>Financial acumen - knowledge of both Loyalty financial models and overall business financials; leverages strong business acumen to drive strategy</li><li>Entrepreneurial - self starter and can work independently with minimal oversight</li><li>Ability to influence - both leadership and cross functionally</li><li>Strong communicator - skilled in clearly contextualizing research results for the audience</li><li>Advocate for the customer - deep understanding for customer needs and trends </li><li>Project management - ability to prioritize and focus team’s efforts on important initiatives<br/><br/></li></ul><strong>What You'll Get<br/><br/></strong><ul><li>Highly competitive pay + bonus plan</li><li>Three different medical plans to suit your and your family's needs</li><li>Dental and Vision insurance</li><li>Flexible PTO plan</li><li>401k program</li><li>Employee HSA and FSA</li><li>Complimentary greens</li><li>An opportunity to make a real impact on the people around you, both by growing them and by connecting them to real food</li><li>To live the sweetlife and celebrate your passion + purpose</li><li>A collaborative team of people who live our core values and have your back</li><li>A clear career path with opportunities for development, both personally and professionally</li><li>Free sweetgreen swag<br/><br/></li></ul><strong>Come join the sweetlife!<br/><br/></strong><strong>About Sweetgreen<br/><br/></strong>sweetgreen is on a mission to build healthier communities by connecting people to real food. We passionately believe that real food should be convenient and accessible to everyone. Every day in each sweetgreen, our 3,500 team members make food from scratch, using fresh ingredients and produce delivered that morning. And in our local communities, we’re committed to leaving people better than we found them. We’re in the business of feeding people, and we’re out to change what that means.<br/><br/>sweetgreen provides equal opportunities for everyone that works for us and everyone that applies to join our team, without regard to sex or gender, gender identity, gender expression, age, race, religious creed, color, national origin, ancestry, pregnancy, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, any service, past, present, or future, in the uniformed services of the United States (military or veteran status), or any other consideration protected by federal, state, or local law.<br/><br/><em>sweetgreen participates in the federal government's E-Verify program to determine employment eligibility. To learn more about the E-Verify program, please click here.<br/><br/></em><strong>Salary Range For This Role<br/><br/></strong>Starting salary range based on experience<br/><br/>$140,000—$160,000 USD<br/><br/>sweetgreen provides equal opportunities for everyone that works for us and everyone that applies to join our team, without regard to sex or gender, gender identity, gender expression, age, race, religious creed, color, national origin, ancestry, pregnancy, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, any service, past, present, or future, in the uniformed services of the United States (military or veteran status), or any other consideration protected by federal, state, or local law.<br/><br/><em>California residents: Review our applicant privacy notice HERE.<br/><br/></em><em>sweetgreen participates in the federal government's E-Verify program to determine employment eligibility. To learn more about the E-Verify program, please click here.</em>", "responsibilities": "As the Senior Manager of Loyalty and Digital Strategy, you will play an integral role in managing and evolving the Sweetpass Loyalty program and the digital ordering experience. You will be responsible for analyzing and reporting on current Loyalty metrics and play a key role in developing the future Loyalty program strategy. This includes research and analysis to understand current customer experiences and pain points, competitive analysis and understanding of industry trends, and making recommendations that create frictionless customer experiences and deliver business results. This position will also be responsible for the analysis and strategy related to order ahead, native delivery, and the digital app/web experience.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Loyalty Strategy<br/><br/><ul><li>Insights &amp; Research: Conduct research to understand our Sweetgreen customer and our digital customer, connecting insights to recommendations</li><li>Financial Acumen: Understand Loyalty program economics and measurement, helping to evolve current program understanding and future evolution</li><li>Strategy: Synthesize complex, multi faceted projects and programs, driving priority and clarity for both leadership and cross functional teams</li><li>Creative Briefing/Content: Lead creative look and feel for customer lifecycle communications within owned channels, creating a holistic and relevant experience rooted in our brand voice</li><li>Technology: Work cross functionally to prioritize new product/feature development, communicating requirements while also helping to paint a clear picture of long term strategy against clear business objectives <br/><br/></li></ul>Digital Strategy<br/><br/><ul><li>Channel Strategy: Lead strategy to understand customer friction points and business opportunities, developing recommendations to improve channel revenue through customer trial, repeat purchases, and overall satisfaction</li><li>Data and Insights: Develop measurement approach and reporting template to monitor health of digital channels</li><li>App Strategy: Work cross functionally to evolve the app experience, ensuring new features are rooted in insights and setting clear prioritization against key objectives</li><li>Marketing/Content: Lead creative strategy both within the app experience and through campaigns to drive trial/repeat through owned channels</li><li>Promotion Calendar: Plan and implement marketing campaigns to drive customer trial/repeat/order channel leveraging offers and discounts while maximizing ROI<br/><br/></li></ul><strong>Drive Business Results<br/><br/></strong><ul><li>Capture more digital transactions</li><li>Increase revenue through in store (scan to earn), order ahead, and native delivery</li><li>Maximize channel economics, understanding margin and incrementality</li><li>Acquire new Loyalty customers</li><li>Drive customer LTV</li><li>Maintain/Improve Loyalty program economics</li><li>Maximize discount ROI<br/><br/></li></ul>", "qualifications": {"required": "5+ years of Loyalty/Rewards program experience, Experience with mobile ordering/native delivery and digital customer experience strategy, Data and research driven - curious and analytical, rooting strategy in clear insights, Strategic - skilled at adding structure to complex, multi faceted programs and projects, Financial acumen - knowledge of both Loyalty financial models and overall business financials; leverages strong business acumen to drive strategy, Entrepreneurial - self starter and can work independently with minimal oversight, Ability to influence - both leadership and cross functionally, Strong communicator - skilled in clearly contextualizing research results for the audience, Advocate for the customer - deep understanding for customer needs and trends, Project management - ability to prioritize and focus team’s efforts on important initiatives", "preferred": ""}, "skills": ["Loyalty", "Digital Strategy", "Customer Experience", "Research", "Data Analysis", "Financial Modeling", "Project Management", "Communication", "Influence", "Mobile Ordering", "Native Delivery"], "postedDate": "4 months ago", "benefits": "Highly competitive pay + bonus plan, Three different medical plans to suit your and your family's needs, Dental and Vision insurance, Flexible PTO plan, 401k program, Employee HSA and FSA, Complimentary greens, An opportunity to make a real impact on the people around you, both by growing them and by connecting them to real food, To live the sweetlife and celebrate your passion + purpose, A collaborative team of people who live our core values and have your back, A clear career path with opportunities for development, both personally and professionally, Free sweetgreen swag", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3882273510"}