{"jobTitle": "Consumer Product Marketing Manager", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "122,000.00/yr - 176,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "We're looking for an experienced Consumer Product Marketing Manager to join our growing product marketing team, and support our global audience. As a Consumer Product Marketer at Meta, you will help grow products used by billions of people and businesses all over the world across our apps including Facebook, Instagram, WhatsApp, Threads, and Reality Labs and drive complex cross-company initiatives. We're looking for data-driven, consumer-focused Product Marketing Managers to join our growing global team. This role is responsible for leading inbound and outbound product marketing initiatives. You will be responsible for influencing product strategies and positioning for target audiences, driving go-to-marketing efforts that drive awareness and adoption and working cross functionally with partners throughout the company. If you are a strategic marketer who is analytical and creative, excel at leading complex projects in fast-paced environments and are passionate about connecting consumers with great products, then we'd like to connect with you.We have opportunities available across our family of apps and platforms.<br/><br/>Consumer Product Marketing Manager Responsibilities:<br/><br/><ul><li>Influence and shape product strategies, positioning and narratives through the use of data and insights for target audiences in close collaboration with research, product, comms and policy.</li><li>Develop and execute on go-to-market strategies including goals, metrics for success, asset development and integrated launch planning with cross functional partners.</li><li>Partner with brand and integrated marketing on outbound marketing and advertising strategies and programs to drive awareness, adoption and long term engagement</li><li>Tackle complex problems with a strategic mindset, and create thoughtful recommendations and action plans for solving those problems<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>7+ years of full-time experience in Marketing</li><li>Direct experience in Product Marketing, partnering closely with Product teams</li><li>Experience with consumer GTM strategies based on consumer driven insights</li><li>Experience with consumer facing product launches and consumer campaigns</li><li>Experience working with product, marketing, policy and communications teams at all levels of management, both internally and externally</li><li>Experience driving presentations with executives and cross functional teams</li><li>Experience developing and driving analytically rigorous online and offline marketing campaigns with a variety of internal teams and external stakeholders</li><li>Project management experience<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Bachelor's Degree in Business, Marketing or Creative discipline</li><li>MBA</li><li>Internet or technology industry experience</li><li>International experience</li><li>Copywriting experience<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$122,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Influence and shape product strategies, positioning and narratives through the use of data and insights for target audiences in close collaboration with research, product, comms and policy. Develop and execute on go-to-market strategies including goals, metrics for success, asset development and integrated launch planning with cross functional partners. Partner with brand and integrated marketing on outbound marketing and advertising strategies and programs to drive awareness, adoption and long term engagement Tackle complex problems with a strategic mindset, and create thoughtful recommendations and action plans for solving those problems", "qualifications": {"required": "7+ years of full-time experience in Marketing Direct experience in Product Marketing, partnering closely with Product teams Experience with consumer GTM strategies based on consumer driven insights Experience with consumer facing product launches and consumer campaigns Experience working with product, marketing, policy and communications teams at all levels of management, both internally and externally Experience driving presentations with executives and cross functional teams Experience developing and driving analytically rigorous online and offline marketing campaigns with a variety of internal teams and external stakeholders Project management experience", "preferred": "Bachelor's Degree in Business, Marketing or Creative discipline MBA Internet or technology industry experience International experience Copywriting experience"}, "skills": ["Product Marketing", "Marketing", "Consumer Insights", "Product Launches", "Marketing Campaigns", "Project Management", "Brand Marketing", "Integrated Marketing", "Go-to-Market Strategy", "Data Analysis", "Strategic Thinking", "Cross-Functional Collaboration", "Presentation Skills", "Communication Skills"], "postedDate": "2 weeks ago", "benefits": "$122,000/year to $176,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3883102191"}