{"jobTitle": "Transportation Supv - Commerce", "company": {"name": "Republic National Distributing Company", "industry": "Beverage Manufacturing", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00 - 90,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Beverage Manufacturing", "description": "Republic National Distributing Company (RNDC) is a family-owned business with roots extending before Prohibition that has evolved into one of the nation's largest wine and spirits wholesalers. Our success is grounded in our core values of Family, Service, Accountability, Honesty, and Professionalism. We offer a vibrant, inclusive culture and workplace experience for individuals who want a career that makes them feel accomplished and engaged. RNDC values the health and well-being of our associates, inside and outside the office, offering dynamic health and wellness benefits that supply exceptional care and value. RNDC is geared toward growing our footprint and our people. Join our team of energetic professionals who believe in many happy hours and are experts in our craft.<br/><br/><strong>Summary<br/><br/></strong>RNDC is looking for a dynamic, strategic, and professional Transportation Supervisor to join our growing Operations team. The Transportation Supervisor Directs and coordinates operational activities of delivery equipment and personnel by performing the following duties.<br/><br/><strong>In this role, you will<br/><br/></strong><ul><li>Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. May have responsibility to recommend performance management actions including but not limited to selection and hiring, transferring and discharging, the assignment of work, the receipt of rewards or progressive discipline. </li><li>Supervises all aspects of the product delivery operation and customer relations.</li><li>Oversee the routing of delivery trucks using the computerized Roadnet routing system and assigns all drivers and driver helpers to each route each day.</li><li>Updates, review and sets delivery routes through out the day using the GreenMile driver tracking software.</li><li>Monitor driving performance per driver using the Geotab telematics software.</li><li>Rides with drivers to observe work habits and identify areas of needed improvement conducting training when necessary.</li><li>Trains drivers in the areas of safe driving, proper lifting techniques and company delivery process and procedure and interacts with internal departments and customers to resolve delivery problems as they occur throughout the day.</li><li>Enforce all company safety and security policies and programs and on occasion may be called upon to run a delivery route as business dictates. <br/><br/></li></ul><strong>What you bring to RNDC<br/><br/></strong><ul><li>Associates degree from a two year college or technical school preferred.</li><li>Three or more years related experience, of which two to three years previous transportation and/or training; or equivalent combination of education and experience.</li><li>Requires a current state driver's license</li><li>CDL License</li><li>Alcohol Beverage Commission (ABC) License, as required by the state (i.e. TABC License – Texas) <br/><br/></li></ul><strong>What's in it for you<br/><br/></strong><ul><li>401(k) with company matching</li><li>Medical, dental and vision benefits*</li><li>Generous paid time off program – work your way up to 5 weeks of PTO a year with the ability to carryover unused PTO</li><li>Paid volunteer time</li><li>Paid parental leave</li><li>Paid caregiver leave</li><li>Fertility benefits </li><li>Paid training</li><li>Company paid life insurance, short-term disability and company-paid holidays</li><li>Associate resource groups, and diversity, equity and inclusion programs available for all associates</li><li>Participation in these programs are subject to applicable wait periods and all plan and program terms and eligibility<br/><br/></li></ul><strong>COVID-19 Considerations<br/><br/></strong>We follow CDC Guidelines and have a fun and safe environment for our teams.<br/><br/><strong>Bonus if you bring<br/><br/></strong><ul><li>Bachelors degree </li><li>Previous experience in the Wine and Spirits industry</li><li>WSET certifications<br/><br/></li></ul><strong>Compensation<br/><br/></strong>This compensation information is a good faith estimate and provided in accordance with California state law. Similar positions located outside of this jurisdiction may not necessarily receive the same compensation. The salary generally starts at The salary is an estimate based on an applicant's skills and experience.<br/><br/>Salary/Hourly: Salaried $70,000 - $90,000<br/><br/>Republic National Distributing Company and National Distributing Company are Equal Opportunity/Affirmative Action employers. It is our policy not to discriminate against any Employee or Applicant. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, among other things, or status as a qualified individual with disability. This policy of nondiscrimination in employment includes but is not limited to: recruitment, hiring, placement, promotion, transfer, employment advertising or solicitations, compensation, layoff or termination of employment.<br/><br/>For candidates applying to a job in California, please refer to the California Consumer Privacy Act (CCPA). To learn about the CCPA click here.<br/><br/>RNDC is committed to providing reasonable accommodation to people with disabilities throughout the job application and interview process, to the point of undue hardship. If you require an accommodation during the application or interview process, please email applicantaccommodation@rndc-usa.com.", "responsibilities": "The Transportation Supervisor Directs and coordinates operational activities of delivery equipment and personnel by performing the following duties.", "qualifications": {"required": "Associates degree from a two year college or technical school preferred. Three or more years related experience, of which two to three years previous transportation and/or training; or equivalent combination of education and experience. Requires a current state driver's license. CDL License. Alcohol Beverage Commission (ABC) License, as required by the state (i.e. TABC License – Texas)", "preferred": "Bachelors degree Previous experience in the Wine and Spirits industry WSET certifications"}, "skills": ["Transportation", "Training", "Customer Relations", "Roadnet", "GreenMile", "Geotab", "Safe Driving", "Lifting Techniques", "Delivery Process", "Safety and Security"], "postedDate": "4 months ago", "benefits": "401(k) with company matching Medical, dental and vision benefits* Generous paid time off program – work your way up to 5 weeks of PTO a year with the ability to carryover unused PTO Paid volunteer time Paid parental leave Paid caregiver leave Fertility benefits Paid training Company paid life insurance, short-term disability and company-paid holidays Associate resource groups, and diversity, equity and inclusion programs available for all associates Participation in these programs are subject to applicable wait periods and all plan and program terms and eligibility", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3884620222"}