{"jobTitle": "Senior Event Project Manager (Corporate Conferences)", "company": {"name": "Show Gear Productions", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 100,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Events Services", "description": "<br/><p>Project Manager</p><p><br/></p><p><strong>About the job</strong></p><p>Show Gear Productions is family owned and operated. With over 25 years of experience, Show Gear Productions has established itself as a leading provider of audio-visual technical services and equipment for a variety of events and productions. Catering to both in-person and virtual events across the country, we offer support for entertainment, corporate, non-profit, educational, and trade shows. Show Gear Productions is dedicated to delivering exceptional service to every client.</p><p><br/></p><p><strong>Summary Of Position</strong></p><ul><li>This is <strong>NOT</strong> a meeting planner position. This is a technical Project management position for an AV Company.</li><li>The Position is <strong>REMOTE </strong>and is Client Facing.</li><li>The position requires on <strong>average 10 days of travel per month</strong>, less during the “off seasons’.</li></ul><p><br/></p><p>As a Project Manager at Show Gear Productions, you will play a crucial role in the successful planning, execution, and delivery of our clients' events. Your responsibilities will include taking ownership of assigned projects, creating project timelines, working closely with Technical Design to understand technical and creative requirements, determining staffing needs, managing budgets, scheduling equipment resources, and overseeing pre-production, on-site production, and post-production reconciliations. You will also lead client stakeholder meetings and manage other essential aspects of the project. To excel in this role, you must be a skilled manager and individual contributor who thrives in a fast-paced, project-driven environment. Strong time management and organizational skills, as well as the ability to work effectively in a team-oriented culture, are also essential. Note that work may be required in the evenings, weekends, and holidays.</p><p><br/></p><p>About Us</p><ul><li>Show Gear Productions is a Full-service AV Production Company based in Orange County California.</li><li>Show Gear is team orientated and has an excellent reputation for treating its employees with <strong>RESPECT</strong>, <strong>FLEXIBILITY</strong>, and <strong>FAIR SALARY.</strong></li><li>Show Gear is family Owned!</li></ul><p><br/></p><p><strong>Responsibilities</strong></p><p>As a Project Manager at Show Gear Productions, your primary duties and responsibilities will include:</p><ul><li>Project Planning: Manage projects from inquiry to execution to reconciliation, ensuring that each project is completed on time and on budget with technical and creative excellence.</li><li>Exceptional Customer Experience: Deliver outstanding experience for customers by ensuring that projects are completed with the highest level of technical and creative excellence.</li><li>Pre-Sales Support: Provide support to sales by assisting with resources, capabilities, and budgeting.</li><li>Technical Requirements: Work with Technical Design to determine all technical requirements, including lighting, video (LED, projection and virtual), audio, rigging, and other production items.</li><li>Client Support: Support clients by understanding their needs, budgets, and timelines and ensuring that projects are completed to their satisfaction.</li><li>Logistics: Coordinate transportation, sub-rentals, and labor needs with the Operations team.</li><li>On-Site Production: Lead on-site production and work closely with the Operations team to ensure the successful delivery of projects.</li><li>Financial Management: Budget and track project expenditures to ensure profitability and that projects are completed within scope.</li><li>All-in Attitude: Be willing to jump in and assist in delivering an exceptional experience for clients.</li><li>Project Management: Manage multiple projects simultaneously, including live, hybrid, and virtual events, and supervise colleagues and crew both on-site and remotely to meet deadlines and project objectives.</li><li>Self-Starter: Be a self-starter with a big-picture attitude and utilize the Project Management Process to facilitate the Show Gear Productions experience.</li><li>Technical Aptitude: Possess a well-rounded technical aptitude in current AV industry technologies.</li></ul><p><br/></p><p><strong>Requirements</strong></p><ul><li>At least 10 Years Experience in the Corporate Conference Audio Visual Industry.</li><li>Experience with a CAD software similar to VectorWorks</li><li>Bonus Twin Motion or Unreal Engine</li><li>Experience with an inventory software similar to Flex</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>Project Management Knowledge: Thorough understanding of Project Management tools and processes.</li><li>Relevant Experience: At least 5 years of experience in Project Management.</li><li>AV Industry Knowledge: Familiarity with AV industry technologies and practices is preferred. Technical aptitude is an advantage.</li><li>Team Player: Ability to work effectively both in a team environment and as an individual contributor.</li><li>Project Management Certification: A Project Management Professional certification is a plus, but not mandatory.</li></ul><p><br/></p><p><strong>Skills</strong></p><ul><li>Communication skills: Strong verbal and written communication skills.</li><li>Organizational skills: Strong organizational skills with the ability to multitask.</li><li>Team Player: Ability to work both independently and as a key member of a team.</li><li>Event Planning Experience: Experience in planning or managing live events, virtual or hybrid meetings and events is preferred.</li></ul><p><br/></p><p>Show Gear Productions acknowledges that its success is rooted in the success of its employees. As one of the leading audio-visual technical production companies for meetings and events in Southern California, Show Gear Productions boasts a team of knowledgeable, passionate, and performance-driven individuals.</p><p><br/></p><p>Our Competitive Compensation Package Includes:</p><p>Competitive salary</p><p>Vacation</p><p>Profit Sharing</p><p>Monthly Expense Stipend</p>", "responsibilities": "As a Project Manager at Show Gear Productions, your primary duties and responsibilities will include:\n\n* Project Planning: Manage projects from inquiry to execution to reconciliation, ensuring that each project is completed on time and on budget with technical and creative excellence.\n* Exceptional Customer Experience: Deliver outstanding experience for customers by ensuring that projects are completed with the highest level of technical and creative excellence.\n* Pre-Sales Support: Provide support to sales by assisting with resources, capabilities, and budgeting.\n* Technical Requirements: Work with Technical Design to determine all technical requirements, including lighting, video (LED, projection and virtual), audio, rigging, and other production items.\n* Client Support: Support clients by understanding their needs, budgets, and timelines and ensuring that projects are completed to their satisfaction.\n* Logistics: Coordinate transportation, sub-rentals, and labor needs with the Operations team.\n* On-Site Production: Lead on-site production and work closely with the Operations team to ensure the successful delivery of projects.\n* Financial Management: Budget and track project expenditures to ensure profitability and that projects are completed within scope.\n* All-in Attitude: Be willing to jump in and assist in delivering an exceptional experience for clients.\n* Project Management: Manage multiple projects simultaneously, including live, hybrid, and virtual events, and supervise colleagues and crew both on-site and remotely to meet deadlines and project objectives.\n* Self-Starter: Be a self-starter with a big-picture attitude and utilize the Project Management Process to facilitate the Show Gear Productions experience.\n* Technical Aptitude: Possess a well-rounded technical aptitude in current AV industry technologies.", "qualifications": {"required": "At least 10 Years Experience in the Corporate Conference Audio Visual Industry.", "preferred": "Experience with a CAD software similar to VectorWorks\nBonus Twin Motion or Unreal Engine\nExperience with an inventory software similar to Flex"}, "skills": ["Project Management", "AV", "Event Planning", "Communication", "Organizational Skills", "Teamwork", "Technical Aptitude", "VectorWorks", "Twin Motion", "Unreal Engine", "Flex"], "postedDate": "4 months ago", "benefits": "Competitive salary\nVacation\nProfit Sharing\nMonthly Expense Stipend", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3884249935"}