{"jobTitle": "Supply Chain Manager", "company": {"name": "Conexus Food Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $115,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "<strong>Who We Are<br/><br/></strong>Established in 1986, N.A. Trading Company has steadily grown to become one of the premier Asian food importers/distributors in the Los Angeles area.<br/><br/>N.A. Trading Company imports products mainly from Thailand, Taiwan, Hong Kong, and China. With over a thousand different kinds of food and merchandise items under well-known labels such as FOCO, Chao-koh, Aroy-D, Pantainorasingh, and our very own Three Deer Brand. Our most popular items include jasmine rice, canned coconut juice, coconut milk, instant noodles, mung bean, Thai tea drinks, and frozen durian.<br/><br/><strong>What You’ll Do<br/><br/></strong>As the Supply Chain Manager, your primary responsibility will be to oversee planning and forecasting activities. Drawing upon your demonstrated expertise, you will develop and execute strategic plans, demand forecasts, and inventory management strategies aimed at enhancing supply chain efficiency and satisfying customer demand. Your pivotal role will involve crafting and implementing supply chain planning strategies to propel business expansion and optimize profitability.<br/><br/><ul><li>Develop and implement supply chain planning strategies to optimize inventory levels, minimize stockouts, and ensure timely delivery of products to customers</li><li>Lead the demand forecasting process, utilizing historical data, market trends, and customer insights to develop accurate demand forecasts for all products</li><li>Collaborate with sales, marketing, and production teams to gather inputs and insights for demand forecasting and planning</li><li>Monitor and analyze demand forecast accuracy and adjust forecasting models as needed to improve forecast performance</li><li>Develop and maintain inventory management policies and procedures to ensure optimal inventory levels while minimizing carrying costs and obsolescence</li><li>Coordinate with suppliers and logistics partners to ensure timely delivery of materials and components to support production schedules and meet customer demand</li><li>Implement inventory optimization techniques, such as safety stock management and reorder point planning, to minimize stockouts and excess inventory</li><li>Develop and maintain key performance indicators (KPIs) to track supply chain planning performance and identify areas for improvement</li><li>Stay informed about industry trends, technologies, and best practices in supply chain planning and forecasting to maintain a competitive edge<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li>Bachelor's degree in supply chain management, logistics, business administration, or a related field</li><li>5 years of experience in supply change management with a focus on forecasting and demand planning</li><li>Strong analytical and quantitative skills, with proficiency in demand forecasting techniques and inventory management principles</li><li>Experience with supply chain planning software and tools, such as ERP systems, demand planning software, and inventory optimization software</li><li>Excellent communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams</li><li>Strong project management skills, with the ability to manage multiple projects and priorities simultaneously</li><li>Ability to thrive in a fast-paced, dynamic environment and adapt quickly to changing business requirements</li><li>Strong leadership skills with the ability to motivate and inspire teams to achieve goals<br/><br/></li></ul><strong>Preferred Job Requirements<br/><br/></strong><ul><li>Proficiency in Thai, Vietnamese, Chinese, or other SE Asian Languages are a plus</li><li>Certification in supply chain management (e.g., APICS CPIM, IBF CPF) is a plus</li><li>International trade experience and familiarity with foreign supplier verification programs are a plus<br/><br/></li></ul>Job Type: Full-time<br/><br/>Salary: $90,000.00 - $115,000.00 per year<br/><br/>Powered by JazzHR<br/><br/>4ACasdEYj4", "responsibilities": "As the Supply Chain Manager, your primary responsibility will be to oversee planning and forecasting activities. Drawing upon your demonstrated expertise, you will develop and execute strategic plans, demand forecasts, and inventory management strategies aimed at enhancing supply chain efficiency and satisfying customer demand. Your pivotal role will involve crafting and implementing supply chain planning strategies to propel business expansion and optimize profitability.", "qualifications": {"required": "Bachelor's degree in supply chain management, logistics, business administration, or a related field\n5 years of experience in supply change management with a focus on forecasting and demand planning\nStrong analytical and quantitative skills, with proficiency in demand forecasting techniques and inventory management principles\nExperience with supply chain planning software and tools, such as ERP systems, demand planning software, and inventory optimization software\nExcellent communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams\nStrong project management skills, with the ability to manage multiple projects and priorities simultaneously\nAbility to thrive in a fast-paced, dynamic environment and adapt quickly to changing business requirements\nStrong leadership skills with the ability to motivate and inspire teams to achieve goals", "preferred": "Proficiency in Thai, Vietnamese, Chinese, or other SE Asian Languages are a plus\nCertification in supply chain management (e.g., APICS CPIM, IBF CPF) is a plus\nInternational trade experience and familiarity with foreign supplier verification programs are a plus"}, "skills": ["Supply Chain Management", "Demand Planning", "Inventory Management", "ERP Systems", "Project Management", "Leadership"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3884744335"}