{"jobTitle": "E-Commerce Manager", "company": {"name": "Zivahh LLC", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "<strong>What You Will Be Doing<br/><br/></strong><ul><li>Develop and implement holistic e-commerce strategies aligned with company goals.</li><li>Drive revenue growth through effective merchandising and promotions.</li><li>Analyze sales data, customer behavior, and market trends.</li><li>Monitor key performance indicators (KPIs) to assess e-commerce initiatives.</li><li>Oversee website, navigation and functionality to enhance user experience.</li><li>Collaborate with design and development teams to implement user-friendly features.</li><li>Manage and direct E-commerce Associate Merchandiser in the set up of products and pricing.</li><li>Execute SEO content strategy with the SEO agency.</li><li>Utilize analytics tools for insights, tracking performance, and generating reports.</li><li>Launch new product listings, landing pages, campaigns, and promotions.</li><li>Work on Shopify content improvements and app integrations.<br/><br/></li></ul><strong>Experience You Will Need<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Business, E-commerce, or related field.</li><li>2+ years of proven e-commerce management experience.</li><li>Strong understanding of Shopify, digital marketing, SEO, SEM, and social media.</li><li>Proficiency in using Shopify e-commerce platforms.</li><li>Analytical mindset, coupled with excellent communication and project management skills.</li><li>Must be detail-oriented and committed to delivering high-quality results within deadlines.</li><li>Experience in the apparel industry is a plus.</li></ul>", "postedDate": "4 months ago", "skills": ["Shopify", "Digital Marketing", "SEO", "SEM", "Social Media"], "url": "https://www.linkedin.com/jobs/view/3884950401"}