{"jobTitle": "Care Manager", "company": {"name": "WorkPath Partners", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Staffing and Recruiting", "description": "Job Description: Will the position be 100% remote? Yes (need to reside in Tri State area in case of on site meeting)<br/>• Are there any specific location requirements? Must reside in Tri State area<br/>• What are the must have requirements? Knowledge of MLTC and NY Medicaid policy. Actually creating the care plans for adult/ geriatric patients. Not just working with MLTC dept coordinator. Also NOT in just a hospital or nursing home or facility.<br/>• What specific experience do they need to have/know? MLTC experience, Acknowledge of UAS Assessment.<br/>• What are the day to day responsibilities? Outreach calls and Person-Centered Care Plan reviews. Coordinate care, manager caseload, create Patient Centered Service Plans.<br/>• Is there specific licensure is required in order to qualify for the role? RN/LMSW/LCSW- Licensed in the State of NY<br/>• What languages are required? For this request we need candidates who are bilingual in KOREAN<br/>• What sort of case load will this person manage? 2-3 PCSP review per day, or 225-230 caseload. For context the NY Health plan added 940 new members last month.<br/><br/>Must have previous experience working remote. Self motivated, tech savvy and able to work indecently to complete a min of 7 successful calls a day,. At the end of the month the CM must have 125 contacts with members.<br/><br/>Will require- laptop, keyboard, mouse, headset, dual monitors and a docking station.<br/><br/><br/><br/>Summary: Responsible for health care management and coordination of *** Healthcare members in order to achieve optimal clinical, financial and quality of life outcomes. Works with members to create and implement an integrated collaborative plan of care. Coordinates and monitors *** members progress and services to ensure consistent cost effective care that complies with *** policy and all state and federal regulations and guidelines. Essential Functions: Provides case management services to members with chronic or complex conditions including: o Proactively identifies members that may qualify for potential case management services. o Conducts assessment of member needs by collecting in-depth information from ***s information system, the member, members family/caregiver, hospital staff, physicians and other providers. o Identifies, assesses and manages members per established criteria. o Develops and implements a case management plan in collaboration with the member, caregiver, physician and/or other appropriate healthcare professionals to address the member needs. o Performs ongoing monitoring of the plan of care to evaluate effectiveness. o Documents care plan progress in ***s information system. o Evaluates effectiveness of the care plan and modifies as appropriate to reach optimal outcomes. o Measures the effectiveness of interventions to determine case management outcomes. Promotes integration of services for members including behavioral health and long term care to enhance the continuity of care for *** members. Conducts face to face or home visits as required. Maintains department productivity and quality measures. Manages and completes assigned work plan objectives and projects in a timely manner. Demonstrates dependability and reliability. Maintains effective team member relations. Adheres to all documentation guidelines activities. Attends regular staff meetings. Participates in Interdisciplinary Care Team (ICT) meetings. Assists orientation and mentoring of new team members as appropriate. Maintains professional relationships with provider community and internal and external customers. Conducts self in a professional manner at all times. Maintains cooperative and effective workplace relationships and adheres to company Code of Conduct. Participates in appropriate case management conferences to continue to enhance skills/abilities and promote professional growth. Complies with required workplace safety standards. Knowledge/Skills/Abilities: Demonstrated ability to communicate, problem solve, and work effectively with people. Excellent organizational skill with the ability to manage multiple priorities. Work independently and handle multiple projects simultaneously. Strong analytical skills. Knowledge of applicable state, and federal regulations. Knowledge of ICD-9, CPT coding and HCPC. Knowledge of SSI, Coordination of benefits, and Third Party Liability programs and integration. Familiarity with NCQA standards, state/federal regulations and measurement techniques. In depth knowledge of CCA and/or other Case Management tools. Ability to take initiative and see tasks to completion. Computer skills and experience with Microsoft Office Products. Excellent verbal and written communication skills. Ability to abide by ***s policies. Able to maintain regular attendance based upon agreed schedule. Maintain confidentiality and comply with Health Insurance Portability and Accountability Act (HIPAA). Skilled at establishing and maintaining positive and effective work relationships with coworkers, clients, members, providers and customers. Required Education: Bachelors Degree in Social Work or Health Education (a combination of experience and education will be considered in lieu of degree). Required Experience: 5-7 years of clinical experience with Case Management experience. Required Licensure/Certification: Must have valid drivers license with good driving record and be able to drive locally.<br/>Comments for Suppliers:", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3885914592"}