{"jobTitle": "Logistics Analyst - CA", "company": {"name": "EDRAY Collaborative Port Logistics", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50000 - 70000 per year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Position Summary<br/><br/></strong>The Logistics Analyst is an onsite role that will oversee supply chain processes and container delivery by tracking and reviewing shipment data, status, and delivery route activity. We are looking for those who thrive in high growth start-up environments! This role will mainly consist of account management, analytics, operations, and support.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>The essential functions include, but are not limited to the following:<br/><br/><ul><li>Collects, interprets, and analyzes various types of logistics data including availability of containers, reliability of transport and delivery, and other data related to supply chain management.</li><li>Maintains database(s) of logistics information for multiple customer accounts.</li><li>Tracks container network from origin to delivery via web-based logistics systems and other appropriate methods of monitoring inventory and shipment vehicles.</li><li>Reviews logistics processes and procedures; identifies, recommends, and implements improvements to maximize delivery efficiency while minimizing costs.</li><li>Uses analytic methods to understand data trends as well as predict and/or control logistics operations and processes.</li><li>Monitors container yard and DC inventories to capture key events such as delivery, offloading, and pickup milestones.</li><li>Performs other related duties, as assigned.<br/><br/></li></ul><strong>Minimum Qualifications (knowledge, Skills, And Abilities)<br/><br/></strong><ul><li>Highschool diploma or equivalent.</li><li>Excellent analytical and problem-solving skills.</li><li>Excellent written and verbal communication skills.</li><li>Proficient with Microsoft Office products (Excel, Word, Power Point, Outlook)</li><li>Strong attention to detail.</li><li>Able to work independently and in a team environment. <br/><br/></li></ul><strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to<br/><br/>successfully perform the essential functions of this position. Reasonable accommodations may be made.<br/><br/><ul><li> Specific vision abilities required by this job include close vision, color vision, and ability to adjust focus.</li><li> Frequently required to sit; occasionally required to stand and walk</li><li> Occasionally required to reach with hands and arms</li><li> Frequently required to talk or hear</li><li> Occasionally required to bend, twist, or climb. Moderate concentration/intensity, which includes prolonged mental effort with limited opportunity for breaks.</li><li> Average memory, taking into consideration the amount and type of information.</li><li> Moderate level of complexity for decision making. Average time pressure of decision making.</li><li> The noise level in the work environment is usually moderate<br/><br/></li></ul>NOTE<br/><br/>This job description in no way states or implies that these are the only duties to be performed by the employee(s) incumbent in this position. Employees will be required to follow any other job-related instructions and to perform any other job-related duties requested by any person authorized to give instructions or assignments. All duties and responsibilities are essential functions and requirements and are subject to possible modification to reasonably accommodate individuals with disabilities. To perform this job successfully, the incumbents will possess the skills, aptitudes, and abilities to perform each duty proficiently. Some requirements may exclude individuals who pose a direct threat or significant risk to the health or safety of themselves or others. The requirements listed in this document are the minimum levels of knowledge, skills, or abilities. This document does not create an employment contract, implied or otherwise, other than an \"at will\" relationship.<br/><br/>Salary: $50000 - $70000 per year", "responsibilities": "The essential functions include, but are not limited to the following:<br/><br/><ul><li>Collects, interprets, and analyzes various types of logistics data including availability of containers, reliability of transport and delivery, and other data related to supply chain management.</li><li>Maintains database(s) of logistics information for multiple customer accounts.</li><li>Tracks container network from origin to delivery via web-based logistics systems and other appropriate methods of monitoring inventory and shipment vehicles.</li><li>Reviews logistics processes and procedures; identifies, recommends, and implements improvements to maximize delivery efficiency while minimizing costs.</li><li>Uses analytic methods to understand data trends as well as predict and/or control logistics operations and processes.</li><li>Monitors container yard and DC inventories to capture key events such as delivery, offloading, and pickup milestones.</li><li>Performs other related duties, as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Highschool diploma or equivalent. Excellent analytical and problem-solving skills. Excellent written and verbal communication skills. Proficient with Microsoft Office products (Excel, Word, Power Point, Outlook) Strong attention to detail. Able to work independently and in a team environment. "}, "skills": ["Microsoft Office", "Excel", "Word", "PowerPoint", "Outlook", "Logistics", "Supply Chain Management", "Data Analysis", "Problem Solving", "Communication"], "postedDate": "5 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3887955729"}