{"jobTitle": "Senior Human Resource Manager", "company": {"name": "SummitHR", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "The HR Senior partner position is responsible for aligning business objectives with management in designated business units. The position initiates partnerships across the HR function to deliver value-added service to management that reflects the business objectives of the company..<br/><br/><strong>Job Description<br/><br/></strong><ul><li>Designs approaches to improve organizational, operational, and people strategies. Customizes HR, talent management, and operational solutions to address specific business imperatives to positively impact operational performance.</li><li>Establishes and maintains collaborative, credible, trusting partnerships with individuals across a broad range of people and groups, both internal and external.</li><li>Partners with a cross-functional group of subject-matter resources to design and execute shared operational and talent strategies</li><li>Uses data analytics and reporting to advise and guide senior executives and operational leaders for effective and insightful decision-making. Distills complex information into key insights, clear recommendations, and action plans.</li><li>Leads challenging conversations and interactions.</li><li>Conducts weekly meetings with respective business units.</li><li>Consult regularly with management and provide guidance when appropriate</li><li>Assess and anticipate human resources-related needs</li><li>Provide input on workforce and succession planning as well as plans business unit restructuring</li><li>Maintain awareness of the culture, plans, financial position, and competition of the business units under the HR purview</li><li>Identify ways to build morale, improve workplace relationships, and boost productivity and retention, conflict resolutions</li><li>Interpret human resources policy to company management</li><li>Perform other related duties as required and assigned.</li><li>Demonstrate behaviors which are aligned with the organization's desired culture and values. <br/><br/></li></ul><strong>Ideal Candidate Will Have The Following<br/><br/></strong><ul><li>Experience in a high-volume, fast paced environment on a national level</li><li>Working knowledge of multiple human resource disciplines, including compensation practices, organizational diagnosis, employee and union relations, diversity, performance management, and federal and state respective employment laws.</li><li>Bachelor's degree preferred.</li><li>Excellent verbal and written communication skills.</li><li>Excellent interpersonal and customer service skills.</li><li>Excellent organizational skills and attention to detail.</li><li>Ability to comprehend, interpret, and apply the appropriate sections of applicable laws, guidelines, regulations, ordinances, and policies.</li><li>Ability to acquire a thorough understanding of the organization's hierarchy, jobs, qualifications, compensation practices, and the administrative practices related to those factors.</li><li>Excellent time management skills with a proven ability to meet deadlines.</li><li>Strong analytical and problem-solving skills.</li><li>10 Years Experience</li><li>Bachelor's Degree<br/><br/></li></ul>To see new and updated job postings and job postings similar to this, please follow us on LinkedIn: https://www.linkedin.com/company/summithr<br/><br/>Salary: $85 - $125 per year<br/><br/><em>Job Posted by ApplicantPro</em>", "postedDate": "5 months ago", "salary": {"amount": "85 - 125", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3887961998"}