{"jobTitle": "Business Development Executive", "company": {"name": "SummitHR", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "Our Preferred Candidate Will Be Able To\n\nManage responses and book calls with prospects from an outbound marketing campaign.\nBuild Long Term Relationships with decision makers in the Mortgage Banking Industry\nSchedule 4-6 meetings with major client decision makers each week.\nParticipate in decision-maker meetings to hand off relationships and help close deals.\nManage a large pipeline of deals and prospects, setting tasks and personalizing follow up email campaigns.\nCustomize pitch decks and other sales collateral to tailor your pitch for each prospect.\nTravel to meet prospects in person.\nCollaborate with C-Suite and Marketing Team in developing new advertising and outreach campaigns.\nLog all daily activity in a sales CRM.\n\nOptimal Experience\n\nSchedule meetings with sales leaders and decision-makers in the mortgage industry. Develop Relationships and close sale in a 60-90 day cycle.\nAble to conduct discovery call and hand off prospects to executives.\nSupport of prospects with a prompt, friendly, and professional outlook with no dropped leads.\nManage a busy calendar, inbox, and sales pipeline placing 60-80 Outbound Calls/emails per day.\nResearch companies and contacts and communicate with C-Suite and Go-To-Market Team for signing up new partners.", "responsibilities": "Manage responses and book calls with prospects from an outbound marketing campaign. Build Long Term Relationships with decision makers in the Mortgage Banking Industry. Schedule 4-6 meetings with major client decision makers each week. Participate in decision-maker meetings to hand off relationships and help close deals. Manage a large pipeline of deals and prospects, setting tasks and personalizing follow up email campaigns. Customize pitch decks and other sales collateral to tailor your pitch for each prospect. Travel to meet prospects in person. Collaborate with C-Suite and Marketing Team in developing new advertising and outreach campaigns. Log all daily activity in a sales CRM.", "qualifications": {"required": "Not specified", "preferred": "Not specified"}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3887966777"}