{"jobTitle": "Project Management Assistant - Hybrid", "company": {"name": "PM2CM, Inc.", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "The position is based in Pomona with two days (Tuesday and Wednesday) working at the office. <br/><br/><strong>Company Overview:<br/><br/></strong>PM2CM, Inc., is a professional services company dedicated to providing Program, Project and Construction Management, Scheduling, Cost Controls and Claims avoidance and Mitigation services to our clients.<br/><br/>Our goal is simple: To offer and deliver the \"best in class\" project management, construction management and project controls services that allow our clients to build with confidence!<br/><br/>To achieve these objectives, we will strive to hire the best qualified professionals, provide training and mentoring to our budding professionals, have a sound and complete understanding of our client's corporate and project needs and provide our services with integrity and stellar professionalism.<br/><br/><strong>Position Overview:<br/><br/></strong>As a Project Management Support, you will play a crucial role in assisting our project managers in planning, executing, and monitoring various projects. Your exceptional organizational skills, attention to detail, and ability to collaborate with cross-functional teams will be key in ensuring the successful delivery of projects within deadlines and budget constraints. This position is an excellent opportunity for someone looking to develop their project management skills in a fast-paced and rewarding environment.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Project Planning: Collaborate with project managers to develop comprehensive project plans, defining project scope, goals, deliverables, resources, and timelines</li><li>Documentation Management: Maintain accurate and up-to-date project documentation, including project schedules, meeting minutes, action items, and project reports</li><li>Communication: Facilitate clear and effective communication among team members, stakeholders, and project managers, ensuring all parties are informed of project progress, changes, and potential risks</li><li>Task Coordination: Assist in coordinating tasks and activities between team members, monitoring progress, and addressing any roadblocks to ensure timely completion of project milestones</li><li>Resource Management: Help allocate resources efficiently and effectively, ensuring the right personnel and materials are available for each project phase</li><li>Risk Identification: Collaborate in identifying potential project risks and assist in developing mitigation plans to minimize their impact on project outcomes</li><li>Quality Assurance: Support project managers in ensuring that deliverables meet quality standards and align with client expectations</li><li>Budget Tracking: Assist in monitoring project budgets, tracking expenses, and reporting financial status to project managers and relevant stakeholders</li><li>Post-Project Evaluation: Participate in post-project evaluations, gathering feedback, analyzing results, and identifying areas for improvement</li><li>Continuous Improvement: Contribute to the enhancement of project management processes and best practices, promoting efficiency and effectiveness across the organization<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor's degree with 3 years or more experience as a project management support</li><li>Proven experience in project coordination, administration, or a similar support role is advantageous</li><li>Strong organizational skills with a keen eye for detail and the ability to manage multiple tasks simultaneously</li><li>Excellent written and verbal communication skills to foster effective team collaboration and stakeholder engagement</li></ul>", "responsibilities": "As a Project Management Support, you will play a crucial role in assisting our project managers in planning, executing, and monitoring various projects. Your exceptional organizational skills, attention to detail, and ability to collaborate with cross-functional teams will be key in ensuring the successful delivery of projects within deadlines and budget constraints. This position is an excellent opportunity for someone looking to develop their project management skills in a fast-paced and rewarding environment.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Project Planning: Collaborate with project managers to develop comprehensive project plans, defining project scope, goals, deliverables, resources, and timelines</li><li>Documentation Management: Maintain accurate and up-to-date project documentation, including project schedules, meeting minutes, action items, and project reports</li><li>Communication: Facilitate clear and effective communication among team members, stakeholders, and project managers, ensuring all parties are informed of project progress, changes, and potential risks</li><li>Task Coordination: Assist in coordinating tasks and activities between team members, monitoring progress, and addressing any roadblocks to ensure timely completion of project milestones</li><li>Resource Management: Help allocate resources efficiently and effectively, ensuring the right personnel and materials are available for each project phase</li><li>Risk Identification: Collaborate in identifying potential project risks and assist in developing mitigation plans to minimize their impact on project outcomes</li><li>Quality Assurance: Support project managers in ensuring that deliverables meet quality standards and align with client expectations</li><li>Budget Tracking: Assist in monitoring project budgets, tracking expenses, and reporting financial status to project managers and relevant stakeholders</li><li>Post-Project Evaluation: Participate in post-project evaluations, gathering feedback, analyzing results, and identifying areas for improvement</li><li>Continuous Improvement: Contribute to the enhancement of project management processes and best practices, promoting efficiency and effectiveness across the organization<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree with 3 years or more experience as a project management support, Proven experience in project coordination, administration, or a similar support role is advantageous, Strong organizational skills with a keen eye for detail and the ability to manage multiple tasks simultaneously, Excellent written and verbal communication skills to foster effective team collaboration and stakeholder engagement"}, "skills": [], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3887695341"}