{"jobTitle": "Accounting Clerk", "company": {"name": "Zortech Solutions", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "1st Shift<br/><br/>LOOKING FOR PAYROLL CLERK - TEMP TO HIRE<br/><br/><strong>Position Summary<br/><br/></strong>With direct supervision, responsible for any combination of calculating, posting, and verifying of accounting data<br/><br/>following well defined procedures in one or more of the following functions: Accounts Payable, Accounts<br/><br/>Receivable, Cost Accounting, Billing, and Payroll/Labor.<br/><br/><strong>Responsibilities<br/><br/></strong>Responsibilities may include some or all of the following:<br/><br/>Process documents such as daily labor cards, payroll, shippers, invoices, accounts payable vouchers and travellers checks.<br/><br/>Type and file vouchers, invoices, statements, reports and maintain records.<br/><br/>Assist in the preparation of financial reports.<br/><br/>Maintain, check and balance records for accuracy.<br/><br/>Interface with functional departments, management, vendors and customers.<br/><br/>Distribute paychecks, timecards and reports.<br/><br/><strong>Job Requirements<br/><br/></strong>Perform other related responsibilities.<br/><br/>One year Accounting/Payroll experience or demonstrated ability to perform described responsibilities.<br/><br/><strong>Prior Computer Experience And Data Entry Preferred.<br/><br/></strong>Ability to accurately input and calculate numbers and operate a 10-key calculator by touch.<br/><br/>Knowledge of California labor laws and taxes where applicable.<br/><br/><strong>Accurate Typing Skills Of 35 WPM May Be Required.<br/><br/></strong>Must demonstrate effective verbal, written and interpersonal communication skills.<br/><br/>Ability to work effectively with others and be a participative team player.", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3888464220"}