{"jobTitle": "Buyer III", "company": {"name": "Artius Solutions", "industry": "IT Services and IT Consulting", "size": "Not specified", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Buyer III is an experienced, mid-level position. Purchase materials, supplies, and services at the most favorable terms for the organization. Daily assignments are varied. Advanced to complex procurement tasks are required. There is latitude for independent judgment.", "responsibilities": "Perform Daily purchasing activities Processing Requisitions and Purchase Orders, Perform sourcing, vendor selection and vendor enrollment, Resolve purchase price variations with cost accounting, Cost Analyze - challenge vendor on price increases to obtain the best value, Maintain and update APL records and scorecards, Market research, RFQ preparation and submittal for projects, equipment, and services, Obtain quotes both sourcing and cost avoidance for daily purchases, and long-term cost savings opportunities, Bid evaluation, Review contract terms and conditions, Negotiating Pricing & Terms with and without supervision, Communicating with the purchasing team and requestors regarding delays or delivery issues, Demand forecasting - Make sound business purchasing decisions to maintain adequate inventory levels, Follows all safety regulations, Perform other duties as assigned", "qualifications": {"required": "Bachelor's degree in finance, Business Management, or Supply Chain Management, or relevant work experience, 5+ years of related experience, Experience within the metals industry, Manufacturing experience is a must, Fundamental experience with purchasing; experience with cost savings/purchasing projects, Must understand the difference between cost savings and cost avoidance, Must be proficient with MS Office, especially Excel, Experience with ERP systems; computer proficient, Must be a problem solver and have a 'can do' attitude, Understand financial impacts and able to make complex buying decisions, Understand of total cost of ownership, Must be detail-oriented, Strong interpersonal skills, Effective communication, both oral and written, Organizational skills, Ability to work independently, with minimal supervision, Good math skills, Analytical thinking and problem-solving", "preferred": "Not specified"}, "skills": ["Buyer", "ERP Systems", "Manufacturing", "Metals Industry", "Supply Chain Management"], "postedDate": "4 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3888437854"}