{"jobTitle": "Business Analyst / Business System Analyst with MediCare / EDI", "company": {"name": "IT Minds LLC", "industry": "IT Services and IT Consulting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Job Description\n\nEducation Required: bachelor's degree in Related Field Instead of a degree, equivalent education and/or experience may be considered.\nEducation Preferred: master's degree in Related Field.\nExperience Required: Minimum of 5-7 years of experience eliciting and documenting business and systems requirements using techniques such as JAR/JAD, SCRUM, etc. OR minimum of 5-7 years of experience developing, implementing, and evaluating workflow processes, policies, and procedures.\nMinimum of 7 years of experience in a managed healthcare environment with strong domain expertise in at least one of the following disciplines: Claims/EDI, Membership, Provider, Care Management, or Finance.\nPreferred: Experience with Tableau and Requirements Management software.\nProven ability to work with a diverse group of people, including leadership, support staff, coworkers, and department management.\nProven ability to lead cross-functional discussions to reach collaborative outcomes.\nProven ability to produce outstanding analysis deliverables on complex, multi-disciplinary projects and programs.\nDemonstrated ability to research complex issues and bring about resolution.\nDemonstrated mentoring and coaching skills to develop other team members.\nExcellent critical thinking and problem-solving skills.\nStrong elicitation and process documentation skills.\nStrong organizational and communication skills to build and foster effective relationships.\nExcellent computer skills: MS Office Suite (Word, Excel, Visio, PowerPoint) skills required.\nExcellent customer service skills with the ability to make independent judgments, handle multiple projects simultaneously, adapt to shifting priorities and utilize time management skills to meet deadlines.\nMust have excellent written and verbal communication skills and the ability to communicate effectively with management and non-management personnel.\nAbility to always maintain a professional and mature demeanor.\nAbility to work in a fast-paced department independently or in a team and handle multiple tasks with competing priorities; work with interruptions and deal effectively with confidential information.", "responsibilities": "Responsibilities\n\nLeads analysis and requirements gathering sessions on large, complex programs and projects using methodologies such as JAD, JAR, SCRUM, etc., to define, analyze, and document business needs and requirements in support of strategic initiatives.\nCollaborates across multiple business units ensuring that all parties get the best possible outcomes for the client and its members and providers.\nDocuments functional and non-functional business needs and requirements, ensuring requirements are usable, specific and testable, and in alignment with business goals and overall business architecture.\nAssists in defining Acceptance Test Criteria, tracing back to documented business requirements.\nCreates and updates complex as-is and future state business workflows to enable the documentation of business process needs and production of requirements for all related business, and operational systems critical to the project or program.\nMakes recommendations for solutions or improvements that can be accomplished through new processes or technology, or alternative uses of existing processes or technology.\nResearches and analyzes data in support of business functions, process knowledge, and systems requirements.\nTracks maintenance of business needs and requirements to ensure they are not attenuated or discarded during the execution and delivery phases.\nSupports the Project Manager by providing more detailed project objectives; clear structured, and usable requirements; tradeoff analysis; requirement feasibility; and risk analysis to improve the execution of the project plan.\nMentors other Solutions Analysts and Business Analysts to strengthen the client's solution and business analysis capability.\nDefines and follows best practices for the organization based on BABOK or other authoritative bodies of knowledge.\nAnalysis in support of the entire ePMO.\nPerform other duties as assigned.", "qualifications": {"required": "Education Required: bachelor's degree in Related Field Instead of a degree, equivalent education and/or experience may be considered. Education Preferred: master's degree in Related Field. Experience Required: Minimum of 5-7 years of experience eliciting and documenting business and systems requirements using techniques such as JAR/JAD, SCRUM, etc. OR minimum of 5-7 years of experience developing, implementing, and evaluating workflow processes, policies, and procedures. Minimum of 7 years of experience in a managed healthcare environment with strong domain expertise in at least one of the following disciplines: Claims/EDI, Membership, Provider, Care Management, or Finance.", "preferred": "Experience with Tableau and Requirements Management software."}, "skills": ["Business Analysis", "Requirements Gathering", "JAD", "SCRUM", "Tableau", "MS Office Suite (Word, Excel, Visio, PowerPoint)", "Critical Thinking", "Problem Solving", "Communication", "Customer Service"], "postedDate": "4 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3888449416"}