{"jobTitle": "Virtual Assistant", "company": {"name": "AO Globe Life", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "postedDate": "4 months ago", "description": "DISCLAIMER: APPLICANT MUST RESIDE IN THE U.S. TO BE CONSIDERED FOR THIS POSITION, ALL OTHER APPLICANTS WILL BE IMMEDIATELY DISQUALIFIED* Are you ready to join the forefront of AO’s unparalleled growth in the bilingual market?<br/><br/>We are on the hunt for exceptionally talented and ambitious bilingual leaders fluent in both Spanish and English to join our extraordinary team!<br/><br/>AO is renowned for its unrivaled growth opportunities that surpass all others.<br/><br/>As a valued member of our bilingual team, you’ll gain exclusive access to specialized mentorship and training calls tailored specifically to enhance your skillset. Brace yourself to become a top earner within the company, as we provide the resources and support you need to soar to new heights of success.<br/><br/><em><strong>Our ideal candidates will embody the following qualities that set them apart:<br/><br/></strong></em><ul><li> Exude professionalism and reliability, establishing themselves as trusted leaders</li><li> Possess an unwavering work ethic and a rapid learning ability, ready to tackle any challenge</li><li> Radiate positivity and excel in client-facing interactions, leaving a lasting impression<br/><br/></li></ul><em><strong>Prepare to be blown away by the incredible benefits and perks we offer:<br/><br/></strong></em><ul><li> Embrace the freedom of working from the comfort of your own home, enjoying a flexible schedule that suits your lifestyle</li><li> Reap the rewards of weekly pay that offers financial stability</li><li> Be recognized for your outstanding performance with enticing bonuses that reflect your dedication</li><li> Prioritize your well-being with health insurance reimbursement you’re taken care of</li><li> Secure your future with comprehensive life insurance coverage</li><li> Plan for retirement with confidence, as we offer a robust retirement plan</li><li> Join our community-driven initiative, as we adapt our operations to prioritize community wellness, conducting all interviews via Zoom video conferencing<br/><br/></li></ul>To seize this unbelievable opportunity, simply submit your resume and compensation requirements, and prepare to embark on a transformative journey with AO.<br/><br/>Unleash your potential today and become an indispensable part of AO’s bilingual powerhouse!<br/><br/>Powered by JazzHR<br/><br/>byNwb2uqzc", "jobFunction": "Administrative", "industry": "Internet Publishing", "skills": [], "url": "https://www.linkedin.com/jobs/view/3888770058"}