{"jobTitle": "Regional Fleet Maintenance Manager", "company": {"name": "UNIS", "location": "Alessandro, CA"}, "location": "Alessandro, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "Responsibilities<br/><br/><ul><li>Oversee the maintenance and repair of company vehicles and equipment. </li><li>Coordinate with terminal leaders to schedule repairs and maintenance of trucks, trailers, chassis, and box trucks. </li><li>Oversee outsourcing of equipment repairs, including tire service, scheduled PM services, needed repairs resulting from DVIR pre and post trip inspections and more by utilizing selected national account vendors. </li><li>Ensure compliance with DOT and CHP safety regulations and standards. </li><li>Aid in developing and implementing preventive maintenance programs for all fleet assets. </li><li>Monitor fuel consumption, mileage, and other performance metrics. </li><li>Monitor Samsara telematic devices to ensure proper working operation as well as asset utilization compliance. </li><li>Manage inventory of spare parts, tools, and supplies </li><li>Conduct regular inspections to identify potential issues or areas for improvement. </li><li>Conduct spot audits of Annual and 90 Day Inspections throughout the Fleet. </li><li>Aid in fleet operations, including vehicle acquisition and offboarding. </li><li>Manage regional fleet maintenance of Fleet Size of 150+ units (Trucks, Trailers, Chassis, Box Trucks) </li><li>Maintain accurate records of all maintenance activities. Maintain and upkeep Maintenance Files. </li><li>Develop and implement strategies to optimize utilization and cost -efficiency. </li><li>Strong analytical and problem-solving skills, with the ability to interpret data and make data-driven decisions. </li><li>Thrives in a fast-paced, high growth environment, is an independent, hands-on problem solver at different levels that take clear ownership of tasks. </li><li>Conducts part purchasing as needed to reduce vendor outsourcing cost of repairs. Also purchase oil, antifreeze, washer solvent act for terminal leaders. </li><li>Works in close coordination with the Vice President of maintenance to schedule and arrange equipment moves. </li><li>Monitors actual costs versus budget costs. </li><li>Ensure all repair orders are completed and processed in accordance with guidelines; approve regional maintenance expenditures and submit invoices for approval/payment. </li><li>Minimize fleet downtime and units out of service. </li><li>Ensure warranty submissions meet or exceed the business plan and are properly submitted. </li><li>Travel required. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum of 5 years of experience in fleet management or related field. </li><li>Demonstrated experience overseeing maintenance and repair operations for a large fleet, preferably in the transportation or logistics industry. </li><li>Comprehensive understanding of DOT and CHP safety regulations and standards. </li><li>Proficiency in utilizing telematics systems, such as Samsara, for monitoring and optimizing fleet performance. </li><li>Familiarity with preventive maintenance programs and strategies to ensure optimal asset utilization and cost-efficiency. </li><li>Strong mechanical aptitude and understanding of vehicle systems and components. </li><li>Proven ability to lead and manage a team effectively. </li><li>Experience coordinating with terminal leaders and external vendors to schedule repairs and maintenance activities. </li><li>Ability to conduct inspections and audits to identify issues and drive continuous improvement initiatives. </li><li>Effective communication skills, both verbal and written, to liaise with internal stakeholders, vendors, and management.</li><li>Ability to clearly articulate maintenance needs, budget requirements, and performance metrics to senior leadership.</li></ul>", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3888962516"}