{"jobTitle": "Director of Human Resources", "company": {"name": "Proper Hospitality", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Client is seeking a Director of Human Resources.  A seamless merger of historic retrofit and new construction, our 271-room property features interior design by international style icon Kelly Wearstler, multiple dining options by local area culinary stars, a rooftop lounge and swimming pool and 16,000 square feet of meeting and event space.<br/><br/>Our ideal candidate will have a minimum of 7 to 10 years of Human Resources experience in hospitality (lifestyle/luxury). This individual will have a proven track record of HR Management S/he must be collaborative, approachable, and visible. Superior communication and presentation skills, both oral and written, are critical. One who is well-versed in critical thinking, culture awareness and business acumen is equally crucial.<br/><br/>Must have the ability to be an effective listener and problem solver while partnering with all stakeholders. Must have strong leadership skills and the ability to foster high levels of accountability through fair performance management processes. We're looking for a hands-on leader who enjoys being in the trenches with the operating team.<br/><br/>Must have a reputation of exemplifying the highest standards of integrity, honesty and discretion. The right candidate will furthermore be able (and enjoy) to work in a fast-paced work environment where the decision-making process is quick and expedient.<br/><br/>Education: Bachelor's Degree required.<br/><br/>Company Overview<br/><br/>Proper Hospitality is made up of a diverse group of passionate individuals who share a common love for hotels and the art of hospitality. Our philosophy is simple: There is a right way to do things and anything less just isn't proper. We are seeking out the \"best of the best\" from inside and outside of the industry to work alongside us as we grow a new kind of lifestyle Hospitality Company inspired by a centuries-old tradition. The work is challenging and fast-paced, but rewarding above all.<br/><br/>We provide equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, or any other federal/state protected category.<br/><br/>Proper Hospitality will consider qualified applicants with criminal histories in a manner consistent with local Fair Chance Hiring Ordinances.", "postedDate": "4 months ago", "url": "https://www.linkedin.com/jobs/view/3888450318"}