{"jobTitle": "CHIEF OF PLANT OPERATION I", "company": {"name": "California Department of State Hospitals", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Permanent, Full Time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$7,247.00/mo - $9,011.00/mo", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "Under the general direction of the Assistant Hospital Administrator, the incumbent will serve as the interim Chief of Plant Operations with the responsibility of working with management and project coordinators in the preparation, development and writing of DSH budgetary project needs. The candidate will be required to perform a wide variety of duties related to the management and responsibility for the maintenance operation of a State Hospital.", "responsibilities": "The candidate should have the ability to act independently, remain flexible, and reason logically, creatively and utilize a variety of analytical techniques to resolve the more complex problems; work effectively in an often stressful and high-paced environment, while managing a heavy workload. The candidate should have excellent written and oral communication skills; good research skills; effective time-management and organizational skills, communicate effectively and demonstrate good judgment when interacting with the public and administrative personnel; have the ability to work well under pressure, meet deadlines; and maintain strict confidentiality.", "qualifications": {"required": "Permanent civil service status, reachable on an employment list, transfer eligibility, or reinstatement eligibility.", "preferred": "Eligibility by way of: permanent civil service status, reachable on an employment list, transfer eligibility, or reinstatement eligibility."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Until Filled", "benefits": "The State of California is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.", "remoteWork": "In Office", "url": "https://www.linkedin.com/jobs/view/3890171754"}