{"jobTitle": "Business Analyst", "company": {"name": "PM2CM, Inc.", "location": "Monterey Park, CA"}, "location": "Monterey Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Analyst", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Assist Accounting Manager with analyses of ongoing financial activity for the Bond Program. Prepare and/or review vendor files or other supporting documentation for vendor payments. Conduct regular review and analysis of detailed transactions residing in the Bond program accounting software (Deltek Costpoint). Assist Accounting Manager in identifying errors and develop innovative approaches to minimize risk of repeat discrepancies. Develop new reports to help provide transparency into Bond Program expenditures. Review Bond Program invoices and process approved payables per accounting procedures. Enter invoice payment requests into program accounting software. Communicate with applicable construction and professional services vendors as needed. Identify discrepancies or inconsistencies and resolve expeditiously. Reconcile financial accounts. Assist in processing of general contractor's payment analysis. Analyze monthly accounting reports in order to maintain expenditure controls. Work directly with outside team members on cost and invoice commitments and expenditure matters. Prepare and process journal entries. Work effectively with other department personnel in order to resolve any invoice payment issues and obtain signatures of authorization on invoice matters. Evaluate and ensure bond compliance in regard to payment requests. Ability to work independently and in a team environment Ability to work in a fast-paced environment  Good communication and presentation skills<br/><br/><br/><strong>Requirements<br/><br/></strong><ul><li> 3 years of accounting work experience. </li><li>Bachelor's degree. Additional qualifying experience in excess to the minimum stated above may be substituted for the required education on a year for year basis. </li><li>Ability to work with business enterprise software. </li><li>Ability to perform historical trend analysis. </li><li>Ability to create and analyze reports</li></ul>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3891666430"}