{"jobTitle": "Supply Chain Business Analyst - Remote / Telecommute", "company": {"name": "Cynet Systems", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "70.00/hr - 75.00/hr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Information Technology & Services", "description": "Job Description:\n\nPay Range $70hr - $75hr\n\n7+ years’ experience in consulting services working with Global organizations. \n\nShould have worked for minimum of 2 years in the Retail and Consumer Goods Consulting space thru one of the well-known consulting organizations. \n\nThe ideal candidate will assist in creating project requirements, Methodology documents of the processes, Test plans, with a focus on ensuring compliance and effective governance.\n\nThe candidate will be responsible for hands-on consulting execution.\n\nLead the analysis and integration of multiple supply chain systems to build a new capability.\n\nCollaborate with IT and business stakeholders to understand system requirements and ensure seamless integration.\n\nDevelop comprehensive process documentation to illustrate current and future state process.\n\nCollaborate closely with cross functional teams to design solutions that meet the business needs.\n\nFacilitate workshops and meetings to gather requirements from various business units.\n\nSound experience with supply chain planning systems and manufacturing planning knowledge.\n\nExperience with Anaplan & BY is a plus.\n\nTechnical Requirements:\n\nISeries Audit Remediation.\n\nAdvanced skill in Excel, M365 , Visio, Charts, Diagrams.\n\nExcellent technical capabilities around information security review of iSeries/AS400 platform, User Access Management (UAM), SOD Rule Set and technology risk assessments.\n\nExpertise in delivery of risk and compliance advisory services.\n\nShould have proven capabilities of executing at least 3-4 advisory/consulting engagements.\n\nGood compliance understanding of industry domains such as BFSI – (SOX, PCI-DSS, etc).\n\nCommunication skills and stakeholder management.\n\nThis role will work cross-functionally with internal and external teams involved.\n\nSkills:\n\nSupply Chain planning, system flows, communication.", "postedDate": "5 months ago", "skills": ["Supply Chain planning", "system flows", "communication"], "url": "https://www.linkedin.com/jobs/view/3892335562"}