{"jobTitle": "Performance Marketing Manager", "company": {"name": "Voltage Park", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000.00/yr - $125,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Computer Networking Products", "description": "Voltage Park is building a machine learning cloud infrastructure business from the ground up. As part of this effort, we’re looking for a Performance Marketing Manager to lead our paid media and search campaigns. You’ll play a critical role in bringing a new product to market, democratizing AI compute space for start-ups and big tech alike. As an early hire, you’ll also have significant influence in defining our company culture and ensuring our success.<br/><br/>This is a remote role, but you must be located in San Francisco, Chicago or Los Angeles. We are not able to provide sponsorship for this position.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Create and lead strategy and day-to-day campaign management and optimizations for our performance marketing program, including paid, organic and owned media channels </li><li>Create and manage digital prospecting and remarketing campaigns, including set-up, targeting and content creation </li><li>Refine and build audiences, and implement lead generation strategies</li><li>Implement marketing automation</li><li>Manage budget across platforms including Google Ads, Twitter, LinkedIn and Meta, driving ROI and customer acquisition costs </li><li>Identify and test emerging channels</li><li>Conduct keyword research, audience analysis, and competitive research to identify opportunities for optimization and growth. </li><li>Implement A/B testing and conversion rate optimization</li><li>Monitor campaign performance metrics, analyze data, and generate reports to track conversions, KPIs, identify trends, and make data-driven recommendations for improvement. </li><li>Stay updated on industry trends, best practices, and emerging technologies in paid media and social media marketing to drive continuous improvement and innovation. <br/><br/></li></ul>Qualifications:<br/><br/>\n<ul><li>A minimum of five years of experience in performance marketing using advertising platforms such as Google Ads, Facebook Ads Manager, LinkedIn Ads, Twitter Ads, etc. </li><li>Experience in performance marketing for B2B</li><li>Data driven, with strong analytical skills with the ability to interpret data, generate insights, and optimize campaigns for performance</li><li>Understanding of SEO principles, SEM techniques, and digital marketing best practices</li><li>Demonstrated ability to manage multiple projects simultaneously, prioritize tasks effectively, and meet deadlines</li><li>Strong interpersonal skills and the ability to collaborate effectively with cross-functional teams</li><li>Low ego: we’re a small group, and need somebody for whom no task is too small</li><li>You’re a problem solver with a “get sh*t done no matter what” attitude</li><li>Resourceful: you can figure out solutions – even and especially in highly ambiguous environments</li><li>An appetite for learning about data centers, high performance computing, and the AI infrastructure landscape<br/><br/></li></ul><em>Voltage Park is an equal opportunity employer and makes employment decisions on the basis of merit. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic under federal, state, or local law. If you require an accommodation during the job application process, please notify your recruiter. <br/><br/></em>Compensation Range: $95K - $125K<br/><br/>", "responsibilities": "Create and lead strategy and day-to-day campaign management and optimizations for our performance marketing program, including paid, organic and owned media channels Create and manage digital prospecting and remarketing campaigns, including set-up, targeting and content creation Refine and build audiences, and implement lead generation strategies Implement marketing automation Manage budget across platforms including Google Ads, Twitter, LinkedIn and Meta, driving ROI and customer acquisition costs Identify and test emerging channels Conduct keyword research, audience analysis, and competitive research to identify opportunities for optimization and growth. Implement A/B testing and conversion rate optimization Monitor campaign performance metrics, analyze data, and generate reports to track conversions, KPIs, identify trends, and make data-driven recommendations for improvement. Stay updated on industry trends, best practices, and emerging technologies in paid media and social media marketing to drive continuous improvement and innovation. ", "qualifications": {"required": "A minimum of five years of experience in performance marketing using advertising platforms such as Google Ads, Facebook Ads Manager, LinkedIn Ads, Twitter Ads, etc. Experience in performance marketing for B2B Data driven, with strong analytical skills with the ability to interpret data, generate insights, and optimize campaigns for performance Understanding of SEO principles, SEM techniques, and digital marketing best practices Demonstrated ability to manage multiple projects simultaneously, prioritize tasks effectively, and meet deadlines Strong interpersonal skills and the ability to collaborate effectively with cross-functional teams Low ego: we’re a small group, and need somebody for whom no task is too small You’re a problem solver with a “get sh*t done no matter what” attitude Resourceful: you can figure out solutions – even and especially in highly ambiguous environments An appetite for learning about data centers, high performance computing, and the AI infrastructure landscape"}, "skills": ["Google Ads", "Facebook Ads Manager", "LinkedIn Ads", "Twitter Ads", "SEO", "SEM", "Digital Marketing", "Marketing Automation", "Data Analysis", "Project Management", "Teamwork", "Problem Solving"], "postedDate": "4 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3893327775"}