{"jobTitle": "Southwest Regional Development Director", "company": {"name": "GIFFORDS", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000 - $125,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Internet Publishing", "description": "Title: Southwest Regional Development Director<br/><br/>Reports to: Director of Regional Development Programs<br/><br/>Direct reports: Southwest Regional Development Manager<br/><br/>Hours: Full-time, exempt<br/><br/>Location: Los Angeles, CA<br/><br/>Led by former Congresswoman Gabrielle Giffords, GIFFORDS is a nonprofit organization whose team is on a mission to save lives from gun violence. GIFFORDS is proud to be an equal opportunity employer committed to creating an environment that celebrates diversity, equity, and inclusion. People of color, trans individuals, gender non-conforming individuals, women, people with differing abilities, and veterans are strongly encouraged to apply.<br/><br/>GIFFORDS is seeking to hire a Southwest Regional Development Director to support our growing team. The Southwest Regional Development Director will be responsible for implementing a strong and innovative fundraising strategy to solicit and secure principal, foundation, and major gifts from a portfolio of donors who support the organization with annual gifts of $10,000 or more in the Southwest region of the country including Southern California, Arizona, New Mexico, Las Vegas, and surrounding areas. The position will also be responsible for building a pipeline of new and prospective major donors in the region, including identifying, soliciting, and cultivating GIFFORDS Club donors ($1k+), and will work closely with the Director and Regional Development and Director of Grassroots and Corporate Partnerships to secure corporate support. The Southwest Regional Development Director will work independently, support GIFFORDS national development efforts, and steward donor relationships with GIFFORDS principals.<br/><br/>This is a full-time remote position that will be based in Los Angeles, to be responsible for fundraising in the larger corresponding region. This position requires the ability and willingness to travel up to 50% of the time, as well as interest and ability in staffing occasional weekend and evening events. GIFFORDS requires all staff to be fully vaccinated against COVID 19, with limited exemptions as required by federal and state law.<br/><br/>Applications are accepted on a rolling basis until the position is filled. Due to the high volume of applicants, no phone calls or emails, please.<br/><br/>Duties + Responsibilities:<br/><br/><ul><li>Develop and manage a portfolio of major donors and prospects to hit forecasted revenue goals of over $2 million for the region</li><li>Maintain a fast-paced travel schedule with face-to-face visits to steward current donors and engage new major donor prospects</li><li>Manage the Southwest Regional Development Manager, based in Phoenix, who is responsible for a select portfolio of major donors in Arizona, as well as primarily responsible for the GIFFORDS Club donor pipeline and program for the Southwest region</li><li>Manage additional team members as the regional portfolio grows in markets within your region. No additional team members are currently in the hiring pipeline</li><li>Manage and track all stewardship strategies and solicitation activity using a moves management system in the organization’s customer relationship management software (CRM)</li><li>Write individualized cultivation, solicitation, and stewardship letters, proposals, and reports</li><li>Strategically oversee and facilitate donor engagement efforts for the organizations’ founders and senior leadership, including trip planning and management, securing, and staffing principal level donor meetings for current, lapsed, and prospective funders</li><li>Other duties as assigned<br/><br/></li></ul>Required knowledge, skills + experience<br/><br/><ul><li>Five to seven years of experience with direct major donor solicitation and securing major and principal gifts from high-net-worth individuals and foundations</li><li>A demonstrated ability to influence and engage diverse audiences and to build long-term relationships, including experience leveraging executive-level staff and volunteers to achieve fundraising success</li><li>Experience successfully managing multi-faceted projects and performing independent fast-paced, multi-tasking environment</li><li>Outstanding analytical, strategic planning, time management, and organizational skills</li><li>Exceptional verbal and written communication skills, including presentation skills and the creation of proposals</li><li>Proficient in Microsoft Office and experience with fundraising CRM’s</li><li>Strong organizational, written, and verbal communication skills required</li><li>Strong belief in and commitment to gun violence prevention</li><li>Strong interpersonal skills, sense of humor, and ability to work well on a team</li><li>A commitment to inclusion, diversity, equity, and anti-racism<br/><br/></li></ul>Valued non-essential knowledge, skills, + experience<br/><br/><ul><li>Experience with campaign and/or PAC fundraising</li><li>Experience with EveryAction</li><li>Bilingual in Spanish and English<br/><br/></li></ul>Salary + benefits<br/><br/>The salary range for this position is $100,000 - $125,000 annually, with the exact salary depending on experience. Competitive benefits include employer-funded health, dental, and vision insurance; health, transit, and parking flexible spending accounts; 401k plan with 4% employer match; reimbursement for cell phone and monthly wifi; stipend, paid TSA PreCheck, 25 days of PTO annually plus paid week closure at the end of the calendar year; and ten paid federal holidays.<br/><br/>Applying + the interview process<br/><br/>Submit your resume and a brief cover letter (400 outlining three specific ways that you would be a good fit for this position). Our interview process for this position consists of a phone interview, a Zoom panel interview, a final interview, and reference checks.<br/><br/><em>GIFFORDS is proud to be an equal opportunity employer committed to creating an environment that celebrates diversity, equity and inclusion. People of color, trans individuals, gender non-conforming individuals, women, people with differing abilities, and veterans are strongly encouraged to apply.<br/><br/></em>Powered by JazzHR<br/><br/>p73A5yM8kb", "responsibilities": "<ul><li>Develop and manage a portfolio of major donors and prospects to hit forecasted revenue goals of over $2 million for the region</li><li>Maintain a fast-paced travel schedule with face-to-face visits to steward current donors and engage new major donor prospects</li><li>Manage the Southwest Regional Development Manager, based in Phoenix, who is responsible for a select portfolio of major donors in Arizona, as well as primarily responsible for the GIFFORDS Club donor pipeline and program for the Southwest region</li><li>Manage additional team members as the regional portfolio grows in markets within your region. No additional team members are currently in the hiring pipeline</li><li>Manage and track all stewardship strategies and solicitation activity using a moves management system in the organization’s customer relationship management software (CRM)</li><li>Write individualized cultivation, solicitation, and stewardship letters, proposals, and reports</li><li>Strategically oversee and facilitate donor engagement efforts for the organizations’ founders and senior leadership, including trip planning and management, securing, and staffing principal level donor meetings for current, lapsed, and prospective funders</li><li>Other duties as assigned<br/><br/></li></ul>", "qualifications": {"required": "Five to seven years of experience with direct major donor solicitation and securing major and principal gifts from high-net-worth individuals and foundations, A demonstrated ability to influence and engage diverse audiences and to build long-term relationships, including experience leveraging executive-level staff and volunteers to achieve fundraising success, Experience successfully managing multi-faceted projects and performing independent fast-paced, multi-tasking environment, Outstanding analytical, strategic planning, time management, and organizational skills, Exceptional verbal and written communication skills, including presentation skills and the creation of proposals, Proficient in Microsoft Office and experience with fundraising CRM’s, Strong organizational, written, and verbal communication skills required, Strong belief in and commitment to gun violence prevention, Strong interpersonal skills, sense of humor, and ability to work well on a team, A commitment to inclusion, diversity, equity, and anti-racism", "preferred": "Experience with campaign and/or PAC fundraising, Experience with EveryAction, Bilingual in Spanish and English"}, "skills": ["Fundraising", "Donor Management", "Relationship Building", "Strategic Planning", "Communication", "Microsoft Office", "CRM"], "postedDate": "4 months ago", "benefits": "The salary range for this position is $100,000 - $125,000 annually, with the exact salary depending on experience. Competitive benefits include employer-funded health, dental, and vision insurance; health, transit, and parking flexible spending accounts; 401k plan with 4% employer match; reimbursement for cell phone and monthly wifi; stipend, paid TSA PreCheck, 25 days of PTO annually plus paid week closure at the end of the calendar year; and ten paid federal holidays.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3893456583"}