{"jobTitle": "Project Manager", "company": {"name": "PM2CM, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Consulting", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Project Manager II (Engineering)<br/><br/><em>PM2CM, Inc., (Project Management to Construction Management) is a professional services company dedicated to providing Program and Project Management, Construction Management and Project Controls services during the design and construction phase of projects. Our core expertise is in Project Controls which includes Scheduling, Cost Controls, Document Management and Controls, Budget tracking and monitoring, Estimating, Risk Analysis, Claims avoidance and Mitigation, Change Management and Earned Value Management.<br/><br/></em><em>The position is in Pomona, CA. Hybrid-Remote (Tuesday and Wednesday in the office/field)<br/><br/></em>Become a <strong>Project Manager</strong> at one of the largest utility companies in Southern California managing electric infrastructure projects. In this job, you'll be part of the Construction &amp; Technical Support (C&amp;TS) organization and will directly collaborate with the company's customers and internal groups. This organization provides project and program management for Transmission and Distribution. The volume of transmission projects is projected to continue to grow over the next several years. These projects are growing in number, size, complexity, and strategic impact. Due to the high visibility of these projects by regulators, public and environmental agencies, and major customers, they must be managed consistently and carefully.<br/><br/>The primary purpose of the Project Manager role is to improve the success rate of projects by applying project management principals, methods, tools, and standards. Individuals are typically certified as Professional Project Managers and apply their knowledge and experience in a variety of functions and projects across the organization.<br/><br/>As a <strong>Project Manager,</strong> your work will help power our planet, reduce carbon emissions, and create cleaner air for everyone. Are you ready to take on the challenge to help us build the future?<br/><br/><strong>A day in the life - Get ready to think big, work smart and shine bright!<br/><br/></strong><ul><li>Manages projects and programs within the organization: Projects and programs may include relocation of existing facilities, and small civil capital projects. </li><li>Responsible for project cost management related to budgeting, forecasting, and trends</li><li>Manages 5-10 active projects and coordinate contractors and material</li><li>Coordinate activities, resources, equipment, and information necessary for project completion, maintaining project plans, reports, and technical documents, and serving as a point of contact for the project team ensuring effective communication and team coordination</li><li>Lead planning, monitoring, and management of internal projects including complex, multi-year initiatives within and across OUs such as Finance, Regulatory, HR, Engineering, Transmission &amp; Distribution, Legal, Customer Support, and Administrative Services as well as construction projects, infrastructure investment, and new facilities from initiation through completion</li><li>Updates project documentation data in files and multiple software systems. Requests, receives, evaluates, and prioritizes data into hard files, Microsoft software programs, etc</li><li>Initiates and issues documentation including Authorization to Proceed (ATP), Release to Construct (RTC), letters, agreements, contracts, trends, work order requests, etc. as the need arises</li><li>Lead development of project, resource, and staffing plans, secure required resources, track, and report on progress, troubleshoot issues and ensure project results meet requirements regarding technical quality, reliability, schedule, cost, and regulatory requirements</li><li>Monitor performance and recommend schedule changes, cost adjustments or resource additions including determining how changes will impact status, budget, and timeline</li><li>Evaluates submittals, letters, plans project / program files for completeness with associated processes and procedures</li><li>Upon completion of projects follow associated processes and procedures associated with closeout and reconciliation</li><li>Schedules and leads internal and external meetings with associated agendas, meeting minutes, action items</li><li>Responsible for handling regulatory and legal matters associated with the project. Prevailing wage, Buy America, California Public Utilities Commission (CPUC) data requests, other federal compliance related to projects<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>The essentials:<br/><br/></strong><ul><li>Bachelor's Degree in Engineering required</li><li>Seven years of Project Management experience including ownership of scope, cost, and schedule</li><li>Ability to lead multiple sophisticated projects in a fast-paced environment with minimum supervision and tight time constraints<br/><br/><br/></li></ul><strong>The preferred:<br/><br/></strong><ul><li>Experience with transmission, distribution, and/or substation line construction, maintenance, or operations regulations</li><li>Utility Industry experience preferred</li><li>Experience working as a resident engineer to oversee drawings that need to be issued. </li><li>Experience communicating and collaborating effectively with external clients, various organizations across SCE, and all levels of management to lead and drive projects</li><li>Experience working with all Microsoft office programs, SAP, Design Manager (DM), Google Earth Pro, and Adobe Acrobat Pro</li></ul>", "postedDate": "5 months ago", "qualifications": {"required": "Bachelor's Degree in Engineering required\nSeven years of Project Management experience including ownership of scope, cost, and schedule\nAbility to lead multiple sophisticated projects in a fast-paced environment with minimum supervision and tight time constraints", "preferred": "Experience with transmission, distribution, and/or substation line construction, maintenance, or operations regulations\nUtility Industry experience preferred\nExperience working as a resident engineer to oversee drawings that need to be issued. \nExperience communicating and collaborating effectively with external clients, various organizations across SCE, and all levels of management to lead and drive projects\nExperience working with all Microsoft office programs, SAP, Design Manager (DM), Google Earth Pro, and Adobe Acrobat Pro"}, "skills": ["Project Management", "Engineering", "Transmission", "Distribution", "Substation", "Construction", "Maintenance", "Operations", "Utility Industry", "Microsoft Office", "SAP", "Design Manager", "Google Earth Pro", "Adobe Acrobat Pro"], "url": "https://www.linkedin.com/jobs/view/3894833216"}