{"jobTitle": "GRI Chief Curator", "company": {"name": "J. Paul Getty Trust", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "154,582.00/yr - 212,539.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Museums, Historical Sites, and Zoos", "description": "Diversity, Equity, Accessibility, and Inclusion at Getty <br/><br/>Getty believes diversity, equity, accessibility and inclusion are essential to our excellence and to the execution of our mission. The Getty community values differences in the pursuit of inquiry and knowledge, mutual understanding, respect, trust, transparency, and cooperation. We are committed to creating a welcoming workplace that reflects the various backgrounds of the communities we serve and includes individuals who bring a diversity of values and experiences. Individuals of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.<br/><br/>Job Summary<br/><br/>With up to 20 staff members and a robust acquisitions budget, the Getty Research Institute's (GRI) Chief Curator will have the opportunity to create world-class collections to advance research at the Getty and around the globe.<br/><br/>Reporting to the Associate Director of Collections &amp; Discovery and working in close partnership with other members of the GRI management team, the GRI Chief Curator will develop and implement the GRI’s strategic priorities for Special Collections in an academically stimulating environment. To accomplish this ongoing effort, the GRI Chief Curator will oversee a team of 11 Curators who collectively manage roughly 72,000 rare books, 27,000 single prints and drawings, 800 collections of rare photographs, and over 120,000 linear feet of manuscripts and archives, along with optical devices, architectural models, audiovisual recordings, and digital-born materials.<br/><br/>The focus of the GRI Chief Curator will be to oversee the acquisition and collection process from a wide variety of perspectives reflecting a collection mission and strategy that focuses on shifts in scholarship, engaging new audiences, and creating access and amplifying the acquired and newly-acquired content with the curators and institutional partners while emphasizing a current initiative to promote cataloging of large collections alongside reducing the number of incoming acquisitions.<br/><br/>The efforts of the GRI Chief Curator and curators will be anchored in a strong interest to bring existing departments and work processes into alignment and center the work along the core set of values: Diversity, Equity, Accessibility, and Inclusion, as well as Sustainability and Education so that the GRI can more effectively advance the local, transnational, and global discovery of research materials essential to the study of art history, visual culture, and the built environment.<br/><br/>The GRI Chief Curator works closely with other institutions within Getty, including the Museum, Conservation Institute, Foundation, Getty Digital, Development, Communication, and the Trust, to encourage further discourse and partnership (acquisitions, exhibitions, and programming) and strengthen this department's work in furthering Getty’s mission.<br/><br/> THE IDEAL CANDIDATE <br/><br/>The ideal candidate will be a scholar and a strong administrator and manager who may come from art libraries, rare book libraries, special collections, university libraries, academia more generally, or from a foundation, museum, or other cultural institution focused on humanistic inquiry. They will manage a department noted for its collegiality among the staff who embody a willingness to experiment with new ideas and approaches. The department will continue to work on generating groundbreaking exhibitions, publications, and research projects that the ideal candidate will influence.<br/><br/>The new GRI Chief Curator will oversee the growth and shift of this department into one that reflects 21 st -century collection best practices, with particular attention to ethical stewardship, and will be noted for their administrative, management, and problem-solving abilities. Growth, passion, and excitement will result from inspired partnership from the curators advocated by the new GRI Chief Curator, particularly with the institutions within the Getty and, most importantly, with The Getty Trust. This is an exceptional opportunity for a candidate passionate about the centrality of visual culture to join the management team at one of the world’s premier humanities-based research institutes.<br/><br/>APPLY<br/><br/>The position will remain open until filled. Applications received by May 30 will be given first consideration. The letter of interest should outline your interest in joining GRI and relevant accomplishments. Please provide two examples of why you would be a strong candidate and the key attributes you would bring to this .<br/><br/>Compensation And Benefits<br/><br/>The Hiring Pay Scale for the position is $150,077 - $206,353 annually. Getty offers a comprehensive full employment benefits package. To learn more about our comprehensive benefits and a long list of perks, go to GettyHR.com.<br/><br/>Major Job Responsibilities<br/><br/>Strategic Goals:<br/><br/><ul><li> Establish a collection acquisition framework, strategy, and process that shapes the planning and execution of all department efforts, with a current emphasis on strategically managing the number of large collections requiring intense cataloging. </li><li> Develop mutually beneficial working relationships with institutional partners, including the Museum, Conservation Institute, Foundation, Getty Digital, Development, Communication, and the Trust . </li><li> Engage with external partners to enhance acquisitions, exhibitions, and publications of existing collections and encourage reimagining existing collections from different perspectives that engage new audiences. </li><li> Manage and provide a model for the curatorial team, the Chief Curator will assist each curator in promoting Special Collections holdings through research, tours, lectures, exhibitions, and publications inside and outside the Getty <br/><br/></li></ul>The following responsibilities represent the encompassing portfolio of the GRI Chief Curator:<br/><br/>Management<br/><br/><ul><li> Oversee and manage the curatorial division in research on acquisitions and donations of rare materials in various media and formats that build on the strengths of the GRI’s Special Collections and help it expand into new areas. </li><li> Provide a broad, innovative, and creative curatorial vision, direct the department budget, and regularly supervise and meet with the curatorial staff, administrative assistants, and department coordinators. </li><li> Oversee Collection Development Council meetings and Curatorial department meetings. </li><li> Meet regularly with the GRI Council members regarding the GRI collections. </li><li> Represent the GRI at local, national, and international level meetings and conferences. </li><li> Oversee initiatives and strategies for diversity, equity, inclusion, and belonging. <br/><br/></li></ul>Acquisitions<br/><br/><ul><li> Develop a strategy with all GRI directors across the divisions. </li><li> Oversee the workflow in all acquisitions and donations offered and discovered. </li><li> Review incoming offers with curators, advising and guiding them about assessment, negotiation, legal and license requirements, and contracts while informing senior directors of all purchases, donations, and auction bids. </li><li> Work with curators to ensure proposals are reviewed, presented, and approved at appropriate levels. </li><li> Work with the curatorial budget coordinator to ensure expenditures are appropriately balanced among the various subject areas and media of the Special Collections budget so that funds are expended evenly over the budget year and entirely by the year’s end. </li><li> Track the progress of major annual and multiyear acquisitions, meeting with involved curators regularly to monitor progress. </li><li> Supervise the preparation of new acquisitions lists and single acquisitions PR for the Curatorial Quarterly reports, the Board Book, and Trust Annual Reports. </li><li> Meet regularly with GRI Digital Media/Content Strategy and Getty Communications concerning PR for new acquisitions. </li><li> Write regularly on Special Collections for Getty publications and websites, as well as publishes in catalogs and journals; and delegates articles to be written for the Getty Magazine, blog posts, etc. <br/><br/></li></ul>Registrars and Exhibitions<br/><br/><ul><li> Receive and evaluate incoming exhibition loan requests (some already coordinated by a borrower with a GRI curator), assign appropriate curators to work with registrars and conservators, and reply to the borrower. </li><li> Monitor incoming external loan requests given the GRI exhibition schedule or other large requests in progress and meet as needed with the Head of Exhibitions, Senior Registrar, and Head of Conservation to discuss information. </li><li> Work with curators and registrars to develop an exhibition program in tandem with senior management and the Exhibitions department. <br/><br/></li></ul>Library Reference<br/><br/><ul><li> Work with Library Reference librarians regarding curatorial participation in teaching classes and workshops. <br/><br/></li></ul>Qualifications<br/><br/><ul><li> Master’s degree in art history or art administration, or 10+ years of curatorial experience or Ph.D. </li><li> Broad knowledge of Art History, Cultural Studies, and related fields. </li><li> Curatorial experience or adjacent experience. </li><li> Fluency in at least one foreign language (modern or ancient) is required. </li><li> Highest-level technical contributor in specialized curatorial functions. </li><li> Experience in the art market is essential. <br/><br/></li></ul>Knowledge, Skills And Abilities<br/><br/><ul><li> Recognized ability to build long-term relationships, partner, and direct teams across disciplines. </li><li> Strong administrator and manager. </li><li> Excellent ability to work with a wide variety of audiences and great strengths regarding planning and problem-solving. </li><li> Keen diplomacy and political skills. </li><li> Experience working within a complex institution and managing a large department. </li><li> Experience working with and managing encyclopedic collections. </li><li> Keen interest in working with external partners ranging from peer institutions to education partners. </li><li> Being innovative and open to new ideas. </li><li> Proficient with collection management and digital asset management tools. </li><li> Accomplished in scholarly historical research and writing. <br/><br/></li></ul>Benefits And Perks<br/><br/>Here are just some examples that Getty offers/provides for full-time employees:<br/><br/><ul><li>Medical, Dental and Vision insurance coverage, starting on date of hire. Getty pays 75%-95% of the premium, depending on the plan selected. </li><li>403(b) Employee Investment retirement plan – with up to 5% Getty Match</li><li>Getty contribution of 6%, on behalf of employee, to 401(a) retirement account</li><li>Educational Assistance and professional development</li><li>Paid Vacation, Sick and Personal Days</li><li>12 Paid Holidays</li><li>Many positions have bi-weekly Off-Fridays</li><li>On-Site Fitness Center at Getty Center</li><li>Community service opportunities<br/><br/></li></ul>To learn more about our comprehensive benefits and long list of perks, go to  Getty HR .<br/><br/> Equal Opportunity Employer <br/><br/>We are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship or immigration status, color, disability, ethnicity, familial status, gender identity and/or expression, genetic information, marital status, national origin, race, religion, sex, sexual orientation, veteran status, or any other protected status.", "responsibilities": "Strategic Goals:<br/><br/><ul><li> Establish a collection acquisition framework, strategy, and process that shapes the planning and execution of all department efforts, with a current emphasis on strategically managing the number of large collections requiring intense cataloging. </li><li> Develop mutually beneficial working relationships with institutional partners, including the Museum, Conservation Institute, Foundation, Getty Digital, Development, Communication, and the Trust . </li><li> Engage with external partners to enhance acquisitions, exhibitions, and publications of existing collections and encourage reimagining existing collections from different perspectives that engage new audiences. </li><li> Manage and provide a model for the curatorial team, the Chief Curator will assist each curator in promoting Special Collections holdings through research, tours, lectures, exhibitions, and publications inside and outside the Getty <br/><br/></li></ul>The following responsibilities represent the encompassing portfolio of the GRI Chief Curator:<br/><br/>Management<br/><br/><ul><li> Oversee and manage the curatorial division in research on acquisitions and donations of rare materials in various media and formats that build on the strengths of the GRI’s Special Collections and help it expand into new areas. </li><li> Provide a broad, innovative, and creative curatorial vision, direct the department budget, and regularly supervise and meet with the curatorial staff, administrative assistants, and department coordinators. </li><li> Oversee Collection Development Council meetings and Curatorial department meetings. </li><li> Meet regularly with the GRI Council members regarding the GRI collections. </li><li> Represent the GRI at local, national, and international level meetings and conferences. </li><li> Oversee initiatives and strategies for diversity, equity, inclusion, and belonging. <br/><br/></li></ul>Acquisitions<br/><br/><ul><li> Develop a strategy with all GRI directors across the divisions. </li><li> Oversee the workflow in all acquisitions and donations offered and discovered. </li><li> Review incoming offers with curators, advising and guiding them about assessment, negotiation, legal and license requirements, and contracts while informing senior directors of all purchases, donations, and auction bids. </li><li> Work with curators to ensure proposals are reviewed, presented, and approved at appropriate levels. </li><li> Work with the curatorial budget coordinator to ensure expenditures are appropriately balanced among the various subject areas and media of the Special Collections budget so that funds are expended evenly over the budget year and entirely by the year’s end. </li><li> Track the progress of major annual and multiyear acquisitions, meeting with involved curators regularly to monitor progress. </li><li> Supervise the preparation of new acquisitions lists and single acquisitions PR for the Curatorial Quarterly reports, the Board Book, and Trust Annual Reports. </li><li> Meet regularly with GRI Digital Media/Content Strategy and Getty Communications concerning PR for new acquisitions. </li><li> Write regularly on Special Collections for Getty publications and websites, as well as publishes in catalogs and journals; and delegates articles to be written for the Getty Magazine, blog posts, etc. <br/><br/></li></ul>Registrars and Exhibitions<br/><br/><ul><li> Receive and evaluate incoming exhibition loan requests (some already coordinated by a borrower with a GRI curator), assign appropriate curators to work with registrars and conservators, and reply to the borrower. </li><li> Monitor incoming external loan requests given the GRI exhibition schedule or other large requests in progress and meet as needed with the Head of Exhibitions, Senior Registrar, and Head of Conservation to discuss information. </li><li> Work with curators and registrars to develop an exhibition program in tandem with senior management and the Exhibitions department. <br/><br/></li></ul>Library Reference<br/><br/><ul><li> Work with Library Reference librarians regarding curatorial participation in teaching classes and workshops. <br/><br/></li></ul>", "qualifications": {"required": "Master’s degree in art history or art administration, or 10+ years of curatorial experience or Ph.D. <br/>Broad knowledge of Art History, Cultural Studies, and related fields. <br/>Curatorial experience or adjacent experience. <br/>Fluency in at least one foreign language (modern or ancient) is required. <br/>Highest-level technical contributor in specialized curatorial functions. <br/>Experience in the art market is essential. ", "preferred": null}, "skills": ["Art History", "Cultural Studies", "Curatorial", "Foreign Language", "Art Market"], "postedDate": "3 weeks ago", "applicationDeadline": "May 30", "benefits": "The Hiring Pay Scale for the position is $150,077 - $206,353 annually. Getty offers a comprehensive full employment benefits package. To learn more about our comprehensive benefits and a long list of perks, go to GettyHR.com.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3894547481"}