{"jobTitle": "Sales Representative", "company": {"name": "Felder Group USA", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>Job Type:</strong> Full-time (40-Hours/Week) with overtime available as needed<br/><br/><strong>Salary: </strong>Base Salary plus Commission<br/><br/><strong>Who We Are!<br/><br/></strong>We are a well established manufacturer of high quality, precision European woodworking machines. Our equipment includes the latest technology, the highest safety standards, and we use the best raw materials to maintain quality assurance. Our goal is to continue aggressive growth by providing excellent service and the ultimate customer support that our clients have come to expect. We are a very rapidly growing company while at the same time still maintaining a small company feel. Our teams are composed of small groups of individuals who need to work well independently and without excessive \"micro managing\". Possibilities for advancement within our ever growing company eliminates the possibility of employees feeling as though they are in a \"dead end job\".<br/><br/><strong>Who We're Looking For!<br/><br/></strong>We are looking for enthusiastic, career minded, self-motivated individuals to fill the position of Senior Sales Representative within our Anaheim, California location. A good candidate will have excellent communication skills, be comfortable with high-volume phone calls with customers, and be able to confidently close on sales. It is also important to have a strong computer-use background and a having \"mechanical\" mindset is a great benefit (We sell Woodworking Machines!). We are capable and ready to mentor the right candidates who are motivated but may have less experience! Our Sales Representatives will occasionally travel to trade shows across the United States; let's talk about what that means for you!<br/><br/><strong>What You'll be Doing!<br/><br/></strong>As one of our Senior Sales team members you will be calling on business owners &amp; private individuals, consulting with them to select the best machines, tools, and accessories for their woodworking needs! We would start any new hire along a natural progression based on the complexity of our products. You would be the face of our company when a customer walks into our showroom, set your own client appointments, initiate machine/accessories sales quotes, and build rapport with potential customers within your sales area to generate activity/leads. The majority of your time will be spent in our office; you will occasionally travel to a trade show to showcase our FELDER equipment. The range of equipment is vast starting with smaller fully mechanical machinery all the way up to full CNC controlled machinery.<br/><br/><strong>Job Qualifications:<br/><br/></strong><ul><li>Excellent phone and communication skills</li><li>High volume telephone sales experience is welcomed</li><li>Excellent closing skills</li><li>Mechanical mindset is a plus</li><li>Computer-based knowledge/experience</li><li>Ability to travel to trade shows</li><li>Woodworking industry experience is highly welcomed but not required<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Health/Vision/Dental benefits</li><li>Retirement plan</li><li>Vacation and Sick Time</li><li>FSA Benefit Plan</li><li>Holidays off</li><li>Opportunity for advancement<br/><br/></li></ul>Powered by JazzHR<br/><br/>hyKP1LIEb3", "responsibilities": "As one of our Senior Sales team members you will be calling on business owners &amp; private individuals, consulting with them to select the best machines, tools, and accessories for their woodworking needs! We would start any new hire along a natural progression based on the complexity of our products. You would be the face of our company when a customer walks into our showroom, set your own client appointments, initiate machine/accessories sales quotes, and build rapport with potential customers within your sales area to generate activity/leads. The majority of your time will be spent in our office; you will occasionally travel to a trade show to showcase our FELDER equipment. The range of equipment is vast starting with smaller fully mechanical machinery all the way up to full CNC controlled machinery.", "qualifications": {"required": "Excellent phone and communication skills, High volume telephone sales experience is welcomed, Excellent closing skills, Mechanical mindset is a plus, Computer-based knowledge/experience, Ability to travel to trade shows, Woodworking industry experience is highly welcomed but not required"}, "skills": ["Sales", "Communication", "Customer Service", "Woodworking", "Mechanical"], "postedDate": "4 months ago", "benefits": "Health/Vision/Dental benefits, Retirement plan, Vacation and Sick Time, FSA Benefit Plan, Holidays off, Opportunity for advancement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3894898398"}