{"jobTitle": "Head Start - Operations & Compliance Manager", "company": {"name": "Crystal Stairs, Inc.", "location": "Los Angeles, CA", "industry": "Civic and Social Organizations"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance and Sales", "industry": "Civic and Social Organizations", "description": "Crystal Stairs, Inc.<br/><br/>Improving the Lives of Families through<br/><br/><em>Child Care Services, Research, and Advocacy <br/><br/></em>Crystal Stairs is one of the largest private non-profit child development corporations in the State of California. We help families locate affordable and appropriate childcare through a variety of services, working with childcare providers, educators, advocates, and community members to positively impact the lives of more than 30,000 children each year.<br/><br/>Our Core Values<br/><br/><em>Excellence * Relationships * Integrity * Empowerment<br/><br/></em><em>Head Start - Operations &amp; Compliance Manager<br/><br/></em><strong>Location: </strong>South Los Angeles and Compton Area<br/><br/><em>This position is a fully onsite position.<br/><br/></em><em>The following job summary is for descriptive purposes only. The actual job description and job title is subject to change.<br/><br/></em><strong>What We're Looking For<br/><br/></strong>We are seeking an Operations &amp; Compliance Manager, under the direction of the Head Start Assistant Director, the Operations and Compliance Manager leads and manages the operations of all Head Start facilities and works closely with the Head Start Leadership, Crystal Stairs Purchasing Department, and Operations Department to perform a wide range of services related to operations, facilities management, and procurement. He/ She coordinates monitors compliance issues; supervises personnel, and coordinates improvement plans. The position will be primarily responsible for providing coordination in the following areas: Quality Assurance Monitoring, Information Technology, and Facilities Management. The ideal candidate will manage and coordinate program services in the following areas:<br/><br/><ul><li>Coordinates the Technology including data base systems, program monitoring and compliance, program self-assessment, community assessment. </li><li>Coordinates Program Information Reports including program planning, recordkeeping and reporting.</li><li>Oversees planning, developing, implementing, monitoring and coordinating all aspects of eligibility, recruitment, selection, enrollment, and attendance for direct operated programs.</li><li>Oversees facilities and maintenance operations at all Head Start sites as it relates to compliance with Performance Standards.</li><li>Works closely with Head Start management team to review, secure and monitor leases.</li><li>Works closely with management to ensure that supplies and equipment are readily available to staff.</li><li>Maintains communication, verbal and written, with Program Director and other Head Start governing bodies.</li><li>Monitors Head Start Program budget and continuously coordinates departmental and interdepartmental funding with Program Managers.<br/><br/></li></ul><strong>Experience, Knowledge, Skills And Abilities You Should Possess<br/><br/></strong><ul><li>Bachelor's degree in Business or Related Field from an accredited college or university, Master's degree preferred; a background in non-profit management.</li><li>A minimum of five (5) years in administration, program design and management, and business management in a supervisory capacity. Advanced skill in communicating orally and in writing with business, education and community leaders; advanced skill in financial and other statistical analysis; advanced skill in program building, operations, data analysis, funding and maintenance. Experience in managing government-funded programs is highly desirable.</li><li>Knowledge of Child Care Licensing Regulations and Head Start Performance Standards and best practices related to operations, compliance, contract management, facilities, and maintenance</li><li>Knowledge of overall program planning and practices in early childhood development in various areas of application</li><li>Knowledge of general business practices such as supervisory practices, administrative basics, general financials, and risk management.</li><li>Knowledge of local resources, services, and networks<br/><br/></li></ul><strong>Education<br/><br/></strong>Bachelor's degree in Business or Related Field from an accredited college or university, Master's degree preferred; a background in non-profit management.<br/><br/><strong>Experience<br/><br/></strong>A minimum of five (5) years in administration, program design and management, and business management in a supervisory capacity. Advanced skill in communicating orally and in writing with business, education and community leaders; advanced skill in financial and other statistical analysis; advanced skill in program building, operations, data analysis, funding and maintenance. Experience in managing government-funded programs is highly desirable.<br/><br/><strong>Special Requirements<br/><br/></strong>Must possess a valid California driver's license, have use of a motor vehicle and provide evidence of automobile liability insurance. Must meet State health requirements including passing a physical examination as a condition of employment, and must provide verification of a TB clearance at the time of employment. Mandatory CPR and Basic First Aid certificate, which employee is responsible to maintain for the duration of their employment with Head Start.<br/><br/>Fingerprints must be on file with the Justice Department. Official transcripts of educational attainment are required <em>before </em>interview is granted.<br/><br/>California Law REQUIRES certain persons to report known or suspected child abuse. As a licensee or an employee at a licensed facility or a child care institution, YOU are one of those persons- a \"mandated reporter.\"<br/><br/><strong>Total Compensation Package<br/><br/></strong><ul><li>Competitive Salaries</li><li>Medical/ Dental/ Vision </li><li>401k Matching Options</li><li>Flex Spending </li><li>Pre-paid Legal Services</li><li>Sick and Vacation Time </li><li>Paid Holidays</li><li>Free Parking</li><li>Opportunity for Growth and Development</li><li>Robust Learning Management System for ongoing education and development<br/><br/></li></ul>Crystal Stairs is committed to building and sustaining a diverse workforce and culture. As part of this commitment, Crystal Stairs provides equal opportunity in all of our employment practices, including selection, hiring, promotion, transfer, and compensation, to all qualified applicants and employees without regard to race, color, medical condition as defined by state law, ancestry, religion, sex, national origin, age, marital status, sexual orientation, gender, gender identification, ethnic group identification, mental or physical disability, pregnancy, childbirth, and related medical conditions, or any other legally protected status.<br/><br/><strong>For more information about Crystal Stairs, Inc., please visit our website at: </strong><strong>www.crystalstairs.org<br/><br/></strong><strong><em>Job Posted by ApplicantPro</em></strong>", "postedDate": "4 months ago", "qualifications": {"required": "Bachelor's degree in Business or Related Field from an accredited college or university, Master's degree preferred; a background in non-profit management.\nA minimum of five (5) years in administration, program design and management, and business management in a supervisory capacity. Advanced skill in communicating orally and in writing with business, education and community leaders; advanced skill in financial and other statistical analysis; advanced skill in program building, operations, data analysis, funding and maintenance. Experience in managing government-funded programs is highly desirable.", "preferred": "Knowledge of Child Care Licensing Regulations and Head Start Performance Standards and best practices related to operations, compliance, contract management, facilities, and maintenance\nKnowledge of overall program planning and practices in early childhood development in various areas of application\nKnowledge of general business practices such as supervisory practices, administrative basics, general financials, and risk management.\nKnowledge of local resources, services, and networks"}, "skills": [], "benefits": "Competitive Salaries\nMedical/ Dental/ Vision \n401k Matching Options\nFlex Spending \nPre-paid Legal Services\nSick and Vacation Time \nPaid Holidays\nFree Parking\nOpportunity for Growth and Development\nRobust Learning Management System for ongoing education and development", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3895730053"}