{"jobTitle": "Procurement Manager", "company": {"name": "ARPS International LLC", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Location: Carson, California (LAX area)<br/><br/>Onsite with Flexible work from home days<br/><br/>Full time direct hire<br/><br/>Full benefits<br/><br/>Relocation<br/><br/>No visa sponsorship<br/><br/><strong>Summary<br/><br/></strong><ul><li>Responsible for executing and leading the day-to-day procurement activities at the site location. </li><li>Responsibilities include assigning workload and managing the buyers’ performance, selecting suppliers, negotiating supplier price and schedule, and measuring supplier OTD performance. </li><li>Reporting to the Senior Procurement Manager, this function will interface with the location’s senior management in Operations, Finance, Quality, Engineering, and HR in addition to Global Business Services senior management, Commodity Management, and Center of Excellence.<br/><br/></li></ul><strong>Essential Duties and Responsibilities</strong> include the following. Other duties may be assigned:<br/><br/><ul><li>Manage the location procurement team.</li><li>Sourcing, negotiation, contracting and executing agreements to fulfill day-to-day business needs. </li><li>Manage project related teams and initiatives.</li><li>Process improvements and process expertise for procurement.</li><li>Commodity management support (assisting in implementing process improvements and supplier integration, etc.)</li><li>The Procurement Manager is responsible for occasionally leading and aiding in the development of, and instituting, Optimized Processes. </li><li>Assigned areas of focus may include systems, procurement operations, commodity management interfaces, materials, logistics, contract management, supplier management and contract administration. </li><li>When assigned as a leader of project-related teams the position may have multiple initiative teams operating simultaneously. </li><li>The Purchasing Manager may operate individually or manage ad-hoc teams to achieve the project goals. <br/><br/></li></ul>Program Management and Day-to-Day Execution<br/><br/><ul><li>Performs and manages day-to-day data collection, implementation, supplier improvement and process improvement within HFS and across the interface between HFS and its suppliers to achieve effective competitive supply chains.</li><li>Redesigns as assigned and/or facilitates changes in procurement operations to enable creation of transactional center-ready work, through process improvements.</li><li>Identifies transactional improvement initiatives that can be driven through commodity management and supports their achievement.</li><li>Promotes communication across the organization to identify and drive toward common policies and best practices to achieve cost reductions. <br/><br/></li></ul>Process<br/><br/><ul><li>Performs and at times manages sourcing and negotiations, implementation of agreements and Integration of key suppliers, performance monitoring plus ongoing supplier and contract management for assigned BU specific commodities.</li><li>Contributes to Total Cost of Ownership (TCO) reduction efforts and initiatives to achieve the benefits.ids in the improvement of systems and work processes. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor's Degree from an accredited institution, preferably in Supply Chain or Finance</li><li>Minimum of 5 years progressive experience in a Supply Chain or Purchasing position</li><li>Minimum of 1 year experience working in manufacturing environment </li><li>This position entails access to export-controlled items and employment offers are conditioned upon an applicant’s ability to lawfully obtain access to such items.<br/><br/></li></ul><strong>Required Skills<br/><br/></strong><ul><li>Strong financial analysis skills</li><li>Process oriented; familiar with Continuous Improvement methodology.</li><li>Excellent written and verbal communication skills; able to interface with Senior Management</li><li>Strong problem-solving skills</li><li>Understanding of risk management</li><li>Excellent negotiating skills<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Previous aerospace manufacturing experience preferred.</li><li>Previous supervisor/manager experience leading a purchasing team.</li></ul>", "responsibilities": "Responsible for executing and leading the day-to-day procurement activities at the site location. Responsibilities include assigning workload and managing the buyers’ performance, selecting suppliers, negotiating supplier price and schedule, and measuring supplier OTD performance. Reporting to the Senior Procurement Manager, this function will interface with the location’s senior management in Operations, Finance, Quality, Engineering, and HR in addition to Global Business Services senior management, Commodity Management, and Center of Excellence.", "qualifications": {"required": "Bachelor's Degree from an accredited institution, preferably in Supply Chain or Finance\nMinimum of 5 years progressive experience in a Supply Chain or Purchasing position\nMinimum of 1 year experience working in manufacturing environment \nThis position entails access to export-controlled items and employment offers are conditioned upon an applicant’s ability to lawfully obtain access to such items.", "preferred": "Previous aerospace manufacturing experience preferred.\nPrevious supervisor/manager experience leading a purchasing team."}, "skills": ["Financial Analysis", "Continuous Improvement", "Communication", "Problem Solving", "Risk Management", "Negotiation"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3896757063"}