{"jobTitle": "Fully Account Executive", "company": {"name": "Pierre Strand", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Are you ready to take the next step in your career, blending the best of sales and client service? Look no further! We're on the lookout for passionate and motivated individuals to join our dynamic team as Fully Account Executive, leading our sales effort. Get ready to unlock your full earning potential while enjoying a fulfilling and rewarding career path.<br/><br/>As a Fully Account Executive, your responsibilities encompasses mainly sales and exceptional client service:<br/><br/><ul><li> Engage warm leads and potential clients through various channels</li><li> Cultivate and nurture strong relationships with our valued clients</li><li> Demonstrate a deep understanding of our products and services when interacting with potential clients</li><li> Effectively convey the value proposition to prospective customers</li><li> Seal the deal and meet monthly/quarterly sales targets</li><li> Maintain accurate records of sales activities and client information<br/><br/></li></ul><strong>So, what's in store for you as a </strong>Fully Account Executive<strong> at our organization?<br/><br/></strong><ul><li> No previous sales experience required – we provide comprehensive training to equip you for success</li><li> Say goodbye to income limitations; our uncapped commission structure in this 1099 position allows you to reap the rewards of your dedication</li><li> Work from the comfort of your own home with a fully remote position, offering flexibility in your work hours</li><li> No need for cold calling – we handle appointment setting, allowing you to concentrate on closing deals and achieving your full potential<br/><br/></li></ul>Are you excited to embrace a new challenge and embark on a journey towards success in the world of sales? If so, seize this opportunity and apply today!<br/><br/>Powered by JazzHR<br/><br/>FbBpzy7Jar", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3898817179"}