{"jobTitle": "Direct Import Manager", "company": {"name": "Abbyson", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Furniture and Home Furnishings Manufacturing", "description": "<strong>Position: </strong>Direct Import Manager <br/><strong>Location: </strong>Woodland Hills, CA<br/><strong>FLSA Classification: </strong>Non<strong>-</strong>Exempt, Full-Time<br/><strong>Required Travel: </strong>N/A<br/><br/><strong>Organization: <br/><br/></strong>For over 30 years Abbyson has taken great pride in being a family-based home furnishings brand that continually redefines itself through modern-day living. Our strategically aligned, full-spectrum business model and operations allows us to fully service major online furniture retailers and the core audience that is driving today's market. We understand the modern furniture buyer and consumer on a deeper level as well as have a keen eye on the popular trends that are driving online traffic and furniture sales. That's why our mission has always been to help them bring their homes to life with quality furniture at unbeatable prices.<br/><br/><strong>Description:<br/></strong>The Direct Import Manager will oversee the Direct Import Operations &amp; Logistics team as well as collaborate closely with the Business Development team. This leadership role is accountable for managing the daily operations, including reporting, order processing through manual and EDI processes, and supervising the team in charge of executing additional tasks related to the Direct Import Business and Development. The Direct Import Manager will also ensure proficiency in systems such as Great Plains and SalesPad to facilitate the accurate entry, updating, and monitoring of orders. This position requires a fast-paced approach, exceptional problem-solving skills, and the ability to lead the team in meeting critical deadlines.<br/><br/><strong>Core Responsibilities</strong>:<span>:</span><ul><li>Oversee the exportation of purchase orders from EDI and the meticulous review of these orders.</li><li>Ensure efficient processing of orders within respective systems or direct transmission to the factory.</li><li>Supervise and optimize factory production monitoring processes.</li><li>Manage the tracking and tracing of shipments from origin to final delivery.</li><li>Maintain and update shipping dates in all relevant systems for LI/DI shipments.</li><li>Oversee the review and validation of commercial shipping documents and the creation of these documents for direct imports.</li><li>Ensure the timely submission of accounting packages/documentation for invoicing.</li><li>Lead the preparation and updating of daily operational reports.</li><li>Facilitate consistent and effective communication with members of the Business Development, Freight &amp; Logistics, and Compliance teams.</li><li>Provide regular updates and follow-up with customers and internal departments.</li><li>Conduct ad hoc reporting and other tasks as needed.<br/></li></ul><strong>Required Qualifications</strong>:<span>:</span><ul><li>Bachelor’s degree in Business, Logistics, Supply Chain Management, or related field.</li><li>Proven experience in managing large volumes of order processing in a dynamic environment.</li><li>Strong leadership and communication skills.</li><li>Advanced proficiency in data entry and Microsoft Excel.</li><li>Demonstrated ability to effectively prioritize and manage tasks.</li><li>Exceptional organizational skills with meticulous attention to detail.</li><li>Proven track record as a committed team player with a focus on achieving business goals.<br/><br/><br/></li></ul>", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3899570640"}