{"jobTitle": "Chief Executive Officer", "company": {"name": "Prime Healthcare", "industry": "Wellness and Fitness Services, Medical Practices, and Hospitals and Health Care", "size": "50,000 employees", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$280,000.00 - $340,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Wellness and Fitness Services, Medical Practices, and Hospitals and Health Care", "description": "Prime Healthcare is an award-winning health system headquartered in Ontario, California. Prime Healthcare operates 45 hospitals and has more than 300 outpatient locations in 14 states providing more than 2.6 million patient visits annually. It is one of the nation’s leading health systems with nearly 50,000 employees and physicians. Fourteen of the Prime Healthcare hospitals are members of the Prime Healthcare Foundation, a 501(c)(3) not-for-profit public charity. Prime Healthcare is actively seeking new members to join our corporate team! Prime Healthcare stands apart from others by its unique ability to save and transform hospitals. We have been named the “fastest-growing hospital system” in the country by Modern Healthcare. And as we continue to grow and fulfill our mission of “saving hospitals, saving jobs and saving lives,” we remain committed to delivering exceptional care, and creating a legacy that will improve healthcare.", "responsibilities": "Responsible for the overall strategic leadership, planning, development, direction, coordination and control of activity within patient care, clinical and clinical support service areas. Works collaboratively with leaders and staff to ensure that quality patient care is delivered in a cost-effective manner. Furthermore, a Chief Executive Officer at one of our hospitals accomplishes the following: Provides executive leadership within the organization. Ensures case management program and supports delivery of patient care according to mission, vision and values. Ensures that the program demonstrates high quality outcomes and cost effective utilization of resources. Responsible for ensuring overall hospital compliance with regulatory bodies, i.e., accreditation standards, patient Rights, Regulating Agencies etc. Coordinates ongoing accreditation preparation. Participates with leaders from the Governing Board, management, medical staff and clinical areas in the hospital’s decision-making structures and process. Responsible for implementing an effective and ongoing program to monitor, evaluate and improve the quality and appropriateness of care delivered to patients. Ensures comprehensive continuous and ongoing monitoring to assure the delivery of quality patient care is in place. Participates in performance improvement committees and teams. Ensures follow-up of identified areas for improvement. Ensures that nursing standards of patient care and standards of nursing practice are consistent with current nursing research findings and nationally recognized professional standards. Responsible for Human Resource Management and development including staff education. Acts as an advocate for culture of learning. Serves as a mentor to management staff. Participates with hospital leaders in providing a sufficient number of appropriately qualified staff members to care for patient. Actively participates in hospital, medical staff, and community meeting as appropriate. Maintains a positive working relationship with Medical Staff. Contributes to the overall profitability of the hospital through efficient operational and budget strategies. Implements strategies designed to reduce operational costs while maintaining quality patient care. Participates in development of operating budgets. Performs ongoing budget compliance review. Actively participates in development of hospital wide strategic and long range plans. Ensures that plans are in concert with hospital mission, goals and objectives. Responsible for handling issue that directly impact patient care. Responds timely to all issues impacting the provision of patient care.", "qualifications": {"required": "Master’s degree in Nursing, Health Administration or related field. Minimum of five (5) years of progressive responsibility in Healthcare Administration. Proficiency in computer operations including word processing. Demonstrates community commitment. Ability to lead at all levels of management. Must possess excellent written and verbal communication skills. Must obtain Sexual Harassment Certification within 6 months, and then maintain biennially.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Prime Healthcare Management, Inc. offers competitive compensation and a comprehensive benefits package that provides employees the flexibility to tailor benefits according to their individual needs. Our Total Rewards package includes, but is not limited to, paid time off, a 401K retirement plan, medical, dental, and vision coverage, tuition reimbursement, and many more voluntary benefit options. Benefits may vary based on employment status, i.e. full-time, part-time, per diem or temporary.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3899960568"}