{"jobTitle": "VP, Group Director, Data Strategy, blu.", "company": {"name": "Horizon Media", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "195,000.00 - 250,000.00", "currency": "USD"}, "jobFunction": "Marketing, Analyst, and Strategy/Planning", "industry": "Advertising Services", "description": "Job Description<br/><br/>Who We Are<br/><br/>Horizon Media, founded in 1989 by Bill Koenigsberg, is recognized as one of the most innovative marketing and advertising firms. We are headquartered in New York City, with offices in Los Angeles and Toronto. A leader in driving business solutions for marketers, Horizon is known for its highly personal approach to client service. Renowned for its incredible culture, Horizon is consistently named to all the prestigious annual Best Places to Work lists published by Fortune, AdAge, Crain’s New York Business and Los Angeles Business Journal. Together we are building a place of belonging.<br/><br/>At Horizon, we understand the value that different perspectives can bring to our clients and culture, so we strive for an environment where our employees feel welcomed, safe and empowered. We value YOU and believe that your authentic voice and unique perspective allows us to create a more rewarding culture, and experience, together.<br/><br/>Our simple recipe for success? We hire talented people (thinkers, doers, dreamers, makers), challenge them and give them every opportunity to grow.<br/><br/>What Is blu.<br/><br/>Over the last three years we have been building from the ground up a Connected Marketing Platform, blu. The foundation of this platform is an Identity Framework built upon our relationship with TransUnion, whose PII data acts as our identity spine. By integrating with agency partners who have deterministic data assets we have licensed and attached 10,000+ attributes to bridge the gap between martech and adtech to deliver a true 360 consumer view. This enables brands to engage customers and prospects across all journeys.  Our portfolio of solutions and products are designed to complement a clients’ existing tech.<br/><br/>Proprietary insights tools enhance profiles with psychographic attributes and custom models identify and assign propensity against audiences based on KPIs. We have a central, connected, user-friendly platform for insight to audience development and activation.<br/><br/>Job Summary<br/><br/>The VP, Group Director, Data Solutions is embedded within the Business Solutions team and leads portfolio data &amp; tech strategy for an assigned pod of blu. clients. Oversees omni-audience strategy across all campaigns for assigned accounts. The VP Group Director, Data Solutions is an expert in leveraging Horizon’s proprietary Connected Marketing Platform called blu. to enable data-driven marketing. This role includes C-Suite presentations, thought leadership and new business.<br/><br/>What You’ll Do<br/><br/>15%-Client Innovation<br/><br/><ul><li>Identifies gaps in current tech, measurement capabilities, team structure </li><li>Understands and develops use cases for new technology solutions tied targeting and measurement (ex) CTV </li><li>Works with Business Solutions lead on assigned accounts to prioritize initiatives against business goals and account learning agendas </li><li>Keeps clients up to date on privacy, GDPR/CCPA compliancy, data depreciation, walled gardens, etc. <br/><br/></li></ul>70%-Insights, Planning &amp; Optimization<br/><br/><ul><li>Defines overall data strategy for each account </li><li>Develops media marketing strategy aligned with business objectives backed into media KPIs </li><li>Explores and defines seed audiences for audience strategy against business objectives by product using blu. and or client 1P data </li><li>Oversees direction of Data Scientists on queries needed for insight development and or custom audiences; defines models, individual model inputs, framework of business rules for queries </li><li>Review similarities and differences of attributes against audiences. Uncovers insights that lead to high value audiences through output investigation. Prioritize audiences against KPIs. </li><li>Partners with Analytics team on KPI construct </li><li>Develops comms goals alongside analytics based on historical performance, audiences &amp; KPIs </li><li>Builds screen &amp; partner allocation based on objectives and audience deliveries </li><li>Partners with Data Scientist to identify new audience optimizations based on campaign performance data. <br/><br/></li></ul>10%-Team Management<br/><br/><ul><li>Manages and trains VPs, Directors on assigned accounts </li><li>Manages Data Scientists on assigned accounts </li><li>Internal stakeholder for inputs into blu. CoE product roadmap </li><li>Dotted line to the blu. CoE SVP<br/><br/></li></ul>5%-New Business<br/><br/><ul><li>RFI responses </li><li>Use cases and content development </li><li>Active participant in presentations <br/><br/></li></ul>Who You Are<br/><br/><ul><li>Strategic thinker and expert tactician </li><li>Solutions oriented </li><li>Ability to effectively communicate complex tech solutions to C-suite <br/><br/></li></ul>Preferred Skills &amp; Experience<br/><br/><ul><li>BA/BS from accredited school required </li><li>Minimum 8+ years of experience in Programmatic/Digital/Mar Tech, 12+ overall </li><li>Hands on experience working with a DSP, DMP, CDP or CRM platform or other ad tech platforms </li><li>Expert knowledge of the programmatic, mar/ad tech landscape </li><li>Proven success collaborating across multiple teams/disciplines </li><li>Proven experience working with senior level clients <br/><br/></li></ul>#HM<br/><br/>Horizon Media is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br/><br/>Salary Range<br/><br/>$195,000.00 - $250,000.00<br/><br/>A successful applicant’s actual base salary may vary based upon, but not limited to, skill sets, experience and training, licensure/certifications, and equity. As an organization, we take an aptitude and competency-based hiring approach. We provide a competitive total rewards package including a discretionary bonus and a variety of benefits including health insurance coverage, life and disability insurance, retirement savings plans, company paid holidays and unlimited paid time off (PTO), mental health and wellness resources, pet insurance, childcare resources, identity theft insurance, fertility assistance programs, and fitness reimbursement.<br/><br/>", "responsibilities": "Client Innovation<br/><br/>* Identifies gaps in current tech, measurement capabilities, team structure <br/>* Understands and develops use cases for new technology solutions tied targeting and measurement (ex) CTV <br/>* Works with Business Solutions lead on assigned accounts to prioritize initiatives against business goals and account learning agendas <br/>* Keeps clients up to date on privacy, GDPR/CCPA compliancy, data depreciation, walled gardens, etc. <br/><br/>Insights, Planning &amp; Optimization<br/><br/>* Defines overall data strategy for each account <br/>* Develops media marketing strategy aligned with business objectives backed into media KPIs <br/>* Explores and defines seed audiences for audience strategy against business objectives by product using blu. and or client 1P data <br/>* Oversees direction of Data Scientists on queries needed for insight development and or custom audiences; defines models, individual model inputs, framework of business rules for queries <br/>* Review similarities and differences of attributes against audiences. Uncovers insights that lead to high value audiences through output investigation. Prioritize audiences against KPIs. <br/>* Partners with Analytics team on KPI construct <br/>* Develops comms goals alongside analytics based on historical performance, audiences &amp; KPIs <br/>* Builds screen &amp; partner allocation based on objectives and audience deliveries <br/>* Partners with Data Scientist to identify new audience optimizations based on campaign performance data. <br/><br/>Team Management<br/><br/>* Manages and trains VPs, Directors on assigned accounts <br/>* Manages Data Scientists on assigned accounts <br/>* Internal stakeholder for inputs into blu. CoE product roadmap <br/>* Dotted line to the blu. CoE SVP<br/><br/>New Business<br/><br/>* RFI responses <br/>* Use cases and content development <br/>* Active participant in presentations <br/><br/>", "qualifications": {"required": "BA/BS from accredited school required <br/>Minimum 8+ years of experience in Programmatic/Digital/Mar Tech, 12+ overall <br/>Hands on experience working with a DSP, DMP, CDP or CRM platform or other ad tech platforms <br/>Expert knowledge of the programmatic, mar/ad tech landscape <br/>Proven success collaborating across multiple teams/disciplines <br/>Proven experience working with senior level clients <br/><br/>", "preferred": "Strategic thinker and expert tactician <br/>Solutions oriented <br/>Ability to effectively communicate complex tech solutions to C-suite <br/><br/>"}, "skills": ["Programmatic", "Digital", "Mar Tech", "DSP", "DMP", "CDP", "CRM", "Data Strategy", "Audience Strategy", "KPI", "Analytics", "Team Management", "New Business", "RFI", "C-Suite Communication"], "postedDate": "2 weeks ago", "benefits": "A successful applicant’s actual base salary may vary based upon, but not limited to, skill sets, experience and training, licensure/certifications, and equity. As an organization, we take an aptitude and competency-based hiring approach. We provide a competitive total rewards package including a discretionary bonus and a variety of benefits including health insurance coverage, life and disability insurance, retirement savings plans, company paid holidays and unlimited paid time off (PTO), mental health and wellness resources, pet insurance, childcare resources, identity theft insurance, fertility assistance programs, and fitness reimbursement.<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3900217588"}