{"jobTitle": "Transportation Planner", "company": {"name": "GTS - General Technologies and Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "The power of technology applications to create smarter cities and vibrant communities is ready to take off, and GTS is leading the charge. We are passionate about our business and want to add teammates who want to grow in an unconstrained, flexible environment, contributing to industry-leading projects.<br/><br/><strong>The successful candidate will be in Southern California and work from home. <br/><br/></strong>GTS is a leading company exploring the potential of technology applications to create smarter cities and vibrant communities. We are passionate about our business and want to add teammates who share our drive and desire to grow in an unconstrained, flexible environment while contributing to industry-leading projects.<br/><br/>GTS seeks to hire a new teammate based in Southern California who will focus on land-use transportation projects and multimodal transportation planning. This position involves preparing CEQA documents, working on specific and general plans, and reviewing multimodal site plans. The ideal candidate should have experience with transportation analysis under CEQA, multimodal transportation planning, and how land use projects affect various travel modes.<br/><br/>The successful candidate will be responsible for analyzing and solving land-use transportation planning and engineering problems and supporting project managers in communicating with project team members, including municipality staff, private developers, other consultants, decision-makers, and the public.<br/><br/>They will also work on projects such as multimodal transportation impact studies, transportation sections of CEQA documents, campus plans, impact fee studies, and local and regional transportation plans.<br/><br/>Finally, they will mentor and train colleagues while receiving mentorship from senior staff. The ideal candidate should have at least five years of direct, relevant work experience in preparing transportation sections of CEQA documents and land-use transportation planning documents, an understanding of operations analysis and travel demand forecasting, strong communication skills (writing and public speaking), a Bachelor's degree in transportation or civil engineering, urban and regional planning, or a related major, and experience in mentoring and training less-experienced staff.<br/><br/>We offer fantastic growth and mentoring opportunities in all our roles and a full slate of benefits as part of our compensation package.<br/><br/><strong>REMOTE STRATEGY<br/><br/></strong>GTS’s flexible workplace model empowers all teammates to fulfill our mission to serve our clients! We emphasize an individual’s impact, contribution, and output over their location. GTS is a high-trust environment, and our team members can choose where they want to work with the business needs in mind. We know community comes in many forms and strive to create opportunities for intentional in-person connection in our offices and virtually for our remote colleagues worldwide.<br/><br/>We have a global presence in the United States, Saudi Arabia, Canada, and Lebanon.<br/><br/>If you have a passion for excellence and want to make a difference for our clients and continue learning, we want to hear from you. We seek talented, energetic professionals who want to share their expertise and grow with GTS.<br/><br/><strong>Be Yourself<br/><br/></strong><em>Diversity, equity, and inclusion are at the core of GTS values.<br/><br/></em>At GTS, we embrace diversity and are committed to including all people regardless of background, race, gender, age, belief, identity, or experience. A diverse team is a stronger team.", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3900901766"}