{"jobTitle": "Sales Specialist (Full-Time) - Melrose", "company": {"name": "rag & bone", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "X-$X", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "From our origins in New York in 2002, rag & bone was founded on a belief of uncompromising ideals: a commitment to doing things the right way, not the easy way. To making things that are as original as they are timeless. To being true to ourselves, even when that truth sets us apart from the mainstream.<br/><br/>Maintaining authenticity in a trend-driven industry also means creating a collaborative workspace that supports talent, creativity and forward-thinking. As New Yorkers, community has become synonymous with our brand. An inclusive environment at rag & bone upholds our original values by encouraging employee connection and empowering each individual to have a voice on policy, process and collaboration for a more equitable future<br/><br/><strong>The Role<br/><br/></strong>The Sales Specialist ensures customers have a consistent, quality experience in the store at all times. A Sales Specialist plays a key role in helping with creating and maintaining a selling focus in the store, supports company and management initiatives while ensuring adherence to policies and procedures as outlined by the organization.<br/><br/>The Sales Specialist base pay ranges from<strong> $</strong><strong>X-$X</strong><strong> hourly</strong>. Please also note, Sales Specialists are eligible to participate in the rag & bone Commissions Program, and Incentive programs, which may result in bringing the total compensation to a higher range. The range listed is just one component of the Company's total rewards package for retail employees.<br/><br/><strong>What You'll Do <br/><br/></strong><ul><li>Support a best-in-class level of customer service through extensive product knowledge, strong selling skills, and authentic clienteling </li><li>Meet store and metric goals </li><li>Emulate the brand aesthetic and embody and strong sense of fashion</li><li>Ensure brand mission is brought to life and introduced to everyone that walks into our store</li><li>Provide assistance to our Visual Merchandising team on floor sets, window changes and other projects, as needed</li><li>Maintain a knowledge and understanding of all policies and procedures</li><li>Assist with inventory and stock management</li><li>Accurately process Point of Sale transactions</li><li>Consistently act within the core values of rag & bone</li><li>Identify opportunities to support the team in delivering best in class customer service</li><li>Contribute to a positive, fun, professional, productive, and team-oriented store atmosphere <br/><br/></li></ul><strong>Rules we live by</strong> | Rules you live by<br/><br/><ul><li>The Customer Rules - Prior work experience in a client centric, sales environment</li><li>Be a Good Human - Be original, be authentic</li><li>Have No Fear - Innovate, solve problems </li><li>Own Every Decision - Work together, get results</li><li>Quality Matters - Be disciplined, be competitive </li><li>Make S**t Happen <br/><br/></li></ul><strong>Availability Requirements<br/><br/></strong>The Sales Specialist role is full-time and requires 32-40 hours per week.<br/><br/><strong>Benefits <br/><br/></strong><ul><li>Clothing Allowance </li><li>Generous Employee Discount </li><li>Commission Eligible</li><li>Paid Time Off </li><li>Medical, dental, vision and ancillary benefits </li><li>Membership to Calm and access to other wellness benefits</li><li>401k</li><li>Paid Parental Leave <br/><br/></li></ul><em>rag & bone is an EEO/Affirmative Action Employer. No employee or applicant is discriminated against because of race, color, sex (including pregnancy), age, national origin, religion, sexual orientation, gender identity, gender expression, parental status, status as a veteran, and basis of disability or any other federal, state or local protected class. <br/><br/></em><em>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The employee is regularly required to sit; use hands to finger, handle, or feel and talk or hear. The employee is occasionally required to stand; walk; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; and taste or smell. The employee must occasionally lift and/or move up to 30 pounds. Specific vision abilities required by this job include close vision. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.</em>", "responsibilities": "The Sales Specialist ensures customers have a consistent, quality experience in the store at all times. A Sales Specialist plays a key role in helping with creating and maintaining a selling focus in the store, supports company and management initiatives while ensuring adherence to policies and procedures as outlined by the organization.", "qualifications": {"required": "Prior work experience in a client centric, sales environment"}, "skills": [], "postedDate": "4 months ago", "benefits": "<ul><li>Clothing Allowance </li><li>Generous Employee Discount </li><li>Commission Eligible</li><li>Paid Time Off </li><li>Medical, dental, vision and ancillary benefits </li><li>Membership to Calm and access to other wellness benefits</li><li>401k</li><li>Paid Parental Leave <br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3901751851"}