{"jobTitle": "Enterprise Shared Services Program Manager II (Limited Duration- 12 months)", "company": {"name": "L.A. Care Health Plan", "industry": "Hospitals and Health Care", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$117,509.00 - $188,015.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "The Enterprise Shared Services Program Manager II is responsible for leading and managing a portfolio of strategic and transformational enterprise wide programs and projects that are generally complex and large in scope. In this capacity, the Program Manager will work collaboratively with leadership, management and other stakeholders including Business Owner(s), Investment Review Board, intake and program/project teams and participate in program governance and administration meetings as appropriate. This position will synchronize the work of cross-functional project teams and provide direct or indirect oversight of Senior Project Managers and Project Managers across the organization. A key function of this position is to serve as the primary point of contact between executive leadership and the program team, engage all stakeholders and communicate the program’s progress. This position is accountable for working with and facilitating processes to accomplish complex program objectives, managing change and resolving issues that span project teams and departments by planning, organizing, directing and supervising program activities in a cost effective and productive manner to achieve strategic value and the organizational vision.", "responsibilities": "Creates, develops, and maintains the program plan and supports development of program related project plans. Manages quadruple constraints of scope, schedule, cost and quality and ensures that integrated master plans including: business, technical, reporting, training, testing, and implementation plans and schedules are followed. Meets with Business Owner(s) and Project Managers/teams on a regular basis, weekly or more often, as needed. Partners with Business Owner(s) to develop communications plan, test plan, training plan, risk management/mitigation plan, and plan of record. Directs others to successfully complete projects on time, within scope and on budget by ensuring that all Project Managers supporting the program create, manage, and maintain their project schedules, resources, and project artifacts, support centralized document repository, identify risks, assumptions, issues, and dependencies, provide timely status reports and proactively escalate issues for resolution. Accountable for scheduling, cost tracking/budget, resource management allocation and utilization, program component integration and supporting program performance. Supervises multiple projects within a program to achieve continuous alignment with the organization’s strategic plans and objectives. Supports Business Owner(s) with proposal development, vendor contract negotiation, program dashboard/weekly status reports, quality assurance, business process improvement, and other program documentation. Functions as the lead expert in Enterprise Shared Service, leading a team or multiple teams and performs liaison activities with leadership, management, and other stakeholders. Optimizes program governance by working with the over-arching infrastructure, processes, and procedures to accomplish objectives including establishing metrics of success and deliverables. Supports PACE methodology and ensures projects are executed using the appropriate Project Management tools and techniques to successfully implement projects. Promotes cultural and organizational change to achieve strategic outcomes and a corporate vision. Performs other duties as assigned.", "qualifications": {"required": "At least 6-8 years of relevant Project Management, Program Management, Health Care Administration, Research or Clinical field work experience in an organizational setting. Experience facilitating complex decision making among multiple executive stakeholders with different interests and priorities. Experienced in vendor/contract management and negotiations.", "preferred": "Master's Degree"}, "skills": ["Demonstrated success managing multiple, large scale, diverse and complex projects simultaneously.", "Ability to work well independently or leading a project team/efforts with limited supervision; strong team collaboration.", "Ability to manage priorities across multiple teams/projects, platforms.", "Ability to coach and mentor colleagues. Strong facilitation and mentoring skill.", "Ability to understand business or clinical strategies and plans, and their relationship to organizational strategies.", "Excellent written and oral communication skills, speaks clearly and persuasively in positive or negative situations; strong interpersonal and leadership skills.", "Excellent time management and organizational skills; is dependable, enthusiastic, self-starting, and self-motivated.", "Strong interpersonal and leadership skills with ability to interact with cross functional project teams; reacts professionally under pressure.", "Ability to work independently in a fast-paced and changing environment.", "Proficiency in Microsoft Office Suite (Word, Excel, Access, PowerPoint, Project, Outlook, Visio, Publisher); HTML."], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "Paid Time Off (PTO), Tuition Reimbursement, Retirement Plans, Medical, Dental and Vision, Wellness Program, Volunteer Time Off (VTO)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3901987169"}