{"jobTitle": "Manufacturing Manager", "company": {"name": "Howmet Aerospace", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "95K to $127K", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Responsibilities<br/><br/></strong>Howmet Fastening Systems (HFS) is seeking a Manufacturing Manager in our Torrance, CA location. HFS is a business unit of Howmet Aerospace, headquartered in Torrance, California. We hold the number one global position in aerospace fastening systems, and we’re the North American leader in commercial transportation fasteners. Our high-tech, multi-material fastening systems are found nose to tail on aircraft and aerospace engines. Our products are also critical components of industrial gas turbines, automobiles, commercial transportation vehicles, and construction and industrial equipment.<br/><br/><strong>About Howmet Aerospace<br/><br/></strong>Howmet Aerospace Inc. (NYSE: HWM), headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. The Company’s sales for 2021 approximated $5 billion. The Company’s primary businesses focus on jet engine components, aerospace fastening systems, titanium structural parts and forged wheels. With nearly 1,150 granted and pending patents, the Company’s differentiated technologies promote more fuel efficiency for aircraft and commercial transportation. For more information, visit www.howmet.com , including content shared during the Company’s May 2022 Technology Day.<br/><br/><strong>Essential Functions:<br/><br/></strong><ul><li>Responsible for the management of all aspects of the manufacturing activities (production, planning, manufacturing engineering, safety).</li><li>Department consists of 20+ employees and a sales average of $1.5M/month sales.</li><li>Works with Global Investment group on outsourced product.</li><li>Manage planning function to ensure smooth product flow through manufacturing cells and delivers customer product on time.</li><li>Coordinates all manufacturing activities with Procurement, such as outside processing, to eliminate delays and meet production/shipping schedules.</li><li>Sets expectations, provides recourses, audits performance, counsels employees, trains, and sets policies and practices to exceed department goals.</li><li>Leads team to achieve monthly, quarterly, and annual performance goals.</li><li>Ensures operations metrics are well known; tracks daily progress towards achieving objectives and mitigating risks.</li><li>Works with managers across all functional lines to accomplish organizational objectives.</li><li>Actively participates in implementing and sustaining ABS (TPS) principles and practices.</li><li>Oversees maintenance of equipment.</li><li>Demonstrates continual focus on improvements and enhancements.</li><li>Exhibits and promotes behaviors on the plant floor that leads to an engaged workforce.</li><li>Implements company policies such as attendance, overtime, safety, environmental, etc., and directs the application of such policies to the product group's operation.</li><li>Assesses employee performance and mentor staff.</li><li>Other tasks as assigned.<br/><br/></li></ul><strong>Essential Skills:<br/><br/></strong><ul><li>Strong verbal and written communication skills; strong presentation skills</li><li>Excellent interpersonal, leadership and conflict resolution skills</li><li>Proficient with Microsoft Office applications including Excel spreadsheets</li><li>Ability to prioritize and complete multiple and diverse work assignments with minimal direction and supervision.<br/><br/></li></ul><strong>Benefits/Salary:<br/><br/></strong>The position includes competitive wages and a comprehensive benefits package, including health insurance (medical, dental, vision), excellent 401k matching program, paid holidays and vacation. The salary range for this position is $95K to $127K.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Basic Qualifications:<br/><br/></strong><ul><li>Bachelor’s Degree from an accredited Institution</li><li>Minimum 5 years of experience in leadership role within manufacturing.</li><li>Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.<br/><br/></li></ul><strong>About Us<br/><br/></strong><strong>About Howmet Aerospace<br/><br/></strong>Howmet Aerospace Inc. (NYSE: HWM), headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. Our primary businesses focus on jet engine components, aerospace fastening systems, titanium structural parts and forged wheels. With $6.6 billion in revenue in 2023, our products play a crucial role in enabling fuel efficiency and lightweighting, contributing to our customers’ success and making a positive impact on the world. To learn more about the way Howmet Aerospace Inc. is advancing the sustainability of our customers, markets, and communities where we operate, review the 2023 Environmental Social and Governance report at www.howmet.com/esg-report .<br/><br/>Follow: LinkedIn , Twitter , Instagram , Facebook , and YouTube .<br/><br/><em>Howmet is proud to be an Equal Employment Opportunity and Affirmative Action employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/></em><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or other applicable legally protected characteristics.<br/><br/></em><em>If you need assistance to complete your application due to a disability, please email TalentAcquisitionCoE_Howmet@howmet.com</em>", "responsibilities": "Essential Functions:<br/><br/>\n<ul>\n<li>Responsible for the management of all aspects of the manufacturing activities (production, planning, manufacturing engineering, safety).</li>\n<li>Department consists of 20+ employees and a sales average of $1.5M/month sales.</li>\n<li>Works with Global Investment group on outsourced product.</li>\n<li>Manage planning function to ensure smooth product flow through manufacturing cells and delivers customer product on time.</li>\n<li>Coordinates all manufacturing activities with Procurement, such as outside processing, to eliminate delays and meet production/shipping schedules.</li>\n<li>Sets expectations, provides recourses, audits performance, counsels employees, trains, and sets policies and practices to exceed department goals.</li>\n<li>Leads team to achieve monthly, quarterly, and annual performance goals.</li>\n<li>Ensures operations metrics are well known; tracks daily progress towards achieving objectives and mitigating risks.</li>\n<li>Works with managers across all functional lines to accomplish organizational objectives.</li>\n<li>Actively participates in implementing and sustaining ABS (TPS) principles and practices.</li>\n<li>Oversees maintenance of equipment.</li>\n<li>Demonstrates continual focus on improvements and enhancements.</li>\n<li>Exhibits and promotes behaviors on the plant floor that leads to an engaged workforce.</li>\n<li>Implements company policies such as attendance, overtime, safety, environmental, etc., and directs the application of such policies to the product group's operation.</li>\n<li>Assesses employee performance and mentor staff.</li>\n<li>Other tasks as assigned.<br/><br/></li>\n</ul>", "qualifications": {"required": "Basic Qualifications:<br/><br/>\n<ul>\n<li>Bachelor’s Degree from an accredited Institution</li>\n<li>Minimum 5 years of experience in leadership role within manufacturing.</li>\n<li>Employees must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.<br/><br/></li>\n</ul>"}, "skills": ["verbal and written communication", "presentation", "interpersonal", "leadership", "conflict resolution", "Microsoft Office", "Excel spreadsheets", "prioritization", "multitasking", "work assignments"], "postedDate": "1 week ago", "benefits": "The position includes competitive wages and a comprehensive benefits package, including health insurance (medical, dental, vision), excellent 401k matching program, paid holidays and vacation.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3901835072"}