{"jobTitle": "Sales Lead (SLPT) - Lane Bryant", "company": {"name": "Lane Bryant", "location": "Lakewood, CA"}, "location": "Lakewood, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Our founder, Lena Bryant didn't set out to change fashion forever, but that's exactly what she did. 120 years later, Lane Bryant remains the iconic plus-size brand. Empowering women is kind of our thing. Our inclusive community of customers and associates champions the acceptance of all sizes, shapes, and people. If you believe in the power of clothes to create confidence and empower self-expression, you'll be at home here.<br/><br/><strong>Part Time Key Holder/Part Time Sales Leader Overview<br/><br/></strong>Embraces our diverse, inclusive culture leading all activities related to providing exceptional associate and client engagement. Leads activities required to achieve all store goals including financial objectives, client service, talent management, operational controls, asset protection and safety, and merchandise presentation. Operates as the Manager on Duty in the absence of another Manager.<br/><br/><strong>Lives Company Leadership Principles<br/><br/></strong><strong>We Value Our People<br/><br/></strong>Leads with a high degree of integrity and demonstrates care for all associates<br/><br/>Assists with developing internal bench strength<br/><br/>Supports the onboarding experience to position associates for excellence in role and career progression<br/><br/>Partners with SM on self-development goals<br/><br/>Encourages continuous growth; celebrates positive performance and service behaviors<br/><br/>Shares information and communicates clearly; fosters dialogue around solutions and continuous learning<br/><br/>Ensures compliance with company policies and procedures and applicable laws at all times<br/><br/><strong>We Love Our Customer <br/><br/></strong>Represents Lane Bryant by adhering to “Dress Your Best” guidelines; articulates current trends in every client interaction<br/><br/>Supports a culture that inspires and empowers team to consistently exceed client expectations<br/><br/>Ensures business is driven by each segment with the Roles Leader program<br/><br/>Leads and directs execution of tasks; drives a high level of productivity<br/><br/>Holds self and associates accountable for consistently demonstrating Lane Selling; models behaviors<br/><br/>Resolves customer concerns quickly and effectively and empowers team to do the same<br/><br/><strong>We Win As A Team<br/><br/></strong>Fosters a culture that embraces diversity in thought, background, and experience<br/><br/>Demonstrates transparency; influences in a courageous and respectful way to drive strategy and results<br/><br/>Ensures all communications are shared with appropriate audience<br/><br/>Supports a culture that values how work is done as much as the outcome<br/><br/>Reports to work as scheduled; records time worked accurately by using time and attendance system; remains flexible to the needs of the business<br/><br/>All other duties as assigned by Store, District, or Regional Leaders<br/><br/><strong>We Take Action and Own Our Results<br/><br/></strong>Drives operational excellence; leads by example and sets the standard for a high performing culture<br/><br/>Using Brand Guide, supports visual updates and maintains visual merchandising standards<br/><br/>Partners with Store Manager to recognize opportunity; adjusts strategy to align with business demands<br/><br/>Prioritizes and controls workload through successful planning and delegation<br/><br/>Manages controllable expenses<br/><br/>Complies with Asset Protection policies and practices; promotes health and safety within store<br/><br/><strong>We Innovate and Learn Fast<br/><br/></strong>Pushes for innovative solutions that bring originality to the organization<br/><br/>Embraces change; leads teams with a sense of urgency and agility<br/><br/>Promotes a test and learn culture<br/><br/>Initiates continuous product movement based on Brand directives, client profile, and store sales<br/><br/>Contributes to an environment that promotes taking risk and out-of-the-box thinking<br/><br/><strong>Qualifications<br/><br/></strong>Strong communication and customer service skills<br/><br/><strong>6 Months Specialty Retail Experience, Preferred<br/><br/></strong>Prior management experience preferred<br/><br/>Technology proficient and strong business acumen<br/><br/>Works a flexible schedule to meet the needs of the business, including evening, weekend and holiday shifts<br/><br/>Must be able to read, write and communicate in English; other languages desirable<br/><br/>High school diploma (or equivalent) required<br/><br/><strong>Position Requires Associates To<br/><br/></strong>Constantly move throughout the store to assist customers, retrieve merchandise, complete floor sets, unpack and replenish stock and complete other tasks; frequently involves prolonged pushing, pulling, bending, squatting, and reaching and may involve tight or confined spaces<br/><br/>Frequently operate computerized register system<br/><br/>Respond in person to occasional, unscheduled store banking requirements and store alarms<br/><br/>Adjust or move objects (garment racks, mannequins, etc.) or merchandise weighing up to 25 pounds in all directions on a frequent basis; may need to adjust or move objects or merchandise weighing as much as 50 pounds in all directions on occasion and with assistance as available<br/><br/>Retrieve merchandise displayed or stored above shoulder level on a frequent basis, which may include climbing an 8-foot ladder; may need to replace overhead lightbulbs, signs, etc. on an occasional basis using an 8-foot ladder<br/><br/>Constantly interact with and assist coworkers and clients and other members of the public<br/><br/><strong>Location:<br/><br/></strong>Store 6038-Lakewood Center-LaneBryant-Lakewood, CA 90712<br/><br/><strong>Position Type<br/><br/></strong>Regular/Part time<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>The Company is committed to hiring and developing the most qualified people at all levels. It is our policy in all employment decisions to ensure that all associates and potential associates are evaluated on the basis of qualifications and ability without regard to sex (including pregnancy), race, color, national origin, religion, age, disability that can reasonably be accommodated without undue hardship, genetic information, military status, sexual orientation, gender identity, or any other protected classification under applicable law. We do not discriminate in any of our employment policies and practices. All associates are expected to follow these principles in all relationships with other associates, applicants, or others with whom we do business.<br/><br/>The Company welcomes applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the application process.<br/><br/>Note to Applicants: Smoking is prohibited in all indoor areas of the Company unless designated smoking areas have been established by a particular location in accordance with applicable law.<br/><br/>California Pay Information: https://www.ascena.com/wp-content/uploads/CA-Posting-LB.pdf", "responsibilities": "Embraces our diverse, inclusive culture leading all activities related to providing exceptional associate and client engagement. Leads activities required to achieve all store goals including financial objectives, client service, talent management, operational controls, asset protection and safety, and merchandise presentation. Operates as the Manager on Duty in the absence of another Manager.", "qualifications": {"required": "Strong communication and customer service skills", "preferred": "6 Months Specialty Retail Experience, Prior management experience preferred, Technology proficient and strong business acumen, Works a flexible schedule to meet the needs of the business, including evening, weekend and holiday shifts, Must be able to read, write and communicate in English; other languages desirable, High school diploma (or equivalent) required"}, "skills": ["Communication", "Customer Service", "Retail"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3902473382"}