{"jobTitle": "Assistant Store Manager - LOFT", "company": {"name": "LOFT", "industry": "Retail"}, "location": "Marina del Rey, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "<strong>About Us<br/><br/></strong>LOFT creates modern, feminine, versatile clothing for women with one common style goal: to look and feel confident wherever the day takes them. We empower women to find their authentic self-expression because feeling like yourself is always in style.<br/><br/>Here at LOFT, we're busy styling the careers and supporting the lives of everyday optimists just like you. Express your authentic self and experience endless inspiration, all while enjoying the opportunities and benefits that help you get the most from your career, life, and wardrobe.<br/><br/>Responsibilities will include: Providing exceptional client service, operating as the Manager on Duty in the absence of a manager, performing operational and transactional functions, handling client service issues, issuing approvals for desk transactions as well as opening and closing the store. The Assistant Manager will refer all duties which require managerial experience and/or approval to the Store Manager (e.g. disciplinary action, hiring, and terminating associates).<br/><br/><strong>Primary Responsibilities / Accountabilities<br/><br/></strong><ul><li>Embraces our values &amp; sets an example through his/her behaviors</li><li>Responsible for compliance to all ANN INC. practices and procedures as outlined in the reference manuals</li><li>Additional responsibilities as assigned by the Store Manager<br/><br/></li></ul><strong>Assistant Manager Lead Responsibilities<br/><br/></strong><strong>Responsibilities<br/><br/></strong>In addition to Sales Associate roles of providing excellence in delivering the Client Experience, the Assistant Manager is responsible for supporting the Store Manager in overseeing the operational functioning of the store including, but not limited to:<br/><br/><ul><li>Supporting the business strategy &amp; adjusting to effectively reach goals</li><li>Driving revenue by proactively managing the client experience while effectively performing Manager on Duty responsibilities – Assuming the MOD role when Store Manager is not on the floor</li><li>Utilizing tools to ensure a client-focused team environment</li><li>Driving volume &amp; anticipating clients’ needs while communicating store metrics &amp; individual performance to motivate associates</li><li>Coaching Associates on client interactions &amp; performance to maximize productivity &amp; capture client opportunities</li><li>Possessing keys to the store, performing opening and closing procedures in the absence of management (e.g., opening / closing registers, opening checklists, bank deposits, filling in, recovery, cleaning, retrieves/send email, review AT Web, accepts/receives shipment</li><li>Assuming PIN and signature privileges for register functions requiring approval</li><li>Utilizing reports to make effective merchandising decisions &amp; style the store to Division standards Leveraging tools, assessing and taking action to drive operational excellence through Standard Operating Procedures (SOP’s)</li><li>Ensure optimal coverage and productivity in all areas of the store through scheduling appropriately</li><li>Complete daily tasks to ensure store runs smoothly and meets all ANN INC. standards and guidelines<br/><br/></li></ul><strong>Position Requirements:<br/><br/></strong><ul><li>Client Service: Ensures that the client remains the top priority while balancing required tasks and overall store operations</li><li>Store Operations and Organization: Ability to organize, delegate, prioritize assignments, and meet deadlines</li><li>Merchandising: Knowledge of visual standards and techniques, and ability to implement and maintain within ANN INC.’s guidelines</li><li>Accuracy: Ability to handle cash and provide change without error. Ability to prepare nightly deposit as necessary. Captures accurate information for all transactions including signatures, addresses, and original receipt data</li><li>Communication: Communicates effectively with Clients, Members of Management, Business Partners, and Store Associates</li><li>Schedule: Flexibility in scheduling to meet the needs of the business, including evening and weekend shifts</li><li>Physical: Ability to lift and carry up to 20 pounds occasionally. Maneuver effectively around sales floor, stock room and office<br/><br/></li></ul><strong>Educational Requirements and Experience:<br/><br/></strong><ul><li>Minimum Requirements: High School Diploma or GED</li><li>Minimum six months Sales Associates experience with ANN INC. or equivalent experience with another retailer in a position of sales associate or higher.</li><li>Part-time or full-time managerial experience preferred<br/><br/></li></ul><strong>Location:<br/><br/></strong>Store 1777-Waterside Marina Del Rey-ANN-Marina Del Rey, CA 90292<br/><br/><strong>Position Type<br/><br/></strong>Regular/Full time<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>The Company is committed to hiring and developing the most qualified people at all levels. It is our policy in all employment decisions to ensure that all associates and potential associates are evaluated on the basis of qualifications and ability without regard to sex (including pregnancy), race, color, national origin, religion, age, disability that can reasonably be accommodated without undue hardship, genetic information, military status, sexual orientation, gender identity, or any other protected classification under applicable law. We do not discriminate in any of our employment policies and practices. All associates are expected to follow these principles in all relationships with other associates, applicants, or others with whom we do business.<br/><br/>The Company welcomes applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the application process.<br/><br/>California Pay Information: https://knitwellgroup.com/assets/CA-Posting-ANN.pdf", "responsibilities": "Responsibilities will include: Providing exceptional client service, operating as the Manager on Duty in the absence of a manager, performing operational and transactional functions, handling client service issues, issuing approvals for desk transactions as well as opening and closing the store. The Assistant Manager will refer all duties which require managerial experience and/or approval to the Store Manager (e.g. disciplinary action, hiring, and terminating associates).", "qualifications": {"required": "Minimum Requirements: High School Diploma or GED\nMinimum six months Sales Associates experience with ANN INC. or equivalent experience with another retailer in a position of sales associate or higher.", "preferred": "Part-time or full-time managerial experience preferred"}, "skills": [], "postedDate": "4 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3902473479"}