{"jobTitle": "Supply Chain Assistant", "company": {"name": "MM International, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Personal Care Product Manufacturing", "description": "<strong>Job Title: Production/Supply Chain Assistant (Beauty Products)<br/><br/>Onsite work in Los Angeles, 90065<br/><br/></strong><strong>Type: 6 months Contract to hire<br/><br/>Rate: 25$ <br/><br/></strong><strong>Summary<br/><br/></strong><strong>Must be Bilengual in Korean <br/><br/></strong>We are seeking a highly organized and detail-oriented Production Assistant to join our team and assist in overseeing all aspects of beauty product production. The ideal candidate will have a passion for the beauty industry, exceptional communication skills, and fluency in Korean to facilitate communication with our manufacturing partners in Korea. This role offers an exciting opportunity to contribute to the creation of high-quality beauty products and ensure smooth production processes.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Coordinate with internal teams, including product development, supply chain, and quality control, to ensure seamless execution of production plans.</li><li> Liaise with Korean factories and suppliers to communicate production requirements, timelines, and specifications effectively.</li><li> Assist in sourcing raw materials, components, and packaging materials from domestic and international suppliers, maintaining relationships and negotiating contracts as necessary.</li><li> Monitor production schedules and timelines, identifying and addressing any potential delays or issues to ensure on-time delivery of products.</li><li> Conduct quality inspections at various stages of production to uphold product standards and specifications.</li><li> Collaborate with cross-functional teams to troubleshoot and resolve any production-related challenges.</li><li> Maintain accurate records of production activities, including inventory levels, production costs, and quality assurance documentation.</li><li> Assist in the development and implementation of process improvements to optimize efficiency and reduce production costs.</li><li> Stay informed about industry trends, regulations, and best practices related to beauty product manufacturing.</li><li> Provide administrative support as needed, including preparing reports, scheduling meetings, and coordinating logistics for production-related activities.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Fluency in Korean and English is required.</li><li> Previous experience in production, supply chain management, or manufacturing within the beauty industry is strongly preferred.</li><li> Bachelor's degree in Business Administration, Supply Chain Management, or a related field preferred.</li><li> Strong organizational skills with the ability to multitask and prioritize competing demands effectively.</li><li> Proficiency in Microsoft Office Suite and experience with production management software is a plus.</li></ul>", "responsibilities": "Coordinate with internal teams, including product development, supply chain, and quality control, to ensure seamless execution of production plans. Liaise with Korean factories and suppliers to communicate production requirements, timelines, and specifications effectively. Assist in sourcing raw materials, components, and packaging materials from domestic and international suppliers, maintaining relationships and negotiating contracts as necessary. Monitor production schedules and timelines, identifying and addressing any potential delays or issues to ensure on-time delivery of products. Conduct quality inspections at various stages of production to uphold product standards and specifications. Collaborate with cross-functional teams to troubleshoot and resolve any production-related challenges. Maintain accurate records of production activities, including inventory levels, production costs, and quality assurance documentation. Assist in the development and implementation of process improvements to optimize efficiency and reduce production costs. Stay informed about industry trends, regulations, and best practices related to beauty product manufacturing. Provide administrative support as needed, including preparing reports, scheduling meetings, and coordinating logistics for production-related activities.", "qualifications": {"required": "Fluency in Korean and English is required. Previous experience in production, supply chain management, or manufacturing within the beauty industry is strongly preferred. Strong organizational skills with the ability to multitask and prioritize competing demands effectively. Proficiency in Microsoft Office Suite and experience with production management software is a plus.", "preferred": "Bachelor's degree in Business Administration, Supply Chain Management, or a related field preferred."}, "skills": ["Korean", "English", "Production", "Supply Chain Management", "Manufacturing", "Beauty Industry", "Microsoft Office Suite", "Production Management Software"], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3902477984"}