{"jobTitle": "Remote Telehealth Licensed Clinical Psychologist-California", "company": {"name": "CHE Behavioral Health Services", "location": "Los Angeles, CA", "industry": "Mental Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Mental Health Care", "description": "Remote Outpatient Telehealth Opportunities for Psychologists and LCSW's in the state of CA.<br/><br/>Join a leading APA-accredited, clinician-led behavioral health company today! C.H.E. Behavioral Health Services is expanding and seeking compassionate psychologists to join our Tele-Health Team. Today, C.H.E. provides superior behavioral health services and is currently focusing on providing remote telehealth and telemedicine services to a diverse population of adults in the community.<br/><br/><strong>Part-time AND Full-time positions available<br/><br/></strong>C.H.E. offers a variety of part-time and/or full-time options to our clinicians.<br/><br/><ul><li>Medical/Dental benefits</li><li>401k with 25% match</li><li>Paid malpractice policy</li><li>Free CEU's as CHE is an APA-accredited company</li><li>Work-Life Balance</li><li>Flexible Work Schedule<br/><br/><br/></li></ul>It’s common for psychologists to diversify their work, especially with the changing landscape of today’s mental health. Therefore, CHE’s flexibility part-time and full time options are the perfect complement to your professional and/or personal commitments that offers a steady and consistent income.<br/><br/>Our clinicians have the ability to address a wide range of mental health conditions and are trained on a variety of assessment tools, diagnostic evaluation and treatment interventions.<br/><br/><strong>Pick your own schedule!<br/><br/></strong>Enjoy the freedom to create your own custom schedules with the perfect work/life balance. Provide virtual, live video therapy sessions from the comfort of your own home or office.<br/><br/>Responsibilities<br/><br/><strong>Focus on the patient’s care without the hassle or on-call responsibilities.<br/><br/></strong>Our psychologists focus primarily on patient’s care and our back-office support team handles the rest including billing, collections and credentialing etc... No need for on-call responsibilities and no time spent dealing with insurance companies.<br/><br/>This allows our clinicians time to be spent where it should be; with their patients.<br/><br/><strong>Interested in benefits?<br/><br/></strong>Both full-time and part-time clinicians are eligible to participate for medical health benefits. Please speak with the recruitment team to obtain additional specifics on benefits.<br/><br/><strong>Join the C.H.E Tele-Health Team and make a difference!<br/><br/></strong>Qualifications<br/><br/><strong>Requirements<br/><br/></strong><ul><li>A completed doctorate in clinical psychology, counseling psychology</li><li>Licensed psychologist<br/><br/><br/></li></ul><strong>If you are interested or have questions, apply today!</strong> Our dedicated recruitment team will reach out to you quickly in order to answer any and all questions to help you determine if C.H.E. is the right “fit” for you.<br/><br/><strong>Job Requirements<br/><br/></strong><ul><li> Active State Licensed Psychologist. Or Masters in Social Work</li><li> Doctorate in Clinical/Counseling Psychology.</li></ul>", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3902113485"}