{"jobTitle": "Content Designer", "company": {"name": "Meta", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "142,000.00/yr - $205,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "Content designers at Meta craft simple, straightforward and human experiences. Approaching design through the lens of language, we leverage our expertise in user experience design, design thinking and product strategy. Come join our team to create and shape great, intuitive products and services used by billions of people around the world every day.You’ll be expected to design and deliver product flows, new features, in-product language, content frameworks, navigation, product naming and more, for platforms including mobile, desktop, AR/VR, hardware and voice. The Meta Content Design team is one of the largest and most established in the world, and includes people at various stages in their careers and from a range of backgrounds.<br/><br/>Content Designer Responsibilities:<br/><br/><ul><li>Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences.</li><li>Apply systems thinking to the product, whether it’s defining extensible design system guidance, conducting audits of existing experiences or creating information architecture.</li><li>Use your familiarity with how code works in software. This may involve doing things like updating language in code with internal tools, reviewing code to ensure the in-product language is as intended, or creating the logic to personalize the experience for a user.</li><li>Give and solicit feedback from your UX design peers in service of building the best products.</li><li>Create high-fidelity design mocks using existing components in Figma, and use them to present design solutions.</li><li>Collaborate daily with peers in every discipline, including engineering, design, research, marketing and data science, to take products from conception to launch.</li><li>Partner with our internationalization team to ensure product experiences are of the highest quality in every language.</li><li>Demonstrate sound judgment and influence product decisions, team direction and strategy. This includes identifying potential risk for users or the company, and aligning stakeholders around significant decisions by illustrating product tradeoffs.</li><li>Independently and proactively identify and work on projects that span multiple teams. This may involve facilitating or co-facilitating design sprints and workshops to kick off these projects.</li><li>Build internal community, provide mentorship and develop skills of other content designers.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>7+ years’ experience in UX writing.</li><li>Examples of finished wireframes, or design mocks authored using design tools, that have been used to drive decision-making within a team.</li><li>Experience with simplifying and persuasively communicating complex ideas to broad audiences.</li><li>Familiarity with tools for managing and updating content at scale.</li><li>Examples of work in design systems and systems thinking.</li><li>Demonstrated experience leading projects with minimal direction and handling a large degree of ambiguity.<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$142,000/year to $205,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Content designers at Meta craft simple, straightforward and human experiences. Approaching design through the lens of language, we leverage our expertise in user experience design, design thinking and product strategy. Come join our team to create and shape great, intuitive products and services used by billions of people around the world every day.You’ll be expected to design and deliver product flows, new features, in-product language, content frameworks, navigation, product naming and more, for platforms including mobile, desktop, AR/VR, hardware and voice. The Meta Content Design team is one of the largest and most established in the world, and includes people at various stages in their careers and from a range of backgrounds.<br/><br/>Content Designer Responsibilities:<br/><br/><ul><li>Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences.</li><li>Apply systems thinking to the product, whether it’s defining extensible design system guidance, conducting audits of existing experiences or creating information architecture.</li><li>Use your familiarity with how code works in software. This may involve doing things like updating language in code with internal tools, reviewing code to ensure the in-product language is as intended, or creating the logic to personalize the experience for a user.</li><li>Give and solicit feedback from your UX design peers in service of building the best products.</li><li>Create high-fidelity design mocks using existing components in Figma, and use them to present design solutions.</li><li>Collaborate daily with peers in every discipline, including engineering, design, research, marketing and data science, to take products from conception to launch.</li><li>Partner with our internationalization team to ensure product experiences are of the highest quality in every language.</li><li>Demonstrate sound judgment and influence product decisions, team direction and strategy. This includes identifying potential risk for users or the company, and aligning stakeholders around significant decisions by illustrating product tradeoffs.</li><li>Independently and proactively identify and work on projects that span multiple teams. This may involve facilitating or co-facilitating design sprints and workshops to kick off these projects.</li><li>Build internal community, provide mentorship and develop skills of other content designers.<br/><br/></li></ul>", "qualifications": {"required": "7+ years’ experience in UX writing.\nExamples of finished wireframes, or design mocks authored using design tools, that have been used to drive decision-making within a team.\nExperience with simplifying and persuasively communicating complex ideas to broad audiences.\nFamiliarity with tools for managing and updating content at scale.\nExamples of work in design systems and systems thinking.\nDemonstrated experience leading projects with minimal direction and handling a large degree of ambiguity.<br/><br/>"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "$142,000/year to $205,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3903964245"}