{"jobTitle": "Fashion Influencer", "company": {"name": "Fud, Inc.", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are looking for a<strong> Fashion Influencer </strong>to <em>conceptualize and create engaging content for our community.</em> If you love following trends and understand the type of content that drives engagement, you may be just the person we’re looking for. The ideal candidate will be a creative thinker with a passion for entrepreneurship and independent working. <strong>The goal is to share your know-how inside the community and teach them how to do it as a side hustle. <br/><br/></strong>Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>You can experience our community for yourself by downloading our free to use app.<br/><br/>You will join a community focused on side hustles, including:<br/><br/><ul><li>Content Creator — YouTube, TikTok, or Instagram</li><li>Reselling and Thrifting — including eBay, Etsy, Mercari, Poshmark, and others</li><li>E-Commerce — including Amazon, Shopify, and your own online store</li><li>Gig Economy — like DoorDash, Uber, or Lyft</li><li>Freelancing and Consulting — social media marketing, graphic design, and more</li><li>Online Business — including blogging, podcasting, and online courses</li><li>Local Services — including cleaning, knife sharpening, notary services, pet waste removal, and more</li><li>Self-Publishing — including Kindle Direct Publishing and Canva<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>You are aware of the trends in future of work, personal finance, and entrepreneurship</li><li>Ability to work independently and manage your time effectively</li><li>High level of initiative and positive approach</li><li>Strong communication skills</li><li>Comfortable with using social media and other digital tools</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>Passion for innovation and entrepreneurship<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Be your own boss</li><li>Learn how to make money from your passion and interests</li><li>Find a community of like minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want<br/><br/></li></ul>We are a community that values diversity. We encourage everyone including women and people of color to join us!", "jobFunction": "Other", "industry": "Technology, Information and Media", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3904622367"}