{"jobTitle": "Machine Shop Supervisor", "company": {"name": "VAST", "industry": "Defense and Space Manufacturing", "size": "51-200 employees", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$82,100.00 - $118,100.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "At Vast, our mission is to contribute to a future where billions of people are living and thriving in space. We are building artificial gravity space stations, allowing long-term stays in space without the adverse effects of zero-gravity. Our initial crewed space habitat will be Haven-1, scheduled to be the world’s first commercial space station when it launches into low earth orbit in August 2025. Our team is all-in, committed to executing our mission safely and on time. If you want to work with the most talented people on Earth furthering space exploration for humanity, come join us. Vast is looking for a Machine Shop Supervisor, reporting to the Senior Manager of Machining, to support the development of the systems that will be required for the design and build of artificial-gravity human-rated space stations. This will be a full-time, exempt position located in our Long Beach location. The Machine Shop Supervisor will play a crucial role in overseeing the efficient operation of our machine shop, ensuring productivity, quality standards, and safety protocols are upheld at all times.", "responsibilities": "Lead and mentor a team of machinists and programmers. Conduct daily team meetings to communicate goals and expectations. Coordinate work schedules and assignments to optimize productivity. Work closely with manufacturing planners for efficient scheduling and prioritization of jobs. Ensure aerospace industry quality standards are followed. Implement and oversee quality control measures. Continual optimization of machining processes for efficiency. Collaborate with engineering teams and other departments for process improvements. Coordinate repairs with the maintenance teams in a timely manner. Enforce safety protocols in the machine shop. Identify training needs for the team. Develop and foster strong relationships with upper management.", "qualifications": {"required": "Bachelors degree or equivalent work experience. 5-7 years of experience in a manufacturing environment. Knowledge of machining processes, CNC equipment, and tooling.", "preferred": "Proven leadership abilities with a track record of team management. Previous experience in a supervisory role in a machine shop or manufacturing environment. Familiarity with lean manufacturing principles and continuous improvement methodologies. Commitment to safety, quality, and adherence to standards. Ability to analyze data and implement process improvements. Willingness to adapt to changing priorities and drive innovation within the organization. Strong problem-solving skills and ability to make timely decisions. Effective communication and collaboration skills."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Base salary will vary depending on job-related knowledge, education, skills, experience, business needs, and market demand. Salary is just one component of our comprehensive compensation package. Full-time employees also receive company equity, as well as access to a full suite of compelling benefits and perks, including: 100% medical, dental, and vision coverage for employees and dependents, flexible paid time off for exempt staff and up to 15 days of vacation for non-exempt staff, paid parental leave, short and long-term disability insurance, life insurance, free catered meals and snacks and beverages, access to a 401(k) retirement plan, One Medical membership, ClassPass credits, personalized mental healthcare through Spring Health, and other discounts and perks.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3905385334"}