{"jobTitle": "Managing Director", "company": {"name": "DelMorgan & Co.", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Business Development and Sales", "industry": "Investment Banking", "description": "<u>About DelMorgan</u><p><span>With over 150 years of combined experience and over $250 billion in successfully completed transactions, the professionals at DelMorgan provide world-class financial advice and assistance to companies, institutions, governments and individuals around the world. Our services are fundamentally centered on achieving our clients’ aims to consummate strategically important transactions and to enhance shareholder value.</span></p><p><strong>Position Overview</strong></p><p><span>The Managing Director fulfills a key leadership role within our investment banking group. Primary responsibilities include generating new business for the firm, managing existing client engagements, closing deals, and overseeing junior Banking staff. This is an opportunity for growth, responsibility and building wealth for the ideal candidate.</span></p><p><br/></p><p><strong>Key Responsibilities</strong><span> </span></p><p><br/></p><p>·      <span>Actively purse business development opportunities and market a full range of services to prospective clients;</span></p><p>·      <span>Create and manage new deal flow and originate new client engagements that fit the strategy of the firm;</span></p><p>·      <span>Develop client networks, establish and maintain pipeline and support efforts in developing and executing sales and marketing strategies;</span></p><p>·      <span>Lead transactions in all stages, from initial client pitch to transaction closing;</span></p><p>·      <span>Extraordinary day-to-day deal execution, negotiation and closing skills;</span></p><p>·      <span>Communicate financial information and strategic issues in a clear, concise and relevant manner to assist and guide executives in corporate finance transactions;</span></p><p>·      <span>Demonstrate extraordinary attention to detail on client deliverables;</span></p><p>·      <span>Maintain and manage client relationships and be actively involved at the key strategic points of each transaction;</span></p><p>·      <span>Provide leadership, professional development and mentoring for junior staff;</span></p><p><br/></p><p><strong>Desired Skills and Experience</strong></p><p><br/></p><p>·      <span>10 plus years of experience at boutique or regional investment bank with demonstrable M&amp;A execution experience</span></p><p>·      <span>Ability to make effective decisions by analyzing information and considering priorities;</span></p><p>·      <span>Demonstrated experience with managing day-to-day aspects of client relationships and projects;</span></p><p>·      <span>Demonstrated record of leadership and effective management;</span></p><p>·      <span>Previous success and proven track record in new business development and closing investment banking transactions;</span></p><p>·      <span>Deep understanding of the capital marketplace, including deal multiples, pricing, structure, potential financing sources and buyers;</span></p><p>·      <span>Understanding of capital advisory services and the M&amp;A process, complex transactions, creating buyer/seller strategies, deal structuring and negotiation;</span></p><p>·      <span>Significant client interaction and experience, particularly showing the ability to develop strong and influential client relationships;</span></p><p>·      <span>Bachelor's or Master's degree in Finance, Accounting or Economics or an MBA, CFA;</span></p><p>·      <span>Strong leadership and management skills, combining sound judgment, team building and clear communication skills;</span></p><p>·      <span>An appetite to work in an entrepreneurial environment with the ability to think creatively playing a key role in engineering the firm’s long-term success;</span></p><p>·      <span>Passionate about our firm’s commitment, mission, core values and driven to build a high-impact organization</span></p>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3905595519"}