{"jobTitle": "Coordinator, International Media Management", "company": {"name": "Avani Tech Solutions Private Limited", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "Job Title: Coordinator, International Media Management<br/><br/>Location: Hybrid, Burbank Site selected - Burbank, CA 91505 . 2 days in office (training period will be full time onsite, once they are working independently they can transition to 2 days onsite, flexible on which days)<br/><br/>Duration: 7 months<br/><br/>PR: $31.00/hr on W2<br/><br/>Description<br/><br/>Hours: 9A - 6P pacific<br/><br/>What are the main 3-5 responsibilities of this resource?<br/><br/>In US Creative Marketing team, we distribute over 100+ marketing campaigns to 7 stakeholders within the org, they will assist on administrative tasks such as scheduling meetings, updating project management systems, communicating on deliveries, updating documents, tracking deliverables, organizing asset banks<br/><br/>What are the TOP Critical Skills or Must Haves skills a candidate should have on their resume in order to be considered?<br/><br/><ul><li>1 or more years of experience coordinating the acquisition and delivery of media assets used to produce television/film promotional content.</li><li>Knowledge of a wide range of file formats and media types, cloud-based media management systems, general knowledge of marketing and promotional workflows and assets, etc.</li><li>Experience and comfortability communicating directly with company Executives, production teams and studios.</li><li>Experience with Adobe Creative Cloud Suite and non-linear editing software is a plus.<br/><br/></li></ul>Nice To Have<br/><br/><ul><li>Ability to operate with significant autonomy and discretion.</li><li>Strong follow-up skills and multi-tasking ability is crucial.</li><li>Ability to prioritize in a complex, fast-paced environment.</li><li>Ability to work effectively under pressure, with challenging and often simultaneous deadlines.</li><li>Dedication and a commitment to excellence is key.</li><li>A highly effective collaborator with the ability to work with a wide range of departments.</li><li>Embraces accountability.</li><li>Proven ability and dedication to working collaboratively with excellent organizational, analytical, and problem-solving skills.</li><li>Excellent written, oral, and visual communication proficiencies, including the ability to draft documentation.<br/><br/></li></ul>Deal Breakers?<br/><br/>Must be available to work the proposed hours full time.<br/><br/>Primary Responsibilities<br/><br/><ul><li>Request and update Master Creative Documents (MCDs) to ensure all marketing assets are requested in a timely manner.</li><li>Communicate with Creative, PMO, Marketing, and Production teams to ensure delivery of marketing assets.</li><li>Communicate with Creative, Marketing, and Press to ensure all pertinent information is available on MCDs (i.e. due dates, trafficking dates, flight state/end dates, promo usage,<br/><br/></li></ul>music license, and restrictions).<br/><br/><ul><li>Track marketing assets through project management systems (Asana and Airtable).</li><li>Ensure all versions, layouts and files received from vendors/partners are placed on the library promptly and in an organized fashion.</li><li>Assist in the management of the International Digital Asset library, by ingesting assets, tagging and updating metadata, and helping with administration of users, permissions and overall system maintenance.</li><li>Fulfill media management requests by working with various departments, external teams and numerous media systems to acquire, ingest, catalog and distribute assets to requesters.</li><li>Establish strong relationships with Global brand partners, internal teams, and vendors to acquire media and pertinent information surrounding assets.</li><li>Ensure robust content security policies and procedures are met in all aspects of acquisition, management and distribution of assets.</li></ul>", "responsibilities": "<ul><li>Request and update Master Creative Documents (MCDs) to ensure all marketing assets are requested in a timely manner.</li><li>Communicate with Creative, PMO, Marketing, and Production teams to ensure delivery of marketing assets.</li><li>Communicate with Creative, Marketing, and Press to ensure all pertinent information is available on MCDs (i.e. due dates, trafficking dates, flight state/end dates, promo usage,<br/><br/></li></ul>music license, and restrictions).<br/><br/><ul><li>Track marketing assets through project management systems (Asana and Airtable).</li><li>Ensure all versions, layouts and files received from vendors/partners are placed on the library promptly and in an organized fashion.</li><li>Assist in the management of the International Digital Asset library, by ingesting assets, tagging and updating metadata, and helping with administration of users, permissions and overall system maintenance.</li><li>Fulfill media management requests by working with various departments, external teams and numerous media systems to acquire, ingest, catalog and distribute assets to requesters.</li><li>Establish strong relationships with Global brand partners, internal teams, and vendors to acquire media and pertinent information surrounding assets.</li><li>Ensure robust content security policies and procedures are met in all aspects of acquisition, management and distribution of assets.</li></ul>", "qualifications": {"required": "1 or more years of experience coordinating the acquisition and delivery of media assets used to produce television/film promotional content. Knowledge of a wide range of file formats and media types, cloud-based media management systems, general knowledge of marketing and promotional workflows and assets, etc. Experience and comfortability communicating directly with company Executives, production teams and studios. Experience with Adobe Creative Cloud Suite and non-linear editing software is a plus.", "preferred": "Ability to operate with significant autonomy and discretion. Strong follow-up skills and multi-tasking ability is crucial. Ability to prioritize in a complex, fast-paced environment. Ability to work effectively under pressure, with challenging and often simultaneous deadlines. Dedication and a commitment to excellence is key. A highly effective collaborator with the ability to work with a wide range of departments. Embraces accountability. Proven ability and dedication to working collaboratively with excellent organizational, analytical, and problem-solving skills. Excellent written, oral, and visual communication proficiencies, including the ability to draft documentation."}, "skills": ["Adobe Creative Cloud Suite", "Media Management", "Marketing", "Communication", "Project Management"], "postedDate": "4 months ago", "url": "https://www.linkedin.com/jobs/view/3907115691"}