{"jobTitle": "Hospital Manager", "company": {"name": "PetVet Care Centers", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Veterinary Services", "description": "<strong>Position Overview:</strong> The Hospital Manager works daily to develop an efficient and effective hospital support team by fostering an environment of trust, teamwork, and accountability. The Hospital Manager partners with the Veterinarian to provide an efficient and profitable operation by driving revenue and managing costs while creating a hospital culture based on high-quality patient care and excellent customer service.<br/><br/><strong>Essential Position Functions:<br/><br/></strong><ul><li>Supervises the staff within all hospital support departments; achieves and maintains all labor goals. </li><li>Hires and trains office and technical clinic support staff; responsible for new hire paperwork. </li><li>Orients and trains new clinic staff to the hospital and duties. </li><li>Reviews work performance of direct reports, constructively delivers feedback, resolves personnel issues, and discussions with the Regional Manager weekly. </li><li>Conducts timely performance appraisals. </li><li>Documents and reports accidents; files appropriate reports. </li><li>Writes policies/procedures relating to all technical aspects of the hospital and presents for approval. </li><li>Manages schedules for technical and administrative staff coordinates the DVM. </li><li>Monitors Workforce Management for missed punches and management of overtime hours daily. </li><li>Administers the daily operations. </li><li>Works with the PetVet Care Centers support team to ensure compliance with all administrative responsibilities. </li><li>Monitors budgets, purchases equipment and supplies, and oversees the maintenance of the facility. </li><li>Responsible for submitting contract veterinarian invoices, submitting all local vendor invoices, ensuring invoice accuracy, and obtaining w9’s from local vendors. </li><li>Assists in resolving issues with pet owners where appropriate. </li><li>Reviews revenue, labor, and employee issues with the PetVet leadership on a weekly conference call; achieve goals set in each area. </li><li>Responsible for all local accounting functions; ensure daily financial information is accurate. </li><li>Oversees the management of the inventory and ensures proper documentation and systems are in place. </li><li>May establish and oversee billing practices; reviews and maintains the accuracy of billing and oversees charge capturing. </li><li>May be responsible for contracts or negotiations with insurance providers. </li><li>Maintain compliance of current licensure and the display of the same. Maintaining updated licenses for DVMs. </li><li>Performs other duties and responsibilities as assigned by the Manager. <br/><br/></li></ul><strong>Competencies:<br/><br/></strong><ul><li>Analytical skills; strong ability to analyze information quickly and efficiently as it relates to the hospital’s finances. </li><li>Strategic planning; the ability for financial forecasting, marketing plans, and long-term plans for the growth of the practice. </li><li>Leadership; ability to effectively manage and direct hospital staff towards a common goal. </li><li>Decision-making skills; possess the ability to make good decisions, solve problems, and decide on essential matters. </li><li>Communications; demonstrate the ability to communicate, orally, and in writing, effectively to convey necessary information to hospital staff. </li><li>Resourcefulness and adaptability; the ability to take the initiative and get things done as well as the ability to adapt to changes or new information. </li><li>Compliance; ability to understand and manage important compliance regulations and requirements of the hospital. </li><li>Planning and prioritizing; must be able to organize work efficiently, set priorities, and establish plans and timetables for achieving goals. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor’s degree in business, health science or related field strongly preferred. </li><li>At a minimum, five years of direct office management experience, including at least two years of supervisory experience is required. </li><li>Certified Veterinary Practice Manager (CVPM) or Master of Healthcare Administration (MHA) is preferred. </li><li>May consider an equivalent combination of education, certification, training, and/or experience. <br/><br/></li></ul><strong>Position Knowledge and Skill Requirements:<br/><br/></strong><ul><li>Ability to provide customer service in a courteous, prompt, and efficient manner. </li><li>Computer proficiency in using Microsoft Office products (Word, Outlook, and Excel) and applicable organization-specific software. </li><li>Establish and maintain productive and cooperative working relationships. </li><li>Active time management and organizational skills to complete work promptly. </li><li>Excellent communications skills both orally and in writing. </li><li>Must be flexible with scheduling and able to work some weekends and holidays. </li><li>Ability to work with or around sick animals, potentially hazardous materials, cleaning chemicals, gas anesthetics, zoonotic diseases, and unpleasant odors. </li><li>Depending on the functional area of assignment, tasks may involve extended periods at a keyboard or workstation and/or extended periods standing and/or walking. </li><li>May include some climbing, balancing, stooping, kneeling, crouching, or crawling. </li><li>Some tasks involve the periodic performance of moderately physically demanding work, usually involving lifting or carrying moderately heavy animals (up to 50 pounds). </li><li>Other duties and responsibilities as assigned by management. <br/><br/></li></ul><strong>Additional Information:</strong> The list of essential functions, as outlined in this job description, is intended to be representative of the tasks performed within this classification. The omission of any job function does not preclude management from assigning duties not listed herein if such functions are a logical assignment to the position.<br/><br/>Pay Range<br/><br/>$66,000—$83,000 USD<br/><br/>PetVet Care Centers, Inc. is one of the nation’s leading operators of veterinary hospitals for companion animals. The company operates over 450 hospitals across multiple states and employs over 11,000 people including over 800 veterinarians. Since its inception, PetVet has been structured around a model that is focused on developing a partnership between the hospitals and the company and providing the highest quality medicine and service.<br/><br/>PetVet is an equal opportunity employer. All employment decisions are made without regard to race, color, age, gender, gender identity or expression, sexual orientation, marital status, pregnancy, religion, citizenship, national origin/ancestry, physical/mental disabilities, military status or any other basis prohibited by law. EOE, M/F/D/V<br/><br/>PetVet respects your privacy and is committed to protecting your personal information. Please see our privacy notice for additional information about our data practices.<br/><br/>", "responsibilities": "The Hospital Manager works daily to develop an efficient and effective hospital support team by fostering an environment of trust, teamwork, and accountability. The Hospital Manager partners with the Veterinarian to provide an efficient and profitable operation by driving revenue and managing costs while creating a hospital culture based on high-quality patient care and excellent customer service.", "qualifications": {"required": "At a minimum, five years of direct office management experience, including at least two years of supervisory experience is required.", "preferred": "Bachelor’s degree in business, health science or related field strongly preferred. Certified Veterinary Practice Manager (CVPM) or Master of Healthcare Administration (MHA) is preferred. May consider an equivalent combination of education, certification, training, and/or experience."}, "skills": ["Customer Service", "Microsoft Office", "Time Management", "Communication", "Leadership", "Strategic Planning", "Decision Making", "Compliance", "Planning", "Prioritization"], "postedDate": "2 weeks ago", "salary": {"amount": "66,000.00—$83,000", "currency": "USD"}, "benefits": "PetVet Care Centers, Inc. is one of the nation’s leading operators of veterinary hospitals for companion animals. The company operates over 450 hospitals across multiple states and employs over 11,000 people including over 800 veterinarians. Since its inception, PetVet has been structured around a model that is focused on developing a partnership between the hospitals and the company and providing the highest quality medicine and service.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3907616675"}