{"jobTitle": "Operations Coordinator", "company": {"name": "Cynet Systems", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "21.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Information Technology & Services", "description": "<strong>Job Description: <br/> <br/> Pay Range $21hr - $26hr<br/> <br/> Responsibilities:</strong> <ul><li>  Partner with the Manager of Business Operations to identify opportunities or issues that could impact the organization's ability to successfully, safely, and effectively achieve our objectives.  </li><li>  Establish a communications infrastructure within the Operations team, identifying vehicles and methods to keep team members informed and engaged and drive business results.  </li><li>  Work closely with Corporate Communications.  </li><li>  Build and maintain relationships with the following supporting teams including but not limited to AV, IT, Facilities, Telcom, Catering, and HR.  </li><li>  Maintain and execute the comprehensive onboarding process for new hires or transfers.</li> </ul>  Qualifications:  <ul><li>  2-3 years of experience.  </li><li>  Bachelor’s Degree or Equivalent Preferred and HS diploma required.</li><li>  Aside from being a service-minded and highly organized individual, in order to be fully successful in the role and maximize candidate potential.</li><li>  Looking for the following: Strong Project Management / Program Management experience – this is a hands-on role, and some project management experience is desired to be successful in this role.  </li><li>  Delivery to tight deadlines – there will be a lot to do and not a lot of time to do it.  </li><li>  Proven ability to manage a large workload, prioritize, and deliver high-quality output will be essential.  </li><li>  Communication Skills – the role requires the ability to communicate and engage throughout the organization, both in written and verbal form.  </li><li>  Strong presentation skills are a must.  </li><li>  Service orientation and strong relationship-building skills are critical.</li></ul>", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3907406685"}