{"jobTitle": "STORE MANAGER - NEIMAN MARCUS, BEVERLY HILLS", "company": {"name": "CELINE", "industry": "Retail Luxury Goods and Jewelry", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Luxury Goods and Jewelry", "description": "PERMANENT / FULL-TIME<br/><br/>Symbol of elegance and authentic luxury with its sophisticated and timeless Collections, CELINE is a French Leather-Goods and Couture House, driven by a strong artistic and holistic vision.<br/><br/>CELINE’s ambition is to be one of the most iconic luxury brands worldwide. To make this vision a reality we are looking for agile, passionate and authentic personalities who are eager to evolve in a highly creative and challenging environment.<br/><br/><strong>YOUR WORK ENVIRONMENT<br/><br/></strong>The Celine Concession Store Manager is responsible for overall management of the concession, staff, merchandise, and customer service. They will also be responsible for achieving sales objectives, maintaining, and achieving high operational and merchandising standards and goals, building highly motivated teams, and developing associates to the next level.<br/><br/><strong>YOUR IMPACT<br/><br/></strong>Organization:<br/><br/><ul><li>Maintain a clear and effective store organization (by support functions and product categories)</li><li>Communicate on all organizational changes within the store<br/><br/></li></ul>Staff Development and Retention:<br/><br/><ul><li>Play a key role in team motivation by establishing a real team spirit and teamwork environment</li><li>Monthly review of staff on One-to-One basis</li><li>Evaluate individual staff performance through PCR process</li><li>Retain staff by identifying and developing growth potential of individual staff members<br/><br/></li></ul>Customer Service:<br/><br/><ul><li>Assist sales associates with various customer service issues</li><li>Coach and develop the team to maintain the highest degree of customer service<br/><br/></li></ul>Operations:<br/><br/><ul><li>Use Retail Pro and its inventory management functions</li><li>Work with Buyer for OTB and ordering responsibilities</li><li>Provide monthly qualitative and quantitative business reports</li><li>Maintain positive relationship with members of corporate office, regional office, and other stores</li><li>Full Profit and Loss responsibility for the store, with particular attention given to controllable expenses and sales plan</li><li>Maintain accurate SKU levels, dollar levels and model stocks using current P.O.S. system. </li><li>Be fully trained in P.O.S systems and to ensure that the staff is proficient as well</li><li>Cycle/Physical inventory requirements must be met<br/><br/></li></ul>Store Appearance:<br/><br/><ul><li>Adhere to Grooming and Styling standards, lead by example, and enforce the standards within the entire team</li><li>Monitor the general appearance of the store: cleanliness, store maintenance, organization of sales area and back-of-house</li></ul>", "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3908013249"}