{"jobTitle": "Stock Associate", "company": {"name": "J.Crew", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.28/hr - 22.75/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "We make timeless clothes that last a lifetime…then pair them with of-the-moment styles season after season, decade after decade. We think that distinct heritage pairs perfectly with modern design and fabric technology. We believe in feel-good color… Even if black or navy makes you feel best, we’re here for that. We’re the experts in signature categories: cashmere, coats, blazers, pants—and we also collaborate with the coolest brands out there because we know that creativity is contagious. We consider leopard a neutral, speak stripes fluently and live for a great gingham. We believe in looking like a million bucks, not spending it—which is why we go the extra mile to source the absolute best fabrics at the most accessible prices. We also know that we have a responsibility to the planet and to humanity to choose eco-friendly fabrics and to support our factory workers, without compromise.<br/><br/>As a Stock Associate, you keep everything moving seamlessly. You’ll be responsible for efficiently receiving product, making sure it’s quickly replenished on the sales floor and tidy and easily accessible in the stock room. You’ll package orders for our customers – quickly but with care and will help with tasks as needed. You’ll contribute to an inclusive work environment focused on collaboration and passion for both the product and providing our customers with an amazing experience.<br/><br/>Support store team to exceed customer expectations.  Process inbound and outbound shipments, while maintaining an organized stock room.  Provide an engaging and efficient checkout experience.  Comply with merchandise receiving and handling guidelines.  Maintain presentation standards.  Learn our systems and processes and use them effectively.  Act in a manner that aligns with our values. <br/><br/>Are a team player and bring your best to everything you do.  Are flexible, and ready to have fun along the way.  Leverage technology to maximize efficiency and productivity.  Are at least 18 years old.  Are available when we are busy, including: nights, weekends and holidays.  Can bend, reach, stretch as well as lift, carry and move at least 40 pounds | 18 kilos.  Can regularly move around all store areas and be accessible to customers. <br/><br/>Competitive base pay and bonus programs Flexible days and hours Amazing merchandise discounts 24/7 free confidential help with a variety of personal and work concerns Personal and professional development Giving back –volunteer program, disaster relief funds, charitable matching donations* Medical, dental, vision, life insurance, pet insurance, legal plan, ID theft, commuter benefit* Time Away – paid time off, holidays, parental leave, disability leave, bereavement* 401(k) plan with company matching contributions Note: availability of these benefits and perks may be subject to work location &amp; employment type and may have certain eligibility requirements. <br/><br/>Hourly Range: $17.28 - $22.75<br/><br/>At J.Crew Group (JCG) we aim to pay competitively for our company’s size and industry. The base salary offered will take into account internal equity and may vary depending on the candidate’s geographic region of work premises, job-related knowledge, skills, and experience among other factors. The base salary is just one component of J.Crew Group’s competitive total rewards strategy that also includes the opportunity for bonus, competitive benefits and perks.<br/><br/>One of our core focuses here at JCG is creating a community and culture that builds belonging. We are deeply committed to our Diversity, Equity and Inclusion efforts, and we warmly welcome job applicants of all backgrounds.<br/><br/>JCG is proud to affirmatively provide equal opportunity to all associates and qualified applicants without regard to race, color, religion, national origin or citizenship, age, sex, marital status, ancestry, legally protected physical or mental disability, veteran status, gender identity, sexual orientation or any other basis protected under applicable law.", "responsibilities": "Support store team to exceed customer expectations. \nProcess inbound and outbound shipments, while maintaining an organized stock room. \nProvide an engaging and efficient checkout experience. \nComply with merchandise receiving and handling guidelines. \nMaintain presentation standards. \nLearn our systems and processes and use them effectively. \nAct in a manner that aligns with our values. ", "qualifications": {"required": "Are a team player and bring your best to everything you do. \nAre flexible, and ready to have fun along the way. \nLeverage technology to maximize efficiency and productivity. \nAre at least 18 years old. \nAre available when we are busy, including: nights, weekends and holidays. \nCan bend, reach, stretch as well as lift, carry and move at least 40 pounds | 18 kilos. \nCan regularly move around all store areas and be accessible to customers. "}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Competitive base pay and bonus programs Flexible days and hours Amazing merchandise discounts 24/7 free confidential help with a variety of personal and work concerns Personal and professional development Giving back –volunteer program, disaster relief funds, charitable matching donations* Medical, dental, vision, life insurance, pet insurance, legal plan, ID theft, commuter benefit* Time Away – paid time off, holidays, parental leave, disability leave, bereavement* 401(k) plan with company matching contributions Note: availability of these benefits and perks may be subject to work location &amp; employment type and may have certain eligibility requirements. ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3908168088"}