{"jobTitle": "Quality Manager", "company": {"name": "FLAG Solutions LLC", "location": "Lomita, CA"}, "location": "Lomita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Position Summary<br/><br/></strong>The Quality Manager will be accountable for the entire Quality Management System function. In this role, you will integrate and develop processes that meet business needs across the organization, manage complex issues within the functional area of expertise, be involved in long-term planning, and contribute to the overall business strategy. The Quality Manager will maintain third-party certifications, including AS 9100, and prevent minimal findings. Will be responsible for successfully resolving customer quality issues in a timely manner. Will manage internal quality issues and make sure they are handled in a proactive, interactive, and professional manner.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Ensure the reputation and integrity of the company by meeting all customer, regulatory authority, and third-party assessor requirements. </li><li>Responsible for implementing quality compliance, assurance, and improvement initiatives. </li><li>Manages &amp; works closely with the Quality Team to support the resolution of customer quality defects. </li><li>Works with the Quality Team &amp; Supply Chain leadership to drive improvements in supplier quality performance. </li><li>Works directly with suppliers to improve supplier quality performance. </li><li>Monitors site dashboard performance trends to identify and drive opportunities for quality improvement. </li><li>Establish and implement metrics for monitoring system effectiveness and to enable sound quality decisions – product, supplier, customer, regulatory, and systems quality. </li><li>Ensures the site is properly prepared for internal, customer, and/or third-party, regulatory audits and ensures audits are properly managed. </li><li>Supports contract reviews for new contract awards, POCs, and customer and supplier LTAs. </li><li>Provide necessary training to improve Quality Assurance Maturity across the business. </li><li>Oversees the root cause and corrective action process to drive effective process &amp; quality improvements. </li><li>Achieving company goals through managing and mentoring the QA team. </li><li>Maintain ISO 9001 and AS 9100 certifications. Manage the internal and external auditing process. </li><li>Develop policies to support Quality Improvement Plans </li><li>Seek, share, and institutionalize best practices. </li><li>Provide leadership and experience in support of lean manufacturing, product engineering, and manufacturing quality. </li><li>Change agent with strong credibility and influence in the organization. </li><li>Ability to motivate others and achieve results. </li><li>Strong analytical and quantitative skills </li><li>Statistically literate and familiar with Six Sigma quality concepts and tools </li><li>Demonstrated commitment to process improvement. </li><li>Customer-focused in defining quality and establishing priorities. </li><li>Strong oral and written communication skills </li><li>Ability to deliver effective presentations and educate at all levels of the organization. </li><li>Proficiency in math and blueprint reading </li><li>Ability to effectively read, write, and verbally communicate in English.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s degree in technical, engineering, or business is highly preferred or commensurate experience and training. </li><li>Minimum 7 years experience in the aerospace industry in a quality assurance manager role. </li><li>Extensive knowledge of Lean, Six Sigma, and other continuous improvement theories and tools. </li><li>Experience with internal and external quality audits. </li><li>Experience developing and maintaining quality procedures and policies. </li><li>AS9100 certification compliance management. </li><li>Knowledge of the CNC machining process is helpful, but not required.<br/><br/></li></ul><strong>Pay Range<br/><br/></strong>Salary: $100,000 to $120,000 DOE<br/><br/>#ZR", "responsibilities": "Ensure the reputation and integrity of the company by meeting all customer, regulatory authority, and third-party assessor requirements.  Responsible for implementing quality compliance, assurance, and improvement initiatives.  Manages &amp; works closely with the Quality Team to support the resolution of customer quality defects.  Works with the Quality Team &amp; Supply Chain leadership to drive improvements in supplier quality performance.  Works directly with suppliers to improve supplier quality performance.  Monitors site dashboard performance trends to identify and drive opportunities for quality improvement.  Establish and implement metrics for monitoring system effectiveness and to enable sound quality decisions – product, supplier, customer, regulatory, and systems quality.  Ensures the site is properly prepared for internal, customer, and/or third-party, regulatory audits and ensures audits are properly managed.  Supports contract reviews for new contract awards, POCs, and customer and supplier LTAs.  Provide necessary training to improve Quality Assurance Maturity across the business.  Oversees the root cause and corrective action process to drive effective process &amp; quality improvements.  Achieving company goals through managing and mentoring the QA team.  Maintain ISO 9001 and AS 9100 certifications. Manage the internal and external auditing process.  Develop policies to support Quality Improvement Plans  Seek, share, and institutionalize best practices.  Provide leadership and experience in support of lean manufacturing, product engineering, and manufacturing quality.  Change agent with strong credibility and influence in the organization.  Ability to motivate others and achieve results.  Strong analytical and quantitative skills  Statistically literate and familiar with Six Sigma quality concepts and tools  Demonstrated commitment to process improvement.  Customer-focused in defining quality and establishing priorities.  Strong oral and written communication skills  Ability to deliver effective presentations and educate at all levels of the organization.  Proficiency in math and blueprint reading  Ability to effectively read, write, and verbally communicate in English.", "qualifications": {"required": "Bachelor’s degree in technical, engineering, or business is highly preferred or commensurate experience and training.  Minimum 7 years experience in the aerospace industry in a quality assurance manager role.  Extensive knowledge of Lean, Six Sigma, and other continuous improvement theories and tools.  Experience with internal and external quality audits.  Experience developing and maintaining quality procedures and policies.  AS9100 certification compliance management.  Knowledge of the CNC machining process is helpful, but not required.", "preferred": ""}, "skills": ["Lean", "Six Sigma", "Quality Assurance", "Quality Management", "Auditing", "Aerospace", "ISO 9001", "AS9100", "CNC Machining"], "postedDate": "4 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3908628227"}