{"jobTitle": "Project Manager", "company": {"name": "Studio+", "location": "Los Angeles, CA", "industry": "Internet Publishing"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Internet Publishing", "description": "<strong>Project Manager / Sr. Project Manager</strong> <em>(Sr. title indicates greater level of experience and expertise)<br/><br/></em>The Project Manager position is the highest level of project responsibility at Studio+. Project Managers must direct internal project teams while managing client expectations and all other parties involved in the project. Man-power budgeting, project milestone scheduling, staff development, and meeting conditions of satisfaction set forth by the client are just some of the many responsibilities of the Project Manager. All of this must be accomplished while remaining intimately involved in the design documents, being able to assume any project role required to ensure overall project success.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Minimum of three (3) to seven (7) years of demonstrated success in a role of project and client leadership</li><li>History of leading project teams and exceeding client expectations</li><li>Full and detailed understanding of how to deliver a project from concept through close out and all phases and activities in between</li><li>Preferred candidates should hold a Bachelor of Architecture (B. Arch) or Master of Architecture (M. Arch) degree from an accredited institution</li><li>Current architectural license in the state of Florida and NCARB certification highly preferred but not required. </li><li>Proficiency in Revit, AutoCAD, Microsoft Office applications such as Word and Excel. Studio+ was an early adopter of BIM and uses Revit on all projects</li><li>Knowledge of architectural principles, practices and techniques as well as standard operations, policies and procedures of a firm within the A/E industry</li><li>Knowledge of building materials, construction methods, codes, and regulations</li><li>Demonstrate exceptional organizational and time management skills</li><li>Accountable to meet all project objectives and performance expectations of position including profitability and design excellence</li><li>Ability to engage in a collaborative workplace, which may involve working alongside fellow architects and maintaining professional relationships with clients</li><li>Excellent mentoring and leadership skills including working comfortably with varying personalities and communication styles<br/><br/></li></ul><strong>Tasks outlined, but not limited to those listed<br/><br/></strong><ul><li>Provide leadership to project teams empowering team members to creatively solve complex project conditions and client expectations. </li><li>Lead and manage project teams of varying sizes and disciplines, effectively leveraging the strengths of the individual team members to ensure project success</li><li>Provide leadership and confidence to clients, contractors, and governing officials to ensure the client’s conditions of satisfaction are met</li><li>Responsible to ensure projects are completed on time, within architectural contract budget and construction documents meeting Studio+ standard for quality and excellence</li><li>Maintain project specific files, including meeting minutes and notes, financial information, client correspondence and project schedule</li><li>Enforce Studio+ objectives, policies, procedures and performance standards for assigned projects in conjunction with Studio+ standard procedures for Revit, Project Management, and Construction Administration. </li><li>Assist in preparation of fee proposals and contracts with clients, owner, and consultants</li><li>Provide firm wide mentorship to team members at all levels</li><li>Ensure project delivery and quality from programming through project closeout</li><li>Review monthly invoices for client/project billing(s)</li><li>Act as primary client contact and establish and/or maintain client communications to ensure overall satisfaction and future design opportunities</li><li>When applicable, identify new client/project leads in conjunction with Studio+ strategic growth objectives</li><li>Work with Studio+ Principals on project staffing and man-power allocation</li><li>Supervise and support design staff, conduct reviews, participate in quality control processes and assist in establishing training activities and professional development</li><li>Implement all quality assurance and quality control processes for all assigned projects occur and changes are successful implemented</li><li>Weekly coordination with Studio+ Principals on overall project status and staffing requirements<br/><br/></li></ul>Powered by JazzHR<br/><br/>uxO9OACcf8", "postedDate": "4 months ago", "skills": ["Revit", "AutoCAD", "Microsoft Office", "BIM", "Architectural Principles", "Construction Methods", "Building Materials", "Codes and Regulations", "Organizational Skills", "Time Management", "Leadership", "Mentoring", "Client Communication", "Project Management", "Construction Administration", "Fee Proposals", "Contract Negotiation", "Quality Assurance", "Quality Control", "Project Staffing", "Design Staff Supervision", "Training and Development"], "url": "https://www.linkedin.com/jobs/view/3909878463"}