{"jobTitle": "Communications Coordinator", "company": {"name": "Decision Point", "industry": "Internet Publishing", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "45,000.00 - 65,000.00", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Internet Publishing", "description": "Decision Point | Website | Instagram | Vimeo | Youtube<br/><br/><strong>About Decision Point<br/><br/></strong>We are an evangelical non-profit that exists to proclaim the gospel to the next generation. We focus on equipping, sending and reaching students on their school campus and online. Browse through our website at DecisionPoint.org to learn more about what we do.<br/><br/>Come help save the next generation!<br/><br/>Expanding the Mission and Advancing the Gospel<br/><br/>Decision Point is currently active in 17 areas and partnering with churches and mobilizing students for campus outreach. We desire to see this number grow to 25 areas by 2027, and through our online coaching program, we hope to coach students far beyond that. We have seen that coaching a few schools in a local area today can lead to long-term ministry being established for years to come.<br/><br/>We have recently launched our new four-year campaign, I Have Decided.<br/><br/>In the next four years we are praying we will see:<br/><br/><ul><li>10,000 students say, “I have decided to witness for Christ!”</li><li>1,000 churches say, “I have decided to mobilize our students to witness for Christ!”</li><li>10,000 people to say, “I have decided to pray for and financially support this ministry.”<br/><br/></li></ul>We believe that by God’s grace this will result in:<br/><br/><ul><li>25 strategic cities served by Decision Point campus ministry in their communities</li><li>1,000 campuses impacted by the Student Leaders deployed by Decision Point</li><li>2.5+ million students given the gospel on campus or online<br/><br/></li></ul>Check out this video to see our mission in action.<br/><br/>We pray that the Lord will continue expanding the mission - coast-to-coast,<br/><br/>border to border and beyond - till every student has heard.<br/><br/>About the Decision Point Marketing Team:<br/><br/>In the Decision Point Marketing department, we have a mission to tell these stories in a way that gives God glory and motivates His people to praise Him and join the mission. We take this mission seriously, and we aspire to become the premiere communicator of stories of life change and transformation in American youth ministry.<br/><br/>We’ve got amazing stories to tell, but we need help telling them. That’s where you come in.<br/><br/>Key Responsibilities:<br/><br/>This role will help accomplish our vision by telling stories to mobilize our current and future partners to deeper involvement in the mission to reach this generation.<br/><br/>Our Communications Coordinator will play a part in driving forward powerful communication with our ministry partners through weekly newsletters, major fundraising campaigns, and ongoing social media engagement. You will work on a team of staff, interns, and volunteers, going out into the field to observe what the Lord is doing in and through our team. Ultimately, you will spend a lot of time writing (so we hope you love it). You will interview, tease out details of stories, fact check, and record the narrative of the work the Lord is accomplishing through our mission.<br/><br/>Some specific things this job includes:<br/><br/><ul><li>Compose or empower others to write our “Story of the Month” newsletter</li><li>Create drip campaigns to engage our various ministry audiences (potential hires, donors, volunteers, parents, pastors, educators, and etc.)</li><li>Ghost write major funding and cultivation pieces for ministry executives</li><li>Participate in weekly team meetings, lead trainings for interns and volunteers as needed, and meet one-on-one with the Marketing Director</li><li>Produce press releases as needed</li><li>Give input to ministry communication priorities and strategy</li><li>Oversee production schedules for print, mail, and digital publication deadlines</li><li>Go into the field to collect photos and stories. Often this will be at local schools and events, and at other times this means traveling with our team to various mission trips</li><li>Help develop the ministry podcast<br/><br/></li></ul>You’ll report to the Marketing Director and work collaboratively within the Marketing Team. The idea of working with a loose team of interns, volunteers, and free-lancers should sound fun and energizing to you. It would be great if you already have some experience working on teams like this.<br/><br/>Job Requirements:<br/><br/><ul><li>Education: Bachelor’s degree in English, Journalism, Communication, Marketing or related field preferred</li><li>Fluency in Evangelical christian ministry language</li><li>Experience:</li><ul><li>Previous experience reporting, writing, and editing required</li><li>Experience in church or Christian non-profit communications strongly preferred</li><li>Experience in fundraising and ministry partner development communications strongly preferred</li></ul><li>Experience in graphic design, photojournalism, social media account management, and prior experience in running campaigns</li><li>Bonus if you have nonprofit or ministry experience<br/><br/></li></ul>Attitudes and Aptitudes:<br/><br/><ul><li>You are an Evangelical Christian who loves the Gospel and evangelism</li><li>You’re a wise and mature believer who knows the Word of God and seeks to follow it</li><li>You’re a quick and eager learner in all areas</li><li>You have high moral integrity, emotional health, social awareness and spiritual maturity</li><li>You work with enthusiasm and excellence</li><li>You are a strong planner and clear written communicator</li><li>You possess high initiative and constantly seek self-improvement<br/><br/></li></ul>Fundraising and Salary:<br/><br/>Annual salary range for this role is $45,000 - $65,000 based on experience and qualifications.<br/><br/>As a distinctive part of this role, Decision Point is a non-profit ministry where every member of our staff is involved in fundraising for both financial and prayer support. And we think that’s a really good thing!<br/><br/>Just like missionaries about to be sent across the world, your first assignment on Decision Point staff will be to personally contact churches, friends and family and gather a team of partners to monthly invest in the ministry that God is leading you into. We’ll give you tons of training, encouragement and ongoing coaching. If you like everything else and feel like this could be a good fit for you, do not let fundraising stop you; let’s talk first.<br/><br/>Will you come help save the next generation?<br/><br/>You may still have a lot of questions. You may still be praying about whether God is calling you to this mission. That’s ok! Let’s talk. Just fill out the short form and we’ll be in touch to get the conversation started!<br/><br/>Powered by JazzHR<br/><br/>HLl4ih1CzQ", "responsibilities": "This role will help accomplish our vision by telling stories to mobilize our current and future partners to deeper involvement in the mission to reach this generation.<br/><br/>Our Communications Coordinator will play a part in driving forward powerful communication with our ministry partners through weekly newsletters, major fundraising campaigns, and ongoing social media engagement. You will work on a team of staff, interns, and volunteers, going out into the field to observe what the Lord is doing in and through our team. Ultimately, you will spend a lot of time writing (so we hope you love it). You will interview, tease out details of stories, fact check, and record the narrative of the work the Lord is accomplishing through our mission.<br/><br/>Some specific things this job includes:<br/><br/><ul><li>Compose or empower others to write our “Story of the Month” newsletter</li><li>Create drip campaigns to engage our various ministry audiences (potential hires, donors, volunteers, parents, pastors, educators, and etc.)</li><li>Ghost write major funding and cultivation pieces for ministry executives</li><li>Participate in weekly team meetings, lead trainings for interns and volunteers as needed, and meet one-on-one with the Marketing Director</li><li>Produce press releases as needed</li><li>Give input to ministry communication priorities and strategy</li><li>Oversee production schedules for print, mail, and digital publication deadlines</li><li>Go into the field to collect photos and stories. Often this will be at local schools and events, and at other times this means traveling with our team to various mission trips</li><li>Help develop the ministry podcast<br/><br/></li></ul>You’ll report to the Marketing Director and work collaboratively within the Marketing Team. The idea of working with a loose team of interns, volunteers, and free-lancers should sound fun and energizing to you. It would be great if you already have some experience working on teams like this.", "qualifications": {"required": "Previous experience reporting, writing, and editing required", "preferred": "Education: Bachelor’s degree in English, Journalism, Communication, Marketing or related field preferred\nFluency in Evangelical christian ministry language\nExperience in church or Christian non-profit communications strongly preferred\nExperience in fundraising and ministry partner development communications strongly preferred\nExperience in graphic design, photojournalism, social media account management, and prior experience in running campaigns\nBonus if you have nonprofit or ministry experience"}, "skills": ["Evangelism", "Fundraising", "Writing", "Editing", "Marketing", "Public Relations", "Social Media", "Communication", "Nonprofit", "Ministry", "Graphic Design", "Photojournalism", "Campaign Management"], "postedDate": "4 months ago", "benefits": "Annual salary range for this role is $45,000 - $65,000 based on experience and qualifications.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3909242006"}