{"jobTitle": "Project Coordinator", "company": {"name": "Studio+", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "<strong>Project Coordinator / Sr. Project Coordinator / Architect I*</strong> <em>(Sr. title indicates greater level of experience and expertise. An Architect is a licensed project coordinator)<br/><br/></em>The Project Coordinator position provides unlicensed or developing architects/managers with the opportunity to coordinate the production and delivery of design documents for a variety of clientele and project types. In this role they gain the experience needed and develop the required skills to grow into the role of either a Project Architect or Project Manager. Project Coordinators are the future project leaders at Studio+.<br/><br/><strong>Professional Qualifications/Expectations<br/><br/></strong><ul><li>Minimum of three (3) years of comparable experience working in a design firm</li><li>Preferred candidates should hold a Bachelor of Architecture (B. Arch) or Master of Architecture (M. Arch) degree from an accredited institution</li><li>Intent to aggressively pursue licensure is preferred</li><li>Proficiency in Revit and Microsoft Office suite is strongly preferred</li><li>Experience working in additional drafting and rendering programs such as AutoCad and Enscape is preferred</li><li>Experience working in Project Management software such as ProCore is preferred</li><li>Ability to engage in a collaborative workplace, working alongside fellow architects, and maintaining professional relationships with clients</li><li>Grow experience in the execution of independent evaluation and decision making. </li><li>Execute specific design tasks requiring research, evaluation, and adaptation into assigned projects</li><li>Ability to perform tasks with minimum supervision. </li><li>Gain understanding of production requirements, phasing, and budget tracking necessary for project success and profitability</li><li>Develop mentoring skills to help team members improve design ability and various skill sets required to deliver successful projects</li><li>Adhere to Studio+ standards and processes and applicable client specific standards and processes. <br/><br/></li></ul><strong>Job Tasks outlined, but not limited to those listed:<br/><br/></strong><ul><li>Architectural drafting and BIM modeling that represent Studio+’s expertise and design intent to clients, contractors, and engineers. </li><li>Meet deliverable schedules, coordination with consulting engineers and interior designers, and quality control reviews of drawings and documents prior to internal review</li><li>Organized documentation of all correspondence with Studio+ project team, engineers, and vendors</li><li>Coordinate and maintain BIM files and model exchange with consulting engineers throughout the life of a project</li><li>Coordinate with Studio+ BIM Manager when implementing Studio+ BIM execution plan</li><li>Review and maintain Studio+ project checklist with Project Manager and Project Team</li><li>Coordinate with project team to assemble completed sets of documents and assist in their distribution</li><li>Develop clear and detailed reports, responses, and specifications as directed. </li><li>Develop field reports, meeting minutes, bulletins/narratives on assigned projects as directed</li><li>Assist or lead FGI/code analysis/RFIs as directed</li><li>Assist or lead submittals/shop drawings as directed</li><li>Assist or lead AHJ comment responses as directed</li><li>Assemble drawings for QA/QC review. </li><li>Transmitting documents to clients, contractors, and engineers as required</li><li>Develop computer generated renderings</li><li>Identify and research code issues. Work with project team to implement solutions as applicable. </li><li>Coordinate with printing company to ensure delivery of documents for compliance with project deliverables</li><li>Produce accurate documentation from inspection and field measurements of existing buildings</li><li>Coordinate with Project Manager the allocation of resources to achieve key deliverables and project schedule</li><li>Review documents and drawings of all internal and external project team members to ensure compliance with project requirements and design intent</li><li>Generate and manage work plan on small to medium sized projects</li><li>Assist in generating and managing work plan on large projects</li><li>Attend and assist in leading client meetings as directed</li><li>Assist with design iterations as directed<br/><br/></li></ul>Powered by JazzHR<br/><br/>oioUzijoLA", "postedDate": "4 months ago", "skills": ["Revit", "Microsoft Office", "AutoCad", "Enscape", "ProCore", "BIM", "Project Management"], "url": "https://www.linkedin.com/jobs/view/3909879709"}