{"jobTitle": "Buyer", "company": {"name": "Fashion Nova", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "Fashion Nova is an inclusive fashion-forward and trend-driven apparel and lifestyle brand that celebrates all dimensions of confidence. We use our platform to spread positivity with brands for women, men, curve, luxe, sport, swim, beauty, and kids. We are obsessed with creating the best experience available for our customers and employees. Fashion Nova was built on the backbone of individuality and inclusiveness. Our brands are worn and celebrated worldwide by customers, celebrities, and influencers because of our uniquely creative and talented employees.", "responsibilities": "Create and implement merchandise assortment for your assigned categories, based on selling trends that will achieve financial targets. Participate in open-to-buy (OTB) meetings with Planning to ensure the department achieves financial targets for sales, profitability, and inventory turn. Research the competition across all social media platforms and markets to identify emerging trends, categories, and promotional campaigns. Promote growth by developing assortment strategies with SKU count, breadth vs depth, newness, and pricing/margin. Analyze sales in-season and post-season to identify hits and misses. Leverage insights to revise in-season and future season actions, strategies, and assortments. Grow and maintain strong relationships with vendor partners; strategically scout new vendors to support Fashion Nova. Conduct the initial garment selection of colors, trims, and fabrics that work best for the styles. Review weekly sales performance to identify potential reorders and recommend styles for markdowns.", "qualifications": {"required": "5-7 plus years of experience in Buying for apparel, ideally within an eCommerce fashion brand - denim experience is ideal but not required. Experience working with vendors and negotiating product quality, costs, and delivery dates with vendors. Excellent prioritization, project management, organization skills, and attention to detail. Proficiency in Excel, PowerPoint, and Google Workspace. Bachelor's Degree in Fashion, Production, Design or related field, or equivalent work experience. English, additional language(s) an advantage. Schedule of this position: Monday – Friday | Core business hours | Onsite.", "preferred": "Not specified"}, "skills": ["Not specified"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Formalized career paths, Flat management platform, Manager Training Academy, Creative Development Internship Program, Fashion Nova Cares Program, Flexible Paid Time Off (PTO), Medical, Dental and Vision Coverage, 401k match, with immediate vesting upon eligibility, Stocked kitchens with gratis snacks and drinks, Weekly catered lunches, Summer Fridays at Headquarters, Team bonding events and programs, Employee discounts", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3910689943"}