{"jobTitle": "Training and Development Manager with Security Clearance", "company": {"name": "ClearanceJobs", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Defense and Space Manufacturing", "description": "Position Summary Odyssey Systems has an exciting new opportunity for a Training and Development Manager supporting the Space Systems Command (SSC) Military Communication and Positioning, Navigation and Timing Directorate (CG) in the United States Space Force. This position will support the SSC/CG program office as it rapidly premier capabilities resilient to the threat by the relentless pursuit of warfighter needs and acquisition excellence. This is a full-time opportunity located in LA, CA. ***Contingent upon contract award*** Responsibilities Duties include, but not limited to:<br/><br/><ul><li>Track the organization's military performance reports, feedback forms, military promotion forms, stratifications, and force shaping forms in accordance with regulations</li><li>Provide guidance and recommendations on completing manpower and personnel documentation; and maintain the unit personnel management roster, organizational charts, unit manning document, and related organizational rosters related to personnel management activities</li><li>Ensure Individual Mobilization Augmentees (IMA) are in compliance with Air Force and Space Force Instructions. The Contractor shall track all IMA assigned to MilComm &amp; PNT Directorate and work with the Base IMA Administrator to ensure IMA are assigned correct position numbers and correct duty titles</li><li>Monitor the SSC's military assignment cycle boards to include, but not limited to, Permanent Change of Assignment, Permanent Change of Station, Entitlements Integrated Process Team, and Vulnerable to Move Lists and notify leadership of timelines to submit requisitions, reclamas, and byname-requests</li><li>Provide analysis of the overall unit military manning, both current and projected manning, to plan for future requirements and effective allocation of resources</li><li>Plan, organize, and evaluate the organization's training and professional development program for assigned personnel</li><li>Coordinate with functional organizations regarding non-governmental training courses</li><li>Notify units of all special duty and professional military education opportunity programs</li><li>Track, document and process Office of Government Ethics 450 forms to include but not limited to ensuring employees are correctly identified by supervisors to complete Office of Government Ethics 450 forms; ensuring the Office of Government Ethics 450 web database correctly identifies Office of Government Ethics 450 employees; assisting the Government with Office of Government Ethics 450 web site navigation; and ensuring employees have completed their Office of Government Ethics 450 forms and supervisors have approved the Office of Government Ethics 450 forms on or before the base suspense date</li><li>Ensure employee training history records are complete, accurate and in accordance with regulatory guidelines</li><li>Track and monitor the submissions of military and civilian awards and decorations, quarterly and annual awards, and special trophies Qualifications Minimum Required Qualifications: Citizenship: Must be a US citizen Clearance : Must have an active DoD Secret clearance and be able to maintain it. Education: Bachelor's degree or higher Years' experience: A t least 8 years of experience in related field Preferred Qualifications: Education and Years' of experience: Master's degree or higher and at least 10 years of demonstrated experience in a related field. Additional Information: Location: On-site at LA AFB, with telework capabilities for local candidates Hybrid: Percentage of telework/remote allowed will vary based on the customer's discretion.<br/><br/></li></ul>Company Overview Odyssey Systems Consulting Group, is an innovative small business committed to providing world-class technical, management, and training support services to government and public sector clients. We focus on people, processes, and performance to deliver superior results. Since our inception in 1997, our commitment to mission success and customer satisfaction has been recognized with exponential growth and exceptional past performance ratings. We accept challenging assignments and drive projects from the planning stages, through implementation, and into operations and support. Please note: Final compensation for this position will be determined by various factors such as the Federal Government contract labor categories and contract wage rates, relevant work experience, specific skills and competencies, geographic location, education, and certifications. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br/><br/>", "responsibilities": "Duties include, but not limited to:<br/><br/><ul><li>Track the organization's military performance reports, feedback forms, military promotion forms, stratifications, and force shaping forms in accordance with regulations</li><li>Provide guidance and recommendations on completing manpower and personnel documentation; and maintain the unit personnel management roster, organizational charts, unit manning document, and related organizational rosters related to personnel management activities</li><li>Ensure Individual Mobilization Augmentees (IMA) are in compliance with Air Force and Space Force Instructions. The Contractor shall track all IMA assigned to MilComm &amp; PNT Directorate and work with the Base IMA Administrator to ensure IMA are assigned correct position numbers and correct duty titles</li><li>Monitor the SSC's military assignment cycle boards to include, but not limited to, Permanent Change of Assignment, Permanent Change of Station, Entitlements Integrated Process Team, and Vulnerable to Move Lists and notify leadership of timelines to submit requisitions, reclamas, and byname-requests</li><li>Provide analysis of the overall unit military manning, both current and projected manning, to plan for future requirements and effective allocation of resources</li><li>Plan, organize, and evaluate the organization's training and professional development program for assigned personnel</li><li>Coordinate with functional organizations regarding non-governmental training courses</li><li>Notify units of all special duty and professional military education opportunity programs</li><li>Track, document and process Office of Government Ethics 450 forms to include but not limited to ensuring employees are correctly identified by supervisors to complete Office of Government Ethics 450 forms; ensuring the Office of Government Ethics 450 web database correctly identifies Office of Government Ethics 450 employees; assisting the Government with Office of Government Ethics 450 web site navigation; and ensuring employees have completed their Office of Government Ethics 450 forms and supervisors have approved the Office of Government Ethics 450 forms on or before the base suspense date</li><li>Ensure employee training history records are complete, accurate and in accordance with regulatory guidelines</li><li>Track and monitor the submissions of military and civilian awards and decorations, quarterly and annual awards, and special trophies</li></ul>", "qualifications": {"required": "Citizenship: Must be a US citizen Clearance : Must have an active DoD Secret clearance and be able to maintain it. Education: Bachelor's degree or higher Years' experience: A t least 8 years of experience in related field", "preferred": "Education and Years' of experience: Master's degree or higher and at least 10 years of demonstrated experience in a related field."}, "skills": [], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3910575583"}