{"jobTitle": "Procurement Audit Manager with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "109,695.00/yr - 137,145.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Defense and Space Manufacturing", "description": "Based in Southern California with locations in Malibu, Calabasas, Westlake Village and Camarillo; HRL has been on the leading edge of technology, conducting pioneering research and advancing the state of the art. General Description:<br/><br/><strong>Requirements<br/><br/></strong>This position requires a seasoned procurement professional who is skilled in the day-to-day management and administration of Government and commercial procurement with a strong understanding of CPSR audit requirements. Ideal candidate is an independent critical thinker, strategic, highly organized and consumer oriented and must be able to perform effectively in a fast paced environment where multitasking and prioritizing is essential. Essential Duties:<br/><br/>Manage the daily administration of the Procurement Team that includes purchasing for Government and Commercial Programs involving both R&amp;D and manufacturing program materials and services and all internal Company purchasing Manage the standardized and detail-oriented purchasing administration policy and processes that involve preparing and supporting CPSR compliant purchasing documentation, including price/cost analysis to sole source justification, drafting binding documentation, managing order and modification requirements, and responding to queries on existing order terms and restrictions<br/><br/>Specifically understand the R&amp;D environment related to purchasing and its differences from a production environment including understanding governmental requirements, to provide informed guidance to internal technical and business teams ensuring procurement activities and priorities support corporate strategy<br/><br/>Conduct periodic internal audits of the Procurement Team in compliance with CPSR requirements. Analyze and submit FFATA submissions as required by Government requirement Internally review and approve Government purchases in accordance with Government requirements, including documentation compliance with CPSR requirements Review and approve vendor information, wire requests and procard reconciliations<br/><br/>Manage and review contract closeout procurement documentation for compliance, including document reconciliation<br/><br/>Communicate and maintain positive relations directly with vendors and suppliers while resolving complex issues including trade compliance, Incoterms, warranty and acceptance procedures. Maintain positive relations with various internal departments such as Technical, Quality, Property, Trade Compliance and Finance in a timely and professional manner<br/><br/>Research, prepare, issue and resolve complex purchase orders, follow up on orders placed, verify and/or expedite delivery, and maintain all necessary records and documentation<br/><br/>Assist the Procurement Manager with various projects and reports including data gathering and analysis.<br/><br/><strong>Required Skills<br/><br/></strong>Reports to the Subcontracts Manager and actively liaison with both the Director of Subcontracts and Procurement and Legal to ensure pending subcontracts are aligned fully with applicable company standards and practices Required Skills:<br/><br/>Understanding of the full procurement lifecycle cradle to grave for complex purchases and resolution of issues including within the Government regulatory environment<br/><br/>Strong knowledge of Government procurement regulations including direct participation or management of a CPSR/DCAA Audit Understand complex topics including alternate price justification, property regulations, documentation requirements, Incoterms, ISO 9000/AS9100 requirements and FAR/DFARS topics<br/><br/>Proven ability to negotiate business terms, including but not limited to price, quantity and delivery terms for many various goods, raw materials and services Ability to understand legal terms, including but not limited to indemnification, liability, Incoterms, warranty and services<br/><br/>Sophisticated ability to understand problems and apply conceptual thinking to work collaboratively and resolve complex problems<br/><br/>Exceptional verbal, written and organizational skills and attention to detail. Professional ability to communicate well and build strategic relationships with both internal and external customers<br/><br/>Team mentality with the flexibility to address unique issues in real-time and the awareness to know when to bring in others. Possess conflict management skills<br/><br/>Enjoys working in a fast-paced environment and managing multiple concurrent projects and tasks. Ability to prioritize and effectively time manage projects, schedules and workload with little supervision<br/><br/>Proficient and effective in using MS Word, PowerPoint and Excel programs to quickly analyze data, make informed decisions and present information effectively Computer skills using Outlook, Word, Excel, PowerPoint and Adobe Acrobat Pro required<br/><br/><strong>Knowledge Of OnBase And Costpoint Highly Desired Required Education<br/><br/></strong>BS/BA degree required and mandatory 4+ years of in-house management of a procurement team or similar transactional experience in a role that requires direct interaction with Government auditors, third party vendors and suppliers, internal stakeholders, and in-house Legal Physical Requirements:<br/><br/>Must have the ability to sit for long periods of time and be able to access all locations of the company property<br/><br/>Position requires office in-person attendance.<br/><br/>Must be able to communicate effectively and professionally with people and have a focus on customer service for internal customers Special Requirements: Able to work flexible hours<br/><br/><strong>U.S. Citizen Status Required Compensation<br/><br/></strong>The base salary range for this full-time position is $109,695 - $137,145 + bonus + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range during the hiring process. Please note that the compensation details listed reflect the base salary only, and do not include potential bonus or benefits. Don't meet every single requirement? Studies have shown that some people are less likely to apply to jobs unless they meet every single desired qualification. At HRL, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you're excited about this role but your past experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles. HRL offers a generous and very competitive total compensation and benefits package. Our Regular/Full Time benefits include medical, dental, vision, life insurance, 401K match, gym facilities, PTO, growth potential, and an exciting and challenging work environment (https://www.hrl.com/careers/benefits). HRL Laboratories is an Equal Employment Opportunity employer and does not discriminate in recruiting, hiring, training or promoting, on the basis of race, ethnicity, color, creed, religion, sex, sexual orientation, gender, gender identity, genetic information, national origin, physical or mental disability, pregnancy, medical condition, age, U.S. military or protected veteran status, union membership, or political affiliation. We maintain a drug-free workplace and perform pre-employment substance abuse testing. For our privacy policy please visit : www.hrl.com/privacy This position must meet Export Control compliance requirements, therefore a \"U.S. Person\" as defined by 22 C.F.R.<br/><br/><ul><li> 120.15is required. \"U.S. Person\" includes U.S. Citizen, lawful permanent resident, refugee, or asylee.</li></ul>", "responsibilities": "Manage the daily administration of the Procurement Team that includes purchasing for Government and Commercial Programs involving both R&amp;D and manufacturing program materials and services and all internal Company purchasing Manage the standardized and detail-oriented purchasing administration policy and processes that involve preparing and supporting CPSR compliant purchasing documentation, including price/cost analysis to sole source justification, drafting binding documentation, managing order and modification requirements, and responding to queries on existing order terms and restrictions<br/><br/>Specifically understand the R&amp;D environment related to purchasing and its differences from a production environment including understanding governmental requirements, to provide informed guidance to internal technical and business teams ensuring procurement activities and priorities support corporate strategy<br/><br/>Conduct periodic internal audits of the Procurement Team in compliance with CPSR requirements. Analyze and submit FFATA submissions as required by Government requirement Internally review and approve Government purchases in accordance with Government requirements, including documentation compliance with CPSR requirements Review and approve vendor information, wire requests and procard reconciliations<br/><br/>Manage and review contract closeout procurement documentation for compliance, including document reconciliation<br/><br/>Communicate and maintain positive relations directly with vendors and suppliers while resolving complex issues including trade compliance, Incoterms, warranty and acceptance procedures. Maintain positive relations with various internal departments such as Technical, Quality, Property, Trade Compliance and Finance in a timely and professional manner<br/><br/>Research, prepare, issue and resolve complex purchase orders, follow up on orders placed, verify and/or expedite delivery, and maintain all necessary records and documentation<br/><br/>Assist the Procurement Manager with various projects and reports including data gathering and analysis.", "qualifications": {"required": "Understanding of the full procurement lifecycle cradle to grave for complex purchases and resolution of issues including within the Government regulatory environment<br/><br/>Strong knowledge of Government procurement regulations including direct participation or management of a CPSR/DCAA Audit Understand complex topics including alternate price justification, property regulations, documentation requirements, Incoterms, ISO 9000/AS9100 requirements and FAR/DFARS topics<br/><br/>Proven ability to negotiate business terms, including but not limited to price, quantity and delivery terms for many various goods, raw materials and services Ability to understand legal terms, including but not limited to indemnification, liability, Incoterms, warranty and services<br/><br/>Sophisticated ability to understand problems and apply conceptual thinking to work collaboratively and resolve complex problems<br/><br/>Exceptional verbal, written and organizational skills and attention to detail. Professional ability to communicate well and build strategic relationships with both internal and external customers<br/><br/>Team mentality with the flexibility to address unique issues in real-time and the awareness to know when to bring in others. Possess conflict management skills<br/><br/>Enjoys working in a fast-paced environment and managing multiple concurrent projects and tasks. Ability to prioritize and effectively time manage projects, schedules and workload with little supervision<br/><br/>Proficient and effective in using MS Word, PowerPoint and Excel programs to quickly analyze data, make informed decisions and present information effectively Computer skills using Outlook, Word, Excel, PowerPoint and Adobe Acrobat Pro required<br/><br/><strong>Knowledge Of OnBase And Costpoint Highly Desired Required Education<br/><br/></strong>BS/BA degree required and mandatory 4+ years of in-house management of a procurement team or similar transactional experience in a role that requires direct interaction with Government auditors, third party vendors and suppliers, internal stakeholders, and in-house Legal Physical Requirements:<br/><br/>Must have the ability to sit for long periods of time and be able to access all locations of the company property<br/><br/>Position requires office in-person attendance.<br/><br/>Must be able to communicate effectively and professionally with people and have a focus on customer service for internal customers Special Requirements: Able to work flexible hours<br/><br/><strong>U.S. Citizen Status Required Compensation<br/><br/></strong>", "preferred": "Knowledge Of OnBase And Costpoint Highly Desired"}, "skills": ["CPSR", "DCAA", "Government Procurement", "Negotiation", "Procurement", "Subcontracts", "FAR", "DFARS", "Incoterms", "ISO 9000", "AS9100", "MS Word", "PowerPoint", "Excel", "Outlook", "Adobe Acrobat Pro", "OnBase", "Costpoint"], "postedDate": "4 months ago", "benefits": "Our Regular/Full Time benefits include medical, dental, vision, life insurance, 401K match, gym facilities, PTO, growth potential, and an exciting and challenging work environment (https://www.hrl.com/careers/benefits).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3910586147"}