{"jobTitle": "Supply Chain Professionals with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "postedDate": "4 months ago", "description": "Requisition ID: R10139464 *<br/><br/><ul><li>Category:* Global Supply Chain *</li><li>Location:* Northridge, California, United States of America *</li><li>Clearance Type:* Top Secret *</li><li>Telecommute:* No- Teleworking not available for this position *</li><li>Shift:* 1st Shift (United States of America) *</li><li>Travel Required:* No At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. This position description does not represent a current opening but may be used to identify candidates with skills and experience for positions within Northrop Grumman that frequently become available. Candidates who express an interest may be considered for future positions at Northrop Grumman.</li><li>This position may be hybrid after the first three (3) months. The selected candidate will be required to work on-site in Northridge, CA and must be able and willing to be in the office full-time to start.* In this position, the selected candidate will:</li><li>Source and procure several commodities such as Circuit Card Assemblies, electronic components, cables, test equipment on development and production programs.</li><li>Proficiency in the procurement process, including but not limited to price analysis, negotiations, policies, and procedures, including the Federal Acquisition Regulation (FAR)</li><li>Ability to place and oversee procurement packages</li><li>Initiates Requests for Quotations and Proposals and receives same, analyzing proposed pricing from potential suppliers.</li><li>In conjunction with quality organization, evaluates and monitors supplier quality and reliability, as well as supplier ability to support required delivery schedules.</li><li>Identifies opportunities to reduce cost, improve efficiency and manage risk through targeted negotiations.</li><li>Manages performance of purchase orders, ensures compliance with all public law requirements as well as company (and business) policies and procedures including import/export regulations.</li><li>Review, reconcile and approve supplier invoices</li><li>Interfacing and collaborating with Programs and other organizations within and outside of Global Supply Chain</li><li>Ability to plan schedule and arrange activities to accomplish objective</li><li>Person should possess outstanding written and verbal communication skills and be extremely organized *</li><li>Ability to work an amazing work schedule (4/10 shift schedule - Monday- Thursday)* Position to be hired based on qualifications and experience of selected candidate.</li><li>Basic Qualifications for a Principal Supply Chain Procurement Specialist (level 3):*</li><li>6 years of experience in supply chain, procurement, purchasing, supplier management, and/or related industry experience with a bachelor's degree.</li><li>Effective oral and written communication and interpersonal skills</li><li>Experience with using Microsoft Office Products including Word, PowerPoint, Excel</li><li>Self-starter who can work with minimal direction.</li><li>Procurement experience in Government environment</li><li>Ability to obtain a US Government issued Secret clearance; US Citizenship is required.</li><li>Basic Qualifications for a Sr. Principal Supply Chain Procurement Specialist (Level 4): *</li><li>10 years of experience in supply chain, procurement, purchasing, supplier management, and/or related industry experience with a bachelor's degree.</li><li>Effective oral and written communication and interpersonal skills</li><li>Experience with using Microsoft Office Products including Word, PowerPoint, Excel</li><li>Self-starter who can work with minimal direction.</li><li>Procurement experience in Government environment</li><li>Ability to obtain a US Government issued Secret clearance; US Citizenship is required.</li><li>Preferred Qualifications:*</li><li>FAR/DFAR or government contracts experience</li><li>Current/active Secret clearance LYCNS1207</li><li>Salary Range: *$78,500 - $117,700 The above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions. Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business. The application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.</li></ul>", "employmentType": "Full-time", "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "salary": {"amount": "78,500.00/yr - 117,700.00/yr", "currency": "USD"}, "skills": ["Supply Chain", "Procurement", "Purchasing", "Supplier Management", "Microsoft Office", "Word", "PowerPoint", "Excel", "Government Contracts", "FAR", "DFAR", "Secret Clearance", "US Citizenship"], "url": "https://www.linkedin.com/jobs/view/3910575710"}