{"jobTitle": "Associate Director, Business Operations", "company": {"name": "California State University, Los Angeles", "industry": "Higher Education", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$4,812 - $15,449/monthly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "Job No: 538975; 4/25/2024<br/><br/><strong>ASSOCIATE DIRECTOR, BUSINESS OPERATIONS <br/><br/></strong>California State University, Los Angeles, invites applications for the above Administrator II position.<br/><br/><strong>The University</strong><strong>:</strong> California State University, Los Angeles (Cal State LA) is one of 23 campuses within the California State University system. The University is the premier comprehensive public university in the heart of Los Angeles. We offer nationally recognized programs and our faculty have a strong commitment to scholarship, research, creative pursuits, and service.<br/><br/>As a federally recognized Hispanic-serving (HSI) and Asian-American, Native American, and Pacific Islander-serving institution (AANAPISI), Cal State LA recognizes the transformative power of education and embraces its duty to identify and serve the needs of all of its students. The University is committed to creating a community in which a diverse population of students, faculty, and staff can thrive.<br/><br/><strong>The Position</strong><strong>:</strong> Under the direction of the Director of Housing and Residence Life, the Associate Director is responsible for managing the day-to-day operations of the Housing Services department related to business services, student room assignments, conferences, and dining services. This position is primarily responsible for budget management in collaboration with the Director. The incumbent will provide a wide range of budgetary, programmatic, administrative, and operational support for Housing and Residence Life (HRL). This position tracks, analyzes, and interprets complex financial data. It requires understanding and applying applicable policies, regulations, and principles when performing job duties. The incumbent provides technical advice, makes recommendations, and implements changes and improvements to policies and procedures. Communicates frequently with campus partners, vendors, contractors, campus Procurement department, and Business Financial Services to ensure compliance with accounts payable, receivables, and travel policies and procedures. It is a resource for department staff and students and works collaboratively with the Student Life Division fiscal management team.<br/><br/><strong>Required Qualifications &amp; Experience</strong><strong>:</strong> A bachelor's degree from an accredited four-year college or university in accounting, business administration, finance, or a related field. Three years of full-time progressively responsible technical, analytical, and administrative experience, preferably within a university business environment. Three years of related accounting or financial expertise (including reconciliations) and using online financial systems and databases, with exposure to various funding sources and allocations. Two years of experience leading and reviewing the work of other accounting and/or clerical employees. Experience in training others, preparing training presentations, and presenting training to small groups. The incumbent must have a demonstrated interest and/or ability to work in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the California State University. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current California State University employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California.<br/><br/>As of January 1, 2022 the <strong>CSU Out-of-State Employment Policy</strong> prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/><strong>Desired Qualifications</strong><strong>:</strong> A master's degree from an accredited four-year college or university in accounting, business administration, finance, or a business-related field. Experience with PeopleSoft, query, and databases or similar software systems. Experience with independent financial statement audits, including single audits and/or other compliance audits. Two years of experience progressively leading/supervising/managing staff, preferably within a university business environment.<br/><br/><strong>Compensation</strong><strong>:</strong> Salary is commensurate with experience and qualifications. Salary range is $4,812 - $15,449/monthly. Budgeted Hiring Salary Range: $6,400 - $7,500/Monthly. A comprehensive benefits package is provided.<br/><br/><strong>Appointment</strong><strong>:</strong> The Administrator II appointment will be made under the guidelines for management and supervisory employees of the California State University. All rights and benefits associated with this appointment are governed by the Management Personnel Plan.<br/><br/><strong>Closing Date</strong><strong>: </strong>Review of applications will begin on May 9, 2024 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A completed online Cal State University, Los Angeles employment application is required. Resumes will not be accepted in lieu of a completed application.<br/><br/>This position is a \"designated position\" in the California State University's Conflict of Interest Code. The successful candidate accepting this position is required to file Conflict of Interest forms subject to the regulations of the Fair Political Practices Commission.<br/><br/>In addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.<br/><br/>Candidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.<br/><br/><strong>To Obtain Employment Information For The Impaired Call<br/><br/></strong>TDD Line (323) 343-3670<br/><br/>24-hour Dial-A-Job Line (323) 343-3678", "responsibilities": "Under the direction of the Director of Housing and Residence Life, the Associate Director is responsible for managing the day-to-day operations of the Housing Services department related to business services, student room assignments, conferences, and dining services. This position is primarily responsible for budget management in collaboration with the Director. The incumbent will provide a wide range of budgetary, programmatic, administrative, and operational support for Housing and Residence Life (HRL). This position tracks, analyzes, and interprets complex financial data. It requires understanding and applying applicable policies, regulations, and principles when performing job duties. The incumbent provides technical advice, makes recommendations, and implements changes and improvements to policies and procedures. Communicates frequently with campus partners, vendors, contractors, campus Procurement department, and Business Financial Services to ensure compliance with accounts payable, receivables, and travel policies and procedures. It is a resource for department staff and students and works collaboratively with the Student Life Division fiscal management team.", "qualifications": {"required": "A bachelor's degree from an accredited four-year college or university in accounting, business administration, finance, or a related field. Three years of full-time progressively responsible technical, analytical, and administrative experience, preferably within a university business environment. Three years of related accounting or financial expertise (including reconciliations) and using online financial systems and databases, with exposure to various funding sources and allocations. Two years of experience leading and reviewing the work of other accounting and/or clerical employees. Experience in training others, preparing training presentations, and presenting training to small groups. The incumbent must have a demonstrated interest and/or ability to work in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the California State University. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current California State University employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California.<br/><br/>As of January 1, 2022 the <strong>CSU Out-of-State Employment Policy</strong> prohibits the hiring of employees to perform CSU-related work outside the state of California.", "preferred": "A master's degree from an accredited four-year college or university in accounting, business administration, finance, or a business-related field. Experience with PeopleSoft, query, and databases or similar software systems. Experience with independent financial statement audits, including single audits and/or other compliance audits. Two years of experience progressively leading/supervising/managing staff, preferably within a university business environment."}, "skills": [], "postedDate": "4 months ago", "applicationDeadline": "", "benefits": "A comprehensive benefits package is provided.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3911549885"}