{"jobTitle": "Executive Assistant II", "company": {"name": "Avani Tech Solutions Private Limited", "industry": "Entertainment Providers", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Hybrid- the person to be in the office 1-2 days a week at West Hollywood, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$42.00/hr on W2", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "Seeking an eager and exceptional Executive Assistant to provide high-level administrative support to two executives. The successful candidate will be self-motivated, quick-thinking, flexible, and able to juggle a variety of diverse responsibilities with strong emphasis on organization and unwavering attention to detail at all times. This is a fast moving position that requires someone who is able to exercise good judgment and significant initiative.", "responsibilities": "Manage calendars and schedule, including coordinating meetings, appointments, and conference calls. Handle confidential and sensitive material with discretion. Prioritize and manage multiple work assignments and projects. Process expense reports. Coordinate executive travel, as applicable. Assess circumstances and problem solve with minimal supervision, exercising common sense and diplomacy.", "qualifications": {"required": "Bachelor's degree or the equivalent required, 2-3 years of relevant experience in a role(s) that required high degrees of organization, Proficient in Google Suite and Microsoft Office applications: PowerPoint, Word, and Excel, Able to maintain confidentiality regarding sensitive issues or information, Able to interact with individuals at all levels of an organization, Proven ability to work under pressure, perform efficiently, handle multiple high priority tasks simultaneously, and meet tight deadlines, Strong interpersonal skills to create and maintain positive and effective working relationships.", "preferred": ""}, "skills": ["Organization", "Google Suite", "Microsoft Office", "Discretion", "Interpersonal Skills"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3911850338"}