{"jobTitle": "Production Supervisor", "company": {"name": "Pacific American Fish Company (PAFCO)", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "Located in sunny Southern California, **PAFCO** is a $700MM+ global, innovative food manufacturing company with 45 years of success. High quality products and integrity contribute to its steady growth, allowing **PAFCO** to consistently outperform competitors. **PAFCO** is dedicated to fostering the professional growth and development of its associates. Learn more about the company at **www.pafco.net**.<br/><br/>**Position Purpose<br/><br/>**Dedicated and savvy Production Supervisor needed to ensure the production team can meet customer needs and achieve the highest standards related to manufacturing costs, quality, efficiencies, safety and productivity.<br/><br/>**Shifts Available<br/><br/>****Night: Sunday-Thursday 9pm-6am<br/><br/>****Swing Shift: Monday-Friday (with occasional weekend) 2am-11am<br/><br/>****Comp: $65-85k<br/><br/>**Principal Accountabilities<br/><br/>**<ul><li>Lead a team of manufacturing and production employees to achieve performance standards with regard to Good Manufacturing Practices (GMP), safety, line utilization and product quality.</li><li>Follow daily production schedule and notify plant management and impacted associates if shortages occur.</li><li>Monitor and troubleshoot manufacturing equipment to maintain production line efficiency and reliability while minimizing downtime</li><li>Develop frontline employees - setting expectations, providing feedback and recognizing and rewarding good performance</li><li>Ensure compliance with all Production &amp; Safety regulations</li><li>Maintain high sanitary standards as required in the food manufacturing industry and monitor readiness for third party audits and regulatory inspections at all times.</li><li>Coordinate with Maintenance and follow-up on repair and improvements to production line.</li><li>Work closely with Quality Assurance to maintain high product quality.</li><li>Minimize rework and maximize yields.</li><li>Monitor dept. for accuracy: (example: codes correct, pkg. correct, dates correct)</li><li>Inspect production area and ensure equipment and personnel are working in a safe manner.</li><li>Enforce all company rules, policies, and procedures &amp; provide disciplinary action when necessary.</li><li>Immediately investigate all types of accidents, such as worker comp injuries &amp; property damage, and report to appropriate Manager.</li><li>Follow GMP, SOPs, and all OSHA safety rules.<br/><br/></li></ul>**Requirements<br/><br/>**<ul><li>Experience in a plant supervisory position.</li><li>Demonstrated computer proficiency: Microsoft Office Suite.</li><li>Must be able to run production equipment, and work in cold environment.<br/><br/></li></ul>**Experience And Qualifications<br/><br/>**<ul><li>Prior experience in a fast paced Food Manufacturing Co.</li><li>Planning and project management experience</li><li>Bilingual Spanish</li></ul>", "postedDate": "3 months ago", "skills": ["GMP", "Safety", "Production", "Manufacturing", "Quality Assurance", "Microsoft Office Suite", "Spanish"], "url": "https://www.linkedin.com/jobs/view/3911422184"}