{"jobTitle": "Operations Manager", "company": {"name": "Thirteenth Floor Entertainment Group", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "The operations manager reports to the general manager and is responsible for the guest experience throughout the event. The operations manager will hire, train, and staff a team of event staff who assist guests with getting into queue lines, scanning tickets, accessing attractions, taking photos, answering questions, and monitoring the safety and cleanliness of the event. <br/><br/><strong>Physical Requirements<br/><br/></strong><strong> Be able to stand, walk and work in varying environments for up to 6 hours at a time.<br/><br/></strong><strong> Ability to work a varying schedule in terms of days and hours, as dictated by business needs.<br/><br/></strong><strong> Ability to lift 25 lbs.<br/><br/></strong><strong>Perks <br/><br/></strong><strong> 20% off discount in the gift shop <br/><br/></strong><strong> Free, unlimited admission to all Thirteenth Floor Entertainment Group events on select nights throughout the Halloween season <br/><br/></strong><strong> 2 comp tickets to share with family and friends. Valid on select nights throughout the Halloween season for any Thirteenth Floor Entertainment Group event <br/><br/></strong><strong> Weekly pay <br/><br/></strong><strong> Flexible schedule <br/><br/></strong><strong>Equal Opportunity Employment <br/><br/></strong><strong>Thirteenth Floor Entertainment Group is an Equal Opportunity Employer that does not discriminate based on actual or perceived race, creed, color, religion, alienage or national origin, ancestry, citizenship status, age, disability or handicap, sex, marital status, veteran status, sexual orientation, gender identity, gender expression, arrest record or any other characteristic protected by applicable federal, state, or local laws. Our management team is dedicated to this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities and general treatment during employment. <br/><br/></strong><strong>This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities and activities may change, or new ones may be assigned at any time with or without notice.<br/><br/></strong><strong>All applicants must be 18 years old or older and sign a non-disclosure agreement. Thirteenth Floor Entertainment Group is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status, or other status protected by law or regulation. Thirteenth Floor Entertainment Group participates in E-Verify as required by law.</strong>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3911041915"}