{"jobTitle": "Bilingual VFX Production Assistant", "company": {"name": "Crazy Maple Studio", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "3,000.00/mo - 3,500.00/mo", "currency": "USD"}, "jobFunction": "Production", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Company Overview:<br/><br/></strong>Since 2016, Crazy Maple Studio, Inc. has trailblazed the way for quality interactive storytelling. Through CHAPTERS: INTERACTIVE STORIES, readers immerse themselves in compelling playable novels licensed from best-selling global authors. Through KISS: READ AND WRITE ROMANCE, enthusiastic players are welcomed into the world of serialized romance that they can consume and create. ESCAPE has opened up new avenues in visual narrative gaming, and now CMS has ventured into the next generation of HD streaming platforms with bite-sized episodic shows on their latest release, REELSHORT, standing at #1 on US Entertainment.<br/><br/>The VFX Production Assistant works closely with the VFX Producer. They will provide essential administrative and logistical support to ensure the smooth and efficient operation of the visual effects aspects of our upcoming projects. The ideal candidate will have excellent communication skills, a strong work ethic, and a passion for visual effects in film, television, or other media productions.<br/><br/><strong>Responsibility:<br/><br/></strong><ul><li>Support the VFX Producer and other team members with various administrative tasks, such as scheduling meetings, managing calendars, and organizing digital files and documents</li><li>Coordinate the planning and execution of visual effects for productions, from pre-production to final delivery</li><li>Prepare and distribute visual effects breakdowns to relevant stakeholders</li><li>Serve as a liaison between productions and the visual effects team, ensuring effective communication and collaboration throughout the process</li><li>Facilitate smooth transitions with post-production, overseeing the delivery of final visual effects shots and communicating any necessary revisions</li><li>Manage the delivery and distribution of VFX assets and elements among internal and external stakeholders, ensuring adherence to quality standards and deadlines</li><li>Provide on-set supervision for visual effects as directed by the VFX Producer and VFX Supervisor</li><li>Assist in research and development tasks, including gathering reference materials, conducting internet research, and contributing to the development of creative concepts and ideas<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in film, animation, visual effects, or a related field, or equivalent work</li><li>experience</li><li>Previous experience working in a production environment</li><li>Proficiency in Microsoft Office suite (Word, Excel, PowerPoint) and other standard office software</li><li>Ability to work effectively under pressure in a fast-paced production environment, with a positive attitude and a willingness to learn and adapt to new challenges</li><li>Passion for visual effects and a desire to pursue a career in the entertainment industry</li><li>Valid driver's license and a clean driving record</li><li>Must be legally eligible to work in the United States</li><li>Fluent in English and Mandarin</li><li>Familiarity with the VFX pipeline is a plus</li><li>This is a monthly contractor position with the possibility of transitioning to full-time employment at CMS. We offer monthly rates ranging from $3000 to $3500<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>Medical, Dental, and Vision benefits", "responsibilities": "The VFX Production Assistant works closely with the VFX Producer. They will provide essential administrative and logistical support to ensure the smooth and efficient operation of the visual effects aspects of our upcoming projects. The ideal candidate will have excellent communication skills, a strong work ethic, and a passion for visual effects in film, television, or other media productions.", "qualifications": {"required": "Bachelor's degree in film, animation, visual effects, or a related field, or equivalent work experience, Previous experience working in a production environment, Proficiency in Microsoft Office suite (Word, Excel, PowerPoint) and other standard office software, Ability to work effectively under pressure in a fast-paced production environment, with a positive attitude and a willingness to learn and adapt to new challenges, Passion for visual effects and a desire to pursue a career in the entertainment industry, Valid driver's license and a clean driving record, Must be legally eligible to work in the United States, Fluent in English and Mandarin, Familiarity with the VFX pipeline is a plus", "preferred": ""}, "skills": ["VFX", "Production", "Microsoft Office", "Communication", "Film", "Television", "Media Production", "Visual Effects", "Administrative", "Logistical Support", "Scheduling", "Calendar Management", "File Organization", "Document Management", "Planning", "Execution", "Pre-production", "Final Delivery", "Breakdowns", "Liaison", "Post-production", "Delivery", "Distribution", "VFX Assets", "VFX Elements", "Quality Standards", "Deadlines", "On-set Supervision", "Research", "Development", "Reference Materials", "Internet Research", "Creative Concepts", "Ideas", "English", "Mandarin"], "postedDate": "3 months ago", "benefits": "Medical, Dental, and Vision benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3912592852"}