{"jobTitle": "Sr. Revenue Accountant", "company": {"name": "InStride", "industry": "Education Administration Programs", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000—$105,000", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Education Administration Programs", "description": "At InStride, it’s simple. We believe the more you invest in your people, the more skilled they become, and the better your organization performs. Our mission to bring career-aligned, debt-free education to employers and their workforce has created pathways for our Learners to accelerate their careers with 2,800+ learning options. Our teams are tied together by a recognition of how impactful education can be for one’s career, livelihood and community. Our commitment to the success of our Learners is what drives us. To get a better feel for our culture, watch more here. Candidates must be located in one of the following states to be considered eligible for employment: AZ, AR, CA, CO, CT, FL, GA, IL, IN, KS, LA, MA, MD, MI, MO, NC, NH, NJ, NV, NY, OH, OR, TX, VA, WA, WI. What we're looking for: InStride is looking for an experienced Sr. Revenue Accountant to support our growing academic partner and corporate partner network. This role will be critical as we enable scalable business growth and to streamline our partner and learner experiences. The Sr. Revenue Accountant will be responsible for developing revenue calculations, reviewing new corporate partner contracts to help evaluate revenue recognition, and continue to improve the automation of our revenue calculations. The Sr. Revenue Accountant will also support the successful design, implementation, and enforcement of billing processes, systems, policies, and procedures to bring maximum value to InStride and its partners. This includes identifying ways to increase efficiency, onboarding and managing billing relationships, and ensuring timely communication and collections. The Sr. Revenue Accountant will also record related revenue and costs of revenue in our accounting systems and perform regular reconciliations to ensure both accuracy and compliance. This position is highly visible and requires superior accounting knowledge and the ability to prioritize, plan, and execute in a fast-paced environment. The Sr. Revenue Accountant requires a continuous improvement and solution-oriented mindset, as well as a willingness to take ownership and drive change. Candidates must be prepared to work in a fun, high growth, and dynamic company. How you will create impact: Manage the completion, accuracy, and timeliness of complex day-to-day billing operations. Analyze contracts and billing information to ensure an accurate understanding of evolving relationships and requirements and the proper setup of billing operations. Prepare revenue and cost entries in compliance with internal accounting policies and US GAAP. Lead month-end closing of billing on a timely basis so that the financial close timeline is not adversely impacted. Plan for the scalability of billing operations as the company continues to grow. Proactively seek and provide recommendations to improve existing billing processes, systems, training needs, and resources. Implement best practices and develop, execute, and enforce AR policies and procedures. Stay up-to-date with industry trends and engage in continuous learning. Represent the company as a leader in billing presentations and discussions with partners. Be the point of contact and work cross-functionally with internal and external teams on various billing-related issues and workflows. Coordinate with FP&A to assist with billing budget and forecast revisions. Assist with annual audit and tax engagements. Complete special requests and ad-hoc projects, as needed. Who you are: 3-5 years prior work experience in Accounting, Finance, or related fields. Understanding of current US GAAP standards, including ASC 606. Demonstrated history of managing, automating, and scaling revenue and billing processes and procedures. A track record of collaborating with cross-functional departments to support scalable and efficient processes. Experience with NetSuite or similar ERPs. Able to effectively prioritize, meet established goals, and perform in a fast and dynamic environment. Able to maintain confidentiality of information and exercise good judgment. Excellent interpersonal and communication skills, both written and verbal. We value candidates who are experienced collaborators and strong team players. Adaptable and comfortable in a growing and flexible company. Meticulous attention to detail and excellent critical thinking. Experience innovating and solving complex problems. A strong sense of ownership and accountability. Excited by the challenge of building a world-class business that delivers not only high revenue growth and compelling return on investment, but also has a meaningful impact on society. High EQ, comfort with ambiguity and a “no job too small” startup mentality. Bachelor’s degree in accounting, finance, or related fields, preferred. A strong work ethic and desire to continually grow and develop professionally. CPA and Big4 audit experience are a plus. Target base compensation amount for this role outlined below. Final offer amounts are determined by multiple factors including candidate experience and expertise and may vary from the amounts shown below. $80,000—$105,000 USD. We are looking for someone who is not only technically skilled, but also enthusiastic about making a meaningful impact. If this description resonates with you, we're excited about the possibility of having you on our team. As a skills-driven employer, we encourage you to apply if there is a skill-fit, even in the absence of years of experience. Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At InStride we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role, but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this role! Benefits @ InStride: As an organization that champions investing in people, it’s critical we walk the talk. That’s why InStride employees are eligible to enroll in 2,800+ online certificate and degree programs through our Step Forward program. Unlike traditional tuition reimbursement programs, InStride covers your tuition upfront, regardless of your course of study, degree type, or school - eligible to employees starting Day 1. This role is also eligible for the following benefits: 401(k) plan with company match, Flexible vacation policy, Paid family leave, Best-in-class health care benefits, And more! InStride Diversity and Inclusion Statement: At InStride, we foster a culture of belonging, we support authenticity and intersectionality, and we embrace and appreciate our differences. We do this by building a diverse pipeline of talent and ensuring equitable access to opportunities, information and leadership. We celebrate diversity and are committed to creating an inclusive environment for all employees. If you have a disability or special need that requires accommodation, please let your recruiter know. Policies & Disclosure: Effective November 1, 2021, all new hires must be fully vaccinated against the COVID-19 virus unless they have been granted a reasonable accommodation. If you are offered employment, this requirement must be met by your date of hire, unless a reasonable accommodation is approved by the People & Talent team in writing. For questions on how we use personal information of job applicants, please refer to InStride's Job Applicant Privacy Policy. Beware of recruiting scams. InStride does not require a financial transaction or any financial account information to be eligible for employment. If you receive a message purporting to be from InStride asking you for a financial transaction, your financial account information, or any other sensitive information, please do not respond and let us know immediately at recruiting@instride.com. About InStride: InStride is a tech-enabled services company that is pioneering new approaches to workforce education solutions with a mission of driving meaningful social and business outcomes by unlocking access to life-changing education. In collaboration with quality academic institutions, we enable employers to provide career-aligned, debt-free education through a personalized, digital platform and a consultative service model. To learn more, visit: https://www.instride.com/", "responsibilities": "Manage the completion, accuracy, and timeliness of complex day-to-day billing operations. Analyze contracts and billing information to ensure an accurate understanding of evolving relationships and requirements and the proper setup of billing operations. Prepare revenue and cost entries in compliance with internal accounting policies and US GAAP. Lead month-end closing of billing on a timely basis so that the financial close timeline is not adversely impacted. Plan for the scalability of billing operations as the company continues to grow. Proactively seek and provide recommendations to improve existing billing processes, systems, training needs, and resources. Implement best practices and develop, execute, and enforce AR policies and procedures. Stay up-to-date with industry trends and engage in continuous learning. Represent the company as a leader in billing presentations and discussions with partners. Be the point of contact and work cross-functionally with internal and external teams on various billing-related issues and workflows. Coordinate with FP&A to assist with billing budget and forecast revisions. Assist with annual audit and tax engagements. Complete special requests and ad-hoc projects, as needed.", "qualifications": {"required": "3-5 years prior work experience in Accounting, Finance, or related fields. Understanding of current US GAAP standards, including ASC 606. Demonstrated history of managing, automating, and scaling revenue and billing processes and procedures. A track record of collaborating with cross-functional departments to support scalable and efficient processes. Experience with NetSuite or similar ERPs. Able to effectively prioritize, meet established goals, and perform in a fast and dynamic environment. Able to maintain confidentiality of information and exercise good judgment. Excellent interpersonal and communication skills, both written and verbal. We value candidates who are experienced collaborators and strong team players. Adaptable and comfortable in a growing and flexible company. Meticulous attention to detail and excellent critical thinking. Experience innovating and solving complex problems. A strong sense of ownership and accountability. Excited by the challenge of building a world-class business that delivers not only high revenue growth and compelling return on investment, but also has a meaningful impact on society. High EQ, comfort with ambiguity and a “no job too small” startup mentality. Bachelor’s degree in accounting, finance, or related fields, preferred. A strong work ethic and desire to continually grow and develop professionally. CPA and Big4 audit experience are a plus.", "preferred": ""}, "skills": [], "postedDate": "16 hours ago", "applicationDeadline": "Not specified", "benefits": "401(k) plan with company match, Flexible vacation policy, Paid family leave, Best-in-class health care benefits, And more!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3912098609"}