{"jobTitle": "Shipping Clerk", "company": {"name": "MS Aerospace", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>M.S. Aerospace Inc. (MSA)</strong> is an aerospace manufacturer of high strength specialty fasteners, including bolts, screws, studs, and pins. Our products are of the highest quality and very close tolerances. Our products support the US Government, including the ISS, Space Shuttle, and the most demanding defense equipment. We also support the most demanding OEMs in the commercial aviation industry.<br/><br/><strong>We offer a competitive benefits package including medical, dental, vision, and a monthly bonus.<br/><br/></strong><strong>Join one of the fastest-growing aerospace companies by</strong> <strong>applying now</strong> <strong>!<br/><br/></strong><strong>Shipping Clerk<br/><br/></strong><strong>Department</strong><strong>:</strong> Shipping<br/><br/><strong>Department/ Area:</strong> Quality Department<br/><br/><strong>Position Summary:</strong> Performs the packaging and shipping functions and all associated activities for shipments made to the Department of Defense.<br/><br/><strong>Daily tasks</strong><strong>:</strong> Under the general supervision of the Production Control Manager plans, organizes and directs the daily activities of both the packaging and shipping of orders delivered to any of the Department of Defense locations. Performs all shipping and inventory transactions in accordance with MSA procedures and practices. Maintains accurate record of all shipments and produces daily shipping reports, and forecasts of future shipments. Ensures the department is clean, well-organized, and safe always.<br/><br/><strong>Minimum Qualifications</strong><strong>:</strong> High School graduate or equivalent with experience in a shipping department with strong communication skills. Experience with the WAWF and DoD shipping preferred. The ability to learn quickly and work well under pressure and to meet rigid deadlines. Experience in a fast-paced packaging and shipping department. Strong organizational skills, good memory, and attention to detail. Above average computer skills and the ability to learn Visual Manufacturing software<br/><br/><strong>Reporting Relationships:</strong> Reports to Quality Director, Shipping Manger and Supervisor.<br/><br/><strong>Physical Demands:</strong> The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is frequently required to use hands to finger to handle and feel. In addition, employee is required to talk or hear. The employee is required to stand (minimum 8 hours); walk; reach with hands and arms. The employee occasionally lifts and/or moves items up to 40 pounds. The employee must frequently perform repetitive activities using the bilateral upper and lower extremities. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception and ability to adjust focus. Strong attention to detail and the ability to concentrate for long periods of time. Hearing level within normal/average range.<br/><br/><strong>Working Conditions: </strong>Second shift position. The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee usually works indoors but occasionally required to work in outdoor spaces. The employee is occasionally exposed to wet and/or slippery conditions. Required to wear safety attire or protective gear on a daily basis. Regularly required to work around powered industrial trucks. The employee must have the ability to work in a fast-paced environment and meet deadlines. The noise level in the work environment is occasionally loud.<br/><br/><strong>Position Type:</strong> <strong>Requires full work time only. 8 hours a shift- Monday to Friday - overtime expected depending on production needs. </strong><strong>Regular attendance is an essential job function.<br/><br/></strong><em>This job description in no way states or implies that these are the only duties to be performed by this employee. He or she will be required to follow any other instructions and to perform any other duties requested by his or her supervisor.<br/><br/></em><em>M.S. Aerospace Inc. is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.<br/><br/></em><em>M.S. Aerospace Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Los Angeles Municipal Code, Chapter XVIII, Article 9.<br/><br/></em><strong>M.S. Aerospace Inc. 13928 Balboa Blvd Sylmar, CA 91342.<br/><br/></strong><strong>Company Description<br/><br/></strong>MSA is a leading manufacturer in the aerospace industry of high-quality specialty fasteners for aerospace, medical and other high performance, applications.<br/><br/>We offer Medical, Dental, Vision, and 401K benefits.<br/><br/>MSA is a leading manufacturer in the aerospace industry of high-quality specialty fasteners for aerospace, medical and other high performance, applications. We offer Medical, Dental, Vision, and 401K benefits.", "postedDate": "3 months ago", "benefits": "We offer Medical, Dental, Vision, and 401K benefits.", "skills": [], "url": "https://www.linkedin.com/jobs/view/3913352165"}