{"jobTitle": "Assistant Buyer - Men's", "company": {"name": "Fashion Nova", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "industry": "Retail Apparel and Fashion", "description": "<strong>About Us<br/><br/></strong>Fashion Nova is an inclusive fashion-forward and trend-driven apparel and lifestyle brand that celebrates all dimensions of confidence. We use our platform to spread positivity with brands for women, men, curve, luxe, sport, swim, beauty, and kids. We are obsessed with creating the best experience available for our customers and employees.<br/><br/>Fashion Nova was built on the backbone of individuality and inclusiveness. Our brands are worn and celebrated worldwide by customers, celebrities, and influencers because of our uniquely creative and talented employees.<br/><br/><strong>Role Overview<br/><br/></strong>The Assistant Buyer on the Mens team will be at the forefront of innovation and style, ensuring our customers have access to the most current trends. You will be responsible for keeping up a reputation in the fashion world that is second to none and will support our Buying teams by analyzing data and assessing trends in the market. You will own assigned categories to ensure products that sell the best are reordered at the best possible cost and quality.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Maintain vendor relationships to get the best possible deliveries at optimum cost and quality</li><li>Communicate with vendors on item availability - In stock units by size and other color offerings, incoming stock and pre-orders by size and delivery dates, and custom cut dates and minimum order quantities (MOQs)</li><li>Present recommendations to Planning for approval</li><li>Key purchase orders into the system and upload orders</li><li>Analyze and forecast product performance and inventory levels to make informed decisions on what and how much to buy back into utilizing historical data and trends</li><li>Monitor program buys and core items to manage the flow</li><li>Recommend promotional activity to drive additional sales volume</li><li>Remain at the forefront of industry fashion market trends</li><li>Stay abreast of emerging best practices within the merchandising|buying field<br/><br/><br/></li></ul><strong>Role Requirements<br/><br/></strong><ul><li>More than one year of experience in Replenishment, Data Analysis, or a similar field</li><li>Experience analyzing data and providing actionable insights </li><li>Experienced in Excel with the ability to perform complex functions, such as SUMIFS, VLOOKUP, and pivot tables</li><li>Passionate about fashion and trend analysis </li><li>BA|BS degree or equivalent working experience in financial analysis or similar role</li><li>English, additional language(s) an advantage</li><li>Schedule of this position: Monday – Friday | Core business hours | Onsite<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Formalized career paths</li><li>Flat management platform</li><li>Manager Training Academy</li><li>Creative Development Internship Program</li><li>Fashion Nova Cares Program</li><li>Flexible Paid Time Off (PTO)</li><li>Medical, Dental and Vision Coverage</li><li>401k match, with immediate vesting upon eligibility</li><li>Stocked kitchens with gratis snacks and drinks</li><li>Weekly catered lunches</li><li>Summer Fridays at Headquarters</li><li>Team bonding events and programs</li><li>Employee discounts<br/><br/><br/></li></ul>Fashion Nova, LLC, and subsidiaries thereof, is an Equal Opportunity Employer. We are steadfast in our commitment to equal employment opportunities and pledge that these objectives are reflected in all aspects of our daily operations. We will continue to recruit, hire, train, and advance in employment qualified individuals in all job titles without regard to race, color, national origin, gender, sexual orientation, gender identity, religion, age, status as a protected veteran, criminal history, or status as an individual with a disability; and shall not discriminate against any individual, any such characteristic, nor any other classification protected by local, state and|or federal law.<br/><br/><strong>NOTICE AT COLLECTION</strong>", "jobFunction": "Other", "postedDate": "2 weeks ago", "skills": ["Replenishment", "Data Analysis", "Excel", "Fashion", "Trend Analysis", "Financial Analysis"], "url": "https://www.linkedin.com/jobs/view/3913474995"}