{"jobTitle": "Group Exercise Regional Manager", "company": {"name": "Gold's Gym", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Wellness and Fitness Services", "description": "<strong>POSITION OBJECTIVE<br/><br/></strong>Gold’s Gym Los Angeles (GGLA) is a successful, growing company currently owning and operating 11 gyms in the Southern California region. With regards to the Gold’s Group Exercise (GGX) department, every gym opened adds on average of 70 weekly classes and 30-40 instructors to the GGLA TEAM. Operationally and logistically, assistance is needed to ensure the quality of the classes and integrity of the GGX department.<br/><br/>The objective of the GGX Manager position is to aid the GGX Director in daily operational and administrative functions and duties, as listed below. This will optimize GGX class attendance and profitability and ensure department quality, consistency, and maximize member experience as GGLA continues to grow.<br/><br/><strong>Position Summary<br/><br/></strong>Assists in the management and promotion of an effective and well-balanced Group Exercise program in multiple gym operations. Motivates the Group X staff at the clubs and carries out supervisory responsibilities in accordance with the company policies and procedures. Assists the GGX Director with the management of the group exercise department by modeling and ensuring professional levels of performance and communication.<br/><br/><strong>Essential Functions<br/><br/></strong>Assists the Group Exercise Director with the following activities as delegated:<br/><br/>Upholds club policies and procedures in a tactful and positive manner.<br/><br/>Maintains the schedule of classes including written descriptions in multiple gym locations. Maintains class schedule on website and ClubCom.<br/><br/>Schedules special events – demonstrations, etc.<br/><br/>Audits instructors’ classes on a weekly basis to provide up-skilling and constructive feedback.<br/><br/>Keeps current with industry trends, literature and communicates to staff.<br/><br/>Evaluates instructor performance and provides feedback, as directed.<br/><br/>Maintains group exercise rooms and equipment.<br/><br/>Communicate programs, events and schedules to other departments, especially the front desk.<br/><br/>Interviews, hires and trains new employees, as directed.<br/><br/>Develops and schedules staff development programs on group exercise and group exercise programs.<br/><br/>Maintains departmental usage and class attendance reports.<br/><br/>Maintains a high professionalism in regard to attitude and performance.<br/><br/>Communicates pertinent information to all managers, staff and members.<br/><br/>Maintains or develops necessary knowledge regarding position related topics.<br/><br/>Works the front desk to assist members with group exercise.<br/><br/>Other duties may be assigned.<br/><br/><strong>Supervisory Responsibilities<br/><br/></strong>Supervises daily classes and functions of group exercise instructors.<br/><br/><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Education/Experience<br/><br/></strong>5 (minimum) years group exercise class instruction experience; choreography experience<br/><br/>Certified in minimum (2) Les Mills formats for minimum (2) years<br/><br/>2 (minimum) year management experience.<br/><br/>CPR / AED certification<br/><br/>Be proficient in the use of all required software programs<br/><br/><strong>Language Skills<br/><br/></strong>Ability to read and interpret English documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write reports and correspondences. Ability to communicate in English effectively with customers and/or associates of the organization. Must be capable of speaking effectively in front of groups of customers and/or associates.<br/><br/><strong>REASONING ABILITY <br/><br/></strong>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram or schedule form and communicate the information effectively.<br/><br/><strong>PHYSICAL DEMANDS<br/><br/></strong>The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the associate is regularly required to stand and/or sit for long periods of time, use hands, fingers, handle, or feel, and talk and hear. The associate frequently is required to reach with hands and arms, climb or balance. The associate is occasionally required to walk and stoop, kneel, crouch, or crawl. The associate must occasionally lift and or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to focus.<br/><br/><strong>WORK ENVIRONMENT<br/><br/></strong>The work environment characteristics described throughout this job description are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Other Qualifications<br/><br/></strong><ul><li> Demonstrates ability to understand customer is #1 both internally and externally</li><li> Ability to use sound business judgment and have strong analytical skills</li><li> Ability to effectively communicate with the least amount of disturbance to all employees</li><li> Must possess enthusiasm and a willingness to promote brand recognition</li><li> Strong and effective interpersonal skills</li><li> Ability to be proactive and self directed</li><li> Effective listening skills</li><li> Effective delegation and follow-up skills</li><li> Demonstrates the ability to lead, build and manage a team</li><li> Effective planning and organization skills</li><li> Demonstrates ability to create a positive environment</li><li> Demonstrates willingness and openness for self development</li><li> Ability to identify and use resources to improve overall operations</li><li> Possesses positive attitude with the ability to negotiate resolutions for customers and co-workers</li><li> Microsoft Office Suite: Word, Excel, PowerPoint, Outlook<br/><br/></li></ul>In 1965, a small gym was founded on the shores of Venice Beach, California. Fast forward 55 years, and that humble establishment has blossomed into a worldwide fitness powerhouse known as Gold's Gym. With a presence on six continents and over 600 locations, Gold's Gym has achieved iconic status in the fitness industry. It's where legendary bodybuilders like Arnold Schwarzenegger, Lou Ferrigno, and Franco Columbu honed their craft, solidifying its reputation as the ultimate gym destination.<br/><br/>Gold's Gym boasts a culture with unparalleled recognition, with an impressive 96% aided brand awareness. Our journey to success is deeply rooted in our unique company culture, a blend of humility, dependability, and an entrepreneurial spirit, combined with boundless enthusiasm, collaboration, and creativity.<br/><br/>If this resonates with you, we eagerly anticipate receiving your application! Join the legacy today!", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3913430496"}