{"jobTitle": "HR Business Partner", "company": {"name": "Miso Robotics", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 115,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Automation Machinery Manufacturing", "description": "Our Company<br/><br/>Miso Robotics is transforming the restaurant industry, and making food workers’ lives better. Our signature product is an AI-powered kitchen robot named Flippy which automates the dangerous operation of a restaurant’s fry station and cooks all sorts of fried items. Flippy is powered by a sophisticated AI platform driven by our proprietary and patented technologies.<br/><br/>Miso is a well known first-mover in kitchen automation, AI, and robotics. The company has raised over $125 million from equity crowdfunding, which we believe makes it THE most successful crowdfunding story in history. It has successfully piloted its products with the most prominent global brands in food, and now it’s time for the company to scale.<br/><br/>The company recently added a new CEO and other senior leaders, including a new CTO – all of whom hold decades of experience operating growth companies. Our CEO has a track record of successful exits, and we recently accepted a strategic investment and partnership from Ecolab (NYSE: ECL), a $70 billion public company which, as the global leader in sales of cleaning solutions to restaurants, truly knows how to operate at scale. Our new leadership team is evolving the company’s culture from early stage to growth stage with new processes and disciplines, and is supported by a board that includes the former President and CTO of OpenTable.<br/><br/>With Ecolab’s support, we are building a world-class team, and are looking for more exceptional people to join us.<br/><br/>Our Values<br/><br/><ul><li>We live with a TEAM mindset - we win together. </li><li>We work relentlessly together to solve issues.</li><li>We use polite and direct candor - ego has no place here. </li><li>We operate with rigor - superb execution is a core skill.</li><li>We are bought in, each of us is dedicated to the mission.</li><li>Innovation is in our blood - we are intrepid. </li><li>We think big and we’re here to make an impact.<br/><br/></li></ul>Benefits We Offer<br/><br/><ul><li>Company equity</li><li>Flexible vacation </li><li>Comprehensive benefits </li><li>401K plan</li><li>Accelerated growth opportunities</li><li>Free snacks from our robot chefs<br/><br/></li></ul>The Role<br/><br/>As a Human Resources Business Partner at Miso Robotics, you will use your knowledge and experience in Human Resources to support our growing business. You will contribute directly to the growth of the HR department over the coming few years. We are looking for a self-starter and someone who will take ownership of processes and outcome. An eye for process improvement and increased efficiency is important. You will be responsible for Miso Robotics’ daily HR administrative functions, as well as other functions including recruiting, onboarding, employee development, annual reviews, team building events and answering employee questions. You will be the main point of contact at Miso for HR related questions.<br/><br/>What You'll Do<br/><br/><ul><li>Responsible for recruiting, which includes ensuring job descriptions are up to date and compliant, sourcing for open positions, and managing our recruiting metrics.</li><li>Responsible for the orientation and onboarding process for new Miso Robotics employees. </li><li>Administer all HR policies, procedures, and programs per company standards.</li><li>Administer company employee benefit programs including overseeing open enrollment with our partnered PEO provider. </li><li>Responsible for timekeeping for non-exempt employees, and working with Payroll to ensure employees are paid correctly.</li><li>Work with the VP of HR on implementing metrics and methods of measuring success, converting strategy into results-driven action.</li><li>Create, distribute, and analyze data from employee surveys.</li><li>Work with the HR team on creating and implementing several employee-focused initiatives. </li><li>Administer and track employee leaves of absence in accordance with federal and state law. </li><li>Administer and oversee company recognition program, company team building events, and training and continued education support. </li><li>Maintain associate files (personnel, I-9, medical), including all necessary documentation.</li><li>Provide tactical support to leaders and managers.</li><li>We are a growing company, so there may be other related tasks assigned. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s degree required, Masters degree in Human Resources, or MBA preferred.</li><li>5+ years of progressive HR experience required.</li><li>Ability to manage data in a clear and concise manner.</li><li>Strong verbal and written communication skills.</li><li>Working knowledge of employment and labor law, specifically in California. </li><li>Ability to prioritize and take on multiple tasks in a fast paced environment while remaining detail oriented and efficient. </li><li>Comfortable with G-suite, Microsoft Office suite and generally able to learn new software quickly.</li><li>Ability to collaborate effectively with a team.</li><li>Ability to work in our HQ in Pasadena, CA. This role can be hybrid. <br/><br/></li></ul><strong>Compensation<br/><br/></strong>$80,000-$115,000/yr + Equity + Benefits<br/><br/>The stated compensation range reflects only the targeted base salary range for candidates residing in the Los Angeles Metro area and excludes additional earnings such as bonus and benefits. If your salary requirements fall outside of the range, we still encourage you to apply.<br/><br/>At Miso Robotics, we are committed to fostering an inclusive, diverse, and equitable workplace where every team member is valued and respected. We believe that diversity in our team drives innovation and creativity, which is why we strive to create a welcoming environment for everyone, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or veteran status.", "responsibilities": "<ul><li>Responsible for recruiting, which includes ensuring job descriptions are up to date and compliant, sourcing for open positions, and managing our recruiting metrics.</li><li>Responsible for the orientation and onboarding process for new Miso Robotics employees. </li><li>Administer all HR policies, procedures, and programs per company standards.</li><li>Administer company employee benefit programs including overseeing open enrollment with our partnered PEO provider. </li><li>Responsible for timekeeping for non-exempt employees, and working with Payroll to ensure employees are paid correctly.</li><li>Work with the VP of HR on implementing metrics and methods of measuring success, converting strategy into results-driven action.</li><li>Create, distribute, and analyze data from employee surveys.</li><li>Work with the HR team on creating and implementing several employee-focused initiatives. </li><li>Administer and track employee leaves of absence in accordance with federal and state law. </li><li>Administer and oversee company recognition program, company team building events, and training and continued education support. </li><li>Maintain associate files (personnel, I-9, medical), including all necessary documentation.</li><li>Provide tactical support to leaders and managers.</li><li>We are a growing company, so there may be other related tasks assigned. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree required, Masters degree in Human Resources, or MBA preferred.\n5+ years of progressive HR experience required.\nAbility to manage data in a clear and concise manner.\nStrong verbal and written communication skills.\nWorking knowledge of employment and labor law, specifically in California. \nAbility to prioritize and take on multiple tasks in a fast paced environment while remaining detail oriented and efficient. \nComfortable with G-suite, Microsoft Office suite and generally able to learn new software quickly.\nAbility to collaborate effectively with a team.\nAbility to work in our HQ in Pasadena, CA. This role can be hybrid. <br/><br/>", "preferred": ""}, "skills": ["HR", "Recruiting", "Onboarding", "Employee Benefits", "Payroll", "Data Analysis", "Employee Surveys", "Employee Relations", "Training", "G-Suite", "Microsoft Office"], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "<ul><li>Company equity</li><li>Flexible vacation </li><li>Comprehensive benefits </li><li>401K plan</li><li>Accelerated growth opportunities</li><li>Free snacks from our robot chefs<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3913472984"}