{"jobTitle": "Deburrer", "company": {"name": "MS Aerospace", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>M.S. Aerospace Inc. (MSA)</strong> is an aerospace manufacturer of high strength specialty fasteners, including bolts, screws, studs, and pins. Our products are of the highest quality and very close tolerances. Our products support the US Government, including the ISS, Space Shuttle and the most demanding defense equipment. We also support the most demanding OEMs in the commercial aviation industry.<br/><br/><strong>We offer a competitive benefits package including medical, dental, vision, and a monthly bonus.<br/><br/></strong><strong>Join one of the fastest-growing aerospace companies by</strong> <strong>applying now</strong> <strong>!<br/><br/></strong><strong>Marking Machinist Operator<br/><br/></strong><strong>Department</strong><strong>:</strong> Marking<br/><br/><strong>Department/ Area:</strong> Shop Floor<br/><br/><strong>Position Summary:<br/><br/></strong>The candidate will be responsible for operating press for the purpose of impression of identification in fasteners manufactured for the aerospace industry under the tightest tolerances and quality requirements. After the training period, the candidate will be responsible for machine tooling and set-up.<br/><br/><strong>Daily tasks</strong><strong>:<br/><br/></strong>Operate the marking press machines. Visually and dimensionally check samples. Enter production and quality data in computer reporting system. Maintain work area. Keep area clean and organized with required tools and inspection gages. Follow instructions and procedures. Monitor production data and report to supervisors. Weigh count piece production. Participate in training classes as needed and required.<br/><br/><strong>Minimum Qualifications</strong><strong>:<br/><br/></strong><ul><li>High school diploma or equivalent</li><li>Good communications skills</li><li>Basic math and reading skills. <br/><br/></li></ul><strong>Reporting Relationships:<br/><br/></strong>Reports to Director of Manufacturing and Plant Manager<br/><br/><strong>Working Conditions:<br/><br/></strong>Repetitive manual motion, heavy physical work. Walking to monitor several machines. Lifting to 25 lbs and moving 40lb pans with dollies.<br/><br/><strong>Success Factors</strong><strong>:<br/><br/></strong><ul><li>Ability to read a micrometer and caliper a plus</li><li>Understand the marking operation a plus</li><li>Bilingual a plus</li><li>Simple blueprint reading and use of precision measuring tools, comparators and gages a plus</li><li>Experience on marking all types of materials (such as Inconel 718, Titanium, 8740) a plus. <br/><br/></li></ul><strong>Position Type:<br/><br/></strong><strong>Requires full work time only. 8 hours a shift- Monday to Friday - overtime expected depending on production needs. </strong><strong>Regular attendance is an essential job function.<br/><br/></strong><em>This job description in no way states or implies that these are the only duties to be performed by this employee. He or she will be required to follow any other instructions and to perform any other duties requested by his or her supervisor.<br/><br/></em><em>M.S. Aerospace Inc. is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.<br/><br/></em><em>M.S. Aerospace Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Los Angeles Municipal Code, Chapter XVIII, Article 9.<br/><br/></em><strong>M.S. Aerospace Inc. 13928 Balboa Blvd Sylmar, CA 91342.<br/><br/></strong><strong>Company Description<br/><br/></strong>MSA is a leading manufacturer in the aerospace industry of high-quality specialty fasteners for aerospace, medical and other high performance, applications.<br/><br/>We offer Medical, Dental, Vision, and 401K benefits.<br/><br/>MSA is a leading manufacturer in the aerospace industry of high-quality specialty fasteners for aerospace, medical and other high performance, applications. We offer Medical, Dental, Vision, and 401K benefits.", "responsibilities": "The candidate will be responsible for operating press for the purpose of impression of identification in fasteners manufactured for the aerospace industry under the tightest tolerances and quality requirements. After the training period, the candidate will be responsible for machine tooling and set-up.<br/><br/><strong>Daily tasks</strong><strong>:<br/><br/></strong>Operate the marking press machines. Visually and dimensionally check samples. Enter production and quality data in computer reporting system. Maintain work area. Keep area clean and organized with required tools and inspection gages. Follow instructions and procedures. Monitor production data and report to supervisors. Weigh count piece production. Participate in training classes as needed and required.", "qualifications": {"required": "High school diploma or equivalent, Good communications skills, Basic math and reading skills.", "preferred": "Ability to read a micrometer and caliper a plus, Understand the marking operation a plus, Bilingual a plus, Simple blueprint reading and use of precision measuring tools, comparators and gages a plus, Experience on marking all types of materials (such as Inconel 718, Titanium, 8740) a plus."}, "skills": ["Communication", "Blueprint Reading", "Micrometer", "Caliper", "Marking"], "postedDate": "3 months ago", "benefits": "We offer a competitive benefits package including medical, dental, vision, and a monthly bonus.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3913348523"}