{"jobTitle": "Executive Assistant - Legal", "company": {"name": "Lambda Legal", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000 - $100,000", "currency": "USD"}, "jobFunction": "Legal", "industry": "Internet Publishing", "description": "<strong>Position:</strong> Executive Assistant - Legal<br/><br/><strong>Department:</strong> Legal<br/><br/><strong>Office Location: </strong>Los Angeles, CA<br/><br/><strong>Work Type Designation:</strong> Work from Office (WFO) in Lambda Legal's Los Angeles location (3 days per week)<br/><br/><ul><li>Per Lambda Legal’s Work Location Designation policy, Work from Home, Work from Office, and Hybrid options are available with supervisor approval</li><li>Generally, employees can live in any of the states that fall within the Combined Statistical Area (CSA) boundaries of their Office of Record as long as they reside within three (3) hours of their Office of Record by ground transportation or ferry. Exceptions may be possible. These states includeCalifornia,Connecticut,Georgia,Illinois,Indiana,Maryland,Nevada,New Jersey,New York,Oklahoma,Pennsylvania,South Carolina,Texas,Virginia,West Virginia,Wisconsin, andWashington, D.C</li><li>Work from Office and Hybrid employees must be able to commute to the Regional Office as their schedule demands<br/><br/></li></ul><strong>Reports to:</strong> Chief Legal Officer<br/><br/><strong>Union Status:</strong>This role is a non-union position.<br/><br/><strong>Annual Salary Range:</strong> $85,000 - $100,000 annually.<br/><br/><strong>Travel: </strong>This position may require occasional regional travel.<br/><br/><strong>FLSA Status:</strong>Exempt/Full-Time<br/><br/><strong>Supervisory Responsibilities: </strong>None<br/><br/><strong>Who We Are<br/><br/></strong>Lambda Legal is a national advocacy organization committed to achieving full recognition of the civil rights for the LGBTQ+ community and everyone living with HIV through impact litigation, education, and public policy work. Since 1973, Lambda Legal has used impact litigation and other advocacy tools to decriminalize same-sex relationships; challenge discrimination against LGBTQ+ people and people living with HIV in the workplace, in the home, in schools, in health care, and in the military; and protect LGBTQ+ families, including by winning and defending marriage equality. Our clients are not charged for legal representation or advocacy and Lambda Legal receives no government funding. Headquartered in New York City, Lambda Legal also has regional offices in Los Angeles, Chicago, Atlanta, Dallas, and Washington, DC. <br/><br/>We believe that serving the full breadth of the LGBTQ+ and HIV communities requires cultural competency and enthusiasm for diversity of all kinds. To be successful, we must approach our work with an understanding that discrimination based on sexual orientation, gender identity, or HIV status is not the only obstacle to achieving full formal and lived equality for LGBTQ+ people and everyone living with HIV; rather, we recognize the intersectional nature of discrimination, specifically including biases based on race, religion, national origin, gender, disability, education, and class. Considering this reality, we prioritize a proactive commitment to counteracting these biases and their compounding effects in the work we do, but also in how we work together as an organization.<br/><br/><strong>Executive Assistant - Legal <br/><br/></strong>Lambda Legal seeks an experienced administrative professional to support its Chief Legal Officer (CLO). This position is responsible for supporting confidential correspondence and communications, budget planning and management, expense reports, calendars, travel arrangements, liaising with other Lambda Legal departments and with external partners, and working closely with Legal Department leadership to manage departmental operations. The core function of the Executive Assistant is to facilitate the CLO’s ability to function at maximum capacity and efficiency with respect to the department’s essential matters.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Support preparation of Legal Department agendas and presentations for All Staff meetings</li><li>Support departmental budget preparation and expense management, and prepare CLO’s monthly expense reports</li><li>Manage the CLO’s calendar, including scheduling/arranging meetings, sending invitations and reminders when needed, and arranging for presentation materials. </li><li>Coordinate executive travel, hotel, and car reservations, including verifying required travel documentation, determining timelines and processes to obtain necessary documentation</li><li>Support production of written materials, including initial drafting, review and proofreading, and other assistance as requested. </li><li>Undertake special research and writing projects as assigned</li><li>Participate in Legal Department meetings and maintain records, as needed</li><li>Meet regularly with the Legal Administrative Manager to coordinate departmental operations and support functions, including expense tracking, contract management, coordination with the People &amp; Culture and Finance departments, and other functions that support Legal departmental operations</li><li>Assist with payments to vendors, as requested. </li><li>Filing, scanning, copying, and management of documents, as needed. </li><li>Participate in interdepartmental meetings and committees as directed by the CLO</li><li>Support troubleshooting of technology problems with support from Information Technology staff</li><li>Other duties as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Successful candidates will welcome the opportunity to work in a racially- and gender-diverse environment and to contribute to a positive and inclusive atmosphere.  Skills and competencies include:<br/><br/><ul><li>At least 15 years of related work experience, including at least 5years supporting senior staff.Experience doing so in a law practice environment is preferred</li><li>Advanced proficiency in Microsoft Office (Outlook, Word, Excel, PowerPoint, Teams, and SharePoint). Experience with WestLaw and/or iManage is a plus</li><li>Effective at time management and balancing multiple tasks, conflicting priorities, and tight deadlines, including quick course changes in a fast-paced environment</li><li>Strong organizational skills with high attention to detail and accuracy</li><li>Experience supporting budget planning and management, scheduling meetings, and managing calendars</li><li>Proactive, self-directed, and adept at problem-solving</li><li>Accustomed to maintaining the confidentiality of sensitive information. </li><li>Excellent written and oral communication skills. </li><li>Ability to quickly establish trust and professional working relationships with colleagues and external partners and clientsof diverse backgrounds and experience levels in a confident, professional manner. </li><li>A positive and receptive attitude towards constructive feedback, using it as an opportunity for personal and professional growth</li><li>Strong work ethic and a purpose-driven commitment to the mission of Lambda Legal. </li><li>Working at Lambda Legal requires a demonstrated awareness of and commitment to the concerns of the breadth of the communities that Lambda Legal serves. Prior work on behalf of the LGBTQ+ community and/or people living with HIV is highly desirable. Experience working with other historically marginalized communities (in a professional or volunteer capacity) is also desirable<br/><br/></li></ul><strong>Benefits: <br/><br/></strong>We are pleased to offer competitive benefits for the hard work our employees do on behalf of our mission. A highlight of the benefits we offer include:<br/><br/><ul><li>Medical benefits that begin on your start date</li><li>Dental, Vision, and Life insurance (effective 30 days from your start date)</li><li>Short &amp; Long-Term Disability plans (effective 30 days from your start date)</li><li>403(b) Retirement Plan (employer contribution and matching program begins after 90 days of employment)</li><li>Paid Time Off:</li><ul><li>Paid Vacation (15 Days)</li><li>Sick Leave (12 Days)</li><li>Personal Leave (3 Days)</li><li>Religious Observance Leave (3 Days)</li><li>Bereavement and Bereavement Anniversary Leave</li><li>Floating Holiday (1 Day)</li></ul><li>12 paid holidays and 5 early office closures</li><li>Flexible Spending Account (FSA/DC FSA) and Commuter Benefits</li><li>Health Reimbursement Account</li><li>$50 monthly mobile phone reimbursement</li><li>Summer Fridays from Memorial Day to Labor Day</li><li>Premium subscription to the Calm App</li><li>Paid sabbatical after 7 years of service at Lambda Legal (4 weeks for non-exempt positions and 8 weeks for exempt positions)<br/><br/></li></ul>________<br/><br/>Read more about Lambda Legal's work on our blog and Instagram.<br/><br/><em>Lambda Legal believes in creating a more equitable playing field for applicants and values the depth of relevant skills built through successful education, work, and life experiences. If your background and skills are a close match for this position, you are strongly encouraged to apply. <br/><br/></em><em>Lambda Legal is committed to further building and maintaining a staff that reflects the full range of LGBTQ+, HIV-affected and allied communities, and is an equal opportunity employer. We value a diverse workforce and an inclusive culture. Lambda Legal encourages applications from all qualified individuals without regard to race, color, religion, gender, sexual orientation, gender identity or expression, age, national origin, marital status, citizenship or immigration status, disability, veteran status, record of arrest or conviction, or any other characteristic protected by applicable law. Black people, Indigenous people, people of color, lesbian, gay, bisexual, queer, transgender and gender-diverse people, women, people with abilities in multiple languages, immigrants, people living with disabilities, protected veterans, and formerly incarcerated individuals and individuals living with HIV are all encouraged to apply.<br/><br/></em>Powered by JazzHR<br/><br/>VC9Hi26hDL", "responsibilities": "<ul><li>Support preparation of Legal Department agendas and presentations for All Staff meetings</li><li>Support departmental budget preparation and expense management, and prepare CLO’s monthly expense reports</li><li>Manage the CLO’s calendar, including scheduling/arranging meetings, sending invitations and reminders when needed, and arranging for presentation materials. </li><li>Coordinate executive travel, hotel, and car reservations, including verifying required travel documentation, determining timelines and processes to obtain necessary documentation</li><li>Support production of written materials, including initial drafting, review and proofreading, and other assistance as requested. </li><li>Undertake special research and writing projects as assigned</li><li>Participate in Legal Department meetings and maintain records, as needed</li><li>Meet regularly with the Legal Administrative Manager to coordinate departmental operations and support functions, including expense tracking, contract management, coordination with the People &amp; Culture and Finance departments, and other functions that support Legal departmental operations</li><li>Assist with payments to vendors, as requested. </li><li>Filing, scanning, copying, and management of documents, as needed. </li><li>Participate in interdepartmental meetings and committees as directed by the CLO</li><li>Support troubleshooting of technology problems with support from Information Technology staff</li><li>Other duties as assigned<br/><br/></li>", "qualifications": {"required": "At least 15 years of related work experience, including at least 5years supporting senior staff.Experience doing so in a law practice environment is preferred, Advanced proficiency in Microsoft Office (Outlook, Word, Excel, PowerPoint, Teams, and SharePoint). Experience with WestLaw and/or iManage is a plus, Effective at time management and balancing multiple tasks, conflicting priorities, and tight deadlines, including quick course changes in a fast-paced environment, Strong organizational skills with high attention to detail and accuracy, Experience supporting budget planning and management, scheduling meetings, and managing calendars, Proactive, self-directed, and adept at problem-solving, Accustomed to maintaining the confidentiality of sensitive information. , Excellent written and oral communication skills., Ability to quickly establish trust and professional working relationships with colleagues and external partners and clientsof diverse backgrounds and experience levels in a confident, professional manner., A positive and receptive attitude towards constructive feedback, using it as an opportunity for personal and professional growth, Strong work ethic and a purpose-driven commitment to the mission of Lambda Legal., Working at Lambda Legal requires a demonstrated awareness of and commitment to the concerns of the breadth of the communities that Lambda Legal serves. Prior work on behalf of the LGBTQ+ community and/or people living with HIV is highly desirable. Experience working with other historically marginalized communities (in a professional or volunteer capacity) is also desirable", "preferred": null}, "skills": ["Microsoft Office", "WestLaw", "iManage", "Time Management", "Organizational Skills", "Budgeting", "Calendar Management", "Problem Solving", "Confidentiality", "Communication", "Relationship Building", "Feedback", "Work Ethic"], "postedDate": "3 months ago", "applicationDeadline": null, "benefits": "Medical benefits that begin on your start date, Dental, Vision, and Life insurance (effective 30 days from your start date), Short &amp; Long-Term Disability plans (effective 30 days from your start date), 403(b) Retirement Plan (employer contribution and matching program begins after 90 days of employment), Paid Time Off: Paid Vacation (15 Days), Sick Leave (12 Days), Personal Leave (3 Days), Religious Observance Leave (3 Days), Bereavement and Bereavement Anniversary Leave, Floating Holiday (1 Day), 12 paid holidays and 5 early office closures, Flexible Spending Account (FSA/DC FSA) and Commuter Benefits, Health Reimbursement Account, $50 monthly mobile phone reimbursement, Summer Fridays from Memorial Day to Labor Day, Premium subscription to the Calm App, Paid sabbatical after 7 years of service at Lambda Legal (4 weeks for non-exempt positions and 8 weeks for exempt positions)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3914856075"}