{"jobTitle": "Public Records Act Analyst/Paralegal (CA Based required)", "company": {"name": "Fawkes IDM ", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Responsibilities:<br/><br/><ul><li>Keeps track of public records requests that are submitted to public agency clients. </li><li>Analyzes public records requests and assists with determining the scope of search that the subject public agency must undertake to find responsive records. </li><li>Works with public agency staff to transfer documents to the law firm for review. Reviews databases of documents to determine responsiveness of documents. Marks documents as privileged or exempt, as necessary, or otherwise redacts documents. Such work will require the paralegal to receive training on the California Public Records Act and other public records-related statutory exemptions, as well as case law. </li><li>Assists attorneys in drafting response letters to records requesters. Keeps deadlines to ensure that records are provided to the public agency client in time for the public agency to provide records to requesters within the statutory requirements. Consults with attorneys and client on conclusions regarding exemptions for withholding records and records to be produced. </li><li>Reviews public agency client records (written, verbal and electronic) and confers with assigning attorney to prevent the unauthorized release</li><li>Reviews large volume of records being able to spot legal and public policy issues of importance to the public agency client. Consults with attorneys on how to best communicate these issues to the client before producing the records</li><li>Acts as a representative on behalf of the public agency counsel, demonstrating a positive attitude with professionalism, courtesy, and appropriate tact and discretion in all interactions with members of the public, opposing counsel, other agencies, and other employees</li><li>Researches state, statutory, case and other authorities applicable to the California Public Records Act. </li><li>Conducts legal, public records, and other research (including cite check/Shepardizing) relating to simple and complex matters, summarizes findings and recommends proposed courses of action and/or solutions to the assigning attorney; is knowledgeable about internet research sources; assists with problem formulation, data collection, and analysis as needed by the assigning attorney</li><li>Prepares legal documents and correspondence applicable to the practice area in draft and final forms - including redline, as directed by the assigning attorney, and utilizes independent judgment to determine proper distribution; proofreads legal documents and correspondence and makes required corrections in spelling, grammar and punctuation</li><li>Maintains accurate calendar for deadlines - as required</li><li>Searches for, obtains, reviews materials and prepares and maintains appropriate control measures - such as databases - for expedient search and retrieval re the same<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>B.A. or B.S. degree from an accredited college or university, or equivalent experience</li><li>Paralegal certificate from an ABA approved program </li><li>3+ years' experience with electronic document review in a law firm or government setting</li></ul>", "postedDate": "3 months ago", "qualifications": {"required": "B.A. or B.S. degree from an accredited college or university, or equivalent experience\nParalegal certificate from an ABA approved program \n3+ years' experience with electronic document review in a law firm or government setting"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3914136241"}