{"jobTitle": "Customer Service/Shipping and Receiving", "company": {"name": "Mark Optics, Inc.", "industry": "Glass, Ceramics and Concrete Manufacturing", "size": "10 employees", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$15.00 - $16.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Glass, Ceramics and Concrete Manufacturing", "description": "The position is for the following duties: Customer Service (general office): As customer service rep. you will be responsible for order entry, incoming calls as well as light filing and data entry. Light shipping and receiving: As our shipping and receiving clerk you will be responsible for packaging our products and preparing Fed Ex, UPS and/or International shipment documentation as well as typing certificates of conformance. In receiving, you are responsible for ensuring the incoming product is accurate to the purchase orders and labeled correctly before it is inventoried. As required, you will be expected to support technical sales and operation manager and other office duties as required. We are a small manufacturing shop with 10 employees. We are looking a candidate who is reliable, detail oriented, and is looking for a long term, stable position with room for growth. COVID-19 considerations: We do not have outside people in our building except to pick up packages and fix machinery as needed. The position has their own work area that is not in the room with anyone else. We have a full Covid-19 Prevention Plan developed.", "responsibilities": "Customer Service (general office): As customer service rep. you will be responsible for order entry, incoming calls as well as light filing and data entry. Light shipping and receiving: As our shipping and receiving clerk you will be responsible for packaging our products and preparing Fed Ex, UPS and/or International shipment documentation as well as typing certificates of conformance. In receiving, you are responsible for ensuring the incoming product is accurate to the purchase orders and labeled correctly before it is inventoried.", "qualifications": {"required": "Reliable, detail oriented, and looking for a long term, stable position with room for growth.", "preferred": ""}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3914292785"}