{"jobTitle": "Design Consultant", "company": {"name": "Ethan Allen Global, Inc.", "industry": "Retail", "size": "Not specified", "location": "Agoura Hills, CA"}, "location": "Agoura Hills, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Retail", "description": "The Design Consultant works closely with the customer in the design center/studio, remotely, online or in the customer’s home to create individualized design solutions to sell Ethan Allen products and services. The designs include space planning, fabric coordination, product selection and overall project design. Successful execution is evidenced by developing individualized designs and achieving sales goals in a flexible relationship based selling environment. Some projects may require a team or partnership-based approach. Design Consultants will be measured based on performance categories (teamwork, customer service, communication skills, decision making, project development, presentation, and technical skills) and benchmarks (Minimum Monthly Sales, Home Calls, Accent Sales, Softgood Sales, Be-Backs, PI, Close Ratio and Ethan Allen Trade Program) that contribute to the success of the Design Center as well as their own individual success. Must be skilled in the use of social media such as blogs, micro-blogs, on-line forum, content sharing web sites and other digital channels established for on-line interaction and connection to promote Ethan Allen’s brand as outlined in Ethan Allen’s Social Media Policy. Design Consultants are compensated according to the Design Consultant Incentive Compensation Plan. Compensation is incentive based with total compensation determined by commissions earned. Design Consultants are expected to meet or exceed Minimum Monthly Sales and other benchmarks as determined by Ethan Allen.", "responsibilities": "Create design solutions that are consistent with the customer’s preference and budget. Sell Ethan Allen’s products and services. Represent the Ethan Allen brand in all customer interactions. When in the design center professionally greet customers to establish rapport and obtain appointments and in-home consultations. Customarily and regularly make home calls to evaluate the customer’s needs and provide a total individualized design solution that closes the sale. Utilize grassroots marketing and a variety of social media platforms to develop and grow the business. Educate customers about the complimentary design service Ethan Allen provides, offering as little or as much design service as a customer desires. Stay current on design and color trends to create fashionable design solutions. Coordinate with the team to provide exceptional service to customers, before and after the sale, by promptly keeping customers informed of their order status including any delays. Participate as required in all corporate sponsored marketing and training programs. Educate customers on all the Ethan Allen sponsored finance options available to them. Contribute towards the development and on-going upkeep of the design center’s portfolio. Utilize corporate systems and technology to maximize efficiency in designing projects, creating presentations, and providing professional service for the design team’s customers. Enter orders utilizing the retail point of sale system. Work cooperatively in maintaining a neat and orderly design center projection. Work with the Design Center Leader/Design Sales Leader and Design Consultants to develop business plans and grass roots marketing plans to further our market reach and exceed written goals; monitor effectiveness of the plans. Provide suggestions to modify plan based on reaching specific goals and objectives. Utilize all technology, such as 3-D Room Planner, CRM, Live Chat, etc. to build volume of projects and productive relationships with prospective and current clients. Utilize appropriate social media (i.e., Facebook, Instagram, etc.) to heighten own presence as well as Ethan Allen’s presence. Continually build relationships with outside talent via social media, such as LinkedIn, to build a network in the market. Perform any other duties as required.", "qualifications": {"required": "Bachelor’s degree or equivalent in a design-related field from an accredited institution with a minimum of one (1) year of practical interior design experience. Broad knowledge of interior design and effective sales techniques. Working knowledge of online sales and design tools. Good listening skills with excellent oral and written communication skills also required. General understanding of how to utilize social media and grass-roots marketing to develop a book of business. Proven experience preferred. Valid driver’s license, except in limited circumstances in which the associate can establish to the Company’s satisfaction that they have available, for use during all business hours, an alternate means of transportation not requiring the operation of a motor vehicle which will enable them to perform the duties of their position. Intermediate skill competency using digital floor planning technology. 3D applications a plus. Experience using interactive technology to view design concepts such as augmented reality, virtual reality and other visualization tools. Willing and capable of learning new technologies.", "preferred": "Not specified"}, "skills": ["Interior Design", "Sales Techniques", "Customer Service", "Social Media Marketing", "Communication Skills", "Project Management", "Teamwork"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3915083039"}