{"jobTitle": "SAP Master Data Analyst (Hybrid)", "company": {"name": "Lakeshore Learning Materials", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "General Business", "industry": "Consumer Goods", "description": "<strong>Company Description<br/><br/></strong>At Lakeshore, we create innovative learning materials and world-class guest experiences for teachers, parents and children. Since 1954, we’ve grown into a global community—with a thriving e-commerce business, multiple catalogs, 60+ retail stores, a peerless national sales force, plus international offices that support our preeminent supply chain division. But today we’re working better, smarter and faster than ever—and setting our sights even higher. We’re building an infrastructure designed for scalability, embracing data-driven decision-making and using technology to improve efficiency and ensure the best tools for the best work. Most importantly, we continue to invest in a diverse team of inquisitive top talent who fuel each other’s passions and curiosity, take risks, try new things, and believe that every new day brings opportunities for growth<br/><br/><strong>Job Description<br/><br/></strong><strong>We are seeking a SAP Master Data Analyst to join our team. </strong>In this role, you will be responsible for the creation, validation, and maintenance of SAP data records. You will ensure the precision and integrity of organizational data, diligently adhering to established data governance rules. You will actively engage in building comprehensive documentation to streamline and enhance the workflow processes within the Master Data team. You will support the team's mission to maintain data accuracy, uphold data standards and foster continuous improvement within master data management (MDM) practices.<br/><br/><strong>A day in the office looks like this: <br/><br/></strong><ul><li>Providing guidance on MDM reporting and data extraction needs, including reviewing GUI table access. Building and maintaining processes and workflows to facilitate efficient data reporting </li><li>Providing knowledge of Fiori and GUI tables for creating and implementing changes related to all MDM activities</li><li>Maintaining Request Templates and create comprehensive documentation for all relevant MDM Fiori Tiles, ensuring consistency and accessibility </li><li>Documenting all MDM scenarios and establish RACI (Responsible, Accountable, Consulted, Informed) matrices to clarify roles and responsibilities </li><li>Monitoring project statuses and effectively communicate ticket statuses to stakeholders </li><li>Continuously evaluating and improving MDM processes, streamlining workflows and enhancing efficiency <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Got the skills and experience? Here’s what we’re looking for:<br/><br/></strong><ul><li>2 years of experience in SAP MDM</li><li>SAP Winshuttle experience a plus </li><li>SAP expertise: knowledge of SAP modules and functions relevant to master data management,</li><li>Data integration: experience in integrating master data across different systems, ensuring consistency and accuracy through data mapping, transformation and validation processes </li><li>Data quality management: Experience in establishing data quality standards, monitoring data quality and implementing data cleansing processes </li><li>Data governance: Understanding of data governance principles, policies and practices to</li><li>Documentation: Proficiency in documenting data processes, workflows, data dictionaries and standard operating procedures </li><li>Problem-solving: Aptitude for identifying complex data issues and developing effective solutions, often in collaboration with cross-functional teams </li><li>Attention to detail: Strong focus on accuracy and precision when managing critical data elements </li><li>Communication: Skilled at conveying technical information clearly to both technical and nontechnical stakeholders, and actively listening to gather requirements and address concerns </li><li>Collaboration: Ability to work seamlessly with various teams, departments and stakeholders to achieve common data-related objectives </li><li>Change management: Skilled at planning, organizing and executing data management projects within specified timelines and budgets <br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong>And here’s our end of the bargain! <br/><br/></strong><ul><li>Salary: $70,000-$80,000 with an annual bonus of up to 10%</li><li>Paid leave for new parents to support work/life balance and family bonding</li><li>Excellent medical/dental and vision coverage—EPO, PPO and HSA</li><li>401(k) retirement plan with company contribution (because you will retire someday)</li><li>Flexible benefits—choose what you like, ignore the rest</li><li>On-site preschool for our employees’ children</li><li>On-site employee gym for all levels/fitness needs</li><li>Generous employee discount on products that make you smarter</li><li>Casual dress…and we really mean it<br/><br/></li></ul>At Lakeshore, we know our diversity makes us stronger, and when everyone feels included and valued, we all win. We strive to embrace our differences and create an intentionally diverse and inclusive community that is representative of the teachers, families and children we serve.<br/><br/>We know we couldn’t do the extraordinary things we’re doing without the people on our team. Thanks to the passion and enthusiasm of this spectacular group, Lakeshore is more than a great place to work—it’s a great experience to be part of. Day in and day out, we give everything we’ve got to create products that instill a sense of wonder and foster a true love of learning. To help maintain this high bar for success, we’re constantly on the lookout for people to join us. So if you’re a down-to-earth professional who shares our desire for making a difference, we’d love to hear from you.<br/><br/>To learn more about Lakeshore, visit www.lakeshorelearning.com/careers <br/><br/><strong>Equal Employment Opportunity Policy<br/><br/></strong>People are selected to become members of the Lakeshore family based on skill, merit and mind-boggling talent—not based on race, color, creed, sexual orientation, gender or gender identity, marital status, domestic partnership status, military status, religion, age, national origin, ancestry, alienage, AIDS or AIDS-related complex status, genetic information, predisposition or carrier status, status as a victim of domestic violence, physical or mental disability, or any other characteristic protected by applicable law. If things aren’t equal, we all lose.<br/><br/>To learn about how we collect and use Applicant information, please visit our Employee/Applicant Privacy Policy. INDRLL11", "responsibilities": "Providing guidance on MDM reporting and data extraction needs, including reviewing GUI table access. Building and maintaining processes and workflows to facilitate efficient data reporting Providing knowledge of Fiori and GUI tables for creating and implementing changes related to all MDM activities Maintaining Request Templates and create comprehensive documentation for all relevant MDM Fiori Tiles, ensuring consistency and accessibility Documenting all MDM scenarios and establish RACI (Responsible, Accountable, Consulted, Informed) matrices to clarify roles and responsibilities Monitoring project statuses and effectively communicate ticket statuses to stakeholders Continuously evaluating and improving MDM processes, streamlining workflows and enhancing efficiency", "qualifications": {"required": "2 years of experience in SAP MDM SAP Winshuttle experience a plus SAP expertise: knowledge of SAP modules and functions relevant to master data management, Data integration: experience in integrating master data across different systems, ensuring consistency and accuracy through data mapping, transformation and validation processes Data quality management: Experience in establishing data quality standards, monitoring data quality and implementing data cleansing processes Data governance: Understanding of data governance principles, policies and practices to Documentation: Proficiency in documenting data processes, workflows, data dictionaries and standard operating procedures Problem-solving: Aptitude for identifying complex data issues and developing effective solutions, often in collaboration with cross-functional teams Attention to detail: Strong focus on accuracy and precision when managing critical data elements Communication: Skilled at conveying technical information clearly to both technical and nontechnical stakeholders, and actively listening to gather requirements and address concerns Collaboration: Ability to work seamlessly with various teams, departments and stakeholders to achieve common data-related objectives Change management: Skilled at planning, organizing and executing data management projects within specified timelines and budgets", "preferred": null}, "skills": ["SAP MDM", "SAP Winshuttle", "SAP", "Data Integration", "Data Quality Management", "Data Governance", "Documentation", "Problem-solving", "Attention to detail", "Communication", "Collaboration", "Change management"], "postedDate": "3 months ago", "applicationDeadline": null, "benefits": "Salary: $70,000-$80,000 with an annual bonus of up to 10% Paid leave for new parents to support work/life balance and family bonding Excellent medical/dental and vision coverage—EPO, PPO and HSA 401(k) retirement plan with company contribution (because you will retire someday) Flexible benefits—choose what you like, ignore the rest On-site preschool for our employees’ children On-site employee gym for all levels/fitness needs Generous employee discount on products that make you smarter Casual dress…and we really mean it", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3916472283"}