{"jobTitle": "Security Engineer", "company": {"name": "Artech L.L.C.", "location": "Downey, CA"}, "location": "Downey, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "<strong>Position Details<br/><br/></strong><strong>Job Title: Security Engineer<br/><br/></strong><strong>Duration: 12 months contract <br/><br/></strong><strong>Location: </strong><strong>Remote<br/><br/></strong><strong>Job ID: #24-09887<br/><br/></strong><strong>Position Description<br/><br/></strong><ul><li>A Security Engineer serves as the security engineer of complex technology implementations in a product-centric environment; is comfortable with bridging the gap between legacy development or operations teams and working toward a shared culture and vision; works to ensure developers create the most secure systems while enhancing the privacy of all system users; and has experience with white-hat hacking and fundamental computer science concepts. </li><li>The Security Engineer will perform security audits, risk analysis, application-level vulnerability testing, and security code reviews; develop and implement technical solutions to help mitigate security vulnerabilities; and conduct research to identify new attack vectors.<br/><br/></li></ul><strong>Skills Required<br/><br/></strong><ul><li>Security Engineers will possess knowledge and experience in safeguarding sensitive data from cyber-attacks.<br/><br/></li></ul><strong>Skills Preferred<br/><br/></strong><ul><li>Skills in Microsoft Active Directory, software deployment, Zscaler, Cisco AMP, Cisco Umbrella, Cisco SecuerX Orchestration, and Cisco Tetration.<br/><br/></li></ul><strong>Experience Required<br/><br/></strong><ul><li>This classification must have a minimum of ten (10) years of experience with developing and implementing technical solutions to help mitigate security vulnerabilities.<br/><br/></li></ul><strong>Experience Preferred<br/><br/></strong><ul><li>One year experience within the last three years working with Dell SecureWorks, Taegis XDR (SecureWorks console) One year experience within the last three years working with Cisco Tetration,</li><li>One year experience within the last three years working with Microsoft Defender Identity (MDI) One year experience within the last three years performing attack simulations within SafeBreach Two years experience within the last three years placing IOC blocks on Cisco FireWalls.<br/><br/></li></ul><strong>Education Required<br/><br/></strong><ul><li>This classification requires the possession of a bachelor’s degree in an IT-related or Engineering field.</li><li>Additional qualifying experience may be substituted for the required education on a year-for-year basis.<br/><br/></li></ul><strong>Best Regards,<br/><br/></strong><strong>Devika Srinivas<br/><br/></strong>Senior Technical Recruiter<br/><br/><strong>Cell:</strong> 325.238.4115 <strong>Office:</strong> 973.507.7599<br/><br/><strong>Email:</strong> Devika.s@artech.com<br/><br/><strong>LinkedIn:</strong> https://www.linkedin.com/in/devika-srinivas-3a96151a3<br/><br/>360 Mt. Kemble Avenue, Suite 2000, Morristown, NJ 07960<br/><br/><strong>Website:</strong> www.artech.com", "responsibilities": "A Security Engineer serves as the security engineer of complex technology implementations in a product-centric environment; is comfortable with bridging the gap between legacy development or operations teams and working toward a shared culture and vision; works to ensure developers create the most secure systems while enhancing the privacy of all system users; and has experience with white-hat hacking and fundamental computer science concepts. The Security Engineer will perform security audits, risk analysis, application-level vulnerability testing, and security code reviews; develop and implement technical solutions to help mitigate security vulnerabilities; and conduct research to identify new attack vectors.", "qualifications": {"required": "This classification must have a minimum of ten (10) years of experience with developing and implementing technical solutions to help mitigate security vulnerabilities.", "preferred": "One year experience within the last three years working with Dell SecureWorks, Taegis XDR (SecureWorks console) One year experience within the last three years working with Cisco Tetration, One year experience within the last three years working with Microsoft Defender Identity (MDI) One year experience within the last three years performing attack simulations within SafeBreach Two years experience within the last three years placing IOC blocks on Cisco FireWalls."}, "skills": ["Microsoft Active Directory", "software deployment", "Zscaler", "Cisco AMP", "Cisco Umbrella", "Cisco SecuerX Orchestration", "Cisco Tetration", "Dell SecureWorks", "Taegis XDR", "Microsoft Defender Identity", "SafeBreach", "Cisco FireWalls"], "postedDate": "4 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3916023975"}