{"jobTitle": "Operations Area Manager (night shift)", "company": {"name": "Precision Castparts", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Aviation & Aerospace", "description": "With more than 120 operations and approximately 20,000 employees worldwide, Precision Castparts Corp. is the market leader in manufacturing large, complex structural investment castings, airfoil castings, forged components, aerostructures and highly engineered, critical fasteners for aerospace applications. In addition, we are the leading producer of airfoil castings for the industrial gas turbine market. We also manufacture extruded seamless pipe, fittings, and forgings for power generation and oil & gas applications; commercial and military airframe aerostructures; and metal alloys and other materials for the casting and forging industries. With such critical applications, we insist on quality and dependability – not just in the materials and products we make, but in the people we recruit.<br/><br/>PCC is relentless in its dedication to being a high-quality, low-cost and on-time producer; delivering the highest value to its customers while continually pursuing strategic, profitable growth.<br/><br/>In 2016, Berkshire Hathaway, led by Chairman and CEO Warren E. Buffett, acquired Precision Castparts Corp.<br/><br/><strong>Job Description<br/><br/></strong><strong>Job Summary:<br/><br/></strong>The Operations Area Manager will deliver results in a multi-shift machining environment and will measure operational performance via metrics to meet the daily, weekly and monthly goals of production. This leadership position will work in a manufacturing machining environment with a multi-lingual work force. The Area Manager will also be responsible for supporting the model cell implementation and supporting other buildings in the model cell roll out. The products are primarily aerospace components for commercial and military aircraft.<br/><br/><strong>Job Function:<br/><br/></strong><ul><li>Analyzes, establishes, and communicates performance standards to all manufacturing supervisors, leads and employees.</li><li>Assists in the development and implementation of new or improved manufacturing methods, set-up reductions, productivity improvements, throughput improvements and variable cost improvements.</li><li>Meets with employees daily, reflecting on problems, solutions, and challenges; thereby creating a culture of continuous improvement and contributing towards becoming a learning organization.</li><li>Implements and coordinates cross training of department employees to insure the elimination of all skill gaps, resulting in a more skilled and adaptable workforce. Insures the completion of required competency forms and certifications, as well as maintains an employee skill matrix.</li><li>Instills and maintains a positive, can-do team atmosphere; holding regular team meetings, assigning team members’ tasks, and coordinating required support services needed. Uses area boards to ensure results.</li><li>Complies with all environmental safe practices and regulations. Conducts EH&amp;S self inspection and safety “huddles” in areas of responsibility.</li><li>Personally supervises the conduct of Root Cause Corrective Action working sessions when safety and quality escapes occur.</li><li>Reviews production orders or schedules to ascertain product data such as types, quantities, and specifications of products and scheduled delivery dates in order to plan department operations.</li><li>Plans production operations, establishing priorities and sequences for manufacturing products.</li><li>Executes manufacturing schedules and coordinates manufacturing activities to ensure production and quality of products meets specifications.</li><li>Reviews production and operating metrics and reports and resolves operational, manufacturing, and maintenance problems to ensure minimum costs and prevent delays.</li><li>Inspects machines and equipment to ensure specific operational performance and optimum utilization. Manages a pro-active Preventive Maintenance program.</li><li>Develops or revises standard operational and working practices and observes workers to ensure compliance with standards.</li><li>Ensures that proper tooling is available for all production machines and product lines; or that material is on hand for the creation or modification of necessary jigs and tooling.</li><li>Resolves employee suggestions and or complaints or submits unsettled employees issues for further action by Director of Manufacturing and Director of Human Resources where and when appropriate.<br/><br/></li></ul><strong>Job Requirements:<br/><br/></strong><ul><li>Must have operational excellence experience</li><li>Must have manufacturing experience, preferably in aerospace</li><li>Knowledge of raw materials, production processes, quality controls, and costs</li><li>Understand/use techniques for effective control of delivered quality, cost, and schedule in the processing of aerospace products</li><li>Knowledge of management principles involved in strategic planning and forecasting including people, material, and equipment resource allocation; corporate and human resource policies and benefits; leadership; teaming; and production methods</li><li>Thorough knowledge of lean manufacturing work area practices including 5-S, Visual Controls, Standard Work, work center metrics, and continuous improvement processes and able to instruct others in these practices</li><li>Motivate, develop, and direct people as they work, identifying the best people for the job</li><li>Proactive communicator who can clearly articulate results and needs across all levels</li><li>Able to establish and communicate clear priorities and to influence others to support and act on those priorities</li><li>Proven ability to manage multiple projects with competing deadlines<br/><br/></li></ul><strong>Education:<br/><br/></strong>Bachelor’s or Master’s Degree in Mechanical, Materials, Industrial or Manufacturing Engineering, or Business Administration. Equivalent experienced considered.<br/><br/><strong>Experience:<br/><br/></strong>5+ years of supervision/leadership experience in a related position. 3+ years’ experience in strong quantifiably focused and metrics driven organization<br/><br/><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br/><br/></em>For informational purposes only, the range of pay for this role is $125100 to $187700 US Dollar (USD) Salaried based on a variety of factors. For informational purposes only, this role is eligible to participate in the Company’s Quarterly Cash Bonus Plan, paid out at the quarterly bonus factor of 2X the Company’s bonus multiple, based on the Company’s performance in the applicable quarter. Employees will receive 120 hours paid time off every year. Employees will also receive 10 paid holidays. Employees (and their families) are eligible to participate in the company's medical, dental, vision, and basic life insurance. Employees are eligible to enroll in the Company’s 401(k) plan.<br/><br/><em>This position requires use of information or access to production processes subject to national security controls under U.S. export control laws and regulations (including, but not limited to the International Traffic in Arms Regulations (ITAR) and the Export Administration Regulations (EAR)). To be qualified to work in this facility, a successful applicant must be a U.S. Person, as defined in those regulations, and able to supply evidence of that qualification prior to starting work or be authorized to receive controlled information under a specific license or permission from the relevant government agency. The U.S. export control regulations define a U.S. person as a U.S. Citizen, U.S. National, U.S. Permanent Resident (i.e. 'Green Card Holder'), and certain categories of Asylees and Refugees.</em>", "responsibilities": "The Operations Area Manager will deliver results in a multi-shift machining environment and will measure operational performance via metrics to meet the daily, weekly and monthly goals of production. This leadership position will work in a manufacturing machining environment with a multi-lingual work force. The Area Manager will also be responsible for supporting the model cell implementation and supporting other buildings in the model cell roll out. The products are primarily aerospace components for commercial and military aircraft.", "qualifications": {"required": "Must have operational excellence experience\nMust have manufacturing experience, preferably in aerospace\nKnowledge of raw materials, production processes, quality controls, and costs\nUnderstand/use techniques for effective control of delivered quality, cost, and schedule in the processing of aerospace products\nKnowledge of management principles involved in strategic planning and forecasting including people, material, and equipment resource allocation; corporate and human resource policies and benefits; leadership; teaming; and production methods\nThorough knowledge of lean manufacturing work area practices including 5-S, Visual Controls, Standard Work, work center metrics, and continuous improvement processes and able to instruct others in these practices\nMotivate, develop, and direct people as they work, identifying the best people for the job\nProactive communicator who can clearly articulate results and needs across all levels\nAble to establish and communicate clear priorities and to influence others to support and act on those priorities\nProven ability to manage multiple projects with competing deadlines", "preferred": "Bachelor’s or Master’s Degree in Mechanical, Materials, Industrial or Manufacturing Engineering, or Business Administration. Equivalent experienced considered.\n5+ years of supervision/leadership experience in a related position. 3+ years’ experience in strong quantifiably focused and metrics driven organization"}, "skills": ["Operational Excellence", "Manufacturing", "Aerospace", "Lean Manufacturing", "5S", "Visual Controls", "Standard Work", "Continuous Improvement", "Leadership", "Communication", "Project Management"], "postedDate": "2 weeks ago", "benefits": "For informational purposes only, the range of pay for this role is $125100 to $187700 US Dollar (USD) Salaried based on a variety of factors. For informational purposes only, this role is eligible to participate in the Company’s Quarterly Cash Bonus Plan, paid out at the quarterly bonus factor of 2X the Company’s bonus multiple, based on the Company’s performance in the applicable quarter. Employees will receive 120 hours paid time off every year. Employees will also receive 10 paid holidays. Employees (and their families) are eligible to participate in the company's medical, dental, vision, and basic life insurance. Employees are eligible to enroll in the Company’s 401(k) plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3916726846"}