{"jobTitle": "Senior Bridge Engineer / Project Manager - Los Angeles, CA", "company": {"name": "David Evans and Associates, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Civil Engineering", "description": "DEA is hiring a Senior Bridge Engineer/Project Manager in our Los Angeles/Orange County area offices to lead bridge design/rehab projects, manage the project and provide technical support and oversight on bridge planning, design, construction, inspection, operations, and maintenance projects. A successful candidate will be able to lead project teams during pursuit, and inception to completion of various projects and task assignments in the role of Task Leader or Project Manager or coordination with other roadway/rail task leader/project manager in the development of the structural engineering tasks. In this role you will perform and/or check structural analyses and develop, or check design calculations using AASHTO, AREMA, Caltrans Bridge Design Practice Manual, and various other design codes for different bridge, transportation, and freight rail and transit structural systems. Additionally, the successful candidate will be expected to effectively mentor junior bridge designers and provide direction to CADD staff. Typical bridge projects will include cast-in-place post-tensioned concrete, precast/prestressed concrete, and segmental concrete bridges, steel girder and truss bridges, for highway, freight rail, and light rail bridges; as well as other transportation and retaining wall structures. Demonstrated knowledge in seismic design of bridges is required. Preferred office locations are Los Angeles or Tustin, but other options are Santa Clarita or Ontario. <br/><br/>Other Duties Include, But Are Not Limited To<br/><br/><ul><li>Identify and pursue bridge design/rehab projects advertised by local jurisdictions within the LA and OC markets.</li><li>Lead and assist in the development of bridge design deliverables including concept reports, advance planning studies, type selection reports, design calculations, construction plans, specifications, estimates, and construction schedules.</li><li>Manage projects to ensure excellence in project execution for on-time, on-budget deliverables of quality that meet, or exceed the industry’s standard of care.</li><li>Checking of engineering calculations, drawings, estimates, specifications, and construction schedule deliverables for accuracy and compliance with contractual requirements</li><li>Provide bridge design leadership and mentorship to junior engineers.</li><li>Manage, perform, and deliver condition inspection and reporting of in-service bridges.</li><li>Manage, development, and check load rating calculations and reports.</li><li>Participate in client and project development teams.</li><li>Lead or Assist other pursuit champions and project managers in the development of proposal documents</li><li>Communicate with client’s and express the client’s needs to project team.<br/><br/></li></ul>Basic Qualifications<br/><br/><ul><li>Bachelor’s Degree in Civil/Structural Engineering</li><li>Minimum of 10+ years of bridge design engineering experience with 5+ years as the PM</li><li>Registered Professional Engineer (PE) in the state of California</li><li>Experience with local public agencies such as City of Los Angeles Bureau of Engineering, Los Angeles County public works, Orange County, or Caltrans</li><li>Proficient in current bridge and structural design software applications such as CSi Bridge/SAP 2000, Midas, RetainPro, LEAP, PGSuper/PGSplice, LPile/Group</li><li>Proficient in Microsoft Office applications such as Excel, Word and Power Point and other general calculation software applications such as MathCAD</li><li>Knowledgeable of AASHTO LRFD bridge design standards and Caltrans design standards</li><li>Ability to communicate and work in a team oriented environment</li><li>Experience managing CAD staff<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Masters degree in Civil/Structural Engineering </li><li>California Structural Engineering (SE) license (not required, but desirable)<br/><br/></li></ul>Benefits<br/><br/><ul><li>Medical, Dental, Vision, Disability and Life Insurance</li><li>Health Savings and Lifestyle Spending Account with employer contribution</li><li>Support for continuing education and training opportunities</li><li>Paid Time Off (PTO)/Holiday Pay</li><li>401k and Employee Stock Ownership Program (ESOP)</li><li>Flexible 9/80 (every other Friday off) work schedule</li><li>Holistic Wellbeing Program with a focus on physical, emotional, financial, career and community health</li><li>Opportunity for growth with support and mentoring to help with professional goals</li><li>Anticipated salary range for this position is $125,000-$250,000 depending on experience and location<br/><br/></li></ul>Transportation Jobs with DEA<br/><br/>The increasing complexities of modern transportation include growing demands, aging infrastructure, rising costs, funding challenges, and environmental concerns. Agencies and communities faced with improving their transportation systems must do more with less. From initial investigations through planning, concept development, final design, and construction, DEA responds with solutions that serve today’s transportation needs while accommodating tomorrow’s growth. Our Transportation Business Unit focuses on four markets; Bridges and Structures, Roads and Highways, Transit and Rail, and Construction Engineering.<br/><br/>Potential office locations include: Los Angeles, CA; Tustin, CA; Ontario, CA; Santa Clarita, CA.", "postedDate": "2 weeks ago", "salary": {"amount": "125,000.00/yr - 250,000.00/yr", "currency": "USD"}, "benefits": "Medical, Dental, Vision, Disability and Life Insurance, Health Savings and Lifestyle Spending Account with employer contribution, Support for continuing education and training opportunities, Paid Time Off (PTO)/Holiday Pay, 401k and Employee Stock Ownership Program (ESOP), Flexible 9/80 (every other Friday off) work schedule, Holistic Wellbeing Program with a focus on physical, emotional, financial, career and community health, Opportunity for growth with support and mentoring to help with professional goals, Anticipated salary range for this position is $125,000-$250,000 depending on experience and location", "qualifications": {"required": "Bachelor’s Degree in Civil/Structural Engineering, Minimum of 10+ years of bridge design engineering experience with 5+ years as the PM, Registered Professional Engineer (PE) in the state of California, Experience with local public agencies such as City of Los Angeles Bureau of Engineering, Los Angeles County public works, Orange County, or Caltrans, Proficient in current bridge and structural design software applications such as CSi Bridge/SAP 2000, Midas, RetainPro, LEAP, PGSuper/PGSplice, LPile/Group, Proficient in Microsoft Office applications such as Excel, Word and Power Point and other general calculation software applications such as MathCAD, Knowledgeable of AASHTO LRFD bridge design standards and Caltrans design standards, Ability to communicate and work in a team oriented environment, Experience managing CAD staff", "preferred": "Masters degree in Civil/Structural Engineering, California Structural Engineering (SE) license (not required, but desirable)"}, "skills": ["Bridge Design", "Project Management", "Structural Analysis", "AASHTO", "AREMA", "Caltrans Bridge Design Practice Manual", "Seismic Design", "Construction Management", "Engineering Calculations", "Construction Plans", "Specifications", "Estimates", "Construction Schedules", "Mentoring", "CAD", "Microsoft Office", "Excel", "Word", "PowerPoint", "MathCAD", "Teamwork", "Client Communication", "Proposal Writing", "Condition Inspection", "Load Rating", "Transportation", "Freight Rail", "Light Rail", "Retaining Walls", "Civil Engineering", "Structural Engineering"], "url": "https://www.linkedin.com/jobs/view/3916143002"}