{"jobTitle": "Administrative Support", "company": {"name": "Rainbow Restoration", "industry": "Consumer Services", "size": "400+ employees", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$36,000.00 - $60,000.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Consumer Services", "description": "Established in 1981, Rainbow International® offers home restoration, commercial restoration and carpet cleaning services through over 400 locations worldwide. We are on a mission to improve the lives of not only our customers, but also our employee family members. Rainbow International hires people who set high standards for themselves and want to \"Live RICH\" with a team that values Respect, Integrity, with Customer focus, while Having fun in the process. We want you on our team! As Administrative Support, you are a key team member supporting the work of management and other staff. You are responsible for clerical, receptionist, bookkeeping, and project-based work to contribute to the day-to-day operations of Rainbow International. Exemplifying our code of values, you show respect and courtesy to all customers and employees. You are self-motivated, self-directed, and enthusiastic. You are driven to project a professional company image through in-person and phone interaction while working cooperatively with others to manage a variety of situations on a day-to-day basis.", "responsibilities": "Receive incoming calls in professional and courteous manner, Call potential customers to explain the company services and solicit business, Assist with the scheduling of services, Notify customers of service call status and follow up with customers after the work is completed, Collect all monies from all sources, Clerical duty as required including customer and job data entry, Perform other duties as required. These duties may include job functions that are outside the scope of normal job duties.", "qualifications": {"required": "Computer literate with proficiency in the use of Microsoft Office (Word, Outlook, Excel) and other computer software, Strong written and verbal communication skills, Detail-oriented with strong data entry and skills, Professional appearance and personality, Team player who can work independently", "preferred": "Experience in Xactware would be helpful, but not mandatory"}, "skills": ["Microsoft Office", "Communication", "Data Entry", "Customer Service", "Teamwork"], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "Benefits package varies by location.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3916231608"}