{"jobTitle": "Account Manager", "company": {"name": "Cinter Career", "industry": "Internet Publishing", "size": "Not specified", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "50K (DOE) + Full Benefits", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "We are seeking an Account Manager to assist the Agency in the execution of selling and renewing business as well as managing ongoing services to the current clients. Will be responsible for developing and servicing accounts for any Producers that may be assigned.", "responsibilities": "Adherence to Agency’s Core Values & Code of Ethics. Know and follow the Agency’s procedures and data management system. Know the products and services provided by the Agency. Know Agency markets and their appetites. Know the products and rating plans offered by the carriers represented by the Agency. Assist in the renewal & marketing process to ensure the best possible solutions are delivered to clients in a high quality and timely manner. Mentor team members through continuous learning, transparent feedback, and talent development. Coordinate, implement, and monitor the Agency and carrier services sold to the customer. Maintain positive relationships with the customers. Work with the Client/Producer to assemble, market and place coverage as necessary including but not limited to, gathering all underwriting information, preparing proposals, completing applications, obtaining signatures, collecting payment and all necessary follow ups. Attending to clients’ needs by producing binders, certificates, policies, endorsements, and other related items. Day‐to‐day account management of assigned client accounts. Prepare summaries of insurance, schedules, and proposals as needed for account review. Markets renewals, contacts clients, updates applications, manages market responses and timeline, and handles other renewal activities in coordination with the producer’s needs. Renews policies following agency standards; verifies each renewal’s accuracy; ensures that all renewals are processed. Reviews audits of policies; verifies accuracy and facilitates corrections, as needed, between client and carrier. Process customer requests, changes, cancellations, requests for binders, premium breakdowns, policy issuance and certificates of insurance. Maintains and updates files in agency management system with relevant correspondence and client documents. Assists clients in submitting first reports of claims as needed and follows up on claims status to keep insureds informed and working in coordination with the Risk Management team. Review and analyze insured’s contracts and COI requests regarding insurance requirements and program compliance.", "qualifications": {"required": "Relevant Property & Casualty License", "preferred": "1+ years of Personal Lines experience. Understanding basic personal insurance coverage and premium rating methods. Be able to communicate in Japanese both in speaking and writing."}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Full Benefits", "remoteWork": "Hybrid (Cypress, CA) or Remote (optional)", "url": "https://www.linkedin.com/jobs/view/3916476458"}