{"jobTitle": "Senior Information Technology Security Architect", "company": {"name": "Artech L.L.C.", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Downey, CA"}, "location": "Remote, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "Position Details\n\nJob Title: Senior Information Technology Security Architect\n\nDuration: 12 months contract\n\nLocation: Remote, CA\n\nJob ID: 24-09313\n\nSkills Preferred\n\n- Managed at least two data centers, including architecting, designing, implementing, and managing security for highly available, resilient systems (physical, virtual, cloud).\n- Analyzing information security systems and applications, including recommending and developing security controls for data integrity, to protect information against unauthorized modification and data loss prevention.\n- Defining the requirements, principles, and models that guide technology decisions for the enterprise, and designing security systems with specifications of equipment, software, and infrastructure.\n- Remediation of security vulnerabilities Be able to Perform security design/architecture reviews, code reviews, and penetration tests of large applications, systems, and/or networks.\n- Assess Critical Infrastructure Protection (CIP) controls against existing network implementations (i.e., gap analysis).\n\nExperience Preferred:\n\n- Three (3) years as a Senior Information Technology Security Architect and two (2) years in a leadership role.\n- Three (3) years’ experience in the last five (5) years as an IT Security Incident Response Manager, supporting a complex enterprise security environment for large public or private organizations.\n- Three (3) years of experience in the past five (5) years as an IT Security Incident Response Manager, supporting Enterprise Multi-Tenant environment, including responding, containing, remediating, and reporting on the infrastructure connecting to a large private or public organization and Public Cloud Providers, such as AWS, Azure and/or GCP.\n\nEducation Preferred:\n\n- One or more of the following professional certifications Qualified Security Assessor (QSA), Certified Information Systems Auditor (CISA), Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM), Certified Information Privacy Professional (CIPP), GIAC Certified Incident Handler, (GCIH) or GIAC Network Forensic Analyst, CCIE.\n- Bachelor’s degree from an accredited college in Technology technology-related discipline (e.g. Computer Science, Engineering, Information Systems, etc.) or equivalent experience/combined education.", "responsibilities": "Managed at least two data centers, including architecting, designing, implementing, and managing security for highly available, resilient systems (physical, virtual, cloud).", "qualifications": {"required": "Three (3) years as a Senior Information Technology Security Architect and two (2) years in a leadership role.", "preferred": "One or more of the following professional certifications Qualified Security Assessor (QSA), Certified Information Systems Auditor (CISA), Certified Information Systems Security Professional (CISSP), Certified Information Security Manager (CISM), Certified Information Privacy Professional (CIPP), GIAC Certified Incident Handler, (GCIH) or GIAC Network Forensic Analyst, CCIE."}, "skills": ["Information Security", "Data Integrity", "Security Architecture", "Incident Response", "Cloud Security"], "postedDate": "4 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3916027251"}