{"jobTitle": "Production/Warehouse Supervisor", "company": {"name": "Bio-Rad Laboratories", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "66,560.00/yr - $90,300.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Biotechnology Research", "description": "As a Production Supervisor, you will supervise the Work-In-Progress (WIP) Department to oversee warehousing teams in two facilities. This position plans and assigns work to direct labor personnel, implements policies and procedures, and recommends improvements in production methods, equipment, operating procedures and working conditions within established delivery, quality, compliance, safety, budget and cost standards.<br/><br/>How You'll Make An Impact<br/><br/>\n<ul><li>Manages a team of warehouse associates engaged in staging, put away, cycle count, scrapping and sample prep activities.</li><li>Work is monitored by the production manager.</li><li>Supervises team according to established processes, techniques and policies.</li><li>Schedules, assigns and manages the daily activities of a team.</li><li>Monitors employee performance and prepares and communicates performance reviews.</li><li>Coaches and trains personnel in their duties.</li><li>Assists in the development of documentation procedures.</li><li>Responsible for meeting key metrics such as production schedules, quality standards, production yields, cost targets and the like.</li><li>Monitors processes and makes adjustment to stay within schedule, budgets and established targets.</li><li>Participates in a variety of standing meetings.</li><li>Communicates priorities, performance results and objectives to team members.</li><li>Troubleshoots production issues and escalates as appropriate.</li><li>Participates on project teams as needed.</li><li>Interviews and selects personnel.</li><li>Makes salary recommendations based upon individual performance.<br/><br/></li></ul>What You Bring<br/><br/>\n<ul><li> High School diploma or equivalent. </li><li>Associate's degree equivalent experience preferred.</li><li>Forklift certification and standard class C driver’s license required. </li><li>3-5 years warehousing/logistics experience in an instrument or chemical processing environment. </li><li>0-2 years production lead experience is a plus. </li><li>Familiarity with assigned products. </li><li>Proven analytical, communication, computer and some project management experience.</li><li>Basic knowledge of inventory management, demand flow technology, production processes and related technologies. </li><li>Relevant certifications or training a plus. </li><li>Basic knowledge of regulatory requirements.<br/><br/></li></ul>Total Rewards Package: At Bio-Rad, we’re empowered by our purpose and recognize that our employees are as well. That’s why we offer a competitive and comprehensive Total Rewards Program that provides value, quality, and inclusivity while satisfying the diverse needs of our evolving workforce. Bio-Rad's robust offerings serve to enrich the overall health, wealth, and wellbeing of our employees and their families through the various stages of an employee’s work and life cycle.<br/><br/>Benefits: We’re proud to offer a variety of options, including competitive medical plans for you and your family, free HSA funds, a new fertility offering with stipend, group life and disability, paid parental leave, 401k plus profit sharing, an employee stock purchase program, a new upgraded and streamlined mental health platform, extensive learning and development opportunities, education benefits, student debt relief program, pet insurance, wellness challenges and support, paid time off, Employee Resource Groups (ERG’s), and more!<br/><br/>Compensation: The estimated base salary range for this position is $66,560 - $90,300 at the time of posting. Actual compensation will be provided in writing at the time of offer, if applicable, and is based on several factors we believe fairly and accurately impact compensation, including geographic location, experience, knowledge, skills, abilities, and other job permitted factors. This position is also eligible for a variable annual bonus, which is dependent upon achievement of your individual objectives and Company performance.<br/><br/>Who We Are: For 70 years, Bio-Rad has focused on advancing the discovery process and transforming the fields of science and healthcare. As one of the top five life science companies, we are a global leader in developing, manufacturing, and marketing a broad range of high-quality research and clinical diagnostic products. We help people everywhere live longer, healthier lives. Recently voted a Best Place to Work, Bio-Rad offers a unique employee experience with collaborative teams that span the globe. Here, you are supported by leadership to build your career and are empowered to drive change that makes an impact you can see.<br/><br/>EEO Statement: Bio-Rad is an Equal Employment Opportunity/Affirmative Action employer, and we welcome candidates of all backgrounds. Veterans, people with physical or mental disabilities, and people of all race, color, sex, sexual orientation, gender identity, religion, national origin and citizenship status are encouraged to apply.<br/><br/>Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.<br/><br/>Fraud Alert: Bio-Rad has received reports of individuals posing as Bio-Rad recruiters to obtain information, including personal and financial, from applicants. Beware of these fake “recruiters” and job scams. Click here for more information on this scam and how to avoid it.<br/><br/>Legal Entity: (USA_1000)Bio-Rad Laboratories, Inc.<br/><br/>", "responsibilities": "As a Production Supervisor, you will supervise the Work-In-Progress (WIP) Department to oversee warehousing teams in two facilities. This position plans and assigns work to direct labor personnel, implements policies and procedures, and recommends improvements in production methods, equipment, operating procedures and working conditions within established delivery, quality, compliance, safety, budget and cost standards.<br/><br/>How You'll Make An Impact<br/><br/>\n<ul><li>Manages a team of warehouse associates engaged in staging, put away, cycle count, scrapping and sample prep activities.</li><li>Work is monitored by the production manager.</li><li>Supervises team according to established processes, techniques and policies.</li><li>Schedules, assigns and manages the daily activities of a team.</li><li>Monitors employee performance and prepares and communicates performance reviews.</li><li>Coaches and trains personnel in their duties.</li><li>Assists in the development of documentation procedures.</li><li>Responsible for meeting key metrics such as production schedules, quality standards, production yields, cost targets and the like.</li><li>Monitors processes and makes adjustment to stay within schedule, budgets and established targets.</li><li>Participates in a variety of standing meetings.</li><li>Communicates priorities, performance results and objectives to team members.</li><li>Troubleshoots production issues and escalates as appropriate.</li><li>Participates on project teams as needed.</li><li>Interviews and selects personnel.</li><li>Makes salary recommendations based upon individual performance.<br/><br/></li></ul>", "qualifications": {"required": "High School diploma or equivalent. \nForklift certification and standard class C driver’s license required. \n3-5 years warehousing/logistics experience in an instrument or chemical processing environment. \nProven analytical, communication, computer and some project management experience.\nBasic knowledge of inventory management, demand flow technology, production processes and related technologies. \nBasic knowledge of regulatory requirements.", "preferred": "Associate's degree equivalent experience\n0-2 years production lead experience\nRelevant certifications or training"}, "skills": ["Warehousing", "Logistics", "Production", "Inventory Management", "Demand Flow Technology", "Project Management", "Analytical Skills", "Communication Skills", "Computer Skills", "Forklift Certification", "Regulatory Requirements"], "postedDate": "7 hours ago", "benefits": "At Bio-Rad, we’re empowered by our purpose and recognize that our employees are as well. That’s why we offer a competitive and comprehensive Total Rewards Program that provides value, quality, and inclusivity while satisfying the diverse needs of our evolving workforce. Bio-Rad's robust offerings serve to enrich the overall health, wealth, and wellbeing of our employees and their families through the various stages of an employee’s work and life cycle.<br/><br/>Benefits: We’re proud to offer a variety of options, including competitive medical plans for you and your family, free HSA funds, a new fertility offering with stipend, group life and disability, paid parental leave, 401k plus profit sharing, an employee stock purchase program, a new upgraded and streamlined mental health platform, extensive learning and development opportunities, education benefits, student debt relief program, pet insurance, wellness challenges and support, paid time off, Employee Resource Groups (ERG’s), and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3916884023"}