{"jobTitle": "Operations Coordinator", "company": {"name": "Greatness Media", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "DREAM BIGGER. LIVE BETTER. MAKE AN IMPACT.<br/><br/>The School of Greatness inspires conscious achievers around the world to live greater in their life, love deeper in their relationships and leave a positive impact on their world. We pride ourselves on creating some of the most inspiring interviews, content and media in the world to help people achieve their potential, destroy self-doubt and chase their dreams. Our vision is a connected world of people who are living a life that they love. As part of that pursuit WE PRACTICE WHAT WE PREACH! Live what we say. Over-deliver on our promises and operate with the highest integrity. Founded in 2013 in Los Angeles, our growing team reaches around the world. What started as a curiosity to interview one mentor for a few people to learn from, has grown to 250+ million downloads, over 20+ million social media followers and subscribers, and hundreds of thousands of students engaged in our books, courses, coaching programs, events and more.<br/><br/>HERE’S THE RUNDOWN:<br/><br/>The Operations Coordinator will provide comprehensive support and high level hospitality for executives and studio guests. The ideal candidate has exceptional organization and time management abilities. You have excellent communication skills and an interest in growing your marketing experience. To be successful in this role, you must be able to remain calm under pressure while juggling multiple tasks.<br/><br/>HOW YOU’LL CONTRIBUTE:<br/><br/><ul><li>Manage daily office duties such as scheduling, communications, shipments, supplies and equipment, errands</li><li>Provide high profile podcast studio guests with above and beyond hospitality</li><li>Support the in-studio podcast operations with on demand requests</li><li>Maintain the cleanliness and organization of podcast studio, green room and office spaces</li><li>Manage the schedule and logistics of a high volume of internal and external video calls</li><li>Prepare comprehensive travel arrangements with the ability to make frequent and last minute changes</li><li>Provide personal assistance to executives while maintaining high discretion and confidentiality</li><li>Participate in regularly scheduled weekly meetings</li><li>Work closely with the marketing team to provide administrative support for implementation of marketing strategies across all Greatness Media products and platforms</li><li>Assist with projects such as events, marketing, and production</li><li>Provide in office point support for remote team</li><li>Responsible for the growth and results of any company owned and/or operated media, product, channel and/or platform to be accountable to meet established goals</li><li>Other duties as assigned<br/><br/></li></ul>YOUR ABILITIES AND EXPERTISE:<br/><br/><ul><li>3 years prior experience supporting high-level executives</li><li>Experience in marketing, hospitality or a startup preferred</li><li>Bachelor’s degree required</li><li>Must be available to support in office Monday through Friday 9am - 6pm PT</li><li>Extremely detail oriented with excellent written and verbal communication skills</li><li>Exceptional organizational and time-management skills, with the ability to prioritize tasks and meet deadlines</li><li>Monday.com or other work management platform experience preferred</li><li>Thrives in a fast paced environment with a wide variety of projects</li><li>A positive, growth-minded attitude and desire to work with a team that is changing the world!<br/><br/></li></ul>THE TEAM YOU’LL COLLABORATE WITH:<br/><br/><ul><li>The Operations Coordinator reports directly to the Senior Manager of Operations. You will work closely with all of the Greatness Media teams<br/><br/></li></ul>WHERE GREATNESS IS INSPIRED:<br/><br/><ul><li>All things creative take place at The School of Greatness studio in Century City just next to Beverly Hills<br/><br/></li></ul>WHEN THE GREATNESS HAPPENS:<br/><br/><ul><li>The typical work schedule is Monday – Friday, 9AM - 6PM and on call as needed for evening and weekend executive travel communications support<br/><br/></li></ul>Powered by JazzHR<br/><br/>DLiY7xHBIo", "postedDate": "3 months ago", "qualifications": {"required": "3 years prior experience supporting high-level executives, Experience in marketing, hospitality or a startup preferred, Bachelor’s degree required, Must be available to support in office Monday through Friday 9am - 6pm PT, Extremely detail oriented with excellent written and verbal communication skills, Exceptional organizational and time-management skills, with the ability to prioritize tasks and meet deadlines, Monday.com or other work management platform experience preferred, Thrives in a fast paced environment with a wide variety of projects, A positive, growth-minded attitude and desire to work with a team that is changing the world!"}, "skills": ["Marketing", "Hospitality", "Startup", "Time Management", "Communication", "Organization", "Monday.com", "Project Management"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3917125704"}