{"jobTitle": "Insomniac Clubs - General Manager, Los Angeles", "company": {"name": "Insomniac Events", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "90,000.00 - 110,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "description": "<strong>Job Summary<br/><br/></strong><strong>WHO ARE YOU? <br/><br/></strong>Do you enjoy venue management? We are looking for a highly motivated General Manager who is passionate and motivated, resourceful, and innovative, entrepreneur and forward thinking!<br/><br/><strong>WHO ARE WE? <br/><br/></strong>Insomniac’s West Coast Clubs Division is focused on creating a best-in-class experience for our Headliners. Our expanding roster of club partners includes some of the world's top venues, delivering performances from globally renowned DJs backed by top-notch sound and visuals. The diverse calendar of events celebrates the electronic dance music community and culture, offering an endless range of experiences. Insomniac’s West Coast Clubs Division includes venues such as Exchange, Academy LA, Time Nightclub, Bloom, and Nova SD.<br/><br/><strong>THE ROLE<br/><br/></strong>The General Manager at our Los Angeles nightclubs is responsible for all aspects of the entertainment, venue and business operations at 1 of our Los Angeles based nightclubs. This is not a remote position. This position is located at the club and required to travel to various office and venue locations as needed.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Venue Development &amp; Management</li><ul><li>Clearly communicate performance expectations to direct and in direct reports while providing constructive, developmental and consistent feedback</li><li>Oversee and manage performance conversations with direct reports and other members of management timely and effectively</li><li>Set realistic and attainable goals for department heads and provides encouragement and direction</li><li>Prepare timely and productive feedback</li><li>Consult with Senior Management about compensation decisions to ensure decisions are made with parameters of company compensations program</li><li>Ensure that department heads are consistently providing feedback and development to team members</li></ul><li>People Management &amp; Development</li><ul><li>Oversee all management discipline and terminations with HR/Senior Management</li><li>Respond to misconduct/policy violations immediately, consistently and in accordance with company procedures and through investigations and gathering of information</li><li>Follow all company procedures on terminations, including consulting with HR/Senior Management in advance of all terminations, in a professional, unemotional, and respectful manner and ensure all management act the same</li></ul><li>Compliance &amp; Workplace Standards</li><ul><li>Facilitate productive and concise meetings while ensuring positive interaction among all participants, providing the opportunity for voices to be heard</li><li>Encourage open and candid discussions among teams while encouraging debate and positive confrontation among teams</li><li>Shares useful information with other venues and with home office</li><li>Responds promptly to all emails, voicemails or calls from staff, other members of management or home office</li></ul><li>Overall Venue Leadership</li><ul><li>Creates culture and character for venue and work environment through their own conduct as well as by consistent awareness of actions of all managers</li><li>Act as resource for entire venue while ensuring all team members have compassion and empathy forum to raise concerns</li><li>Communicate in a compassionate, yet fair and consistent, manner to all individuals</li><li>Create, inspire and encourage synergy between all venue departments, mediates and resolves disputes and takes an active leadership role in all venue emergencies</li><li>Create, encourage and enforce of and ensure compliance with all company-wide policies and standards</li><li>Partner with Counsel on all venue litigation matters, ensure that all venue permits, certificates and licenses are maintained, up to date and posted as required by law</li><li>Recruit, hire, train, onboard, train and coach various team members</li></ul><li>Talent Relations</li><ul><li>Understands music industry trends, partners with talent buyer(s) in reaching decisions regarding talent; provides direction to and manages Talent Buyer in selecting and booking talent while analyzing the financial results of the different types of talent choices</li><li>Ensures that needs of artists and industry representatives are met, and the artists receive excellent experience in playing at our venue<br/></li></ul></ul><strong>Qualifications<br/><br/></strong><ul><li>8+ years experience a general manager or operations manager in live events and/or clubs or hospitality industry</li><li>Degree in hospitality, business management, or marketing or related experience</li><li>8+ years experience of people and team management</li><li>Proficient in budgeting, reconciling and analyzing event operations excel spreadsheets</li><li>Responsible for Alcohol Awareness Training Certification or Equivalent</li><li>Flexible schedule with the willingness and ability to work nights, weekends and holidays<br/><br/></li></ul><strong>WORK ENVIRONMENT <br/><br/></strong><ul><li>Must be able to tolerate loud noise levels &amp; busy environments when at venues</li><li>May work in drastic temperature climates when at venues</li><li>Must be willing to travel to work during holidays, evening and weekend hours, as required, to meet deadlines<br/><br/></li></ul>Applicants for employment in the U.S. must possess work authorization, which does not require sponsorship by Exchange for a visa.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/></strong>Exchange strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>Exchange recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Insomniac may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms.<br/><br/>Hiring Salary Range: $90,000.00 - $110,000.00 USD<br/><br/><em>Please note that the compensation information provided is a good faith estimate for this position only and is provided pursuant to the California Salary Transparency in Job Advertisements Law. It is estimated based on what a successful California applicant might be paid. It assumes that the successful candidate will be in California or perform the position from California. Similar positions located outside of California will not necessarily receive the same compensation. </em>Exchange<em> takes into consideration a candidate’s education, training, and experience, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the California Law, a potential new employee’s salary history will not be used in compensation decisions.</em>", "responsibilities": "<ul><li>Venue Development &amp; Management</li><ul><li>Clearly communicate performance expectations to direct and in direct reports while providing constructive, developmental and consistent feedback</li><li>Oversee and manage performance conversations with direct reports and other members of management timely and effectively</li><li>Set realistic and attainable goals for department heads and provides encouragement and direction</li><li>Prepare timely and productive feedback</li><li>Consult with Senior Management about compensation decisions to ensure decisions are made with parameters of company compensations program</li><li>Ensure that department heads are consistently providing feedback and development to team members</li></ul><li>People Management &amp; Development</li><ul><li>Oversee all management discipline and terminations with HR/Senior Management</li><li>Respond to misconduct/policy violations immediately, consistently and in accordance with company procedures and through investigations and gathering of information</li><li>Follow all company procedures on terminations, including consulting with HR/Senior Management in advance of all terminations, in a professional, unemotional, and respectful manner and ensure all management act the same</li></ul><li>Compliance &amp; Workplace Standards</li><ul><li>Facilitate productive and concise meetings while ensuring positive interaction among all participants, providing the opportunity for voices to be heard</li><li>Encourage open and candid discussions among teams while encouraging debate and positive confrontation among teams</li><li>Shares useful information with other venues and with home office</li><li>Responds promptly to all emails, voicemails or calls from staff, other members of management or home office</li></ul><li>Overall Venue Leadership</li><ul><li>Creates culture and character for venue and work environment through their own conduct as well as by consistent awareness of actions of all managers</li><li>Act as resource for entire venue while ensuring all team members have compassion and empathy forum to raise concerns</li><li>Communicate in a compassionate, yet fair and consistent, manner to all individuals</li><li>Create, inspire and encourage synergy between all venue departments, mediates and resolves disputes and takes an active leadership role in all venue emergencies</li><li>Create, encourage and enforce of and ensure compliance with all company-wide policies and standards</li><li>Partner with Counsel on all venue litigation matters, ensure that all venue permits, certificates and licenses are maintained, up to date and posted as required by law</li><li>Recruit, hire, train, onboard, train and coach various team members</li></ul><li>Talent Relations</li><ul><li>Understands music industry trends, partners with talent buyer(s) in reaching decisions regarding talent; provides direction to and manages Talent Buyer in selecting and booking talent while analyzing the financial results of the different types of talent choices</li><li>Ensures that needs of artists and industry representatives are met, and the artists receive excellent experience in playing at our venue<br/></li></ul></ul>", "qualifications": {"required": "<ul><li>8+ years experience a general manager or operations manager in live events and/or clubs or hospitality industry</li><li>Degree in hospitality, business management, or marketing or related experience</li><li>8+ years experience of people and team management</li><li>Proficient in budgeting, reconciling and analyzing event operations excel spreadsheets</li><li>Responsible for Alcohol Awareness Training Certification or Equivalent</li><li>Flexible schedule with the willingness and ability to work nights, weekends and holidays<br/><br/></li></ul>", "preferred": null}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3917690288"}