{"jobTitle": "Assistant Plant Manager for Industrial Manufacturer", "company": {"name": "Angelus Block Co., Inc.", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "<strong>Job Description<br/><br/></strong><strong>Position title: Assistant Plant Manager<br/><br/></strong><strong>Reports to: Plant Manager<br/><br/></strong><strong>Department: Plant Operations<br/><br/></strong><strong>Locations: Orange<br/><br/></strong><strong>Job Classification: Salaried Exempt<br/><br/></strong><ul><li>THIS IS A FULL-TIME DIRECT HIRE POSITION. </li><li>1ST SHIFT AVAILABLE</li><li>FREE MEDICAL BENEFITS for employees and qualified family members- Effective after 90th DAY. <br/><br/></li></ul><strong>POSITION SCOPE:<br/><br/></strong>Assists the Plant Manager in achieving plant metrics of safety, quality, production output, labor &amp; overhead expenditures, and customer order fulfillment. Makes sure the plant follows all regulatory and statutory requirements, and operation employees follow all Angelus company policies. Takes leadership role and ensures all employees are trained and evaluated on all relevant policies, procedures, and SOPs. Under the direction of the Plant Manager evaluates, recommends, and implements applications of appropriate manufacturing technologies and equipment. Assumes leadership role and assists Lead persons in the day-to-day safety, quality, production, maintenance, materials, compliance, training, and auditing activities.<br/><br/><strong>PRIMARY DUTIES &amp; RESPONSIBILITIES:<br/><br/></strong><ul><li>Ensures production performance to meet safety, quality, cost, and technology standards to fill customers’ needs while maximizing productivity standards. </li><li>Schedules human and technical resources to produce to plan within all budgetary limitations. </li><li>Takes leadership role in implementation and maintenance of Lean, 5S, and other manufacturing initiatives at the direction of the Plant Manager. </li><li>Participates in the hiring, orientation, and training for new production employees. </li><li>Provides leadership and takes initiative to ensure all processes, activities and use of equipment is performed within a safe, clean, and organized environment. </li><li>Be constantly aware of the process/workplace safety. Notify management to potential issues or shortcomings and provide solutions that are process friendly, cost effective and protect our employees. </li><li>Responsible to ensure all production data input is transacted accurately and timely. </li><li>Coordinates with other departmental managers to ensure operations are following all regulatory and statutory requirements. </li><li>Creates an environment which supports teamwork and group participation; develops, coordinates, and motivates departmental inter-organizational teams. </li><li>Assess employee skills and performance to identify training and remedial development needs; invests in employee career development through training and work assignments; assists the Plant Manager in decisions on staff promotions. </li><li>Is a readily available resource and takes the leadership to solve production problems that impact safety, quality, output, resources, costs, and product availability. </li><li>Under the direction of the Plant Manager, coordinates scheduling and activities for new product development, special projects, and plant upgrades to meet scheduled timelines. </li><li>Provide support to improve process, and/or products. </li><li>Support plant management and maintenance in the selection of proper components, engineered materials, and wear parts for maximum effectiveness and minimal cost. </li><li>Be constantly aware of the process/workplace safety. Provide solutions to any and all discoveries of potential hazards and ensure the safety of our employees. </li><li>Identify, resource and work with outside vendors as required. </li><li>All other duties as requested or assigned. <br/><br/></li></ul><strong>JOB-RELATED QUALIFICATION STANDARDS:<br/><br/></strong>Technical Skills &amp; Knowledge<br/><br/><ul><li>Strong mechanical, electrical, and technical skills</li><li>Knowledge of mechanical handling, conveying, hydraulic, pneumatic, mixing, curing, and packing equipment</li><li>Critical thinking and problem-solving skills; demonstrated leadership skills</li><li>Knowledge of basic OSHA regulations within a manufacturing/distribution environment</li><li>Excellent interpersonal, written and communication skills; detail oriented</li><li>Receptive and responsive to innovative ideas and suggestions</li><li>Develop strategies, set priorities, and maps a course of action to achieve objectives</li><li>Ability to lead, motivate, persuade, inspire, and build trust, consensus, and teamwork</li><li>Good computer skills: Microsoft Office including Excel, word; manufacturing software, and AutoCAD is a plus</li><li>Knowledge of Lean manufacturing and related tools is a plus<br/><br/></li></ul><strong>Education/Certificates/Licenses<br/><br/></strong><ul><li>Pervious experience or degree in Mechanical or Industrial Engineering</li><li>Bilingual is a plus<br/><br/></li></ul><strong>Work Experience<br/><br/></strong><ul><li>A minimum of 5-8 years experience in a manufacturing environment; 1-year lean manufacturing environment experience is a plus</li><li>Knowledge of concrete products desirable<br/><br/></li></ul><strong>Physical Demands </strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/><ul><li>General Manufacturing environment with a hands-on approach</li><li>Standing, walking on the factory floor much of the day</li><li>Lifting heavy materials, 70 pounds maximum</li><li>While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit, stand; walk; use hands to finger, handle or feel; and reach with hands and arms. Lifting, pushing, pulling up to 25 lbs. <br/><br/></li></ul><strong>Mental Demands<br/><br/></strong><ul><li>Organize and schedule work effectively</li><li>Adaptive to change in a fast-paced environment with sometimes critical deadlines</li><li>Work under pressure with quick priority changes</li><li>Handle multiple tasks</li><li>Work independently as needed</li><li>Provide mentoring, problem solving, intervention, team building, motivating<br/><br/></li></ul><strong>Other Duties<br/><br/></strong><ul><li>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. <br/><br/></li></ul>All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, status as a qualified individual with a disability, or any other protected class status. Angelus Block Company, Inc. offers a competitive salary and excellent benefits. Angelus Block Company, Inc. is an Equal Opportunity Employer.<br/><br/><strong>Company Description<br/><br/></strong>Founded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units.<br/><br/>Founded in 1946, Angelus Block Company, Inc. is California's leading producer of concrete masonry units, interlocking concrete pavers, decorative site wall units, and segmental planter wall units.", "postedDate": "3 months ago", "skills": ["Mechanical", "Electrical", "Technical Skills", "Lean Manufacturing", "OSHA", "Interpersonal Skills", "Communication Skills", "Leadership Skills", "Problem Solving", "Microsoft Office", "Excel", "Word", "AutoCAD", "Concrete Products"], "url": "https://www.linkedin.com/jobs/view/3917975240"}