{"jobTitle": "50/50 Raffle Seller", "company": {"name": "Los Angeles Dodgers Foundation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00/hour", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Spectator Sports", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong><strong>2024 LOS ANGELES DODGERS FOUNDATION <br/><br/></strong><strong>50/50 Raffle Game Day Seller Position<br/><br/></strong><strong>Organization Summary<br/><br/></strong>The Los Angeles Dodgers Foundation (LADF) is tackling the most pressing problems facing Los Angeles with a mission to improve education, health care, homelessness and social justice for all Angelenos. Bigger than baseball, LADF envisions a city where everyone regardless of ZIP code has the opportunity to thrive. LADF was reimagined in 2013 and has since raised over $90 million and is on track to raising $100 million in 2023. In the last decade, LADF has invested more than $53 million in our programs and grants to local organizations and impacted more than 9.8 million youth. LADF is the proud recipient of ESPN’s Sports Humanitarian Team of the Year, Robert Wood Johnson Sports Award, Beyond Sport's Sport for Reduced Racial Inequalities Collective Impact Award, and the Aspen Institute Project Play Champion.<br/><br/>LADF is in the midst of an exciting period of growth and seeks raffle sellers for the 2024 Los Angeles Dodgers baseball season.<br/><br/><strong>Title: </strong>50/50 Raffle Game Day Seller<br/><br/><strong>Reports to: </strong>Director, Development (Game Day Management: Manager, In-Stadium Fundraising)<br/><br/><strong>Pay Rate: </strong>$20.00/hour<br/><br/><strong>Program Summary<br/><br/></strong>LADF conducts a 50/50 Raffle fundraising program at all Los Angeles Dodger home games. Every game, fans have the opportunity to purchase a raffle ticket from our 50/50 Raffle sellers located throughout all stadium levels. At the end of the seventh inning, all sales are completed, and a winning ticket number is announced prior to the end of the game. The total jackpot for the night will be split 50/50 between the individual with the winning ticket and LADF.<br/><br/><strong>Position<br/><br/></strong>LADF is looking for high-energy motivated sellers who are reliable, organized, and outgoing to serve on our sales team for the 2024 Los Angeles Dodgers baseball season. 50 positions are available, with up to 30 sellers scheduled per game. This is a seasonal, part-time position. 50/50 Raffle Sellers report to the Director, Development with game-day management by the Manager, In-Stadium Fundraising Supervisor.<br/><br/><strong>Duties &amp; Responsibilities<br/><br/></strong><ul><li>Accurately handle the sale and distribution of 50/50 Raffle tickets during home games at Dodger Stadium (via credit card processing), following program requirements</li><li>Sell 50/50 Raffle tickets during Dodger home games</li><li>Explain the details of the 50/50 Raffle program to Dodger fans</li><li>Promote LADF and 50/50 Raffle in a positive manner to Dodger fans</li><li>Answer questions fans may have about the 50/50 Raffle program<br/><br/></li></ul><strong>Candidate Qualifications &amp; Requirements<br/><br/></strong><ul><li>High school diploma, GED or equivalent education required</li><li>Must be able to work at least 85% Dodger home games (68 out of 81 regular season home games)</li><li>Candidates must have a flexible schedule that allows them to work home games, day or night, weekends and holidays if necessary</li><li>Ability to multi-task in a fast-paced environment</li><li>Must be comfortable with technology (i.e. tablets)</li><li>Ability to interact positively with large fan base</li><li>Strong attention to detail and organizational skills</li><li>Above average verbal communication skills, interpersonal skills and strong sales skills</li><li>Ability to stand for long periods of time, comfortable with going up and down multiple flights of stairs, and to arrive 4 hours before first pitch<br/><br/></li></ul>Schedules will be set at LADF’s sole discretion and may vary depending upon seller availability and performance. This paid position is a part-time position restricted to Los Angeles Dodgers baseball season.<br/><br/>LADF is firmly committed to providing equal opportunity for all qualified applicants from every background. The Foundation is also firmly committed to complying with all applicable laws and governmental regulations at the federal, state and local levels which prohibit discrimination, and which provide for reasonable accommodations to qualified individuals with disabilities.<br/><br/>LADF considers all applicants without regard to national origin, ancestry-ethnicity, race, color, religion, creed, age, sex, gender (including gender identity and expression), sexual orientation, disability, pregnancy or related medical conditions, genetic information, medical condition, military or veteran status, citizenship status, marital status, or any other characteristic protected by applicable state or federal law. The Immigration Reform and Control Act requires that the Foundation obtain documentation from every individual who is employed which verifies identity and authorizes their right to work in the United States.<br/><br/>LADF Values<br/><br/>Our core values are the fundamental beliefs upon which our foundation and its people operate.<br/><br/>Opportunity- We know that talent is evenly distributed, but opportunity is not.<br/><br/>Access- No recreational, education or health resource should be out of reach for any child.<br/><br/>Equity- We aim to level the playing field and make sure that every kid has a fair shot.<br/><br/>Collaboration- We believe that working well with others is the secret sauce to success.<br/><br/>Impact- The work we do must create meaningful progress that is measurable. We want to support proven programs.<br/><br/>Excellence- We hold ourselves to the highest standards across all our work, striving for quality and credibility.", "responsibilities": "<ul><li>Accurately handle the sale and distribution of 50/50 Raffle tickets during home games at Dodger Stadium (via credit card processing), following program requirements</li><li>Sell 50/50 Raffle tickets during Dodger home games</li><li>Explain the details of the 50/50 Raffle program to Dodger fans</li><li>Promote LADF and 50/50 Raffle in a positive manner to Dodger fans</li><li>Answer questions fans may have about the 50/50 Raffle program<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>High school diploma, GED or equivalent education required</li><li>Must be able to work at least 85% Dodger home games (68 out of 81 regular season home games)</li><li>Candidates must have a flexible schedule that allows them to work home games, day or night, weekends and holidays if necessary</li><li>Ability to multi-task in a fast-paced environment</li><li>Must be comfortable with technology (i.e. tablets)</li><li>Ability to interact positively with large fan base</li><li>Strong attention to detail and organizational skills</li><li>Above average verbal communication skills, interpersonal skills and strong sales skills</li><li>Ability to stand for long periods of time, comfortable with going up and down multiple flights of stairs, and to arrive 4 hours before first pitch<br/><br/></li></ul>"}, "skills": ["Sales", "Customer Service", "Communication", "Teamwork", "Organization"], "postedDate": "3 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3918718770"}