{"jobTitle": "Advance Practice Manager  /  NICU", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "160,784.00/yr - $260,333.00/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE<br/><br/>Ranked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California.<br/><br/>Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children.<br/><br/>The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation.<br/><br/>Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding.<br/><br/><strong>It’s Work That Matters.<br/><br/></strong><strong>Overview<br/><br/></strong><strong>Purpose Statement/Position Summary</strong>: The Manager of Advanced Practice oversees a team of advanced practice providers and support staff. The Manager collaborates with Executive team members, Departmental/Physician leadership, and patient care services staff. They provide direction, support, and education and assume responsibility and oversight for all aspects of the work area, including establishing and maintaining the CHLA culture of care and the operational, clinical, and educational functions. The manager oversees the collection of data/metrics and develops and maintains the clinical performance outcomes of the provider team. Collaborates with healthcare practitioners and ensures adherence to licensure, accreditation, and compliance standards<br/><br/><strong>Minimum Qualifications/Work Experience<br/><br/></strong>5+ years of recent NICCU PA or NP experience required<br/><br/>3+ years supervisory experience required.<br/><br/><strong>Previous Fiscal Management Experience Preferred<br/><br/></strong><strong>Education<br/><br/></strong><ul><li> Required</li><li>Master of Science degree in Nursing from an accredited graduate school of nursing in area of specialty approved by the<br/><br/></li></ul>California Board of Registered Nursing for “hold out as Nurse Practitioner” as defined in Nurse Practice<br/><br/>Act, Business and Professional Code OR<br/><br/>ii) Health-related master’s degree.<br/><br/><ul><li> Preferred - Doctoral Degree</li><li> Licensure</li><li> Required</li><li> Current, unrestricted California Registered Nurse license, Current, unrestricted California NursePractitioner license. OR<br/><br/></li></ul>ii) Current PA licensure<br/><br/>iii) Furnishing license.<br/><br/>iv) DEA required for a job role. (DEA is required for all APPs in the NICCU)<br/><br/><ul><li> Certification</li><li> Current national certification as a nurse-practitioner in area of specialty or physician assistant.</li><li> Basic Life Support (BLS)</li><li> Pediatric Advanced Life Support (PALS)</li><li> For the NICCU - Neonatal Resuscitation Program (NRP)<br/><br/></li></ul>The nurse practitioner would need to be trained as a neonatal nurse practitioner (this is per CCS regulations 3.25 F2.4): https://regulations.justia.com/states/california/title-16/division-14/article-8/section-1481/)<br/><br/><strong>Pay Scale Information<br/><br/></strong>$160,784.00-$260,333.00<br/><br/>CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.<br/><br/>Children's Hospital Los Angeles (CHLA) is a leader in pediatric and adolescent health both here and across the globe. As a premier Magnet teaching hospital, you’ll find an environment that’s alive with learning, rooted in care and compassion, and home to thought leadership and unwavering support. CHLA is dedicated to creating hope and building healthier futures - for our patients, as well as for you and your career!<br/><br/>CHLA has been affiliated with the Keck School of Medicine of the University of Southern California since 1932.<br/><br/>At Children’s Hospital Los Angeles, our work matters. And so do each and every one of our valued team members. CHLA is an Equal Employment Opportunity employer. We consider qualified applicants for all positions without regard to race, color, religion, creed, national origin, sex, gender identity, age, physical or mental disability, sexual orientation, marital status, veteran or military status, genetic information or any other legally protected basis under federal, state or local laws, regulations or ordinances. We will also consider for employment qualified applicants with criminal history, in a manner consistent with the requirements of state and local laws, including the LA City Fair Chance Ordinance and SF Fair Chance Ordinance.<br/><br/>Qualified Applicants with disabilities are entitled to reasonable accommodation under the California Fair Employment and Housing Act and the Americans with Disabilities Act. Please contact CHLA Human Resources if you need assistance completing the application process.<br/><br/>Diversity inspires innovation. Our experiences, perspectives and backgrounds allow us to better serve our patients and create a strong community at CHLA.<br/><br/>NICCU", "responsibilities": "The Manager of Advanced Practice oversees a team of advanced practice providers and support staff. The Manager collaborates with Executive team members, Departmental/Physician leadership, and patient care services staff. They provide direction, support, and education and assume responsibility and oversight for all aspects of the work area, including establishing and maintaining the CHLA culture of care and the operational, clinical, and educational functions. The manager oversees the collection of data/metrics and develops and maintains the clinical performance outcomes of the provider team. Collaborates with healthcare practitioners and ensures adherence to licensure, accreditation, and compliance standards", "qualifications": {"required": "5+ years of recent NICCU PA or NP experience required<br/><br/>3+ years supervisory experience required.<br/><br/>Previous Fiscal Management Experience Preferred<br/><br/>Education<br/><br/>Required<br/><br/>Master of Science degree in Nursing from an accredited graduate school of nursing in area of specialty approved by the<br/><br/>California Board of Registered Nursing for “hold out as Nurse Practitioner” as defined in Nurse Practice<br/><br/>Act, Business and Professional Code OR<br/><br/>ii) Health-related master’s degree.<br/><br/>Preferred - Doctoral Degree<br/><br/>Licensure<br/><br/>Required<br/><br/>Current, unrestricted California Registered Nurse license, Current, unrestricted California NursePractitioner license. OR<br/><br/>ii) Current PA licensure<br/><br/>iii) Furnishing license.<br/><br/>iv) DEA required for a job role. (DEA is required for all APPs in the NICCU)<br/><br/>Certification<br/><br/>Current national certification as a nurse-practitioner in area of specialty or physician assistant.<br/><br/>Basic Life Support (BLS)<br/><br/>Pediatric Advanced Life Support (PALS)<br/><br/>For the NICCU - Neonatal Resuscitation Program (NRP)<br/><br/>The nurse practitioner would need to be trained as a neonatal nurse practitioner (this is per CCS regulations 3.25 F2.4): https://regulations.justia.com/states/california/title-16/division-14/article-8/section-1481/)", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3918421267"}