{"jobTitle": "Compliance & Privacy Specialist / Office of Compliance & Privacy", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$52,208.00 - $94,099.20", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE\n\nRanked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California. Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children. The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation. Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding. It’s Work That Matters. Overview Purpose Statement/Position Summary: Under the direction of the Chief Compliance Officer and/or their designee, the Compliance and Privacy Specialist serves as a compliance and privacy specialist and helps manage inquiries on a variety of compliance and privacy topics by gathering additional details on the questions/issues and conducting relevant research. This position will serve as a subject-matter expert on compliance and privacy topics and by maintaining comprehensive knowledge of applicable laws, regulations and policies. This position will interact with all levels of CHLA management, employees, physicians, and patients, as well as external regulators and outside counsel, in conducting compliance/privacy investigations, reviewing complaints and concerns pertaining to compliance/privacy, maintaining necessary documentation and taking appropriate follow-up action as needed. The Compliance and Privacy Analyst assists with the ongoing progression and development, training and education initiatives, and compliance programmatic developments and enhancements.", "responsibilities": "Not specified", "qualifications": {"required": "Bachelors required; advanced degree preferred. Certification in HealthCare Compliance (CHC), Privacy Compliance (CHPC), or Healthcare Research Compliance (CHRC) preferred.", "preferred": "One or more years’ experience in a compliance role within a health care setting, or an equivalent combination of education and experience. Knowledge of operational and regulatory issues related to healthcare compliance and privacy. Exceptional time management and multitasking skills. Demonstrated effectiveness in project management development. Excellent analytical, problem-solving, and decision-making skills. Ability to work effectively with Workforce Members at all levels. Excellent writing and communication skills. Demonstrated investigatory skills, including interviewing people as part of ongoing investigation. Knowledge of, and experience with, federal and state patient privacy laws."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3918423093"}