{"jobTitle": "Administrative Assistant", "company": {"name": "Marcus & Millichap", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Leasing Non-residential Real Estate, Real Estate, and Capital Markets", "description": "<strong>The dynamic administrative support team </strong>at<strong> Marcus &amp; Millichap South Bay</strong> office are seeking a new team member to join our innovative, collaborative team. We’re seeking a personable, professional individual who will not only serve as a great director of first impressions for our clients and visitors, but importantly, who desires a stable, professional office environment providing growth and challenge. Ideal candidates for this <strong>Administrative Assistant </strong>role are passionate about providing top customer service, always looking for ways to improve self and team, and making a difference in the office’s overall success.<br/><br/>This is a full-time, non-exempt (hourly), in-office position – not remote or work from home.<br/><br/>We will train you in this pivotal position and support you as you grow. Commercial real estate is competitive and fast paced. Bring the mindset of “no job too big or small”.<br/><br/><strong>Some Of The Interesting Things You’ll Be Doing<br/><br/></strong><ul><li>Learning real estate transaction administrative support – we teach you how to use Marcus &amp; Millichap's proprietary software which will help you assist our agents throughout the life cycle of their transactions</li><li>Management of the front office where your great first impression counts both in office and over the phone – tasks range from reporting facilities issues to ensuring supplies are stocked to assembling sales meeting presentations and more.</li><li>Becoming a valuable team member working closely with and supporting your home office as well as team members across your geographic area with an interesting variety of tasks which often include software training, technology troubleshooting and special projects.</li><li>After approximately six months into the Administrative Assistant role, you’ll go through a challenging program where we teach you how to train our applications and support new sales agents, staff and management (see Advancement Path below).</li><li>You’ll become one of the Marcus &amp; Millichap South Bay office’s highly visible representatives in firmwide tech launches and onsite tech support of our applications.<br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong><ul><li>Intermediate computer skills including MS Word, Excel, PowerPoint, and Outlook*. </li><li>Strong organizational, interpersonal and communication skills as well as proofreading and editing abilities.</li><li>Quick learner and you enjoy learning/working with software and technology.</li><li>Possess great soft skills; collaborative, proactive, and approachable and a strong desire to learn and grow.</li><li>Excellent attention to detail.</li><li>Reliable and punctual, take pride in owning your responsibilities and contributing to the team.</li><li>2+ years administrative experience desired and if you’ve trained others, that’s a big plus but not required.</li><li>Some experience in Adobe Creative Suite is a plus but not required.</li><li>Candidates are tested for competency in software and office skills.<br/><br/></li></ul><strong>Advancement Path<br/><br/></strong><ul><li>Administrative Assistants will enroll in Marcus &amp; Millichap’s Certified Agent Support Specialist program within the first several months of employment in this role. The Administrative Assistant will successfully complete the program and obtain the title of Certified Agent Support Specialist.<br/><br/></li></ul><em>Our mission is to help our clients create and preserve wealth by providing the best real estate investment sales, financing, research, and advisory services available.<br/><br/></em><strong>Founded in 1971</strong>, Marcus &amp; Millichap (NYSE: MMI) is a leading commercial real estate brokerage firm focusing exclusively on investment sales, financing, research, and advisory services, with nearly <strong>1,700 investment sales and financing professionals in 80+ offices throughout the United States and Canada</strong>.<br/><br/><strong>Marcus &amp; Millichap </strong>closes more transactions than any other real estate investment brokerage firm in the nation. <strong>In 2023, the firm closed 8,297 transactions with a sales volume of approximately $48 billion</strong>.<br/><br/>The firm has perfected a powerful property marketing system that integrates broker specialization by property type and market area; the industry’s most comprehensive investment research; a long-standing culture of information sharing; relationships with the largest pool of qualified investors; and state-of-the-art technology that matches buyers and sellers.<br/><br/><em>Marcus &amp; Millichap provides equal employment opportunities to all employees and applicants for employment without discrimination with regard to race, religious belief (including dress or grooming practices), color, sex, sex stereotype, pregnancy, childbirth or related medical conditions (including breast feeding), age, national origin, ancestry, sexual orientation, gender identification and expression, transgender status, physical or mental disability, medical condition, genetic characteristics, genetic information, family care, marital status, enrollment in any public assistance program, status as military, a veteran or qualified disabled veteran, status as an unpaid intern or volunteer, or any other classification protected by law. We also prohibit discrimination based on the perception that anyone has any of those characteristics, or is associated with a person who has or is perceived as having any of those characteristics. In addition to federal law requirements, Marcus &amp; Millichap complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</em>", "postedDate": "1 week ago", "skills": ["MS Word", "Excel", "PowerPoint", "Outlook", "Adobe Creative Suite"], "url": "https://www.linkedin.com/jobs/view/3918644226"}