{"jobTitle": "Buyer", "company": {"name": "Uptown Cheapskate", "location": "Placentia, CA"}, "location": "Placentia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Retail", "description": "Uptown Cheapskate is currently searching the market for Merchandise Buyers. Do you have what it takes to join our elite team? Uptown Cheapskate is a buy, sell, trade fashion store for young adults. We offer a change of pace from traditional fashion retail by adding the buying element into the usual retail setting. The pace is fast and upbeat. The opportunities to learn and grow are numerous. If you are upbeat, positive, love fashion, love people, love to learn and are looking for a career, we want to meet you! Join a company that offers the community a clothing recycling option and a way to score on current fashion at a great price.<br/><br/><strong>Responsibilities Will Include<br/><br/></strong><ul><li>Participate in buying gently used brand name clothing, accessories and shoes from customers</li><li>Providing excellent customer service through brand and style knowledge</li><li>Participate in visual merchandising of store and overall appearance<br/><br/></li></ul><strong>Required Attributes Are<br/><br/></strong><ul><li>Must live, eat and breathe fashion!</li><li>Stellar knowledge of current teen and young adult fashion and brands</li><li>Amazing organizational and multitasking abilities</li><li>Exceptional customer service skills</li><li>Strong communication skills</li><li>Energetic upbeat outlook</li><li>Desire to have a career and grow with the company<br/><br/></li></ul>Do you know fashion? Do you love finding a great deal? Are you committed to sustainability? If so, come join the Uptown Cheapskate Team! We are looking for friendly, highly motivated people to join our crew of Fashion Consultants.<br/><br/>Uptown Cheapskate is an exciting retail store concept that sells quality clothing brands at affordable prices. Every month, our franchise stores buy and resell thousands of clothing items that have been gently used at a fraction of the prices originally charged. That’s why Uptown Cheapskate is such an effective idea that resonates with customers of every income bracket and style persuasion. Our stores feel more like a boutique than a thrift shop, allowing more people to feel comfortable shopping second-hand.<br/><br/>At Uptown Cheapskate, we have a passion for sustainable fashion. We are dedicated to reducing the impact of the fashion industry on the planet by being green 365 days per year. When you support resale, you’re not just being good on your wallet - you’re giving back to the environment and contributing to an economy that is sustainable and green.<br/><br/>Since 2015, Uptown Cheapskate has joined forces with Kid to Kid and buildOn across the nation to raise money to build schools in developing countries. With the support of tens of thousands of customers all across the nation, we’ve far surpassed our initial goal and have raised over $600,000 and funded 18 schools (and counting!). With your help, communities in Mali, Burkina Faso, Senegal, Haiti, Nepal, Malawi, and Nicaragua now have the facilities that they need to educate their children for years to come.<br/><br/><em>This franchise is independently owned and operated by a franchisee. Your application will go directly to the franchisee, and all hiring decisions will be made by the management of this franchisee. All inquiries about employment at this franchisee should be made directly to the franchise location, and not to BaseCamp Franchising Corporate.</em>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3919418878"}