{"jobTitle": "Operations Associate (Part-Time) - The Grove", "company": {"name": "Alo Yoga", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.00 - 19.00/ hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "<strong>WHY JOIN ALO?<br/><br/></strong>Mindful movement. It’s at the core of why we do what we do at Alo—it’s our calling. Because mindful movement in the studio leads to better living. It changes who yogis are off the mat, making their lives and their communities better. That’s the real meaning of studio-to-street: taking the consciousness from practice on the mat and putting it into practice in life.<br/><br/><strong>OVERVIEW<br/><br/></strong>The Operations Associate is critical in the store team and is responsible for driving to profitability and efficiency. The Operations Associate will work closely with the Operations &amp; Visual Manager &amp; Operations Lead in initiating, completing work, and providing feedback to the team to achieve optimal results supporting total store operations.<br/><br/><strong>RESPONSIBILITIES<br/><br/></strong><ul><li>Execute inventory management processes effectively with a focus on maximizing inventory accuracy and reducing shrink</li><li>Investigate and root cause inventory accuracy issues, partnering with the General Manager to escalate process or system gaps</li><li>Support execution of key operational functions including shipment, receiving and processing, reverse transfers, sales floor recovery, intra-day sales floor replenishment, floor set updates, and supply management</li><li>Maintain and champion strong visual standards for the sales floor</li><li>Work closely with reporting, budgets, expenses, inventory control, supplies, vendor relationships, technology, and facilities to ensure maintained and maximized</li><li>Support a safe work environment and efficient operation through strong stockroom standards and processes</li><li>Move dynamically on the retail floor to assess and fulfill the needs of the business, team and guests</li><li>Execute company-level operations-focused directives, projects and initiates, in partnership with the Operations &amp; Visual Manager &amp; Operations Lead. </li><li>Assists in processing shipment and ensuring product flow; including but not limited to visual merchandising placement and daily replenishment excellence</li><li>Demonstrate strong business acumen by leveraging metrics to support business-driving strategies</li><li>Resolve client needs quickly &amp; effectively ensuring customer satisfaction</li><li>Identify product concerns and communicate inventory needs to support the business goals</li><li>Support other areas of the business, including Sales &amp; Service and Cashier, as needed <br/><br/></li></ul><strong>QUALIFICATIONS<br/><br/></strong><ul><li>1+ years prior work experience in a client-centric, sales &amp; operational environment </li><li>Passion for customer service and delivering exceptional experiences</li><li>High energy, upbeat and enthusiastic with the ability to integrate fun and work</li><li>Self-motivated with a desire to achieve results and excel individually, and as a team</li><li>Fosters genuine connection through empathy, compassion, integrity and building trusting relationships</li><li>Seniority Level: Entry level<br/><br/></li></ul>Part-Time non-exempt associates are expected to work up to 30 hours per week, based on the needs of the business, for a shift minimum of 4 hours. Full-Time non-exempt associates are expected to have open availability, 7 days a week, between 32 - 40 hours. All employees without exception are expected to be able to work during the company’s Blackout period, from the week of American Thanksgiving (including Black Friday and Thanksgiving weekend) through the end of the holiday season (the 1st week of January).<br/><br/><strong>JUST SOME OF THE PERKS <br/><br/></strong><ul><li>Generous employee discount for Bella+Canvas, Alo Yoga, and free membership to Alo Moves, with access to hundreds of streaming fitness and yoga classes with top instructors</li><li>Competitive medical, dental and vision plan options, and enhanced additional benefits such as free virtual access to mental health providers and new parent support for employees and dependents (Full-Time Employees)</li><li>401K with company matching (Full-Time Employees)</li><li>Monthly Store Incentives</li><li>Clothing Allowance</li><li>Free yoga classes at any of our Sanctuaries<br/><br/></li></ul>The Company’s Associate base pay ranges from $17.00 - $19.00/ hour in Los Angeles, CA. Please also note, Associates are eligible to participate in the Company’s Monthly Store Incentive bonus program, which may result in bringing the total compensation to a higher range. Further, the range listed is just one component of the Company’s total rewards package for retail employees. Other rewards may include: clothing allowance, employee discount, 401K, competitive medical, dental, and vision plans, commuter benefits, Talkspace, and AloMoves.<br/><br/>Please review our company California Job Applicant Privacy Policy HERE.<br/><br/>", "responsibilities": "The Operations Associate is critical in the store team and is responsible for driving to profitability and efficiency. The Operations Associate will work closely with the Operations &amp; Visual Manager &amp; Operations Lead in initiating, completing work, and providing feedback to the team to achieve optimal results supporting total store operations.<br/><br/><strong>RESPONSIBILITIES<br/><br/></strong><ul><li>Execute inventory management processes effectively with a focus on maximizing inventory accuracy and reducing shrink</li><li>Investigate and root cause inventory accuracy issues, partnering with the General Manager to escalate process or system gaps</li><li>Support execution of key operational functions including shipment, receiving and processing, reverse transfers, sales floor recovery, intra-day sales floor replenishment, floor set updates, and supply management</li><li>Maintain and champion strong visual standards for the sales floor</li><li>Work closely with reporting, budgets, expenses, inventory control, supplies, vendor relationships, technology, and facilities to ensure maintained and maximized</li><li>Support a safe work environment and efficient operation through strong stockroom standards and processes</li><li>Move dynamically on the retail floor to assess and fulfill the needs of the business, team and guests</li><li>Execute company-level operations-focused directives, projects and initiates, in partnership with the Operations &amp; Visual Manager &amp; Operations Lead. </li><li>Assists in processing shipment and ensuring product flow; including but not limited to visual merchandising placement and daily replenishment excellence</li><li>Demonstrate strong business acumen by leveraging metrics to support business-driving strategies</li><li>Resolve client needs quickly &amp; effectively ensuring customer satisfaction</li><li>Identify product concerns and communicate inventory needs to support the business goals</li><li>Support other areas of the business, including Sales &amp; Service and Cashier, as needed <br/><br/></li></ul>", "qualifications": {"required": "1+ years prior work experience in a client-centric, sales &amp; operational environment, Passion for customer service and delivering exceptional experiences, High energy, upbeat and enthusiastic with the ability to integrate fun and work, Self-motivated with a desire to achieve results and excel individually, and as a team, Fosters genuine connection through empathy, compassion, integrity and building trusting relationships, Seniority Level: Entry level"}, "skills": ["Inventory Management", "Customer Service", "Visual Merchandising", "Operations Management", "Retail Sales"], "postedDate": "2 weeks ago", "benefits": "Generous employee discount for Bella+Canvas, Alo Yoga, and free membership to Alo Moves, with access to hundreds of streaming fitness and yoga classes with top instructors, Competitive medical, dental and vision plan options, and enhanced additional benefits such as free virtual access to mental health providers and new parent support for employees and dependents (Full-Time Employees), 401K with company matching (Full-Time Employees), Monthly Store Incentives, Clothing Allowance, Free yoga classes at any of our Sanctuaries", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3919050023"}