{"jobTitle": "Senior Compliance Associate", "company": {"name": "Capital Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "84,894.00/yr - $135,830.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Financial Services and Investment Management", "description": "\"I can succeed as a Senior Compliance Associate at Capital Group.\" <br/><br/>The Code of Ethics Team is dedicated to helping associates observe exemplary standards of integrity, honesty, and trust. It sets out standards for our personal conduct, including personal investing, gifts and entertainment, outside business interests and affiliations, political contributions, insider trading, and client confidentiality. Monitoring and understanding regulatory rules in these areas is key to maintaining our exemplary reputation and ensures we can articulate requirements to those who need to report .<br/><br/>As a Senior Compliance Associate, you will help to ensure we comply with regulations, requirements, and policies. You'll conduct investment compliance research, and manage, and prepare regulatory filings. You'll leverage your passion for process optimization to support our global compliance controls and ownership reporting. Every day will be different as you partner with our in-house lawyers, compliance managers, and investment operations professionals to assist our portfolio compliance operations and research global regulatory requirements. You will learn how to audit our systems to ensure our controls are working properly. To thrive in this role, you enjoy new challenges and are constantly trying to improve existing processes.<br/><br/>\"I am the person Capital Group is looking for.\" <br/><br/>\n<ul><li>You have a minimum of three years of experience.</li><li>Experience in securities, investment management, financial services industry is a plus.</li><li>You are detail-oriented and have conscious processes in your current position that demonstrate a commitment to accuracy.</li><li>You've always loved researching and cross-referencing different sources of information to uncover gaps and discrepancies. To connect the dots, you vacillate between seeing the big picture and dissecting precise details.</li><li>You appreciate the sense of accomplishment achieved when you solve a problem using your good judgment.</li><li>You have an interest and eagerness to learn about emerging technologies such as robotic process automation or machine learning.</li><li>By asking great questions and bouncing ideas off others, you proactively share your perspective. You're a skilled communicator and thrive in team settings by being authentic, respectful, and engaging.<br/><br/></li></ul>Los Angeles Base Salary Range $84,894-$135,830<br/><br/>In addition to a highly competitive base salary, per plan guidelines, restrictions and vesting requirements, you also will be eligible for an individual annual performance bonus, plus Capital's annual profitability bonus plus a retirement plan where Capital contributes 15% of your eligible earnings.<br/><br/>You can learn more about our compensation and benefits here .<br/><br/><ul><li> Temporary positions in Canada and the United States are excluded from the above mentioned compensation and benefit plans.<br/><br/></li></ul>We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law.", "responsibilities": "The Code of Ethics Team is dedicated to helping associates observe exemplary standards of integrity, honesty, and trust. It sets out standards for our personal conduct, including personal investing, gifts and entertainment, outside business interests and affiliations, political contributions, insider trading, and client confidentiality. Monitoring and understanding regulatory rules in these areas is key to maintaining our exemplary reputation and ensures we can articulate requirements to those who need to report .<br/><br/>As a Senior Compliance Associate, you will help to ensure we comply with regulations, requirements, and policies. You'll conduct investment compliance research, and manage, and prepare regulatory filings. You'll leverage your passion for process optimization to support our global compliance controls and ownership reporting. Every day will be different as you partner with our in-house lawyers, compliance managers, and investment operations professionals to assist our portfolio compliance operations and research global regulatory requirements. You will learn how to audit our systems to ensure our controls are working properly. To thrive in this role, you enjoy new challenges and are constantly trying to improve existing processes.", "qualifications": {"required": "You have a minimum of three years of experience.", "preferred": "Experience in securities, investment management, financial services industry is a plus."}, "skills": [], "postedDate": "3 days ago", "benefits": "In addition to a highly competitive base salary, per plan guidelines, restrictions and vesting requirements, you also will be eligible for an individual annual performance bonus, plus Capital's annual profitability bonus plus a retirement plan where Capital contributes 15% of your eligible earnings.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3919502211"}