{"jobTitle": "Manager or Senior Manager, Tax - SAP Project Manager (AMCS)", "company": {"name": "KPMG US", "industry": "Business Consulting and Services", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing", "industry": "Business Consulting and Services", "description": "<strong>Requisition Number:</strong> 112255 - 8<br/><br/><strong>Description:<br/><br/></strong>At KPMG, you can become an integral part of a dynamic team at one of the world's top tax firms. Enjoy a collaborative, future-forward culture that empowers your success. Work with KPMG's extensive network of specialists; enjoy access to our Ignition Centers, where deep industry knowledge merges with cutting-edge technologies to create innovative tax solutions. Join a diverse team helping high-profile clients understand, analyze, and respond to complex business opportunities and challenges. Develop your career through a range of multifaceted engagements, formal training, and informal mentoring. At KPMG, we believe nothing is more important than investing in our culture because it's an investment in our people, our future, and what we stand for as a firm.<br/><br/>KPMG is currently seeking a Manager or Senior Manager, Tax Enterprise Services PMO (AMCS) to join our Accounting Methods and Credit Services practice.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Lead client engagement teams and other stakeholders in the initiation, planning, design, execution, monitoring, controlling and closure of complex engagements; perform tasks such as monitoring project progress, managing changes to project scope, schedule, budget, tracking key performance indicators and creating reports and presentations to be delivered to relevant clients and/or stakeholders; develop and deliver Tax methodologies for various industries focused on program management and large transformational programs, specific to Finance Transformations </li><li>Guide and support business development activities such as identification, proposal development, and other pursuit activities at clients while working with the appropriate KPMG resources from other service lines/industries</li><li>Collaborate with engagement team to create a project charter, build and maintain project execution plan and some or all the following: scope, schedule, budget, approach, assumptions, deliverable definitions and communication plan; develop and sustain trust-based relationships with Directors, Vice Presidents, and C-level executives</li><li>Direct KPMG Tax team in delivery of services/completion of deliverables outlined in signed statement(s) of work while managing and adhering to KPMG engagement management and financial management policies</li><li>Oversee the project change control process; support customers in driving and completing programs and project, including establishing project framework and processes while resolving issues and removing barriers to progress</li><li>Utilize and ensure project adherence to our practice's standard project management processes and tools to manage project teams across the entire project life cycle; comply with all engagement reporting requirements; serve as an advocate of project management principles and standards; identify and guide project risk factors and identify and resolve project issues; escalate issues as appropriate<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Minimum five years of recent experience in Program, Project and Portfolio Management assessing and planning enterprise IT capabilities and transforming large technology programs</li><li>Bachelor's degree from an accredited college/university; Master's degree from an accredited college/university preferred</li><li>Experience planning and/or leading SAP-enabled transformations or SAP technology implementation projects across multiple industries</li><li>Licensed CPA, JD/LLM or EA, in addition to others on KPMG's approved credential listing; any individual who does not possess at least one of the approved designations/credentials when their employment commences, has one year from their date of hire to obtain at least one of the approved designations/credentials; should you like to see the complete list of currently approved designations/credentials for the hiring practice/service line, your recruiter can provide you with that list; PMP, Certified BA, and/ or Scrum Master a plus</li><li>Prior experience navigating multi-vendor landscapes across the entire delivery lifecycle through building collaborative working relationships built on mutual trust and respect</li><li>Demonstrated ability to build and lead teams of various size in delivery of services to customer, including leading remote or offshore resources and track record of producing high quality results as well as identify business opportunities, attract new business, and build lasting professional relationships with senior level IT, Tax, and Finance executives<br/><br/></li></ul>KPMG complies with all local/state regulations regarding displaying salary ranges. If required, the ranges displayed below or via the URL below are specifically for those potential hires who will work in the location(s) listed. Any offered salary is determined based on relevant factors such as applicant's skills, job responsibilities, prior relevant experience, certain degrees and certifications and market considerations. In addition, the firm is proud to offer a comprehensive, competitive benefits package, with options designed to help you make the best decisions for yourself, your family, and your lifestyle. Available benefits are based on eligibility. Our Total Rewards package includes a variety of medical and dental plans, vision coverage, disability and life insurance, 401(k) plans, and a robust suite of personal well-being benefits to support your mental health. Depending on job classification, standard work hours, and years of service, KPMG provides Personal Time Off per fiscal year. Additionally, each year the firm publishes a calendar of holidays to be observed during the year and provides two firmwide breaks each year where employees will not be required to use Personal Time Off; one is at year end and the other is around the July 4th holiday. Additional details about our benefits can be found towards the bottom of our KPMG US Careers site at ' Benefits &amp; How We Work '.<br/><br/>Follow this link to obtain salary ranges by city outside of CA:<br/><br/>https://kpmg.com/us/en/how-we-work/pay-transparency.html/?id=M322B_3_24<br/><br/>KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, citizenship status, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.<br/><br/>KPMG recruits on a rolling basis. Candidates are considered as they apply, until the opportunity is filled. Candidates are encouraged to apply expeditiously to any role(s) for which they are qualified that is also of interest to them.<br/><br/>KPMG does not currently require partners or employees to be fully vaccinated or test negative for COVID-19 in order to go to KPMG offices, client sites or KPMG events, except when mandated by federal, state or local law. In some circumstances, clients also may require proof of vaccination or testing (e.g., to go to the client site).", "responsibilities": "<ul><li>Lead client engagement teams and other stakeholders in the initiation, planning, design, execution, monitoring, controlling and closure of complex engagements; perform tasks such as monitoring project progress, managing changes to project scope, schedule, budget, tracking key performance indicators and creating reports and presentations to be delivered to relevant clients and/or stakeholders; develop and deliver Tax methodologies for various industries focused on program management and large transformational programs, specific to Finance Transformations </li><li>Guide and support business development activities such as identification, proposal development, and other pursuit activities at clients while working with the appropriate KPMG resources from other service lines/industries</li><li>Collaborate with engagement team to create a project charter, build and maintain project execution plan and some or all the following: scope, schedule, budget, approach, assumptions, deliverable definitions and communication plan; develop and sustain trust-based relationships with Directors, Vice Presidents, and C-level executives</li><li>Direct KPMG Tax team in delivery of services/completion of deliverables outlined in signed statement(s) of work while managing and adhering to KPMG engagement management and financial management policies</li><li>Oversee the project change control process; support customers in driving and completing programs and project, including establishing project framework and processes while resolving issues and removing barriers to progress</li><li>Utilize and ensure project adherence to our practice's standard project management processes and tools to manage project teams across the entire project life cycle; comply with all engagement reporting requirements; serve as an advocate of project management principles and standards; identify and guide project risk factors and identify and resolve project issues; escalate issues as appropriate<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Minimum five years of recent experience in Program, Project and Portfolio Management assessing and planning enterprise IT capabilities and transforming large technology programs</li><li>Bachelor's degree from an accredited college/university; Master's degree from an accredited college/university preferred</li><li>Experience planning and/or leading SAP-enabled transformations or SAP technology implementation projects across multiple industries</li><li>Licensed CPA, JD/LLM or EA, in addition to others on KPMG's approved credential listing; any individual who does not possess at least one of the approved designations/credentials when their employment commences, has one year from their date of hire to obtain at least one of the approved designations/credentials; should you like to see the complete list of currently approved designations/credentials for the hiring practice/service line, your recruiter can provide you with that list; PMP, Certified BA, and/ or Scrum Master a plus</li><li>Prior experience navigating multi-vendor landscapes across the entire delivery lifecycle through building collaborative working relationships built on mutual trust and respect</li><li>Demonstrated ability to build and lead teams of various size in delivery of services to customer, including leading remote or offshore resources and track record of producing high quality results as well as identify business opportunities, attract new business, and build lasting professional relationships with senior level IT, Tax, and Finance executives<br/><br/></li></ul>", "preferred": ""}, "skills": ["SAP", "Project Management", "Program Management", "Tax", "Finance", "IT", "Business Development", "Engagement Management", "Financial Management", "Change Management", "Risk Management", "Issue Resolution", "Team Leadership", "Remote Management", "Offshore Management", "Business Opportunity Identification", "Relationship Building", "Client Management", "Stakeholder Management"], "postedDate": "2 weeks ago", "benefits": "KPMG complies with all local/state regulations regarding displaying salary ranges. If required, the ranges displayed below or via the URL below are specifically for those potential hires who will work in the location(s) listed. Any offered salary is determined based on relevant factors such as applicant's skills, job responsibilities, prior relevant experience, certain degrees and certifications and market considerations. In addition, the firm is proud to offer a comprehensive, competitive benefits package, with options designed to help you make the best decisions for yourself, your family, and your lifestyle. Available benefits are based on eligibility. Our Total Rewards package includes a variety of medical and dental plans, vision coverage, disability and life insurance, 401(k) plans, and a robust suite of personal well-being benefits to support your mental health. Depending on job classification, standard work hours, and years of service, KPMG provides Personal Time Off per fiscal year. Additionally, each year the firm publishes a calendar of holidays to be observed during the year and provides two firmwide breaks each year where employees will not be required to use Personal Time Off; one is at year end and the other is around the July 4th holiday. Additional details about our benefits can be found towards the bottom of our KPMG US Careers site at ' Benefits &amp; How We Work '.<br/><br/>Follow this link to obtain salary ranges by city outside of CA:<br/><br/>https://kpmg.com/us/en/how-we-work/pay-transparency.html/?id=M322B_3_24<br/><br/>KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3919639677"}