{"jobTitle": "Junior Account Executive", "company": {"name": "Thrive LA", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Thrive LA is one of Southern California's leading sales and marketing firms. Our clients know they can count on us to represent them with professionalism and integrity while maintaining quality customer relationships. Because we have brought outstanding results and significant revenue increases to our clients so far, we now have opportunities to continue market expansion for our clients nationally and internationally.\n\nOur company represents the largest e-commerce marketplace and has developed an additional platform that caters specifically to SMB to mid-market business accounts. The Junior Account Executive role focuses on the acquisition and oversight of new business accounts in the greater Los Angeles area.\n\nResponsibilities:\n\n* Pitch and collaborate with business owners/decision-makers\n* Oversee new business account acquisition and account management on behalf of our client\n* Manage communication between client and their target market\n* Drive sales cycle by effectively conducting one-on-one sales presentations to close\n* Territory management and organization\n* Account retention and growth\n* Achieve standard KPIs outlined by the role expectations\n\nRequirements:\n\n* Bachelor or Associate degree preferred\n* 0 - 4 years experience in customer-facing role\n* Strong interpersonal and organizational skills\n* Ability to work well with a team\n* Leadership potential\n* Great work ethic and discipline\n\nThrive LA offers:\n\n* 401k\n* Paid sick time off\n* Uncapped compensation structure\n* Professional coaching and mentorship\n* Weekly and monthly performance incentives\n* Team-based atmosphere\n* Performance-based advancement opportunities from within the company\n\nOur office is located in El Segundo, California.", "jobFunction": "Business Development, Sales, and Customer Service", "industry": "Business Consulting and Services and Internet Marketplace Platforms", "postedDate": "2 weeks ago", "benefits": "401k, Paid sick time off, Uncapped compensation structure, Professional coaching and mentorship, Weekly and monthly performance incentives, Team-based atmosphere, Performance-based advancement opportunities from within the company", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3919708666"}