{"jobTitle": "Marketing Manager for Emerging Music Artist", "company": {"name": "Coral", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Staffing and Recruiting", "description": "We are seeking a hard-working and ambitious marketer to join our dynamic team focused on promoting a new artist's first music project.<br/><br/>This role is ideal for someone highly ambitious with strong communication skills, and is ready to dive into the fast-paced world of music marketing and business and \"figure it out\" on the job. Results will be rewarded with significant upward mobility.<br/><br/>No prior experience in music is required, but the candidate must be prepared to work hard, show initiative, and handle multiple responsibilities effectively. A deep, proven love of the music industry is a big plus.<br/><br/><strong>Responsibilities<br/><br/></strong><em>Market Research<br/><br/></em><ul><li>Join our CEO on paid expert interviews with major heads of marketing at record labels and music agencies and take detailed notes on how we can implement their strategies</li><li>Learn about the ins and outs of music marketing, including the gray-hat areas of marketing and community. <br/><br/></li></ul><em>Marketing<br/><br/></em><ul><li>You will work with our CEO to stand up individual functions and replace yourself with a trained expert every 3-6 months. </li><li>Once you become an expert on a specific function, you will replace yourself with a seasoned veteran and monitor their work. <br/><br/></li></ul><em>Recruiting &amp; Managing<br/><br/></em><ul><li>Conduct numerous interviews to screen and select the right talent for our marketing team. We expect you to conduct over 100 interviews within the first 6 months on the job. </li><li>Organize and manage team assignments to ensure efficiency and effectiveness in meeting our objectives. </li><li>Learn how to manage direct reports effectively and incentivize against results. Implement and manage core tracking systems to monitor key metrics around streams, views, etc. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><em>Technical Skills<br/><br/></em><ul><li>Proven ability to manage projects from conception to execution. </li><li>Familiarity with marketing strategies and market research techniques. </li><li>Proficient in using tools like Asana, Notion, etc to improve work efficiency and project management for campaigns<br/><br/></li></ul><em>Soft Skills<br/><br/></em><ul><li>Must be willing to travel internationally for extended periods of time ✈️</li><li>Excellent interpersonal and communication skills. </li><li>Ability to work autonomously and as part of a team. </li><li>Strong organizational skills with attention to detail. <br/><br/></li></ul><em>Mentality<br/><br/></em><ul><li>\"Get shit done\" mentality, not afraid of digging into the dirty work. No task is too small. </li><li>High work ethic and low ego, with a strong drive to succeed. </li><li>Autonomous, proactive, and ready to take on challenges.</li></ul>", "postedDate": "3 months ago", "skills": ["Marketing", "Market Research", "Project Management", "Asana", "Notion", "Communication", "Teamwork", "Organization", "Detail-Oriented", "Travel"], "url": "https://www.linkedin.com/jobs/view/3919420212"}