{"jobTitle": "Executive Assistant, External Affairs Portfolio", "company": {"name": "Lucas Museum of Narrative Art", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Museums, Historical Sites, and Zoos", "description": "About The Lucas Museum Of Narrative Art<br/><br/>As the first museum to focus exclusively on storytelling through images, the Lucas Museum of Narrative Art believes that visual storytelling can connect us and help shape a more just society. With a growing collection that encompasses artworks from across cultures, places, times, and mediums, including paintings, sculptures, murals, photography, comic art, book and magazine illustrations, and the arts of filmmaking, the Lucas Museum will explore narrative art’s potential to prompt questions, invite opinions, inspire community, and move people to think about the impact of images on our world.<br/><br/>Co-founded by George Lucas and Mellody Hobson and led by director and CEO Sandra Jackson-Dumont, the Lucas Museum was designed by renowned architect Ma Yansong of MAD Architects with Stantec as executive architect and is under construction in Los Angeles’s Exposition Park. An 11-acre campus with extensive new green space designed by Studio-MLA will embrace the museum’s 300,000-square-foot building, which will feature expansive galleries, two state-of-the-art theaters, and dedicated spaces for learning and engagement, dining, retail, and events. www.lucasmuseum.org .<br/><br/>Position Summary<br/><br/>The Executive Assistant to the Deputy Director, External Affairs will play a key role in supporting the work of the External Affairs portfolio including direct support of the Deputy Director’s office. This position will be key to establishing a collaborative, inclusive and creative working culture that helps the full team achieve their best work. We are looking for a detail-orientated and exceptional communicator who and can build strong working relationships with key internal and external stakeholder. The ideal candidate will be nimble, highly responsible, trustworthy, and flexible. This position offers the opportunity to be engaged with the building of a program and team, contributing support across all areas of work.<br/><br/>A central area of work for this position will focus on supporting the Deputy Director in day-to-day museum administration. This will include preparing materials, conducting research, following up and tracking outstanding matters, and debriefing the Deputy Director in day-to-day museum administration. This position will be responsible for confidential, detail-oriented, and time-sensitive materials as well as management of the Deputy Director’s schedule and travel. Some development and communications experience will be required in order to perform special projects as assigned and will require an understanding of the Deputy Director’s portfolio and navigating the complexities of museum functions.<br/><br/>As an Executive Assistant, this role requires a solid grasp of operations and business practices and well- developed project &amp; time management skills. This role also requires frequent coordination with Museum Director/CEO’s Executive Assistant and other Executive Assistants across the museum. In this role, the Administrative Assistant may handle a wide variety of situations and conflicts involving all functions of the office. In the start-up phase, the Executive Assistant may be involved in shepherding overall vision for External Affairs in partnership with Deputy Director, integrating divisions within the portfolio, hiring protocols, and systems development for a complex function that includes Development, Membership, Special Events, Marketing, Communications and Publications. In addition, this position will provide administrative support to the full division including reporting, coordinating meetings scheduling events, and liaising with external partners.<br/><br/>Responsibilities<br/><br/>", "responsibilities": "<ul><li>Creation and assignment of tasks and projects in anticipation of Deputy Director office needs</li><li>Work closely with the Deputy Director and members of the External Affairs team to prepare all presentation materials, including PowerPoint presentations. This includes collaborating on strategy documents and creating strategy decks when necessary</li><li>Coordinate with the External Affairs team to ensure alignment and consistency in presentation materials across the department</li><li>Lead External Affairs portfolio budgeting process, both annual overview and monthly reporting</li><li>In partnership with the Deputy Director, help monitor and report on the execution of the portfolio’s strategic priorities</li><li>Manage Deputy Director’s correspondence, calendar, scheduling, meetings, and all related requests and routing of items as appropriate. Considerable discretion and confidentiality and ability to prioritize in alignment with portfolio goals in vetting requests required</li><li>Manage Deputy Director’s business travel, including reservations, itineraries, and scheduling meetings</li><li>Establish and manage systems and set-up, in coordination with external vendors and experts as necessary</li><li>Liaison with entire organization, especially the CEO/ Director’s office, HR, Finance, IT and external partners</li><li>Prepare expense reports for Deputy Director and support portfolio in timely execution of all finances</li><li>Proactively manage and assist with scheduling and meeting logistics, including preparing for technical requirements, drafting agendas, ordering food, etc.</li><li>Oversee and perform special projects, research assignments, and other duties as assigned</li><li>Provides high level confidential support relating to Deputy Director’s professional responsibilities</li><li>Evaluation of incoming requests, material, responses and best possible scheduling opportunities for Deputy Director’s review and consideration<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree from an accredited college or university required, preferably in art, art history, museum studies, marketing or closely related field\nAt least two (2) years prior administrative support experience required, preferably at the C-level, and/or start-up or arts institution environment\nCompetent and proficient knowledge of the Microsoft Office Suite, including Outlook, Word, Excel, and PowerPoint, and project management software such as Airtable or Asana<br/><br/>", "preferred": ""}, "skills": ["Microsoft Office", "PowerPoint", "Airtable", "Asana"], "postedDate": "4 weeks ago", "salary": {"amount": "31.50 - 34", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3919438517"}