{"jobTitle": "Growth Portfolio Director - Operations & Supply Chain Transformation", "company": {"name": "Point B", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "176,000.00/yr - 220,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Business Consulting and Services", "description": "Point B is a consulting firm that is trusted by the world’s leading organizations and specializes in business transformation and technology services. We are committed to making an impact for our customers and leveraging technology to unlock human potential. We help accelerate our customers' progress toward meaningful outcomes by bringing together cross-industry expertise, proven process, and transformative technology to activate shared potential.<br/><br/>Our diverse set of experts spans 13 U.S. locations, with international reach via our partnership with Nextcontinent. We're united by our desire to help our customers succeed, wherever they do business.<br/><br/>Point B has been consistently recognized as one of the best places to work by Fortune® magazine, The Wall Street Journal, Consulting® magazine, BuiltIn, Vault.com®, and many others.<br/><br/>The Sales Engineer (SE), Operations &amp; Supply Chain,is responsible for working closely with the Growth Leadership team to drive Point B’s success across their portfolio of strategic customers. The SE is responsible for growing and managing sales and offering development for supply chain and operations transformation offerings across industries by partnering with a cross-functional team throughout the sales and delivery life cycles. The ideal customer must have a background in operational excellence/lean six sigma. Priority industries include Healthcare Payer and Provider, Consumer Goods, Retail, and Manufacturing. This role is pivotal in driving our business forward by identifying and qualifying client opportunities, acting as a trusted advisor for C-suite level buyers, crafting tailored solutions for client proposals, leading pursuit teams, and delivering compelling presentations to executive teams. The SE is also responsible for enhancing supply chain and operations related offerings, producing thought leadership, and supporting demand generating activities.<br/><br/>The SE will bring deep commercial, functional, and technical skill set to lead the supply chain and operations commercial channels. The SE is a proven functional domain leader across supply chain and operations value chains, including but not limited to planning, sourcing, manufacturing, and fulfillment. The SE is also a proven leader in helping clients leverage supply chain and operations related technologies, including enterprise applications and emerging technology, to improve cost and quality performance. The SE brings C-suite relationships and leading practice domain depth and is an advisor to senior leaders about trends, challenges, and business opportunities. The SE internalizes, upholds and models our leadership and culture tenets in all interactions internally and externally. The SE will contribute to growing client relationships across industries, including Healthcare Payer and Provider, selling to C-suite buyers and growing a significant business to the scale of $5m+ annual revenue.<br/><br/><strong>What You’ll Get To Do<br/><br/></strong>Partners with Growth Leadership and industry teams to develop customer segmentation and targeted pursuits related to supply chain and operations to drive account growth plans across industries<br/><br/>Grows sales and profitability of supply chain and operations offerings acrossclient industries, with focus on Healthcare Payer and Provider, Consumer Goods, Retail, and Manufacturing.<br/><br/>Understands customers’ strategic roadmap and long-term vision and supports sales efforts to appropriately match business needs<br/><br/>Aligns Point B capabilities in supply chain and operations with customers’ most strategic challenges and opportunities to develop pursuit plans that position Point B to sell and deliver high-value, outcomes based work for our customers<br/><br/>Collaborates with cross-functional teams to design appropriate solutions that meet client needs and leads development of proposals that are technically sound and aligned with business objectives.<br/><br/>Influence client thinking by sharing leading practice perspective and representing Point B experience through storytelling.<br/><br/>Maintains deep domain perspective and eminence in the market and utilizes that perspective to drive customer’s thinking and strategies<br/><br/>Leads offering development strategy based on known and observed customer needs within supply chain and operations domain, market trends, technology trends, and other macroeconomic factors<br/><br/>Actively engages in development of thought leadership relevant to supply chain and operations functions and technology, including contributing to publication ofarticles and participating in conference panels and speaking events.<br/><br/>Ultimately accountable for meeting sales and growth targets across supply chain and operations offerings<br/><br/>Builds and nurtures employees on the Point B Team in line with our Point B values<br/><br/>Serves as escalation point for Point B Growth and Delivery leaders on supply chain and operations sales and delivery activities<br/><br/>Delivers C-Suite advisory-level subject matter expertise in supply chain and operations functional and technical domain throughout the sales lifecycle<br/><br/>Coaches, develops and supports Growth and Delivery colleagues, engages in Point B people processes, including performance management, compensation decisions, promotions, etc.<br/><br/>Actively engages in Point B’s Diversity, Equity and Inclusion (DEI) efforts<br/><br/>Post graduate certificate or coursework relating to domain expertise (HR, Finance, IT, Marketing)<br/><br/><strong>WHAT WE EXPECT YOU’VE ALREADY DONE:    <br/><br/></strong>B.A. or B.S. degree required. MBA encouraged<br/><br/>15+ years of experience in a senior consulting and Client leadership role<br/><br/>Minimum of 15 years in relevant functional and technical domain and industries<br/><br/>Deep knowledge of a supply chain and operations and customer segment with strong networking ability<br/><br/>Existing relationship and ability to build new relationships with the strategic customers/targets, with a focus on C-level and SVP relationships at the client<br/><br/>Proven track record in business development $10-20m+ sales per year<br/><br/>Proven ability to design and sell outcome-based engagements, including the development of pricing models of deals $1m+<br/><br/>Business management experience, including growing and managing a large customer with profit/loss responsibility, and strategic planning at the customer and/or portfolio level<br/><br/>Provided expertise and strategic insight to solving complex business problems, transformational initiatives and executive leadership<br/><br/>Worked as an effective leader across multiple industries and supply chain and operations areas<br/><br/><strong>Experience Developing Others<br/><br/></strong>Strong business community relationships specific to a Point B, Inc strategic offering or customer/segment<br/><br/>Demonstrated experience growing customer business within the range of professional services<br/><br/>Solid working knowledge of strategic, budgeting and sales planning<br/><br/>Demonstrates strong ability in deal shaping and negotiation, including complex procurement cycles<br/><br/><strong>Job-specific Requirements<br/><br/></strong>Sales responsibility for a book of business in service offering or industry segment<br/><br/>Background in operational excellence/lean six sigma<br/><br/>Track record of growing sustainable business within supply chain and operations services (growing wallet share and diversifying at existing customers and new client development)<br/><br/>Experience selling large-scale solutions and outcomes based offerings in supply chain and operations<br/><br/>Has served as an executive peer and thought partner to C-suite executives in supply chain and operations, in functional and technical advisory capacity<br/><br/>Strong, active executive network in segment<br/><br/>Ability to travel 50% of time<br/><br/>Ability to work from home<br/><br/>Ability to work non-standard work hours as necessary<br/><br/><strong>What We Offer<br/><br/></strong>The ability to chart your career path based on expertise and passions<br/><br/>An environment that encourages you to identify new opportunities and supports you in reaching your goals<br/><br/>The chance to have a balanced lifestyle by working with local or national clients in a flexible consulting model<br/><br/>The opportunity to further enable fun and collaborative culture with teams that are as passionate about their communities as they are about their clients<br/><br/>A comprehensive, flexible Total Rewards program that supports and recognizes each individual's unique needs and contributions to the firm<br/><br/><strong>The Kind Of People We Look For<br/><br/></strong>Innate problem solvers who want to grow in a flexible, collaborative culture<br/><br/>Those who have a growth mindset regarding training, practice, and evolving their skills<br/><br/>Versatile people who thrive on variety and challenge<br/><br/>Successful in ambiguous environments <br/><br/>Desire to and ability to learn<br/><br/>Passion for Point B’s Mission, Vision, Values &amp; Culture<br/><br/>Gets it done brand and attitude<br/><br/>Ability to work from home<br/><br/>Ability to work non-standard work hours when necessary.<br/><br/><strong>Compensation And Benefits<br/><br/></strong>The estimated salary range for this role is $176,000 - $220,000 USD per year. This salary range is provided as required by local and state law as applicable. Individual salaries vary on a number of factors including but not limited to geography, skills, education, experience and unique qualifications where applicable.<br/><br/>Bonuses are awarded at Point B’s discretion and are based upon individual contributions and overall firm performance.<br/><br/><strong>INTRIGUED TO LEARN MORE?<br/><br/></strong>When you apply for this role, your information will be personally reviewed by our talent acquisition team (not by a robot). You can expect to hear back from us with feedback if we think there could be a fit and what next steps look like.<br/><br/><strong>WHAT MAKES POINT B DIFFERENT?<br/><br/></strong>Our Founding Purpose and Values. Because our teams help organizations solve their greatest challenges, we've created an inclusive culture that attracts and retains the world’s best talent. Be part of a collaborative culture where we build lasting relationships with each other, our customers, and our communities.<br/><br/>Benefits – Point B rewards high performance with a total rewards approach that includes competitive base pay, benefits, and short-and long-term incentives — as well as flexibility, leadership development opportunities, and a culture designed to help our diverse team of individuals flourish.<br/><br/>Employee Ownership – We give employees a voice in directing their careers and the growth of our firm. Our Employee Stock Ownership Plan is a non-contributory retirement vehicle that grows over time from annual allocations (based on individual compensation) and the value of our company.<br/><br/>Award winning – We are proud to be named a Best Workplace in the US by Fortune magazine, Best Workplaces for Millennials, and Best Workplaces for Women in addition to other awards regarding our workplace inclusivity.<br/><br/>Point B is an <strong>equal-opportunity employer</strong> committed to a diverse workforce. We provide equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. You can read more about our commitment to diversity on our website.<br/><br/>Point B is committed to providing equal opportunities for persons with disabilities or religious observances, which includes providing reasonable accommodation for in any individuals with disabilities or for religious purposes. Applicants with disabilities may contact our Accommodations team at applicantaccommodations@pointb.com or 206-517-5000 to request and arrange for accommodations through the application and/or recruiting process. If you need assistance to accommodate a disability or religious observance, you may request an accommodation at any time. Please note: This mailbox is only for accommodation requests or questions. Please use the Contact Us form for any recruiting inquires.<br/><br/>Legal Information for Job Seekers can be accessed on our Careers Website.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.", "responsibilities": "Partners with Growth Leadership and industry teams to develop customer segmentation and targeted pursuits related to supply chain and operations to drive account growth plans across industries<br/><br/>Grows sales and profitability of supply chain and operations offerings acrossclient industries, with focus on Healthcare Payer and Provider, Consumer Goods, Retail, and Manufacturing.<br/><br/>Understands customers’ strategic roadmap and long-term vision and supports sales efforts to appropriately match business needs<br/><br/>Aligns Point B capabilities in supply chain and operations with customers’ most strategic challenges and opportunities to develop pursuit plans that position Point B to sell and deliver high-value, outcomes based work for our customers<br/><br/>Collaborates with cross-functional teams to design appropriate solutions that meet client needs and leads development of proposals that are technically sound and aligned with business objectives.<br/><br/>Influence client thinking by sharing leading practice perspective and representing Point B experience through storytelling.<br/><br/>Maintains deep domain perspective and eminence in the market and utilizes that perspective to drive customer’s thinking and strategies<br/><br/>Leads offering development strategy based on known and observed customer needs within supply chain and operations domain, market trends, technology trends, and other macroeconomic factors<br/><br/>Actively engages in development of thought leadership relevant to supply chain and operations functions and technology, including contributing to publication ofarticles and participating in conference panels and speaking events.<br/><br/>Ultimately accountable for meeting sales and growth targets across supply chain and operations offerings<br/><br/>Builds and nurtures employees on the Point B Team in line with our Point B values<br/><br/>Serves as escalation point for Point B Growth and Delivery leaders on supply chain and operations sales and delivery activities<br/><br/>Delivers C-Suite advisory-level subject matter expertise in supply chain and operations functional and technical domain throughout the sales lifecycle<br/><br/>Coaches, develops and supports Growth and Delivery colleagues, engages in Point B people processes, including performance management, compensation decisions, promotions, etc.<br/><br/>Actively engages in Point B’s Diversity, Equity and Inclusion (DEI) efforts", "qualifications": {"required": "B.A. or B.S. degree required. MBA encouraged<br/><br/>15+ years of experience in a senior consulting and Client leadership role<br/><br/>Minimum of 15 years in relevant functional and technical domain and industries<br/><br/>Deep knowledge of a supply chain and operations and customer segment with strong networking ability<br/><br/>Existing relationship and ability to build new relationships with the strategic customers/targets, with a focus on C-level and SVP relationships at the client<br/><br/>Proven track record in business development $10-20m+ sales per year<br/><br/>Proven ability to design and sell outcome-based engagements, including the development of pricing models of deals $1m+<br/><br/>Business management experience, including growing and managing a large customer with profit/loss responsibility, and strategic planning at the customer and/or portfolio level<br/><br/>Provided expertise and strategic insight to solving complex business problems, transformational initiatives and executive leadership<br/><br/>Worked as an effective leader across multiple industries and supply chain and operations areas", "preferred": "Strong business community relationships specific to a Point B, Inc strategic offering or customer/segment<br/><br/>Demonstrated experience growing customer business within the range of professional services<br/><br/>Solid working knowledge of strategic, budgeting and sales planning<br/><br/>Demonstrates strong ability in deal shaping and negotiation, including complex procurement cycles<br/><br/>Sales responsibility for a book of business in service offering or industry segment<br/><br/>Background in operational excellence/lean six sigma<br/><br/>Track record of growing sustainable business within supply chain and operations services (growing wallet share and diversifying at existing customers and new client development)<br/><br/>Experience selling large-scale solutions and outcomes based offerings in supply chain and operations<br/><br/>Has served as an executive peer and thought partner to C-suite executives in supply chain and operations, in functional and technical advisory capacity<br/><br/>Strong, active executive network in segment<br/><br/>Ability to travel 50% of time<br/><br/>Ability to work from home<br/><br/>Ability to work non-standard work hours as necessary"}, "skills": ["Business Transformation", "Technology Services", "Supply Chain", "Operations", "Sales", "Consulting", "Business Development", "Strategic Planning", "Leadership", "Client Management", "Relationship Building", "Proposal Writing", "Presentation Skills", "Thought Leadership", "Operational Excellence", "Lean Six Sigma", "Healthcare", "Consumer Goods", "Retail", "Manufacturing", "Enterprise Applications", "Emerging Technology", "C-Suite", "Executive Networking", "Diversity", "Equity", "Inclusion", "DEI"], "postedDate": "2 weeks ago", "benefits": "The ability to chart your career path based on expertise and passions<br/><br/>An environment that encourages you to identify new opportunities and supports you in reaching your goals<br/><br/>The chance to have a balanced lifestyle by working with local or national clients in a flexible consulting model<br/><br/>The opportunity to further enable fun and collaborative culture with teams that are as passionate about their communities as they are about their clients<br/><br/>A comprehensive, flexible Total Rewards program that supports and recognizes each individual's unique needs and contributions to the firm", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3919212376"}