{"jobTitle": "Part-Time Cal Dealer $16 Per Hour", "company": {"name": "Commerce Casino", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Gambling Facilities and Casinos", "description": "6131 Telegraph Rd, Commerce, CA 90040, USA Req #2497<br/><br/>Wednesday, January 17, 2024<br/><br/><strong>Essential Job Functions<br/><br/></strong><ul><li>Provide excellent guest service to both internal and external guests.</li><li>Assists customers with any customer service requests, i.e., calling for Chip Attendant, Floor Attendant, or Supervisor.</li><li>Understands and is responsible for following department and company policies and procedures.</li><li>Deals all games in an effective and concise manner, with a minimum of 36.4 hands dealt per hour, pursuant to departmental dealing procedures.</li><li>When pushed, informs dealer with information which could affect gaming operations</li><li>When entering game, must greets players, ask for player cards and keep Genesis systems updated and correct.</li><li>Follows collection procedures to ensure that collections are obtained and properly recorded.</li><li>Notifies Supervisor or Shift Manager of any suspicious activity, discrepancies or mistakes in games that could disrupt the flow of the game or create a potentially hazardous condition.</li><li>Must be able to hand shuffle, it is essential function of this position.</li><li>Required to sit/stand for forty (40) minutes at a time, for at least an eight (8) hour shift. </li><li>May be required to lift up to twenty-five (25) pounds for various job-related duties. </li><li>Must be able to work full-time during tournament season and any overtime as required, with or without notice. </li><li>Employee must be able to perform duties without wearing tinted glasses, as such can affect the integrity of the games.</li><li> Must have knowledge of and comply with BSA/AML policies and procedures.</li><li>Performs all other work-related duties as assigned by Casino Management. <br/><br/></li></ul><em>The duties listed are not set forth for the purposes of limiting the assignment of work. They are not to be construed as a complete list of the many duties normally to be performed under a position title or those to be assigned and performed temporarily outside of an employee’s normal line of work.<br/><br/></em><strong>Qualifications<br/><br/></strong>Work Experience Required:<br/><br/><ul><li>Minimum of one year of dealing experience or dealer school certificate.<br/><br/></li></ul><strong>Education<br/><br/></strong><ul><li>High School Diploma and/or equivalent certificate and/or one year dealing experience.<br/><br/></li></ul><strong>Other Requirements<br/><br/></strong><ul><li>Must be able to speak, read, and understand English. </li><li>Strong verbal and interpersonal skills. </li><li>Successful completion of a dealer audition and in-house dealer training. </li><li>Must demonstrate positive/enthusiastic approach to all assignments. </li><li>Attendance and punctuality are an essential function of the position. <br/><br/></li></ul>Other details<br/><br/><ul><li>Pay Type Hourly<br/><br/></li></ul>Apply Now", "postedDate": "3 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3920724240"}