{"jobTitle": "Early Morning Stock Associate", "company": {"name": "Ross Stores, Inc.", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Our values start with our people, join a team that values you!<br/><br/></strong>We are the nation’s largest off-price retailer with over 2,000 stores, and a strong track record of success and growth. Our focus has always been bringing our customers a constant stream of high-quality brands and on-trend merchandise at extraordinary savings. All while providing a fun and exciting treasure hunt experience.<br/><br/><strong>As Part Of Our Team, You Will Experience<br/><br/></strong><ul><li>Success. Our winning team pursues excellence while learning and evolving</li><li>Career growth. We develop industry leading talent because Ross grows when our people grow</li><li>Teamwork. We work together to solve the hard problems and find the right solution</li><li>Our commitment to Diversity, Equity &amp; Inclusion, and our community. We celebrate the backgrounds, identities, and ideas of those who work and shop with us because our differences make us stronger. We strive to be a positive force in our community.<br/><br/></li></ul>Our Corporate headquarters are in Dublin, CA, we have 3 buying offices in key markets in New York City, Los Angeles, and Boston, and 8 distribution centers nationwide. With 2023 revenues of $20.4 billion, we are a Fortune 500 company who is committed to providing an inclusive work environment with continuous learning opportunities and development for our teams.<br/><br/><strong>General Purpose<br/><br/></strong>The Retail Associate is responsible for ensuring our Customers have a positive shopping experience. The Associate makes eye contact, smiles, and greets all Customers in a courteous and friendly manner, treats fellow Associates with respect, efficiently follows all company best practice standards as outlined in all work centers, maintains a clean work area at all times, and ensures proper merchandise presentation. The Retail Associate is expected to be engaged in these tasks as assigned during all working hours and will be expected to perform a range of functions in all areas of the Store as business needs require.; The Associate may be requested to perform additional tasks in specific situations, if performance of these tasks will help achieve our Customer service and operational goals.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Understands that safety is the number one priority and practices safe behaviors in everything they do.</li><li>Maintains a high level of awareness on the sales floor to create a safe and secure shopping environment for everyone. Maintains clutter free, clear egress to emergency exits. Immediately corrects or reports any unsafe conditions or practices to Store Leadership.</li><li>Treats all Customers and Associates with respect and courtesy; is friendly and professional at all times. Recognizes fellow Associates using Company recognition programs.</li><li>Assists Customers in any way necessary - is register-trained, assists Customers with merchandise, and answers Customer questions in a polite and knowledgeable manner.; Greets all Customers by making eye contact, smiling and saying \"hello\" throughout the Store as well as saying \"thank you\" with every register transaction.;</li><li>Provides prompt and efficient responses to Customers at all times.; Responds to Customer Service calls immediately.; Handles all Customer issues in a courteous and helpful way, calling a member of the Store Leadership when needed.</li><li>Represents and supports the Company brand at all times.</li><li>Performs cleaning tasks such as sweeping, mopping, dusting, wiping counters and mirrors, replenishing restroom supplies, and disinfecting high-touch areas including the front-end, sales floor and restrooms to help maintain merchandise, customer and Team areas.</li><li>Maintains a professional appearance and adheres to the Company's dress code at all times.</li><li>Performs cleaning tasks such as sweeping, mopping, dusting, wiping counters and mirrors, and replenishing restroom supplies to help maintain merchandise, customer and Team areas.</li><li>Performs daily assigned sizing and recovery per company best practice to ensure a neat, clean and organized store that is well-maintained and efficiently merchandised to standards.</li><li>Expedites newly received merchandise receipts to the sales floor with a sense of urgency, merchandising all items per company best practice to the monthly presentation guidelines and maintaining merchandise/brand name familiarity within departments to assist Customers.</li><li>Understands the Loss Prevention Awareness program, the Shortage Highway, the Store Protection Specialist (SPS) position (where applicable), and merchandise protection standards.</li><li>As a representative of Ross Inc., demonstrates integrity and honesty in all interactions with Associates and Customers. Safeguards confidential information, cash and credit card information, and merchandise.</li><li>Follows all Mark-Out-of-Stock (MOS) policies, including the identification of MOS merchandise, proper processing of each piece and the notification of Store Leadership to review and approve all disposals.</li><li>Follows all policies and procedures concerning cash, check, charge card and refund transactions, voids and offline procedures.; Maintains a high level of awareness and accuracy when handling bankable tenders.</li><li>Demonstrates a sense of urgency to efficiently perform their role. Maximizes productivity by executing all Store best practices and minimizing steps and touches in their work flow.<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Manages Work Processes</li><li>Business Acumen</li><li>Plans, Aligns ; Prioritizes</li><li>Builds Talent</li><li>Collaborates</li><li>Leading by Example</li><li>Communicates Effectively</li><li>Ensures Accountability ; Execution<br/><br/></li></ul><strong>Qualifications And Special Skills Required<br/><br/></strong>Effectively communicate with Customers, Associates and Store Leadership in a friendly, respectful, cooperative and pleasant manner.<br/><br/>Ability to perform basic mathematical calculations commonly used in retail environments.<br/><br/><strong>Physical Requirements/Ada<br/><br/></strong><ul><li>Ability to use all Store equipment, including PDTs, registers and PC as required.</li><li>Ability to spend up to 100% of working time standing, walking, and moving around the Store.</li><li>Ability to regularly bend at the waist, squat, kneel, climb, carry, reach, and stoop.</li><li>Ability to occasionally push, pull and lift more than 25 pounds.</li><li>Ability to use janitorial equipment, rolling racks, ladders and other assigned supplies.</li><li>Certain assignments may require other qualifications and skills.;</li><li>Associates who work Stockroom shifts: Ability to regularly push, pull and lift more than 20 pounds.<br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>None<br/><br/><strong>DISCLAIMER<br/><br/></strong>This job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion.<br/><br/>Ross is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company's overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.<br/><br/>The base pay range for this role is $16.00-$16.50. The base pay range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.", "responsibilities": "The Retail Associate is responsible for ensuring our Customers have a positive shopping experience. The Associate makes eye contact, smiles, and greets all Customers in a courteous and friendly manner, treats fellow Associates with respect, efficiently follows all company best practice standards as outlined in all work centers, maintains a clean work area at all times, and ensures proper merchandise presentation. The Retail Associate is expected to be engaged in these tasks as assigned during all working hours and will be expected to perform a range of functions in all areas of the Store as business needs require.; The Associate may be requested to perform additional tasks in specific situations, if performance of these tasks will help achieve our Customer service and operational goals.", "qualifications": {"required": "Effectively communicate with Customers, Associates and Store Leadership in a friendly, respectful, cooperative and pleasant manner.<br/><br/>Ability to perform basic mathematical calculations commonly used in retail environments."}, "skills": [], "postedDate": "2 weeks ago", "salary": {"amount": "16.00-16.50", "currency": "USD"}, "benefits": "Success. Our winning team pursues excellence while learning and evolving<br/>Career growth. We develop industry leading talent because Ross grows when our people grow<br/>Teamwork. We work together to solve the hard problems and find the right solution<br/>Our commitment to Diversity, Equity &amp; Inclusion, and our community. We celebrate the backgrounds, identities, and ideas of those who work and shop with us because our differences make us stronger. We strive to be a positive force in our community.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3920505060"}