{"jobTitle": "Membership Coordinator / Sales", "company": {"name": "SunBuggy", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "<strong>Job Description<br/><br/></strong>StretchLab is seeking a high energy, passion filled and sales motivated Sales Associate that is fitness minded and has a love for community and for our brand at our brand new studio that islocated in the Long Beach Marketplace shopping center at Pacific Coast Highway and 2nd Street near the Long Beach marina.<br/><br/>Founded in 2015 in Venice, California, StretchLab is the industry leader in offering one-on-one assisted and group stretching. With co-founders coming from the personal training industry, StretchLab has created a variety of offerings to empower clients to ‘Live Long’. StretchLab has gathered a team of experts already certified in an array of related fields – physical therapy, chiropractic medicine, yoga, Pilates, and more – and brought in the world’s leading authority on stretching and flexibility to deliver on the promise of having the finest team of stretching professionals gathered anywhere. StretchLab’s proprietary Flexologist ™ training ensures that their clients receive a world class stretching session. StretchLab currently has more than 100 locations open nationwide with immediate plans for expansion.<br/><br/>StretchLab Long Beach Marina is among the newest studios in the franchise network. At StretchLab, we aim to improve lives through the power of stretch. We coach our clients to improved health, flexibility, and mobility and exceed their expectations by applying our individual and team knowledge to the issues they face. We accomplish this by actively listening and honest communication. Personal integrity, a commitment to excellence, and a dedication to our clients and colleagues set our studio apart from all others. Sales Associates will live these ideals and work with the team towards success.<br/><br/><strong>POSITION:<br/><br/></strong>The purpose of the Membership Coordinator is to assist the General Manager with new membership sales by bringing new members to the studio and booking them into introductory stretches and, eventually, full memberships. The Sales Associate also assists with booking current members and troubleshooting membership issues. Fitness knowledge or background is preferred but not required.<br/><br/><strong> REQUIREMENTS: <br/><br/></strong><ul><li>Excellent sales, communication, and customer service skills required</li><li>Goal-oriented with an ability to achieve sales in memberships for one-on-one and group assisted stretch and retail</li><li>Must be able to work weekends and evenings</li><li>Part-time position typically between 25 and 35 hours per week, with possibility of more</li><li>Ability to learn and use the Club Ready software system</li><li>Ability to stand or sit for up to 8 hours throughout the workday</li><li>Must be fluent in English and have excellent communication skills via in-person, phone and email; bilingual candidates encouraged to apply</li><li>Must be able to work under pressure and meet tight deadlines</li><li>Must have proficient computer skills</li><li>Daily and/or occasional local travel may be required<br/><br/></li></ul><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Assist the General Manager with thesales process of lead generation, follow up, and close</li><li>Book and confirm prospective clients into introductory stretches or classes</li><li>Greet and check-in clients and prospects when they enter the studio</li><li>Conduct tours of the facility while establishing a relationship and targeting individual’s needs and wants</li><li>Participate in pop-up marketing events through pre-sales and beyond, including the set-up, event, and break-down of temporary facilities</li><li>Manage social media accounts and send periodic email to members under the general manager’s supervision</li><li>Maintain acceptable level of personal sales production</li><li>Emphasize and enforce objectives of the club as a complementary wellness provider</li><li>Present available services to current or prospective members</li><li>Book quality appointments to achieve monthly sales quota and follow-up with leads and missed intro classes</li><li>Participate in special events (health fairs, grand openings, marathons, and community and hospital events) to promote the studio</li><li>Maintain Club Ready booking software accurately in coordination with headquarters and local procedures</li><li>Ensure studio is clean and tidy; adhere to strict COVID-19 cleaning practices</li><li>Other duties as assigned<br/><br/></li></ul><strong>COMPENSATION &amp; PERKS:<br/><br/></strong><ul><li>Competitive compensation based on experience</li><li>Free or discounted memberships</li><li>Commission paid on sales</li><li>Opportunity for bonus based on performance</li><li>Opportunities for growth within the studios, including additional sales and management opportunities <br/><br/></li></ul><strong>Job Type:</strong> Part-time; potential for full-time; hourly<br/><br/><strong>Pay:</strong> Depends upon Experience, skills, and qualifications<br/><br/><strong>Experience:<br/><br/></strong>fitness: 1 year (Preferred)<br/><br/>sales: 1 year (Preferred)<br/><br/><strong>Work Location:</strong> Long Beach Marina<br/><br/>Powered by JazzHR<br/><br/>J4kovZswbZ", "responsibilities": "Assist the General Manager with thesales process of lead generation, follow up, and close, Book and confirm prospective clients into introductory stretches or classes, Greet and check-in clients and prospects when they enter the studio, Conduct tours of the facility while establishing a relationship and targeting individual’s needs and wants, Participate in pop-up marketing events through pre-sales and beyond, including the set-up, event, and break-down of temporary facilities, Manage social media accounts and send periodic email to members under the general manager’s supervision, Maintain acceptable level of personal sales production, Emphasize and enforce objectives of the club as a complementary wellness provider, Present available services to current or prospective members, Book quality appointments to achieve monthly sales quota and follow-up with leads and missed intro classes, Participate in special events (health fairs, grand openings, marathons, and community and hospital events) to promote the studio, Maintain Club Ready booking software accurately in coordination with headquarters and local procedures, Ensure studio is clean and tidy; adhere to strict COVID-19 cleaning practices, Other duties as assigned", "qualifications": {"required": "Excellent sales, communication, and customer service skills required, Goal-oriented with an ability to achieve sales in memberships for one-on-one and group assisted stretch and retail, Must be able to work weekends and evenings, Part-time position typically between 25 and 35 hours per week, with possibility of more, Ability to learn and use the Club Ready software system, Ability to stand or sit for up to 8 hours throughout the workday, Must be fluent in English and have excellent communication skills via in-person, phone and email; bilingual candidates encouraged to apply, Must be able to work under pressure and meet tight deadlines, Must have proficient computer skills, Daily and/or occasional local travel may be required", "preferred": "fitness: 1 year (Preferred), sales: 1 year (Preferred)"}, "skills": ["Sales", "Customer Service", "Communication", "Club Ready"], "postedDate": "3 months ago", "benefits": "Competitive compensation based on experience, Free or discounted memberships, Commission paid on sales, Opportunity for bonus based on performance, Opportunities for growth within the studios, including additional sales and management opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3920218087"}