{"jobTitle": "CEQA/NEPA Planner (Noise Specialist)", "company": {"name": "Yorke Engineering, LLC", "industry": "Environmental Services", "size": "Not specified", "location": "Diamond Bar, CA"}, "location": "Diamond Bar, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Environmental Services", "description": "Join Yorke Engineering, LLC, an Environmental Consulting leader in California that implements Environmental Engineering and Compliance solutions for our clients throughout California. Our mission is to solve environmental compliance problems for industrial and governmental/infrastructure facilities. We are a growing and dynamic organization of highly respected professionals. Yorke Engineering, LLC has assisted over 1,800 client organizations with their Air Quality and Environmental Compliance, Engineering, and Permitting needs. Our philosophy is to efficiently help government and industrial customers with the complex array of environmental laws and regulations. From simple permits to complex agency negotiations, from small companies to the largest of California’s organizations, Yorke successfully solves our clients’ Air Quality and Environmental challenges. Our team has over 1,000 years of combined environmental experience and consists of engineers and scientists that specialize in Air Quality, Waste, Water, CEQA, Safety, and Industrial Hygiene. We are looking for an experienced and sharp CEQA / NEPA Project Manager (Planner) to join our team in Southern CA. This is a full-time position which can be based in any one of our Southern CA offices (San Juan Capistrano, Diamond Bar, Long Beach, Ventura, Riverside, Los Angeles). We offer competitive salaries, a full benefits package including Paid Time Off, Holidays, Full Medical/Dental/Vision, along with a 401k program with a generous company match.", "responsibilities": "At Yorke, the CEQA/NEPA Planner performs creative professional scientific work of considerable analytical difficulty as well as supervises and manages CEQA/NEPA services for the company, especially developing and producing technical studies and reports for various CEQA/NEPA documents. Responsibilities include directing and preparing all or portions of Initial Studies/Negative Declarations (IS/ND), Mitigated Negative Declarations (MND), Environmental Impact Reports (EIR), Environmental Assessments (EA), and Environmental Impact Statements (EIS). Yorke’s CEQA/NEPA practice currently focuses on preparing the Air Quality, Greenhouse Gas (GHG), and/or Noise Technical Reports and/or sections of MNDs and EIRs, but we are expanding our services to prepare CEQA/NEPA studies which encompass the full range of CEQA topics where the need for field surveys are not required. Excellent writing and communication skills as well as experience and the ability to conduct several projects concurrently in a teamwork setting are essential. This is an experienced level position and would be expected to be a part of the Yorke leadership team in the CEQA practice. Professionals at this level are assigned to perform the more complex and sensitive duties in the occupational field. The employee in this position may be assigned to train other employees and/or monitor work produced by other employees.", "qualifications": {"required": "B.S. degree or higher in Urban Planning, Regional Planning, Chemical Engineering, Environmental Engineering, Mechanical Engineering, Environmental Science, Chemistry or any other relevant technical degree from an accredited university (minimum GPA of 3.0); CEQA Project Management experience and/or experience in supporting CEQA project teams; Working knowledge of emissions and modeling applications for CEQA air and/or noise studies such as CalEEMod, EMFAC, OFFROAD, etc. (Yorke has in house staff than can handle the air dispersion modeling and HRAs); Analysis, interpretation, and application of rules, guidelines and statutes, and regulations towards practical solutions; Capable of working independently; Ability to think critically and develop creative solutions; Advanced computer applications, data processing/management, and strong Microsoft 365, SharePoint, Excel, Word, PowerPoint, and Access abilities; Strong speaking skills for presentations and meetings; Ability to travel to client offices/sites and agency meetings.", "preferred": "2-10 years of project management, permitting, and compliance experience in the environmental industry particularly related to: CEQA/NEPA Air quality, odor, and GHG/climate change studies and reports; Noise analyses and integration of traffic study results; and Preparing MND/EIR/EA/EIS analyses, reports, and chapters (preferably in a consulting environment). Preparing technically sound and legally defensible analyses and environmental impact assessment documentation, including technical writing, quantitative analysis, review, and quality control, in compliance with CEQA and NEPA; Technical and regulatory working knowledge of CEQA/NEPA assessment criteria, air district rules and regulations, and state and federal regulatory programs; Highly skilled in composing, writing, and editing CEQA/NEPA documents and proposals in a professional manner; Perform engineering calculations for the purposes of evaluating project emissions compared to ambient air quality standards and conducting health risk assessments; Experience dealing with various lead and regulatory agencies; Experience in project management on large and/or complex CEQA/NEPA projects; Ability to manage multiple clients and projects at any given time without losing focus of quality; Highly motivated to continue working in the environmental field, expand knowledge and experience, and develop appropriate solutions for clients."}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "We offer competitive salaries, a full benefits package including Paid Time Off, Holidays, Full Medical/Dental/Vision, along with a 401k program with a generous company match.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3920206438"}