{"jobTitle": "Business Development Manager - Orange County, CA (REMOTE)", "company": {"name": "Sealed Air Corporation", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$73,000- $102,053", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Packaging and Containers Manufacturing", "description": "SEE designs and delivers packaging solutions that protect essential goods transported worldwide, preserve food, enable e-commerce and digital connectivity, and help create a global supply chain that is touchless, safer, less wasteful, and more resilient.<br/><br/>SEE strives to foster a caring, high-performance growth culture that will deliver consistent, sustainable profitable growth and accelerate our performance – a culture where accountability is clear and aligned, and where we reward business outcomes and impact. Our culture guides everything we do – how we partner with our customers and suppliers, attract and retain top talent, and create value for our stakeholders.<br/><br/>SEE generated $5.5 billion in revenue in 2023 and has approximately 17,000 employees. The company operates out of 46 countries/territories, and our products are distributed in 115 countries/territories around the world. To learn more, visit www.sealedair.com.<br/><br/><strong>Position Summary<br/><br/></strong>Drive territory revenue growth through machinery and consumable sales. Develop and execute territory-level strategies and tactics to retain current customer bases/market share, to regain lost business, and to prospect for new business in target markets.<br/><br/><strong>Job Description<br/><br/></strong><ul><li>Develop and implement territory-level strategies and tactics to obtain new business and regain lost business to maximize product sales and market share. Achieve sales plans and new account goals for all assigned product lines including Autobag, Sidepouch, FloWrap, StealthWrap &amp; PriorityPak machinery and materials. </li><li>Work closely with Channel team to execute corporate strategies and programs. Assist Channel partners in developing product sales knowledge and system selling that will enable them to effectively target/promote our products in their markets. Provide product, sales, and applications training to Channel sales reps.</li><li>Use CRM for timely and accurate updates on lead status and sales pipeline. Review sales pipeline with RSD at least twice per month with the focus on accurately projecting close dates. Provide quarterly business summary reports for key accounts, Channel partners and competitive market activity. </li><li>Work effectively as a team with internal Sealed Air personnel in customer service, quality assurance, field service, applications, marketing, pricing and other operations as required.</li><li>Control T &amp; E costs and manage all field sales demo machinery.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Marketing or Sales preferred.</li><li>1-2+ years of field sales experience, or 2-3+ years of inside sale experience or an equivalent amount of sales training. </li><li>Knowledge of the flexible packaging market is a plus</li><li>Introductory level ability to use Microsoft Office tools (Word, Excel, and PowerPoint)</li><li>Ability to analyze and interpret customer needs as well as formulate and recommend solutions in a consultative manner. Strong interpersonal, written, and verbal communication skills required. <br/><br/></li></ul><strong>Salary<br/><br/></strong>$73,000- $102,053<br/><br/>Requisition id: 47033<br/><br/>Relocation: No<br/><br/>SEE is committed to attracting, selecting, and developing talent that reflects the diversity of the communities and customers we serve. We take pride in our selection process to identify, infuse, and grow talent to align with our culture, values, and norms. SEE prioritizes talent development, fostering a culture of continuous growth and career progression. The company is committed to providing equal employment opportunities to all applicants for employment and to all employees, without regard to race, color, religion, gender identity or expression, national origin, age, protected disability, veteran status, or any other protected status in accordance with applicable federal, state and local laws.<br/><br/><ul><li>Please be cautious of fraudulent recruiting efforts using the SEE name or logo. SEE will never request private information during the application process, such as a Driver's License or Social Security Number. If you have any concerns about information received from SEE during the application process, please reach out to us directly at globalta@sealedair.com.<br/><br/></li></ul>LINK1 MON1", "responsibilities": "<ul><li>Develop and implement territory-level strategies and tactics to obtain new business and regain lost business to maximize product sales and market share. Achieve sales plans and new account goals for all assigned product lines including Autobag, Sidepouch, FloWrap, StealthWrap &amp; PriorityPak machinery and materials. </li><li>Work closely with Channel team to execute corporate strategies and programs. Assist Channel partners in developing product sales knowledge and system selling that will enable them to effectively target/promote our products in their markets. Provide product, sales, and applications training to Channel sales reps.</li><li>Use CRM for timely and accurate updates on lead status and sales pipeline. Review sales pipeline with RSD at least twice per month with the focus on accurately projecting close dates. Provide quarterly business summary reports for key accounts, Channel partners and competitive market activity. </li><li>Work effectively as a team with internal Sealed Air personnel in customer service, quality assurance, field service, applications, marketing, pricing and other operations as required.</li><li>Control T &amp; E costs and manage all field sales demo machinery.<br/><br/></li></ul>", "qualifications": {"required": "1-2+ years of field sales experience, or 2-3+ years of inside sale experience or an equivalent amount of sales training.  Knowledge of the flexible packaging market is a plus Introductory level ability to use Microsoft Office tools (Word, Excel, and PowerPoint) Ability to analyze and interpret customer needs as well as formulate and recommend solutions in a consultative manner. Strong interpersonal, written, and verbal communication skills required. ", "preferred": "Bachelor’s degree in Marketing or Sales preferred."}, "skills": ["Sales", "Marketing", "Microsoft Office", "CRM", "Customer Service", "Quality Assurance", "Field Service", "Applications", "Pricing"], "postedDate": "3 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3920523093"}