{"jobTitle": "Sales Operations Analyst", "company": {"name": "JM Eagle", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Plastics Manufacturing", "description": "<strong>Responsibilities<br/><br/></strong>Job Description<br/><br/><ul><li>Gather, analyze, and summarize key data points in order to empower the sales team with information to help drive effective and efficient sales growth. </li><li>Develop and track Key Performance Indicators of various sales programs and initiatives</li><li>Identify actionable metrics about product and inventory levels to support sales development</li><li>Develop presentations that analyze sales and inventory levels to identify opportunities for sales growth</li><li>Implement and manage reports and dashboards ensuring sales team members have access to key data required to successfully manage the business. </li><li>Work with internal IT teams to identify system enhancements and opportunities to provide data updates more easily</li><li>Managing the daily business activities of their assigned accounts which include: order entry, scheduling of order shipments, pricing, securing new orders and ensuring the highest level of service possible; under the guidance of the Company’s Sales SOP. </li><li>Responsible to manage open order file to ensure all orders and back orders are shipped in a timely fashion. </li><li>Responsible to obtain product and technical knowledge of all of the company’s products by attending various technical training seminars offered and self-study. </li><li>Entering orders in a timely, accurate manner. </li><li>Respond to customers’ requests for quotation in a timely, accurate manner. </li><li>Initiate and follow through the resolution with Product Assurance department of any dispute that involves an order. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor degree business, marketing or a related field AND 5 to 7 years of experience in sales operations and analysis. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage.<br/><br/>JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach.<br/><br/>JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.<br/><br/>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage. JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach. JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3920895796"}