{"jobTitle": "Business Development Representative, Google Cloud", "company": {"name": "Google", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "53,500.00/yr - 78,500.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>Chicago, IL, USA; Austin, TX, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience. </li><li>2 years of experience in B2B sales. </li><li>Experience in sales development and relationship management. <br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>2 years of experience in exceeding business goals in the technology industry with cloud computing solutions.</li><li>Experience sourcing leads and generating sales pipeline.</li><li>Experience in account management, with a customer-centric mindset.</li><li>Understanding of the technology, cloud computing solutions, and digital transformation from a business perspective.</li><li>Ability to quickly establish trusting relationships with prospects and assess their needs.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>As a member of the Google Cloud team, you inspire leading companies, schools, and government agencies to work smarter with Google tools like Google Workspace, Search, and Chrome. You advocate for the innovative power of our products to make organizations more productive, collaborative, and mobile. Your guiding light is doing what’s right for the customer, you will meet customers exactly where they are at and provide them the best solutions for innovation. Using your passion for Google products, you help spread the magic of Google to organizations around the world.<br/><br/>As a Business Development Representative (BDR), you will play a key role in the Sales organization. In collaboration with your assigned Sales team, you will identify, qualify, and cultivate customer opportunities. You will identify and build a high-quality, strategic pipeline for our Field sellers so they can ultimately meet or exceed their business goals and expand the product portfolio within their accounts. You will gain a deep understanding of how our solutions solve our customers' challenges.<br/><br/>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.<br/><br/>The US base salary range for this full-time position is $53,500-$78,500 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Generate demand with prospective and existing customers via Google Meet (i.e. video conferencing) and phone calls to identify, qualify, and cultivate opportunities.</li><li>Learn and implement solution selling strategies mapping Google Cloud solutions against customer’s business imperatives particularly as it relates to digital transformation.</li><li>Maintain business opportunity upkeep with timely and accurate updates on opportunities in Customer Relationship Management (CRM) tools.</li><li>Perform research to provide account intelligence, identify stakeholders, and build relationships/identify workloads in discussions with IT decision-makers and practitioners.</li><li>Partner with field promoters to drive customer attendance at marketing events, training, and other activities to build awareness and education on Google’s solutions.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Generate demand with prospective and existing customers via Google Meet (i.e. video conferencing) and phone calls to identify, qualify, and cultivate opportunities.</li><li>Learn and implement solution selling strategies mapping Google Cloud solutions against customer’s business imperatives particularly as it relates to digital transformation.</li><li>Maintain business opportunity upkeep with timely and accurate updates on opportunities in Customer Relationship Management (CRM) tools.</li><li>Perform research to provide account intelligence, identify stakeholders, and build relationships/identify workloads in discussions with IT decision-makers and practitioners.</li><li>Partner with field promoters to drive customer attendance at marketing events, training, and other activities to build awareness and education on Google’s solutions.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 2 years of experience in B2B sales. Experience in sales development and relationship management.", "preferred": "2 years of experience in exceeding business goals in the technology industry with cloud computing solutions. Experience sourcing leads and generating sales pipeline. Experience in account management, with a customer-centric mindset. Understanding of the technology, cloud computing solutions, and digital transformation from a business perspective. Ability to quickly establish trusting relationships with prospects and assess their needs."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The US base salary range for this full-time position is $53,500-$78,500 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3921399690"}