{"jobTitle": "Security Guard", "company": {"name": "New York Film Academy", "industry": "Higher Education", "size": "Not Specified", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$20.00 - $20.00 Hourly", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Higher Education", "description": "Security Guards assist our management with the daily functions of the Security department to ensure protection of assets, employees, guests and property. The Security Guard reports directly to the Director of Security, but also works closely with the Security Supervisor to ensure campus safety. This position will focus on ensuring guest and employee satisfaction while achieving the operating budget.", "responsibilities": "Provide quality service in protecting, safeguarding and securing the students, personnel, NYFA assets and all visitors. Provide continuous physical and electronic monitoring of campus property including security inspections of all doors, windows, gates through regular and random walking patrols of the campus. Serve as an active member of the school security team. Monitor secondary egress doors as needed for events. Maintain a security log of all incidents occurring during each shift. Monitor and resolve actions by visitors, students, staff that could cause injury or loss to NYFA or members of the academy community. Monitor traffic flow and adherence to NYFA parking procedures during and after school hours. Provide a visible presence during special events. Provide assistance to employees, students and visitors when needed. When requested, escort employees who have worked late into the evening to their vehicles to ensure their safety. Maintain a strong working knowledge of the NYFA security requirements and safety practices. Report any safety concerns to the Director of Security so that repairs can be done immediately. Respond to all alarms. Assist the Director of Security in the recommendation, development and implementation of improvements to safety and security procedures, equipment and systems. Maintain contact with Security Department and NYFA staff via cell phone or 2-way radio on matters of school safety and security. Perform clerical functions incidental to security. Other duties as assigned by the Director of Security, Director of Operations or the Dean of NYFA LA.", "qualifications": {"required": "Possession of valid California BSIS Guard Card. High School graduate or equivalent required. 2 years of prior security experience. Security Guard Card required.", "preferred": "Experience in security enforcement with a strong working knowledge of safety practices in a school environment. Outstanding interpersonal skills with a strong customer service focus (internal and external). Strong written and oral communication skills with an ability to effectively communicate with all stakeholders of the school. Accessible, approachable and welcoming, managing confidential situations with discretion, respect and sensitivity. Highly ethical and confidential team player. Able to exercise independence and sound judgment in decision making. High energy, self-starter with ability to successfully prioritize and multi-task in an atmosphere in which time sensitive deadlines and interruptions are the norm. Able to stand and walk for long periods of time. Able to lift and carry up to 50 lbs."}, "skills": ["Security Enforcement", "Customer Service", "Communication", "Problem Solving", "Teamwork"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3921456475"}