{"jobTitle": "Shipping/Receiving Clerk", "company": {"name": "Nexus Brands Group", "industry": "Manufacturing", "size": "Not specified", "location": "Lake Forest, CA"}, "location": "Lake Forest, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "The Bishop Tattoo Supply website is a one stop shop for tattooing supplies and creative inspiration, and the premier destination for tattoo artists worldwide. The ideal candidate for this position will have a love for art with a desire to provide top quality customer service. Bishop Rotary is a tattoo machine company – we make the finest tattoo machines, and we love having the finest staff to help customers and clients.", "responsibilities": "Package and label all outgoing shipments according to company standards. Ensure that all shipping documents are accurate and complete. Coordinate with carriers to schedule pickups and deliveries. Track and monitor all shipments to ensure timely delivery. Communicate with customer service regarding shipment status and delivery updates. Maintain a clean and organized shipping area. Assist with receiving, inventory, and other teams as needed. Other duties may be assigned. Any other duties needed to help drive to our Vision, fulfill our Mission, and abide by our Company’s Values.", "qualifications": {"required": "High school diploma or equivalent. Prior experience in inventory or shipping preferred. Strong attention to detail and organizational skills. Ability to work independently and prioritize tasks. Excellent communication and interpersonal skills. Basic computer skills, including experience with shipping software and Microsoft Office. Existing knowledge of shipping rules and regulations a plus. Ability to lift and move up to 50 pounds. Ability to stand, walk, and bend for extended periods of time. The position may require working in a variety of weather conditions and may involve exposure to dust, fumes, and other airborne particles. Team members must have good attendance, the ability to show up and be on time to scheduled shifts and be able to complete their full shift. Must be able to work M-F from 8a – 5p.", "preferred": "Not specified"}, "skills": ["Attention to detail", "Organizational skills", "Communication skills", "Interpersonal skills", "Basic computer skills"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Friendly and supportive culture with team member appreciation events. Open-door policy. Health and welfare benefits. Pet discount program. Supplemental insurance options including long and short-term disability and EAP. 401k with company match. Paid time off in addition to paid holidays. Employee Referral Program. Continuous training and growth opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3921749199"}