{"jobTitle": "Business Development Representative, Google Cloud", "company": {"name": "Google", "industry": "Information Services and Technology, Information and Internet", "size": "Large", "location": "Chicago, IL"}, "location": "Chicago, IL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$53,500.00/yr - $78,500.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "As a member of the Google Cloud team, you inspire leading companies, schools, and government agencies to work smarter with Google tools like Google Workspace, Search, and Chrome. You advocate for the innovative power of our products to make organizations more productive, collaborative, and mobile. Your guiding light is doing what’s right for the customer, you will meet customers exactly where they are at and provide them the best solutions for innovation. Using your passion for Google products, you help spread the magic of Google to organizations around the world.", "responsibilities": "Generate demand with prospective and existing customers via Google Meet (i.e. video conferencing) and phone calls to identify, qualify, and cultivate opportunities. Learn and implement solution selling strategies mapping Google Cloud solutions against customer’s business imperatives particularly as it relates to digital transformation. Maintain business opportunity upkeep with timely and accurate updates on opportunities in Customer Relationship Management (CRM) tools. Perform research to provide account intelligence, identify stakeholders, and build relationships/identify workloads in discussions with IT decision-makers and practitioners. Partner with field promoters to drive customer attendance at marketing events, training, and other activities to build awareness and education on Google’s solutions.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 2 years of experience in B2B sales. Experience in sales development and relationship management.", "preferred": "2 years of experience in exceeding business goals in the technology industry with cloud computing solutions. Experience sourcing leads and generating sales pipeline. Experience in account management, with a customer-centric mindset. Understanding of the technology, cloud computing solutions, and digital transformation from a business perspective. Ability to quickly establish trusting relationships with prospects and assess their needs."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The US base salary range for this full-time position is $53,500-$78,500 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training.", "remoteWork": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Chicago, IL, USA; Austin, TX, USA.", "url": "https://www.linkedin.com/jobs/view/3921500707"}