{"jobTitle": "Product Manager - Health Food", "company": {"name": "Tiens", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Wellness and Fitness Services", "description": "TIENS Group Company Limited was founded in 1995 and entered the international market in 1997. Today, TIENS Group has become an international conglomerate in the fields of biotechnology, health management, hotel and tourism, education and training, e-commerce, international trade, etc. Its business spans more than 190 countries and regions around the world, and it has established branches in 110 countries and regions. TIENS Group has made innovative developments in four major categories of products, such as health supplements, health care appliances, personal care products, and household products. It serves more than 40 million families around the world. TIENS Group has invested more than US$1 billion or RMB 7 billion in the construction of the TIENS International Health Industrial Park. Covering an area of 1 square kilometer, it is a comprehensive industrial park that integrates product research and development, pilot experimentation, manufacturing, health care, hotel and tourism, and conferences and exhibitions. The industrial park provides TIENS Group with a more solid business platform and a broader space for development. TIENS Group continually adheres to its charitable philosophy of \"originating from society and therefore contributing to society\", and actively practices corporate social responsibility. To date, TIENS Group has invested over US$230 millions or RMB 1.6 billion in charities and public welfare activities. Under the guidance of the \"New Swap and Alternative Theory\", with the philosophy of \"Harmony, Responsibility, and Prosperity\", and the theme of \"new thinking, new retail, new mechanisms, and new models\", TIENS Group is accelerating the implementation of its \"One Body, Multiple Wings\" strategy as it expands into overseas markets. It strives to develop its global cross-border e-commerce business, and promote diversified businesses involving hotels, tourism, trade, health services, and health products, etc.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Design new formulation and develop diversified innovation nutrition and health food, especial for dietary supplement series, including herb or plant extract or cell nutrition supplements in western countries</li><li>Gather and evaluate global products, R&amp;D materials, and information</li><li>Manage ongoing and new developing projects and product series globally</li><li>Work closely with design team on product ideation and licensors to ensure branding standards are met</li><li>Communicate daily with factories overseas on cost negotiations and sample development</li><li>Build development timelines and drive development milestones to ensure product is launched on time</li><li>Collaborate frequently with internal teams, such as Products, Marketing, Sales, Design, Regulatory, etc.<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li>Bachelor's Degree in Business Administration, Marketing, Management, or equivalent</li><li>Master’s Degree is highly desirable</li><li>Minimum over 7 years of working experience in product development and management in functional food &amp; health food industry in western countries</li><li>Responsible for projects for new product development in North America and abroad </li><li>Ability to contact &amp; communicate with global &amp; North America suppliers and to establish co-operation with colleagues at company inside. Have local OEM sources and keeping close relationship with manufacturers for functional food &amp; dietary supplement sectors in North America will be a plus</li><li>5 Product Experience for global or local Direct-selling companies will be an advantage</li><li>Excellent leadership and communication skills, with the ability to inspire, motivate, and develop a high-performing team</li><li>Strong analytical and problem-solving skills</li><li>Proven ability to build and maintain strong relationships with internal and external stakeholders.</li><li>Ability to work effectively in a remote environment and manage a geographically dispersed team.</li><li>Fluency in English is required and Chinese or Spanish is highly desirable but not required</li></ul>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3922622096"}