{"jobTitle": "Senior Business Development Manager (FMCG)", "company": {"name": "RegASK", "location": "California, CA"}, "location": "California, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "<strong>Our Company<br/><br/></strong>We, atRegASK are a high growth global RegTech company leveraging technology and global network of experts to revolutionize regulatory intelligence, serving the LifeSciences (MedTech, CROs, Pharma) and FMCG industries (Food, Personal Care). RegASK team is highly diverse with more than 10 nationalities across 3 continents, entrepreneurial and very agile, enjoying the benefits of working across industries and across the globe. We are currently recruiting highly motivated talents to expand its team and support its ambitious growth plans.<br/><br/>RegASK is an international, diverse and rewarding place to work.If you are a builder, highly autonomous in your working style, and eager to problem solve, we would love to hear from you.<br/><br/>RegASK is part of Sprim Global Investments portfolio, a group of 500+ people in 19 offices across 6 continents, finding solutions, discovering and implementing new ideas to deliver better health.<br/><br/><strong>THE POSITION<br/><br/></strong>Senior Business Development Manager<br/><br/>Reporting to:Global Sales Lead<br/><br/>We are seeking a Senior Business Development Manager to accelerate the revenue growth and development in the USA region. This individual should have extensive business development experience, especially in the FMCG industries, primarily in the USA, focusing on generating new leads, and building new partnerships.<br/><br/>In this role, you will benefit from the mentorship of highly skilled experts and you will be working in a fast-paced environment managing multiple projects at once, which involve stakeholders across the company.<br/><br/>Responsibilities:<br/><br/><ul><li>Responsible for hitting revenue targets</li><li>Work closely with other team members to execute plans for growing the business</li><li>Identify and research potential clients</li><li>Lead the effort to expand and grow client base, especially developing the USA Markets beyond the existing business</li><li>Responsible to contribute to the growth of existing customer revenue</li><li>Keep abreast of trends and market conditions to provide strategic advice to the team</li><li>Review proposals to be sent to clients</li><li>Coordinate with sales teams to develop proposals</li><li>Track, identify and add qualified prospects to sales pipeline</li><li>Negotiate contract terms with clients and communicate with stakeholders</li><li>Develop, build and maintain strong sustainable relationships with clients</li><li>Develop and manage strategic partnerships to grow business</li><li>Make and give presentations to prospective clients and internal executives</li><li>Track and report on the status of proposal components</li><li>Work with the pricing department to create rate proposals</li><li>Gather useful information from customer and competitor data</li><li>Work closely with the Marketing team and the Growth Manager to track the Revenue/Growth KPIs</li><li>Align to the Company’s Culture and participate in developing the sales team<br/><br/></li></ul>Requirements:<br/><br/><ul><li>Bachelor or equivalent degree required</li><li>10 years of experience in the Sales development in the FMCG industry</li><li>Self starter with high level of autonomy</li><li>Experience working in a start-up environment is a must</li><li>Strong project management skills and experience</li><li>Ability to work well with a team, and on a multi-cultural global basis</li><li>Super diligent, organized, very disciplined in his selling process, accountable, able to present in front of the board, with high ethical standards</li><li>Excellent commercial experience in multiple markets, building management relationships, contract negotiations etc</li><li>Excellent communication and language skills, English proficiency a must</li><li>Willingness to work in a global, multi-time zone company environment</li><li>Organized, analytical, and results-orientated individual who enjoys a fast paced entrepreneurial environment<br/><br/></li></ul>How to Apply:<br/><br/>If you are excited about this opportunity and believe you have the skills and qualifications to excel as our Senior Business Development Manager, please submit your resume and a cover letter explaining why you are the ideal candidate for the role.<br/><br/>We appreciate all applications, but only selected candidates will be contacted for an interview.<br/><br/>Thank you for considering joining the RegASK team. We look forward to reviewing your application!<br/><br/>Powered by JazzHR<br/><br/>C9G2a6vSom", "postedDate": "3 months ago", "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3922208406"}