{"jobTitle": "Shipping Clerk (68151)", "company": {"name": "The Gill Corporation", "industry": "Aviation and Aerospace Component Manufacturing", "location": "El Monte, CA"}, "location": "El Monte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Who We Are<br/><br/></strong>The Gill Corporation is one of the world's largest manufacturers of honeycomb, high performance floor panels, cargo compartment liners and original equipment for passenger and freighter aircraft. The company also excels in many other types of reinforced plastics including interior sandwich panels for creating structures such as aircraft galleys and bulkheads, honeycomb core and related products.<br/><br/><strong>Summary<br/><br/></strong>This position performs the necessary physical and clerical duties pertaining to the shipping of raw materials and parts, along with the shipping of finished product to the customers<br/><br/><strong>Essential Duties and Responsibilities </strong>include the following. Other duties may be assigned<br/><br/><ul><li>Prepares all daily shipping documentation (Shippers, BOL’s, ASN’s, SLI’s, etc) for all shipments.</li><li>Contact and schedule pick-ups with freight carriers.</li><li>Assure all orders ship complete and on a timely basis.</li><li>Coordinates with Customer Service, Quality, Materials Management, and Production Departments to expedite orders.</li><li>Maintain and send backlog report to Sales daily.</li><li>Reviews all completed documentation prior to sending to accounting/sales and filing.</li><li>Scan and file shipping documents in archive files rather than keeping of hardcopies.<br/><br/></li></ul>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Qualifications And Education (Required)<br/><br/></strong><ul><li>High School Diploma and or GED. </li><li>High School level math skills and knowledge is a must.</li><li>PC knowledge and computer skills (Microsoft Office (Word, Excel, Outlook </li><li>Good communication and interpersonal skills</li><li>Minimum 1 years’ experience in a shipping department</li><li>General knowledge of shipping procedures</li><li>Previous experience with tracking and on-line shipping (UPS, FEDEX, Customer Portals, etc)</li><li>Must be able to lift, push and pull a minimum of 50 lbs.<br/><br/></li></ul><strong>ITAR Requirement<br/><br/></strong>This position requires access to information that is subject to compliance with the International Traffic Arms Regulations (“ITAR”) and/or the Export Administration Regulations (“EAR”). In order to comply with the requirements of the ITAR and/or the EAR, applicants will be asked to provide specific documentation to verify U.S. person status under the ITAR and the EAR. A “U.S. person” according to their definition is a U.S. citizen, U.S. lawful permanent resident (green card holder), or protected individual such as a refugee, or asylee.<br/><br/><strong><em>The Gill Corporation is an Equal Opportunity Employer</em></strong><em>. Applicants for all job openings are welcome and will be considered without regard to race, religious creed, color, age, sex, gender identity, gender expression, genetic information, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, veteran status, pregnancy, childbirth and related medical conditions, or any other classification protected by federal, state, and local laws and ordinances.<br/><br/></em><strong><em>The Gill Corporation provides reasonable accommodations</em></strong><em> to qualified individuals with disabilities in accordance with the Americans with Disability Act and applicable state and local law. If you require an accommodation in the application process, please notify the Human Resources Department</em>", "responsibilities": "Prepares all daily shipping documentation (Shippers, BOL’s, ASN’s, SLI’s, etc) for all shipments. Contact and schedule pick-ups with freight carriers. Assure all orders ship complete and on a timely basis. Coordinates with Customer Service, Quality, Materials Management, and Production Departments to expedite orders. Maintain and send backlog report to Sales daily. Reviews all completed documentation prior to sending to accounting/sales and filing. Scan and file shipping documents in archive files rather than keeping of hardcopies.", "qualifications": {"required": "High School Diploma and or GED. High School level math skills and knowledge is a must. PC knowledge and computer skills (Microsoft Office (Word, Excel, Outlook Good communication and interpersonal skills Minimum 1 years’ experience in a shipping department General knowledge of shipping procedures Previous experience with tracking and on-line shipping (UPS, FEDEX, Customer Portals, etc) Must be able to lift, push and pull a minimum of 50 lbs."}, "skills": ["Shipping", "Documentation", "Freight", "Customer Service", "Microsoft Office", "Excel", "Outlook", "UPS", "FEDEX"], "postedDate": "3 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3922466876"}