{"jobTitle": "Account Executive, West (Programmatic Adtech)", "company": {"name": "Cognitiv", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "90,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "Cognitiv is the first Deep Learning Advertising Platform (DLAP). Leveraging cutting-edge deep learning technology and data science since 2015 to more accurately predict consumer behavior and understand nuance, Cognitiv enables brands to connect with their customers in more precise, relevant, impactful moments at scale. Cognitiv’s platform provides marketers with unprecedented flexibility, activating as a Dynamic Deal run through the DSP of your choice, as a managed service DSP, or through its industry-first Context GPT product. Cognitiv is on a mission to bring intelligence to advertising. We are looking for an Account Executive to join our West Coast sales team. The successful candidate is a self-motivated, seasoned professional who can identify real opportunities with a flair for a conversational, consultative approach to sales at the highest levels. As a close knit company, a winning personality and competitive spirit are required in order to fit our fun, empowering, high performance culture. This position will be a remote based position, but due to travel for sales events the candidate must be located in the Los Angeles area in order to be considered Responsibilities<br/><br/><ul><li>Prospect, pitch and close new business with brands, performance &amp; DTC marketers</li><li>Master pitching a constantly evolving and growing portfolio of products and markets</li><li>Collaborate with marketing to create effective decks and sales collateral materials</li><li> Evangelize and educate the marketplace about a hot new technology</li><li>Network at trade shows and conferences to raise Cognitiv’s profile as the industry leader</li><li>Collaborate with our partners in Ad Ops and Tech teams to execute best in class campaigns<br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>1-2 years online Account Executive experience</li><li>RTB / Programmatic or Ad Network sales expertise</li><li>Strong existing relationships and contacts with marketers and their agencies </li><li>Passion for startup culture and being a part of shaping a company</li><li>Strong ability to consistently be adaptive, creative and scrappy to get stuff done</li><li>Strong written and verbal communication skills</li><li>Intuitive, Emotional and Intellectual Intelligence<br/><br/><br/></li></ul>Salary<br/><br/><ul><li>$90,000-$120,000 Base Plus Double OTE + Equity<br/><br/><br/></li></ul>Actual compensation is based on multiple factors that are unique to each candidate, including and not limited to job-related knowledge, level of relevant experience, education and skills. Base salary is just one component of your total rewards package at Cognitiv. Employees are eligible for equity and various benefits. Here are some of the many benefits that our employees receive:<br/><br/><ul><li> Medical, Dental and Vision coverage, including some plans that are 100% employer paid</li><li> 12 weeks paid parental leave</li><li> Unlimited PTO</li><li> Hybrid work model</li><li> Lunch reimbursement</li><li> Fitness reimbursement</li><li> Cell phone reimbursement</li><li> 401(k) plan</li><li> Employee Assistance Program</li><li> Pre-tax commuter benefits Cognitiv has been revolutionizing the ad tech space for the last 7 years as the only programmatic buying platform to leverage Deep Learning in real-time. We use Deep Learning (the most sophisticated machine learning) to build custom algorithms for digital marketers to help grow their customer base. We have seen explosive growth and are looking for talented people who are looking to affect change in a rapidly growing organization and industry to join the team. Cognitiv is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law<br/></li></ul>", "responsibilities": "Prospect, pitch and close new business with brands, performance & DTC marketers\nMaster pitching a constantly evolving and growing portfolio of products and markets\nCollaborate with marketing to create effective decks and sales collateral materials\n Evangelize and educate the marketplace about a hot new technology\nNetwork at trade shows and conferences to raise Cognitiv’s profile as the industry leader\nCollaborate with our partners in Ad Ops and Tech teams to execute best in class campaigns", "qualifications": {"required": "1-2 years online Account Executive experience\nRTB / Programmatic or Ad Network sales expertise\nStrong existing relationships and contacts with marketers and their agencies \nPassion for startup culture and being a part of shaping a company\nStrong ability to consistently be adaptive, creative and scrappy to get stuff done\nStrong written and verbal communication skills\nIntuitive, Emotional and Intellectual Intelligence"}, "skills": ["Deep Learning", "Programmatic Advertising", "Sales", "Marketing", "Business Development", "Account Management", "Customer Relationship Management (CRM)"], "postedDate": "3 months ago", "benefits": "Medical, Dental and Vision coverage, including some plans that are 100% employer paid\n12 weeks paid parental leave\nUnlimited PTO\nHybrid work model\nLunch reimbursement\nFitness reimbursement\nCell phone reimbursement\n401(k) plan\nEmployee Assistance Program\nPre-tax commuter benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3922054672"}