{"jobTitle": "Sr. Director, Human Resources", "company": {"name": "PACSUN", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "187,000 - 209,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Retail and Retail Apparel and Fashion", "description": "<strong>Join the Pacsun Community</strong>\n<p><strong> </strong></p>\n<p><strong> </strong>Pacsun is dedicated to delivering an exclusive collection of the most relevant brands and styles to a community of inspired youth. Through partnerships with brands such as adidas, Brandy Melville, Essentials Fear of God, our own brands, and many more. </p>\n<p> </p>\n<p>Our Pacsun community believes in and understands the importance of using our voice, platform, and resources to inspire and bring about positive development. Our program PacCares supports and partners with organizations that align with our internal and external initiatives surrounding mental health, diversity, and equality. Join the Pacsun Community. </p>\n<p> </p>\n<p>Learn more here: LinkedIn- Our Community</p>\n<p> </p>\n<p><strong>About the Job:</strong></p>\n<p>Provide Human Resources leadership to Corporate and Field leaders, Recruiting and associates of Pacsun. Drive Company results through leadership and execution of HR initiatives and programs that maximize individual performance accountability. Promotes and implements Human Resource initiatives by planning and managing Human Resource programs. Protects and defends Pacsun in matters of legal and risk mitigation. Lead and be the example for company culture, norms, and conduct.</p>\n<p><strong> </strong></p>\n<p><strong>A day in the life, what you’ll be doing:</strong></p>\n<ul><li>Provide strategic HR partnership to leaders in the Field and Corporate Offices.</li><li>Provide leadership and direct execution of Human Resources initiatives, policies, and programs.</li><li>Develop and implement strategies to support executives, directors, and associates in performance effectiveness, leadership, and cross functional team development.</li><li>Provide leadership to team of Recruiters, coordinate company- wide recruiting and talent acquisition activities that are in line with the Company’s strategic direction and core values.</li><li>Develop and direct branding strategies to increase awareness of Pacsun as an exceptional place to work in order to attract talented individuals and broaden reach for hiring great talent.</li><li>Direct and execute seasonal hiring strategies for Field Organization.</li><li>Develop Team of HR Managers &amp; Business Partners and Recruiters, creating high performance, strong business partnership, advisory, and service excellence across the organization.</li><li>Direct updates and create Human Resource policies; ensuring legal compliance and consistency across all Pacsun business functions.</li><li>Create and implement employee relations policies to help increase employee job satisfaction.</li><li>Advise Leaders on employment law requirements as applicable.</li><li>Active leadership in delivering annual HR initiatives in support of EBITDA results.</li><li>Direct the execution of Performance Management and all other HR related initiatives.</li><li>Communicate with employees about compensation, benefits and other facets of their employment.</li><li>Resolve workplace investigations related to misconduct and company policy violations.</li><li>Mindfully protect equitable execution of company policy and employment law.</li><li>Partner with leaders across the organization to determine effective use of headcount to drive business results.</li><li>Track and translate cultural themes to actionable solutions.</li><li> Lead the company’s charitable program activities, serving as primary point of contact for external partners and internal leaders. </li><li>Administer the company’s charitable budget, providing reports of accountability based on charitable budget allocations.</li><li>Drive a culture anchored in our associate-first employee experience philosophy rooted in integrity, passion, innovation, teamwork, equity, and inclusion.</li><li>Deeply understand, model, and coach Pacsun’s core values: inspire, innovate, co-create, and take action.</li></ul>\n<p><strong> </strong></p>\n<p><strong>What it takes to Join: </strong></p>\n<p> </p>\n<ul><li>College degree preferred. PHR or SPHR certified through HRCI a plus.</li><li>10+ years of related Human Resources, Employee Relations and Recruiting experience.</li><li>10+ years of previous experience in leading and developing a team of HR Managers and Recruiters.</li><li>Ability to read, analyze, and interpret general business reports, technical procedures, or governmental regulations.</li><li>Advanced knowledge of Excel, Word and Powerpoint.</li><li>Ability to write reports, executive summaries, business correspondence, and procedure manuals.</li><li>Ability to define problems, collect data, establish facts, and draw valid conclusions.</li><li>Ability to effectively present information and respond to questions from groups of executives, managers/supervisors, clients, customers, and the general public.</li><li>Excellent oral and written communication and presentation skills.</li></ul>\n<p> </p>\n<p><strong> </strong></p>\n<p><strong>Developing the Community/ Leadership Qualities:</strong></p>\n<ul><li>Operate with the highest level of conduct, integrity, and confidentiality; setting the example for leaders and associates.</li><li>Develop and nurture strong cross functional partnerships; driving business results and inspiring a culture of transparency, collaboration, and accountability.</li><li>Serve as a Pacsun advocate in the industry and marketplace.</li><li>Recruit, identify, develop, and retain talent that delivers performance excellence.</li><li>As a manager, serve as a leader of company culture, norms, and conduct.</li><li>Ability to balance a strong management presence with a high level of approachability, encouraging and eliciting associate feedback and interaction.</li><li>Lead the company’s charitable and philanthropic program initiatives, serving as primary point of contact for external partners and internal leaders.</li><li>Administer the company’s charitable budget, providing reports of accountability based on charitable budget allocations.</li></ul>\n<p> </p>\n<p><strong>Salary Range</strong>: $187,000 - $209,000</p>\n<p> </p>\n<p><strong> </strong></p>\n<p><strong>Pac Perks:</strong></p>\n<p><br/></p>\n<p>· HQ workforce of 60%+ people of color</p>\n<p>· Dog friendly office environment</p>\n<p>· On-site Cafe</p>\n<p>· On-site Gym</p>\n<p>· $1,000 referral incentive program</p>\n<p>· Generous associate discount of 30-50% off merchandise online and in-stores</p>\n<p>· Competitive long term and short-term incentive program</p>\n<p>· Immediate 100% vested 401K contributions and employer match</p>\n<p>· Calm Premium access for all employees</p>\n<p>· Employee perks throughout the year</p>\n<p><br/></p>\n<p><strong>Physical Requirements:</strong></p>\n<p> </p>\n<p>The physical demands described here are representative of those that are required by an associate to successfully perform the essential functions of this job. </p>\n<ul><li>While performing the duties of this job, the associate is regularly required to talk or hear. The associate is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms.</li><li>Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus.</li><li>Ability to work in open environment with fluctuating temperatures and standard lighting.</li><li>Ability to work on computer and mobile phone for multiple hours; with frequent interruptions.</li><li>Required to travel in elevator or stairwells to attend meetings and engage with associates on multiple floors throughout building.</li><li>Hotel, Airplane, and Car Travel may be required.</li></ul>\n<p><strong> </strong></p>\n<p><strong>Position Type/Expected Hours of Work:</strong></p>\n<p> </p>\n<p>This is a full-time position. As a National Retailer, occasional evening and/or weekend work may be required during periods of high volume. This role operates in a professional office environment and routinely uses standard office equipment.</p>\n<p> </p>\n<p><strong>Other Considerations:</strong></p>\n<p> </p>\n<p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the associate for this job. Duties, responsibilities and activities may change at any time with or without notice. Reasonable accommodations may be made to qualified individuals with disabilities to enable them to perform the essential functions of the role.</p><p></p>", "responsibilities": "Provide Human Resources leadership to Corporate and Field leaders, Recruiting and associates of Pacsun. Drive Company results through leadership and execution of HR initiatives and programs that maximize individual performance accountability. Promotes and implements Human Resource initiatives by planning and managing Human Resource programs. Protects and defends Pacsun in matters of legal and risk mitigation. Lead and be the example for company culture, norms, and conduct.", "qualifications": {"required": "College degree preferred. PHR or SPHR certified through HRCI a plus.\n10+ years of related Human Resources, Employee Relations and Recruiting experience.\n10+ years of previous experience in leading and developing a team of HR Managers and Recruiters.\nAbility to read, analyze, and interpret general business reports, technical procedures, or governmental regulations.\nAdvanced knowledge of Excel, Word and Powerpoint.\nAbility to write reports, executive summaries, business correspondence, and procedure manuals.\nAbility to define problems, collect data, establish facts, and draw valid conclusions.\nAbility to effectively present information and respond to questions from groups of executives, managers/supervisors, clients, customers, and the general public.\nExcellent oral and written communication and presentation skills.", "preferred": ""}, "skills": ["Excel", "Word", "Powerpoint", "Human Resources", "Employee Relations", "Recruiting"], "postedDate": "1 week ago", "benefits": "HQ workforce of 60%+ people of color\nDog friendly office environment\nOn-site Cafe\nOn-site Gym\n$1,000 referral incentive program\nGenerous associate discount of 30-50% off merchandise online and in-stores\nCompetitive long term and short-term incentive program\nImmediate 100% vested 401K contributions and employer match\nCalm Premium access for all employees\nEmployee perks throughout the year", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3923634863"}