{"jobTitle": "District Service Manager - California", "company": {"name": "Hologic, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "150,000.00/yr - 190,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Medical Equipment Manufacturing", "description": "Here at Hologic, we are driven by our passion to become the global champion for women’s health.<br/><br/>We achieve this by fulfilling our promise to bring The Science of Sure to life.<br/><br/>As a leading innovator of women’s health, we are empowering people to live healthier lives everywhere, every day.<br/><br/>Our Global Service Operations team moves at light speed! We aim to be nimble, and drive creative problem solving and innovation. We're seeking a highly skilled and experienced Service Manager to lead the California Field Service Team. This role is responsible for overseeing all Service Operations, ensuring customer satisfaction, managing performance, and driving continuous improvement across the region. The District Service Manager plays a crucial role in maintaining our high levels of Field Service delivery. This role is highly dynamic, requires strong engagement and leadership skill, and the ability to oversee and execute on multiple areas of work simultaneously.<br/><br/><strong>Summary Of Duties And Responsibilities<br/><br/></strong><ul><li>Responsible for total customer satisfaction and prompt resolution of Hologic equipment problems.</li><li>Audit field engineer activity, verify that all preventative and corrective maintenance actions are performed in a timely fashion, reported to Hologic, and done in accordance with established policies and procedures.</li><li>Coordinate service to customers to ensure efficient use of resources and maximize customer uptime.</li><li>Actively manage and track unused and failed service parts and ensure their timely return.</li><li>Review and analyze district performance measurements, implement corrective action when needed.</li><li>Provide effective guidance to assigned field engineers, set appropriate expectation levels, and inspire others to perform to their maximum potential.</li><li>Ensure all assigned personnel are properly trained and meet regulatory training requirements related to the servicing of Hologic products.</li><li>Manage assigned company assets (tools, test equipment, replacement parts) to ensure they are adequately allocated and properly deployed to minimize expense and maximize efficiency.</li><li>Manage the business for the assigned district with the utilization of trending and tracking reports.</li><li>Analyze data and prepare reports on product service issues</li><li>Provide and/or facilitate on-site and remote support to customers and assigned personnel as required.</li><li>Provide pre- and post-sales support; maintain close working relationships with field sales management and other sales personnel to ensure customer’s needs are met.</li><li>Ensure Hologic products are installed per specification, in a professional manner, consistent with customer requirements.</li><li>Manage revenue and control expenses within budgetary guidelines and company expectations.</li><li>Create and implement strategies to increase service revenue and profitability. Work with FEs, and develop programs to increase service revenue (contract, billable, PMs, relo, etc.).</li><li>Ensure compliance to all regulatory requirements and that all aspects of DQSM are understood and adhered to by assigned personnel.</li><li>Convey and support Hologic’s Vision, Strategies and Imperatives to team. </li><li>Complete and conduct annual performance appraisals for all assigned personnel.</li><li>Respond to customer inquiries in written form, in person, or via telephone as needed.</li><li>Ensure that all assigned personnel complete and submit all required paperwork and reports accurately and on time.</li><li>Perform other duties and projects as assigned by service management.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must be people oriented (coach, motivator, mentor, team builder).</li><li>Ability to work under minimal supervision in a fast-paced environment.</li><li>Capable of quickly resolving constantly changing work schedules and priorities and handling multiple concurrent tasks.</li><li>Proven ability to supervise remote, field-based personnel.</li><li>Must be flexible, able to maintain composure, communicate professionally, and demonstrate excellent problem-solving skills when dealing with upset customers and assigned personnel.</li><li>Position requires frequent travel and ability to travel on short notice.<br/><br/></li></ul><strong>Education<br/><br/></strong><ul><li>Associates degree, or equivalent, in electronics or a related technical discipline. A degree in business administration or management desirable Experience</li><li>A minimum of 8 - 12 years of experience in a service environment working with customers to resolve problems related to x-ray, digital imaging, or related medical diagnostic equipment</li><li>At least 2 – 3 years of experience in a leadership or managerial role<br/><br/></li></ul><strong>Specialized Knowledge<br/><br/></strong><ul><li>Must be proficient with Windows software (Word, Excel)</li><li>Strong customer relations and communications skills, both verbal and written. Ability to manage service business and personnel.<br/><br/></li></ul>The total compensation range for this role is $150,000 - $190,000. This is based on a base salary and commission plan combination. Final compensation packages will ultimately depend on factors including relevant experience, skillset, knowledge, territory/ geography, education, business needs, market demand and performance versus quota.<br/><br/>Why join Hologic?<br/><br/>We are committed to making Hologic the destination for top talent. For you to succeed, we want to enable you with the tools and knowledge required and so we provide comprehensive training when you join as well as continued development and training throughout your career.<br/><br/>From a benefits perspective, you will have a access to benefits such as medical and dental insurance, ESPP, 401(k) plan, vacation, sick leave and holidays, parental leave, wellness program and many more!<br/><br/>Agency and Third-Party Recruiter Notice:<br/><br/>Agencies that submit a resume to Hologic must have a current executed Hologic Agency Agreement executed by a member of the Human Resource Department. In addition, Agencies may only submit candidates to positions for which they have been invited to do so by a Hologic Recruiter. All resumes must be sent to the Hologic Recruiter under these terms or they will not be considered.<br/><br/>Hologic, Inc. is proud to be an Equal Opportunity Employer inclusive of disability and veterans.<br/><br/>#Manager-level<br/><br/>", "responsibilities": "Responsible for total customer satisfaction and prompt resolution of Hologic equipment problems.\nAudit field engineer activity, verify that all preventative and corrective maintenance actions are performed in a timely fashion, reported to Hologic, and done in accordance with established policies and procedures.\nCoordinate service to customers to ensure efficient use of resources and maximize customer uptime.\nActively manage and track unused and failed service parts and ensure their timely return.\nReview and analyze district performance measurements, implement corrective action when needed.\nProvide effective guidance to assigned field engineers, set appropriate expectation levels, and inspire others to perform to their maximum potential.\nEnsure all assigned personnel are properly trained and meet regulatory training requirements related to the servicing of Hologic products.\nManage assigned company assets (tools, test equipment, replacement parts) to ensure they are adequately allocated and properly deployed to minimize expense and maximize efficiency.\nManage the business for the assigned district with the utilization of trending and tracking reports.\nAnalyze data and prepare reports on product service issues\nProvide and/or facilitate on-site and remote support to customers and assigned personnel as required.\nProvide pre- and post-sales support; maintain close working relationships with field sales management and other sales personnel to ensure customer’s needs are met.\nEnsure Hologic products are installed per specification, in a professional manner, consistent with customer requirements.\nManage revenue and control expenses within budgetary guidelines and company expectations.\nCreate and implement strategies to increase service revenue and profitability. Work with FEs, and develop programs to increase service revenue (contract, billable, PMs, relo, etc.).\nEnsure compliance to all regulatory requirements and that all aspects of DQSM are understood and adhered to by assigned personnel.\nConvey and support Hologic’s Vision, Strategies and Imperatives to team. \nComplete and conduct annual performance appraisals for all assigned personnel.\nRespond to customer inquiries in written form, in person, or via telephone as needed.\nEnsure that all assigned personnel complete and submit all required paperwork and reports accurately and on time.\nPerform other duties and projects as assigned by service management.", "qualifications": {"required": "Must be people oriented (coach, motivator, mentor, team builder).\nAbility to work under minimal supervision in a fast-paced environment.\nCapable of quickly resolving constantly changing work schedules and priorities and handling multiple concurrent tasks.\nProven ability to supervise remote, field-based personnel.\nMust be flexible, able to maintain composure, communicate professionally, and demonstrate excellent problem-solving skills when dealing with upset customers and assigned personnel.\nPosition requires frequent travel and ability to travel on short notice.", "preferred": "Associates degree, or equivalent, in electronics or a related technical discipline. A degree in business administration or management desirable Experience\nA minimum of 8 - 12 years of experience in a service environment working with customers to resolve problems related to x-ray, digital imaging, or related medical diagnostic equipment\nAt least 2 – 3 years of experience in a leadership or managerial role"}, "skills": ["Windows", "Word", "Excel", "Customer Relations", "Communications"], "postedDate": "1 week ago", "benefits": "medical and dental insurance, ESPP, 401(k) plan, vacation, sick leave and holidays, parental leave, wellness program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3923663406"}