{"jobTitle": "Senior Configuration and Data Management Analyst - Engines", "company": {"name": "Blue Origin", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Aviation and Aerospace Component Manufacturing", "description": "At Blue Origin, we envision millions of people living and working in space for the benefit of Earth. We’re working to develop reusable, safe, and low-cost space vehicles and systems within a culture of safety, collaboration, and inclusion. Join our diverse team of problem solvers as we add new chapters to the history of spaceflight! <br/><br/>We are a diverse team of collaborators, doers, and problem-solvers who are relentlessly committed to a culture of safety. This position will directly impact the history of space exploration and will require your commitment and detailed attention toward safe and repeatable space flight. Join us in lowering the cost of access to space and enabling Blue Origin’s vision of millions of people living and working in space to benefit Earth.<br/><br/>As part of a hardworking team of diverse specialists and engineers, you will help improve effectiveness and overall product quality across the product lifecycle by driving activities related to Engines Configuration Management. In this position, you will perform change analysis activities including managing change requests, supporting change impact identification, facilitating change boards, and updating change implementation tasks. These activities will support Blue Origin’s commitment to accurate and on-time delivery of meaningful artifacts and ensure known configuration is maintained.<br/><br/>We are seeking an individual with excellent oral, written, interpersonal, and analytical skills who can thrive in a fast-paced environment. You will share in the team’s impact on all aspects of the engine product lifecycle.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Lead in establishing a world-class Configuration Management structure</li><li>Ensure configuration and data management principles meet customer requirements</li><li>Mentor internal team members in Configuration Management</li><li>Develop training materials and conduct sessions</li><li>Establish product and process metrics for performance improvement</li><li>Provide timely configuration and data management services for engine product teams</li><li>Assess and document proposed configuration changes</li><li>Identify and implement system and process improvements<br/><br/></li></ul>We are looking for someone to apply their technical expertise, leadership skills, and commitment to quality to positively impact safe human spaceflight. Passion for our mission and vision is required!<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>BA/BS in a related discipline</li><li>8+ years in product configuration management in a regulated environment</li><li>Proficiency in world-class configuration management toolsets</li><li>Strong organizational and coordination skills</li><li>Excellent communication and presentation abilities</li><li>Proficiency in product lifecycle management and Microsoft Office</li><li>Must be able to work onsite.</li><li>Must be a U.S. citizen or national, U.S. permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.<br/><br/></li></ul><strong>Desired<br/><br/></strong><ul><li>CMII certification/training</li><li>Aerospace industry experience</li><li>Technical writing proficiency related to process and policy development</li><li>Experience with various tools and databases</li><li>Familiarity with Export Control regulations<br/><br/></li></ul><strong>Compensation Range For<br/><br/></strong>CA applicants is $115,935.00-$162,309.00;WA applicants is $115,935.00-$162,309.00<br/><br/><strong>Other Site Ranges May Differ<br/><br/></strong><strong>Applications will be accepted on an ongoing basis until the requisition is closed.<br/><br/></strong><strong>Inclusivity Statement<br/><br/></strong>Don’t meet all desired requirements? Studies have shown that some people are less likely to apply to jobs unless they meet every single desired qualification. At Blue Origin, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every desired qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>Export Control Regulations<br/><br/></strong>Applicants for employment at Blue Origin must be a U.S. citizen or national, U.S. permanent resident (i.e. current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.<br/><br/><strong>Benefits<br/><br/></strong>Benefits include: Medical, dental, vision, basic and supplemental life insurance, paid parental leave, short and long-term disability, 401(k) with a company match of up to 5%, and an Education Support Program.<br/><br/>Paid Time Off: Up to four (4) weeks per year based on weekly scheduled hours, and up to 14 company-paid holidays.<br/><br/>Discretionary bonus: Bonuses are designed to reward individual contributions as well as allow employees to share in company results.<br/><br/>Eligibility for benefits varies by role type, please check with your recruiter for a comprehensive list of the benefits available for this role.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Blue Origin is proud to be an Equal Opportunity/Affirmative Action Employer and is committed to attracting, retaining, and developing a highly qualified, diverse, and dedicated work force. Blue Origin hires and promotes people on the basis of their qualifications, performance, and abilities. We support the establishment and maintenance of a workplace that fosters trust, equality, and teamwork, in which all employees recognize and appreciate the diversity of individual team members. We provide all qualified applicants for employment and employees with equal opportunities for hire, promotion, and other terms and conditions of employment, regardless of their race, color, religion, gender, sexual orientation, gender identity, national origin/ethnicity, age, physical or mental disability, genetic factors, military/veteran status, or any other status or characteristic protected by federal, state, and/or local law. Blue Origin will consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state, and local laws, including the Washington Fair Chance Act, the California Fair Chance Act, the Los Angeles Fair Chance in Hiring Ordinance, and other applicable laws. For more information on “EEO Is the Law,” please see here.<br/><br/><strong>Affirmative Action and Disability Accommodation<br/><br/></strong>Applicants wishing to receive information on Blue Origin’s Affirmative Action Plans, or applicants requiring a reasonable accommodation in order to participate in the application and/or interview process, please contact us at EEOCompliance@blueorigin.com.<br/><br/><strong>California Applicant Privacy Notice<br/><br/></strong>If you are a California resident, please reference the CA Applicant Privacy Notice here.", "responsibilities": "Lead in establishing a world-class Configuration Management structure\nEnsure configuration and data management principles meet customer requirements\nMentor internal team members in Configuration Management\nDevelop training materials and conduct sessions\nEstablish product and process metrics for performance improvement\nProvide timely configuration and data management services for engine product teams\nAssess and document proposed configuration changes\nIdentify and implement system and process improvements", "qualifications": {"required": "BA/BS in a related discipline\n8+ years in product configuration management in a regulated environment\nProficiency in world-class configuration management toolsets\nStrong organizational and coordination skills\nExcellent communication and presentation abilities\nProficiency in product lifecycle management and Microsoft Office\nMust be able to work onsite.\nMust be a U.S. citizen or national, U.S. permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.", "preferred": "CMII certification/training\nAerospace industry experience\nTechnical writing proficiency related to process and policy development\nExperience with various tools and databases\nFamiliarity with Export Control regulations"}, "skills": ["Configuration Management", "Product Lifecycle Management", "Microsoft Office", "Training", "Communication", "Presentation Skills", "Technical Writing", "Process Development", "Policy Development", "Database Management", "Export Control"], "postedDate": "1 week ago", "benefits": "Benefits include: Medical, dental, vision, basic and supplemental life insurance, paid parental leave, short and long-term disability, 401(k) with a company match of up to 5%, and an Education Support Program.\nPaid Time Off: Up to four (4) weeks per year based on weekly scheduled hours, and up to 14 company-paid holidays.\nDiscretionary bonus: Bonuses are designed to reward individual contributions as well as allow employees to share in company results.\nEligibility for benefits varies by role type, please check with your recruiter for a comprehensive list of the benefits available for this role.", "remoteWork": "No", "salary": {"amount": "115,935.00-$162,309.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3923616176"}