{"jobTitle": "Section Manager, Operations", "company": {"name": "Skyworks Solutions, Inc.", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "USD $87,600 - $167,900 per year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Semiconductor Manufacturing, Telecommunications, and Wireless Services", "description": "If you are looking for a challenging and exciting career in the world of technology, then look no further. Skyworks is an innovator of high-performance analog semiconductors whose solutions are powering the wireless networking revolution. Through our broad technology expertise and one of the most extensive product portfolios in the industry, we are Connecting Everyone and Everything, All the Time.<br/><br/>At Skyworks, you will find a fast-paced environment with a strong focus on global collaboration, minimal layers of management, and the freedom to make meaningful contributions in a setting that encourages creative thinking. We value open communication, mutual trust, and respect. We are excited about the opportunity to work with you and glad you want to be part of a team of talented individuals who together are changing the way the world communicates.<br/><br/>Requisition ID: 72276<br/><br/>Description<br/><br/>Seeking a self-motivated, enthusiastic team player with a “can-do” attitude and sense of urgency to oversee the manufacturing floor. Directly manage equipment manufacturing technicians to create and achieve goals supporting Skyworks’ overall company objectives. Lead the team to maximize factory performance in terms of safety, quality, yield, utilization, throughput and output while minimizing costs, meeting budgets and keeping high factory morale and engagement. Work cross-functionally as a team with other groups in the company (EES, Process Engineering, Advance Technology Group, Facilities, Industrial Engineering, Production Control, Quality, etc.) to ensure manufacturing needs are being met while also supporting the needs of the other groups to ensure the overall success of Newbury Park Operations.<br/><br/>Responsibilities<br/><br/>• Monitor and Plan and schedule work assignments based upon issues and personnel available to perform duties to minimize downtime of production equipment<br/>• Responsible for enhancing, defining, developing, maintaining and verifying maintenance operations.<br/>• Take the lead in the identification of roadblocks and plan workarounds in a proactive manner.<br/>•  Manage equipment maintenance actions ensuring root-cause corrective actions are taken while ensuring minimal tool/facilities down time.<br/>• Manage and coordinate multiple complex tasks associated with equipment issues and establishing priorities by effectively collaborating with all levels of the manufacturing process.<br/>• Manage, coordinate and schedule PTO for EES personnel. Scheduling of overtime as needed to cover vacations, sicknesses and workload variations.<br/>• Monitor and adhere to “tool down” escalation plans whenever an “equipment down” condition cannot be resolved with resources available.<br/><br/>Responsibilities Con't.<br/><br/>• Provides guidance to subordinates within the latitude of established company policies.<br/>•  Ensures personnel adhere to all company’s policies and procedures. Encourage and maintain behaviors consistent with the Skyworks Work Style and organizational values.<br/>• Monitor tactical issues and metrics-MTTR, MTBF, Fab moves PM scheduling, and availability goals.<br/>• Weekly accounting and approval of the technician's timekeeping for payroll purposes.<br/>• When necessary investigate equipment PLD’s, ICAR’s or other associated corrective actions and dispatch information accordingly.<br/>• Coordinate ERT events with Incident Commander, Safety Engineer, and production management as they occur. Ensure that all ERT events are properly documented and debriefings are held promptly to discuss lessons learned.<br/><br/>Required Experience And Skills<br/><br/>• Bachelor of Science degree (or equivalent years of experience) with an emphasis on Engineering, Business Administration, or a related field.<br/>• 5 years of direct relevant experience.<br/>• Firm understanding of electro-mechanical interfaces and solid troubleshooting techniques.<br/>• Demonstrated experience in managerial leadership and teambuilding skills.<br/>• Effective verbal and written communicational skills including technical writing and presentation skills.<br/>• Ability to manage change, develop staff, and set both long and short-term goals.<br/><br/>Preferred Experience And Skills<br/><br/>• Semiconductor industry preferred.<br/><br/>The typical base pay range for this role across the U.S. is currently USD $87,600 - $167,900 per year. Starting base pay will depend on relevant experience and skills, training and education, business needs, market demands, the ultimate job duties and requirements, and work location. Skyworks has different base pay ranges for different work locations in the U.S. Benefits include access to healthcare benefits (including a premium-free medical plan option), a 401(k) plan and company match, an employee stock purchase plan, paid time off (including vacation, sick/wellness, parental leave), among others. Employees are eligible to participate in an incentive plan, and certain roles are also eligible for additional awards, including recognition and stock. These incentives and awards are based on individual and/or company performance.<br/><br/>Skyworks is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Skyworks strives to create an accessible workplace; if you need an accommodation due to a disability, please contact us at accommodations@skyworksinc.com.", "responsibilities": "• Monitor and Plan and schedule work assignments based upon issues and personnel available to perform duties to minimize downtime of production equipment<br/>• Responsible for enhancing, defining, developing, maintaining and verifying maintenance operations.<br/>• Take the lead in the identification of roadblocks and plan workarounds in a proactive manner.<br/>•  Manage equipment maintenance actions ensuring root-cause corrective actions are taken while ensuring minimal tool/facilities down time.<br/>• Manage and coordinate multiple complex tasks associated with equipment issues and establishing priorities by effectively collaborating with all levels of the manufacturing process.<br/>• Manage, coordinate and schedule PTO for EES personnel. Scheduling of overtime as needed to cover vacations, sicknesses and workload variations.<br/>• Monitor and adhere to “tool down” escalation plans whenever an “equipment down” condition cannot be resolved with resources available.<br/><br/>Responsibilities Con't.<br/><br/>• Provides guidance to subordinates within the latitude of established company policies.<br/>•  Ensures personnel adhere to all company’s policies and procedures. Encourage and maintain behaviors consistent with the Skyworks Work Style and organizational values.<br/>• Monitor tactical issues and metrics-MTTR, MTBF, Fab moves PM scheduling, and availability goals.<br/>• Weekly accounting and approval of the technician's timekeeping for payroll purposes.<br/>• When necessary investigate equipment PLD’s, ICAR’s or other associated corrective actions and dispatch information accordingly.<br/>• Coordinate ERT events with Incident Commander, Safety Engineer, and production management as they occur. Ensure that all ERT events are properly documented and debriefings are held promptly to discuss lessons learned.", "qualifications": {"required": "• Bachelor of Science degree (or equivalent years of experience) with an emphasis on Engineering, Business Administration, or a related field.<br/>• 5 years of direct relevant experience.<br/>• Firm understanding of electro-mechanical interfaces and solid troubleshooting techniques.<br/>• Demonstrated experience in managerial leadership and teambuilding skills.<br/>• Effective verbal and written communicational skills including technical writing and presentation skills.<br/>• Ability to manage change, develop staff, and set both long and short-term goals.", "preferred": "• Semiconductor industry preferred."}, "skills": [], "postedDate": "1 week ago", "benefits": "Benefits include access to healthcare benefits (including a premium-free medical plan option), a 401(k) plan and company match, an employee stock purchase plan, paid time off (including vacation, sick/wellness, parental leave), among others. Employees are eligible to participate in an incentive plan, and certain roles are also eligible for additional awards, including recognition and stock. These incentives and awards are based on individual and/or company performance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3924645716"}