{"jobTitle": "Contracts Manager", "company": {"name": "Rocket Lab", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "About Rocket Lab<br/><br/>Rocket Lab is a global leader in launch and space systems. The rockets and satellites we build and launch enable some of the most ambitious and vital space missions globally, supporting scientific exploration, Earth observation and missions to combat climate change, national security, and exciting new technology demonstrations. Our Electron rocket has provided reliable access to orbit since 2018, becoming one of the most frequently launched rockets in the world. Neutron will be our next rocket on the launch pad, an advanced 13-tonne payload class, reusable rocket to launch the mega constellations of the future. Our space systems business includes our extensive line of satellites and components that have enabled more than 1,700 missions including the James Webb Space Telescope, NASA Psyche Mission, Artemis I, Mars Ingenuity helicopter, and more.<br/><br/>Join our pioneering team and launch your career to new heights!<br/><br/>CONTRACTS MANAGER<br/><br/>The Contracts Manager will be responsible for contract administration and compliance across the Rocket Lab enterprise in support of multiple types of U.S. Government and commercial contracts to ensure we meet our contractual obligations and performance milestones. This position is primarily focused in the areas of space systems, launch services, as well as the full catalog of Rocket Lab’s products and services.<br/><br/>What You'll Get To Do<br/><br/><ul><li>Negotiates and administers government contracts, commercial contracts, subcontracts non-disclosure agreements, teaming agreements and IP licenses.</li><li>In partnership with Legal, Drafts and negotiates master service agreements, master supply agreements, and launch services agreements with oversight from Contracts Leadership.</li><li>In partnership with Legal, occasionally drafts and negotiates non-routine agreements with oversight from Contracts Leadership.</li><li>Ensures that payment and other obligations under executed agreements are handled appropriately, in conjunction with Finance and Accounting.</li><li>Analyzes model contract terms and conditions for implications on the program and corporation at large; disseminates this information to internal stakeholders and leadership.</li><li>Serves as the primary customer interface for all contractual compliance matters, including: changes, disputes, or requests for equitable adjustment during contract performance.</li><li>Assists the program and business development teams in proposal review and preparation in response to Government and commercial solicitations, as well as RFIs.</li><li>Creates and maintains contract and business files.</li><li>Establishes and maintains excellent relationships with Government and other customer counterparts.<br/><br/><br/></li></ul>You'll Bring These Qualifications<br/><br/><ul><li>Bachelor’s degree and 5+ years of contract administration and/or management experience</li><li>5+ years of direct management of government contracts of various types (CPFF, FFP, T&amp;M, OT, LSA, MSA, etc.)</li><li>3+ years of experience managing subcontracts as the prime and supplier subcontracts</li><li>Extensive experience in terms and conditions reviews and the protection of intellectual property concerns.</li><li>Working understanding of legal issues and terminology, including but not limited to, intellectual property, indemnity, privacy, and confidentiality issues.</li><li>Demonstrated experience working with databases and enterprise business systems.</li><li>Proficient with standard office suites such as ERPs, Microsoft Office, SharePoint, MS Teams.</li><li>Knowledge of Government contracts and contract types, the Federal Acquisition Regulation (FAR) and Defense Federal Acquisition Regulation (DFAR).</li><li>Ability to obtain and maintain a DoD Top Secret security clearance<br/><br/><br/></li></ul>These Qualifications Woul Be Nice Have<br/><br/><ul><li>Extensive knowledge of the NASA FAR Supplement (NFS).</li><li>Experience managing DoD and NASA prime contracts and/or subcontracts supporting DoD and NASA programs.</li><li>Experience with Export Control, ITAR and EAR.</li><li>Experience with financial, property and governmental agency audits.</li><li>Experience with Salesforce and Smartsheet.</li><li>Experience with CLM systems like DocuSign.</li><li>Must leverage critical thinking skills to be able to solve problems independently and creatively.</li><li>Strong time management, prioritization, and organizational skills.</li><li>Detail oriented, team player attitude, high work ethic and reliability.</li><li>Must be able to effectively communicate with engineers, scientists, attorneys, and industry executives.</li><li>Ability to work independently as a self-starter, influence stakeholders through effective communication, and handle multiple priorities in a fast-paced, high-pressure environment.<br/><br/><br/></li></ul>Additional Requirements<br/><br/><ul><li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception, and the ability to focus. </li><li>Regularly required to sit, use hands and fingers, operate computer keyboard and controls, and communicate verbally and in writing. </li><li>Must be physically able to commute to buildings </li><li>Occasional exposure to dust, fumes and moderate levels of noise. <br/><br/><br/></li></ul>Level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one component of our total rewards package at Rocket Lab. Employees may also receive company equity and access to a robust benefits package including: top tier medical HMO, PPO &amp; a 100% company-sponsored medical HSA plan option, dental and vision coverage, 3 weeks paid vacation and 5 days sick leave per year, 11 paid holidays per year, flexible spending and dependent care savings accounts, paid parental leave, disability insurance, life insurance, and access to a 401(k) retirement plan with company match. Other perks include: Discounted employee stock purchase program, subsidized EV charging stations, onsite gym, food and drinks, childcare concierge, and other discounts.<br/><br/>Eligibility for benefits may vary based on employment status, please check with your recruiter for a comprehensive list of the benefits available for this role. Benefit programs are subject to change at the company’s discretion.<br/><br/>Base Pay Range (CA Only)<br/><br/>$85,000 — $145,000 USD<br/><br/>What To Expect<br/><br/>We’re on a mission to unlock the potential of space to improve life on Earth, but that’s not an easy task. It takes hard work, determination, relentless innovation, teamwork, grit, and an unwavering commitment to achieving what others often deem impossible. Our people out-think, out-work and out-pace. We pride ourselves on having each other’s backs, checking our egos at the door, and rolling up our sleeves on all tasks big and small. We thrive under pressure, work to tight deadlines, and our focus is always on how we can deliver, rather than dwelling on the challenges that stand in the way.<br/><br/>Important Information<br/><br/>FOR CANDIDATES SEEKING TO WORK IN US OFFICES ONLY:<br/><br/>To conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR), Rocket Lab Employees must be a U.S. citizen, lawful U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum, or be eligible to obtain the required authorizations from the U.S. Department of State and/or the U.S. Department of Commerce, as applicable. Learn more about ITAR<br/><br/>Rocket Lab provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment at Rocket Lab, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/>Applicants requiring a reasonable accommodation for the application/interview process for a job in the United States should contact Giulia Biow at<br/><br/>FOR CANDIDATES SEEKING TO WORK IN NEW ZEALAND OFFICES ONLY:<br/><br/>For security reasons background checks will be undertaken prior to any employment offers being made to an applicant. These checks will include nationality checks as it is a requirement of this position that you be eligible to access equipment and data regulated by the United States' International Traffic in Arms Regulations.<br/><br/>Under these Regulations, you may be ineligible for this role if you do not hold citizenship of Australia, Japan, New Zealand, Switzerland, the European Union or a country that is part of NATO, or if you hold ineligible dual citizenship or nationality. For more information on these Regulations, click here", "responsibilities": "The Contracts Manager will be responsible for contract administration and compliance across the Rocket Lab enterprise in support of multiple types of U.S. Government and commercial contracts to ensure we meet our contractual obligations and performance milestones. This position is primarily focused in the areas of space systems, launch services, as well as the full catalog of Rocket Lab’s products and services.", "qualifications": {"required": "Bachelor’s degree and 5+ years of contract administration and/or management experience\n5+ years of direct management of government contracts of various types (CPFF, FFP, T&M, OT, LSA, MSA, etc.)\n3+ years of experience managing subcontracts as the prime and supplier subcontracts\nExtensive experience in terms and conditions reviews and the protection of intellectual property concerns.\nWorking understanding of legal issues and terminology, including but not limited to, intellectual property, indemnity, privacy, and confidentiality issues.\nDemonstrated experience working with databases and enterprise business systems.\nProficient with standard office suites such as ERPs, Microsoft Office, SharePoint, MS Teams.\nKnowledge of Government contracts and contract types, the Federal Acquisition Regulation (FAR) and Defense Federal Acquisition Regulation (DFAR).\nAbility to obtain and maintain a DoD Top Secret security clearance", "preferred": "Extensive knowledge of the NASA FAR Supplement (NFS).\nExperience managing DoD and NASA prime contracts and/or subcontracts supporting DoD and NASA programs.\nExperience with Export Control, ITAR and EAR.\nExperience with financial, property and governmental agency audits.\nExperience with Salesforce and Smartsheet.\nExperience with CLM systems like DocuSign.\nMust leverage critical thinking skills to be able to solve problems independently and creatively.\nStrong time management, prioritization, and organizational skills.\nDetail oriented, team player attitude, high work ethic and reliability.\nMust be able to effectively communicate with engineers, scientists, attorneys, and industry executives.\nAbility to work independently as a self-starter, influence stakeholders through effective communication, and handle multiple priorities in a fast-paced, high-pressure environment."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Base salary is just one component of our total rewards package at Rocket Lab. Employees may also receive company equity and access to a robust benefits package including: top tier medical HMO, PPO &amp; a 100% company-sponsored medical HSA plan option, dental and vision coverage, 3 weeks paid vacation and 5 days sick leave per year, 11 paid holidays per year, flexible spending and dependent care savings accounts, paid parental leave, disability insurance, life insurance, and access to a 401(k) retirement plan with company match. Other perks include: Discounted employee stock purchase program, subsidized EV charging stations, onsite gym, food and drinks, childcare concierge, and other discounts.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3924461256"}