{"jobTitle": "Life Insurance Sales Agent (Remote)", "company": {"name": "Hirsh Marketing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "10K-15K Monthly (Uncapped)", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "<strong>Compensation:</strong> 10K-15K Monthly (Uncapped)<br/><br/><ul><li>100% Commission<br/><br/></li></ul><strong>Schedule:</strong> Employee's choice<br/><br/><strong>Location: </strong>Work from Home!!!<br/><br/><strong>Work/Life Balance: </strong>100%<br/><br/>How about TODAY being the day you take back your life and secure your future?<br/><br/>The finance industry makes more millionaires than any other industry in the World!<br/><br/>My name is Beau Hirshfield founder and owner of The Hirsh Agency, and we are looking for new INDEPENDENT LIFE INSURANCE AGENTS who are ready to learn the business, work hard, have fun, and finally earn what you’re worth.<br/><br/><strong>NO COLD CALLING!<br/><br/></strong>You will be selling life insurance ONLY to people who have already reached out and asked for someone to help them with life insurance.<br/><br/>NO membership fees, dues, franchise fees, etc.<br/><br/>NO sales quotas, no condescending bosses, no sleazy sales tactics, no neckties (unless that's your thing)<br/><br/>Hands-on training and mentoring from me and my team of very successful agents<br/><br/>Opportunity to own your own agency (if desired, not required)<br/><br/>Looking for the right kind of people, the kind of people that align with our core values.<br/><br/><ul><li> Relationships matter, people come first</li><li> Relentless pursuit of personal growth</li><li> Open, honest, productive communication</li><li> We do things right, even when no one is looking</li><li> We work as a true team and strive to be a positive influence</li><li> We act like owners because we own it.</li><li> Being of service and doing good in the world</li><li> We have fun and we get stuff done.<br/><br/></li></ul>If these sound like you, then you might be the perfect fit for our team! And I think we need to talk further about that possibility.<br/><br/>Here's my quick background, and I hope that you can see that if being part of this industry and team can do this for me, it can do it for you too.<br/><br/>I moved to Los Angeles out of college way back when to pursue a career in music. It was a wild ride and I did a lot of amazing things, but I eventually hit a point where I was seeing the writing all over the wall. I was getting older and just wasn’t making enough money. In desperate need in of finding something new, I found a craigslist ad in 2019 and got my life insurance license. It was on a whim, and I had no idea what I was getting into, but it has completely transformed my life! It took me a moment to find my footing but once I did, there was no turning back.<br/><br/>The beautiful thing about the insurance industry is that it allows for a flexible work schedule and it allows a person to make as much money as they would like. Provided they are willing to work hard to get it, the sky is truly the limit here.<br/><br/>I went from knowing literally nothing about insurance, to working from home and bringing in <strong>$20K per month!<br/><br/></strong>Again, this takes VERY hard work, but it’s super possible. If I can do it <strong>SO CAN YOU!!<br/><br/></strong>With quality leads to call and incredible mentorship and training, this system is proven to work.. as long as you work it.<br/><br/>I've had the opportunity to travel internationally on ALL EXPENSE PAID trips, made $1000's in bonuses, given myself multiple raises, and now am building a team of amazing agents that I'm teaching and training to do the same! And I hope you are the next person to join!<br/><br/>You’ve heard the old saying, “It’s not WHAT you know, it’s WHO you know.” Deep down inside you’ve known there was something better for you. You’ve just been waiting to get connected to the right people.<br/><br/>Maybe you’ve been burned and you’re skeptical like I was. I get it. But don’t let past failures or disappointments keep you from your greatest breakthrough. If you're the person who is feeling something inside as you read this ad, you're the person we've been looking for. Come join our team and find your home.<br/><br/>Let's talk!<br/><br/><ul><li>Beau<br/><br/></li></ul>Powered by JazzHR", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3924299150"}