{"jobTitle": "Sr Strategic Supply Chain Mgr, Consumables Supply Chain", "company": {"name": "Amazon", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$109,000.00/yr - $185,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Supply Chain, and Information Technology", "industry": "Software Development", "description": "As a Senior Strategic Supply Chain Manager for US Consumables Grocery, you will be at the forefront of strategic planning, execution, and optimization of Amazon's supply chain operations. In this influential role, you will lead high-impact projects and collaborate cross-functionally to drive business growth and deliver an exceptional customer experience for pet parents. This position will work to continuously optimize operational metrics by working on strategic supply chain initiatives for Pets and Consumables. The Senior Strategic Supply Chain Manager (SSCM) serves as a key point of contact between Retail, internal supply chain partner teams, and Vendors. The SSCM contributes to cross-Grocery operational strategy, supports Vendor negotiations, and drives opportunities to reduce cost and waste in the supply chain.<br/><br/>A successful candidate must be highly organized, self-starting, and possess strong data extraction and analytical capabilities. They must have proven successes in driving operational initiatives and demonstrate passion for the customer experience. They must be fearless but thoughtful in their pursuit of results and thrive in a high energy environment where tactical and strategic activities are expected to be driven in parallel.<br/><br/>Strong candidates will have end-to-end supply chain strategy or inventory management experience as well as knowledge in fundamental business principles and knowledge of ecommerce and retail. Candidates must demonstrate the ability to succeed in efficiently managing a large catalog selection, identifying problems/finding solutions, and building/improving processes. The ideal candidate is able to lead and influence both internal and external teams in an ambiguous environment while maintaining a customer-centric philosophy.<br/><br/>Key job responsibilities<br/><br/><ul><li>Identify and deliver end-to-end supply chain improvement opportunities across large cohorts of vendors</li><li>Monitor, analyze, and own category Key Performance Indicators such as: out of stock, lead time, and confirmation rates; present insights, themes and trends to Senior Leadership team</li><li>Strategically analyze production and delivery lead-times, while optimizing operational excellence inputs such as EDI adoption, PO confirmations, efficient receive processes, and inventory placement</li><li>Spearhead initiatives to enhance cost structure and profitability, collaborating closely with partner teams to ensure successful execution</li><li>Lead doc-writing for business reviews and cross-GL Consumables supply chain initiatives</li><li>Become the subject matter expert in a subset of supply chain programs and initiatives that impact not just Pets, but all of Consumables</li><li>Develop trust with retail vendors and collaborate on initiatives to improve supply chain efficiency and costs in order to drive a delightful experience for Amazon customers<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 6+ years of professional or military experience</li><li> Bachelor's degree in management, business administration, economics, engineering, marketing</li><li> Knowledge of P&amp;L</li><li> Experience working retail supply chain, end-to-end supply chain strategy, ecommerce, or strategy consulting<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> MBA with a quantitative focus, or advanced degrees in supply chain or operations.</li><li> Demonstrated ability to operate both strategically and tactically in a high-energy, fast-paced environment</li><li> High degree of organization and ability to manage multiple, competing priorities simultaneously</li><li> Superior analytical skills (including data extraction), with demonstrated ability to dive in and quickly understand root cause and identify scalable solutions</li><li> Excellent business judgment, strong written and oral communication skills, and a practical, common sense approach to getting things done</li><li> Extreme attention to detail and willingness to roll up their sleeves to own large scale initiatives and/or unblock their team</li><li> Demonstrated ability to operate both strategically and tactically in a high-energy, fast-paced environment</li><li> High degree of organization and ability to manage multiple, competing priorities simultaneously</li><li> Extreme attention to detail and willingness to roll up their sleeves<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $109,000/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2641061", "postedDate": "2 weeks ago", "qualifications": {"required": "6+ years of professional or military experience, Bachelor's degree in management, business administration, economics, engineering, marketing, Knowledge of P&amp;L, Experience working retail supply chain, end-to-end supply chain strategy, ecommerce, or strategy consulting", "preferred": "MBA with a quantitative focus, or advanced degrees in supply chain or operations., Demonstrated ability to operate both strategically and tactically in a high-energy, fast-paced environment, High degree of organization and ability to manage multiple, competing priorities simultaneously, Superior analytical skills (including data extraction), with demonstrated ability to dive in and quickly understand root cause and identify scalable solutions, Excellent business judgment, strong written and oral communication skills, and a practical, common sense approach to getting things done, Extreme attention to detail and willingness to roll up their sleeves to own large scale initiatives and/or unblock their team, Demonstrated ability to operate both strategically and tactically in a high-energy, fast-paced environment, High degree of organization and ability to manage multiple, competing priorities simultaneously, Extreme attention to detail and willingness to roll up their sleeves"}, "skills": ["Supply Chain Management", "Strategic Planning", "Business Growth", "Customer Experience", "Operational Excellence", "Vendor Management", "Data Analysis", "Problem Solving", "Ecommerce", "Retail", "Leadership", "Influence", "Communication", "Business Judgment"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3924461921"}