{"jobTitle": "In Home Design Consultant Sales Representative", "company": {"name": "Bath Planet", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Real Estate", "description": "<strong>Qualifications<br/><br/></strong>Delivery of our proprietary sales presentation to home owners on an I pad Participation in ongoing sales training on a weekly basis during our meetings Design new bath on our proprietary I pad software Deliver price and close sales on a daily basis Qualifications:<br/><br/>Are you looking to work for the best in the business? Currently, we are the fastest growing acrylic bath remodeler in the United States. Do you want to make 6 figures a year? Creating a fresh solution to bath remodeling, Anahita Ultimate Finishing Co. / Bath Planet offers a stylish, cost-effective, low-maintenance bath improvement to homeowners, and consumers with accessibility needs. We were created to meet the needs of consumers who were dissatisfied with the quality and workmanship available in the marketplace. Standing behind our products, we have developed an unrivaled reputation for quality and workmanship as a manufacturer of acrylic bath and shower solutions and has extended that level of quality into all of our products. Sales Representative A full-time outside sales position, your role will be to develop relationships with pre-qualified home owners. You are not responsible to generate your own leads. Prior to your first interaction with prospective customers, 80% of the legwork has been done for you. We have a very rigorous pre-qualification process that ensures we are putting our sales reps in the best possible situation to be successful. Your only focus has to be on selling. We do everything else from processing the order to dealing with and changes after the product is sold. We only ask you to learn our training process and products within your first 90 days, stay true to your training and deliver a proven sales presentation to consumers that truly need what we offer. Preference may be given to candidates with acrylic bathroom remodeling sales experience for companies including Reborn, Dreamline, Rebath, Luxury Bath, Bathfitter, etc. Our company has partnered with the Home Depot to provide outstanding customer experiences. Existing familiarity with the Home Depot in-home sales process and system is also a plus. Primary job responsibilities include:<br/><br/>Highly developed interpersonal, organizational and communication skills Ability to speak publicly with confidence and poise Strong sense of ambition, self-motivation and self-discipline Ability to work independently Naturally outgoing and articulate individual who thrives in social settings Previous sales experience preferred but not needed (310) 480-0009 Powered by JazzHR", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3924473112"}