{"jobTitle": "Water Technology Partnerships Manager", "company": {"name": "Trojan Technologies", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Environmental Services", "description": "<strong>Why should you work with us?<br/><br/></strong><ul><li>Benefits starting Day 1 including medical/dental/vision and 401k with company matching!</li><li>Lots of autonomy with a supportive manager!</li><li>Ability to work with cutting-edge technologies and a brand new team!</li><li>Freedom to work remotely from your home office in the Western United States!<br/><br/><br/></li></ul><strong>As a Water Technology Partnership Manager, you will:<br/><br/></strong><ul><li>Build and nurture early-stage relationships with regional clients and stakeholders, including government agencies and industrial/trade associations active in water reuse, to gain a deep understanding of their challenges and potential for Trojan Technologies to offer and support innovative solutions.</li><li>Drive and execute strategies in line with organizational objectives, improve the project portfolio, and explore new opportunities, while also meeting performance targets and executing marketing efforts.</li><li>Conduct and synthesize market research to identify trends, emerging technologies, regulatory changes and potential growth areas in municipal water reuse.</li><li>Develop and implement a comprehensive business development strategy for municipal water reuse projects for your region, including attending exhibitions/business forums, providing education and delivering presentations at the regional level.</li><li>Collaborate with commercial and technical teams to understand the specific needs of municipal and industrial clients and build the funnel of opportunities to sustain leadership and growth in water reuse.<br/><br/><br/></li></ul><strong>Are you qualified? The essential requirements of the job include:<br/><br/></strong><ul><li>Bachelor’s degree in environmental science or engineering (Master's degree preferred) or 10+ years of water-treatment related experience.</li><li>Proven track record of at least 5+ years in business development within the municipal and industrial water reuse sector.</li><li>Commercial and technical experience working with municipal customers; experience in industrial sector would be an asset</li><li>Strong understanding of water treatment technologies and processes used in advanced water treatment processes, as well as an understanding of industry standards and regulations.</li><li>Excellent communication, presentation and negotiation skills, with passion for engaging with the water community including clients, consulting engineers, regulators and government representatives.</li><li>Ability to travel up to 50% of the time.<br/><br/><br/></li></ul>Every person is unique, but we all have something in common: the need for safe, clean water. And it’s only by bringing together people with diverse ideas, perspectives, and backgrounds that we can solve the complex water problems of our changing world.<br/><br/>At <strong>Trojan Technologies</strong>, we believe success for all comes from the contributions of every single one of us. That’s why we foster an environment where every associate has a voice, is valued and respected, and feels safe sharing their thoughts. After all, sharing our different viewpoints and experiences is what enables us to find creative and innovative ways to accomplish our shared goals.<br/><br/>Trojan is proud to be bringing water and environmental businesses together under the unified purpose of safeguarding the world’s most vital natural resources.<br/><br/>Want to ensure the world has the <strong>clean water</strong> it needs? Then become part of the team that’s making it happen!<br/><br/><strong>US ONLY:<br/><br/></strong>The below range reflects the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range. This range may be modified in the future. An associate’s position within the salary range will be based on several factors, including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, shift, travel requirements, sales or revenue-based metrics, any collective bargaining agreements, and business or organizational needs.<br/><br/>The compensation range for this role is $130,000 - $150,000 USD per year. This job is also eligible for Bonus Pay.<br/><br/>We offer a comprehensive package of benefits including paid time off, medical/dental/vision insurance and 401(k) to eligible employees.<br/><br/>Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/>US residents: In any materials you submit, you may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.<br/><br/>Veralto Corporation and all Veralto Companies are committed to equal opportunity regardless of race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. We value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve. Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.<br/><br/>The EEO posters are available <strong>here</strong>.<br/><br/>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us at applyassistance@veralto.com to request accommodation.<br/><br/><strong>Unsolicited Assistance<br/><br/></strong>We do not accept unsolicited assistance from any headhunters or recruitment firms for any of our job openings. All resumes or profiles submitted by search firms to any employee at any of the Veralto companies, in any form without a valid, signed search agreement in place for the specific position, approved by Talent Acquisition, will be deemed the sole property of Veralto and its companies. No fee will be paid in the event the candidate is hired by Veralto and its companies because of the unsolicited referral.", "responsibilities": "As a Water Technology Partnership Manager, you will:\n\n* Build and nurture early-stage relationships with regional clients and stakeholders, including government agencies and industrial/trade associations active in water reuse, to gain a deep understanding of their challenges and potential for Trojan Technologies to offer and support innovative solutions.\n* Drive and execute strategies in line with organizational objectives, improve the project portfolio, and explore new opportunities, while also meeting performance targets and executing marketing efforts.\n* Conduct and synthesize market research to identify trends, emerging technologies, regulatory changes and potential growth areas in municipal water reuse.\n* Develop and implement a comprehensive business development strategy for municipal water reuse projects for your region, including attending exhibitions/business forums, providing education and delivering presentations at the regional level.\n* Collaborate with commercial and technical teams to understand the specific needs of municipal and industrial clients and build the funnel of opportunities to sustain leadership and growth in water reuse.", "qualifications": {"required": "Bachelor’s degree in environmental science or engineering (Master's degree preferred) or 10+ years of water-treatment related experience.\nProven track record of at least 5+ years in business development within the municipal and industrial water reuse sector.\nCommercial and technical experience working with municipal customers; experience in industrial sector would be an asset\nStrong understanding of water treatment technologies and processes used in advanced water treatment processes, as well as an understanding of industry standards and regulations.\nExcellent communication, presentation and negotiation skills, with passion for engaging with the water community including clients, consulting engineers, regulators and government representatives.\nAbility to travel up to 50% of the time."}, "skills": ["Business Development", "Water Treatment", "Market Research", "Sales", "Environmental Science", "Engineering", "Municipal Water", "Water Reuse", "Government Relations", "Industrial Water", "Project Management", "Marketing", "Communication", "Presentation Skills", "Negotiation"], "postedDate": "1 week ago", "benefits": "Benefits starting Day 1 including medical/dental/vision and 401k with company matching!\nLots of autonomy with a supportive manager!\nAbility to work with cutting-edge technologies and a brand new team!\nFreedom to work remotely from your home office in the Western United States!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3925556301"}