{"jobTitle": "Campus Fire Marshal", "company": {"name": "The California State University", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Other, Information Technology, and Management", "industry": "Higher Education", "description": "Chancellor's Office Statement<br/><br/>Join our team at the California State University, Office of the Chancellor, and make a difference in providing access to higher education. We are currently seeking experienced candidates for the position of Campus Fire Marshal. The CSU Chancellor's Office, located on the waterfront adjacent to the Aquarium of the Pacific in downtown Long Beach, is the headquarters for the nation's largest and most diverse system of higher education. The CSU Chancellor's Office offers a premium benefit package that includes outstanding vacation, health, and dental plans; a fee waiver education program; membership in the California Public Employees Retirement System (PERS); and 15 paid holidays a year.<br/><br/>Salary<br/><br/>The anticipated salary hiring range is up to $12,917 per month, commensurate with qualifications and experience.<br/><br/>The salary range for this classification is $4,812 to $15,449 per month.<br/><br/>Classification<br/><br/>Administrator II<br/><br/>Position Information<br/><br/>The California State University, Office of the Chancellor, is seeking a Campus Fire Marshal to conduct plan review and inspections to ensure compliance with fire and panic safety regulations and standards, as adopted by the OSFM. This position will also ensure compliance with CSU internal policies relating to fire and panic safety construction and may represent the campuses in interacting with municipal fire departments. This position will report to a Deputy Director of Fire Safety and serve as a Chancellor’s Office Capital Planning, Design and Construction representative for the CSU Fire Safety program at each CSU campus. Upon review and approval by the State Fire Marshal of the individual’s appropriate level of expertise, the incumbent will become a Designated Campus Fire Marshal (DCFM).<br/><br/>This position will be located at Sacramento State or the Chancellor’s Office in Long Beach.<br/><br/>Responsibilities<br/><br/>Under the general direction of the Deputy Director of Fire Safety, the Campus Fire Marshal will perform duties as outlined below:<br/><br/><ul><li>Responsible to assist in the development and implementation of the CSU fire and panic safety program under the guidance of the appropriate Deputy Director of Fire Safety.</li><li>The employee will be required to complete the training identified by the OSFM/CSU Memorandum of Understanding (MOU) to prove competency and receive OSFM DCFM approval within 18 months of employment with the CSU.<br/><br/></li></ul>During The Training And Certification Period, The CFM Will<br/><br/><ul><li>Review design documents and construction plans for compliance with fire and safety codes.</li><li>Facilitate, coordinate, and track individual plan review/approvals to a timely and code complaint conclusion. Serve as a CSU CO representative to collaboratively resolve issues relative to fire safety code and regulations.</li><li>Engage all stakeholders. Coordinate CSU/OSFM fire safety reviews and approvals, whether directly agency to agency, indirectly as may be authorized by CSU/SFM MOU or as may be needed.</li><li>Work closely with the OSFM to continually improve trust, process, and program quality.</li><li>Ensure code effective design development and advocate good code compliance practices to individual campus project design and construction teams. Participate in effective code compliance design reviews. Implement the fire and panic safety plan review process with campuses and/or CSU/OSFM locations as needed to realize effective and timely project approvals.</li><li>Generate reports for Supervisor and OSFM, detailing activity, issues, resolutions, and improvements implemented. This includes input and use of GovMotus, the CPDC project database and the OFS software as needed.</li><li>Keep CSU management informed. Provide regular briefings and project status reports to CPDC CSU Chief Building Official and Deputy Director of Fire Safety on evolving fire safety code interpretations and project trends relative to campuses and project delivery methods with a view towards improving process.</li><li>Help define and implement performance tracking related to CSU Building Permit and fire prevention programs. Track recurring fire safety plan review issue areas and make recommendations for changes to policies and procedures to improve timeliness and effectiveness of fire safety approvals.</li><li>Demonstrate, promote, and recognize campus, and departmental high standards for excellent client service, effective use of resources, workplace safety, professional development, personal accountability, and continuous improvement. Communicate and promote model campus practices systemwide.<br/><br/></li></ul>Once the incumbent completes the OSFM training and certification requirements and becomes a DCFM, the responsibilities include: <br/><br/><ul><li>Propose new or recommend changes to fire and panic safety policies affecting the CSU and the campuses, to assure compliance. Continuously evaluate, recommend, and implement procedures that assure awareness of fire &amp; panic safety requirements.</li><li>Participate in the delivery of CSU fire safety code compliance training.</li><li>Pursue personal continuing education training to build/maintain professional certifications and stay current with changes to fire and building codes and related standards (e.g., NFPA, ICC, etc.).</li><li>Complete plan review and give final approval of construction plans/documents for CSU projects.</li><li>Work closely with OFS colleagues to share expertise and improve and disseminate consistent program goals and criteria to campuses.</li><li>Assist campus as needed in the event of a fire event on campus. Ensure OSFM Duty Chief is notified promptly and provide assistance as necessary.</li><li>Provide code enforcement by inspection of campus facilities; develop reports, and track trends. Conduct fire safety field inspection of campus projects and code compliance reviews of operational facilities.<br/><br/></li></ul>Qualifications<br/><br/>This position requires:<br/><br/><ul><li>Educational background: California Licensed Architect, Fire Protection Engineer, or related bachelor’s degree or other relevant comparable experience in design/compliance/construction field. Relevant comparable training examples: Certification as an International Code Council Fire Plans Examiner, Building Plans Examiner, Fire Inspector, California State Fire Marshal, or other local public agency fire authority plans examiner.</li><li>Licensure or certification along with maintenance of continuing education is required. Such licensure, certification, and continuing education may include relevant national or state programs including, but not limited to: NFPA, IFSTA, DSA, ICC, NCEES, and OSFM training.<br/><br/></li></ul>Three Years Of Recent Full-time Experience Performing Fire And Life Safety Compliance Inspections, Plan Reviews, Construction Inspections, Or Other Experience In Any Combination Of The Following<br/><br/><ul><li>Conducting fire and life safety compliance inspections, plan reviews, and construction inspections in a public fire prevention bureau, unit, or agency.</li><li>In fire prevention or industrial safety engineering in private industry.</li><li>In building inspection work in a public bureau, unit, or agency.</li><li>College training may be substituted for the experience based on two years of college being equivalent to one year of experience.</li><li>Good general knowledge of fire protection planning and management, building design incorporation of fire, life, and panic safety systems, fire alarm and detection systems, their installation, inspection, and testing.</li><li>Must have good working knowledge of California Building Code, California Fire Code, and code reference standards including a reference familiarity with NFPA requirements.</li><li>Proven experience in the creation, development, and implementation of effective programs, projects, and initiatives to meet assigned goals.</li><li>Designation as a Designated Campus Fire Marshal (DCFM) by the Office of the State Fire Marshal or must be able to attain this designation within 18 months of hire as a condition of continued employment.</li><li>Must have ability to apply sound professional judgment, initiative, and problem-solving skill to analyze complex code compliance issues and be able to facilitate a timely and responsive code complaint outcome.</li><li>Must be able to develop and maintain internal and external professional relationships and interact effectively at a professional level. Must be responsive to client and professional concerns and feedback.</li><li>Skill to effectively communicate with diverse constituencies and senior campus management. Proven and solid communication skills including verbal and written, active listening, critical thinking, persuasiveness, advising and counseling skills.</li><li>Ability and willingness to travel independently to effectively carry out the responsibilities of the position. Frequent local regional ground travel, statewide single day air/ground travel, and periodic overnight travel is a requirement and expectation of the position. Examples: Adjacent campus travel, day trips to Sacramento.</li><li>Must be able to effectively use Microsoft Word, Excel, Outlook, Bluebeam, and their equivalents.</li><li>Must have good organizational and time management skills with the ability to set own priorities to coordinate assignments with fluctuating and time-sensitive deadlines; proven ability to manage multiple projects concurrently.</li><li>Ability to quickly gain working familiarity with CSU’s architectural engineering and construction management policy and procedures, CSU’s public works contract law, rules, and regulations.<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Certification as a Fire Prevention Officer III or Fire Marshal or equivalent.</li><li>Certification as an International Fire Code Inspector or equivalent.</li><li>Completion of OSFM training: Fire Inspector I and II training.</li><li>Completion of SFM training: Plans Examiner 1A-1C, and Statutes and Regulations course.<br/><br/></li></ul>Application Period<br/><br/>Priority consideration will be given to candidates who apply by May 28, 2024. Applications will be accepted until the job posting is removed.<br/><br/>How To Apply<br/><br/>Please click \"Apply Now\" to complete the California State University, Chancellor's Office online employment application.<br/><br/>Equal Employment Opportunity<br/><br/>The university is an Equal Opportunity Employer and does not discriminate against persons on the basis of race, religion, color, ancestry, age, disability, genetic information, gender, gender identity, gender expression, marital status, medical condition, National origin, sex, sexual orientation, covered veteran status, or any other protected status. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting the Senior Human Resources Manager at (562) 951-4070.<br/><br/>Title IX<br/><br/>Please view the Notice of Non-Discrimination on the Basis of Gender or Sex and Contact Information for Title IX Coordinator at: https://www2.calstate.edu/titleix<br/><br/>E-Verify<br/><br/>This position requires new hire employment verification to be processed through the E-Verify program administered by the Department of Homeland Security, U.S. Citizenship and Immigration Services (DHSUSCIS)' in partnership with the Social Security Administration (SSA).<br/><br/>If hired, you will be required to furnish proof that you are legally authorized to work in the United States. The CSU Chancellor’s Office is not a sponsoring agency for staff and Management positions (i.e., H1-B VISAS).<br/><br/>COVID19 Vaccination Policy<br/><br/>Per the CSU COVID-19 Vaccination Policy , it is strongly recommended that all Chancellor’s Office employees who are accessing office and campus facilities follow COVID-19 vaccine recommendations adopted by the U.S. Centers for Disease Control and Prevention (CDC) and the California Department of Public Health (CDPH) applicable to their age, medical condition, and other relevant indications.<br/><br/>Mandated Reporter Per CANRA<br/><br/>The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.<br/><br/>Conflict of Interest<br/><br/>The duties of this position will include participation in decisions that may have a material financial benefit to the incumbent. Therefore, the selected candidate will be required to file Conflict of Interest Form 700: Statement of Economic Interest when they first occupy the position, and on an annual basis, complete ethics training within 6 months of appointment, and attend this training every other year thereafter.<br/><br/>CSU Out of State Employment Policy <br/><br/>California State University, Office of the Chancellor, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022, the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/>Background<br/><br/>The Chancellor's Office policy requires that the selected candidate successfully complete a full background check (including a criminal records check) prior to assuming this position.", "salary": {"amount": "12,917.00 - 15,449.00", "currency": "USD"}, "skills": ["Fire Protection", "Fire Safety", "Building Codes", "Plan Review", "Construction Inspection", "Fire Prevention", "Code Enforcement", "NFPA", "ICC", "OSFM", "Microsoft Word", "Microsoft Excel", "Microsoft Outlook", "Bluebeam"], "postedDate": "3 months ago", "url": "https://www.linkedin.com/jobs/view/3925808017"}