{"jobTitle": "Product Marketing Manager, Trust", "company": {"name": "Meta", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$158,000.00 - $223,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "At Meta Reality Labs, we build tools that help people feel connected anytime, anywhere. We’re on a mission to build the next computing platform by putting people at the center of emerging hardware and software technologies, whether on-the-go with wearables and augmented reality, in the home or at work, or fully immersed in alternate virtual reality worlds. The Meta Reality Labs Trust Product Marketing organization leads inbound product marketing, product launch strategy, and in-market business growth, all with an eye on ensuring our responsible innovation principles. The Trust Product Marketing team focuses on consumer and ecosystem opportunities through the lens of our responsible innovation principles, which drive the way we think about the intersection of breakthrough technology and the positive impacts our innovations can have on the world. We are looking for an experienced product marketing manager who will be responsible for influencing product development and leading Trust go-to-market (GTM) for Avatars. Avatars is the number one priority for the Metaverse because it is the core of how people will be represented in this world. Meta has the opportunity to build Avatars that people love and that represent them across all of their 2D (mobile, tablets, desktop) and VR interactions. There is an enormous opportunity for us to build toward Avatars that can help unlock an individual’s sense of identity, enable the full range of expression, and allow for meaningful shared social experiences. And we’ll have to address a number of Trust related questions related to integrity, privacy, and representation. To be successful, the candidate will bring a combination of strategic vision, communication skills, collaborative mindset, and product launch experience; having worked in highly cross-functional, dynamic environments built to move fast.", "responsibilities": "Partner closely with cross-functional stakeholders (including Product, Research, PR, Marketing, Design, Engineering, Sales and more) to deliver world-class products. Drive Reality Labs positioning on Trust sensitive topics particularly relevant to the Metaverse (e.g., content moderation, representation). Steer GTM motion for new features, products and policies in a way that demonstrates our commitment to responsible innovation to internal and external stakeholders. Identify significant long-term opportunities and strategic views on product direction based on market assessment, qualitative research and quantitative analysis. Identify long-term opportunities for features and products that drive user trust and safety based on regional understanding, market assessment, qualitative research and quantitative analysis. Synthesize research and insights into a strategic view of the direction of the market for creators, brands and consumers. Manage high-priority, fast moving decisions and communications regarding policy changes or enforcement.", "qualifications": {"required": "7+ years experience in product marketing or a related field. 5+ years experience launching hardware and/or software. Experience leading cross-functional teams, either formally through reporting structure or informally through influence. Experience partnering closely with product teams to influence product strategy and roadmaps. Combination of effective strategic product marketing skills and hands-on tactical execution. Experience with consumer research and proficiency in using data and insights to inform product strategy. Bachelor's degree in marketing, communications, policy, or privacy or equivalent work experience.", "preferred": "Experience with enterprise GTM motions. Experience shipping products with strong consumer privacy and safety protections. Understanding of major consumer privacy protections in different regions and how they impact consumer technology. Experience with enterprise or SMB go-to-market motions."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Meta offers benefits including bonus and equity.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3926433566"}