{"jobTitle": "ECM - Housing Navigator", "company": {"name": "Amity Foundation", "industry": "Internet Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$26.44", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Internet Publishing", "description": "Amity Foundation, an internationally acclaimed Teaching, and Therapeutic Community is seeking compassionate and enthusiastic individuals with a desire to teach, learn and join our community as an ECM Housing Navigator. This groundbreaking opportunity will allow you to work with our prison and re-entry programs helping the community and will also enhance your training and experience in the field.", "responsibilities": "Collaborate with the care management team to integrate housing solutions into the overall care plan for students. Act as the primary liaison between the ECM program and County Housing Services to facilitate housing searches and present viable options to students. Guide students through the housing selection process, providing support and advice to help them make informed decisions. Process and enroll students into the County Coordinated Entry System (CES), enter data into County’s CES electronic database ensuring they are effectively integrated into the housing support network. Maintain up-to-date knowledge of CES processes and requirements to streamline students’ experiences and access to services. Identify and arrange non-emergency/non-medical transportation options for students to attend housing-related appointments, viewings, and meetings. Accompany students to housing-related activities when appropriate to provide support and assistance. Identify, coordinate, and get approval for any necessary environmental modifications for accessibility. Document services within the agency’s Electronic Health Record within 72 hours of each service provided. Attend workshops, meetings, and trainings as requested by supervisor. Performs other related duties as assigned.", "qualifications": {"required": "Bachelor’s degree in behavioral health, human services, public health, or related field strongly preferred. Two years’ experience in housing navigation, social services, or related field with a focus on housing support. Strong understanding of the housing sector, including affordable housing and fair-housing laws. Excellent coordination and networking skills to work effectively with a variety of community partners and service providers. Strong advocacy and interpersonal skills, with the ability to work compassionately with diverse populations. Problem solving skills and the ability to think critically to overcome housing barriers. This position requires local travel and the ability to navigate public transportation with students. Bi-lingual in English and Spanish is preferred. Required to use company vehicle as well as personal vehicle to visit county jails and transport clients to and from appointments and other locations as needed. Required to have car insurance, vehicle, and valid driver’s license.", "preferred": "Community Health Worker certification through California’s HCAI Department."}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental, Vision, Paid vacation, sick time, & holidays, 401K, HSA, & Life insurance programs, Organization committed to community action, Community oriented workplace", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3926184309"}