{"jobTitle": "Operations & Fulfillment Executive Assistant", "company": {"name": "Rufus Labs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "55,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "About the job: We are seeking an Operations &amp; Fulfillment Executive Assistant to coordinate and manage the essential activities of our executive team and assist with operational support and customer order fulfillment. As Operations &amp; Fulfillment Executive Assistant you will work with and report directly to the Operations Team and CEO, relaying messages and ideas from other senior executive leaders to improve the internal functions and processes of the company. You will be working in the Los Angeles offices managing inventory of devices and wearable technology. You must be a creative and results-driven thinker, an excellent problem solver, and possess incredible interpersonal skills. <br/>Rufus WorkHero builds technology to empower human automation and the connected operator, allowing workers to be more productive, more effective and safer on the job. We are looking for a Ops &amp; Fulfillment EA who delivers beyond the call of duty, knows how to hustle, and wants to be a part of a tight-knit, bad-ass, winning team. <br/>What You’ll Do:<ul><li>Be involved with daily operations and help oversee projects</li><li>Work with cross-functional teams</li><li>Be a liaison for staff, chief executives, department leaders, and CEO</li><li>Manage company calendar</li><li>Assist in operational support of SMB and Fortune customer deployments </li><li>Assist with preparation &amp; order fulfillment of SMB and Fortune customer deployments</li><li>Coordinate business-wide procedures and work to improve existing processes</li><li>Organize and coordinate staff functions and activities</li></ul><br/>Skills You’ll Need:<ul><li>Detail-oriented and data-driven</li><li>Excellent oral and written communication skills</li><li>Strong interpersonal skills and a knack for productive collaboration across varying departments</li><li>Ability (and excited) to wear many hats</li><li>Possess an encouraging, can-do attitude</li><li>Impeccable time management and multi-tasking skills</li><li>Business-minded and a strategic planner</li><li>Self-motivated and self-sufficient</li><li>Creative thinker with strong business acuity</li><li>Bachelor’s degree in Business Management, Supply Chain Management, or Operations Management, or related field preferred</li></ul><br/>What You’ll Get: <ul><li>A unique opportunity to advise on strategy, and collaborate with executive team</li><li>Ability to grow into a leadership role within the organization</li><li>Work in an entrepreneurial culture with zero bureaucracy</li></ul><br/>Learn more about Rufus Labs at www.getrufus.com. Send your application to us at admin@rufuslabs.com. Please include links to samples of previous relevant work with your response, if appropriate.", "responsibilities": "Be involved with daily operations and help oversee projectsWork with cross-functional teamsBe a liaison for staff, chief executives, department leaders, and CEOManage company calendarAssist in operational support of SMB and Fortune customer deployments Assist with preparation &amp; order fulfillment of SMB and Fortune customer deploymentsCoordinate business-wide procedures and work to improve existing processesOrganize and coordinate staff functions and activities", "qualifications": {"required": "Detail-oriented and data-drivenExcellent oral and written communication skillsStrong interpersonal skills and a knack for productive collaboration across varying departmentsAbility (and excited) to wear many hatsPossess an encouraging, can-do attitudeImpeccable time management and multi-tasking skillsBusiness-minded and a strategic plannerSelf-motivated and self-sufficientCreative thinker with strong business acuity", "preferred": "Bachelor’s degree in Business Management, Supply Chain Management, or Operations Management, or related field preferred"}, "skills": ["Detail-oriented", "Data-driven", "Communication", "Interpersonal", "Collaboration", "Time Management", "Multi-tasking", "Business-minded", "Strategic Planning", "Self-motivated", "Self-sufficient", "Creative Thinking", "Business Acuity"], "postedDate": "3 months ago", "benefits": "A unique opportunity to advise on strategy, and collaborate with executive teamAbility to grow into a leadership role within the organizationWork in an entrepreneurial culture with zero bureaucracy", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3926915336"}