{"jobTitle": "Production Supervisor", "company": {"name": "SoLa Impact", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>JOB SUMMARY</strong>\n<p>As a Production Supervisor, you will be responsible for overseeing the day-to-day operations of our modular housing factory, ensuring all production rate, cost, safety, and quality standards are met. The ideal candidate will have a strong background in manufacturing, leadership, and a dedication to delivering top-notch results.</p><p></p><ul> <li><strong>$80,000-$100,000 base salary range depending on experience</strong></li> <li><strong>10% bonus</strong></li> <li><strong>On-site @ 740 E. 111th Pl | Los Angeles, CA 90059</strong></li> </ul><p></p><p><strong>ABOUT MODEL/Z</strong></p><p>Model/Z is a trailblazing enterprise focused on reinventing multifamily housing through the development of standardized, modular units. Our mission is to provide high-quality, low-cost, and net-zero-ready housing solutions that are both scalable and practical, aiming to significantly mitigate homelessness and enhance living conditions for underrepresented communities. As a majority Black-owned and operated business based in Southern California, Model/Z is poised to establish the first standardized modular housing factory in the region.</p><p>Located in the historic Watts neighborhood of South Los Angeles, Model/Z is committed to revitalizing communities by employing local community members and paying living wages. Our innovative approach revolutionizes construction, transforming a traditional linear process into a parallel manufacturing system that allows us to build high-quality apartment homes in a factory before the concrete is even poured on-site. By empowering Black and brown families and institutions and unlocking the value of underutilized land, Model/Z embodies a model of equitable growth, addressing the urgent need for affordable housing in Southern California and beyond.<br/><br/></p><strong>Requirements<br/><br/></strong><p>1. Think creatively, challenge the status quo, and work with our team to develop the</p><p>future of modular housing.</p><p>2. Supervise and lead a team of production technicians, setting clear expectations and</p><p>providing guidance to meet production targets.</p><p>3. Monitor and manage daily production schedules to ensure on-time delivery of products</p><p>while optimizing resource utilization.</p><p>4. Enforce and maintain strict adherence to safety protocols and best practices to ensure a</p><p>safe work environment.</p><p>5. Identify and address production issues promptly, implementing corrective actions to</p><p>minimize downtime and maintain product quality.</p><p>6. Collaborate with the production planning team to coordinate material and manpower</p><p>requirements.</p><p>7. Train, mentor, and develop production team members, fostering a culture of continuous</p><p>improvement and skill development.</p><p>8. Conduct regular performance evaluations and provide constructive feedback to team</p><p>members.</p><p>9. Monitor and control production costs, identifying opportunities for cost reduction and</p><p>process improvement.</p><p>10. Maintain accurate production records and reports.</p><p>11. Work closely with quality control to ensure that products meet or exceed established</p><p>quality standards. </p><p><br/></p><p><strong>EDUCATION, SKILLS, and ABILITES</strong></p><li> Bachelor's degree in a related field or 5 years of manufacturing experience. </li><li> Proven experience as a production supervisor or similar role in a manufacturing</li><p>environment with direct leadership of an hourly workforce.</p><li> Strong hands-on knowledge of manufacturing processes and equipment in a</li><p>manufacturing and assembly environment.</p><li> Excellent leadership, communication, and interpersonal skills. </li><li> Ability to make quick, informed decisions and solve problems effectively. </li><li> Proficiency in using computer systems such as ERP, MRP, MES, QMS, and WMS in addition to Microsoft Office (Excel, Word, PowerPoint, Outlook). </li><p>Additional Requirements{{:}}</p><li> Available to work extended hours and weekends as needed. This role will be covering</li><p>1st shift</p><li> Must be able to stand for long periods of time</li><li> Must be able to lift up to 25 pounds unassisted</li><li> Repetitive assembly operations, grasping, standing, lifting, bending, pulling, pushing,</li><p>stooping, stretching, and carrying are generally required to perform the functions of this role<br/><br/></p><strong>Benefits<br/><br/></strong><p>SoLa Impact offers a comprehensive benefits package that includes paid vacation, medical, dental, vision, and life insurance, as well as pet insurance, sick leave, 10 paid holidays, and bereavement days. This package is designed to provide employees with a range of important benefits that help to support their physical and emotional well-being, while also providing financial protection and peace of mind.</p><p>At SoLa Impact, we believe work environment, culture, and the opportunity to learn and grow are key elements when considering a new job. We are just the right size to provide the resources and support you need without the bureaucracy of a large corporate environment. We foster a family-friendly and supportive workplace, collaborative and employee-focused with an emphasis on quality, integrity, trust, and accountability. We are looking to bring someone on board as soon as possible. We provide a rewarding and challenging environment. We expect a lot, but give a lot in return. Strongly prefer candidates local to Los Angeles as no relocation assistance will be provided. All qualified candidates will be contacted directly.</p><p><em>SoLa Impact is an Equal Opportunity Employer. SoLa does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need.</em></p>", "responsibilities": "1. Think creatively, challenge the status quo, and work with our team to develop the\nfuture of modular housing.\n2. Supervise and lead a team of production technicians, setting clear expectations and\nproviding guidance to meet production targets.\n3. Monitor and manage daily production schedules to ensure on-time delivery of products\nwhile optimizing resource utilization.\n4. Enforce and maintain strict adherence to safety protocols and best practices to ensure a\nsafe work environment.\n5. Identify and address production issues promptly, implementing corrective actions to\nminimize downtime and maintain product quality.\n6. Collaborate with the production planning team to coordinate material and manpower\nrequirements.\n7. Train, mentor, and develop production team members, fostering a culture of continuous\nimprovement and skill development.\n8. Conduct regular performance evaluations and provide constructive feedback to team\nmembers.\n9. Monitor and control production costs, identifying opportunities for cost reduction and\nprocess improvement.\n10. Maintain accurate production records and reports.\n11. Work closely with quality control to ensure that products meet or exceed established\nquality standards.", "qualifications": {"required": "Bachelor's degree in a related field or 5 years of manufacturing experience. \nProven experience as a production supervisor or similar role in a manufacturing\nenvironment with direct leadership of an hourly workforce.\nStrong hands-on knowledge of manufacturing processes and equipment in a\nmanufacturing and assembly environment.\nExcellent leadership, communication, and interpersonal skills. \nAbility to make quick, informed decisions and solve problems effectively. \nProficiency in using computer systems such as ERP, MRP, MES, QMS, and WMS in addition to Microsoft Office (Excel, Word, PowerPoint, Outlook). \nAdditional Requirements{{:}} Available to work extended hours and weekends as needed. This role will be covering\n1st shift Must be able to stand for long periods of time Must be able to lift up to 25 pounds unassisted Repetitive assembly operations, grasping, standing, lifting, bending, pulling, pushing,\nstooping, stretching, and carrying are generally required to perform the functions of this role"}, "skills": ["Manufacturing", "Leadership", "Production", "Safety", "Quality Control", "Team Management", "Problem Solving", "Communication", "Interpersonal Skills", "ERP", "MRP", "MES", "QMS", "WMS", "Microsoft Office", "Excel", "Word", "PowerPoint", "Outlook"], "postedDate": "3 months ago", "benefits": "SoLa Impact offers a comprehensive benefits package that includes paid vacation, medical, dental, vision, and life insurance, as well as pet insurance, sick leave, 10 paid holidays, and bereavement days. This package is designed to provide employees with a range of important benefits that help to support their physical and emotional well-being, while also providing financial protection and peace of mind.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3926110707"}