{"jobTitle": "Research Administrative Coordinator - Koronyo Lab - Department of Neurosurgery", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "25.73/hr - 43.74/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "Job Description<br/><br/>Cedars-Sinai is an international leader in biomedical research, we translate discoveries into successful treatments with global impact.<br/><br/>The primary focus of the Koronyo-Hamaoui laboratory is on early diagnosis and immune-based therapies for Alzheimer's disease (AD). To learn more about this type research, please visit the Koronyo-Hamaoui Lab.<br/><br/>Are you ready to continue your career journey with us!?<br/><br/>The Research Administrative Coordinator works under the direction of the Research Director, Research Manager, and the Research Operations Associate of the assigned research area. The incumbent provides reports pertaining to the budgetary and fiscal management of research programs and assists in coordinating division academic activities. The Coordinator provides assistance with time and effort reporting, serves as a liaison to internal departments and external philanthropic and academic organizations, and provides administrative support and coordination of the operational and administrative activities for the research area.<br/><br/>Primary Duties and Responsibilities:<br/><br/><ul><li>Coordinates the administrative and office management systems for the department/unit.</li><li>Edits policy and procedure manuals. Disseminates information including announcements, policies, and procedures.</li><li>Maintains calendar of events and monitors deadlines, schedules meetings, makes travel arrangements, and submits travel reimbursements.</li><li>Composes written correspondence, NIH reviews, and letters of recommendation.</li><li>Generates monthly fiscal and physician billing reports and distributes to department management.</li><li>Serves as a point of contact between departmental administrators and Sponsored Research and Funds Administration (SRFA).</li><li>May assist Principal Investigator with completing and submitting federal and non-federal grants.</li><li>May assist with pre- and post-award grant administration functions and with tracking project metrics.</li><li>Applies federal and state regulatory and licensing requirements, as well as organizational bylaws, rules and regulations and policies and procedures to all assigned projects, and assists with implementation of new regulatory and compliance related programs.</li><li>Assists with the daily activities of the Director and related faculty members including project management and execution of strategic planning.</li><li>Assists with creation and maintenance of budgets for research programs.</li><li>Tracks HR compliance and regulatory activities for research staff members, including maintenance of the HR files, new hire paperwork, coordination of regulatory and compliance training, etc.</li><li>Coordinates all academic activities, seminars, lectures and meetings.</li><li>May prepare course syllabi, develop audio visual materials using PowerPoint and other applications, gather information for presentations.</li><li>May conduct literature searches and format manuscripts for submission and publication.</li><li>Adheres to procedures for office management and compliance with CSMC administrative regulations and requirements.</li><li>Assists Department management with other duties as necessary.<br/><br/></li></ul>Department-Specific Duties:<br/><br/><ul><li>Grant submission and management, drafting and preparation of grant and other reports, and financial management.</li><li>Assists with English and formatting editing of abstracts and manuscripts.</li><li>Handles MTA/DUA/Collaboration agreement, check requests, and keeps NIH Biosketch and CV documents updated.</li><li>Maintains technical aspects of websites such as NCBI my bibliography, Loop, ORCID, LinkedIn/Research Gate, PMC updated, Lab website and Lab media updates, and handles invoices and manuscript payments.<br/><br/></li></ul>Qualifications<br/><br/>Requirements and Skills:<br/><br/><ul><li>High School Diploma/GED, required.</li><li>Bachelor's degree, preferred.</li><li>Experience in research administration is highly preferred.</li><li>Proficiency in Word, PowerPoint and Excel (preferred knowledge in Photoshop).</li><li>Excellent written and oral language skills and understanding of Grants, Manuscript, and Abstract guidelines.</li><li>Strong verbal and writing communication ability, computer software skills (preferred previous experience with EndNote), organization, personnel, and time-management skills.</li><li>Ability to work independently, set priorities, and handle multiple tasks requiring attention to detail. Previous experience in research environment preferred.<br/><br/></li></ul>About Us<br/><br/>Cedars-Sinai is a leader in providing high-quality healthcare encompassing primary care, specialized medicine and research. Since 1902, Cedars-Sinai has evolved to meet the needs of one of the most diverse regions in the nation, setting standards in quality and innovative patient care, research, teaching and community service. Today, Cedars- Sinai is known for its national leadership in transforming healthcare for the benefit of patients. Cedars-Sinai impacts the future of healthcare by developing new approaches to treatment and educating tomorrow's health professionals. Additionally, Cedars-Sinai demonstrates a commitment to the community through programs that improve the health of its most vulnerable residents.<br/><br/>About The Team<br/><br/>Cedars-Sinai is one of the largest nonprofit academic medical centers in the U.S., with 886 licensed beds, 2,100 physicians, 2,800 nurses and thousands of other healthcare professionals and staff. Choose this if you want to work in a fast-paced environment that offers the highest level of care to people in the Los Angeles that need our care the most.<br/><br/>Req ID : 2199<br/><br/>Working Title : Research Administrative Coordinator - Koronyo Lab - Department of Neurosurgery<br/><br/>Department : Research - Neurosurgical<br/><br/>Business Entity : Cedars-Sinai Medical Center<br/><br/>Job Category : Administrative<br/><br/>Job Specialty : Administrative<br/><br/>Overtime Status : NONEXEMPT<br/><br/>Primary Shift : Day<br/><br/>Shift Duration : 8 hour<br/><br/>Base Pay : $25.73 - $43.74", "postedDate": "2 weeks ago", "qualifications": {"required": "High School Diploma/GED, required.", "preferred": "Bachelor's degree, preferred. Experience in research administration is highly preferred. Proficiency in Word, PowerPoint and Excel (preferred knowledge in Photoshop). Excellent written and oral language skills and understanding of Grants, Manuscript, and Abstract guidelines. Strong verbal and writing communication ability, computer software skills (preferred previous experience with EndNote), organization, personnel, and time-management skills. Ability to work independently, set priorities, and handle multiple tasks requiring attention to detail. Previous experience in research environment preferred."}, "skills": ["Word", "PowerPoint", "Excel", "Photoshop", "EndNote"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3926536052"}