{"jobTitle": "SR PRODUCT MANAGER", "company": {"name": "Sakura Finetek USA", "industry": "Medical Device", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Product Management and Marketing", "industry": "Medical Device", "description": "General Position Summary\nResponsible for marketing, and to provide product marketing and direction for products for primary staining and coverslipping, and adjacent laboratory processes. Manages their instruments, accessories and consumables from a product management and marketing perspective, upstream developing new and/or improving existing products, and downstream increasing their marketability and demand.\n\nUpstream marketing: Performs market research on new products and product improvements, works with R&D on national/international level, drives growth of products along their life cycle. Downstream marketing: segments markets, define target groups, position products, define pricing, develop, and deploys sales enablement tools with focus on technical and application perspectives, determines and deploys customer communication in all available channels to boost demand impactfully. Works with Sr. Director of Marketing and Strategy to develop product road maps and product lines strategies. Publicly promotes product lines wholistically in person at tradeshows, workshops, and educates internal and external customers.\n\nEssential Job Functions\nProduct Management and Marketing Projects\n\n- Is influencer and/or decision maker related to both product lines.\n- Is considered the expert in histopathology, primary staining, coverslipping and develops adjacent processes like slide drying, scanning, and imaging of slides.\n\nUpstream Marketing\n\n- Generates product road maps to grow reliable and efficient system solutions.\n- Scouts and evaluates new technologies to expand and/or protect the company’s business.\n- Uses market research including voice of customers of appropriate types to identify customer needs and future potentials.\n- Drives development of specifications and applications of products to increase their customer fit and demand.\n- Teams up with other departments to increase product-market fit.\n- Partners with vendors for the design and evaluation of products.\n\nDownstream Marketing\n\n- Conducts demonstrations for qualified potential customers, assisting Area Sales Managers to independently handle sales presentations in the future.\n- Teams up with the sales force to increase customer communication.\n- Develop marketing plans and execute them once approved.\n- Develop and execute marketing campaigns that impactfully generate demand from customers, working with company's departments and external partners, ranging from posters presented at national conferences to new digital communication methods.\n- Develops interactive sales enablement tool mainly in electronic format.\n- Adapts communication mix to grow awareness and interest in most relevant products and establish customer loyalty.\n\nPosition Description: Product Manager for Primary Staining and Coverslipping\n\nDownstream Marketing (continued)\n\n- Conducts market research and collects market intelligence on an ongoing basis.\n- Provides product and application training to Sakura Finetek and distributors’ sales and marketing teams including instrumentation software, the chemistry of staining and coverslipping and histology laboratory processes.\n- Creates impactful sales enablement tools.\n- Expands knowledge in tissue evaluation by microscopy and imaging/image analysis.\n- Published product-related documentation on internal platforms (e.g., BTC-HUB) and external platforms.\n- Performs controlled releases for new products and executes agreed projects pre-launch and after-launch to accelerate market adoption.\n- Develops partnerships with laboratories, leaders, and vendors to increase awareness, interest, customer satisfaction and to grow customer preference and loyalty.\n- Grow the market-leading Sakura Finetek company brand and product brands.\n- Supports Sr. Director of Marketing and Strategy in achieving department goals and objectives and driving innovation.\n\nPlanning and Administration Activities\n\n- Develops and implements marketing and market launch plans to achieve sales and profit objectives, input to ROI/NPV models, market and market share development scenarios considering quantitative value/price determination.\n- Provides monthly forecast for the assigned products, identifies needs for actions and develop and deploy related marketing campaigns.\n- Studies pricing and policies to determine pricing of new products to achieve set profit objectives.\n- Manages product-related expense budget, controls spending to maximize return on investment.\n- Maintains technical information and competition files.\n- Manages marketing projects for assigned products, longer and complex projects using Smartsheet.\n\nInformation Management & Reporting Activities\n\n- Provides expertise and leadership in marketing meetings on national and international level.\n- Provides expertise and education to both internal and external customers, including distributors within the territory of the Americas, Sakura Finetek Japan, Sakura Finetek Europe, Sakura Seiki Japan.\n- Collects, interprets, evaluates, and summarizes information in reports, surveys, and market research to drive or assist decision-making processes.\n- Reports important business decisions and risks, provides changes to plans to the manager.\n\nQuality/Business Systems Activities\n\n- Ensures that the Quality/Business System is defined and deployed and actively seeks opportunities to continuously improve.\n- Follows up on action items addressed by senior leadership and leads/contributes to resolution of quality issues.\n- Reviews business metrics, business opportunities and quality improvements.\n- Initiates preventive action based on improvement opportunities or trends identified in quality review meetings.\n- Initiates and or drives actions to advance market adoption of both product lines.\n- Reviews Quality Program issues through active leadership in Review Meetings while interacting closely with the Leadership Representative/Quality Program Coordinator.\n\nCommunications Management Competency\n\n- Manages communication with stakeholders through organized processes to ensure that product marketing information is correct, defined, collected, shared, understood, stored, and retrieved in a manner that effectively meets project and stakeholder needs.\n- Follows processes to ensure clear and effective two-way communication.\n- Utilizes communication mechanisms appropriate to audience, urgency, and message.\n- Manages stakeholder expectations.\n- Works with customers in creating positive external communications, including publications, references, proof sources, testimonials.\n- Implements an information storage and retrieval infrastructure.\n- Documents, communicates, and stores lessons learned in appropriate repository.\n\nPosition Description: Product Manager for Primary Staining and Coverslipping\n\nBusiness Acumen Competency\n\n- Applies knowledge, insights and understanding of product management financials to the benefit of project decisions, actions, and performance.\n- Supports product management performance goals and objectives with the organization’s performance goals and objectives.\n- Meets or exceeds profit objectives such as ROI.\n- Applies appropriate business analysis techniques such as return on investment, business cases, trade studies, cost as an independent variable.\n- Makes business recommendations in a timely and effective manner.\n- Follow appropriate cost accounting practices.\n- Analyzes environment such as political situations, industries and competitors to achieve project and company objectives.\n\nOther Activities\n\n- Contributes to the constant improvement of departmental work processes, research procedures, administrative procedures, etc.\n- Keeps up to date on industry-related and competitive information by attending meetings, conferences and conventions and reading industry journals as well as talking to contacts in the industry.\n- Coordinates with Sales, R&D, Instrument Service, Order Management and Technical Support Department personnel for problem solving.\n- Assists product development personnel with product development as required.\n- Assists in business related activities of Sakura Finetek.\n- Performs special projects and other miscellaneous duties as assigned.\n\nEssential Job Requirements\nEducation\nBachelor's degree (B.A. or B.S.) or equivalent combination of education and experience.\n\nExperience & Minimum Qualifications\n- Five (5) years marketing experience in the clinical or research industry.\n- Ten (10) years of work experience in histopathology.\n- Working knowledge and experience in using or implementing similar products in histopathology.\n- Recognized as expert in field and requires highly specialized skill set.\n- Must have expert level of Microsoft Office Suite.\n- Requires a valid Driver's License and ability to travel extensively.\n\nPhysical Requirements & Working Environment\n- Ability to read and analyze hard written copy and information on a computer screen.\n- Ability to utilize personal computer.\n- Ability to travel within U.S.A. and international locations, approximately 50%.\n- Ability to work on weekends to travel, attend conventions or perform related work.\n- Ability to successfully respond to multiple work pressures.\n- Ability to communicate verbally and in writing to individuals and groups.\n- Ability to communicate verbally in person and using a phone.\n- Ability to listen for understanding and assist in problem solving.\n- Ability to lift, push, and pull a minimum of 25 lbs.\n\nPosition Description: Product Manager for Primary Staining and Coverslipping\n\nThe above description identifies the essential job functions and skills needed by the person or persons assigned to this position. These job functions and skills are not intended to be a complete and exhaustive list of all responsibilities, duties and skills required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. The information contained herein is subject to change at the company's discretion.", "responsibilities": "General Position Summary\nResponsible for marketing, and to provide product marketing and direction for products for primary staining and coverslipping, and adjacent laboratory processes. Manages their instruments, accessories and consumables from a product management and marketing perspective, upstream developing new and/or improving existing products, and downstream increasing their marketability and demand.", "qualifications": {"required": "Bachelor's degree (B.A. or B.S.) or equivalent combination of education and experience.", "preferred": "Five (5) years marketing experience in the clinical or research industry. Ten (10) years of work experience in histopathology. Working knowledge and experience in using or implementing similar products in histopathology. Recognized as expert in field and requires highly specialized skill set. Must have expert level of Microsoft Office Suite. Requires a valid Driver's License and ability to travel extensively."}, "skills": ["Product Management", "Marketing", "Market Research", "Sales Enablement", "Customer Communication"], "postedDate": "4 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3927383171"}