{"jobTitle": "Data Scientist", "company": {"name": "Paramount Pictures", "industry": "Entertainment Providers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$110,000.00 - 125,000.00", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Entertainment Providers", "description": "<strong>Overview &amp; Responsibilities<br/><br/></strong>Under the mentorship of the Executive Director of Global Analytics and Data Science, this role is centered on developing machine learning models, advanced analytics tools, web applications, and backend engineering infrastructure. These initiatives are momentous in shaping strategies across Production, Marketing, and Distribution at Paramount Pictures. The ideal candidate is a data scientist who relishes the challenge of defining and solving complex mathematical problems and applying these solutions to real-world business challenges. Your contributions will be indispensable in delivering best-in-class, big data-driven insights and AI products within the movie industry.<br/><br/><ul><li>Data Analysis and Metric Development: Apply large datasets to develop and refine robust key performance indicators that monitor marketing initiatives, box office performance, and other pertinent metrics across both domestic and international markets. </li><li>Automation and Visualization: Automate the calculation and visualization of these preeminent metrics for routine reporting, ensuring they deliver reliable and actionable insights. </li><li>Machine Learning and Statistical Modeling: Conduct research, recommend, and implement machine learning and statistical models to support various business initiatives. Ensure the appropriate application of innovative models with academic rigor that are well-suited to our business use cases. </li><li>Dashboard and Application Development: Design and create advanced Tableau dashboards and applications that effectively communicate analytical insights to a broad spectrum of partners, from business analysts to C-suite executives. This responsibility includes architecting and developing robust backend calculation pipelines that support the functionality and scalability of these dashboards and applications. </li><li>Partner Communication: Reliably present technical results and strategic insights to both technical and non-technical allies. Collaborate closely with data engineers to secure high-quality data and to understand the orchestration environment for calculation pipeline deployment. Partner with business analysts to translate business requests into technical specifications. <br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Educational Background: Possess a graduate degree in Data Science, Computer Science, Business Analytics, Statistics, Economics, Applied Mathematics, or a related quantitative field from a prestigious institution. </li><li>Professional Experience: Minimum of six months of industry or internship experience in a data science or machine learning engineering role, demonstrating strong proficiency in Python, SQL, and version control using Git. </li><li>Technical Skills: Tried ability to independently fit, evaluate, and interpret statistical and machine learning models within a business context. </li><li>Communication Skills: Excellent verbal and written communication skills, crucial for documenting findings and fostering effective daily collaborations. </li><li>Project Management: Ability to prioritize and meet deadlines in a dynamic environment. </li><li>Attention to Detail: Prodigious attention to detail, ensuring precision in data analysis, model development, and reporting. <br/><br/></li></ul><strong>Additional Qualifications<br/><br/></strong><ul><li>Data orchestration tools such as Airflow. </li><li>Data warehousing solutions like Snowflake. </li><li>Cloud services, including Amazon Web Services (AWS) and Google Cloud Platform (GCP). </li><li>Development environments like Visual Studio Code. </li><li>Programming skills in HTML, C, or Java. </li><li>Web application development. </li><li>Data pipeline ingestion processes. </li><li>A high degree of curiosity and motivation to learn new technologies and methodologies. </li><li>Stellar problem-solving skills and logical thinking. </li><li>A strong interest in AI and enthusiasm for AI product development. </li><li>40295<br/><br/></li></ul>Founded in 1912, Paramount Pictures works with talented filmmakers to produce and distribute entertainment around the world. The film studio’s iconic logo has opened some of the most successful and beloved films in cinematic history, including timeless classics such as The Godfather, Chinatown, Forrest Gump and Titanic; and blockbuster franchises such as Star Trek, Transformers, Mission: Impossible and Sonic the Hedgehog. Recent, innovative, break-out films such as The Wolf of Wall Street, Arrival, Rocketman, and A Quiet Place have added to Paramount’s film legacy. With a beautiful 65-acre lot in the heart of Hollywood, a worldwide network of offices and a culture of engagement, Paramount Pictures’ passionate employees ensure the studio continues to deliver creativity and innovation to a dynamic industry. Paramount Pictures controls a collection of some of the most powerful brands in filmed entertainment, including Paramount Pictures, Paramount Animation, and Paramount Players. PPC operations also include Paramount Home Entertainment, Paramount Pictures International, Paramount Licensing Inc., and Paramount Studio Group. Paramount Pictures is a subsidiary of Paramount, which connects with billions of people worldwide through its global brands including MTV, CBS, Paramount Network, Nickelodeon, Comedy Central, BET and streaming service Paramount+.<br/><br/><strong>Additional Information<br/><br/></strong>Hiring Salary Range: $110,000.00 - 125,000.00.<br/><br/>The hiring salary range for this position applies to New York, California, Colorado, Washington state, and most other geographies. Starting pay for the successful applicant depends on a variety of job-related factors, including but not limited to geographic location, market demands, experience, training, and education. The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, disability benefits, tuition assistance program and PTO or, if applicable, as otherwise dictated by the appropriate Collective Bargaining Agreement. This position is bonus eligible.<br/><br/>https://www.paramount.com/careers/benefits<br/><br/>Paramount is an equal opportunity employer (EOE) including disability/vet.<br/><br/>At Paramount, the spirit of inclusion feeds into everything that we do, on-screen and off. From the programming and movies we create to employee benefits/programs and social impact outreach initiatives, we believe that opportunity, access, resources and rewards should be available to and for the benefit of all. Paramount is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, and Veteran status.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access https://www.paramount.com/careers as a result of your disability. You can request reasonable accommodations by calling 212.846.5500 or by sending an email to paramountaccommodations@paramount.com. Only messages left for this purpose will be returned.<br/><br/>", "responsibilities": "Under the mentorship of the Executive Director of Global Analytics and Data Science, this role is centered on developing machine learning models, advanced analytics tools, web applications, and backend engineering infrastructure. These initiatives are momentous in shaping strategies across Production, Marketing, and Distribution at Paramount Pictures. The ideal candidate is a data scientist who relishes the challenge of defining and solving complex mathematical problems and applying these solutions to real-world business challenges. Your contributions will be indispensable in delivering best-in-class, big data-driven insights and AI products within the movie industry.<br/><br/><ul><li>Data Analysis and Metric Development: Apply large datasets to develop and refine robust key performance indicators that monitor marketing initiatives, box office performance, and other pertinent metrics across both domestic and international markets. </li><li>Automation and Visualization: Automate the calculation and visualization of these preeminent metrics for routine reporting, ensuring they deliver reliable and actionable insights. </li><li>Machine Learning and Statistical Modeling: Conduct research, recommend, and implement machine learning and statistical models to support various business initiatives. Ensure the appropriate application of innovative models with academic rigor that are well-suited to our business use cases. </li><li>Dashboard and Application Development: Design and create advanced Tableau dashboards and applications that effectively communicate analytical insights to a broad spectrum of partners, from business analysts to C-suite executives. This responsibility includes architecting and developing robust backend calculation pipelines that support the functionality and scalability of these dashboards and applications. </li><li>Partner Communication: Reliably present technical results and strategic insights to both technical and non-technical allies. Collaborate closely with data engineers to secure high-quality data and to understand the orchestration environment for calculation pipeline deployment. Partner with business analysts to translate business requests into technical specifications. <br/><br/></li></ul>", "qualifications": {"required": "Educational Background: Possess a graduate degree in Data Science, Computer Science, Business Analytics, Statistics, Economics, Applied Mathematics, or a related quantitative field from a prestigious institution. \nProfessional Experience: Minimum of six months of industry or internship experience in a data science or machine learning engineering role, demonstrating strong proficiency in Python, SQL, and version control using Git. \nTechnical Skills: Tried ability to independently fit, evaluate, and interpret statistical and machine learning models within a business context. \nCommunication Skills: Excellent verbal and written communication skills, crucial for documenting findings and fostering effective daily collaborations. \nProject Management: Ability to prioritize and meet deadlines in a dynamic environment. \nAttention to Detail: Prodigious attention to detail, ensuring precision in data analysis, model development, and reporting. <br/><br/>", "preferred": "Data orchestration tools such as Airflow. \nData warehousing solutions like Snowflake. \nCloud services, including Amazon Web Services (AWS) and Google Cloud Platform (GCP). \nDevelopment environments like Visual Studio Code. \nProgramming skills in HTML, C, or Java. \nWeb application development. \nData pipeline ingestion processes. \nA high degree of curiosity and motivation to learn new technologies and methodologies. \nStellar problem-solving skills and logical thinking. \nA strong interest in AI and enthusiasm for AI product development. \n40295<br/><br/>"}, "skills": ["Python", "SQL", "Git", "Tableau", "Airflow", "Snowflake", "AWS", "GCP", "Visual Studio Code", "HTML", "C", "Java"], "postedDate": "2 months ago", "benefits": "The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, disability benefits, tuition assistance program and PTO or, if applicable, as otherwise dictated by the appropriate Collective Bargaining Agreement. This position is bonus eligible.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3927856491"}