{"jobTitle": "Facilities & Operations Analyst", "company": {"name": "Special Service for Groups", "industry": "Non-profit Organization Management", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Non-profit Organization Management", "description": "<strong>Summary<br/><br/></strong>Job Description<br/><br/>Under the supervision of the Program Director of Housing Operations, the Facilities and Operations Analyst will assist with supporting the Program Director of Housing Operations’ responsibilities across the agencies’ multiple building sites. The Facilities and Operations Analyst will assist in project liaison, project management and operations; program development; documentation management; and other administrative functions of the agency. They will also coordinate information technology and systems, and the planning and dissemination of specific projects and/or contracts. This is a full-time position (40 hours per week) and requires flexible hours including evenings, weekends, and some holidays.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Assist management in supporting building operations and maintenance of APAIT’s multiple housing sites and offices. </li><li>Support the organizing, centralization, and maintenance of key operations documents for APAIT’s multiple building sites. </li><li>Assist in standardizing operations processes of buildings, and in the development and maintenance of their operations schedules (ex. inspections and maintenance). </li><li>Assist in creating and maintaining step guides and Standard Operating Procedures (SOPs) for building sites. </li><li>Assist in driving building project management and housing operations initiatives. </li><li>Assist management in getting buy-in from cross-functional and interdepartmental stakeholders with projects. </li><li>Collaborate in implementing value adding and cost reduction initiatives at housing sites and offices. </li><li>Partner with IT Support on information system setup needs (including network users, laptops, and iPhones) during onboarding of new staff. </li><li>Coordinate on-site logistics and telecommunications setup during onboarding of new staff and on an ongoing basis. </li><li>Provide programmatic and administrative technical assistance to program personnel. </li><li>Support program group preparation activities, including but not limited to purchase, order, pick-up, and delivery. </li><li>Assist in the coordination of and participation in community events, health fairs and festivals. </li><li>Represent the agency by attending local planning groups, community forums and collaboration meetings as assigned. </li><li>Function as back-up for front-office reception as-needed. </li><li>Maintain and uphold Agency mission statement, values, policies, procedures, and principles. </li><li>Interpret agency purpose and mission to the community. </li><li>Ability to work overtime, work on weekends, holidays, and evenings when required. </li><li>Other duties as assigned to meet program and agency mission, goals, and objectives. <br/><br/></li></ul><strong>Minimum Qualifications - Knowledge, Skills And Abilities Required<br/><br/></strong><li>Bachelor’s degree in Business Administration, Finance or related field. </li><li>Knowledge of and ability to work with racial/ethnic minority, impoverished and underserved communities and groups (e.g., multi-gender, LGBTQ, substance using)</li><li>Basic knowledge, work experience, and understanding of HIV/AIDS and other related issues. </li><li>Proficient with Microsoft Office programs (Word, Outlook, PowerPoint, and Excel necessary). </li><li>Experience with a Project Management software (i.e., Monday.com, Asana or Microsoft Projects)</li><li>Proficient writing and oral communication skills. </li><li>Demonstrated experience and knowledge of PC hardware. </li><li>Ability to coordinate multiple projects and tasks simultaneously in a high-pressure work environment. </li><li>Ability to master a wide-range of information, adapt, take initiative, and work in a team-centered environment. </li><li>Ability to perform duties on some weekday evenings and weekend days when required. </li><li>Verification of employment eligibility. </li><li>Valid California Driver’s License, plus proof of current automobile insurance</li>Reliable transportation for some local travel (&lt;25%) to off-site meetings, agency events, etc. <li>Maintain and uphold Agency mission statement, values, policies, procedures, and principles. </li><li>Verification of employment eligibility. </li><li>Updated tuberculosis test (annual requirement) read, reviewed, and dated by clinician within 6 months of start date. <br/><br/></li><strong>Non-Essential Qualifications - Knowledge, Skills, And Abilities<br/><br/></strong><ul><li>Preference for one to be Bilingual in Spanish (speak, read, and write). </li><li>Experience working in a non-profit community-based organization. </li><li>Experience in training. <br/><br/></li></ul><em><strong>NO PHONE CALLS PLEASE.<br/><br/></strong></em><em>Special Service for Groups, Inc. (SSG) is an Equal Opportunity/Affirmative Action Employer.<br/><br/></em><em>SSG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements set by law.<br/><br/></em><strong>Company Description<br/><br/></strong>Special Service for Groups, Inc. – better known as SSG – is a non-profit health and human service organization dedicated to building and sustaining community-based programs that address the needs of vulnerable communities. Special Service for Groups (SSG) is a non-profit organization dedicated to provide community-based solutions to the social and economic issues facing those in greatest need. SSG has evolved into a model organization designed to provide services for diverse groups with maximum efficiency and impact. This is achieved by developing and managing programs which serve our many communities by encouraging their involvement and self-sufficiency. SSG believes that the needs of groups and individuals cross traditional ethnic, racial and other cultural boundaries. SSG serves as a bridge between people with common needs to identify ways to pool resources for the greater good of all.<br/><br/>Special Service for Groups, Inc. – better known as SSG – is a non-profit health and human service organization dedicated to building and sustaining community-based programs that address the needs of vulnerable communities. Special Service for Groups (SSG) is a non-profit organization dedicated to provide community-based solutions to the social and economic issues facing those in greatest need. SSG has evolved into a model organization designed to provide services for diverse groups with maximum efficiency and impact. This is achieved by developing and managing programs which serve our many communities by encouraging their involvement and self-sufficiency. SSG believes that the needs of groups and individuals cross traditional ethnic, racial and other cultural boundaries. SSG serves as a bridge between people with common needs to identify ways to pool resources for the greater good of all.", "postedDate": "3 months ago", "skills": ["Microsoft Office", "Project Management", "Communication", "PC Hardware", "Teamwork", "Bilingual", "Spanish", "Non-profit", "Training"], "url": "https://www.linkedin.com/jobs/view/3928902513"}