{"jobTitle": "Sr. Purchasing Analyst", "company": {"name": "SpaceX", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $115,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.<br/><br/><strong>SR. PURCHASING ANALYST<br/><br/></strong>The Sr. Purchasing Analyst is a key role within our finance organization with executive-level visibility. The successful candidate will interface with all aspects of the company, including production, program management, accounting, and executive management. This individual will possess strong analytical skills to provide insights to the business for large spending decisions, as well as a keen sense for optimizing team productivity through process improvement and automation of non-value tasks.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Create reports, tools, and standardized metrics for operational measurement and improvement, using software such as Microsoft Excel and Power BI</li><li>Work with cross-functional teams to understand current processes and identify systematic gaps, then drive system enhancements to optimize productivity or process improvement</li><li>Identify and drive projects to automate non-value essential processes within the purchasing department to remove the need for human intervention in remedial tasks</li><li>Develop and enhance tools for the purchasing team to utilize that focus on spending trends, team productivity metrics, and workload balancing across the organization</li><li>Conduct in-depth analyses through SQL queries and other data analysis methods to dive into problems and identify trends for decision-making</li><li>Administer the company's corporate card program</li><li>Own system maintenance and data integrity, and troubleshoot with other departments as necessary</li><li>Test software updates and push corrections to system bugs affecting the purchasing team’s primary internal applications</li><li>Train users and leaders on system developments or enhancements, and assist in troubleshooting</li><li>Analyze and interpret financial data for use in management reviews and decision-making<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s degree</li><li>3+ years of professional experience in purchasing, supply chain, finance operations, or business</li><li>2+ years of experience using SQL and Excel for business analysis, project management, or ERP systems support<br/><br/></li></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li>Bachelor’s degree in supply chain management, business, or finance</li><li>Experience with SQL, Power BI, Jira, and Confluence</li><li>Advanced skills in Microsoft Excel, SQL, OLAP tools, applied business analytics and statistics, forecasting, and general modeling experience of complex non-linear systems</li><li>Experience auditing, owning, or administering a corporate card program</li><li>Ability to analyze data and check for accuracy/errors in datasets based on process and system knowledge</li><li>Strong knowledge of supply chain/purchasing and finance functions, with experience in cross-functional projects for business process enhancement/automation</li><li>Experience working within manufacturing or technology organizations</li><li>Strong presentation skills with the ability to regularly interface with executive management</li><li>Strong leadership skills and a high level of responsibility and ability to work with minimal supervision in a fast-paced environment</li><li>Ability to frame unstructured and complex analytical problems for a broad audience</li><li>Extreme attention to detail<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Willingness to work long hours and weekends when needed to meet critical deadlines</li><li>This position is based in Hawthorne, CA, and requires being onsite - remote work is not considered<br/><br/></li></ul><strong>Compensation &amp; Benefits<br/><br/></strong>Pay range:<br/><br/>Sr. Purchasing Analyst: $90,000.00 - $115,000.00/per year<br/><br/>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.<br/><br/><strong>Itar Requirements<br/><br/></strong><ul><li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C.</li><li>1157, or (iv) Asylee under 8 U.S.C.</li><li>1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. <br/><br/></li></ul>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.<br/><br/>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.", "responsibilities": "The Sr. Purchasing Analyst is a key role within our finance organization with executive-level visibility. The successful candidate will interface with all aspects of the company, including production, program management, accounting, and executive management. This individual will possess strong analytical skills to provide insights to the business for large spending decisions, as well as a keen sense for optimizing team productivity through process improvement and automation of non-value tasks.", "qualifications": {"required": "Bachelor’s degree, 3+ years of professional experience in purchasing, supply chain, finance operations, or business, 2+ years of experience using SQL and Excel for business analysis, project management, or ERP systems support", "preferred": "Bachelor’s degree in supply chain management, business, or finance, Experience with SQL, Power BI, Jira, and Confluence, Advanced skills in Microsoft Excel, SQL, OLAP tools, applied business analytics and statistics, forecasting, and general modeling experience of complex non-linear systems, Experience auditing, owning, or administering a corporate card program, Ability to analyze data and check for accuracy/errors in datasets based on process and system knowledge, Strong knowledge of supply chain/purchasing and finance functions, with experience in cross-functional projects for business process enhancement/automation, Experience working within manufacturing or technology organizations, Strong presentation skills with the ability to regularly interface with executive management, Strong leadership skills and a high level of responsibility and ability to work with minimal supervision in a fast-paced environment, Ability to frame unstructured and complex analytical problems for a broad audience, Extreme attention to detail"}, "skills": ["SQL", "Excel", "Power BI", "Jira", "Confluence", "OLAP tools", "business analytics", "statistics", "forecasting", "modeling", "supply chain", "purchasing", "finance", "presentation skills", "leadership skills"], "postedDate": "1 week ago", "benefits": "Pay range:<br/><br/>Sr. Purchasing Analyst: $90,000.00 - $115,000.00/per year<br/><br/>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3928923761"}