{"jobTitle": "Product Data Analyst", "company": {"name": "DataAnnotation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are seeking a highly analytical and detail-oriented Product Data Analyst to join our fast-paced and innovative team. As a Product Data Analyst, you will play a crucial role in collecting, analyzing, and interpreting data to drive strategic decisions and optimize product performance. Your insights will directly impact our company's ability to understand customer behavior, identify market trends, and enhance the overall product experience.<br/><br/>In this role, you will collaborate with cross-functional teams, including product management, engineering, and marketing, to gather and synthesize data from multiple sources. You will be responsible for designing and implementing data collection methodologies, as well as developing and maintaining scalable data pipelines. Additionally, you will leverage statistical analysis, data modeling, and visualization techniques to uncover actionable insights and communicate findings to stakeholders.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Collect, clean, and analyze product data from multiple sources, including customer feedback, sales figures, and user behavior metrics. </li><li>Identify key performance indicators (KPIs) and develop dashboards and reports to track and monitor product performance. </li><li>Conduct in-depth analysis of user engagement and conversion metrics to identify trends and actionable insights. </li><li>Collaborate with cross-functional teams to define and prioritize data-driven product improvements and feature enhancements. </li><li>Build predictive models and conduct A/B tests to evaluate the impact of product changes and optimize decision-making. </li><li>Evaluate the effectiveness of marketing campaigns and provide recommendations for optimization based on data insights. </li><li>Stay up-to-date with industry trends and best practices in data analysis and apply them to drive innovation and continuous improvement. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in statistics, mathematics, computer science, or a related field. </li><li>Proven experience in data analysis, preferably in a product or marketing analytics role. </li><li>Proficiency in SQL, Excel, and data visualization tools such as Tableau or Power BI. </li><li>Strong analytical skills with the ability to collect, organize, and analyze large datasets. </li><li>Knowledge of statistical analysis techniques and experience with statistical software (e.g., R, Python, or SAS). </li><li>Familiarity with data warehousing concepts and experience with ETL (Extract, Transform, Load) processes. </li><li>Ability to communicate complex insights and findings in a clear and concise manner to both technical and non-technical stakeholders. <br/><br/></li></ul>Powered by Webbtree", "jobFunction": "Other", "industry": "Staffing and Recruiting", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3928045515"}