{"jobTitle": "Client Manager - Employee Benefits", "company": {"name": "Alliant Insurance Services", "industry": "Insurance", "size": "10,001+ employees", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "Not disclosed", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "At Alliant Insurance Services, we thrive on creating employee benefits solutions built on the idea that health makes growth possible. As top tier professionals dedicated to solving our clients' health and welfare insurance challenges, Alliant team members deliver an unrivaled depth of service, and our unique approach enables us to help clients stay resilient and turn change into opportunity. This position is a chance to join a dynamic, expanding company with prospects for individual and career growth. As one of the 10 largest insurance brokerage firms in the U.S., Alliant provides property and casualty, workers' compensation, employee benefits, surety, and financial products and services to clients nationwide. More information is available at www.alliant.com.", "responsibilities": "Responsible for collaborating with Employee Benefit Account Executives on the development and execution of client-centered strategies. Manages a book of business and directs/contributes to the work of a multi-disciplined service team.", "qualifications": {"required": "Bachelor’s degree or equivalent combination of education and experience. Seven (7) or more years related work experience. Valid insurance license. Must continue to meet Continuing Education requirements for license renewal. Baseline understanding of self-insurance and alternative funding arrangements. High level of Employee Benefit product and benefit administration knowledge.", "preferred": "Good verbal and written communication skills. Good problem solving and time management skills. Good presentation skills and ability to conduct open enrollment meetings. Excellent customer service skills. Ability to work within a team and to foster teamwork. Ability to prioritize work for multiple projects and deadlines. Strong understanding of self-insurance and alternative funding arrangements. Proficient in Microsoft Office Suite."}, "skills": ["Good verbal and written communication skills", "Good problem solving and time management skills", "Good presentation skills", "Excellent customer service skills", "Ability to work within a team", "Ability to prioritize work for multiple projects and deadlines", "Proficient in Microsoft Office Suite"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "We are proud to provide comprehensive, high quality employee programs to meet employees’ needs now and in the future, including a very competitive financial package.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3928120090"}