{"jobTitle": "Facilities Maintenance Lead", "company": {"name": "Rivian", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "98,000 - $123,000", "currency": "USD"}, "jobFunction": "General Business", "industry": "Motor Vehicle Manufacturing", "description": "About Rivian<br/><br/>Rivian is on a mission to keep the world adventurous forever. This goes for the emissions-free Electric Adventure Vehicles we build, and the curious, courageous souls we seek to attract.<br/><br/>As a company, we constantly challenge what’s possible, never simply accepting what has always been done. We reframe old problems, seek new solutions and operate comfortably in areas that are unknown. Our backgrounds are diverse, but our team shares a love of the outdoors and a desire to protect it for future generations.<br/><br/>Role Summary<br/><br/>The Facilities Maintenance Lead will be responsible for maintaining all building infrastructure systems, preventative repair and maintenance strategy, and leading the maintenance team for office and lab facilities in Southern California . In true start up fashion, some of these programs do not exist or have opportunity for refinement as the company scales. Rivian is looking for an experienced individual, who is a self-starter, collaborative, highly organized, and communicative leader to champion and execute these programs.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Manage day-to-day building operations, inspections and maintenance tasks at multiple sites simultaneously</li><li>Supervise Maintenance Engineers and Contractors to provide onsite support for safe and compliant operations</li><li>Maintain and monitor maintenance and repairs on equipment, which includes mechanical (HVAC, boilers), electrical (generators, transfer switches and switchgear), fire detection, life safety, lighting and building management systems</li><li>Respond to building emergencies (FLS, power outage, plumbing, equipment failure, etc.) during and outside of business hours</li><li>Maintain equipment preventative maintenance reports and records.</li><li>Work with the Sr. Manager, Workplace Facilities Maintenance to review and create budgets and forecasts</li><li>Partner with the Environmental Health and Safety team to ensure sites are maintained in compliance with all applicable codes, regulations, and standards.</li><li>Develop maintenance policies and procedures</li><li>Use data analysis and end user feedback to help prepare and prevent future issues</li><li>Onboard and maintain vendor relationships<br/><br/></li></ul>Qualifications<br/><br/>\n<ul><li>5+ years of experience in facilities management and workplace services.</li><li>Strong understanding of mechanical and electrical systems and knowledge of safety regulations.</li><li>Project management experience preferred.</li><li>Bachelor’s Degree or equivalent experience.</li><li>Excellent communication, organization, and problem-solving skills.</li><li>Proficiency in Microsoft suite, Slack and ServiceNow.</li><li>A service-oriented personality, self-motivated, confident, energetic, and flexible.</li><li>Self-starter who is goal oriented, highly motivated and excels in a fast-paced environment.</li><li>Ability and willingness to travel approximately 30% of each month throughout LA/Orange Country Facilities.<br/><br/></li></ul>Pay Disclosure<br/><br/>Salary Range for Irvine, CA based applicants: $98,000 - $123,000 annually (Actual compensation will be determined based on experience, location and other factors permitted by law).<br/><br/>Benefits Summary: Rivian provides robust medical/Rx, dental and vision insurance packages for full-time employees, their spouse or domestic partner, and children up to age 26. Coverage is effective on the first day of employment, and Rivian covers most of the premiums.<br/><br/>Equal Opportunity<br/><br/>Rivian is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law.<br/><br/>Rivian is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at candidateaccommodations@rivian.com .<br/><br/>Candidate Data Privacy<br/><br/>Rivian may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Rivian may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.<br/><br/>Rivian may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our People Team, Finance, Legal, and the team(s) with the position(s) for which you are applying; (ii) Rivian affiliates; and (iii) Rivian’s service providers, including providers of background checks, staffing services, and cloud services.<br/><br/>Rivian may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, the United Kingdom, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.<br/><br/>Please note that we are currently not accepting applications from third party application services.", "responsibilities": "Manage day-to-day building operations, inspections and maintenance tasks at multiple sites simultaneously\nSupervise Maintenance Engineers and Contractors to provide onsite support for safe and compliant operations\nMaintain and monitor maintenance and repairs on equipment, which includes mechanical (HVAC, boilers), electrical (generators, transfer switches and switchgear), fire detection, life safety, lighting and building management systems\nRespond to building emergencies (FLS, power outage, plumbing, equipment failure, etc.) during and outside of business hours\nMaintain equipment preventative maintenance reports and records.\nWork with the Sr. Manager, Workplace Facilities Maintenance to review and create budgets and forecasts\nPartner with the Environmental Health and Safety team to ensure sites are maintained in compliance with all applicable codes, regulations, and standards.\nDevelop maintenance policies and procedures\nUse data analysis and end user feedback to help prepare and prevent future issues\nOnboard and maintain vendor relationships", "qualifications": {"required": "5+ years of experience in facilities management and workplace services.\nStrong understanding of mechanical and electrical systems and knowledge of safety regulations.\nProject management experience preferred.\nBachelor’s Degree or equivalent experience.\nExcellent communication, organization, and problem-solving skills.\nProficiency in Microsoft suite, Slack and ServiceNow.\nA service-oriented personality, self-motivated, confident, energetic, and flexible.\nSelf-starter who is goal oriented, highly motivated and excels in a fast-paced environment.\nAbility and willingness to travel approximately 30% of each month throughout LA/Orange Country Facilities."}, "skills": ["Microsoft Suite", "Slack", "ServiceNow", "Project Management", "Facilities Management", "Workplace Services", "Mechanical Systems", "Electrical Systems", "Safety Regulations"], "postedDate": "2 weeks ago", "benefits": "Rivian provides robust medical/Rx, dental and vision insurance packages for full-time employees, their spouse or domestic partner, and children up to age 26. Coverage is effective on the first day of employment, and Rivian covers most of the premiums.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3928809722"}