{"jobTitle": "Senior Campaign Analyst, Clean Heat", "company": {"name": "Industrious Labs", "location": "Los Angeles, CA", "industry": "Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Heavy industry is the foundation of modern society. We need materials like cement, steel, and aluminum more than ever to rebuild our bridges and roads, construct wind and solar projects, and manufacture electric vehicles and heat pumps that will undergird our future. But industry needs a second revolution. For as much as industry made the middle class and ushered in a remarkable era of prosperity for many, it also threatens our climate, reinforces environmental racism, wastes valuable materials and energy, and leaves communities and workers behind.\n\nAt Industrious Labs, our mission is to set into motion unstoppable policies, people power, and analysis to make a triple impact on climate, justice, and jobs that drastically reduce dangerous emissions, make industry accountable to communities and workers, and develop a circular economy.\n\nAbout the Position\n\nGuided by an inspiring vision, strategic plan, and significant early financial investment, we are seeking an entrepreneurial Senior Campaign Analyst to join our team. Industrious Labs is fully remote, but for this position, there is a preference for a candidate living in or able to travel to California. This role reports to Partner and Analytics Director Victoria Chu.\n\nIndustrious Labs is poised to kick off a new Clean Heat initiative, with an initial focus on California and a parallel national effort. Working collaboratively with partners over the past year, we have identified an exciting strategy to dramatically reduce greenhouse gas emissions and dangerous air pollution from industrial heaters and boilers. Today, these heaters and boilers burn fossil fuels to produce needed heat for industrial processes, but in many cases, this equipment can be replaced with all-electric or other zero-emission alternatives. We have received sufficient early-stage backing to begin campaign implementation thanks to a visionary funder.\n\nIn this newly created position, the Senior Campaign Analyst is responsible for designing and leading research, data, and analytic work supporting the Clean Heat initiative. The Senior Campaign Analyst builds and interprets climate and energy models, communicates analysis in technical comments, memos, reports, and visualizations, and leads on data hunting, transformation, and management. Because industrial heat is a new area of advocacy, the Senior Campaign Analyst will often need to create new research methodologies or extrapolate and infer insights from limited or seemingly inapplicable and disjointed data sets. The Senior Campaign Analyst is energized by the challenge of the climate crisis, inspired to step into a new era of the movement, and has a strong track record of working with diverse groups such as organized labor, environmental justice advocates, and policymakers.\n\nAlong with this role, Industrious Labs is currently hiring a Senior Campaign Strategist and Senior Field Strategist for the Clean Heat initiative. The Senior Campaign Analyst will work within this new, dynamic team. Our high-level objectives for the campaign include (but are not limited to):\n\n<ul><li>Accelerate zero-emission state policies and regulations that clean up and transform industrial facilities;</li><li>Launch a coalition focused on industrial electrification to build power and pressure on policy-makers; and </li><li>Increase the urgency for policy-makers to act by building awareness of the harms created by fossil combustion at industrial facilities and the benefits of transformation.<br/><br/></li></ul>The Senior Campaign Analyst holds key responsibilities that will evolve over time as the team grows and functions are distributed. During the first year of the role, the Senior Campaign Analyst will advance:\n\n<em>Technical Analysis</em>\n\n<ul><li>Lead technical industrial analysis, publishing technical reports and presenting findings for non-technical audiences.</li><li>Contribute expert testimony, analysis, and comments to push and support regulatory processes that are already underway, such as through the South Coast Air Quality Management District's regulation of boilers and process heaters.</li><li>Oversee and contribute to the development of a techno-economic boilers and process heater inventory supplemented by existing or emerging decarbonization technologies</li><li>Work with the rest of the Clean Heat initiative team to develop materials for regular publication.<br/><br/></li></ul><em>Strategic Impact</em>\n\n<ul><li>Measure, track, and report the impact of the Clean Heat initiative within the framework of Industrious Labs' Impact Measurement system and toward the overall goal of heavy industrial decarbonization.</li><li>Become an in-house subject matter expert on decarbonization pathways for industrial process heat.</li><li>Lead in the design and implementation of analytical and quantitative tools in partnership with campaign and field leads for the development of robust, data-driven campaigns.<br/><br/></li></ul><em>Organizational and Partner Support</em>\n\n<ul><li>Conduct analyses and foster equitable data approaches to deliver greater benefits to historically marginalized and frontline communities, supporting efforts to reduce exposure to negative health and environmental impacts from heavy industry.</li><li>Build and maintain relationships with advocates, community leaders, environmental and energy justice organizations, and industry experts to exchange information, advance shared objectives, and engage in collaborative projects.</li><li>Communicate analysis to internal stakeholders, funders, and coalition partners in the form of webinars, trainings, articles, or reports to accelerate progress and learning in needed areas.<br/><br/></li></ul>Who You Are\n\nThe incoming Senior Campaign Analyst is driven by their belief and commitment to Industrious Labs' vision, mission, and values. Through their track record and expertise – optimally within the climate or another social justice movement – the successful candidate will play a vital role in the development and execution of a burgeoning Clean Heat initiative.\n\nThe Senior Campaign Analyst brings an energy systems background and analysis to the team to identify and support strategic climate opportunities, including research and analysis of energy, climate, industry, and electoral/socio-political trends. The Senior Campaign Analyst has a clear understanding of—and a deep commitment to—people and communities that are most impacted by climate change and industrial pollution. The Senior Campaign Analyst approaches this work with an equity and justice orientation.\n\nThe Senior Campaign Analyst joins a deeply committed team that brings a track record of success in campaign strategy, data analysis, and communications, with a particular focus on climate and clean energy. The successful candidate is entrepreneurial and excited about the prospect of building something new in the climate movement from the ground up. They have the experience of setting vision, establishing, and scaling successful programs with an ethos of creativity, humility, and an expectation of continual learning.\n\nDespite the obstacles that stand in the way of decarbonizing heavy industry, the Industrious Labs team operates with a spirit of possibilities and seeks a Senior Campaign Analyst who shares the belief that we can all do things we've never done before and can stretch ourselves to achieve incredible results. The selected candidate will also possess most of the following Core and Preferred qualifications:\n\n<em>Senior Campaign Analyst Core Qualifications</em>\n\n<ul><li>At least 5-8 years of increasing responsibility in data and analytics, with professional and/or educational experience that demonstrates exceptional qualitative and quantitative analytical skills and modeling. Specifically:</li><ul><li>Familiarity with analyzing power system data from the National Renewable Energy Laboratory (NREL), Energy Information Administration (EIA), Environmental Protection Agency (EPA), including electricity demand data, power plant characteristics, transmission line data, renewable energy modeling and credits, and emissions/fuel pricing</li><li>Demonstrated experience with statistical software such as R, Python, SAS, or Stata and visualization software such as GIS, Tableau, Plotly, or other</li><li>Advanced proficiency in MS Office applications, specifically Microsoft Excel</li></ul><li>Exceptional oral and written communication skills with the ability to break down a complex issue into manageable and clear decision points that drive the desired campaign outcomes.</li><li>Excited rather than intimidated by the challenge of what's unknown about this role.<br/></li></ul><em>Senior Campaign Analyst Preferred Qualifications</em>\n\n<ul><li>Outstanding project management abilities to ensure strong collaboration of campaigns and projects that advance on time and on budget.</li><li>Entrepreneurial drive to build an organization from the ground up; prior start-up experience as an early team member in a growing organization.</li><li>Experience in the climate movement or another social justice movement.</li><li>Experience using data and analysis in a campaign or advocacy context.</li><li>Experience working in California and familiarity with the California advocacy landscape.<br/><br/></li></ul><em>Industrious Labs Core Qualifications</em>\n\nBelow are the qualifications expected of all Industrious Labs staff.\n\n<ul><li>Strong commitment to the mission, vision, policies, and goals of Industrious Labs.</li><li>Highly collaborative work style with the ability to operate as a peer and thought partner to colleagues and external partners.</li><li>Commitment to continuous learning, hunger for knowledge, and willingness to ask questions and self-correct; a curious, self-directed, and entrepreneurial approach.</li><li>Exceptional oral and written communication skills with the ability to break down a complex issue into manageable and clear decision points that drive the desired campaign outcomes.</li><li>Excited rather than intimidated by the challenge of what's unknown about this role.</li><li>Proven leadership skills with clarity of vision and a commitment to the highest levels of integrity, quality, and collaboration, developing strong team cultures, promoting and enhancing equity, diversity, and inclusion, performance management, and professional development.</li><li>Demonstrated experience working across lines of race, class, gender, and geography and an analysis of how climate change intersects with historically oppressed and marginalized communities.</li><li>Proven ability to prioritize and be flexible in a fast-paced, constantly evolving, and collaborative environment, where working on a team and working individually are all required.</li><li>Commitment to giving and receiving direct, compassionate feedback.<br/><br/></li></ul>Salary and Benefits:\n\nThe salary for this position is $113,000. Industrious Labs has a policy not to negotiate salaries. Historically, negotiations reward those who have the skill, privilege, and confidence to ask for more money; and because not everyone has those skills, allowing for negotiations undermines the economic equity we strive for as an organization. Rather than use negotiations to drive competitive salaries, we endeavor to pay people well and establish a transparent salary scale based on the experience, competencies, and responsibilities required to thrive in this role.\n\nIndustrious Labs offers a competitive set of benefits, including 100% comprehensive health care coverage for employees (medical, dental, and vision); a 50% contribution to health care coverage for dependents; work from home stipend; up to 5% employer match to 401k; generous paid parental/family leave; and 11 paid holidays plus unlimited vacation, starting with a minimum of 15 business days.\n\nOur Commitment to Racial Equity, Diversity, Inclusion & Climate Justice:\n\nWe believe that diversity in our team isn't just a value but brings different lived experiences and perspectives that are essential to solving the climate crisis. If you've read this job description and are excited by it, and if you can see yourself happily filling this role and making a difference on climate change, we really hope you apply. Industrious Labs is an equal-opportunity employer and is committed to transparent and equitable recruitment, hiring, and promotion processes that foster inclusion and belonging. If you need reasonable accommodation during the application or interview process, please email Victoria Chu at victoria@industriouslabs.org.\n\nApplication Procedure:\n\nTo apply, please submit a resume and cover letter answering the following:\n\n<ul><li>What motivates you to spend your time, skills, and expertise working on climate change?</li><li>When was the last time you become an expert in something? How did you do it? Please be specific about the data sources you found, how you processed and analyzed the data (what programs did you use?), and how you presented your findings and analysis to stakeholders<br/><br/></li></ul>This position is open until filled. Candidate review and phone screens begin immediately and will be conducted throughout the search. We anticipate several steps of mutual exploration, including a phone screen, panel interview(s) and thought exercises for finalist candidates. Our search processes generally take 3 - 4 months.", "responsibilities": "The Senior Campaign Analyst is responsible for designing and leading research, data, and analytic work supporting the Clean Heat initiative. The Senior Campaign Analyst builds and interprets climate and energy models, communicates analysis in technical comments, memos, reports, and visualizations, and leads on data hunting, transformation, and management. Because industrial heat is a new area of advocacy, the Senior Campaign Analyst will often need to create new research methodologies or extrapolate and infer insights from limited or seemingly inapplicable and disjointed data sets. The Senior Campaign Analyst is energized by the challenge of the climate crisis, inspired to step into a new era of the movement, and has a strong track record of working with diverse groups such as organized labor, environmental justice advocates, and policymakers.", "qualifications": {"required": "At least 5-8 years of increasing responsibility in data and analytics, with professional and/or educational experience that demonstrates exceptional qualitative and quantitative analytical skills and modeling. Specifically:\n\n<ul><li>Familiarity with analyzing power system data from the National Renewable Energy Laboratory (NREL), Energy Information Administration (EIA), Environmental Protection Agency (EPA), including electricity demand data, power plant characteristics, transmission line data, renewable energy modeling and credits, and emissions/fuel pricing</li><li>Demonstrated experience with statistical software such as R, Python, SAS, or Stata and visualization software such as GIS, Tableau, Plotly, or other</li><li>Advanced proficiency in MS Office applications, specifically Microsoft Excel</li></ul>\n\nExceptional oral and written communication skills with the ability to break down a complex issue into manageable and clear decision points that drive the desired campaign outcomes.\n\nExcited rather than intimidated by the challenge of what's unknown about this role.", "preferred": "Outstanding project management abilities to ensure strong collaboration of campaigns and projects that advance on time and on budget.\n\nEntrepreneurial drive to build an organization from the ground up; prior start-up experience as an early team member in a growing organization.\n\nExperience in the climate movement or another social justice movement.\n\nExperience using data and analysis in a campaign or advocacy context.\n\nExperience working in California and familiarity with the California advocacy landscape."}, "skills": ["Data Analysis", "Climate Modeling", "Energy Systems Analysis", "Statistical Software", "Visualization Software", "Microsoft Excel", "Project Management", "Campaign Strategy", "Climate Advocacy", "Social Justice Advocacy", "California Advocacy"], "postedDate": "3 months ago", "benefits": "Industrious Labs offers a competitive set of benefits, including 100% comprehensive health care coverage for employees (medical, dental, and vision); a 50% contribution to health care coverage for dependents; work from home stipend; up to 5% employer match to 401k; generous paid parental/family leave; and 11 paid holidays plus unlimited vacation, starting with a minimum of 15 business days.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3929070003"}