{"jobTitle": "WASTEWATER PLANT SUPERVISOR", "company": {"name": "City of Riverside", "industry": "Civil Engineering and Industrial Machinery Manufacturing", "size": "Not specified", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Civil Engineering and Industrial Machinery Manufacturing", "description": "The City of Riverside is accepting applications for the position of WASTEWATER PLANT SUPERVISOR to fill one (1) vacancy in the Wastewater Division of the Public Works Department. The eligibility list established may be used to fill the current and/or upcoming vacancies within this classification for up to six (6) months. The Wastewater Plant Supervisor for the Public Works Department, Regional Water Quality Control Plant will oversee crews and shifts in various disciplines of Wastewater Treatment, including preliminary, primary, secondary biological nutrient removal through conventional activated sludge and membrane bioreactor, conventional tertiary, chlorination/dechlorination, anaerobic mesophilic digestion, organics receiving, biomethane production, solids dewatering and process control of the various treatment unit processes. The ideal candidate will have a Grade V Wastewater Treatment Plant Operator Certification issued by the State of California, experience working with Membrane Bioreactor (MBR), Biological Nutrient Removal Process (BNR), Co-digestion of Organics, Microsoft software applications, Supervisory Control and Data Acquisition System, Process Control Data Base, Computerized Maintenance Management Systems and be able to supervise, motivate, and delegate crews working the various treatment processes. Under general supervision, a Wastewater Plant Supervisor will perform skilled and supervisory work in the operational control of wastewater treatment processes for effective and efficient operations; to insure that the wastewater is processed and discharged according to all health and environmental regulations; and perform related work as required.", "responsibilities": "Supervise and participate in the operation of wastewater treatment facilities to control flow and processing of wastewater, sludge, effluent and support processes; monitor gauges, meters and control panels; observe variations in operating conditions, interpreting meter and gauge readings; and test results to determine processing requirement. Maintain such records as logging operations, test results, maintenance work performed, chemical use and operating conditions. Review and evaluate records for process control. Provide direction and instructions to operations staff to control facility/wastewater processes. Provide assistance with contractor tie-ins or shutdowns. Plan and coordinate start-up of new processes or equipment. Evaluate and review operations of new equipment and processes. Perform frequent inspections of facility equipment/processes and review operating procedures to assure their efficient operation. Participate in the operation of the plant to solve difficult or unusual problems. Read and interpret plant piping and distribution plans; assist in locating and troubleshooting plant malfunctions. Organize, operate and maintain plant record system and computer database. Recommend and initiate improved work methods and procedures. Assist in the training of existing and new employees. Write technical reports and instructions for the operation of process equipment and systems. Wear a self-contained breathing apparatus as required. Research and investigate information for development of process parameters and standard operating procedures. Perform analysis and laboratory tests as necessary to monitor plant and process performance. Evaluate alternate proposals and make sound recommendations. Conduct surveillance of facilities to determine safety, efficiency of operation, cleanliness and maintenance requirements. Ensure that the facility process operations satisfy requirements established by regulatory agencies. Monitor operating efficiency of the wastewater treatment plant; develop and implement methods of improving plant efficiency. Plan, assign, schedule, supervise, motivate and evaluate employees as assigned. Order supplies and materials; prepare cost estimates; develop equipment specifications. Develop and implement goals, objectives, policies and priorities for the Treatment Services Section. Prepare/review regulatory reports. Serve as Acting Wastewater Operations Manager as required.", "qualifications": {"required": "A Bachelor's Degree with a major related to wastewater treatment and which includes a minimum of 30 units of basic science courses; AND two years of experience performing the functions of a wastewater treatment plant operator; OR An Associate's Degree or completion of 60 semester units at a college or university, either of which includes 15 semester units of basic science courses; AND four years of experience performing the functions of a wastewater treatment plant operator; OR Graduation from high school or equivalent AND six years of experience performing the functions of a wastewater treatment plant operator; OR Four years of experience performing the functions of a wastewater treatment plant operator while certified as a Grade III operator; AND Three years of experience in a supervisor/management level position is required.", "preferred": "Possession of an appropriate, valid class 'C' California Motor Vehicle Operator's License. Possession of an active Grade IV Wastewater Treatment Plant Operator certificate issued by the State of California, State Water Resources Control Board (SWRCB). Possession of a Grade V Wastewater Treatment Plant Operator certificate issued by the State of California, State Water Resources Control Board (SWRCB) within 18 months of appointment."}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "Continuous", "benefits": "The City offers an attractive benefits package, including retirement plans, health insurance, dental insurance, vision insurance, life insurance, deferred compensation, leave benefits, flexible spending accounts, long-term disability, and more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3929551912"}