{"jobTitle": "Production Supervisor", "company": {"name": "Regent Aerospace Corporation", "industry": "Airlines and Aviation", "size": "Not specified", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Manufacturing", "industry": "Airlines and Aviation", "description": "MUST HAVE AN A&P\n\nThe following description is not intended as an exhaustive list of all responsibilities.\n\nDuties and skills required of personnel so classified. Management retains the discretion to add to or change the duties of the position at anytime.\n\nSummary\n\nLead the repair of airline seats, monuments assemblies and subassemblies according to specifications and blueprints. Supervises the manufacture and repair, testing and packaging of safety products.\n\nJob Functions\n\n- Leads Regent Safety Solutions assemblers and sewing personnel for the production and repair of products.\n- Schedules, plans and executes new and existing production and repair orders.\n- Leads Aircraft Technicians and oversees repairs and maintenance of airline seats and monuments following manuals, and using hand-tools, power tools, and knowledge of electrical, mechanical and other assembly systems.\n- Reads job orders and observes operation to determine malfunction and to plan work procedures.\n- Examines protective guards, loose bolts, and specified safety devices on seats and monuments, and makes adjustments, using hand-tools.\n- Lubricates moving parts to verify conformance to specifications.\n- May fabricate special attachments, hydraulic systems, shields, or other devices according to blueprints or schematic drawings.\n- Reads inspection reports, rework instructions, and blueprints to determine type of repair, tools required, and to plan sequence of operations.\n- Examines structure to determine location, nature, and extent of defect or damage.\n\nAs Necessary, performs other related duties of which the above are representative.\n\nManagement must contact the Human Resource department of adding to or changing a significant number of duties.\n\nJob Requirements\n\nJustifications for Education and Training, Job Related Experience, and Knowledge/Abilities are general guidelines based on the minimum experience normally considered essential to the satisfactory performance of this job by the average incumbent. Individual abilities may result in some deviation from these guidelines.\n\nMinimum Education And Training\n\n- Experience using hand tools.\n\nMinimum Directly Related Job Experience\n\n- Supervisory experience required.\n- Prior aircraft component maintenance experience required per FAA regulations.\n\nMinimum Knowledge, Abilities, And Skills\n\n- Experience in a repair shop setting.\n- Bilingual, English & Spanish a plus.\n- Computer literate, experience with Microsoft Office, Outlook, Work, Excel.\n- Experience with ERP systems.\n\nPhysical Motion\n\n- Stands/Walks at least 70% of each workday.\n- Other motions: Sitting, repetitive motion hand - wrist; sitting; fingering; grasping.\n- Feeling; hearing; talking; handling; seeing.\n\nDegree Of Physical Activity\n\n- Light work: Exerting up to 20 pounds of force occasionally.\n\nVisual Demands\n\n- Color perception.\n- Depth perception.\n\nMental Processes\n\n- Reason.\n- Following simple directions.\n- Planning.\n- Combining information.\n- Remembering.\n\nWork Environment\n\n- Inside work (Shop environment).\n- Noise.", "responsibilities": "Lead the repair of airline seats, monuments assemblies and subassemblies according to specifications and blueprints. Supervises the manufacture and repair, testing and packaging of safety products.", "qualifications": {"required": "Supervisory experience required. Prior aircraft component maintenance experience required per FAA regulations.", "preferred": "Bilingual, English & Spanish a plus. Computer literate, experience with Microsoft Office, Outlook, Work, Excel. Experience with ERP systems."}, "skills": ["Supervisory skills", "Aircraft component maintenance", "Experience with hand tools", "Knowledge of electrical and mechanical systems", "Bilingual (English & Spanish)", "Computer literacy (Microsoft Office, ERP systems)"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3929253892"}