{"jobTitle": "Manager, Data Science", "company": {"name": "GoodRx", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Hospitals and Health Care", "description": "GoodRx is the leading prescription savings platform in the U.S. Trusted by more than 25 million consumers and 750,000 healthcare professionals annually, GoodRx provides access to savings and affordability options for generic and brand-name medications at more than 70,000 pharmacies nationwide, as well as comprehensive healthcare research and information. Since 2011, GoodRx has helped consumers save nearly $75 billion on the cost of their prescriptions.<br/><br/>Our goal is to help Americans find convenient and affordable healthcare. We offer solutions for consumers, employers, health plans, and anyone else who shares our desire to provide affordable prescriptions to all Americans.<br/><br/><strong>About The Role<br/><br/></strong>GoodRx is looking for a Data Science Manager to join our data team. Our ideal candidate is a team player, a curious, relentless learner whose interest in delivering impact blurs the line between rolling up their own sleeves and coaching others to success. This individual ideally has a deep understanding of mathematics and statistical modeling and leverages that background and empathy from previous professional experience to empower talented individuals to do their best work. This role will bring a player-coach mentality to execution and strike an optimal balance between individual contribution and team collaboration to advanced projects across marketing and product data initiatives.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Collaborate with partners in product and marketing to translate business needs into suitable technical solutions with the appropriate level of detail.</li><li>Provide leadership/mentorship/coaching to individual contributors and support the team through performance management, onboarding, training, and strategic alignment.</li><li>Develop best practices, processes, and documentation to improve data quality, developer experience, quality of life, and team efficiency.</li><li>Build predictive models using statistical and machine learning techniques used for classification and regression. Assess model performance and communicate with stakeholders.</li><li>Derive insights from data to improve our understanding of our customers, their journey, and the effectiveness of product and marketing tactics.<br/><br/></li></ul><strong>Skills &amp; Qualifications<br/><br/></strong><ul><li>5+ years of work experience in data science.</li><li>Undergraduate degree or equivalent experience in a quantitative field; advanced education is a plus.</li><li>Prior experience in delivering impact using statistical analysis, predictive modeling, and machine learning.</li><li>Strong knowledge with databases, such as Redshift, and Python computing stack via cloud platforms such as AWS and Databricks</li><li>Prior experience managing data scientists in a functional or program management role; having comfort with ambiguity, adaptable to a high-change environment, and open to new concepts and processes.</li><li>Prior broad exposure to data-adjacent roles in engineering (data, software, ML) is a plus.</li><li>Experience in healthcare/prescription drug space is a plus.<br/><br/></li></ul>Engineering teams are responsible for supporting appropriate security controls, including management, operational, and technical controls in addition to general GoodRx best practices, such as reading and adhering to the security policies and procedures, being vigilant and observant of potential security threats, etc.<br/><br/>At GoodRx, pay ranges are determined based on work locations and may vary based on where the successful candidate is hired. The pay ranges below are shown as a guideline, and the successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, and other relevant business and organizational factors. These pay zones may be modified in the future. Please contact your recruiter for additional information.<br/><br/><strong>San Francisco And Seattle Offices<br/><br/></strong>$202,000.00 - $323,000.00<br/><br/><strong>New York Office<br/><br/></strong>$185,000.00 - $296,000.00<br/><br/><strong>Santa Monica Office<br/><br/></strong>$168,000.00 - $269,000.00<br/><br/>Other Office Locations:<br/><br/>$151,000.00 - $242,000.00<br/><br/>GoodRx also offers additional compensation programs such as annual cash bonuses and annual equity grants for most positions as well as generous benefits. Our great benefits offerings include medical, dental, and vision insurance, 401(k) with a company match, an ESPP, unlimited vacation, 13 paid holidays, and 72 hours of sick leave. GoodRx also offers additional benefits like mental wellness and financial wellness programs, fertility benefits, generous parental leave, pet insurance, supplemental life insurance for you and your dependents, company-paid short-term and long-term disability, and more!<br/><br/>We’re committed to growing and empowering a more inclusive community within our company and industry. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has a seat at the table and the tools, resources, and opportunities to excel.<br/><br/>With that said, research shows that women and other underrepresented groups apply only if they meet 100% of the criteria. GoodRx is committed to leveling the playing field, and we encourage women, people of color, those in the LGBTQ+ communities, individuals with disabilities, and Veterans to apply for positions even if they don’t necessarily check every box outlined in the job description. Please still get in touch - we’d love to connect and see if you could be good for the role!<br/><br/>GoodRx is committed to providing reasonable accommodations for candidates with disabilities during our recruiting process. If you need any assistance or accommodations due to a disability, please reach out to us at accommodations@goodrx.com.<br/><br/>GoodRx is America's healthcare marketplace. The company offers the most comprehensive and accurate resource for affordable prescription medications in the U.S., gathering pricing information from thousands of pharmacies coast to coast, as well as a tele-health marketplace for online doctor visits and lab tests. Since 2011, Americans with and without health insurance have saved $60 billion using GoodRx and million consumers visit goodrx.com each month to find discounts and information related to their healthcare. GoodRx is the #1 most downloaded medical app on the iOS and Android app stores. For more information, visit www.goodrx.com.", "responsibilities": "<ul><li>Collaborate with partners in product and marketing to translate business needs into suitable technical solutions with the appropriate level of detail.</li><li>Provide leadership/mentorship/coaching to individual contributors and support the team through performance management, onboarding, training, and strategic alignment.</li><li>Develop best practices, processes, and documentation to improve data quality, developer experience, quality of life, and team efficiency.</li><li>Build predictive models using statistical and machine learning techniques used for classification and regression. Assess model performance and communicate with stakeholders.</li><li>Derive insights from data to improve our understanding of our customers, their journey, and the effectiveness of product and marketing tactics.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of work experience in data science.\nUndergraduate degree or equivalent experience in a quantitative field; advanced education is a plus.\nPrior experience in delivering impact using statistical analysis, predictive modeling, and machine learning.\nStrong knowledge with databases, such as Redshift, and Python computing stack via cloud platforms such as AWS and Databricks\nPrior experience managing data scientists in a functional or program management role; having comfort with ambiguity, adaptable to a high-change environment, and open to new concepts and processes.\nPrior broad exposure to data-adjacent roles in engineering (data, software, ML) is a plus.\nExperience in healthcare/prescription drug space is a plus.<br/><br/>", "preferred": ""}, "skills": ["Data Science", "Statistical Analysis", "Predictive Modeling", "Machine Learning", "Redshift", "Python", "AWS", "Databricks", "Data Management", "Leadership", "Mentorship", "Coaching", "Performance Management", "Onboarding", "Training", "Strategic Alignment", "Process Improvement", "Data Quality", "Developer Experience", "Team Efficiency", "Healthcare", "Prescription Drugs"], "postedDate": "1 week ago", "benefits": "GoodRx also offers additional compensation programs such as annual cash bonuses and annual equity grants for most positions as well as generous benefits. Our great benefits offerings include medical, dental, and vision insurance, 401(k) with a company match, an ESPP, unlimited vacation, 13 paid holidays, and 72 hours of sick leave. GoodRx also offers additional benefits like mental wellness and financial wellness programs, fertility benefits, generous parental leave, pet insurance, supplemental life insurance for you and your dependents, company-paid short-term and long-term disability, and more!", "remoteWork": "No", "salary": {"amount": "168,000.00 - 269,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3930848025"}