{"jobTitle": "Executive Assistant to CEO", "company": {"name": "StaffingForce", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "This opportunity provides a bird's eye view of the company and all its inner workings. This role is for someone who is looking for an autonomous role that is comprised of support at the highest level of an organization.<br/><br/><strong>The role:<br/><br/></strong>Handling comprehensive electronic calendaring and heavy travel arranging (international and domestic) that generally means multi-leg/city trips, limo/car service, and hotel accommodations. Travel arranging experience that includes private jets would be a plus.<br/><br/><ul><li> Experience working for at least 10 years providing executive/personal administrative services to a C-Suite executive (ideally CEO/Founder level). A degree is required. </li><li> The Executive Personal Assistant will support the Founder in all aspects of travel arrangements,<br/><br/></li></ul>calendar management, meeting coordination, and general administrative tasks. This role is ideal for someone whose background demonstrates strong communication/presentation abilities, excellent time management skills, and the ability and history of working for a highest-level executive.<br/><br/>The organization and its leaders boast a reputation and a culture worthy of hiring the absolute best professionals in their respective disciplines. This is a multifaceted role for some who wants a position that runs the full gamut when it comes to function and role within an organization.<br/><br/><strong>Compensation:<br/><br/></strong>Compensation will align with expertise and background. The position is bonus-eligible and is competitive for the Personal Assistant who is that dynamic and poised professional they seek.<br/><br/><strong>Company Description<br/><br/></strong>Founded by veterans of the staffing industry, StaffingForce is a recognized leader in the staffing industry, serving customers ranging from the Fortune 500 to medium-sized businesses and entrepreneurial start-ups.<br/><br/>We provide full-time and temporary specialized staffing services regardless of occupation, industry, or location.<br/><br/>Founded by veterans of the staffing industry, StaffingForce is a recognized leader in the staffing industry, serving customers ranging from the Fortune 500 to medium-sized businesses and entrepreneurial start-ups. We provide full-time and temporary specialized staffing services regardless of occupation, industry, or location.", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3930822090"}