{"jobTitle": "Guest Relations Representative", "company": {"name": "Audi Beverly Hills", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$18 - $20 / hour", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "Your next opportunity awaits at Audi Beverly Hills. We are hiring a Guest Relations Representative to join the team.<br/><br/>The Guest Relations Representative is responsible for providing excellent customer to all guests while they are in the service area. This is a great opportunity for someone with the desire to learn and develop – there are many options for growth within the Service and Parts Department!<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Ensure all guests are provided a warm greeting in a timely manner and all guest areas are clean and presentable.</li><li>Prepare and provide refreshments for guests and ensure all supplies are stocked and presentable.</li><li>Ensure vehicle is being loaned in condition consistent with Fletcher Jones brand expectations including properly filled with fluids and fuel.</li><li>Maintain inventory status of loaner fleet and report any damages to Management.</li><li>Receive cash, check and credit card payments from customers and record the amount received.</li><li>Maintain appropriate levels of customer service and client retention by resolving customer complaints or concerns immediately and appropriately; assume ownership of the customer's experience by carrying out those additional assignments that allow the dealership to leave a positive impression with the customer.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>Fantastic communication skills with customers</li><li>Valid in-state driver's license and clean driving record<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health insurance</li><li>Dental insurance</li><li>Vision insurance</li><li>Paid time off</li><li>401(k)</li><li>401(k) matching</li><li>Flexible spending account</li><li>Professional development assistance</li><li>Life insurance</li><li>Employee assistance plan</li><li>Disability insurance<br/><br/></li></ul><strong>Pay: </strong>$18 - $20 / hour<br/><br/>At Audi Beverly Hills, we attract, nurture, and retain the most talented people in the industry by providing the highest quality work environment where productivity, creativity, and personal and professional growth can flourish. We believe our team sits behind the wheel of the Fletcher Jones brand that drives our company toward success.<br/><br/><em>We are an Equal Opportunity Employer<br/><br/></em>Privacy Policy", "postedDate": "3 months ago", "benefits": "Health insurance, Dental insurance, Vision insurance, Paid time off, 401(k), 401(k) matching, Flexible spending account, Professional development assistance, Life insurance, Employee assistance plan, Disability insurance", "skills": [], "url": "https://www.linkedin.com/jobs/view/3930991513"}