{"jobTitle": "Accounting Clerk", "company": {"name": "School Gig", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Education Administration Programs", "description": "We are looking for a skilled Accounting Clerk to perform a variety of accounting, bookkeeping and financial tasks. Accounting Clerk responsibilities include keeping financial records updated, preparing reports and reconciling bank statements. You will also run accounting software programs (e.g. SAP) to process business transactions, like accounts payable and receivable, disbursements, expense vouchers and receipts. A successful accounting assistant should be familiar with all accounting procedures and have a flair for numbers. Ultimately, a successful Accounting Clerk will ensure that the company’s daily accounting functions run accurately and effectively.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provide accounting and clerical support to the accounting department</li><li>Type accurately, prepare and maintain accounting documents and records</li><li>Prepare bank deposits, general ledger postings and statements</li><li>Reconcile accounts in a timely manner</li><li>Daily enter key data of financial transactions in the database</li><li>Provide assistance and support to company personnel</li><li>Research, track and restore accounting or documentation problems and discrepancies</li><li>Inform management and compile reports/summaries on activity areas</li><li>Function in accordance with established standards, procedures and applicable laws</li><li>Constantly update job knowledge<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Proven accounting experience, preferably as an Accounts receivable clerk or Accounts payable clerk</li><li>Familiarity with bookkeeping and basic accounting procedures</li><li>Competency in MS Office, databases and accounting software</li><li>Hands-on experience with spreadsheets and financial reports</li><li>Accuracy and attention to detail</li><li>Aptitude for numbers</li><li>Ability to perform filing and record keeping tasks</li><li>Data entry and word processing skills</li><li>Well organized</li><li>High school degree</li><li>Associate’s degree or relevant certification is a plus</li></ul>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3930707304"}