{"jobTitle": "HR Assistant", "company": {"name": "MashPoint - Technology & Staffing- merged with HuMetis group Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "<strong>Position : HR Assistant<br/><br/></strong><strong>Location : North Hollywood, CA 91605<br/><br/></strong><strong>Duration : 6 Months +<br/><br/></strong>The Human Resources Assistant will directly assist the Human Resources team with a wide variety of projects related to HR compliance, recruiting, onboarding/orientation, employee benefits and other HR tasks. This position is designed to be both educational and practical while providing hands on exposure to business operations. The areas of focus will be a wide scope of practical Human Resource practices<br/><br/>Job Duty<br/><br/><ul><li> Coordinating pre-employment background and drug screens for new hires</li><li> Preparing materials for new hire orientation and on-boarding of new hires</li><li> Supporting special projects related to compliance, employee engagement and process improvements</li><li> Assist with recruiting, scheduling interviews</li><li> Filing</li><li> Facilitating and tracking mandatory trainings<br/><br/></li></ul>Skills, Knowledge and Abilities List (Select all that applies and copy and paste above)<br/><br/><ul><li> Be committed to team excellence</li><li> Excellent internal and external customer service skills</li><li> Strong attention to detail, good organizational skills and the ability to prioritize with changing situations</li><li> Ability to maintain confidential and sensitive information</li><li> Good interpersonal, verbal and written communication skills</li><li> Strong knowledge of Microsoft Work, Excel and PowerPoint and other computer applications<br/><br/></li></ul>Environmental &amp; Physical Requirements<br/><br/>Office / Sedentary Requirements<br/><br/>Incumbent must be able to perform the essential functions of the job. Work is performed primarily in an office environment. Typically requires the ability to sit for extended periods of time (66%+ each day), ability to hear the telephone, ability to enter data on a computer and may also require the ability to lift up to 10 pounds.<br/><br/>Manufacturing / Non-Sedentary Requirements<br/><br/>Incumbent must be able to perform the essential functions of the job. Work may be performed in an office or warehouse environment. Typically requires the ability to spend 66%+ hours each work day doing the following activities: stand for extended periods of time, walk, bend, stoop, or climb. May have possible exposure to dust, and may require the ability to lift and/or push up to 50 pounds 33% - 66% of the time.", "postedDate": "3 months ago", "skills": ["Microsoft Work", "Excel", "PowerPoint", "Customer Service", "Communication", "Organization", "Prioritization", "Teamwork", "Compliance", "Recruiting", "Onboarding", "Benefits", "HR", "Filing", "Training"], "url": "https://www.linkedin.com/jobs/view/3931423012"}