{"jobTitle": "TikTok Content Creator", "company": {"name": "forhyre.com", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Business Consulting and Services", "description": "Gobook.me is an online scheduling app that works for many industries, especially for those who run service-based businesses. It enables clients to book appointments via a booking page, set appointments by providers, block time on calendar and accept payments. It offers advanced features such as email and SMS customization, resource management and gift certificate creation.<br/><br/>GOBook.me is looking for a brilliant TikTok content creator who can make their brand's TikTok account impactful, educational, and extremely viral content that will help spread awareness to even more people.<br/><br/>You will help us reach our target audience by delivering both useful and appealing Tiktok content about our company and products.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>Enthusiastic TikTok’er who gets a thrill from creating engaging viral videos (for yourself or a brand)</li><li>Proven track record of identifying and leveraging what makes TikTok, well, tick: trends, hashtags, music usage, functionalities, best practices, and platform updates</li><li>Experienced in following brand and/or messaging guidelines</li><li>Comfortable being in front of the camera and possess excellent verbal and written skills</li><li>Results driven with an openness to receiving feedback</li><li>Independent but reliable when it comes to delivering assets</li><li>Passionate about abortion access and reproductive care Bonus: If you’re a parent or have experience in reproductive healthcare<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>Use your creativity to ideate and develop new, highly engaging content about abortion, reproductive care, and more in order to help grow our TikTok audience</li><li>Film all original video assets and handle editing (mobile device and within the TikTok app is fine)</li><li>Work with our marketing team to ensure that content is aligned with brand messaging, identity, and aesthetics</li><li>Keep up with the latest social media trends (including news, memes, celebrities, music, etc.) and find brand-right ways to incorporate them into your content</li><li>Hit weekly content and posting goals</li><li>Be a thoughtful voice around abortion and reproductive care during this pivotal moment</li></ul>", "postedDate": "3 months ago", "skills": ["TikTok", "Content Creation", "Social Media", "Video Editing", "Marketing", "Brand Management", "Communication", "Creative", "Viral Content"], "url": "https://www.linkedin.com/jobs/view/3931713610"}