{"jobTitle": "Paid Media Manager", "company": {"name": "Single Grain | Start Growing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000 - $85,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<em>Include the words \"Paid Media is cool\" in the first sentence of your cover letter (or your application will be disqualified).<br/><br/></em><strong>Who We Are:<br/><br/></strong>Single Grain is an award-winning digital marketing agency that has been dedicated to driving persistent growth for remarkable companies like Amazon, Uber, and Salesforce since 2009.<br/><br/>We do this by providing industry-leading services around Paid Media, SEO, Content Marketing, CRO, and more.<br/><br/>We are a team of digital marketers. We love what we do, and we help pioneers grow by empowering our clients with winning strategies that lead to faster growth. As a top digital marketing agency, we understand how fast-paced the marketing industry is. We pride ourselves on staying up to date with new algorithms, technology, and trends because that's what keeps us one step ahead of the competition.<br/><br/>As a testament to our digital marketing expertise, we have a Digital Marketing blog with over 200,000 visitors/month, a podcast called ‘Marketing School' with over 2 million downloads/month, and a YouTube channel with more than 100,000 subscribers.<br/><br/>It's our mission to level up every human by educating and moving the digital industry forward. Our goal is to help you level up and succeed. We accomplish this through mentoring or training but also by providing great resources and tools.<br/><br/>Check out our website for more on our company culture and values.<br/><br/><strong>About The Role<br/><br/></strong>We're looking for a humble, hungry, and smart Paid Media Manager to join our team. In this role, you will be responsible for end-to-end management of multiple client accounts, driving performance through strategic campaign optimization while building strong client relationships. You will work across a variety of B2B and B2C industries and platforms, including but not limited to Google, Bing, Meta, and LinkedIn.<br/><br/><strong>Successful employees at this level:<br/><br/></strong><ul><li>Can both execute tasks assigned to them and understand the \"why\" behind them. </li><li>Have a basic grasp of how their work fits into the broader picture, but aren't yet responsible for shaping cross-departmental strategies. </li><li>Are proficient in day-to-day communication tasks, but will have plenty of oversight and support as they grow their knowledge base and learn to adapt communication styles. <br/><br/><br/></li></ul><strong>Responsibilities include:<br/><br/></strong><ul><li>Successfully managing 4 to 6 paid media client accounts and communicating effectively with the client point of contact </li><li>Ideating, managing, and optimizing paid media strategies that are rooted in your clients core business goals. This includes:</li><ul><li>Developing effective audience targeting strategies within platform limitations, seeking opportunities to creatively reach the target audience </li><li>Strategically managing client budgets </li><li>Showcasing a deep understanding of your client's business positioning, and providing creative recommendations that are in-line with industry best practices and the competition</li><li>Expanding to new, innovative platforms when relevant</li></ul><li>Maintaining, troubleshooting, and analyzing data insights (ROI, ROAS, CPA, CTR, conversion volume, etc.) and building insightful, compelling reports with key actionable insights to clients</li><li>Monitoring the latest trends and changes in social media and the digital industry</li><li>Proactively seeking frameworks and tools to increase efficiency in your work<br/><br/></li></ul><strong>Your primary KPIs wil be:<br/><br/></strong><ul><li>Client NPS and innovation scores, collected quarterly</li><li>Maintaining profitability of managed accounts</li><li>Client retention and growth within your assigned portfolio <br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>About You<br/><br/></strong><strong>Technical Requirements<br/><br/></strong><ul><li>Proficient in Microsoft Office (Excel, PowerPoint) and Google Workspace Products</li><li>3+ years of campaign management experience, with strategic expertise on multiple advertising platforms (e.g., Google, Facebook, Bing, Twitter, Pinterest, Amazon, etc.)</li><li>Experience directly managing monthly budgets of $50K+</li><li>Experience with Google Analytics and Tag Manager, ability to flag issues/error and help troubleshoot </li><li>Familiarity with project management tools like Asana and Basecamp</li><li>Google Ads and Facebook Blueprint certifications a plus</li><li>Experience with Google Merchant center and/or feed management platforms is a plus <br/><br/><br/></li></ul><strong>Personal Qualities<br/><br/></strong><ul><li>Passionate about digital marketing</li><li>Analytical thinking skills</li><li>Excellent verbal and written communication skills</li><li>Excellent organization skills and an ability to handle multiple tasks</li><li>Strong attention to detail</li><li>Eagerness, can-do attitude</li><li>A team player who takes initiative to assist others with their work</li><li>Focused on constant self-improvement and learning</li><li>Enjoys being challenged at work, eager for feedback</li><li>Comfortable adapting to changing circumstances <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Salary: <br/><br/></strong>$70,000 - $85,000<br/><br/><strong>Our Benefits<br/><br/></strong><ul><li>Medical, Dental, and Vision Insurance</li><li>Flexible PTO</li><li>Home Office Stipend</li><li>MacBook Provided</li><li>100% Remote</li></ul>", "responsibilities": "Successfully managing 4 to 6 paid media client accounts and communicating effectively with the client point of contact Ideating, managing, and optimizing paid media strategies that are rooted in your clients core business goals. This includes: Developing effective audience targeting strategies within platform limitations, seeking opportunities to creatively reach the target audience Strategically managing client budgets Showcasing a deep understanding of your client's business positioning, and providing creative recommendations that are in-line with industry best practices and the competition Expanding to new, innovative platforms when relevant Maintaining, troubleshooting, and analyzing data insights (ROI, ROAS, CPA, CTR, conversion volume, etc.) and building insightful, compelling reports with key actionable insights to clients Monitoring the latest trends and changes in social media and the digital industry Proactively seeking frameworks and tools to increase efficiency in your work", "qualifications": {"required": "Proficient in Microsoft Office (Excel, PowerPoint) and Google Workspace Products 3+ years of campaign management experience, with strategic expertise on multiple advertising platforms (e.g., Google, Facebook, Bing, Twitter, Pinterest, Amazon, etc.) Experience directly managing monthly budgets of $50K+ Experience with Google Analytics and Tag Manager, ability to flag issues/error and help troubleshoot Familiarity with project management tools like Asana and Basecamp Passionate about digital marketing Analytical thinking skills Excellent verbal and written communication skills Excellent organization skills and an ability to handle multiple tasks Strong attention to detail Eagerness, can-do attitude A team player who takes initiative to assist others with their work Focused on constant self-improvement and learning Enjoys being challenged at work, eager for feedback Comfortable adapting to changing circumstances ", "preferred": "Google Ads and Facebook Blueprint certifications a plus Experience with Google Merchant center and/or feed management platforms is a plus"}, "skills": ["Microsoft Office", "Google Workspace", "Google Ads", "Facebook", "Bing", "Twitter", "Pinterest", "Amazon", "Google Analytics", "Tag Manager", "Asana", "Basecamp", "Google Merchant Center", "Digital Marketing", "Analytical Thinking", "Communication", "Organization", "Teamwork", "Self-Improvement", "Adaptability"], "postedDate": "3 months ago", "benefits": "Medical, Dental, and Vision Insurance Flexible PTO Home Office Stipend MacBook Provided 100% Remote", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3931989839"}