{"jobTitle": "Esports Production Manager III - Logistics & Travel", "company": {"name": "Riot Games", "industry": "Computer Games, Software Development, and Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$129,200.00/yr - $179,700.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Computer Games, Software Development, and Technology, Information and Internet", "description": "The Esports team is focused on delivering amazing fan experiences through our global events and regional competitions. Our professional and semi-professional competitive tiers in League of Legends, VALORANT and other Esports involve thousands of players and hundreds of organizations competing every week. The Event Manager will report to the Head of Logistics Dept and is accountable for all show logistics: all tasks related to travel, hotels, transportation, staffing list, visa & immigration, catering, health & safety, and all fan-facing aspects of the assigned events. They will align with the Head of Logistics Dept & Line Producer to own specific line items of the budget, and will be expected to autonomously make decisions around how to spend it. They will need to be able to autonomously balance the needs of Rioters, vendors, pros, and VIPs while keeping Riot relationships in mind, and generally be able to think of ways to refine our processes to make them more resource efficient. They will manage an event coordinator, vendors, and regional resources to both deliver and innovate our process on Riot Esports road shows.", "responsibilities": "Design VISA strategy for Riot Esports. Collaborate with Riot Mobility to design and implement an autonomous system for esports VISA needs, including hiring contingent workforce team, team management, vendor sourcing and management. Collaborate with Riot Mobility to design and implement a new and improved autonomous system for esports VISA needs, including hiring contingent workforce team, team management, vendor sourcing and management. Managing budgets in the 6 figure range. Should be able to make autonomous calls for their line items. Responsible for tracking costs for their budget against overall event P&L. Will work with Head of Logistics Dept and have collaborative decision-making in securing hotel deals, setting and enforcing the travel policies. Plans for events by sourcing vendors and reviewing existing vendors and contracts. Work with Sr Event Manager on which vendors we use to fulfill logistical needs, related to hotels, flights, VISAs, transportation, F&B and facilitate the vendor contracting process through Riot channels and Production Finance RFP process. Managing contingent workforce and overseeing craft development for the logistics department cross product. Supervise event production/logistics coordinators, (contractors) hired during event spikes -- office work leading up to the event. On-site supervision of full-time & contracted coordinators and vendor staff to solve for needs for staff, crew, contractors, pro players and VIP’s. Collaborate with event producers in understanding the ticketing plan and executing the needs of FOH audience flows in relation to the plan. Have clarity around the hosting country/cities rules and regulations for ticket creation and distribution. Location assessments when determining future events as it relates to VISAs, geopolitical stability, health and safety. Collaborate with Riot Travel for hotel contracts, surveys, procurement and execution. Works on all FOH (Front of House) facing parts of the assigned events. Merchandise, audience load-in, audience load-out, line management, some activations (indoor and out), concessions, facilities, etc. Supervise on-site relevant vendor contractors during on-site event, prep and up to actual event days: security, ushers, caterers. Emergency Management Response: Prepare contingency plans in emergency show situations and the resolution of on-site issues by working with the appropriate parties to facilitate a resolution. Future planning: Proactively research and procure deals that reduce costs of event logistics holistically, working with the Riot travel team and production partners. Post event budget actualization with the Line Producer with detailed accuracy of reporting, including but not limited to hotel, airfare, food and beverage and relevant travel costs. Primary health and safety liaison for the event, both developing and executing health and safety protocols for the event as they apply to each city we operate in. This includes medical response and planning. Creating new processes and innovating processes to help Riot achieve future production model(s). 25-40% travel to support global events.", "qualifications": {"required": "Live event experience supervising multiple teams in multiple roles (talent, ushers, security, swag). Communication skills between multiple team members around the world is a key component of this job. Must be clear and concise. Some delegations will also benefit from a clear communicator. Attention to detail, cost tracking and budget consciousness are a must. 7+ years work experience as a leader in event logistics/event management. 10+ years working on events. Experience creating tools, developing timelines. Creating and innovating processes for improvement.", "preferred": "Experience with budget management tools. Experience building templates in excel, google sheets, or airtable/smartsheets/similar. Experience with airtable."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Riot has a focus on work/life balance, shown by our open paid time off policy, in addition to other perks such as flexible work schedules. We offer medical, dental, and life insurance, parental leave for you, your spouse/domestic partner and children, and a 401k with company match. Check out our benefits pages for more information.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3931038626"}