{"jobTitle": "Senior Director, Supply Chain Planning,", "company": {"name": "Neogene Therapeutics", "industry": "Biotechnology Research", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$165,000.00 - $206,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Biotechnology Research", "description": "At AstraZeneca's Oncology R&D division, we follow the science to explore and innovate. We are working towards treating, preventing, modifying, and even curing some of the world's most complex diseases. Here we have the potential to grow our pipeline and positively impact the lives of billions of patients around the world. We are committed to making a difference and have built our business around our passion for science. Now we are fusing data and technology with the latest scientific innovations to achieve the next wave of breakthroughs. Position Summary We are looking for a strategic Senior Director of Supply Chain Planning to lead our supply chain planning function at Neogene. The Senior Director will develop comprehensive supply chain strategies to deliver cell therapy products from manufacturing through distribution. We are looking for a background in supply chain management, sales and operations planning (S&OP), capacity planning, network planning, material requirements planning, inventory optimization, and budget management. You will report to the VP, Supply Chain and could be located in Gaithersburg, MD, New York City, NY, Waltham, MA, South San Francisco, CA, or Santa Monica, CA", "responsibilities": "Develop and implement supply chain strategies aligned with organizational goals, ensuring the efficient and reliable delivery of cell therapy products to meet patient needs. Lead global sales and operations planning process across cell therapy portfolio and manufacturing network to review demand, capacity, and drug substance and raw material inventory plans to make aligned trade-off decisions that fulfill our goals. Collaborate with Manufacturing and Operations teams to develop capacity plans that improve resource utilization, service levels, and throughput while maintaining product quality and compliance. Oversee material requirements planning and inventory management for shared direct materials and gene editing drug substances across the manufacturing network. Manage materials constraints and risks. Define inventory policy across manufacturing network. Implement inventory management best practices to minimize excess and obsolete inventory while ensuring raw material availability to meet demand and regulatory requirements. Oversee end-to-end supply planning and synchronize activities across the supply chain. Support change management planning for product lifecycle changes, new product introduction, geographic expansion, new clinical trial etc. Enhance supply chain efficiency and resilience, implementing best practices, process improvements, and technology solutions. Build and lead a supply chain planning team, providing mentorship, guidance, and professional development opportunities to foster individual growth and collective success. Support overall leadership and change management of a growing supply chain organization.", "qualifications": {"required": "Expertise in developing supply chain strategies that improve capacity, inventory levels, production efficiency, and customer service levels. Certification in APICS or equivalent. Knowledge of autologous cell therapy supply chain, including Make To Order and Make to Stock planning, cell therapy capacity planning, CDMO constraints, raw materials and supplier knowledge, Chain of Identity/ Chain of Custody, cold chain logistics. Analytical, with the ability to translate data into relevant recommendations. Experience leading teams. Proficiency in supply chain planning systems, such as ERP systems, demand planning tools, and inventory optimization software.", "preferred": "At least fourteen (14) years with BS/BA, or at least twelve (12) years with MS/MA or MBA, or at least ten (10) years with PhD. Degree in Supply Chain Management, Operations Management, Engineering, Sciences, Business Administration, or a related field; advanced degree preferred. At least 10 years of experience in supply chain planning, demand forecasting, inventory management, and production planning, preferably in the pharmaceutical or biotechnology industry, with specific experience in cell therapy."}, "skills": ["Supply Chain Management", "Sales and Operations Planning (S&OP)", "Capacity Planning", "Network Planning", "Material Requirements Planning", "Inventory Optimization", "Budget Management"], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Short-term incentive bonus opportunity, Equity-based long-term incentive program, 401(k) plan, Paid vacation and holidays; paid leaves, Health benefits including medical, prescription drug, dental, and vision coverage.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3931403797"}