{"jobTitle": "Assistant Project Manager", "company": {"name": "Hill Construction Company", "industry": "Construction", "size": "51-200 employees", "location": "Malibu, CA"}, "location": "Malibu, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Construction", "description": "ASSISTANT PROJECT MANAGER (APM)\n\nMalibu, CA\n\nAssistant Project Managers (APM) assist the Project Manager and Project Superintendent in bidding, tracking down subcontractor releases, project billings, helping with RFIs, project scheduling and other administrative management. APMs communicate with project owners, architects, subcontractors and office. If you are looking for an exciting opportunity to work on the top residential construction projects being built on the West Coast, you may qualify for a rewarding career at Hill Construction Company. We are currently looking to add an Assistant Project Manager to our dynamic Malibu team.\n\nHill Construction Company sets the standard in luxury homebuilding, combining highly skilled craftsmanship with progressive technical expertise. With jaw-dropping projects being built in San Diego, Los Angeles, Orange County, Las Vegas, and Palm Desert, we collaborate with the area’s most elite and celebrated architects and designers. Our homes are consistently showcased in national and regional magazines including dwell, luxe, Interiors, California Homes, and more. Continual advancement, uncompromised quality, and passion for excellence have led Hill Construction to win numerous industry awards and accolades. Please learn more about us by visiting www.hillconstructioncompany.com and exploring our Instagram.\n\nBenefits\n\nFull-time employee benefits include health, dental, and vision insurance, Paid Time Off, 401k retirement plan with employer matching, cell phone reimbursement, fuel reimbursement, and a potential year-end bonus.\n\nWe pride ourselves on our company culture – one in which every employee has the opportunity to collaborate, contribute, and help shape the future of our growing corporation.\n\nOverview\n\nAs an industry leader, Hill Construction excels in making the most technical projects look effortless and turning a dream into a home. In order to continue growing and servicing our clients, our Malibu team is looking to add a qualified and enthusiastic full-time Assistant Project Manager (APM). The APM is a critical component of our winning team structure working alongside Project Managers and Superintendents on various custom construction projects. APMs are responsible for the management of project documentation and helping ensure quality and contractual risk management throughout the project life cycle.", "responsibilities": "Hill Construction Project Managers and Assistant Project Managers team up, alongside the Superintendent, to manage all areas of the construction process.\n\nDay-to-day Responsibilities Of The APM Include:\n- Bidding / Estimating\n- Budgeting\n- RFI Management\n- Subcontract Management\n- Purchase Order Management\n- Shop Drawing Management\n- Change Order Management\n- Project Billing Review/Approval\n- Risk Management and Forecasting\n- Submittal and Procurement Management", "qualifications": {"required": "Bachelor’s Degree (Construction Management, Engineering, or related field). 1-2 years minimum direct experience with project schedules, RFIs, estimates, budgets, and contracts. Ability to read/bid construction plans. Comprehensive knowledge of subcontractor scopes. Ability to clearly and effectively communicate with project owners, architects, and our office team. Computer proficiency (Microsoft Office, Management Software). P6/On-Center/Revit/Bluebeam/MS Project experience a plus. Sage/Timberline experience a plus. Willingness to regularly visit and walk job sites as well as work in the office. Candidate must possess Hill Construction’s core values: passion, integrity, hard work, and professionalism. Ability to sit and/or stand for extended periods, walk job sites with ease, and bend/stoop as needed. Ability to lift or maneuver boxes without accommodation.", "preferred": ""}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "Not specified", "benefits": "Full-time employee benefits include health, dental, and vision insurance, Paid Time Off, 401k retirement plan with employer matching, cell phone reimbursement, fuel reimbursement, and a potential year-end bonus.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3931896123"}