{"jobTitle": "Branch Manager", "company": {"name": "Daikin Comfort", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Industrial Machinery Manufacturing", "description": "May include;<br/><br/><ul><li> Manage and oversee the day-to-day operations of the branch including staffing and ensure successful and timely completion of assigned duties of all personnel. Review and approve hours worked and PTO using Kronos. Conduct periodic audits to ensure work is compliant with the established protocols and processes and objectives - meeting customer and branch expectations.</li><li> Maintain sales – review/edit, credits, negative inventory, damage inventory and cash reconciliations. Communicate regularly with branch customer base to establish and maintain strong relationships. Enter all sales calls in CRM.</li><li> Responsible for building and maintaining morale in the branch by demonstrating leadership qualities and setting an example for staff, promoting teamwork both within the branch, local team and within the region. Provide knowledge and skill development opportunities for employees with proper training and guidance for them to reach their full potential and have growth opportunities. Ensure employees complete all assigned training in a timely manner.</li><li> Effectively coach, counsel, and hold employees accountable. Collaborate with Human Resources regarding disciplinary actions.</li><li> Develop plans for increased branch profitability/productivity and drive continuous improvement processes.</li><li> Process purchase orders, research low stock and receivables and process branch payables, audit cash drawers and truck metrics. Remain current with warranty processing, and follow up quickly on rejections.</li><li> Oversee all aspects of profit center (operations, sales, admin, etc.) working closely with Credit Department at Corporate to determine appropriate credit level and resolve any credit issues.</li><li> Stay current with cycle counts and keep dead stock at a minimum.</li><li> Maintain ample levels of inventory to meet delivery and service expectations of all branch customers.</li><li> Review P&amp;L; hold safety meetings, security reports and maintain facility.</li><li> Complete all tasks on the Branch Manager's monthly/daily checklist and act as a safety leader. Conduct weekly safety committee meetings. Complete any Flash reports within the required timeline and communicate issues/injuries immediately.</li><li> Oversee branch and warehouse appearance, housekeeping, maintenance, and repair.</li><li> Provide Regional Operations Manager (ROM) any requested branch specific information /reports and provide vital information in a timely manner.</li><li> Maintain a 93%, or higher, audit score</li><li> Maintain a working knowledge of company’s benefits and employee handbook policies. Ensure employees are following safety protocols including maintaining an organized and clean work environment,</li><li> Conduct mid-year and annual performance appraisals for all direct reports through the online Performance Engagement platform.</li><li> May work outside regular working hours in case of emergencies within the branch as required.</li><li> Participate in additional activities as requested.<br/><br/></li></ul>Pay Range<br/><br/><ul><li> $66,560 - $83,575<br/><br/></li></ul><em>The Company provides equal employment opportunity to all employees and applicants regardless of a person’s race, color, religion (including religious dress or grooming practices), creed, national origin (including language use restrictions), citizenship, uniform service member or veteran status, ancestry, disability, physical or mental disability (including HIV/AIDS), medical condition (including cancer and genetic characteristics), genetic information, request for protected leave, marital status, sex, pregnancy, age (over 40), sexual orientation, gender, gender identity or expression, political affiliation, or any other characteristic protected by law. The Company will comply with all federal and state regulations and statutes pertaining to individuals with disabilities.</em>", "postedDate": "1 week ago", "salary": {"amount": "66,560.00 - 83,575.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3931078590"}