{"jobTitle": "GUEST SERVICE SUPERVISOR - HAMPTON INN BY HILTON CYPRESS", "company": {"name": "Dimension Hospitality", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Hospitality", "description": "<strong>Description<br/><br/></strong><strong>Reports To: </strong>Front Office Manager/ AGM/ Guest Services Manager<br/><br/><strong>Supervises:</strong> Guest Services Representatives<br/><br/><strong>Job Purpose:</strong> To perform in a pleasant, professional and efficient manner, a combination of duties mainly related, but not limited, to check-in and check-out of guests which contributes to an overall positive experience.<br/><br/><strong>Job Responsibilities<br/><br/></strong><ul><li>Greet, register, and assign rooms to guests. Issue room key and escort instructions to Bell person or directly to guest as appropriate, without announcing room numbers.</li><li>Answer inquiries pertaining to hotel services, registration of guests and shopping, dining, entertainment and travel directions.</li><li>Keep records of room availability and guests’ accounts. May make, confirm and cancel reservations for guests.</li><li>Compute bill, collects payment and makes change for guests. May post charges such as room, food, liquor or telephone by hand or machine.</li><li>Date-stamp, sort and rack incoming mail and messages. Transmit and receive messages using equipment such as telephone, fax and switchboard.</li><li>Understand and enforce the hotel company credit policies. Account for all cash and makes deposits in accordance with hotel and company policies.</li><li>Take the initiative to greet guests in a friendly and warm manner.</li><li>Take responsibility for assigned employees in the absence of the Department Manager, assign work, and ensure proper performance of assigned employees.</li><li>May make restaurant, transportation or entertainment reservations for guests; may deposit guests’ valuables in hotel safe or safe-deposit box; may order complimentary flowers or champagne for special guests.</li><li>Other duties as assigned.<br/><br/></li></ul><strong>Job Skills<br/><br/></strong><ul><li>Speak clearly and listen carefully.</li><li>Use personal judgment and specialized knowledge to give information to people.</li><li>Communicate well with many different kinds of people.</li><li>Change easily and frequently from one activity to another such as from typing to interviewing, to searching in a directory, to using a telephone.</li><li>Use eyes, hands, and fingers accurately while operating a switchboard or computer keyboard.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Education<br/><br/></strong><ul><li>HS Diploma or equivalent.<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>Minimum 1 year guest services, general office, accounts receivable or customer service experience; OR an equivalent combination.</li></ul>", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3931255149"}