{"jobTitle": "Business Analyst", "company": {"name": "American Honda Motor Company, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Motor Vehicle Manufacturing", "description": "<strong>What Makes a Honda, Is Who Makes a Honda<br/><br/></strong>Honda has a clear vision for the future, and it’s a joyful one. We are looking for individuals with the skills, courage, persistence, and dreams that will help us reach our future-focused goals.<br/><br/>At our core is innovation. Honda is constantly innovating and developing solutions to drive our business with record success. We strive to be a company that serves as a source of “power” that supports people around the world who are trying to do things based on their own initiative and that helps people expand their own potential. To this end, Honda strives to realize “the joy and freedom of mobility” by developing new technologies and an innovative approach to achieve a “zero environmental footprint.”<br/><br/>We are looking for qualified individuals with diverse backgrounds, experiences, continuous improvement values, and a strong work ethic to join our team.<br/><br/>If your goals and values align with Honda’s, we want you to join our team to Bring the Future!<br/><br/><strong>Job Purpose<br/><br/></strong><ul><li>The Senior Business Analyst will lead initiatives to scale up and achieve ROI from Digital Products and Subscriptions, will oversee and coordinate the enhancement and support of large, enterprise-wide product or large group of products. </li><li>This role will be a key team member within the Digital Services Development Division, Digital Products Delivery Team. Responsibilities include: work in a product (scrum) team, complete business and some technical analysis supporting key initiatives, build business cases, recommend and implement business processes and/or system solutions, gather and document user stories &amp; acceptance criteria, lead or contribute to ideation sessions, conduct UAT, manage maintenance items, support release management at all stages, provide user support, create and run reports/dashboards, prepare and deliver user training, and develop communication materials for a variety of stakeholders. This position requires extensive collaboration with AHM associates, IT, consultants, contingent workforce, and vendors.<br/><br/></li></ul><strong><strong>Key Accountabilities<br/><br/></strong></strong><strong>Advance Agile Development Cycle for Large Product or Group of Products<br/><br/></strong><ul><li> Lead the gathering, analysis, and documentation of business requirements for our software products.</li><li> Responsible for the product documentation such as user stories, use cases, process flows, acceptance criteria and training materials.</li><li> Participate in Agile development processes including backlog management, sprint planning and demos.</li><li> Partner with the Project Teams to align the production support processes for implemented projects. Support release management at all stages and provide user support.</li><li> Serves as product SME and translate product knowledge to customer / dealer needs. Ensure a harmonious flow of work among multiple business and IT teams.</li><li> Collaborate with developer teams during design and development phases.<br/><br/></li></ul><strong>Communication and Change Management<br/><br/></strong><ul><li> Leads, facilitates, gather/refine complex business requirements, recommend or make decisions on business requirements/interdependencies.</li><li> Serves as product SME: communicates with stakeholders to ensure alignment of product roadmap and business goals.</li><li> Interact with other Honda company personnel, build strong relationships at all levels and across all business units and organizations, and understands business imperatives.</li><li> Provide support on issues and questions from stakeholders who may include corporate and field sales leaders, district sales managers, customers, and AHM dealers along with corporate web property owners and other IT or business personnel.<br/><br/></li></ul><strong>Lead Continuous Improvement Efforts<br/><br/></strong><ul><li> Identify opportunities for product improvements, new features, and functionality.</li><li> Ensure designated Product stays current and drives value with subsequent projects or business initiatives. Create compelling cases to advocate for product and influence business decisions.</li><li> Recommend solutions based on market research and analysis to identify consumer trends and user needs.</li><li> Utilize analytics to evaluate site performance, determine strategy, and provide direction for enhancements to site components.</li><li> Conduct User Acceptance Testing of site updates and enhancements to ensure successful implementation with a minimal number of defects.</li><li> Ongoing maintenance, including identifying and reporting bugs or any other issues for resolution.<br/><br/></li></ul><strong>Workstyle<br/><br/></strong>Hybrid: 3 days per workweek at the American Honda, Torrance, CA office<br/><br/><strong>Educational Requirements<br/><br/></strong><strong><strong>Qualifications, Experience, and Skills<br/><br/></strong></strong>Bachelor's degree in Business, Computer Science, or related field or, equivalent professional experience supported by subject matter training.<br/><br/><strong>Key Qualifying Skills<br/><br/></strong><ul><li> 5 to 8 years of experience in Business Analysis and/or Product Management.</li><li> Knowledge of Agile methodologies and software development lifecycle (SDLC).</li><li> Strong analytical and problem-solving skills.</li><li> Strong verbal and written communication skills.</li><li> Prior experience in a team environment and the ability to interface with all levels of management.</li><li> Two or more years of experience of system-oriented work in products or production support.</li><li> Working knowledge of JIRA, Confluence or similar systems.</li><li> Experience working with consumer-facing software products.</li><li> Self-motivated with strong analytical, organizational and project coordination skills.</li><li> Adaptable with proven track record of growing responsibilities.</li><li> Curious, questioning skills to gain understanding and build support.</li><li> Adaptable with proven track record of growing responsibilities.</li><li> Ability to coordinate multiple initiatives simultaneously.</li><li>Strong organizational skills.</li><li> Ability to communicate effectively with internal and external customers as well as non-technical and technical personnel.</li><li>Strong verbal and written communication skills.</li><li>Skilled at questioning, using evidence to persuade.</li><li> Ability to manage complex initiatives with multiple elements and stakeholders.</li><li> Ability to gather/refine complex business requirements, recommend or make decisions on business requirements/interdependencies.</li><li> Ability to present complex positions and strategies for business decisions, processes and plans.</li><li> Ability to work effectively with AHM staff, IT staff, 3rd party vendor staff.</li><li> Ability to coach and manage performance (if managing direct report(s))<br/><br/></li></ul><strong>Desirable<br/><br/></strong>Vehicle Telematics / Automotive OEM / Auto Dealership experience.<br/><br/><strong>Total Rewards<br/><br/></strong><strong>Benefits and Total rewards<br/><br/></strong><ul><li>Competitive base salary.</li><li>Overtime</li><li>Annual Bonus</li><li>Industry-leading Benefit Plans (Medical, Dental, Vision)</li><li>Paid time off, including vacation, paid holidays, sick time, and personal days</li><li>401(K) Plan with company match + additional company service-based contribution<br/><br/></li></ul><strong>Career Growth<br/><br/></strong><ul><li>Advancement opportunities</li><li>Career mobility </li><li>Education reimbursement for continued learning</li><li>Training and Development programs<br/><br/></li></ul><strong>Additional Offerings<br/><br/></strong><ul><li>Well-being program</li><li>Annual lifestyle bonus: $ 1K</li><li>Community service and engagement programs</li><li>Product programs</li><li>Free drinks onsite<br/><br/></li></ul>Honda is an equal opportunity employer and considers qualified applicants for employment without regard to race, color, creed, religion, national origin, sex, sexual orientation, gender identity and expression, age, disability, veteran status, or any other protected factor.<br/><br/>", "responsibilities": "Lead the gathering, analysis, and documentation of business requirements for our software products. Responsible for the product documentation such as user stories, use cases, process flows, acceptance criteria and training materials. Participate in Agile development processes including backlog management, sprint planning and demos. Partner with the Project Teams to align the production support processes for implemented projects. Support release management at all stages and provide user support. Serves as product SME and translate product knowledge to customer / dealer needs. Ensure a harmonious flow of work among multiple business and IT teams. Collaborate with developer teams during design and development phases. Leads, facilitates, gather/refine complex business requirements, recommend or make decisions on business requirements/interdependencies. Serves as product SME: communicates with stakeholders to ensure alignment of product roadmap and business goals. Interact with other Honda company personnel, build strong relationships at all levels and across all business units and organizations, and understands business imperatives. Provide support on issues and questions from stakeholders who may include corporate and field sales leaders, district sales managers, customers, and AHM dealers along with corporate web property owners and other IT or business personnel. Identify opportunities for product improvements, new features, and functionality. Ensure designated Product stays current and drives value with subsequent projects or business initiatives. Create compelling cases to advocate for product and influence business decisions. Recommend solutions based on market research and analysis to identify consumer trends and user needs. Utilize analytics to evaluate site performance, determine strategy, and provide direction for enhancements to site components. Conduct User Acceptance Testing of site updates and enhancements to ensure successful implementation with a minimal number of defects. Ongoing maintenance, including identifying and reporting bugs or any other issues for resolution.", "qualifications": {"required": "Bachelor's degree in Business, Computer Science, or related field or, equivalent professional experience supported by subject matter training. 5 to 8 years of experience in Business Analysis and/or Product Management. Knowledge of Agile methodologies and software development lifecycle (SDLC). Strong analytical and problem-solving skills. Strong verbal and written communication skills. Prior experience in a team environment and the ability to interface with all levels of management. Two or more years of experience of system-oriented work in products or production support. Working knowledge of JIRA, Confluence or similar systems. Experience working with consumer-facing software products. Self-motivated with strong analytical, organizational and project coordination skills. Adaptable with proven track record of growing responsibilities. Curious, questioning skills to gain understanding and build support. Adaptable with proven track record of growing responsibilities. Ability to coordinate multiple initiatives simultaneously. Strong organizational skills. Ability to communicate effectively with internal and external customers as well as non-technical and technical personnel. Strong verbal and written communication skills. Skilled at questioning, using evidence to persuade. Ability to manage complex initiatives with multiple elements and stakeholders. Ability to gather/refine complex business requirements, recommend or make decisions on business requirements/interdependencies. Ability to present complex positions and strategies for business decisions, processes and plans. Ability to work effectively with AHM staff, IT staff, 3rd party vendor staff. Ability to coach and manage performance (if managing direct report(s))", "preferred": "Vehicle Telematics / Automotive OEM / Auto Dealership experience."}, "skills": ["Business Analysis", "Product Management", "Agile Methodologies", "Software Development Lifecycle", "Analytical Skills", "Problem Solving", "Communication", "Teamwork", "Management", "JIRA", "Confluence", "Consumer-facing Software Products", "Organizational Skills", "Project Coordination", "Customer Service", "Stakeholder Management", "Presentation Skills", "Vendor Management", "Performance Management", "Vehicle Telematics", "Automotive OEM", "Auto Dealership"], "postedDate": "2 months ago", "benefits": "Competitive base salary. Overtime Annual Bonus Industry-leading Benefit Plans (Medical, Dental, Vision) Paid time off, including vacation, paid holidays, sick time, and personal days 401(K) Plan with company match + additional company service-based contribution Advancement opportunities Career mobility Education reimbursement for continued learning Training and Development programs Well-being program Annual lifestyle bonus: $ 1K Community service and engagement programs Product programs Free drinks onsite", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3933974924"}