{"jobTitle": "Operations Manager II - Distribution", "company": {"name": "DHL Supply Chain", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Salary Range: $66,560-$104,000<br/><br/><strong>Operations Manager II<br/><br/></strong>As an Operations Manager at DHL Supply Chain, you will play a pivotal role in ensuring the smooth and efficient operation of our warehouses. Your responsibilities go beyond daily management – you will be instrumental in implementing processes to optimize our warehouse operations. Your leadership will be vital in guiding our team, fostering a safe and productive work environment, and ultimately driving the overall success of DHL Supply Chain. This position offers a unique opportunity to make a significant impact within DHL Supply Chain and contribute to our renowned reputation as the global leader in contract logistics.<br/><br/>With over 500 facilities and more than 50,000 dedicated associates, DHL Supply Chain North America attributes its success to the hard work and dedication of our team, operating in over 150 million square feet of warehouse space.<br/><br/><strong>Job Description: <br/><br/><br/></strong><ul><li>Lead, motivate and develop a diverse team of Supervisors and indirect reports by providing coaching, guidance, and support as needed, while also developing a strong team culture of inclusion and belonging.</li><li>Develop and implement efficient workflows, labor plan, standardize processes, and introduce best practices to enhance productivity, reduce costs, and improve overall operational efficiency.</li><li>Take proactive measures to consistently uphold compliance with health and safety regulations, fostering a culture of heightened safety awareness throughout the organization.</li><li>Compile comprehensive reports on key performance indicators (KPIs), including but not limited to productivity and accuracy metrics, providing valuable insights to support informed decision-making and drive continuous improvement efforts.</li><li>Foster an environment of open communication and collaboration, facilitating regular and effective dialogue among leadership and associates to promote transparency, alignment, and teamwork.</li><li>Partner with Human Resources and site leadership to ensure a comprehensive hiring process of Supervisors. Provide valuable input and recommendations to support the selection of top talent that aligns with the organization's values, culture, and job requirements.</li><li>Collaborate closely with cross-functional teams to ensure the consistent and prompt fulfillment of customer orders, exceeding their expectations. </li><li>Engage in a strong partnership with customers, proactively taking measures to address any concerns or issues, with the goal of achieving exceptional customer satisfaction.<br/><br/><br/></li></ul><strong>Required Education and Experience:<br/><br/><br/></strong><ul><li>Bachelor's degree or equivalent experience, preferred.</li><li>1+ years logistics industry experience, required.</li><li>2+ years of experience in a supervisory or management role, required.</li><li>Experience with P&amp;L management, objective setting, and project management, preferred.<br/><br/><br/></li></ul>Our Organization has a business casual environment and focuses on teamwork, associate development, training, and continuous improvement. We offer competitive wages, excellent affordable insurance benefits (including health, dental, vision and life), 401K plan, paid vacation and holidays.<br/><br/>Our Organization is an equal opportunity employer.<br/><br/>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3933301551"}