{"jobTitle": "Executive Assistant", "company": {"name": "Crooked Media", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$65,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Technology, Information and Internet", "description": "Crooked believes that we need a better conversation about politics, culture, and the world around us—one that doesn't just focus on what's broken, but what we can do to fix it. We are a media network that showcases stories, voices, and opportunities for activism that inform, entertain, and inspire action, because it's up to all of us to do our part to build a better world.<br/><br/><strong>Job Summary:<br/><br/></strong>Crooked Media is seeking a highly organized and driven Executive Assistant to provide administrative support to the CEO and Crooked Founders, with additional support for other members of the Executive team. This position requires a high level of organization, attention to detail, flexibility and the ability to prioritize workload and multi-task in an environment that requires frequent change. The ideal candidate will be able to work independently with minimal supervision and demonstrate excellent interpersonal and communication skills, both verbal and written. You will be expected to maintain confidentiality and exhibit a high level of discretion and professionalism.<br/><br/><em>While Crooked has adopted a hybrid work model for our most staff. We know each role has different needs, and for the Executive Assistant, this role will be based in office, on-site in our Los Angeles office, with occasional evening work. We are ideally looking for Los Angeles based candidates, or candidates willing to relocate before the start date. <br/><br/></em><strong>How You'll Spend Your Time: <br/><br/></strong>Administration &amp; Scheduling<br/><br/><ul><li>Provide meticulous and detailed executive assistance to the CEO &amp; Founders, with additional support for other members of the Executive Team via calendar support, travel &amp; expense management, email monitoring, project management, and research and other administrative and office management support</li><li>Manage complex calendars and work with internal staff and external partners with a sense of urgency and discretion </li><li>Compile, circulate, and organize meeting prep materials, including documents, presentations, etc. for internal and external meetings</li><li>Look ahead and plan for monthly, quarterly and annual events</li><li>Maintain organization of the CEO's office and ensure meeting rooms are prepared for all internal and external meetings, including tech and logistical setup</li><li>Liaise with Board to ensure materials are distributed and meetings are set</li><li>Book travel</li><li>Handle various personal needs/requests </li><li>Coordinate scheduling leadership meetings and other key stakeholder follow-ups</li><li>Collect and own expense reporting, including receipt gathering and submission</li><li>Be available via phone, email, and/or text<br/><br/></li></ul>Operations Support<br/><br/><ul><li>Work with Chief of Staff to help project manage critical path items, maintain focus and priorities for key initiatives</li><li>Lead on the planning of staff meetings, including booking external speakers, liaising with staff on deck support, and assisting the Operations team with day-of logistics</li><li>Under the direction of the Operations Manager, lead on daily office maintenance tasks, and ensure the office is in top shape. Duties include: office tidying, kitchen stocking, ordering supplies, front desk support and other tasks as they arise </li><li>Provide additional support to executives and other departments as needed <br/><br/></li></ul><strong>What You'll Bring To The Table:<br/><br/></strong><ul><li>4+ years prior Executive Assistant experience working for senior executives within a media and/or entertainment organization</li><li>Sharp focus, time management, and attention to detail - no project is too big and no task is too small for you to work on </li><li>Must be proactive and able to multitask various needs and deadlines with the ability to prioritize and anticipate needs</li><li>Strong project management written &amp; presentation skills required with the ability to pivot as challenges arise</li><li>Excellent written, verbal, and interpersonal communication skills</li><li>Warm, engaging and professional demeanor</li><li>Resilience and adaptability</li><li>A strong tie to our mission and interest in our content </li><li>Valid Driver's License and reliable transportation<br/><br/></li></ul>This job description provides a summary of how you'll spend your time but is nowhere near exhaustive, so other duties may be assigned over time.<br/><br/><strong>Pay and Perks: <br/><br/></strong>At Crooked, we believe in paying employees at or above market rates that are informed by salary surveys and industry benchmarks. In addition to competitive salaries, we offer full-time employees excellent benefits including:<br/><br/><ul><li>Paid healthcare</li><li>401k match </li><li>Generous vacation</li><li>16 weeks of paid parental leave</li><li>A discretionary year-end bonus</li><li>Did we also mention our offices are closed at the end of the year? <br/><br/></li></ul>When we open up a position, we conduct a market analysis to ensure we have the most up-to-date data. Once we're ready to extend an offer, we look at the individual's years of relevant experience and other compensable factors to determine a competitive offer. And for this role, the starting salary range is $65,000 - $95,000.<br/><br/><strong>About Us<br/><br/></strong>We welcome everyone—as an inclusive workplace, we invite all our employees to bring their authentic, whole selves to work. Our mission and intent is to encourage people from every nation, race/ethnicity, belief, gender, gender identity, sexual identity, disability, and culture to feel respected and valued for their unique contributions to our company.<br/><br/>We approach our work courageously, adapt and improve constantly, and celebrate the wins big and small. We cultivate a culture of creativity and expression at Crooked Media. We hire the best talent, ensure they have the tools and training they need, and set them free. If you have a high degree of ownership and are driven to excel, you'll fit right in.<br/><br/>That's it. End of mission.", "responsibilities": "Provide meticulous and detailed executive assistance to the CEO &amp; Founders, with additional support for other members of the Executive Team via calendar support, travel &amp; expense management, email monitoring, project management, and research and other administrative and office management support\nManage complex calendars and work with internal staff and external partners with a sense of urgency and discretion \nCompile, circulate, and organize meeting prep materials, including documents, presentations, etc. for internal and external meetings\nLook ahead and plan for monthly, quarterly and annual events\nMaintain organization of the CEO's office and ensure meeting rooms are prepared for all internal and external meetings, including tech and logistical setup\nLiaise with Board to ensure materials are distributed and meetings are set\nBook travel\nHandle various personal needs/requests \nCoordinate scheduling leadership meetings and other key stakeholder follow-ups\nCollect and own expense reporting, including receipt gathering and submission\nBe available via phone, email, and/or text\nWork with Chief of Staff to help project manage critical path items, maintain focus and priorities for key initiatives\nLead on the planning of staff meetings, including booking external speakers, liaising with staff on deck support, and assisting the Operations team with day-of logistics\nUnder the direction of the Operations Manager, lead on daily office maintenance tasks, and ensure the office is in top shape. Duties include: office tidying, kitchen stocking, ordering supplies, front desk support and other tasks as they arise \nProvide additional support to executives and other departments as needed ", "qualifications": {"required": "4+ years prior Executive Assistant experience working for senior executives within a media and/or entertainment organization\nSharp focus, time management, and attention to detail - no project is too big and no task is too small for you to work on \nMust be proactive and able to multitask various needs and deadlines with the ability to prioritize and anticipate needs\nStrong project management written &amp; presentation skills required with the ability to pivot as challenges arise\nExcellent written, verbal, and interpersonal communication skills\nWarm, engaging and professional demeanor\nResilience and adaptability\nA strong tie to our mission and interest in our content \nValid Driver's License and reliable transportation"}, "skills": ["Executive Assistance", "Calendar Management", "Travel Management", "Expense Management", "Email Management", "Project Management", "Research", "Office Management", "Meeting Coordination", "Board Liaison", "Event Planning", "Operations Support", "Chief of Staff Support", "Staff Meeting Planning", "Office Maintenance", "Front Desk Support", "Media", "Entertainment"], "postedDate": "2 months ago", "benefits": "Paid healthcare\n401k match \nGenerous vacation\n16 weeks of paid parental leave\nA discretionary year-end bonus", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3933226044"}