{"jobTitle": "Senior Manager, Central Operations", "company": {"name": "Veo", "industry": "Technology, Information and Internet", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Management and Manufacturing", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$140,000 - $180,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "At Veo, we are on a mission to end car dependency by making clean transportation accessible to all and advancing the next generation of fully electric micro-mobility systems. Our fleets are constantly evolving and feature a range of vehicles - from pedal and electric bicycles, to standing and seated e-scooters, e-cargo bikes, and ADA accessible devices. We design and build our own vehicles, hardware, and software systems in house and run all our local operations to provide safe, efficient, and responsive mobility services that make communities more sustainable and livable. We are looking for exceptionally talented individuals who are ready to develop and implement new solutions to these exciting challenges. We are headquartered in Santa Monica, CA, but are hiring across the U.S. Join us!", "responsibilities": "Act as a business owner, transform strategies into operational experiments that create measurable and actionable outcomes, informing your larger initiative implementation plans. Define, launch and drive strategic and analytical initiatives to directly and indirectly improve customer experience, improve internal and external facing operational processes, working closely with cross-functional teams, executive stakeholders, and senior leadership. Identify gaps, deep dive to root cause and propose changes to existing standard work, systems, and frameworks that drive operational efficiency and cost reduction. Develop scalable solutions, work to manage operational risks across the organization, and develop best practices that are a benefit across the organization. Lead a team that design, implement and maintain processes, systems, mechanisms and tools to maximize field operations productivity, safety and engagement. Identify revenue growth opportunities, develop and present plans to key stakeholders.", "qualifications": {"required": "6+ years of experience in Operations Strategy, Operations, or Operations Excellence role. B.S. in Business, Engineering, Mathematics, Supply Chain, Finance or Related Degree. MBA is a plus. Problem-solving, analytical skills and implementation abilities. Ability to define problems, collect data, establish facts, and draw valid conclusions. Experience in project and OKR management. Excellent communication skills. Comfortable developing and presenting reports. Experience or desire to work with a fast paced operations environment. Thrives in a heavily multifunctional work environment. Willingness to travel up to 40% of the time. Excited about getting immersed in field operations and firsthand identifying opportunities and implementing new processes.", "preferred": ""}, "skills": [], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "Unlimited PTO, Medical/dental/vision coverage, 401k, Opportunity to work in a fast-paced, early-stage technology company, Veo credits, Commitment to professional development and mentorship.", "remoteWork": "Hybrid work schedule where you will be able to showcase your creativity and build strong relationships with teams in a cross-functional manner three days a week and work remotely for the remaining working days.", "url": "https://www.linkedin.com/jobs/view/3933021556"}