{"jobTitle": "Toyota Place - Porter - Service and/or Sales", "company": {"name": "Toyota Place", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Motor Vehicle Manufacturing", "description": "<strong>Position Description:</strong> Lot Attendant/Porter<br/><br/><strong>Reports to:</strong> Service Manager<br/><br/><strong>Position Summary:</strong> The Lot Attendant/Porter is responsible for maintaining a clean and well organized New and Used Vehicle area, Service Department, Body Shop and Customer drive-through area.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Keep the New and Used Vehicle lots neat and orderly, moving cars as directed by management and in accordance with facility display standards.</li><li>Keep inventory vehicles clean as directed by management.</li><li>Clean interior and exterior of vehicles, including the trunks and glove compartments.</li><li>Police grounds of the dealership.</li><li>Complete OSHA right-to-know training.</li><li>Complete all training as directed by supervisor.</li><li>Follow policies and procedures as set forth in Employee Handbook.</li><li>Wear company approved uniform.</li><li>Any other duties as assigned.<br/><br/></li></ul><strong>Knowledge, Skills And Abilities Required<br/><br/></strong><strong>Educational: </strong>High school diploma or the equivalent.<br/><br/><strong>Experience: </strong>None.<br/><br/><strong>Special Skills (i.e., licenses, certifications, etc.): </strong>Ability to read and comprehend instructions and information. Ability to use personal computer applications. General mechanical skills and manual dexterity. Good judgment. Current valid driver’s license.<br/><br/><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Physical Demands And Working Conditions<br/><br/></strong>The noise level in the work environment is usually loud. Frequently required to bend, stoop, crouch, reach, and handle tools. Requires the ability to lift 40 pounds of material. Frequently works near moving mechanical parts. Is potentially exposed to battery acid, gasoline, chemical cleaning materials or other toxic materials commonly found in a motor vehicle repair facility. Frequently, exposed to exhaust fumes or other airborne particles.<br/><br/><em>THE ABOVE DECLARATIONS ARE NOT INTENDED TO BE AN “ALL-INCLUSIVE” LIST OF THE DUTIES AND RESPONSIBILITIES OF THE JOB DESCRIBED OR OF THE SKILLS AND ABILITIES REQUIRED TO PERFORM THE JOB. RATHER, THEY ARE INTENDED ONLY TO DESCRIBE THE GENERAL REQUIREMENTS OF THE JOB.<br/><br/></em><em>______________________________ ________________<br/><br/></em><em>Signature (Employee) Date<br/><br/></em><em> ______________________________ ________________<br/><br/></em><em>Signature (Supervisor) Date</em>", "postedDate": "3 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3934935122"}