{"jobTitle": "Visual Merchandising Manager", "company": {"name": "Ardmore Home Design, Inc.", "industry": "Wholesale Furniture and Home Furnishings", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Wholesale Furniture and Home Furnishings", "description": "<strong>Job Description<br/><br/></strong><strong>About Us <br/><br/></strong>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).<br/><br/><strong>About The Role<br/><br/></strong>We are looking for a Visual Merchandising Manager to join our team. This individual will be responsible for planning, executing and maintaining visual standards and corporate direction relating to brand presentation for showrooms and tradeshows. A background in the home furnishings industry, with a strong emphasis on planning &amp; allocation, fixture development, merchandising and managing the setup of tradeshows and/or showrooms is beneficial.<br/><br/>The ability to travel 60% of the year is required.<br/><br/><strong>Requirements<br/><br/></strong>This role is 50% planning, analyzing and allocating product assortment and 50% executing hands-on through visual merchandising and installs in various markets. The Visual Merchandising Manager will oversee 1-2 showrooms, in addition to setting up 4-6 tradeshows yearly<br/><br/><ul><li> Maintain, analyze product and create seasonal 3D floor plans for showrooms in designated market/s; partner with showroom manager weekly to assess needs based on selling</li><li> Layout multiple product SKUs in 3D model prior to tradeshow or showroom setup; execute a visual layout based on available SKUs and SKUs arriving in tradeshow or showroom</li><li> Analyze product sales data to feature best-selling products and determine which products to add or remove from showroom/tradeshow inventory</li><li> Partner with Visual Director and Director of Construction and Design to elevate brand presentations in designated markets</li><li> Contribute and design new merchandising strategies seasonally with a brand specific focus</li><li> Develop, design and source displays and fixture packages when applicable</li><li> Contribute monthly with inspiration/ideas in trends, design and display</li><li> Orchestrate the management and coordination of labor and freight for showrooms and tradeshows as related to visual presentation</li><li> Work with Visual and Marketing teams to order graphics, logos or other collateral as necessary; ability to size logos, photos, interface with printers or outside graphics companies</li><li> Travel as needed for tradeshow and showroom setups; 60% of the year<br/><br/></li></ul><strong>Required Skills:<br/><br/></strong><ul><li> Experience working for a luxury brand, preferably in home furnishings</li><li> Strong working knowledge of SketchUp and Adobe Suite</li><li> Pro-active; able to figure things out with little direction</li><li> Detail-oriented with excellent organizational skills</li><li> Able to multi-task and make decisions quickly</li><li> Works effectively in high pressure situations</li><li> Ability to think ahead and anticipate future needs independently</li><li> Global thinker and problem solver; able to make split decisions with little information on hand</li><li> Strong written and verbal communication skills; ability to interact professionally and effectively with all levels of management and staff</li><li> Able to manage vendors and resources</li><li> Ability to work nights and weekends as needed<br/><br/></li></ul><strong>Why AHD?<br/><br/></strong>We believe every employee should be rewarded fairly for a job well done! As an AHD employee, you will enjoy comprehensive healthcare coverage including medical, vision and dental care. Your financial well-being will be supported through our 401(k) retirement investment plan. Moreover, we offer a challenging &amp; rewarding professional work environment.<br/><br/><strong>The AHD total package includes:<br/><br/></strong><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401(k) Retirement with up to 6% employer contributions</li><li>Paid Vacation Time</li><li>Paid Holidays</li><li>Consistent work/life balance</li><ul><li> No weekends and for wholesale distribution business (no manufacturing)</li></ul><li>Relaxed and collaborative work environment</li><li>Up to 6% 401k employer contributions</li><li>Amazing benefits and wellness programs</li><li>Training and career development opportunities<br/><br/></li></ul><strong>Compensation<br/><br/></strong>Starting annual salary: $65,000-75,000. Exact compensation may vary based on skills, experience, and location.<br/><br/><strong>Company Description<br/><br/></strong>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, founder-led entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).<br/><br/>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, founder-led entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).", "responsibilities": "This individual will be responsible for planning, executing and maintaining visual standards and corporate direction relating to brand presentation for showrooms and tradeshows. A background in the home furnishings industry, with a strong emphasis on planning &amp; allocation, fixture development, merchandising and managing the setup of tradeshows and/or showrooms is beneficial.", "qualifications": {"required": "Experience working for a luxury brand, preferably in home furnishings, Strong working knowledge of SketchUp and Adobe Suite, Pro-active; able to figure things out with little direction, Detail-oriented with excellent organizational skills, Able to multi-task and make decisions quickly, Works effectively in high pressure situations, Ability to think ahead and anticipate future needs independently, Global thinker and problem solver; able to make split decisions with little information on hand, Strong written and verbal communication skills; ability to interact professionally and effectively with all levels of management and staff, Able to manage vendors and resources, Ability to work nights and weekends as needed", "preferred": ""}, "skills": ["SketchUp", "Adobe Suite"], "postedDate": "3 months ago", "applicationDeadline": "", "benefits": "We believe every employee should be rewarded fairly for a job well done! As an AHD employee, you will enjoy comprehensive healthcare coverage including medical, vision and dental care. Your financial well-being will be supported through our 401(k) retirement investment plan. Moreover, we offer a challenging &amp; rewarding professional work environment.<br/><br/>The AHD total package includes:<br/><br/><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401(k) Retirement with up to 6% employer contributions</li><li>Paid Vacation Time</li><li>Paid Holidays</li><li>Consistent work/life balance</li><ul><li> No weekends and for wholesale distribution business (no manufacturing)</li></ul><li>Relaxed and collaborative work environment</li><li>Up to 6% 401k employer contributions</li><li>Amazing benefits and wellness programs</li><li>Training and career development opportunities<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3934369844"}