{"jobTitle": "Event Sponsorship Manager", "company": {"name": "FoodieLand", "location": "Monrovia, CA"}, "location": "Monrovia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "FoodieLand is the leading food festival operator in the United States. Operating over 15+ events with a total attendance of over 1M annually.\n\nWe are seeking a dynamic and experienced Event Sponsorship Manager to join our team and drive the sponsorship strategy for our exciting food and music festival. The successful candidate will be responsible for securing sponsorship partnerships, managing relationships with sponsors, and ensuring the fulfillment of sponsorship agreements. \n\n**Responsibilities:**\n\n* Develop and execute a comprehensive sponsorship strategy to attract sponsors and meet revenue targets.\n* Identify and prioritize potential sponsors, including local businesses, corporations, and community organizations.\n* Create compelling sponsorship packages and proposals tailored to the needs and objectives of potential sponsors.\n* Pitch sponsorship opportunities to prospects through presentations, meetings, and other communication channels.\n* Negotiate sponsorship agreements and contracts, ensuring terms are mutually beneficial and aligned with festival objectives.\n* Collaborate with internal teams to fulfill sponsorship benefits, including branding, signage, activations, and promotional opportunities.\n* Serve as the primary point of contact for sponsors, providing exceptional customer service and support throughout the sponsorship lifecycle.\n* Maintain accurate records of sponsor interactions, agreements, and payments using CRM software or other systems.\n* Evaluate sponsorship performance and provide regular reports to management, highlighting key metrics and insights.\n* Stay informed about industry trends, competitor activities, and emerging sponsorship opportunities.\n\n**Requirements:**\n\n* Bachelor's degree in Marketing, Business Administration, Hospitality, or related field.\n* Proven experience in event sponsorship sales or partnership development, preferably in the food, music, or entertainment industry.\n* Strong negotiation skills and the ability to build and maintain relationships with diverse stakeholders.\n* Excellent communication and presentation skills, with the ability to articulate value propositions effectively.\n* Results-oriented mindset with a track record of achieving revenue targets and driving business growth.\n* Highly organized with strong attention to detail and the ability to manage multiple projects simultaneously.\n* Proficiency in Microsoft Office Suite, Google Workspace, and Salesforce (Preferred).\n* Flexibility to work evenings, weekends, and extended hours during peak event periods.\n* Passion for food, music, and festivals, with a genuine enthusiasm for promoting the festival experience to potential sponsors.", "postedDate": "3 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3934516580"}