{"jobTitle": "Contract Manager", "company": {"name": "Turner & Townsend", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management", "industry": "Construction, Civil Engineering, and Business Consulting and Services", "description": "<strong>Company Description<br/><br/></strong>Founded in 1952 and formerly known as Heery International Inc., the firm operates throughout the United States as part of Turner & Townsend. It specializes in project and program management for public sector organizations, with industry-leading experts in corporate, cultural, healthcare, justice, sports, K-12 education, higher education, aviation and government facilities.<br/><br/>Recognized for service excellence by a broad spectrum of professional organizations and industry publications, the talented multidisciplinary team at Turner & Townsend Heery exceeds client expectations — adding value, best practice and expertise at every turn. The team's unique client-centric culture is integrated into each project and reflects a passion for the built environment and staying true to the client’s vision.<br/><br/><strong>Job Description<br/><br/></strong><strong>Turner & Townsend Heery</strong> is seeking a <strong>Contract</strong> <strong>Manager </strong>in Los Angeles County. The successfull candidate will be skilled in the following.<br/><br/><ul><li>Negotiate or renegotiate new and existing agreements or statements of work. Ensure readability and comprehensibility of procurement documents, agreements and contracts, while consistently adhering to District standards and legal requirements.</li><li>Review and manage contractual obligations and provide continual review to ensure that all terms and conditions are met and to ensure good customer relations while also representing the interests of the District. Monitor supplier and service provider performance; communicate with suppliers and service providers on contract terms, and manage dispute resolution</li><li>Prepare and disseminate information regarding contract status, compliance, and modifications to department directors/managers. Analyze impact of modifications and revisions and prepare and communicate recommendations to management. Advise management of contract commitments, deficiencies, commitments, and performance.</li><li>Review the scope of work and other materials related to contracts and procurement; provide guidance to programs in drafting solicitation documents, such as request for proposals (RFPs), documented quotes (DQs), and sole source justifications. Ensure alignment between the proposal narrative, scope of work, evaluation criteria, evaluation scorecard, the contract, and other contract procurement documents.</li><li>Actively partner with stakeholders in order to understand the scope of work; develop contract language for deliverables and program requirements. Work closely with the District’s Legal and Policy Counsel on complex contracts including those that involve sharing student data.</li><li>Provide procurement and contractual guidance to staff, project managers, and other contract stakeholder. Recommend and coordinate the implementation of policies and procedures for assigned functions and assist in developing new policies and procedures.</li><li>Provide research services, and analysis as directed by the Executive Director of Finance.</li><li>Create and retain records in compliance with the School District Record Management Manual.</li><li>Attend work and arrive in a timely manner.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>TECHNICAL SKILLS, KNOWLEDGE &amp; ABILITIES: <br/><br/></strong><ul><li> Advanced oral and written communication skills.</li><li>Advanced reading and language comprehension skills.</li><li>Advanced meeting facilitation skills.</li><li>Interpersonal relations skills.</li><li>Customer service and public relations skills.</li><li>Critical thinking and problem-solving skills.</li><li>Ability to conduct extensive research and interpret laws and court opinions as related to procurement and contracting.</li><li>Ability to spot errors and inconsistencies and pay close attention to details.</li><li>Ability to effectively negotiate and execute contracts.</li><li>Ability to work independently.</li><li>Ability to prioritize and managing multiple concurrent requests and responsibilities.</li><li>Ability to maintain confidentiality in all aspects of the job.</li><li>Ability to diffuse and manage volatile and stressful situations.</li><li>Knowledge of governmental purchasing and contract administration including State of Colorado statutes governing school districts.</li><li>Ability to maintain honesty and integrity in all aspects of the job.</li><li>Ability and willingness to adhere to attendance requirements, including regular and punctual employee presence.</li><li> Ability to promote and follow Board of Education policies, Superintendent policies and building and department procedures.</li><li>Ability to communicate, interact and work effectively and cooperatively with people from diverse ethnic and educational backgrounds.</li><li>Ability to recognize the importance of safety in the workplace, follow safety rules, practice safe work habits, utilize appropriate safety equipment and report unsafe conditions to the appropriate administrator.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Graduation from a recognized college or university.</li><li>Experience in public contracting in the construction and engineering sector.</li><li>7 years full time paid professional experience managing and or administering public procurements and contract. Experience in JOC, design-build, and design-bid-build public contracting.<br/><br/></li></ul><strong>Preferences<br/><br/></strong><ul><li>Experience in State, Federal or municipal contracting.</li><li>Bilingual oral and written communication skills preferred<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong><em>The salary range for this full-time role is $125k-$160k per year. Ranges are determined by role and level and represent a good faith effort to provide a fair and equitable salary. This range is a reflection of base salary only, not of a total compensation package.  Please note Turner & Townsend reserves the right to pay more or less than the posted range, depending on candidate’s experience and qualifications. <br/><br/></em></strong><em>Turner & Townsend is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Equal Employment Opportunity Posters If you’d like to view a copy of the company’s affirmative action plan, please email recruitmentUSA@turntown.com. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact the Human Resources Department at 713-457-9400 or recruitmentUSA@turntown.com. This telephone line and email address is reserved solely for job seekers with disabilities requesting accessibility assistance or an accommodation in the job application process. Please do not call about the status of your job application if you do not require accessibility assistance or an accommodation. Messages left for other purposes, such as following up on an application or non-disability related technical issues, will not receive a response.<br/><br/></em>Join our social media conversations for more information about Turner & Townsend and our exciting future projects:<br/><br/>Twitter<br/><br/>Instagram<br/><br/>LinkedIn<br/><br/><em>It is strictly against Turner & Townsend policy for candidates to pay any fee in relation to our recruitment process. No recruitment agency working with Turner & Townsend will ask candidates to pay a fee at any time. <br/><br/></em><em>Any unsolicited resumes/CVs submitted through our website or to Turner & Townsend personal e-mail accounts, are considered property of Turner & Townsend and are not subject to payment of agency fees. In order to be an authorised Recruitment Agency/Search Firm for Turner & Townsend, there must be a formal written agreement in place and the agency must be invited, by the Recruitment Team, to submit candidates for review.</em>", "responsibilities": "The successfull candidate will be skilled in the following.<br/><br/><ul><li>Negotiate or renegotiate new and existing agreements or statements of work. Ensure readability and comprehensibility of procurement documents, agreements and contracts, while consistently adhering to District standards and legal requirements.</li><li>Review and manage contractual obligations and provide continual review to ensure that all terms and conditions are met and to ensure good customer relations while also representing the interests of the District. Monitor supplier and service provider performance; communicate with suppliers and service providers on contract terms, and manage dispute resolution</li><li>Prepare and disseminate information regarding contract status, compliance, and modifications to department directors/managers. Analyze impact of modifications and revisions and prepare and communicate recommendations to management. Advise management of contract commitments, deficiencies, commitments, and performance.</li><li>Review the scope of work and other materials related to contracts and procurement; provide guidance to programs in drafting solicitation documents, such as request for proposals (RFPs), documented quotes (DQs), and sole source justifications. Ensure alignment between the proposal narrative, scope of work, evaluation criteria, evaluation scorecard, the contract, and other contract procurement documents.</li><li>Actively partner with stakeholders in order to understand the scope of work; develop contract language for deliverables and program requirements. Work closely with the District’s Legal and Policy Counsel on complex contracts including those that involve sharing student data.</li><li>Provide procurement and contractual guidance to staff, project managers, and other contract stakeholder. Recommend and coordinate the implementation of policies and procedures for assigned functions and assist in developing new policies and procedures.</li><li>Provide research services, and analysis as directed by the Executive Director of Finance.</li><li>Create and retain records in compliance with the School District Record Management Manual.</li><li>Attend work and arrive in a timely manner.</li><li>Perform other duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Graduation from a recognized college or university.\nExperience in public contracting in the construction and engineering sector.\n7 years full time paid professional experience managing and or administering public procurements and contract. Experience in JOC, design-build, and design-bid-build public contracting.", "preferred": "Experience in State, Federal or municipal contracting.\nBilingual oral and written communication skills preferred"}, "skills": ["Negotiation", "Contract Management", "Procurement", "Public Relations", "Research", "Customer Service", "Communication", "Problem Solving"], "postedDate": "2 weeks ago", "benefits": "<em>The salary range for this full-time role is $125k-$160k per year. Ranges are determined by role and level and represent a good faith effort to provide a fair and equitable salary. This range is a reflection of base salary only, not of a total compensation package.  Please note Turner & Townsend reserves the right to pay more or less than the posted range, depending on candidate’s experience and qualifications. </em>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3934205487"}