{"jobTitle": "Product Marketing Manager – Spatial Analytics", "company": {"name": "Esri", "industry": "Software Development, IT Services and IT Consulting, Technology, Information and Internet", "size": "Not specified", "location": "Redlands, CA"}, "location": "Redlands, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$66,560-$110,240", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development, IT Services and IT Consulting, Technology, Information and Internet", "description": "As a Product Marketing Manager at Esri, you'll have the chance to expand the world's most powerful spatial analytics software into new and existing markets. Collaborate with product, industry, and sales managers to create and execute impactful marketing strategies that drive sales and raise awareness of Esri's cutting-edge spatial analysis products. This in an opportunity to showcase your marketing expertise while working for a company committed to science, sustainability, community, education, research, and positive change.", "responsibilities": "Develop go-to-market strategies for Esri spatial analysis products, spearhead the communication strategy for changes in product functionality, lifecycle, and pricing, understand user and buyer needs to create personas, positioning, and messaging, lead, coordinate, and execute product launches, product releases, internal communications, and multi-channel enablement, work with corporate and industry marketing teams to execute on campaigns, partner with cross-functional teams to drive awareness and adoption of Esri technology, create engaging content, provide insight into competitive capabilities, develop and monitor key performance indicators to measure product performance in market, work with product management, product engineering, and global business development throughout the product life cycle.", "qualifications": {"required": "2+ years of experience in product, industry, or corporate marketing; communications; business development; consulting; or similar field, proven verbal and written communications skills; ability to understand and convey technical information in a non-technical manner, strong interpersonal skills; ability to thrive in a cross-functional team environment, experience with marketing technology and common marketing concepts, strong project management and problem-solving skills with previous experience leading programs or highly visible projects, ability to exercise good judgment within defined procedures and practices to determine appropriate action, self-starter, detail-oriented and task-oriented, able to successfully manage multiple priorities with guidance from leadership, ability to travel 10-20% of the time for strategic meetings, events and/or tradeshows, Bachelor’s in business, marketing, or related field, Visa sponsorship is not available for this posting; applicants must be authorized to work for any employer in the U.S.", "preferred": "Experience or strong interest in learning about spatial analysis, data science, data analytics, Jupyter Notebooks, Python, and GIS, prior experience marketing software, Master’s in business, marketing, or related field."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Esri’s competitive total rewards strategy includes industry-leading health and welfare benefits: medical, dental, vision, basic and supplemental life insurance for employees (and their families), 401(k) and profit-sharing programs, minimum accrual of 80 hours of vacation leave, twelve paid holidays throughout the calendar year, and opportunities for personal and professional growth.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3935109225"}