{"jobTitle": "Executive Director (USU)", "company": {"name": "California State University, Northridge", "industry": "Higher Education", "location": "Northridge, CA"}, "location": "Northridge, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "143,325.00 - 257,985.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Higher Education", "description": "About The University Student Union<br/><br/>The University Student Union, as the heart of campus, uplifts and empowers students to achieve educational, personal and professional goals by providing leadership development, meaningful employment, and innovative programs, services and facilities. We promote equity, inclusion and well-being, while encouraging social justice advocacy to help Matadors feel heard, respected and connected to CSUN. Our facilities include a University Student Union and a 138,000 square foot Student Recreation Center (SRC). The SRC is a facility for exercise and leisure activity that promotes lifelong health and wellness.<br/><br/>About The University<br/><br/>One of the largest universities in the country, California State University, Northridge (CSUN) is an urban, comprehensive university that delivers award-winning undergraduate and graduate programs to nearly 40,000 students annually and counts more than 330,000 alumni who elevate Southern California and beyond. Since its founding in 1958, CSUN has made a significant and long-term economic impact on California, generating nearly $1.9 billion in economic impact and more than 11,700 jobs each year. The LAEDC recognized CSUN as its 2015 Eddy Award winner for its positive economic impact. Serving more students on Pell Grants than any other institution in California, CSUN is also a social elevator and one of the most diverse universities in the country. CSUN ranks 13th in awarding bachelor’s degrees to underrepresented minority students and seventh in bachelor’s degrees to Latino students, serves the 13th largest Jewish student population, and enrolls the largest number of students who are Deaf and hard-of-hearing of any U.S. state university. The journal Nature recently named CSUN a Rising Star for scientific research, and the NSF ranks CSUN in the top five nationally among similar institutions for graduates who go on to earn doctorates in the sciences. CSUN is where individuals rise. And through them, so does Greater Los Angeles and beyond.<br/><br/>Position Summary<br/><br/>Under the general guidance of the University Student Union (USU) Board of Directors (BOD), and the Assistant Vice President for Student Affairs, Equity and Inclusion, the Executive Director serves as the chief executive officer of the USU, a California non-profit corporation recognized as an approved auxiliary organization by the California State University. The Executive Director administers, directs, and coordinates the activities of the USU in accordance with the policies, goals and objectives of the USU BOD, the California State University, Northridge, and the Trustees of the California State University; is responsible for the development of current and long-range strategic goals, policies and operating plans to achieve the mission of the USU and for submitting these to the BOD for its approval; provides administrative, human resources, assessment and evaluation, and financial management to ensure effective and efficient student union operations and services which are responsive to the needs of the campus community; and oversees and manages USU facilities, services, operations and programs which currently include the USU BOD, the USU, the Student Recreation Center (SRC), The Pride Center, the Veterans Resource Center (VRC), the DREAM Center, and the Oasis Wellness Center.<br/><br/>Essential Duties<br/><br/><ul><li>Develop and maintain a strategic plan of corporate organization;</li><li>Establish policies and procedures to provide for adequate staff development and management of the USU;</li><li>Responsible for the development, assessment and refinement of annual organizational strategic priorities, long range plans, and student learning outcomes;</li><li>Ensure evaluation and assessment of USU services, operations, programs and facilities on an annual basis and oversees the overall program review of the USU and its operations as prescribed by the Division of Student Affairs;</li><li>Recommend and implement changes as required by the development and growth of the USU;</li><li>Create initiative and momentum towards service and operational improvement, and is responsible for developing a clear, future direction for the USU with the approval of the Board of Directors;</li><li>Establish a climate of high standards of performance for the USU and appropriate recognition of accomplishment;</li><li>Ensure that a strong customer service orientation prevails throughout the staff and leads by example;</li><li>Ensure that use of Clifton strengths® is cultivated within the organization in alignment with the Division of Student Affairs;</li><li>Carry out supervisory responsibilities in accordance with the USU’s policies and applicable laws;</li><li>Train and directly supervise the work of seven (7) full-time staff of the USU’s executive management team (Associate Executive Director, Equity, Programs &amp; Leadership; Associate Director, Accounting and Finance; Associate Director, Human Resources and Professional Development, Associate Director, Administration &amp; Communications; Associate Director, Operations and Services; and two (2) Co-Directors, Student Recreation Center) including monitoring performance; generating performance evaluations; and administering disciplinary action as needed;</li><li>Develop and evaluate the educational, cultural, social and recreational programs and services provided for a diverse student body and campus community using an equity-minded approach; develop effective models of innovative educational, social, recreational and cultural activities, programs and services which embrace the broad ethnic and cultural diversity of the campus community;</li><li>Administer and oversee all aspects of planning, development, and maintenance management of USU programs, services, and facilities including the University Student Union (USU) Student Recreation Center (SRC), Pride Center, Veterans Resource Center, DREAM Center, and Oasis Wellness Center;</li><li>Responsible for the overall coordination and integration of programs and services with other campus functions;</li><li>Advise students and staff on program and service development, continuous quality improvement, monitoring of goals and strategic priorities, and required changes for improvement;</li><li>Ensure the effective operation, maintenance, and renovation of the USU facilities and equipment; oversee the development of long-range renovation and maintenance plans; coordinate research, planning, and implementation processes for major capital enhancement and building construction projects;</li><li>Conduct periodic research into the needs and desires of the campus community for new, improved and innovative programs and services responsive to the needs of students;</li><li>Analyze results of programs and services to ensure that established objectives are accomplished;</li><li>Direct research and assessment of changing student demographics and campus trends to support program and/or facility design;</li><li>Negotiate and administer leases and contracts for the various services and businesses that occupy or use the USU facilities;</li><li>Lead the planning efforts for major facilities improvements;</li><li>Ensure the fiscal health, viability, and sustainability of the USU's financial structure;</li><li>Review projections of operating and capital investment requirements;</li><li>Present proposed annual operating, capital expenditure, repair and replacement and reserves budgets for review and approval by the Board of Directors and campus administration;</li><li>Develop long-term forecasts of future income, including student fees, and expenditures to guide the Board of Directors in its use of financial revenues;</li><li>Judiciously manage financial affairs to maximize long-term borrowing capability and to ensure long-term debt commitments can be covered without impairment to normal operations;</li><li>Negotiate and approve leases, operating agreements for various entities that occupy or utilize USU facilities;</li><li>Responsible for overseeing development and fundraising efforts in support of the organization, including developing and cultivating donor relationships and opportunities;</li><li>Responsible for the oversight and approval of expenditures from USU’s Foundation account and Veterans, LGBTQIA+, and undocumented Emergency Relief Funds and various USU scholarships;</li><li>Develop and recommend policies, objectives and operating plans to the USU Board of Directors;</li><li>Ensure that plans for the future development and growth of the USU are prepared and regularly present such plans for general review and approval by the Board of Directors;</li><li>Engage in a planning process, which solicits and is receptive to student, faculty and staff input regarding facilities, programs and services;</li><li>Implement policies and objectives approved by the Board, and develops procedures in accordance with Board policy;</li><li>Serve as a voting member and the Executive Secretary/Director of the Board of Directors;</li><li>Provide for the onboarding and development of the Board and individual directors; serves as a resource to the Board in preparing meeting agendas, staff reports, recommendations and strategies;</li><li>Ensure adequate staff coverage for Board and Committee meetings and that agenda and minutes are prepared in a timely manner;</li><li>Ensure compliance with University, CSU, and state and federal reporting requirements and regulations;</li><li>Consult with student leaders, university administrators, faculty, staff, alumni, professional colleagues, and community representatives on the development and evaluation of goals, programs and services of the USU;</li><li>Establish and maintain an effective system of communication with the USU Board and staff (leadership/staff management), other university departments and agencies, and the community at large;</li><li>Create and engage in strategic partnerships with campus departments, campus auxiliaries, faculty, staff, students, and alumni to create student-centered and equity-minded initiatives that focus on the development of a vibrant campus community to positively impact student retention, persistence, and graduation rates;</li><li>Articulate the broad purpose and needs of the USU to the campus community, and serves as the liaison and spokesperson for the USU in its relationship with the campus, the University, the Chancellor’s Office of the California State University (CSU), the community and professional organizations;</li><li>Perform other related duties as assigned.<br/><br/></li></ul>Qualifications<br/><br/><em>Education:<br/><br/></em>Master's degree in College Student Personnel Administration, Business Administration or a related field, or equivalent experience is required.<br/><br/>Experience<br/><br/>Minimum of ten years of experience in a senior managerial role, preferably in a college union or similar facility with a thorough knowledge of the principles of non-profit or public organizations, management, business and financial operations. Requires experience in a leadership position providing planning and direction to student affairs programs with a demonstrated ability to achieve objectives in a timely manner.<br/><br/>Must have a thorough understanding of the special demands of the academic environment with the ability to establish and maintain effective working relationships (including collaboration and appropriate consultation) with faculty, University administration, students, and the surrounding community. Knowledge of administration, organizational management, personnel management, budgeting, financial forecasting, and facilities management with a large, non-profit corporation is essential. Knowledge of a student development theory and practice, as well as understanding the role of the co-curricular involvement in the education of students and experience with student governance and organizations required. Ability to establish management goals, to facilitate change and implement innovative, equity-minded, and responsive programs and procedures.<br/><br/>Requires excellent verbal and written communication skills. Ability to compile, prepare, write, and review reports as well as the capacity to analyze, comprehend, and provide appropriate solutions to problems and courses of action.<br/><br/>Special Requirements<br/><br/>Not Applicable.<br/><br/>Preferred Qualifications<br/><br/><ul><li>Experience overseeing new construction and large renovation projects; conducting successful fundraising, development, and stewardship efforts in higher education</li><li>Understanding of or experience working in a diverse and inclusive education environment</li><li>Involvement in professional associations and organizations<br/><br/></li></ul>Knowledge, Skills And/or Abilities<br/><br/><ul><li>Strong knowledge of fiscal planning and control, budget development and monitoring</li><li>Working knowledge of the practices, procedures, and activities of college union facility operations</li><li>Strong knowledge of the principles of effective supervision</li><li>General knowledge of the methods and problems of organizational and program management</li><li>Ability to collect, analyze and evaluate data, draw valid conclusions, and to make verbal and/or written presentations on same and make decisions based on data</li><li>Ability to establish and maintain cooperative and collaborative working relationships with students, student organizations, staff, faculty, administrators, private and public agencies and donors</li><li>Ability to clearly express ideas and directions in English, both verbally and in writing</li><li>Ability to interpret and apply University and University Student Union rules and regulations</li><li>Ability to creatively and effectively analyze and solve problems</li><li>Ability to achieve assigned objectives within budget and desired time frames</li><li>Ability to work varying and unusual hours as necessary, including evenings and weekends</li><li>Ability to use a personal computer and various software programs including but not limited to Microsoft Word and Outlook</li><li>Ability to work independently and proceed with objectives without supervision</li><li>Demonstrated commitment to valuing justice, equity, diversity and inclusion, and contributing to an inclusive working and learning environment</li><li>Ability to analyze complex situations from a variety of perspectives that ultimately are mission-driven (focus on students) and also are cognizant of the needs of the University<br/><br/></li></ul>Working Conditions<br/><br/>Work is primarily performed in a temperature controlled on-site office environment or at an approved and appropriate workspace in the incumbent’s home. Must be able to work under pressure and adhere to deadlines. Must be adaptable to change. Regular contact with students, faculty, staff, administrators and the general public required.<br/><br/>Supervision Exercised<br/><br/>This position directly supervises Associate Executive Director, Equity, Programs &amp; Leadership; Associate Director, Accounting and Finance; Associate Director, Human Resources and Professional Development, Associate Director, Administration &amp; Communications; and Associate Director, Operations and Services, two (2) Co-Directors, Student Recreation Center. The position indirectly supervises all USU staff employees and part-time student assistant employees.<br/><br/>Mandated Reporter<br/><br/>The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.<br/><br/>Reporting Relationships<br/><br/>The Executive Director is a full-time, management employee of the University Student Union, Inc., a non-profit California corporation recognized as an approved auxiliary organization by the California State University.<br/><br/>The Executive Director is appointed by the President of California State University, Northridge upon the recommendation of the USU Board of Directors and the Vice President for Student Affairs and Dean of Students.<br/><br/>The Executive Director is accountable to the USU Board of Directors and reports administratively to the Assistant Vice President for Student Affairs, Equity and Inclusion.<br/><br/>The Executive Director is evaluated jointly by the USU Board of Directors and the Assistant Vice President for Student Affairs, Equity and Inclusion.<br/><br/>The Executive Director serves on the Student Affairs Management Council.<br/><br/>Pay, Benefits And Work Schedule<br/><br/>This position is employed through University Student Union (USU). The USU offers an excellent benefits package including Medical, Dental &amp; Vision insurance, Life Insurance, Vacation, Sick Leave, 14 paid Holidays, company sponsored retirement program and more.<br/><br/>The anticipated hiring range will be as follows and is dependent on experience and qualifications:<br/><br/>Annually: $ 165,000.00 - $215,000.00<br/><br/>The Salary Range Of The Position Is As Follows<br/><br/>Annually: Minimum: $143,325.00 Maximum: $257,985.00<br/><br/>HOURS: Full-Time; FLSA Exempt; may include early mornings, late evenings and weekends.<br/><br/>APPLICATION PERIOD<br/><br/>Applications received through June 30, 2024 will be considered in the initial review and review of applications will continue until position is filled.<br/><br/>In order to be considered in the initial review, applications must be submitted prior to the date listed above.<br/><br/>How To Apply<br/><br/>Candidates should apply by completing the on-line application. To submit an application and for more detailed information on the application and hiring process, please visit this link: www.csun.edu/careers<br/><br/>BACKGROUND CHECK<br/><br/>A background check (including a criminal records check) must be completed satisfactorily. Failure to satisfactorily complete the background check may affect the status of candidates who apply for the position.", "responsibilities": "<ul><li>Develop and maintain a strategic plan of corporate organization;</li><li>Establish policies and procedures to provide for adequate staff development and management of the USU;</li><li>Responsible for the development, assessment and refinement of annual organizational strategic priorities, long range plans, and student learning outcomes;</li><li>Ensure evaluation and assessment of USU services, operations, programs and facilities on an annual basis and oversees the overall program review of the USU and its operations as prescribed by the Division of Student Affairs;</li><li>Recommend and implement changes as required by the development and growth of the USU;</li><li>Create initiative and momentum towards service and operational improvement, and is responsible for developing a clear, future direction for the USU with the approval of the Board of Directors;</li><li>Establish a climate of high standards of performance for the USU and appropriate recognition of accomplishment;</li><li>Ensure that a strong customer service orientation prevails throughout the staff and leads by example;</li><li>Ensure that use of Clifton strengths® is cultivated within the organization in alignment with the Division of Student Affairs;</li><li>Carry out supervisory responsibilities in accordance with the USU’s policies and applicable laws;</li><li>Train and directly supervise the work of seven (7) full-time staff of the USU’s executive management team (Associate Executive Director, Equity, Programs &amp; Leadership; Associate Director, Accounting and Finance; Associate Director, Human Resources and Professional Development, Associate Director, Administration &amp; Communications; Associate Director, Operations and Services; and two (2) Co-Directors, Student Recreation Center) including monitoring performance; generating performance evaluations; and administering disciplinary action as needed;</li><li>Develop and evaluate the educational, cultural, social and recreational programs and services provided for a diverse student body and campus community using an equity-minded approach; develop effective models of innovative educational, social, recreational and cultural activities, programs and services which embrace the broad ethnic and cultural diversity of the campus community;</li><li>Administer and oversee all aspects of planning, development, and maintenance management of USU programs, services, and facilities including the University Student Union (USU) Student Recreation Center (SRC), Pride Center, Veterans Resource Center, DREAM Center, and Oasis Wellness Center;</li><li>Responsible for the overall coordination and integration of programs and services with other campus functions;</li><li>Advise students and staff on program and service development, continuous quality improvement, monitoring of goals and strategic priorities, and required changes for improvement;</li><li>Ensure the effective operation, maintenance, and renovation of the USU facilities and equipment; oversee the development of long-range renovation and maintenance plans; coordinate research, planning, and implementation processes for major capital enhancement and building construction projects;</li><li>Conduct periodic research into the needs and desires of the campus community for new, improved and innovative programs and services responsive to the needs of students;</li><li>Analyze results of programs and services to ensure that established objectives are accomplished;</li><li>Direct research and assessment of changing student demographics and campus trends to support program and/or facility design;</li><li>Negotiate and administer leases and contracts for the various services and businesses that occupy or use the USU facilities;</li><li>Lead the planning efforts for major facilities improvements;</li><li>Ensure the fiscal health, viability, and sustainability of the USU's financial structure;</li><li>Review projections of operating and capital investment requirements;</li><li>Present proposed annual operating, capital expenditure, repair and replacement and reserves budgets for review and approval by the Board of Directors and campus administration;</li><li>Develop long-term forecasts of future income, including student fees, and expenditures to guide the Board of Directors in its use of financial revenues;</li><li>Judiciously manage financial affairs to maximize long-term borrowing capability and to ensure long-term debt commitments can be covered without impairment to normal operations;</li><li>Negotiate and approve leases, operating agreements for various entities that occupy or utilize USU facilities;</li><li>Responsible for overseeing development and fundraising efforts in support of the organization, including developing and cultivating donor relationships and opportunities;</li><li>Responsible for the oversight and approval of expenditures from USU’s Foundation account and Veterans, LGBTQIA+, and undocumented Emergency Relief Funds and various USU scholarships;</li><li>Develop and recommend policies, objectives and operating plans to the USU Board of Directors;</li><li>Ensure that plans for the future development and growth of the USU are prepared and regularly present such plans for general review and approval by the Board of Directors;</li><li>Engage in a planning process, which solicits and is receptive to student, faculty and staff input regarding facilities, programs and services;</li><li>Implement policies and objectives approved by the Board, and develops procedures in accordance with Board policy;</li><li>Serve as a voting member and the Executive Secretary/Director of the Board of Directors;</li><li>Provide for the onboarding and development of the Board and individual directors; serves as a resource to the Board in preparing meeting agendas, staff reports, recommendations and strategies;</li><li>Ensure adequate staff coverage for Board and Committee meetings and that agenda and minutes are prepared in a timely manner;</li><li>Ensure compliance with University, CSU, and state and federal reporting requirements and regulations;</li><li>Consult with student leaders, university administrators, faculty, staff, alumni, professional colleagues, and community representatives on the development and evaluation of goals, programs and services of the USU;</li><li>Establish and maintain an effective system of communication with the USU Board and staff (leadership/staff management), other university departments and agencies, and the community at large;</li><li>Create and engage in strategic partnerships with campus departments, campus auxiliaries, faculty, staff, students, and alumni to create student-centered and equity-minded initiatives that focus on the development of a vibrant campus community to positively impact student retention, persistence, and graduation rates;</li><li>Articulate the broad purpose and needs of the USU to the campus community, and serves as the liaison and spokesperson for the USU in its relationship with the campus, the University, the Chancellor’s Office of the California State University (CSU), the community and professional organizations;</li><li>Perform other related duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Master's degree in College Student Personnel Administration, Business Administration or a related field, or equivalent experience is required.<br/><br/>Minimum of ten years of experience in a senior managerial role, preferably in a college union or similar facility with a thorough knowledge of the principles of non-profit or public organizations, management, business and financial operations. Requires experience in a leadership position providing planning and direction to student affairs programs with a demonstrated ability to achieve objectives in a timely manner.<br/><br/>Must have a thorough understanding of the special demands of the academic environment with the ability to establish and maintain effective working relationships (including collaboration and appropriate consultation) with faculty, University administration, students, and the surrounding community. Knowledge of administration, organizational management, personnel management, budgeting, financial forecasting, and facilities management with a large, non-profit corporation is essential. Knowledge of a student development theory and practice, as well as understanding the role of the co-curricular involvement in the education of students and experience with student governance and organizations required. Ability to establish management goals, to facilitate change and implement innovative, equity-minded, and responsive programs and procedures.<br/><br/>Requires excellent verbal and written communication skills. Ability to compile, prepare, write, and review reports as well as the capacity to analyze, comprehend, and provide appropriate solutions to problems and courses of action.", "preferred": "<ul><li>Experience overseeing new construction and large renovation projects; conducting successful fundraising, development, and stewardship efforts in higher education</li><li>Understanding of or experience working in a diverse and inclusive education environment</li><li>Involvement in professional associations and organizations<br/><br/></li></ul>"}, "skills": ["Fiscal Planning", "Budget Development", "Budget Monitoring", "College Union Facility Operations", "Supervision", "Organizational Management", "Program Management", "Data Analysis", "Data Evaluation", "Presentation Skills", "Communication Skills", "Problem Solving", "University Rules and Regulations", "Microsoft Word", "Microsoft Outlook", "Independent Work", "Equity", "Diversity", "Inclusion", "Customer Service"], "postedDate": "2 months ago", "benefits": "The USU offers an excellent benefits package including Medical, Dental &amp; Vision insurance, Life Insurance, Vacation, Sick Leave, 14 paid Holidays, company sponsored retirement program and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3935849774"}