{"jobTitle": "Part Time Sales Associate (Brick Specialist)", "company": {"name": "the LEGO Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative and Customer Service", "industry": "Manufacturing", "description": "BRINGING IT TO LIFE\n\n“The reason LEGO® exists is because of what they are doing for children around the globe. Everyone in the company, at all levels, feels privileged to be part of a company with such an inspiring vision”. VP of Operations in Americas & Pacific\n\nShare our commitment in providing an active hands-on experience that encourages imagination and creativity through in-store play. If you are confident that you have what it takes to succeed in this role -use the APPLY NOW button above or below.\n\nThe base salary for the position is $17.72 to $18.72. . Actual pay is determined based on a number of job-related factors including skills, education, training, credentials, experience, scope and complexity of role responsibilities, geographic location, performance, and working conditions\n\nWe strive to create a diverse, dynamic and inclusive culture of play at the LEGO Group, where everyone feels safe, valued and they belong.\n\nThe LEGO Group is proud to be an equal opportunity and an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nWe support our employees in being there for the moments that matter in life and celebrate families of all kinds, the loved ones that make us who we are. Being part of the LEGO Group also means taking part in our annual Play Day, playing a part in building a sustainable future and continuing our mission to “inspire and develop the builders of tomorrow.”\n\nThe LEGO Group is fully committed to Children’s Rights and Child Wellbeing across the globe. Candidates offered positions with high engagement with children are required to take part in Child Safeguarding Background Screening, as a condition of the offer.\n\nThank you for sharing our global commitment to Children’s Rights.\n\nBuild your career brick by brick at the LEGO Group.\n\nWe conduct drug screening as a part of our drug free workplace policy and in support of our commitment to the health and safety of our employees.\n\nOnline Application Accessibility Statement; which is intended for those with disabilities - LEGO systems endeavors to make www.LEGO.com/jobs accessible to any and all users. If you would like to contact us regarding the accessibility of our web site or need assistance completing the application process, please contact the HR Service Desk at 1.860.394.3769. Please note, these communication channels should be used for those having difficulty accessing our on-line channels, not to inquire about job opportunities\n\nWhat’s in it for you? Here are some of what to expect\n\nFamily Care Leave – We offer enhanced paid leave options for those important times.\n\nInsurances  – All colleagues are covered by our life and disability insurance which provides protection and peace of mind.\n\nWellness  – We want you to be your best self, so you’ll have access to the Headspace App and lots of wellbeing initiatives and programs run by local teams where you are based.\n\nColleague Discount – We know you'll love to build so from day 1 you will qualify for our generous colleague discount.\n\nBonus – We do our best work to succeed together. When goals are reached, you’ll be rewarded through our global bonus scheme.\n\nJoin the global LEGO® team\n\nWe strive to create a diverse, dynamic and inclusive culture of play at the LEGO Group, where everyone feels safe, valued and they belong.\n\nThe LEGO Group is proud to be an equal opportunity and an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nWe support our employees in being there for the moments that matter in life and celebrate families of all kinds, the loved ones that make us who we are. Being part of the LEGO Group also means taking part in our annual Play Day, playing a part in building a sustainable future and continuing our mission to “inspire and develop the builders of tomorrow.”\n\nThe LEGO Group is fully committed to Children’s Rights and Child Wellbeing across the globe. Candidates offered positions with high engagement with children are required to take part in Child Safeguarding Background Screening, as a condition of the offer.\n\nThank you for sharing our global commitment to Children’s Rights.\n\nBuild your career brick by brick at the LEGO Group.\n\nWe conduct drug screening as a part of our drug free workplace policy and in support of our commitment to the health and safety of our employees.\n\nOnline Application Accessibility Statement; which is intended for those with disabilities - LEGO systems endeavors to make www.LEGO.com/jobs accessible to any and all users. If you would like to contact us regarding the accessibility of our web site or need assistance completing the application process, please contact the HR Service Desk at 1.860-763-7777, option #3. Please note, these communication channels should be used for those having difficulty accessing our on-line channels, not to inquire about job opportunities.", "postedDate": "2 weeks ago", "salary": {"amount": "17.72 to 18.72", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3935381462"}