{"jobTitle": "Human Resources Business Partner", "company": {"name": "System1", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000 -$150,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Software Development, Online Audio and Video Media, and IT Services and IT Consulting", "description": "We’re looking for a Human Resources Business Partner to work out of our headquarters, located in Marina Del Rey, California.   As the Business Partner you will support our business and ensure our amazing culture can scale as we grow and evolve.  Our vision of this role is someone who can be a partner for our business leaders while also being a strong advocate for our employees and culture. You’ll be responsible for aligning business objectives with employees and management in the business areas you support. Your insights will help drive HR initiatives that support the business goals and deliver real value to the business and our people.  Your partnerships with business leaders will create alignment between the People Team and our employees across geographies and business units that ensure we can deliver on our company objectives.  In short, you’ll be a difference maker at System1!", "responsibilities": "You’ll provide coaching and counsel to business leaders on all aspects of managing and leading high performing, highly engaged teams. You’re a change agent, ensuring adoption of People team programs and processes within the business units you support. You look around the corner and identify people's risks, analyzing trends and metrics that could impact the business and work with management and employees to mitigate. You’re an amazing partner and build high trust relationships that allow you to work with managers on people decisions, ensuring we can attract and retain top talent. You quickly handle and resolve any employee relations issues that may arise. You socialize and get buy-in on People Team practices, helping managers understand      the “why” behind decisions so that they can better adopt and support their employees      . You provide guidance and input on organizational design including business unit restructures, workforce planning and succession planning.", "qualifications": {"required": "4 + years of client-facing HR experience. Bachelor’s degree, preferably in Human Resources, Business, or related field. Coaching and consulting skills, PHR/SHRM-CP or SPHR/<em> </em>SHRM-SCP required; PHR CA certification highly preferred. Business acumen - to build and develop solid understanding of functional business groups. Demonstrated ability to exercise sound judgement and handle confidential information and conversations appropriately and with care. Prior experience working in a high growth, start-up environment is desirable. Thrive in a fast-paced environment with the ability to pivot and problem-solve. Excellent communication skills (written and oral) with good interpersonal skills and ability to develop and foster peer-to-peer relationships with partner counterparts and internal team members. Ability to work onsite in the office five days a week.", "preferred": ""}, "skills": ["HR", "Business", "Coaching", "Consulting", "PHR", "SHRM", "Business Acumen", "Confidentiality", "Start-up Environment", "Communication", "Interpersonal Skills"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The U.S. base salary range for this full-time position is $100,000 -$150,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in U.S. role postings reflect the base salary only, and do not include bonus, equity, or benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3935021223"}