{"jobTitle": "Casa Cucinelli Manager - LA", "company": {"name": "Brunello Cucinelli", "industry": "Retail Luxury Goods and Jewelry, Retail, and Retail Apparel and Fashion"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Product Management", "industry": "Retail Luxury Goods and Jewelry, Retail, and Retail Apparel and Fashion", "description": "About us:\n\n\"Those who work with us take part in the company’s life. Everybody knows that their work is an indispensable contribution to our shared growth \" \n– Brunello Cucinelli\n\n\nBrunello Cucinelli, founded in 1978 by the eponymous designer and entrepreneur, is an Italian house operating in the absolute luxury sector, specializing in cashmere and the international informal luxury ready-to-wear sector. As a perfect blend of industry and craftsmanship, our products are designed to stand the test of time. The whole world is fascinated by the products of our country, by the careful selection of raw materials, and the search for the highest quality and creativity in every step of the production chain. Today, the Brunello Cucinelli company finds its true meaning and aesthetic pursuit in manual skills, craftsmanship and the exclusivity of its collections. They are the truest expression of humanity and of creativity and, as such, are fundamental to us.\n\n\nWho You Are: \nThe Casa Cucinelli Manager will continue to ensure a unique, refined, customized and seamless experience combining hospitality, concierge and individualized relationship efforts in accordance with our brand standards and ethos.\n\n\nWhat You’ll Do:\n\n* Provide an at-home luxurious and curated experience for our friends of the brand\n* Responsible for presenting food and beverage programming for the Casa Cucinelli space, including catering for events and small dining experiences for 1v1 appointments\n* Partner with commercial teams (buying, merchandising, wholesale and retail teams) to ensure seamless well rounded, impactful appointments\n* Comfortability working hands-on with product, styling, and overall merchandising acumen\n* Maintain and manage the flow of appointments and scheduling, including bookings, confirmation, and communications with key partners (internal and external)\n* Ensure that all elements of brand integrity are protected and the day-to-day operations and management of Casa Cucinelli are maintained and curated to the highest level of brand standards.\n* Manage stock and sample movement with pristine accuracy\n* Ability to anticipate based on clients needs, travel and business plans, etc to ensure a smooth flow of appointments throughout each day and ensure optimal client service and impactful desired results\n* Foster and develop relationships with hotels and restaurant spaces within North America\n* In conjunction with multi and monobrand marketing managers support with accommodations and dining reservations for brand events\n* Maintain an executive presence as a representative of the brand, including seasonal presentations, networking with high-level individuals and professionals, and executive members of the Brunello Cucinelli brand\n\n\nQualifications:\n\n* Bachelors Degree Required\n* 5-8 years of professional experience, luxury retail environment preferred\n* Strong problem-solving, ability to think on your feet, and creative approach to managing business\n* Ability to work in a high-volume, fast-paced environment\n* Proven ability to cultivate relationships with clients and internal partners\n* Client service and results-oriented, always continuing to learn, understand the overall business needs and stay ahead of sales trends\n* Strong sense of personal integrity, initiative, and curiosity.\n* Proven ability to effective communicate both verbally and written\n* Strong affinity for the Brunello Cucinelli brand\n* Passionate driven, and motivated by product.\n* Strong computer skills, specifically MS Office Suite (Excel, Word, Power Point and Outlook.)\n* Ability to work in a growing and entrepreneurial team environment.\n\n\nEEOC \n\nBrunello Cucinelli is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status, or any other characteristic protected by law.\n\nAs required by Los Angeles salary transparency law, effective November 2022, the expected base salary for this position ranges from $90,000-$100,000. Various factors are considered when extending offers, such as relevant skillset, training, years of experience related to the current job description, education, and our organizational structure. In addition to the base salary, Brunello Cucinelli offers a competitive benefits package that includes health and dental insurance, life insurance, disability insurance, 401K, paid holidays, a generous paid time-off policy, and career opportunities within a dynamic team.", "responsibilities": "The Casa Cucinelli Manager will continue to ensure a unique, refined, customized and seamless experience combining hospitality, concierge and individualized relationship efforts in accordance with our brand standards and ethos.\n\n* Provide an at-home luxurious and curated experience for our friends of the brand\n* Responsible for presenting food and beverage programming for the Casa Cucinelli space, including catering for events and small dining experiences for 1v1 appointments\n* Partner with commercial teams (buying, merchandising, wholesale and retail teams) to ensure seamless well rounded, impactful appointments\n* Comfortability working hands-on with product, styling, and overall merchandising acumen\n* Maintain and manage the flow of appointments and scheduling, including bookings, confirmation, and communications with key partners (internal and external)\n* Ensure that all elements of brand integrity are protected and the day-to-day operations and management of Casa Cucinelli are maintained and curated to the highest level of brand standards.\n* Manage stock and sample movement with pristine accuracy\n* Ability to anticipate based on clients needs, travel and business plans, etc to ensure a smooth flow of appointments throughout each day and ensure optimal client service and impactful desired results\n* Foster and develop relationships with hotels and restaurant spaces within North America\n* In conjunction with multi and monobrand marketing managers support with accommodations and dining reservations for brand events\n* Maintain an executive presence as a representative of the brand, including seasonal presentations, networking with high-level individuals and professionals, and executive members of the Brunello Cucinelli brand", "qualifications": {"required": "Bachelors Degree Required\n5-8 years of professional experience, luxury retail environment preferred\nStrong problem-solving, ability to think on your feet, and creative approach to managing business\nAbility to work in a high-volume, fast-paced environment\nProven ability to cultivate relationships with clients and internal partners\nClient service and results-oriented, always continuing to learn, understand the overall business needs and stay ahead of sales trends\nStrong sense of personal integrity, initiative, and curiosity.\nProven ability to effective communicate both verbally and written\nStrong affinity for the Brunello Cucinelli brand\nPassionate driven, and motivated by product.\nStrong computer skills, specifically MS Office Suite (Excel, Word, Power Point and Outlook.)\nAbility to work in a growing and entrepreneurial team environment.", "preferred": ""}, "skills": ["Problem Solving", "Client Service", "Communication", "Retail", "Luxury", "Hospitality", "Merchandising", "Sales", "Microsoft Office", "Excel", "Word", "PowerPoint", "Outlook"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "In addition to the base salary, Brunello Cucinelli offers a competitive benefits package that includes health and dental insurance, life insurance, disability insurance, 401K, paid holidays, a generous paid time-off policy, and career opportunities within a dynamic team.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3936724744"}