{"jobTitle": "Associate Creative Director - Art", "company": {"name": "Klick", "location": "Philadelphia, PA"}, "location": "Philadelphia, PA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Advertising Services", "description": "Meet a different kind of workplace. Klick Health is an ecosystem of brilliant minds working to realize the full potential of their people and clients in life sciences since 1997. And we’re still growing fast, even after two decades. What does that mean for you? As Klick experiences exponential growth year-over-year, so do the people who help make it happen. Because we’re constantly evolving and changing, we invest in talent early and often, to develop future leaders at all levels. We’re one of the country’s Top 10 Great Workplaces, 10 Most Inspiring Cultures, Best Workplace for Innovators, Best Managed, and Fastest Growing. We know that career paths are seldom simple and straightforward. And that's an asset. If you feel like you'd be a good fit for this role, we encourage you to apply and take the first steps to starting your career journey at Klick!<br/><br/>About Our Creative Craft<br/><br/>The Creative team features an incredible array of experienced, fearless, smart visionaries, capable in all media and technologies, and united by a common goal: to build brands that solve a human need. It requires hard work, a healthy dose of imagination, and a passion for craft to make work that stands out in the world. We’ve got super-smart, friendly, and caring people who put their hearts and souls into the clever work that they create for our clients in order to deliver thoughtful creative messaging to the patients they serve. And the best part? We have a ton of fun while doing it.<br/><br/>Role Title: Associate Creative Director - Art<br/><br/>Reports to: VP, Creative Director or VP, Group Creative Director<br/><br/>Role Description And Expectations<br/><br/>The Associate Creative Director, Art oversees the art team from inception to final product and ensures quality of content and style to meet the client’s marketing strategies and objectives with their copy partner; they are a brand leader who solves strategic and creative issues with the client while enhancing the client’s confidence in the agency. As a leader the Associate Creative Director manages and mentors a team of creatives that report to them and as needed on projects while simultaneously managing a heavy workload. In this role, the Associate Creative Director must have an advanced understanding of Klick Health departmental procedures such as routing, print production, protocols, usage rights of stock, images for layout, as well as other internal procedures and solutions practiced by our creative craft.<br/><br/>Key Accountabilities:<br/><br/><ul><li>Brings knowledge of product, market &amp; position ensures sound strategic planning, timely &amp; accurate implementation, good service, financial control and a solid client relationship</li><li>Full understanding of client’s marketplace and can evaluate work in light of current marketing environment and trends</li><li>Possesses the ability to take abstract concepts and empower project teams to create cutting-edge concepts or designs that are user-friendly, representative of the client's goals, and within brand guidelines</li><li>Contributes innovative ideas appropriate to the client’s marketing strategy that challenge the status quo</li><li>Leads and contributes in brainstorming sessions with stakeholders across meetings</li><li>Proactively anticipates and solves creative problems and makes effective recommendations to Creative Directors</li><li>Leads creative teams in the execution of ideas to a high standard of creative excellence </li><li>Provide feedback on creative approaches to communicate the client’s message about the product for both the overall campaign</li><li>Oversees creation of rough concepts for presentation to client, developing them into compelling and captivating presentations; presents them in an organized, professional, and effective style to clients</li><li>Helps set priorities and manages workloads so that assignments are completed within agreed upon time frames</li><li>Responsible for growing existing brands and participating in new business to generate additional revenue</li><li>Supervises and participates in all concept work for brands and new business pitches</li><li>Fosters an environment of diversity and inclusion on the team</li><li>Manages and mentors direct reports on multiple brands; coaches, challenges, and provides opportunities for growth</li><li>Sets expectations for the team and communicates and follows up when standards are not being met</li><li>Develops goals with each direct report and conducts performance reviews and regular 1:1s to provide coaching, support career plans, and provide learning opportunities that aligns people's growth to craft's people strategy</li><li>Demonstrates the ability to hire and retain highly capable people</li><li>Demonstrates full understanding of how budgets and schedules are applied for financial management</li><li>Develops strong relationships with all cross discipline leads</li><li>Advances knowledge and craft expertise in copy, developing into a well-rounded creative</li><li>Develops and seeks cross discipline learning from colleagues and vendors to ensure highest quality product within specified deadlines</li><li>Shares experience and knowledge of the industry</li><li>Invests in staying at the cutting edge of craft<br/><br/><br/></li></ul>Skills &amp; Knowledge:<br/><br/><ul><li>Must be able to demonstrate effective oral and written communications skills</li><li>Strong interpersonal and collaboration skills</li><li>Exhibits sound judgment and decisive problem solving ability</li><li>Ability to work well within a team setting</li><li>Ability to build client rapport and trust</li><li>Established presentation skills </li><li>Managerial and leadership skills</li><li>Deep understanding of product challenges in relation to overall market</li><li>Complete understanding of market trends and marketing briefs</li><li>In-depth understanding of the assigned account, treatment category, clinical developments, and relevant physician specialties</li><li>Computer proficiency; solid knowledge of design programs <br/><br/><br/></li></ul>Education:<br/><br/><ul><li>Bachelor’s Degree in Advertising/Visual Communications, Graphic Design or related discipline preferred<br/><br/><br/></li></ul>Experience:<br/><br/><ul><li>10+ years of experience in marketing/advertising business experience preferred</li><li>Comfort with and enthusiasm for integrating AI into your work<br/><br/><br/></li></ul>What makes Klick different?<br/><br/>You’ll work on numerous multi-million dollar brands—the size and breadth of the accounts here are incomparable to most agencies. We believe in putting our people first, and always make that our priority. This and our other timeless principles have made all the difference in our over two decades of success. By having an entrepreneurial spirit, playing the long game, considering outcomes over optics, and solving challenging problems through our hacker roots, we live our difference in all that we do. You’ll get to experience a high level of trust and be given the freedom to make decisions, judgment calls, and function with autonomy. If you have an idea, run with it! You’ll be encouraged to let your entrepreneurial spirit flourish and you’ll work with incredible teams that you can learn from, contribute to, and who will support you every step of the way!<br/><br/><em>Klick is consciously creating a culture where everyone can thrive and grow in their careers. We believe that our best work comes from our diverse backgrounds, perspectives, and skills. We strongly encourage members of historically underrepresented communities to apply, including Black people, Indigenous peoples, and other people of colour, people with disabilities, people from gender and sexually diverse communities and people with intersectional identities.<br/><br/></em><em>We’re also committed to developing an inclusive, barrier-free recruitment process and work environment. Should you require any accommodation, please contact us at careers@klick.com and we will work with you to meet your accessibility needs and ensure you have a positive experience.<br/><br/></em>", "postedDate": "1 day ago", "skills": ["AI", "Marketing", "Advertising", "Design", "Graphic Design", "Creative Direction", "Brand Management", "Client Management", "Team Leadership", "Mentoring", "Communication", "Problem Solving", "Presentation Skills", "Market Research", "Marketing Strategy", "Budget Management", "Project Management", "Collaboration", "Interpersonal Skills", "Computer Proficiency", "Design Programs"], "url": "https://www.linkedin.com/jobs/view/3936890669"}