{"jobTitle": "Principal Planner", "company": {"name": "City of Costa Mesa", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Strategy/Planning", "industry": "Architecture and Planning", "description": "The City of Costa Mesa, renowned as the “City of the Arts”, is offering an exciting career opportunity for a Principal Planner position to join our hardworking and talented Planning Division team. The Planning Division is part of the Economic and Development Services Department and is responsible for implementing and updating the regulations of the City's Zoning Code and the goals and policies of the City's General Plan. If you are passionate about engaging the community and ready to address the City's diverse housing needs, this could be the perfect opportunity for you! You will be working in a collaborative and supportive work environment to make a positive impact in the community by playing a key role in implementing City Council priorities and upholding community values.<br/><br/><strong>The Position<br/><br/></strong>Under general direction, plans, organizes, oversees, directs, administers, supervises, and coordinates the work of a planning section staffed by professional, technical and clerical subordinates; presents and justifies staff recommendations to management, committees, commissions, City Council, and community groups; coordinates planning activities with other sections, divisions and departments; other work as required.<br/><br/>To view the full job description which includes list of Essential Functions, please click on the following link: <strong>Principal Planner</strong> .<br/><br/><strong>Upcoming Programs And Goals You Will Be Part Of<br/><br/></strong><ul><li>The preparation and implementation of the City's first Inclusionary Housing Ordinance;</li><li>Update of the City's Density Bonus Provisions;</li><li>Preparation and implementation of a short-term rentals program;</li><li>Update of the City's commercial and residential parking standards;</li><li>The redevelopment of an approximate 102-acre property with a new mixed use, mixed income community;</li><li>Update of the City's Specific Plans, Urban Plans, and overlays;</li><li>Development of an affordable senior housing project at the City's Senior Center;</li><li>Update of the City's zoning standards to address opportunities for motel conversions, efficiency units and co-living housing in the City.<br/><br/></li></ul><strong>Class Characteristics<br/><br/></strong>Work assigned to this position involves the application of specialized knowledge in supervising planning projects and studies for a work section. This position may be assigned to the current planning, long range planning, or economic development work sections. An incumbent exercises considerable judgment and initiative in scheduling and assigning work, establishing work plans and priorities, and coordinating work with that of other sections, divisions or departments. Formal supervision is exercised over professional, technical and clerical staff. This class is distinguished from the class of Senior Planner by the weight of accountability for the number and complexity of functions performed and by formal supervisory responsibilities. Assignments are broad in scope and require the use of considerable independent judgment in making technical decisions and guiding work to completion. Work is reviewed through meetings and reports for results achieved, completeness, professional competence, timeliness, and adherence to Department priorities, direction, and pertinent policies, procedures and regulations.<br/><br/><strong>Application And Selection Process<br/><br/></strong>Applications must be completed and submitted online. This recruitment will remain open until filled and may close without prior notice, therefore prompt application is encouraged.<br/><br/><strong>First Application Review Date: June 27, 2024<br/><br/></strong><strong> There is currently one (1) full-time Principal Planner vacancy. <br/><br/></strong>The City is also recruiting for a Senior Planner. To apply for that position, please click here: Senior Planner<br/><br/>Candidates are requested to provide specific information regarding their education and experience as it relates to the position by submitting a <strong>complete and comprehensive resume with their application, supplemented with an </strong> <strong> attachment of a staff report or special project that was prepared for the City Council, Planning Commission, and other boards and commissions </strong> . <strong>Application packets that do not have a resume and staff report/project attached will be considered incomplete and will not be reviewed.</strong> No additional attachments will be accepted. If selected to proceed in the selection process, an opportunity to provide further work samples, letters of recommendation, etc. will be appropriate during the interview process.<br/><br/>Based upon the information presented on the application and resume, a limited number of candidates who possess qualifications most pertinent to the position will be invited to participate in the selection process. The selection process may include but is not limited to the following components: application review and evaluation, written examination or exercise, physical examination, practical exercise and interview evaluation. Please notify the Human Resources Division 72 hours in advance of the test date if you have a disability which requires accommodation for the testing process. The eligibility list will be in effect for one (1) year, unless exhausted sooner. The eligibility list from this recruitment may be utilized to fill lower-level vacancies which occur during the life of the list.<br/><br/>It is recommended you use a personal email address on your application instead of a work email address . Notifications during this recruitment will be sent by email only (regardless of the notification preference selected during the on-line application process). Notifications will be sent to the email address that is listed on your online application.<br/><br/>All employment offers made by the City are contingent upon establishing proof of a prospective candidate's legal authorization to work in the United States and successfully passing all components of the pre-employment process which may include, but is not limited to: comprehensive background check, criminal history check (Live Scan fingerprint check), polygraph examination, post-offer psychological evaluation and post-offer medical evaluation (may include drug screen).<br/><br/>Note: The provisions of this job bulletin do not constitute an expressed or implied contract. Any provisions contained within may be modified or revoked without notice.<br/><br/><strong>Qualification Guidelines<br/><br/></strong><strong>Education, Training And/Or Experience<br/><br/></strong>A typical way to obtain the requisite knowledge and abilities to perform the duties and responsibilities of this classification is as follows:<br/><br/>Graduation from an accredited four-year college or university with major course work in urban planning, public administration, architecture, economics, geography or a related field. A master's degree in a related field is preferred.<br/><br/>Five years of progressively responsible professional experience in urban planning preferably encompassing both long range and current planning activities. Public agency experience including direct experience working independently and administering complex development projects, special studies, Subdivision Map Act, General Plan and Municipal Codes is also required. Experience with CEQA/NEPA compliance and Geographic Information Systems (GIS) is preferred. Previous supervisory experience is also preferred.<br/><br/>An equivalent combination of education and relevant experience that provides the desired knowledge, skills and abilities to successfully perform essential functions may also be considered.<br/><br/><strong>License And/Or Certificate<br/><br/></strong>Certification by the American Institute of Certified Planners (AICP) is preferred.<br/><br/><strong>Requisite Knowledge And Skill Levels<br/><br/></strong>Considerable knowledge of the principles and practices of urban planning; laws and ordinances applicable to urban planning, community development, economic development, and zoning processes; and research methods and sources of information related to urban growth and development.<br/><br/>Knowledge of the principles of supervision, work organization, and personnel management.<br/><br/>Knowledge of economics, statistics and elementary demographics.<br/><br/>Skill in exercising management and budgetary principles and practices.<br/><br/><strong>Requisite Abilities<br/><br/></strong>Ability to supervise and perform complex technical research on economic, engineering, transportation, zoning, redevelopment, environmental impact, urban design and sociological problems as part of the planning process.<br/><br/>Ability to communicate effectively, both orally and in writing, and present technical information succinctly in an interesting manner.<br/><br/>Ability to analyze and supervise the systematic compilation of technical and statistical data and to prepare complex reports.<br/><br/>Ability to establish and maintain effective working relationships with intra and interdepartmental staff, city officials, representatives of other government agencies, community leaders, and the general public.<br/><br/>Ability to plan, organize and supervise the work of professional, technical and clerical personnel.<br/><br/>Ability to coordinate planning or development activities with other City sections, divisions, departments, land developers and other outside individuals.<br/><br/>Ability to comprehend and apply laws, regulations and policies related to municipal planning or redevelopment.<br/><br/>Ability to analyze a variety of administrative problems in the section and make sound policy and procedural decisions as to their solution.<br/><br/><strong>Supplemental Information<br/><br/></strong><strong>Public Employee Disaster Service Worker<br/><br/></strong>In accordance with Government Code Section 3100 - all City of Costa Mesa employees are required to perform assigned disaster service worker duties in the event of an emergency or a disaster.<br/><br/><strong>Physical Tasks And Environmental Conditions<br/><br/></strong>Please contact Human Resources for a summary of the essential tasks and environmental factors for this classification.<br/><br/>Employee accommodations for physical or mental disabilities will be considered on a case-by-case basis.<br/><br/><strong>Equal Opportunity Employer<br/><br/></strong>The City of Costa Mesa is an Equal Opportunity Employer.<br/><br/>To view benefit information for all groups, Click Here<br/><br/>New employees contribute 9% of their salary on a pre-tax basis towards the 2%@60 or 2%@62 CalPERS retirement formula depending on eligibility.<br/><br/><strong>Employees Receive The Following Health Insurance Flexible Benefits Contribution<br/><br/></strong><ul><li>Current: $1,600monthly </li><li>Effective January 2025: $1,650monthly<br/><br/></li></ul>The City does not participate in the Social Security system; however, federal mandate requires new employees to contribute 1.45% of wages to Medicare. As a condition of employment, all new employees are required to enroll and participate in the direct deposit program.<br/><br/>Closing Date/Time: Continuous", "responsibilities": "Under general direction, plans, organizes, oversees, directs, administers, supervises, and coordinates the work of a planning section staffed by professional, technical and clerical subordinates; presents and justifies staff recommendations to management, committees, commissions, City Council, and community groups; coordinates planning activities with other sections, divisions and departments; other work as required.", "qualifications": {"required": "Graduation from an accredited four-year college or university with major course work in urban planning, public administration, architecture, economics, geography or a related field. A master's degree in a related field is preferred.<br/><br/>Five years of progressively responsible professional experience in urban planning preferably encompassing both long range and current planning activities. Public agency experience including direct experience working independently and administering complex development projects, special studies, Subdivision Map Act, General Plan and Municipal Codes is also required. Experience with CEQA/NEPA compliance and Geographic Information Systems (GIS) is preferred. Previous supervisory experience is also preferred.<br/><br/>An equivalent combination of education and relevant experience that provides the desired knowledge, skills and abilities to successfully perform essential functions may also be considered.", "preferred": "Certification by the American Institute of Certified Planners (AICP) is preferred."}, "skills": [], "postedDate": "2 months ago", "salary": {"amount": "57.29/hr - 76.78/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3936029513"}