{"jobTitle": "Stockroom Associate II- Beverly Center", "company": {"name": "Coach", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales, Other, and Customer Service", "industry": "Retail Apparel and Fashion, Manufacturing, and Retail", "description": "Coach is a global fashion house founded in New York in 1941. Inspired by the vision of Creative Director Stuart Vevers and the inclusive and courageous spirit of our hometown, we make beautiful things, crafted to last—for you to be yourself in.<br/><br/>Coach is part of the Tapestry portfolio – a global house of brands committed to stretching what’s possible.<br/><br/>A member of the Tapestry family, we are part of a global house of brands that has unwavering optimism and is committed to being innovative and wholly inclusive. Visit <strong>Our People </strong>page to learn more about Tapestry's commitment to equity, inclusion, and diversity.<br/><br/><strong>Sales Support AssociateJob Description<br/><br/></strong>The Sales Support Associate role is an integral part of the store’s overall success and efficiency; demanding directattention to our brand commitment when servicing our customers. Leaving a lasting impression on our customersthrough friendly, efficient interactions at our cash wrap and a well-maintained sales floor. Accurate and effectivework, supporting the flow of product from the moment of receipt through the point of sale is essential to this role.<br/><br/><strong>Cash Wrap<br/><br/></strong>Sample of tasks required of role:<br/><br/><ul><li> Greeting the customer with a smile and with eye contact and offering your name</li><li> Interact genuinely and naturally with the customer</li><li> Read cues and determine customers’ needs</li><li> Conduct email/name capture, where permitted by law</li><li> Maintain accuracy when operating POS</li><li> Maintain cash wrap organization and cleanliness</li><li> Suggest multiple add‐ons and sell gift cards</li><li> Maintain cash and POS media accurately and in compliance with Coach policy</li><li> Create lasting impression by genuinely thanking customer and provide reason to return</li><li> Represent Coach brand appropriately<br/><br/></li></ul><strong>Stockroom / Warehouse<br/><br/></strong><ul><li> Receive shipment and transfers</li><li> Notify Store Management when new product arrives</li><li> Scan cartons/transfers, verifying store information is correct</li><li> Communicate all discrepancies to Store Management</li><li> Process shipment/transfers according to Coach standards and timeframes</li><li> Organize and clean stock room daily; to include offsite / remote warehouse as applicable</li><li> Shift/organize product in the stockroom; react to sell through and make room for new product</li><li> Manage stock levels/product ownership in back-of-house and sales floor</li><li> Prepare and conduct regular cycle counts, as directed</li><li> Participate in store physical inventory counts, as scheduled</li><li> Maintain Company Loss Prevention standards<br/><br/></li></ul><strong>Sales Floor<br/><br/></strong><ul><li> Regularly analyze sales floor to assess replenishment needs</li><li> Replenish sales floor/assigned zone</li><li> React to sell through and execute visual merchandising needs.</li><li> Support sales floor activities, as directed</li><li> Effectively communicate information pertaining to price points, features/benefits, color and stockavailability to multiple customers</li><li> Respond to customer requests confidently; partner with sales team or Store Management, when needed</li><li> Upkeep housekeeping standards<br/><br/></li></ul><strong>Competencies Required<br/><br/></strong><ul><li> Drive For Results: Can be counted on to exceed goals successfully. Is consistently one of the topperformers. Very bottom line oriented. Steadfastly pushes self and others for results.</li><li> Customer Focus: Is dedicated to meeting the expectations and requirements of internal and externalcustomers. Gets first hand customer information and uses it for improvements in products and services.Acts with customers in mind. Establishes and maintains effective relationships with customers and gains their trust and respect.</li><li> Creativity: Comes up with a lot of new and unique ideas. Easily makes connections among previouslyunrelated notions. Tends to be seen as original and value-added in brainstorming settings.</li><li> Interpersonal Savvy: Relates well to all kind of people up down and sideways. Inside and outside theorganization. Builds rapport. Builds constructive and effective relationships. Uses diplomacy and tact. Candiffuse even high tension situations comfortably.</li><li> Learning on The Fly: Learns quickly when facing new problems. A relentless and versatile learner. Open tochange. Analyzes both successes and failures for cues to improve, experiments and will try anything to findsolutions. Enjoys the challenge of unfamiliar tasks. Quickly grasps the essence and underlying structure ofanything.</li><li> Perseverance: Pursues everything with energy, drive and a need to finish. Seldom gives up on anythingbefore finishing, especially in the face of resistance or setbacks.</li><li> Dealing with Ambiguity: Can effectively cope with change. Can shift gears comfortably. Can decide to actwithout having the total picture. Does not get upset when things are up in the air. Doesn’t have to finishthings before moving on. Can comfortably handle risk and uncertainty.<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong>Experience: 1- 3 years of previous retail experience (cashier/stock experience, sales etc.), preferably in a luxuryretail service environment. Possesses current knowledge of fashion trends and competition in the marketplace.<br/><br/>Education: High school diploma or equivalent; college degree preferred.<br/><br/>Technical: Knowledge of cash register systems, basic computer skills (including the ability to use iPad/laptop,Mobile POS and Internet), utilize walkie talkie, understand and read price and product release sheets.<br/><br/>Physical: Ability to execute at a fast pace. Ability to communicate effectively with customers and team. Ability tomaneuver the sales floor, sales shelves, and stock room; climbing, bending, and kneeling are required. Ability tofrequently lift and carry up to 25 pounds and, at times, lift and carry product/cartons up to 50 pounds to processproduct shipment/transfers.<br/><br/>Schedule: Ability to meet Coach Scheduling &amp; Availability Expectations, including ability to work a flexibleschedule, including nights, weekends, and holidays high retail traffic and sales days (including but not limited to theday after Thanksgiving, Memorial Day, Christmas Eve, Mother’s Day, etc.).<br/><br/>Note: This document serves only as a sample of job duties and responsibilities and does not include an exhaustivelist of all performance requirements.<br/><br/>Tapestry, Inc., parent company of the Coach brand, is an equal opportunity and affirmative action, employer and wepride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring,promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’squalifications as they relate to the requirements of the position under consideration. These decisions are madewithout regard to age, sex, sexual orientation, gender identity or expression, genetic characteristics, race, color,creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy,or any other legally-recognized protected basis prohibited by applicable law. Visit Coach at www.coach.com.<br/><br/><strong>Our Competencies for All Employees<br/><br/></strong><ul><li>Courage: Doesn’t hold back anything that needs to be said; provides current, direct, complete, and “actionable” positive and corrective feedback to others; lets people know where they stand; faces up to people problems on any person or situation (not including direct reports) quickly and directly; is not afraid to take negative action when necessary.</li><li>Creativity: Comes up with a lot of new and unique ideas; easily makes connections among previously unrelated notions; tends to be seen as original and value-added in brainstorming settings.</li><li>Customer Focus: Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.</li><li>Dealing with Ambiguity: Can effectively cope with change; can shift gears comfortably; can decide and act without having the total picture; isn’t upset when things are up in the air; doesn’t have to finish things before moving on; can comfortably handle risk and uncertainty.</li><li>Drive for Results: Can be counted on to exceed goals successfully; is constantly and consistently one of the top performers; very bottom-line oriented; steadfastly pushes self and others for results.</li><li>Interpersonal Savvy: Relates well to all kinds of people, up, down, and sideways, inside and outside the organization; builds appropriate rapport; builds constructive and effective relationships; uses diplomacy and tact; can diffuse even high-tension situations comfortably.</li><li>Learning on the Fly: Learns quickly when facing new problems; a relentless and versatile learner; open to change; analyzes both successes and failures for clues to improvement; experiments and will try anything to find solutions; enjoys the challenge of unfamiliar tasks; quickly grasps the essence and the underlying structure of anything.<br/><br/></li></ul><strong>Our Competencies for All People Managers<br/><br/></strong><ul><li>Strategic Agility: Sees ahead clearly; can anticipate future consequences and trends accurately; has broad knowledge and perspective; is future oriented; can articulately paint credible pictures and visions of possibilities and likelihoods; can create competitive and breakthrough strategies and plans.</li><li>Developing Direct Reports and Others: Provides challenging and stretching tasks and assignments; holds frequent development discussions; is aware of each person's career goals; constructs compelling development plans and executes them; pushes people to accept developmental moves; will take on those who need help and further development; cooperates with the developmental system in the organization; is a people builder.</li><li>Building Effective Teams: Blends people into teams when needed; creates strong morale and spirit in their team; shares wins and successes; fosters open dialogue; lets people finish and be responsible for their work; defines success in terms of the whole team; creates a feeling of belonging in the team.<br/><br/></li></ul>Coach is an equal opportunity and affirmative action employer and we pride ourselves on hiring and developing the best people. All employment decisions (including recruitment, hiring, promotion, compensation, transfer, training, discipline and termination) are based on the applicant’s or employee’s qualifications as they relate to the requirements of the position under consideration. These decisions are made without regard to age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law.<br/><br/><strong>Americans With Disabilities Act (ADA)<br/><br/></strong>Tapestry, Inc. will provide applicants and employees with reasonable accommodation for disabilities or religious beliefs. If you require reasonable accommodation to complete the application process, please contact Tapestry People Services at 1-855-566-9264 or employeerelations@tapestry.com<br/><br/>Visit Coach at www.coach.com.<br/><br/><strong>Work Setup<br/><br/></strong><strong>BASE PAY RANGE <strong><strong><strong>$17.00</strong></strong></strong> TO <strong><strong><strong>$21.00</strong></strong></strong> <strong><strong><strong>Hourly</strong></strong></strong></strong>", "responsibilities": "The Sales Support Associate role is an integral part of the store’s overall success and efficiency; demanding directattention to our brand commitment when servicing our customers. Leaving a lasting impression on our customersthrough friendly, efficient interactions at our cash wrap and a well-maintained sales floor. Accurate and effectivework, supporting the flow of product from the moment of receipt through the point of sale is essential to this role.", "qualifications": {"required": "Experience: 1- 3 years of previous retail experience (cashier/stock experience, sales etc.), preferably in a luxuryretail service environment. Possesses current knowledge of fashion trends and competition in the marketplace.<br/><br/>Education: High school diploma or equivalent; college degree preferred.<br/><br/>Technical: Knowledge of cash register systems, basic computer skills (including the ability to use iPad/laptop,Mobile POS and Internet), utilize walkie talkie, understand and read price and product release sheets.<br/><br/>Physical: Ability to execute at a fast pace. Ability to communicate effectively with customers and team. Ability tomaneuver the sales floor, sales shelves, and stock room; climbing, bending, and kneeling are required. Ability tofrequently lift and carry up to 25 pounds and, at times, lift and carry product/cartons up to 50 pounds to processproduct shipment/transfers.<br/><br/>Schedule: Ability to meet Coach Scheduling &amp; Availability Expectations, including ability to work a flexibleschedule, including nights, weekends, and holidays high retail traffic and sales days (including but not limited to theday after Thanksgiving, Memorial Day, Christmas Eve, Mother’s Day, etc.).", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "salary": {"amount": "17.00/hr - 21.00/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3936852919"}