{"jobTitle": "Senior Analyst / Junior Associate", "company": {"name": "DivcoWest", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$90,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Finance, Analyst, and Other", "industry": "Real Estate", "description": "<strong>Senior Analyst/Junior Associate</strong>\n\n<strong> </strong>\n\n<strong>JOB DESCRIPTION</strong>\n\n<strong> </strong>\n\n<br/>\n\n<strong>Company Background</strong>\nFounded in 1993, DivcoWest is a multi-disciplinary real estate investment firm headquartered in San Francisco, with offices in Los Angeles, Menlo Park, Boston, Washington DC, Austin, and New York City. Known for our long-standing relationships and track record of success in innovation markets, DivcoWest combines entrepreneurial spirit with an institutional approach. As of Q1 2023, DivcoWest has over $18 billion in assets under management and has acquired or developed nearly 60 million square feet of commercial real estate primarily across the United States.\n\n<br/>\n\nDivcoWest aims to create environments that inspire ingenuity, promote growth, and enhance the health, happiness, and well-being of all people. A disciplined code of ethics is at the core of all that we do. We believe that the collective energy of a diverse team is what drives our creative ideas and solutions.\n\n<strong> </strong>\n\n<br/>\n\n<br/>\n\n<strong>Summary</strong>\nThe Senior Analyst/Junior Associate will provide direct assistance to the various members of the Investment Team in primarily supporting Asset Management functions in the following areas: providing analytical support for existing assets including lease and financing analyses, business plan development, reporting and valuation updates, and other analytical support as may be needed. The candidate may also assist in the Acquisition process by providing analytical support for evaluating new investments and assisting in the due diligence process. In both functions, the candidate will also assist in drafting internal, investor and lender presentations while also assisting in the compilation of white papers on new potential investment strategies for both existing and new investments within DivcoWest’s portfolio and/or target investment markets.\n\n<strong> </strong>\n\n<br/>\n\n<strong><em>This role requires 5 days in the office at our Beverly Hills, Los Angeles, CA location.</em></strong>\n\n<strong><em> </em></strong>\n\n<br/>\n\nInterested candidates should send their resumes to Recruiting@divcowest.com.\n\n<strong> </strong>\n\n<br/>\n\n<br/>\n\n<strong>Responsibilities:</strong>\n· Participate in the creation of monthly, quarterly, and annual reporting for investors and senior management.\n· Participate in the valuation process of each asset on a quarterly basis, working with analytics team and consultants.\n· Provide regular written and oral status reports and ad hoc reports on request.\n· Evaluate potential new investment opportunities and build financial models using Argus Enterprise and Excel.\n· Participate in the drafting and implementation of strategic business plans that will govern an asset’s daily operations, position in the market, and ultimate disposition.\n· Assist in creating investment memoranda and other written reports for our investments, both existing and new.\n· Assist with transaction due diligence responsibilities, which include supporting the acquisitions team to abstract leases, verify underwriting, review historical financials, conduct CAM reconciliations, and review property due diligence reports, and assist in closings and financings.\n\n<strong> </strong>\n\n<br/>\n\n<strong>Qualifications:</strong>\n\n<strong> </strong>\n\n· At least 1-3 years of relevant experience.\n· Strong financial modeling skills. Exposure and/or knowledge of real estate accounting and financial statement analysis a plus\n· Strong skills in Excel, Word, and PowerPoint.\n· Ability to effectively work and communicate with team members.\n· Exceptional quantitative and analytical skills.\n· Exceptional business writing ability.\n· A strong interest in real estate investment.\n· Self-managed, able to work well independently and within a small team.\n· High level of initiative, strong work ethic and willingness to work across teams.\n· Creative and entrepreneurial spirit.\n\n<strong> </strong>\n\nThe person in this position must be able to:\n· Remain in a stationary position for 75% of the time working on a computer and attending virtual meetings.\n· Occasionally move about the office to access file cabinets, office technology, and attend meetings etc.\n\n<strong><em> </em></strong>\n\n<br/>\n\n<strong>Compensation:</strong>\n<strong>· </strong>Base salary: $90,000 - $110,000\n· Annual bonus opportunity\n· Full benefits\n<em> </em>\n\n<br/>\n\n<em> </em>\n\n<em>Divco West Services, LLC (“Company”), an equal opportunity employer, is committed to equal opportunity for all employees and applicants. The Company recruits, hires, trains, promotes, pays, and administers all personnel actions without regard to race, color, religion, sex (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), sex stereotyping (including assumptions about a person’s appearance or behavior, gender roles, gender expression, or gender identity), gender, gender identity, gender expression, national origin, age, mental or physical disability, ancestry, medical condition, marital status, military or veteran status, citizenship status, sexual orientation, genetic information, or any other status protected by applicable law. We interpret these protected statuses broadly to include both the actual status and also any perceptions and assumptions made regarding these statuses. Please review our company Privacy Policy regarding the use of any personal information you provide us at: https://www.divcowest.com/privacy-policy/</em>\n\n<em> </em>\n\n<em>This policy applies to all areas of employment, including recruitment, testing, screening, hiring, selection for training, upgrading, transfer, demotion, layoff, discipline, termination, compensation, benefits, and all other privileges, terms, and conditions of employment. This policy and the law prohibit employment discrimination against any employee or applicant on the basis of any legally protected status outlined above.</em>", "responsibilities": "· Participate in the creation of monthly, quarterly, and annual reporting for investors and senior management.\n· Participate in the valuation process of each asset on a quarterly basis, working with analytics team and consultants.\n· Provide regular written and oral status reports and ad hoc reports on request.\n· Evaluate potential new investment opportunities and build financial models using Argus Enterprise and Excel.\n· Participate in the drafting and implementation of strategic business plans that will govern an asset’s daily operations, position in the market, and ultimate disposition.\n· Assist in creating investment memoranda and other written reports for our investments, both existing and new.\n· Assist with transaction due diligence responsibilities, which include supporting the acquisitions team to abstract leases, verify underwriting, review historical financials, conduct CAM reconciliations, and review property due diligence reports, and assist in closings and financings.", "qualifications": {"required": "· At least 1-3 years of relevant experience.\n· Strong financial modeling skills. Exposure and/or knowledge of real estate accounting and financial statement analysis a plus\n· Strong skills in Excel, Word, and PowerPoint.\n· Ability to effectively work and communicate with team members.\n· Exceptional quantitative and analytical skills.\n· Exceptional business writing ability.\n· A strong interest in real estate investment.\n· Self-managed, able to work well independently and within a small team.\n· High level of initiative, strong work ethic and willingness to work across teams.\n· Creative and entrepreneurial spirit.", "preferred": null}, "skills": ["Argus Enterprise", "Excel", "Financial Modeling", "Real Estate", "Investment", "Business Writing", "Communication", "Teamwork"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "· Base salary: $90,000 - $110,000\n· Annual bonus opportunity\n· Full benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3936903858"}