{"jobTitle": "Influencer Music Coordinator", "company": {"name": "The Clementine Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Advertising Services", "description": "The Clementine Group is a creator agency at the intersection of creators, music, brands, and technology. We work with influencers exclusively &amp; non-exclusively assisting with monetization, networking, 360 management, events, and consulting. Our creator network includes a wide range of dancers, fashionistas, comedians, tech, fitness, lifestyle, and more. Brands we have worked with include Fortune 500 companies, tech startups, fashion powerhouses, and everything in between. We also work with every major record label and many independent labels to break the next viral song. No two projects are the same and the industry is constantly evolving.<br/><br/>Founded by two young entrepreneurs, we grew up in the digital landscape. The team is composed of hustlers with a burning passion for what we do. We are remote-first but operate mainly out of Los Angeles &amp; San Diego. Our ideal candidate is someone who is self-driven, innovative, organized, and fun-loving. <strong>Humans make companies, not credentials.<br/><br/></strong><strong>OVERVIEW:<br/><br/></strong>The music coordinator works alongside our music team and creators in executing, managing, and reporting on campaigns.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Execute music campaigns with content creators, handling deliverables, revisions, and communication</li><li>Work alongside music account coordinators &amp; the creator team to source relevant creators for new opportunities</li><li>Track campaigns, creators, and deliverables in our internal CMS, doing so in a responsible and organized manner</li><li>Contribute to team brainstorms and campaign ideation</li><li>Support the music on various projects that align with client goals</li><li>Build out partnerships within the creator economy that allow for greater collaboration<br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>18+ years old</li><li>Exceptional communication &amp; interpersonal skills that are timely and professional</li><li>Highly detail-oriented and organized, able to manage multiple tasks simultaneously</li><li>Consistently meet deadline requirements</li><li>Passion for music and social media; having experience working with influencers is preferred</li><li>Ability and desire to go above and beyond to satisfy clients and creators</li><li>Fun, positive, and motivated to grow with a small, yet rapidly growing company</li><li>Proficient in G-Suite and technology (Sheets, Drive, Gmail, Slack + other collaborative tools)</li></ul>", "responsibilities": "The music coordinator works alongside our music team and creators in executing, managing, and reporting on campaigns.", "qualifications": {"required": "18+ years old, Exceptional communication &amp; interpersonal skills that are timely and professional, Highly detail-oriented and organized, able to manage multiple tasks simultaneously, Consistently meet deadline requirements, Passion for music and social media; having experience working with influencers is preferred, Ability and desire to go above and beyond to satisfy clients and creators, Fun, positive, and motivated to grow with a small, yet rapidly growing company, Proficient in G-Suite and technology (Sheets, Drive, Gmail, Slack + other collaborative tools)", "preferred": ""}, "skills": ["Communication", "Social Media", "Music", "G-Suite", "Technology", "Sheets", "Drive", "Gmail", "Slack"], "postedDate": "2 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3937369256"}