{"jobTitle": "Demand Planning Manager", "company": {"name": "Aspire Bakeries", "location": "Los Angeles, CA", "industry": "Food Production"}, "location": "Los Angeles, CA", "jobType": "Supply Chain", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$89,000 - $119,500", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food Production", "description": "Location:<br/><br/>Los Angeles, CA, US, 90045<br/><br/>90045<br/><br/>Job Type: Supply Chain<br/><br/>90045<br/><br/>Aspire Bakeries is a North American baking company with a leadership position in specialty frozen baked goods. Formed from leading bakery companies, its innovative food portfolio includes breads, artisan breads, buns, cookies, donuts, muffins and pastries from beloved brands like La Brea Bakery®, Otis Spunkmeyer®, and Oakrun Farm Bakery®. With 13 bakeries in North America, we are committed to driving innovation, predicting upcoming consumer trends and flavors, and exceeding our customers’ expectations. Aspire Bakeries champions the values of Integrity, Ownership, Customer Focus, Creativity and Care to help us deliver on People Safety, Food Safety, Quality and Collaboration.<br/><br/>The Demand Planning Manager will be responsible for developing a shipment demand plan utilizing consumption input, sales input, statistical models, historical sales data, trade inventory assumptions and channel inputs. Objective is to deliver the most accurate unbiased, unconstrained Demand Plan based on all cross functional inputs. Collaborates with Sales, Marketing, and Customer Finance in resolving any discrepancies in volume/revenue assumptions vs. the operational demand plan. Analyzes assumptions received from commercial teams and other supply chain peers to determine its relevance and value to the total Category Demand Plan.<br/><br/><strong>Accountabilites:<br/><br/></strong><ul><li>Generate and maintain operational forecast at multiple levels of aggregation for multiple time horizons as part of the demand planning function.</li><li>Use and maintain current demand planning systems to create the best statistical baseline possible using established processes.</li><li>Coordinate cross-functional research activities to reconcile significant variances and refine the forecast model to reflect updated Sales and Marketing assumptions.</li><li>Understand the impact of in-sourcing and out-sourcing of products on the demand cycle. </li><li>Make recommended adjustments to the forecast based on changes in demand and market trends.</li><li>Monitor SKU level sales and recommend SKU rationalization initiatives.</li><li>Ensure product and location forecast mix aligns with latest trends.</li><li>Prepare, report, and communicate forecast measurements to management (forecast accuracy, bias, etc.)</li><li>Perform both product and customer segmentation analysis to determine appropriate focus areas.</li><li>Utilize continuous improvement tools to focus on root cause along with analytical reporting and tools to identify areas of opportunity and process improvement.</li><li>Review forecast metrics, perform root cause analysis when variability exceeds the norm, determine best methods to improve forecast accuracy and recommend action steps.</li><li>Collect past/future demand inputs (distribution gains/losses, price changes, new/discontinued products, promotion plans, etc.) from Sales and Marketing and forecast/model their impacts on demand.</li><li>Partner with Sales to ensure key Customer Plans are incorporated into the Demand Plan.</li><li>Ensure product and location forecast mix aligns with current trends.</li><li>Provide input to the Supply Planning organization in developing inventory strategies on existing items, new products, and product phase-outs.</li><li>Closely coordinate and communicate customer plans with Supply Planning</li><li>Collaborate on abnormal and unconsumed demand ensuring short term changes to the Demand Plan are agreed to and executed.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor Degree required - preferably in supply chain, operations, or related discipline. Master Degree a plus</li><li>3+ years of experience in Demand Planning or related Supply Chain field required.</li><li>CPG Industry experience a plus.</li><li>SAP ECC, SAP BW, AERA, Domo, SAP IBP experience a plus</li><li>Strong analytical experience in MS Office Applications.</li><li>Ability to work both independently and collaboratively in a dynamic analytical environment.</li><li>Extensive spreadsheet experience, strong analytical skills, and the ability to interpret substantial amounts of data required.<br/><br/></li></ul><strong>Salary Range</strong>: $89,000 - $119,500<br/><br/>Aspire Bakeries LLC values the contribution each Team Member brings to our organization. The final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to location, shift, education, skill, and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed In this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. For union-represented postings, wage rates and ranges are governed by applicable collective bargaining agreements.<br/><br/>Aspire Bakeries is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.", "responsibilities": "The Demand Planning Manager will be responsible for developing a shipment demand plan utilizing consumption input, sales input, statistical models, historical sales data, trade inventory assumptions and channel inputs. Objective is to deliver the most accurate unbiased, unconstrained Demand Plan based on all cross functional inputs. Collaborates with Sales, Marketing, and Customer Finance in resolving any discrepancies in volume/revenue assumptions vs. the operational demand plan. Analyzes assumptions received from commercial teams and other supply chain peers to determine its relevance and value to the total Category Demand Plan.", "qualifications": {"required": "Bachelor Degree required - preferably in supply chain, operations, or related discipline. Master Degree a plus\n3+ years of experience in Demand Planning or related Supply Chain field required.\nCPG Industry experience a plus.\nSAP ECC, SAP BW, AERA, Domo, SAP IBP experience a plus\nStrong analytical experience in MS Office Applications.\nAbility to work both independently and collaboratively in a dynamic analytical environment.\nExtensive spreadsheet experience, strong analytical skills, and the ability to interpret substantial amounts of data required.", "preferred": null}, "skills": ["Demand Planning", "Supply Chain", "CPG", "SAP ECC", "SAP BW", "AERA", "Domo", "SAP IBP", "MS Office Applications"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "Aspire Bakeries LLC values the contribution each Team Member brings to our organization. The final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to location, shift, education, skill, and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed In this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. For union-represented postings, wage rates and ranges are governed by applicable collective bargaining agreements.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3937114121"}