{"jobTitle": "Operations Manager", "company": {"name": "California i-Center", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "We are searching for an experienced and nimble Operations Manager to support a rapidly growing and complex organization in a startup environment.<br/><br/>The Movement Innovation Collaborative (MIC) is a new entity that will deepen and expand the capacity, impact, and sustainability of California's grassroots movements for racial justice and social transformation. MIC will support changemakers and organizations to catalyze innovations in movement strategy and power building, intergenerational leadership development, and our collective long-term sustainability and resiliency. Through a network of physical and virtual \"centers,\" MIC will also contribute a key piece of infrastructure needed to fuel transformative structural change across California. This network will consist of new and existing centers serving hundreds of organizations and tens of thousands of grassroots leaders in California. We aspire to raise the necessary resources to fuel the mission, vision, and programs of MIC.<br/><br/>The Movement Innovation Collaborative is focusing on three core strategies to deepen the power, coordination, and impact of the sector. In all three areas, we will create program and infrastructure supports that are additive and synergistic with existing movement efforts rather than duplicative.<br/><br/><ul><li>Movement Strategy and Innovation</li><li>Intergenerational Leadership Development</li><li>Healing Justice and Sustainable Work Culture<br/><br/></li></ul><strong>What You’ll Be Doing:<br/><br/></strong>As the inaugural Operations Manager at MIC, you will build systems and procedures from the ground up, ensuring that the organization can scale up its work effectively while supporting a growing staff and diverse programming across the state of California. After building up the infrastructure, you will then ensure processes and practices efficiently meet the organization’s needs in the future and monitor them for constant improvement.<br/><br/>This multifaceted role requires expertise across all operational functions of a nonprofit organization:<br/><br/><strong>Human Resources<br/><br/></strong><ul><li>Start-up: assist in selection of PEO and establish best practices for work with that entity. Ongoing: liaise with PEO, manage onboarding and record keeping for HR</li><li>Track staffing needs and hiring timelines, reporting to leadership and other stakeholders as needed. Coordinate hiring processes, including posting jobs, screening resumes, and organizing job interviews with attention to diversity of candidates</li><li>Assist in implementing culture strategies, including lead the creation of an Employee Handbook and manage its updates</li><li>Lead onboarding to organization, systems, and culture</li><li>Support and/or manage payroll in concert with finance and PEO</li><li>Facilitate performance management process (scheduling, tool maintenance, etc.)</li><li>Support professional development and training strategies<br/><br/></li></ul><strong>Information Technology<br/><br/></strong><ul><li>Start-up: help select IT providers and software systems to support the organization’s remote work environment; Ongoing: lead relationship with IT managed services provider</li><li>Hardware and software management with an eye toward seamless integrations</li><li>Systems administration, including provisioning new users and providing basic IT support to users</li><li>New systems implementation and maintenance for programs, fundraising, finance, and data collection in partnership with program managers who use those systems<br/><br/></li></ul><strong>Finance &amp; Administration<br/><br/></strong><ul><li>Support the Director of Finance in managing budgets and spending across the organization</li><li>Manage legal filing requirements for the state and registration for states where Movement Innovation Collaborative will fundraise</li><li>Manage insurance, such as gathering information, managing communication with vendors</li><li>Implement and manage continuity of operations plan</li><li>Track vendor contracts and honoraria<br/><br/></li></ul><strong>Who You Are:<br/><br/></strong>While no one person will embody all of the qualities described below, the ideal candidate will possess many of the following professional and personal abilities, attributes, and experiences:<br/><br/><ul><li>A strong alignment with MIC’s mission and culture</li><li>8+ years in progressively responsible operations roles, including experience with complex nonprofit organizations with budgets exceeding $10M. </li><li>Working knowledge of software programs commonly used among nonprofit organizations to support operational functions. Ability to research and recommend software systems as needed. Experience with Sage Intacct, Bill.com, and Expensify are considered a plus. </li><li>Experience helping a growing organization build systems, expertise, and procedures over time</li><li>Strong communication skills and transparency; conflict management and negotiation expertise. </li><li>Strong analytical skills and experience operationalizing a strategic vision</li><li>Excellent stakeholder management skills (internally and externally)</li><li>Experience partnering with staff, leadership, and an active board</li><li>Strong customer service orientation to uplift the organization across all functional areas<br/><br/></li></ul>Powered by JazzHR<br/><br/>tkO7502a3k", "postedDate": "2 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3937935331"}