{"jobTitle": "Inventory Control Coordinator", "company": {"name": "Porsche Cars North America", "location": "Rialto, CA"}, "location": "Rialto, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing", "description": "Tasks<br/><br/><strong>Position Overview<br/><br/></strong>Supervise, lead and direct warehouse team assigned to the Inventory Control department. Coordinate daily activities to ensure they are handled in a manner consistent with company service and cost objectives. Secondary responsibilities include coordinating a Quality Control program, managing additional project responsibility as they arise.<br/><br/><strong>Roles &amp; Responsibilities<br/><br/></strong><ul><li> Prioritize daily work schedule for assigned warehouse team and set employee productivity targets </li><li> Address and resolve inventory area operational, system-related and/or dealership issues </li><li> Monitor and replenish any supplies and equipment needed in the inventory area </li><li> Provide coaching to personnel and develop a productive work team </li><li> Ensure timely updates of daily operation reports and data entry (O/S, Damage, Ocean Log, Productivity Tracking, etc.) </li><li> Ensure operational training of personnel in the receiving and inventory function </li><li> Manage the inventory count activities, develop/maintain processes to improve inventory accuracy and ensure adherence to auditor requirements </li><li> Supervise quality control personnel and maintain parts locations to maximize efficiency of warehouse operations </li><li> Oversee the pre-pack program to help reduce freight claims </li><li> Monitor and comply with custom and import requirements </li><li> Complete annual performance reviews of assigned staff </li><li> Counsel personnel on performance issues as needed </li><li> Handle all matters relating to inventory control, checking quality of designated product, ensuring that daily inventory is being performed </li><li> Analyze and modify parts storage processes, equipment and layout designs to fit current and future business requirements </li><li> Analyze inventory pick frequencies to modify storage rules or recommend disposition as required </li><li> Analyze and monitor various transactional activities: (i.e. Air freight lines, Variance report, Item status reports, referral lines report, PO and ETA reports, Claims, etc.) </li><li> Responsible for maintenance and performance of RF picking devices </li><li> Open/close facility as required </li><li> All other duties as assigned <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Qualifications<br/><br/></strong><strong>Education<br/><br/></strong>Bachelor’s degree in Business Management or Logistics/Supply Chain preferred or equivalent years of experience<br/><br/><strong>Experience (Job And Industry)<br/><br/></strong><ul><li> 5+ years parts warehouse inventory control experience preferred </li><li> 5+ years of supervisory skills in a warehouse and/or manufacturing environment </li><li> Experience in assigning work and effective supervision of staff </li><li> Knowledge and understanding of computerized parts systems </li><li> Experience in receiving, inventory and parts return </li><li> Responsible for the proper usage, awareness, and compliance with IT security policies at PCNA </li><li> Seeks to ensure proper retention of electronic documents, business confidential information, and actively demonstrates an understanding of the need to safeguard competitive information in both electronic and non-electronic formats </li><li> Experience with inventory management computer systems, including SAP <br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li> Excellent interpersonal and communication skills, both written and verbal </li><li> Strong PC related skills to include: MS Office, Parts &amp; Warehouse System </li><li> Solid knowledge of inventory management procedures </li><li> Knowledge and understanding of computerized parts systems and warehouse management systems (WMS) </li><li> Ability to operate material handling equipment and RF equipment <br/><br/></li></ul><strong>Percentage Of Required Travel<br/><br/></strong>Schedule/Shift: M-F 9-5<br/><br/><strong>Physical Requirements<br/><br/></strong><ul><li> Open warehouse environment with variant temperatures </li><li> Heavy lifting, up to 50 pounds </li><li> Sitting, lifting, pushing, pulling and extensive standing &amp; walking on concrete surfaces </li><li> Although a regular 40 hour work schedule will apply to this position, the person selected should be prepared to work flexible work hours that could include weekends and overtime as needed </li><li> Must be able to effectively work and complete tasks in an open office/noisy environment. <br/><br/></li></ul>The salary range for this position is between $74,000 and $83,000 annually, commensurate with the candidate's experience.<br/><br/><strong>Direct reports<br/><br/></strong>List by job title any positions to be supervised by the incumbent:<br/><br/><ul><li> Inventory Control Specialist <br/><br/></li></ul>Exclusive look behind the scenes<br/><br/>Porsche is an equal opportunity employer and we take pride in our diversity. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at Porsche will be based on merit, qualifications and abilities. Porsche does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, pregnancy, status as a parent, national origin, age, disability, family medical history, ancestry, medical condition, genetic information, sexual orientation, gender, gender identity, gender expression, marital status, familial status, registered domestic partner status, family and medical leave status, military status, criminal conviction history, or any other characteristic protected by federal, state or local law.", "responsibilities": "Supervise, lead and direct warehouse team assigned to the Inventory Control department. Coordinate daily activities to ensure they are handled in a manner consistent with company service and cost objectives. Secondary responsibilities include coordinating a Quality Control program, managing additional project responsibility as they arise.", "qualifications": {"required": "5+ years parts warehouse inventory control experience preferred, 5+ years of supervisory skills in a warehouse and/or manufacturing environment, Experience in assigning work and effective supervision of staff, Knowledge and understanding of computerized parts systems, Experience in receiving, inventory and parts return, Responsible for the proper usage, awareness, and compliance with IT security policies at PCNA, Seeks to ensure proper retention of electronic documents, business confidential information, and actively demonstrates an understanding of the need to safeguard competitive information in both electronic and non-electronic formats, Experience with inventory management computer systems, including SAP", "preferred": "Bachelor’s degree in Business Management or Logistics/Supply Chain preferred or equivalent years of experience"}, "skills": ["Interpersonal Skills", "Communication Skills", "MS Office", "Parts & Warehouse System", "Inventory Management", "Computerized Parts Systems", "Warehouse Management Systems (WMS)", "Material Handling Equipment", "RF Equipment"], "postedDate": "2 weeks ago", "benefits": null, "remoteWork": null, "salary": {"amount": "$74,000 and $83,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3937580289"}