{"jobTitle": "Manager Digital Merchandising", "company": {"name": "Mattel, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "96,800.00 - 147,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Manufacturing, Design Services, and Entertainment Providers", "description": "CREATIVITY IS OUR SUPERPOWER. It’s our heritage and it’s also our future. Because we don’t just make toys. We create innovative products and experiences that inspire fans, entertain audiences and develop children through play. Mattel is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.<br/><br/><strong>The Opportunity:<br/></strong>Mattel’s direct to consumer business has an ambitious growth agenda and is on the journey to scaling into a global organization.<br/><br/>The Manager eCommerce Merchandising is responsible for creating a consumer-first experience to drive sales and engagement. You will collaborate with brand teams and e-commerce leaders to build a compelling catalog of product and devise effective selling strategies. You will manage the consumer journey and shopping experience for key brands on Mattel’s DTC (Direct-to-Consumer) channel and partner with cross-functional teams across the organization to facilitate product launches and execution. You will manage a portfolio of brands and a team of two, collaborate across a robust suite of cross-functional partners, and contribute to leadership meetings with sales reports and consumer insights. This role is customer obsessed and trend savvy; monitoring the retail landscape (in the toy and collector space), using financial skills, web analytics and historical sales data to drive compelling assortments and increasing sales.<br/><br/><strong>What Your Impact Will Be<br/><br/></strong><ul><li>Develop and maintain a product catalogue across a suite of global brand partners to deliver on DTC sales goal, corporate growth strategy, and brand expansion / presence.</li><li>Develop and maintain full year calendar in accordance with the DTC business strategy inclusive of product launches and content activations</li><li>Partner with brand team across the Mattel family of IPs to develop the business strategy in support of both e-commerce and brand initiatives</li><li>Partner with marketing team to develop a compelling e-commerce offer and experience to drive customer conversion and repurchase</li><li>Partner with creative team to develop assets and copy in accordance with business strategy and brand guidelines</li><li>Manage Associate Manager and team project manager to facilitate planning and execution of all e-commerce projects, inclusive of product launches and content activations</li><li>Partner with data team for reporting on a per product, campaign, brand, and monthly basis, translating data into actionable insights</li><li>Partner with planning team to set appropriate production quotas, sales expectations and to deliver product to financial requirements.</li><li>Leverage analytics to drive improvements for the product catalogue, brand portfolio, and e-commerce experience</li><li>Build a positive team environment and culture<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>8 years of experience or equivalent accomplishments in consumer products brand focused business; toys and collectibles preferred</li><li>Experience in merchandise planning or experience working with merchandise planning teams</li><li>Experience with buying / catalog planning / product development cycles and cost + benefit considerations for balancing a sales portfolio</li><li>Experience in digital merchandising and/or marketing with full understanding of consumer journey through purchase funnel to customer retention</li><li>Experience managing business strategy with an ability to make quick decisions and effectively communicate updates/next steps</li><li>Experience working with multiple brands or working in a client-facing role</li><li>Ability to analyse data and turn analytics into actionable insights</li><li>Excellent reporting and presentation skills</li><li>Knowledge of digital/e-commerce best practices in SEO, SEM, CRO, etc.</li><li>Financial model familiarity and business experience required</li><li>MBA preferred</li><li>Degree in related field or equivalent years of working experience in related capacity.<br/><br/></li></ul>Affinity for toys and collectibles or brands within the collector space highly desired. What’s your fandom?<br/><br/>The annual base salary range for this position is between $96,800.00 and $147,000.00.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>Don’t meet every single requirement? At Mattel we are dedicated to building a diverse and inclusive workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>How We Work<br/><br/></strong>We are a purpose driven company aiming to empower generations to explore the wonder of childhood and reach their full potential. We live up to our purpose employing the following behaviors<br/><br/><ul><li>We collaborate Being a part of Mattel means being part of one team with shared values and common goals. Every person counts and working closely together always brings better results. Partnership is our process and our collective capabilities is our superpower.</li><li>We innovate At Mattel we always aim to find new and better ways to create innovative products and experiences. No matter where you work in the organization, you can always make a difference and have real impact. We welcome new ideas and value new initiatives that challenge conventional thinking.</li><li>We execute We are a performance-driven company. We strive for excellence and are focused on pursuing best-in-class outcomes. We believe in accountability and ownership and know that our people are at their best when they are empowered to create and deliver results.<br/><br/></li></ul><strong>Our Approach to Flexible Work:<br/></strong>We embrace a flexible work model designed to empower a culture of growth, optimism, and wellbeing, where every employee can reach their full potential. Combining purposeful in-person collaboration with flexibility, our focus is to optimize performance and drive connection for moments that matter.<br/><br/><strong>Who We Are<br/><br/></strong>Mattel is a leading global toy and family entertainment company and owner of one of the most iconic brand portfolios in the world. We engage consumers and fans through our franchise brands, including Barbie, Hot Wheels, Fisher-Price, American Girl, Thomas &amp; Friends, UNO, Masters of the Universe, Matchbox, Monster High, MEGA and Polly Pocket, as well as other popular properties that we own or license in partnership with global entertainment companies. Our offerings include toys, content, consumer products, digital and live experiences. Our products are sold in more than 195 countries in collaboration with the world’s leading retail and ecommerce companies.<br/><br/>Mattel is recognized as a Great Place to Work™ and as one of Fast Company’s Best Workplaces for Innovators in 2022.<br/><br/>Visit us at https //jobs.mattel.com/ and www.instagram.com/MattelCareers .<br/><br/>Mattel is an Affirmative Action/Equal Opportunity Employer where we want you to bring your authentic self to work every day. We welcome all job seekers including minorities, females, veterans, military spouses, individuals with disabilities, and those of all sexual orientations and gender identities.<br/><br/>Videos to watch<br/><br/>The Culture at Mattel<br/><br/>Mattel Investor Highlights", "responsibilities": "<ul><li>Develop and maintain a product catalogue across a suite of global brand partners to deliver on DTC sales goal, corporate growth strategy, and brand expansion / presence.</li><li>Develop and maintain full year calendar in accordance with the DTC business strategy inclusive of product launches and content activations</li><li>Partner with brand team across the Mattel family of IPs to develop the business strategy in support of both e-commerce and brand initiatives</li><li>Partner with marketing team to develop a compelling e-commerce offer and experience to drive customer conversion and repurchase</li><li>Partner with creative team to develop assets and copy in accordance with business strategy and brand guidelines</li><li>Manage Associate Manager and team project manager to facilitate planning and execution of all e-commerce projects, inclusive of product launches and content activations</li><li>Partner with data team for reporting on a per product, campaign, brand, and monthly basis, translating data into actionable insights</li><li>Partner with planning team to set appropriate production quotas, sales expectations and to deliver product to financial requirements.</li><li>Leverage analytics to drive improvements for the product catalogue, brand portfolio, and e-commerce experience</li><li>Build a positive team environment and culture<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>8 years of experience or equivalent accomplishments in consumer products brand focused business; toys and collectibles preferred</li><li>Experience in merchandise planning or experience working with merchandise planning teams</li><li>Experience with buying / catalog planning / product development cycles and cost + benefit considerations for balancing a sales portfolio</li><li>Experience in digital merchandising and/or marketing with full understanding of consumer journey through purchase funnel to customer retention</li><li>Experience managing business strategy with an ability to make quick decisions and effectively communicate updates/next steps</li><li>Experience working with multiple brands or working in a client-facing role</li><li>Ability to analyse data and turn analytics into actionable insights</li><li>Excellent reporting and presentation skills</li><li>Knowledge of digital/e-commerce best practices in SEO, SEM, CRO, etc.</li><li>Financial model familiarity and business experience required</li><li>MBA preferred</li><li>Degree in related field or equivalent years of working experience in related capacity.<br/><br/></li></ul>", "preferred": "Affinity for toys and collectibles or brands within the collector space highly desired. What’s your fandom?"}, "skills": ["Consumer Products", "Merchandise Planning", "Digital Merchandising", "Marketing", "Business Strategy", "Data Analysis", "Reporting", "Presentation Skills", "SEO", "SEM", "CRO", "Financial Modeling", "MBA"], "postedDate": "2 weeks ago", "benefits": "The annual base salary range for this position is between $96,800.00 and $147,000.00.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3937157880"}