{"jobTitle": "Field Sales Manager (Vitamin Shoppe/GNC)", "company": {"name": "PRIME", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "<strong>Our Company</strong><p>Congo Brands is at the epicenter of where consumer demand meets product development. Through brand partnerships with lead influencers, we are afforded an inside look at what consumers truly desire. E-commerce becomes the laboratory for consumer feedback and serves as a data pool for future retail endeavours.</p><p></p><p><strong>The Role</strong></p><p>We are looking for a Field Sales Manager, Specialty - to oversee our sports supplement distribution within our Specialty channel. This individual will be instrumental to the growth and scale of Alani Nu, Prime Hydration, and 3D Energy. This individual will be responsible for executing all assigned sales and marketing initiatives within their defined territory. A heavy emphasis will be placed on supporting our national retail partners Vitamin Shoppe &amp; GNC, with secondary responsibilities with our Fitness &amp; Gym retailers. </p><p></p><p><strong>Key Responsibilities</strong></p><ul> <li>Establish &amp; develop positive working relationships with franchise &amp; independent retailers in your assigned territory. </li> <li> Provide consistent brand communication via in-person visits, calls, and emails. </li> <li> Accelerate new item/innovation adoption across all key retailer segments. </li> <li> Utilize available assets &amp; tools to support and develop in-store sales programs to accelerate sell-through. </li> <li> Leverage allotment of marketing assets to increase overall brand awareness within assigned retailers. </li> <li> Plan and participate in high opportunity events (i.e., anniversaries, grand openings, ect) in your assigned territory. </li> <li> Conduct regular reviews and assessments of channel and territory performance to present to sales leaderships. </li> <li> Actively participate in trade shows and major retail sales events. </li> </ul><p></p><p><strong>Key Skills and Experience Required</strong></p><ul> <li>3+ years of sales and/or retail experience, preferably in the sports nutrition industry. </li> <li>Well organized with the ability to work both independently and within a team environment.      </li> <li>Self-motivated and comfortable in a fast-paced environment, with the ability to adapt to change quickly. </li> <li>Ability to travel for trade shows, field-based execution, sales calls, and meetings approximately 60%-70% of the time. </li> <li>Highly Proficient with Microsoft programs (Word, Excel, Powerpoint, ect)</li> </ul><p> </p><p> </p><p><strong>Education Requirements</strong></p><ul><li>Bachelor's Degree or equivalent experience</li></ul><p></p><p><strong>Travel{{:}}</strong></p><ul> <li>60-70% Travel     </li> <li>This position requires a clean driving record and authorization to obtain your Motor Vehicle Record (MVR) upon receiving and accepting a job offer. </li> <li>Valid Driver's License is Required</li> </ul><p></p><p><strong>Compensation and Benefits Details</strong></p><ul> <li>Competitive Salary</li> <li>Health/Vision/Dental Benefits</li> <li>15 days of PTO + 8 paid holidays</li> <li>6 weeks paid parental leave</li> <li>401K plan with employer match</li> <li>Monthly cell phone stipend</li> <li>AND SO MUCH MORE!</li> </ul><p></p><p><em>Congo Brands, LLC. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law.</em></p><p></p><p><em>#PRIME</em></p>", "responsibilities": "Establish & develop positive working relationships with franchise & independent retailers in your assigned territory. Provide consistent brand communication via in-person visits, calls, and emails. Accelerate new item/innovation adoption across all key retailer segments. Utilize available assets & tools to support and develop in-store sales programs to accelerate sell-through. Leverage allotment of marketing assets to increase overall brand awareness within assigned retailers. Plan and participate in high opportunity events (i.e., anniversaries, grand openings, ect) in your assigned territory. Conduct regular reviews and assessments of channel and territory performance to present to sales leaderships. Actively participate in trade shows and major retail sales events.", "qualifications": {"required": "3+ years of sales and/or retail experience, preferably in the sports nutrition industry. Well organized with the ability to work both independently and within a team environment.      Self-motivated and comfortable in a fast-paced environment, with the ability to adapt to change quickly. Ability to travel for trade shows, field-based execution, sales calls, and meetings approximately 60%-70% of the time. Highly Proficient with Microsoft programs (Word, Excel, Powerpoint, ect)", "preferred": "Bachelor's Degree or equivalent experience"}, "skills": ["Sales", "Retail", "Sports Nutrition", "Microsoft Programs", "Communication", "Teamwork", "Self-Motivation", "Adaptability", "Travel"], "postedDate": "2 weeks ago", "benefits": "Competitive Salary, Health/Vision/Dental Benefits, 15 days of PTO + 8 paid holidays, 6 weeks paid parental leave, 401K plan with employer match, Monthly cell phone stipend, AND SO MUCH MORE!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3937993958"}