{"jobTitle": "Manager, Creator Partnerships", "company": {"name": "IF7", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$80,000.00 - $90,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Advertising Services", "description": "Who are we? IF7 is an entirely new kind of strategic media company. We exist to help some of the world’s biggest and best brands connect with the hardest to reach audience in history in Gen Z and young millennials, all through the lens of digital and social content. We create powerful partnerships across three main areas of focus in social, gaming and streaming - all driven by deep cultural trends and insights. What is the Role? IF7 is seeking an upbeat, energetic and self-motivated Manager of Talent and Creator Partnerships to join our rapidly growing team. You should have an incredible depth of knowledge in the creator space, a working relationship with the current influencer agencies and management companies, an understanding of creator pricing, general knowledge of creator agreements, and an extreme passion for social media.", "responsibilities": "Lead talent ideation, talent contracting, and key client communication in regards to talent partnerships. Build and defend presale talent recommendations to assist IF7 in winning new business. Ideate comprehensive talent recommendation lists and rationale for select IF7 accounts within allocated budgets. Execute outreach, negotiation, redlining and contracting for approved talent partnerships. Responsibly represent the brand and manage relationships with influencer partners and talent managers. Develop and streamline internal processes and partnership tracking. Provide direction for technology driven efficiencies. Analyze creator performance, create partner recap reports & case studies and provide data driven recommendations. Partner with the IF7 creative team on effective, unique creator concepts & briefs Partner with the IF7 Account Management team on campaign execution and content compliance with brand guidelines and tone. Provide best-in-class client service as both a brand and talent expert, proactively offering updates, solutions, and trends. Build relationships with key client stakeholders and attend all weekly status meetings. Network with talent management companies, agents, and social media platforms to identify new up-and-coming creators and opportunities. Act as a player/coach, leading all end-to-end components of creator partnerships, while also providing leadership to junior team members. 5% travel for on-set production and internal IF7 team building meetings.", "qualifications": {"required": "5+ years of experience in influencer and talent marketing", "preferred": "You have a strong understanding of and interest in creators, TikTok, and social media from a business and consumer perspective. You have experience negotiating brand partnerships with agents, managers, and lawyers. You have expert problem solving abilities and can communicate solutions clearly and efficiently to external partners. You have a robust rolodex of agency and management contacts. You are familiar with influencer marketing agreements and can facilitate redlines on agreements. You are highly organized, detail oriented, and meticulous in carrying out work responsibilities. You are adept in talent execution from campaign sell through to analytic reporting. You enjoy managing and tracking budgets. You are a team player and a clear communicator. Strong desire to work in a rapidly growing and thriving startup environment."}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3937780071"}