{"jobTitle": "Stock Associate / Merchandiser", "company": {"name": "Total Wine & More", "location": "San Dimas, CA"}, "location": "San Dimas, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "As a Stock Associate, you play an essential role in the customer service experience by maximizing product inventory levels. By processing freight and stocking shelves, you ensure that the store is organized and clean. While both part-time and full-time positions generally maintain floor merchandise and inventory standards, you may also be assigned as a cashier or sales assistant. You will report to the store management team.<br/><br/>Join us to become an industry expert in a fun and thriving retail company!<br/><br/>You will<br/><br/><ul><li>Provide customer service by greeting and establishing a relationship with customers while informing them of our products and services.</li><li>Maintain aisles by following established sorting and stocking guidelines</li><li>Complete freight process while ensuring sorting area is safe and organized including unloading of truck trailers, loading of merchandise onto carts; distributing inventory to correct locations; pulling and stocking merchandise from back room and overheads; resolve inventory discrepancies</li><li>Open and stack cases and merchandise; break down boxes and bale cardboard</li><li>Ensure signage is correctly placed; build displays and end caps; clean and maintain merchandise</li><li>Become familiar with and share Total Wine &amp; More’s product portfolio</li><li>Maintain store safety and cleanliness standards on the sales floor, stock room, lockers, kitchen, bathroom, etc.<br/><br/></li></ul>What We're Looking For<br/><br/><ul><li>21 years of age or older</li><li>Ability to work a flexible schedule as business requires, which may also depend on your preference for part-time or full-time hours</li><li>Experience using technology applicable to the position and access information necessary to complete daily responsibilities</li><li>1-year retail sales associate, merchandiser, or inventory specialist experience preferred, to include greeting customers, stocking, merchandising, managing inventory, or replenishment</li><li>Strong interpersonal skills with a positive and engaging attitude</li><li>Value collaboration and acting as a team player</li><li>Desire to develop knowledge of product and services<br/><br/></li></ul>Physical Requirements (with Or Without Accommodations)<br/><br/><ul><li>Walk, bend down repeatedly, and be on feet for 8-10 hours a day</li><li>Climb ladders and lift 50 lbs. overhead and repeatedly<br/><br/></li></ul>We offer<br/><br/><ul><li>Paid Time Off (PTO)</li><li>Generous store discounts</li><li>Health care plans (medical, prescription, dental, vision)</li><li>401(k), HSA, FSA, Pre-tax commuter benefits</li><li>Disability and life insurance coverage</li><li>Paid parental leave</li><li>Pet insurance</li><li>Critical illness and accident insurance</li><li>Discounted home and auto insurance</li><li>College tuition assistance</li><li>Career development, industry knowledge, and wine, spirits, and beer education</li><li>Consumer classes</li><li>&amp; More!<br/><br/></li></ul>Grow with us!<br/><br/>Total Wine &amp; More is the country’s largest independent retailer of fine wine, beer and spirits, and we continue to grow our footprint year over year. Total Wine offers exciting and unique career opportunities across the country and in our corporate office. Our strength is our people. We have a commitment to training and career growth, all in an environment that values new ideas and teamwork. If you share our entrepreneurial spirit and a passion for providing best-in-class customer experience, take a moment to apply or learn more at www.TotalWine.com/About-us/Careers!<br/><br/>The hourly wage range for this position is $16.80 - $23.50. Compensation may vary based on a number of factors including, but not limited to, market location, job-related knowledge, skills and/or experience. *The actual hourly rate will equal or exceed the required minimum wage applicable to the job location.<br/><br/><em>Total Wine &amp; More considers several factors when establishing compensation. Estimated salaries determined by third parties have not been validated by Total Wine &amp; More.<br/><br/></em><em>Total Wine &amp; More is an equal opportunity employer and all qualified applicants will receive consideration for employment without discrimination based on race, color, religion, national origin, sex, sexual orientation, age, marital status, veteran status, disability, or any other characteristic protected by applicable law. Total Wine &amp; More makes reasonable accommodations during all aspects of the employment process, including during the interview process. Total Wine &amp; More is a Drug Free Workplace.<br/><br/></em><em>The information provided above indicates the general nature and level of work required of the position and is not a comprehensive list of all responsibilities or qualifications. Benefits list is only a highlight of some of the benefits offered to team members; eligibility for certain benefits apply. The anticipated close date of this posting is 120 days from the posted date indicated above.</em>", "responsibilities": "As a Stock Associate, you play an essential role in the customer service experience by maximizing product inventory levels. By processing freight and stocking shelves, you ensure that the store is organized and clean. While both part-time and full-time positions generally maintain floor merchandise and inventory standards, you may also be assigned as a cashier or sales assistant. You will report to the store management team.<br/><br/>Join us to become an industry expert in a fun and thriving retail company!<br/><br/>You will<br/><br/><ul><li>Provide customer service by greeting and establishing a relationship with customers while informing them of our products and services.</li><li>Maintain aisles by following established sorting and stocking guidelines</li><li>Complete freight process while ensuring sorting area is safe and organized including unloading of truck trailers, loading of merchandise onto carts; distributing inventory to correct locations; pulling and stocking merchandise from back room and overheads; resolve inventory discrepancies</li><li>Open and stack cases and merchandise; break down boxes and bale cardboard</li><li>Ensure signage is correctly placed; build displays and end caps; clean and maintain merchandise</li><li>Become familiar with and share Total Wine &amp; More’s product portfolio</li><li>Maintain store safety and cleanliness standards on the sales floor, stock room, lockers, kitchen, bathroom, etc.<br/><br/></li></ul>", "qualifications": {"required": "21 years of age or older, Ability to work a flexible schedule as business requires, which may also depend on your preference for part-time or full-time hours, Experience using technology applicable to the position and access information necessary to complete daily responsibilities, Strong interpersonal skills with a positive and engaging attitude, Value collaboration and acting as a team player, Desire to develop knowledge of product and services", "preferred": "1-year retail sales associate, merchandiser, or inventory specialist experience preferred, to include greeting customers, stocking, merchandising, managing inventory, or replenishment"}, "skills": [], "postedDate": "1 week ago", "benefits": "Paid Time Off (PTO), Generous store discounts, Health care plans (medical, prescription, dental, vision), 401(k), HSA, FSA, Pre-tax commuter benefits, Disability and life insurance coverage, Paid parental leave, Pet insurance, Critical illness and accident insurance, Discounted home and auto insurance, College tuition assistance, Career development, industry knowledge, and wine, spirits, and beer education, Consumer classes, & More!", "remoteWork": "No", "salary": {"amount": "16.80 - 23.50", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3938967721"}