{"jobTitle": "assistant store manager-North Orange County", "company": {"name": "Starbucks", "industry": "Manufacturing, Food and Beverage Services, and Retail", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$58,500.00/yr - $67,200.00/yr", "currency": "USD"}, "jobFunction": "Management and Customer Service", "industry": "Manufacturing, Food and Beverage Services, and Retail", "description": "Now Brewing – Future Leaders! #tobeapartner\n\nStarbucks is known for developing extraordinary people who drive business success by doing the right thing for partners (employees), customers and communities – globally. As a Starbucks leader you are driven by a deep sense of purpose. You are aspirational - never a bystander. You take action to make a positive difference every day, and you inspire others to do the same.", "responsibilities": "This role is a hands-on experience that develops your supervisory experience, coaching skills, coffee/ tea passion and business acumen, all to build your understanding of store management. You will learn how to create success for a multi-million-dollar business, create and develop great teams, and building a meeting place in your community that nurtures customers.", "qualifications": {"required": "Minimum High School or GED, Legal documentation establishing your identity and eligibility to be legally employed in the country in which you apply, Ability to work full time (the work regularly demands in excess of 40 hours per week) including variable hours including early mornings, evenings, weekends and/ or holidays.", "preferred": "2 years retail / customer service management experience OR 4+ years of US Military service, Strong organizational, interpersonal and problem-solving skills, Entrepreneurial mentality with experience in a sales focused environment."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "As a Starbucks partner, you (and your family) will have access to medical, dental, vision, basic and supplemental life insurance, and other voluntary insurance benefits. Partners have access to short-term and long-term disability, paid parental leave, family expansion reimbursement, paid vacation from date of hire*, sick time (accrued at 1 hour for every 25 hours worked), eight paid holidays, and two personal days per year. Starbucks also offers eligible partners participation in a 401(k) retirement plan with employer match, a discounted company stock program (S.I.P.), Starbucks equity program (Bean Stock), incentivized emergency savings, and financial well-being tools. Additionally, Starbucks offers 100% upfront tuition coverage for a first-time bachelor’s degree through Arizona State University’s online program via the Starbucks College Achievement Plan, student loan management resources, and access to other educational opportunities. You will also have access to backup care and DACA reimbursement.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3938875874"}