{"jobTitle": "Warehouse Inventory Associate - Driver", "company": {"name": "WIS International", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "19.00/hr - 21.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Business Consulting and Services", "description": "Job Posting Warehouse Inventory Associate<br/><br/><ul><li>Driver Starting Wage from: $19.00 - $21.00 Part Time: Paid hours depend on your availability and business need. Ability to work varied, traditional and non-traditional hours, including flexible schedules. The more you are available, the more you can earn! Benefits of Working with WIS Hiring Immediately! Referral bonuses: Get paid for referring friends! Career Growth: WIS is committed to creating opportunities for those who aspire for more. If you are looking for career and promotion opportunities, you can count on us! Employee-paid health insurance available at competitive group rates Join a supportive environment where diversity is celebrated, and every individual is valued for their unique talents WIS Warehouse Inventory Associate</li><li>Driver Job Preview The Warehouse Inventory Associate</li><li>Driver is responsible for directing the warehouse inventory associates in manufacturing and warehouse inventories across various locations. As the face of our organization, we depend on you to uphold our core SPIRIT values of Service, Pride, Integrity, Results, Innovation and Teamwork in a positive, safe and inclusive environment. We are passionate about our people, technology, and process because when you succeed, we succeed. Drivers are responsible for safely transporting team members to and from inventory events in a timely manner. This role is responsible for adhering to traffic laws and WIS driver safety requirements, as well as conducting and completing vehicle inspections, maintenance, and daily cleaning. The Inventory Associate -Driver is a critical team member at WIS, ensuring the safe transport of our associates while in turn, increasing customer satisfaction and meeting Company goals and objectives. Team Requirements Must be at least 21 years of age Willingness to travel with paid overnights included Must have prior experience in a warehouse or manufacturing environment Proven ability to work in solo and team environments is required, where team-oriented, highly motivated, and self-driven individuals are preferred We encourage applications from candidates who: Returning to the workforce Have military experience Do not have a high school or college degree Completes WIS count reconciliation processes, and directs customers on completing tablet verifications Provides direction to warehouse associates, performs first counts, performs first count verifications on warehouse associates and executes the inventory plan Communicates information clearly and accurately, verbally and in written form, in a positive manner that yields cooperation Exhibits exemplary customer service, including but not limited to, professional and timely communication, a sense of urgency, and meeting expected service levels Prior teamwork experience in a customer service setting preferred Familiarity of warehouse heavy equipment (i.e. forklifts, scissor lifts) Familiarity with warehouse bin locations and labeling systems used in warehouses MWS Inventory Associate</li><li>Driver Requirement Must possess a valid driver’s license within the state of residence for a minimum of 36 consecutive months A minimum of three (3) years proven driving experience Must be willing to submit to a pre-employment investigative consumer report, pre-employment screening and MVR check in accordance with company standards Familiarity with GPS devices and how to navigate to assigned locations Working Conditions This position requires the ability to stand for prolonged periods of time with occasional walking; the ability to use both hands and wrists for repetitive motions; the ability to frequently be in low level positions, such as squatting, kneeling, or crouching; the ability to frequently use a ladder; the ability to lift and carry items up to 25 lbs.; the ability to frequently travel via car and/or plane, including overnight stays; the ability to work for extended periods of time (10-12 hours per event). More than 60% of this work occurs between Friday morning and Monday morning. Please note that this Job Description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. Under the Americans with Disabilities Act (ADA), WIS is committed to providing reasonable accommodations to qualified individuals with disabilities to enable them to effectively perform the essential functions of the job. WIS International is committed to providing reasonable accommodations to qualified individuals with disabilities in the employment application process. To request an accommodation, please contact our HR team at HR@wisintl.com. If requesting accommodation for an interview, please reach out at least one week in advance of your interview. For more information on WIS, visit our website at www.wisintl.com WIS is an Equal Opportunity Employer, committed to a diverse and inclusive work environment. Salary Starting At $19.00-$21.00</li></ul>", "responsibilities": "The Warehouse Inventory Associate - Driver is responsible for directing the warehouse inventory associates in manufacturing and warehouse inventories across various locations. As the face of our organization, we depend on you to uphold our core SPIRIT values of Service, Pride, Integrity, Results, Innovation and Teamwork in a positive, safe and inclusive environment. We are passionate about our people, technology, and process because when you succeed, we succeed. Drivers are responsible for safely transporting team members to and from inventory events in a timely manner. This role is responsible for adhering to traffic laws and WIS driver safety requirements, as well as conducting and completing vehicle inspections, maintenance, and daily cleaning. The Inventory Associate -Driver is a critical team member at WIS, ensuring the safe transport of our associates while in turn, increasing customer satisfaction and meeting Company goals and objectives.", "qualifications": {"required": "Must be at least 21 years of age Willingness to travel with paid overnights included Must have prior experience in a warehouse or manufacturing environment Proven ability to work in solo and team environments is required, where team-oriented, highly motivated, and self-driven individuals are preferred We encourage applications from candidates who: Returning to the workforce Have military experience Do not have a high school or college degree Completes WIS count reconciliation processes, and directs customers on completing tablet verifications Provides direction to warehouse associates, performs first counts, performs first count verifications on warehouse associates and executes the inventory plan Communicates information clearly and accurately, verbally and in written form, in a positive manner that yields cooperation Exhibits exemplary customer service, including but not limited to, professional and timely communication, a sense of urgency, and meeting expected service levels Prior teamwork experience in a customer service setting preferred Familiarity of warehouse heavy equipment (i.e. forklifts, scissor lifts) Familiarity with warehouse bin locations and labeling systems used in warehouses MWS Inventory Associate\nMust possess a valid driver’s license within the state of residence for a minimum of 36 consecutive months A minimum of three (3) years proven driving experience Must be willing to submit to a pre-employment investigative consumer report, pre-employment screening and MVR check in accordance with company standards Familiarity with GPS devices and how to navigate to assigned locations", "preferred": ""}, "skills": ["Warehouse", "Inventory", "Manufacturing", "Driver", "Transportation", "Customer Service", "Teamwork", "Communication", "GPS"], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "Hiring Immediately! Referral bonuses: Get paid for referring friends! Career Growth: WIS is committed to creating opportunities for those who aspire for more. If you are looking for career and promotion opportunities, you can count on us! Employee-paid health insurance available at competitive group rates Join a supportive environment where diversity is celebrated, and every individual is valued for their unique talents", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3938156817"}