{"jobTitle": "Los Angeles Flex Territory Account Executive", "company": {"name": "Toast", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "129,000.00/yr - $206,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Software Development, Technology, Information and Internet, and IT Services and IT Consulting", "description": "Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.<br/><br/>As a Territory Sales Account Executive, you will be part of a team that is transforming the way restaurants operate. Using a consultative approach, you will prospect, build relationships, and sign up new restaurateurs in your local area. By understanding their unique needs, you will develop a customized solution that helps their business thrive. We need your passion and expertise to help us build the Toast brand in your geographic territory.<br/><br/><em>This is a field sales opportunity based out of a personal home office. You must live local Los Angeles, CA or be willing to relocate to the area.<br/><br/></em><strong>About this roll*: (Responsibilities)<br/><br/></strong><ul><li>Generate list of prospective restaurants and manage the entire sales cycle from initial call to close</li><li>Conduct demos and develop a solution that best meets the prospect’s needs </li><li>Partner with teams across the business to ensure that expectations set during the sales process are met in delivery</li><li>Leverage Salesforce (our CRM) to manage all sales activities</li><li>Understand the competitive landscape and determine how to best position Toast in the market<br/><br/></li></ul><strong>Do you have the right ingredients*? (Requirements)<br/><br/></strong><ul><li>1+ years of experience in a sourcing or closing sales role, restaurant operations, or a relatable field and industry</li><li>Since this is a field position, you must have reliable transportation (will reimburse for mileage)</li><li>Strong communication, organizational and presentation skills with the ability to sell and negotiate at all decision-making levels</li><li>Proven track record of success in meeting and exceeding goals</li><li>Ability to work in a fast-paced, entrepreneurial and team environment</li><li>Self-motivated, creative, and flexible</li><li>General technical proficiency with software</li><li>Experience with Salesforce CRM is a nice to have</li><li>Bread puns encouraged but not required<br/><br/></li></ul><strong>Our </strong><strong><em>Spread*</em></strong><strong> of Total Rewards<br/><br/></strong>We strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.<br/><br/>The estimated Total Targeted Cash compensation range for this role is listed below. Total Targeted Cash for this role consists of a base salary, commission, plus the eligibility for equity and/or other benefits. This role qualifies for uncapped commissions. The starting salary will be determined based on skills, experience, and geographic location.<br/><br/>Total Targeted Cash<br/><br/>$129,000—$206,000 USD<br/><br/><strong>We are Toasters<br/><br/></strong>Diversity, Equity, and Inclusion is Baked into our Recipe for Success.<br/><br/>At Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.<br/><br/>The restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.<br/><br/>Baking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.<br/><br/><strong>Bready* to make a change? Apply today!<br/><br/></strong>Toast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.", "responsibilities": "Generate list of prospective restaurants and manage the entire sales cycle from initial call to close\nConduct demos and develop a solution that best meets the prospect’s needs \nPartner with teams across the business to ensure that expectations set during the sales process are met in delivery\nLeverage Salesforce (our CRM) to manage all sales activities\nUnderstand the competitive landscape and determine how to best position Toast in the market", "qualifications": {"required": "1+ years of experience in a sourcing or closing sales role, restaurant operations, or a relatable field and industry\nSince this is a field position, you must have reliable transportation (will reimburse for mileage)\nStrong communication, organizational and presentation skills with the ability to sell and negotiate at all decision-making levels\nProven track record of success in meeting and exceeding goals\nAbility to work in a fast-paced, entrepreneurial and team environment\nSelf-motivated, creative, and flexible\nGeneral technical proficiency with software\nExperience with Salesforce CRM is a nice to have\nBread puns encouraged but not required", "preferred": ""}, "skills": ["Sales", "Salesforce", "CRM", "Communication", "Presentation Skills", "Negotiation", "Restaurant Operations"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "We strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3938740932"}