{"jobTitle": "Executive Director", "company": {"name": "Kitchell", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$210,000.00 - $230,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Construction", "description": "<strong>Brief Description<br/><br/></strong>Kitchell seeks an experienced and dedicated <strong>Executive Director</strong> to join our <strong>Southern California</strong> region in our <strong>Los Angeles</strong> office and build a long-term career at one of the most innovative and growth-oriented building companies in the United States.<br/><br/><strong>Overview<br/><br/></strong>Duties include planning directing and ensuring the effective execution of program, project, or construction management services on large, complex, and high-risk projects. Duties will also include working closely with Regional Leadership and Business Development to target and pre-position for opportunities and to manage our Los Angeles office, staff, and clients. Our core client bases are in the Public Sectors (especially K-12 and Higher Education).<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li> Provide top oversight and direct Construction Project Management teams through all phases of the projects</li><li> Ensures project operations responsibilities are executed in accordance with company project management procedures and policies</li><li> Plans, directs and is accountable for the achievement of project revenue and profit objectives and effective management of overhead costs</li><li> Maintains and ensures client satisfaction and effectively resolves complaints when necessary in order to secure repeat business</li><li> Participates in preparation and negotiation of owner contracts and ensures delivery and adherence to contractual requirements and that all aspects of owner contracts are accomplished</li><li> Oversees preparation and maintenance of project budget, construction schedule and master project schedule.</li><li> Oversees preconstruction and construction progress and team performance to ensure conformance with schedule, budget and contractual requirements</li><li> Implements and maintains effective systems of communication within and outside the project to ensure constructive relationships and the adequate flow of information</li><li> Maintains high quality standards, understands key process issues and ensures implementation of process improvements for all work on the project.</li><li> Identifies and manages risk on the project, and advises and confers with regional executive prior to implementing risk mitigation actions</li><li> Provide strategy development and substantially leads and contributes to business development efforts for our Los Angeles office and assigned projects including the preparation of proposals and presentations for new work</li><li> Plans, directs, and is accountable for the achievement of sales, revenue and profit objectives and effective management of overhead costs.</li><li> Actively participates in the business community and builds relationships within the industry to generate and enhance business opportunities</li><li> Proactively manages the training and professional development of project employees</li><li> Facilitates and ensures the continuous and effective execution of the performance management process for project employees<br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Education and Experience<br/><br/></strong><ul><li> Bachelor’s degree in Construction Management, Architecture, Engineering, or related field, or equivalent experience is required</li><li> 15 years of Owner’s Representative, Construction and Project Management experience in a leadership capacity required (public sector preferred)</li><li> 8 years of experience on Division of State Architect (DSA) construction projects in California (either K-12 or Higher Education) is preferred</li><li> 5 years of leading teams of 5 or greater is required</li><li> Existing network of clients / owners from Public Agencies and the Education Markets is highly desired</li><li> Management of multiple delivery methods preferred (Design-Build, Design Bid-build, CM Multi-Prime, CM at Risk)<br/><br/></li></ul><strong>Knowledge And Skills<br/><br/></strong><ul><li> Knowledge of architecture, engineering and the construction management industry including current market sector trends and conditions is essential</li><li> Self-motivated, innovative, and strategic thinker with the aptitude for execution and a passion for people, and a diverse culture.</li><li> An active industry network is essential</li><li> Strong proficiency with the Microsoft Suite of tools is required</li><li> Effective verbal and written communication skills, including the advanced ability to foster and maintain effective interpersonal relationships is required</li><li> Ability to provide leadership and financial management support to a large project teams is required<br/><br/></li></ul><strong>License and Certifications<br/><br/></strong><ul><li> Certified Construction Manager (CCM), Design Build Institute of America (DBIA) and/or LEED Professional Accreditation certificate preferred is strongly preferred<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong>Position hub is our Los Angeles office, but job scope is regional leadership which includes site visits and client engagement responsibilities. A valid California driver’s license is required<br/><br/><strong>Summary<br/><br/></strong><strong>ABOUT OUR COMPANY<br/><br/></strong>Founded in 1950, Kitchell began as a commercial contracting business and over the years developed new talents and enterprises, acquiring complementary businesses and expertise to remain competitive. Today, Kitchell Corporation serves as the holding entity for several companies that are integral to Kitchell's core business, as well as those that operate independently. We provide a wide range of services within the built environment, including general contracting, construction management, development, facilities management, engineering, architecture, and myriad other services. Our employees manage projects from our main offices located in Arizona, California, and Texas. We offer an entrepreneurial environment that fosters personal and professional growth through in-house education programs, formal and informal mentoring, and cross-training opportunities. At Kitchell, we prioritize internal growth and building careers from within. We consistently rank among the top places to work, thanks to our tenured staff and outstanding benefits that are designed to enrich our employees’ physical, mental, emotional, and financial well-being. These benefits include profit sharing, discretionary stock options, incentive bonuses, health, and life insurance, health savings accounts (HSA) with wellness incentives, flexible spending accounts (FSA), 401(k) plans, tuition reimbursement, weight loss, and tobacco cessation programs, discounted auto insurance, identity theft protection, rewards programs, and much more.<br/><br/><em>Kitchell is an Equal Opportunity/Affirmative Action employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status.<br/><br/></em><em>The annual base salary range for this role is currently $210,000 - $230,000. The Company’s salary ranges are determined by role, level, location, and alignment with market data. Individual pay is determined through interviews and an assessment of various factors, including job-related skills, relevant education and experience, abilities of the applicant and equity with other team members. The annual base salary range listed here is subject to change at any time, in the Company’s discretion, and does not alter in any way the at-will nature of the employment relationship.</em>", "responsibilities": "Duties include planning directing and ensuring the effective execution of program, project, or construction management services on large, complex, and high-risk projects. Duties will also include working closely with Regional Leadership and Business Development to target and pre-position for opportunities and to manage our Los Angeles office, staff, and clients. Our core client bases are in the Public Sectors (especially K-12 and Higher Education).", "qualifications": {"required": "Bachelor’s degree in Construction Management, Architecture, Engineering, or related field, or equivalent experience is required\n15 years of Owner’s Representative, Construction and Project Management experience in a leadership capacity required (public sector preferred)\n8 years of experience on Division of State Architect (DSA) construction projects in California (either K-12 or Higher Education) is preferred\n5 years of leading teams of 5 or greater is required\nExisting network of clients / owners from Public Agencies and the Education Markets is highly desired\nManagement of multiple delivery methods preferred (Design-Build, Design Bid-build, CM Multi-Prime, CM at Risk)", "preferred": "Certified Construction Manager (CCM), Design Build Institute of America (DBIA) and/or LEED Professional Accreditation certificate preferred is strongly preferred"}, "skills": ["Construction Management", "Architecture", "Engineering", "Project Management", "Leadership", "Client Management", "Business Development", "Sales", "Microsoft Suite", "Communication", "Financial Management"], "postedDate": "2 months ago", "benefits": "We offer an entrepreneurial environment that fosters personal and professional growth through in-house education programs, formal and informal mentoring, and cross-training opportunities. At Kitchell, we prioritize internal growth and building careers from within. We consistently rank among the top places to work, thanks to our tenured staff and outstanding benefits that are designed to enrich our employees’ physical, mental, emotional, and financial well-being. These benefits include profit sharing, discretionary stock options, incentive bonuses, health, and life insurance, health savings accounts (HSA) with wellness incentives, flexible spending accounts (FSA), 401(k) plans, tuition reimbursement, weight loss, and tobacco cessation programs, discounted auto insurance, identity theft protection, rewards programs, and much more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3938149022"}