{"jobTitle": "Director of Supply Chain", "company": {"name": "Brothers Desserts", "industry": "Food and Beverage Manufacturing", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "The Director of Supply Chain plays a critical role within the Brothers/Schoep’s Organization and supports our Operations team to drive production while maintaining high standards for safety, quality, and efficiency standards. This position will lead the development of our overall Supply Chain Management Plan in line with business objectives, and strategic business plan.", "responsibilities": "Design and implement improvements to Supply Chain to support business growth and improvement strategies. Continues to focus on responsiveness to customers and reduce operating expenses and working capital. Accountable for Planning, Sourcing, Supplier Quality and Purchasing Functions/teams for delivering Supply chain objectives while ensuring continued Talent Development in the Organization as the Business evolves. Lead Sales, Inventory, Demand Planning, Procurement & Planning for the Organization and ensure the Sales/Financial Forecasts are accurate followed by 100% execution to the Supply Chain Plan. Develop inventory management strategies and programs to ensure maximum inventory turns, best price, high quality, and consistent support to manufacturing. Work with manufacturing to rationalize outsourcing and in-sourcing activities as it relates to New Products from an Industrialization Standpoint and sustaining products from a Cost reduction/simplification standpoint. Design and implement a Sourcing Strategy that supports Business growth objectives and is in line with the overall Supply Chain Objectives. Drive Synergies from a Sourcing (Supplier Rationalization), Process and Tools. Reviews and ensures that the appropriate financial metrics are monitored, and proper fiscal controls are in place to maximize cost savings throughout the function. Develop in conjunction with Operations/Finance the department operating budgets consistent with goals and objectives. Develop and establish improved controls and reporting systems to provide accurate information as to accomplishments, progress, performance, capabilities in controlling expenditures, savings, etc. Keep abreast of trends and improvements in the field of Supply Chain through appropriate publications and outside conferences and seminars. Perform related duties as assigned or as responsibilities necessitate. Assist in the general management of the business.", "qualifications": {"required": "Bachelor Degree in Business, 5 years of Management Experience, Experience of ERP Systems, 7 years of Supply Chain Experience, Must be able to work in a refrigerated environment of 30ºF to 45ºF up to 12 hours, Must be able to lift up to 50 pounds, Must be able to work in a team environment, Must have people and communication skills.", "preferred": "Bachelor's (Preferred)"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "401(k), 401(k) matching, Dental Insurance, Employee assistance program, Employee discount, Flexible spending account, Health insurance, Health savings account, Life insurance, Paid time off, Referral program, Retirement plan, Vision insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3938007522"}