{"jobTitle": "Amazon Delivery Driver - Los Angeles County - Work with great people!", "company": {"name": "QX LOGISTIX", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "15.50 per hour"}, "jobFunction": "Sales, Supply Chain, and Other", "industry": "Retail, Computers and Electronics Manufacturing, and Manufacturing", "description": "DRIVER FOR QX LOGISTIX Last Mile Deliveries <br/><br/><strong>$250 Sign-on Bonus for Experienced Drivers after 3 months!<br/><br/></strong><strong>Get a Raise Every 6 Months for Good Performance!<br/><br/></strong><strong>Employee of the Month Program - $ 100 gift cards<br/><br/></strong>QX Logistix, a warehouse services and transportation company, is looking for Delivery Drivers, to deliver packages for Amazon. We hire committed, positive people, who have a desire to excel in whatever they do. We value associates who have an optimistic attitude and enjoy working in a fast paced, changing, physical environment. Positions available in Hawthorne and Rosemead in Los Angeles County.<br/><br/><strong>Job Description<br/><br/></strong>Full time driver &amp; delivery person for residential and commercial locations in Los Angeles County<br/><br/>Deliver 220+ packages a day<br/><br/>Work 4 days out of the week based on 9-10 hour shifts, Monday through Sunday - various morning shifts available<br/><br/>Keep company provided vehicle clean<br/><br/>Fuel vehicle with company card<br/><br/><strong>Important Traits<br/><br/></strong>Reliable<br/><br/>Great attitude, will go the extra mile to get the job done efficiently<br/><br/>Energetic, moves quickly<br/><br/>Loves to drive and practices safe driving<br/><br/>Understands great customer service<br/><br/>Enjoys being part of a team<br/><br/><strong>Other Requirements<br/><br/></strong>1+ years of work-related driving/delivering experience<br/><br/>1+ years experience driving a cargo van or large vehicle<br/><br/>Must be able to lift, push, pull up to 50 lbs<br/><br/>Must be at least 21 years old<br/><br/>Good driving record<br/><br/>Must consent to drug/alcohol screen &amp; background verification<br/><br/>Salary: $15.50 per hour<br/><br/>Benefits: Paid Sick Leave, Paid Vacation, Health Insurance, Competitive Bonus<br/><br/>We look forward to hearing from you.<br/><br/>For questions please contact us at: info @qxlogistix.com<br/><br/>Or call our HR Department at: 310-526-3711 extension 115<br/><br/>QX Website: www.qxlogistix.com<br/><br/>We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3939691380"}