{"jobTitle": "Housing Navigator", "company": {"name": "Homeless Health Care Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other, Information Technology, and Management", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>POSITION OVERVIEW:<br/><br/></strong>Under the direction of the Housing Navigation Program Manager, the Housing Navigator works directly with program participants and develops, arranges and coordinates treatment services. The Housing Navigator provides linkage to permanent, affordable housing service for homeless individuals who meet the criteria to available Homeless Health Care Los Angeles Housing Subsidized Programs. The Housing Navigator also works to improve the health of homeless individuals by assisting with the provision of stable housing, development of a comprehensive treatment plan and facilitating linkages to medical care, mental health care, alcohol/substance use treatment, housing retention and other supportive services.<br/><br/><strong>PRINCIPAL DUTIES &amp; RESPONSIBILITIES: <br/><br/></strong><ul><li>Conducts comprehensive assessments (CES surveys, ASAM/ASI, vulnerability index tools etc.) to determine appropriate housing options, case management and other supportive service needs. </li><li>Rapidly enrolls referrals received from LAHSA, and/or interim housing providers, including gathering documentation needed for enrollment and creating Housing and Services Plans (HSP) in collaboration with participants</li><li>Assists participants in identifying and applying for units, time limited subsidy programs, housing vouchers, and/or permanent supportive housing resources, based on the individuals needs and housing qualifications. </li><li>Collaborates with other community partners to support the lease up process, including verifying property ownership, inspecting units, submitting move-in packets, and facilitating warm hand-offs with other care team members to ensure continuity of care. </li><li>Provides trauma informed services that align with Housing First and Harm Reduction philosophies, are in accordance with agency and funder expectations, and abide by legal and ethical standards. </li><li>Acts as an advocate/ liaison for participants who are experiencing housing barriers (e.g. poor credit, evictions, etc.), while establishing and maintaining a professional relationship with landlords and property owners</li><li>Develops and networks with representatives in other agencies/community based agencies to support individuals in attaining services such as housing, mental health care, medical treatment, financial assistance, legal advocacy, etc. </li><li>Networks and collaborates with community based organizations to obtain referrals and ensure contractual capacity is met. </li><li>Responsible for networking, collaborating and assisting participants in locating and obtaining housing in an expedient manner in line with the Housing First Model. </li><li>Develops on-going housing stock inventory (i.e. Property Management, private landlords, Realtors) for program and agency needs to assist all clients in obtaining permanent supportive housing. </li><li>Documents client’s progress related to their participation in housing and supportive services, intake and exit/discharges into the HMIS data system and charts within required deadlines. </li><li>Implements and consistently practices harm reduction, trauma informed care, housing first and integrated care interventions. </li><li>Able to serve a diverse vulnerable client populations and communicate effectively in a culturally competent manner. </li><li>Able to work in a multi-disciplinary team environment, utilizing professional, open and respectful communication. Maintains a solution focused, strengths based and client centered approach with managers, co-workers and clients of HHCLA. </li><li>Ensures performance management standards are met through ongoing supervision addressing barriers as they arise. </li><li>Maintains client records according to HIPAA and adheres to all client confidentiality requirements and standards. </li><li>Complies and maintains familiarity with agency and program policies and procedures and other applicable regulations. </li><li>Attends and participates in supervision, staff meetings, trainings, conferences, workshops, and special projects to promote professional development. </li><li>Models HHCLA approach, mission and core values in all communication, correspondence, community events, coalitions and advocacy efforts. </li><li>Reports to work on time and maintains reliable and regular attendance. </li><li>Maintains current licensing and/or certification as required for position. </li><li>Other duties as assigned. <br/><br/></li></ul><strong>QUALIFICATIONS &amp; SKILLS:<br/><br/></strong><strong>REQUIRED:<br/><br/></strong><strong>Education and Work Experience: <br/><br/></strong><ul><li>Bachelor’s Degree in the social services/human services field or a minimum of one year of experience providing housing location or case management support to persons experiencing homelessness, or at risk of homelessness, including working with persons experiencing chronic health issues, mental health needs, or with histories of substance use. <br/><br/></li></ul><strong>Knowledge and Skills: <br/><br/></strong><ul><li>Familiar with the principles of Harm Reduction, Motivational Interviewing, Trauma Informed Care, Housing First and Integrated Care</li><li>Experience working with culturally diverse communities and vulnerable populations</li><li>Ability to effectively present information and respond to questions from clients, office personnel, other employees and the general public</li><li>Ability to work in fast-paced, high energy environment</li><li>Ability to define problems and use critical thinking skills to identify solutions</li><li>Ability to work independently and with others – including other employees, clients and members of the public -- in face-to-face and telephonic contexts</li><li>Ability to multi-task, establish priorities and manage time, meet deadlines and perform duties under time constraints</li><li>Ability to be flexible and adapt to changing work demands</li><li>Maintain high level of concentration and attention to detail for extended periods of time</li><li>Ability to respond effectively to sensitive inquiries or concerns</li><li>Maintain a high level of ethical and professional standards in accordance with agency policies</li><li>Computer literate (basic working knowledge of Microsoft WORD, Excel, and Outlook) and data/electronic records</li><li>Must possess a valid California Driver’s License, properly registered vehicle and insurance<br/><br/></li></ul><strong>PREFERRED:<br/><br/></strong><ul><li>Strong written skills</li><li>Bilingual</li><li>Knowledge of non-violent crisis intervention. </li><li>Familiarity with HMIS database desired. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>Homeless Health Care Los Angeles (HHCLA) is a nonprofit, community-based organization that provides comprehensive behavioral health and holistic health care to address the unique challenges of people who are experiencing homelessness. Driven by socially conscious Angelenos for fellow Angelenos, HHCLA has been providing a pathway to health, recovery and emotional well-being without bias or judgement for more than 30 years. With a continuum of services that includes counseling, substance use treatment, syringe exchange, overdose prevention, and housing with supportive services, HHCLA seeks to improve the quality of life and capacity for stability of the people they serve, and help them secure and stay in permanent housing.<br/><br/>Homeless Health Care Los Angeles (HHCLA) is a nonprofit, community-based organization that provides comprehensive behavioral health and holistic health care to address the unique challenges of people who are experiencing homelessness. Driven by socially conscious Angelenos for fellow Angelenos, HHCLA has been providing a pathway to health, recovery and emotional well-being without bias or judgement for more than 30 years. With a continuum of services that includes counseling, substance use treatment, syringe exchange, overdose prevention, and housing with supportive services, HHCLA seeks to improve the quality of life and capacity for stability of the people they serve, and help them secure and stay in permanent housing.", "postedDate": "2 months ago", "skills": ["Harm Reduction", "Motivational Interviewing", "Trauma Informed Care", "Housing First", "Integrated Care", "Microsoft WORD", "Excel", "Outlook", "HMIS", "Strong written skills", "Bilingual", "non-violent crisis intervention"], "url": "https://www.linkedin.com/jobs/view/3939349596"}