{"jobTitle": "Senior Merchant", "company": {"name": "Birdy Grey", "industry": "Apparel & Fashion", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles, CA (Hybrid)", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Apparel & Fashion", "description": "Birdy Grey is a direct-to-consumer brand whose mission is to celebrate and elevate friendships during one of the most important milestones in a person’s life: THE WEDDING. Founded in 2017 by best friends Grace Lee (CEO & Founder) and Monica Ashauer (President & Co-Founder), Birdy Grey offers affordable bridesmaid dresses starting at $100, and fun gifts and accessories for everyone in the bridal party. Brides and bridesmaids alike count on Birdy Grey for their most important day—so much so that we’ve dressed over half a million bridesmaids (and counting) in less than 5 years.", "responsibilities": "Create and manage merchandise assortment and inventory strategies that drive sales growth and maintain margin targets. Build seasonal line plans partnering with the Design and Product Development teams. Create the replenishment strategy partnering with Planning and PD, guiding long-range fabric & style expansion. Own in-season management of the assortment including new category testing and markdowns. Analyze category performance to identify risks and opportunities in weekly leadership meetings. Participate in weekly fittings to inform style adoption and execution. Manage relationship with wholesale vendors, including pricing and terms negotiations. Partner with planning to build a pre-season sales and inventory plan as well as manage sales and inventory forecasting of OTB for all categories, updated monthly. Partner with brand marketing on promotions and launch timing strategy. Partner with E-commerce team to manage new product launch process, make site merchandising recommendations and strategize on cross-selling opportunities. Uphold brand price positioning and pricing strategy for non-dress categories. Identify key trends in the marketplace and recommend assortment additions accordingly. Partner with Planning to Identify potential short-stocked positions or stockouts and make recommendations to correct in order to avoid any sales misses. Work closely with product development and production team on categories purchased via vertical suppliers; Identify opportunities to shift any wholesale items in-house to maximize profit. Develop comprehensive assortment strategies across E-commerce channel, identifying new product opportunities to deliver high growth expectations. Maintain an understanding of the competitive landscape and impart key insights into line development and build seasonal product knowledge for the website. Act as cross-departmental liaison, creating a consistent flow of communication throughout the organization.", "qualifications": {"required": "8+ years in DTC e-commerce environment in retail buying, and/or merchandising capacity. Strong experience with sales forecasting, assortment building, and inventory management. Excellent Excel proficiency strongly preferred. Strong knowledge of retail math and merchandising concepts, including the product development cycle and strategy of building and maintaining both fashion and core programs across different categories. Experience with Looker or other similar data platforms preferred. Ability to work independently with strong time management skills. A proactive and collaborative approach; you love working with people and people love working with you. Analytical mindset with a strong ability to compile, analyze, and report data. Hard working and willing to roll sleeves up - no job is too big or too small. You have an entrepreneurial spirit. You thrive in a dynamic, fast-paced, fluid environment. You are comfortable with ambiguity and take initiative.", "preferred": "2+ years as the lead Merchant for a retail start up. Fashion and bridal e-commerce experience a plus. Knowledge of planning."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Competitive Compensation: Based on experience and performance + Annual Performance Bonus. Healthcare Benefits: 100% employer covered medical dental & vision plans, 50% spouse and dependent medical coverage + access to One Medical + Mental Health Benefits. Retirement: 401K + up to 4% match after 3 months. Generous PTO: Flexible Open PTO Policy + 11 paid holidays. Wellness: A monthly wellness day + $50 monthly wellness stipend + summer Fridays. Flexibility: Partial remote with a high level of autonomy and accountability + $50 monthly WIFI stipend. Employee Discount: Free bridesmaid dresses + 50% discounts on Birdy Grey products. Family Benefits: 3 months of paid parental leave. Purpose: Join in the success of a high-growth, 80% women, minority founded, early-stage startup by driving performance and building out new processes.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3939111671"}