{"jobTitle": "Human Resources Business Partner", "company": {"name": "Alstom", "location": "Los Angeles, CA", "industry": "Truck Transportation and Railroad Equipment Manufacturing"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "92k to $123k USD", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Truck Transportation and Railroad Equipment Manufacturing", "description": "Req ID: 457588<br/><br/>At Alstom, we understand transport networks and what moves people. From high-speed trains, metros, monorails, and trams, to turnkey systems, services, infrastructure, signalling and digital mobility, we offer our diverse customers the broadest portfolio in the industry. Every day, more than 80 000 colleagues lead the way to greener and smarter mobility worldwide, connecting cities as we reduce carbon and replace cars.<br/><br/>Do you want to join a world leader in the railway sector? Our Los Angeles location is looking for an ambitious HR Business Partner.<br/><br/><strong>Purpose of the job:<br/><br/></strong>He/She is in charge of providing a professional HR support to local business partners, adherence to company policy and deployment of Alstom HR initiatives and ensures line managers develop their human relation skills to care for their teams<br/><br/><strong>Accountabilities<br/><br/></strong><strong>ACCOUNTABILITIES &amp; AUTHORITIES<br/><br/></strong><strong>Counselling Business on HR topics<br/><br/></strong><ul><li>Be proximate to the business – both line managers and employees, in order to understand their issues and prepare HR actions to address them</li><li>Understand and prioritise business needs, and translate them into HR actions, and then deliver</li><li>Implement Business / Corporate/Group HR strategy as applies to the Region / Globally</li><li>Ensure that all policy and rules are followed according to the Delegation of Authority</li><li>Advice, support and influence management on all HR related issues, policies and processes.</li><li>Deploy ALPS/ HRIS, and assure sustainability of accuracy of data, and develop and use metrics to measure HR performances, including introducing tools for new countries at appropriate time with support from P&amp;T</li><li>Assure good Industrial Relations with unions and social partners in the country/scope</li><li>Supervise, lead local HR to deliver day to day operational support (People process, data accuracy, EHS policy)</li><li>Facilitate the budget process for his/her scope and is accountable for his/her budget<br/><br/></li></ul><strong>Recruitment :<br/><br/></strong><ul><li>Ensure project staffing and site HR support are secured on time.</li><li>Prepare manpower/workforce planning as solid base for recruitment, and create succession plans, and assure enough anticipation and effective implementation;</li><li>With the team, build a good base for sourcing of candidates, including internal candidates, and build relations with recruitment agencies;</li><li>Personally interview for key positions in area of responsibility, recommend whether to employ, and decision on salary &amp; employment conditions. Influence line managers as necessary;</li><li>Makes sure the process of induction and probationary period is performed.<br/><br/></li></ul><strong>Total Rewards:<br/><br/></strong><ul><li>Work closely with C&amp;B and HRD to develop appropriate policies and practices and to align Alstom practices with evolution of market;</li><li>Assure implementation of annual salary review and STI/bonus payments on time;</li><li>Follow-up of the incentive schemes set up by the Company;</li><li>Assure job grading is maintained up-to-date, and develop at the appropriate time for new countries, supported by C&amp;B;</li><li>Highlight any C&amp;B issues to HRD and Management.<br/><br/></li></ul><strong>Development:<br/><br/></strong><ul><li>Build managers’ ownership of the management of their people, including coaching at a senior level;</li><li>Implement the Alstom performance management system;</li><li>Prepare &amp; manage the annual People Review, including development plans and ensure feedback to individuals;</li><li>Define and implement the development activities appropriate to each individual;</li><li>Define and implement training programs, and measure their efficiency;</li><li>Be the trainer of key training programs, such as PMTD (Performance Management and Talent Development); <br/><br/></li></ul><strong>Performance measurements:<br/><br/></strong><ul><li>Timely fulfilment of People Management Cycle (PMC) of relevant communities</li><li>Implementation of high quality and cost effectiveness collective development plan for the community</li><li>Recruitment, retention of high performers and key/critical positions</li><li>Adherence to the budget (HC &amp; Cost)</li><li>Feedback from stakeholders<br/><br/></li></ul><strong>Educational Requirements<br/><br/></strong><strong>EXPERIENCE PREREQUISITES &amp; REQUIRED COMPETENCES<br/><br/></strong><strong>Mandatory:<br/><br/></strong>University degree, majoring in human resources, psychology, business studies, social science or economy<br/><br/><strong>Experience<br/><br/></strong><strong>Mandatory:<br/><br/></strong><ul><li>5 - 7 years HR experience in a similar industry/environment</li><li>Experience of 3-5 years of applying California legislation knowledge required</li><li>Generalist HR management experience covering all areas of HR management practice.</li><li>Influence and resilience within a matrix organization structure</li><li>Professional expertise in employment law issues, redundancies, payroll and employee relations</li><li>2 or more years of Labor Relations/Union experience<br/><br/></li></ul><strong>Desirable:<br/><br/></strong><ul><li>Experience of HR operational aspects (Talent availability, Salary &amp; Benefit, Legal/Labour Compliance, Social Context)</li><li>Certificate in PHR or SPHR (or similar) preferred<br/><br/></li></ul><strong>Competencies &amp; Skills<br/><br/></strong><ul><li>Organisational skills</li><li>Excellent communication skills with transparency , Influencing and Persuasion skills</li><li>Business acumen , being able to understand company finances, resourcing and the ultimate aims of the business is important</li><li>Confident and at ease sharing opinions and expertise</li><li>Intercultural awareness</li><li>Collaboration &amp; Teamwork</li><li>Management skills</li><li>Able to handle conflict/ crucial conversation</li><li>Ability to make decisions/Sense of urgency</li><li>Proficient with Microsoft Office (Word, Excel, PowerPoint &amp; Outlook)</li><li>Ability to manage time and projects effectively.<br/><br/></li></ul>You don’t need to be a train enthusiast to thrive with us. We guarantee that when you step onto one of our trains with your friends or family, you’ll be proud. If you’re up for the challenge, we’d love to hear from you!<br/><br/><strong>Important to note<br/><br/></strong>As a global business, we’re an equal-opportunity employer that celebrates diversity across the 63 countries we operate in. We’re committed to creating an inclusive workplace for everyone.<br/><br/>Job Type: Experienced<br/><br/><strong>Salary Range: </strong>$92k to $123k USD<br/><br/>", "responsibilities": "He/She is in charge of providing a professional HR support to local business partners, adherence to company policy and deployment of Alstom HR initiatives and ensures line managers develop their human relation skills to care for their teams", "qualifications": {"required": "University degree, majoring in human resources, psychology, business studies, social science or economy<br/><br/>5 - 7 years HR experience in a similar industry/environment<br/><br/>Experience of 3-5 years of applying California legislation knowledge required<br/><br/>Generalist HR management experience covering all areas of HR management practice.<br/><br/>Influence and resilience within a matrix organization structure<br/><br/>Professional expertise in employment law issues, redundancies, payroll and employee relations<br/><br/>2 or more years of Labor Relations/Union experience", "preferred": "Experience of HR operational aspects (Talent availability, Salary &amp; Benefit, Legal/Labour Compliance, Social Context)<br/><br/>Certificate in PHR or SPHR (or similar) preferred"}, "skills": ["Organisational skills", "Communication skills", "Influencing", "Persuasion skills", "Business acumen", "Intercultural awareness", "Collaboration", "Teamwork", "Management skills", "Conflict resolution", "Decision making", "Sense of urgency", "Microsoft Office", "Time management", "Project management"], "postedDate": "2 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3939158447"}