{"jobTitle": "Product Growth Analyst", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "128,000.00/yr - 185,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "We’re looking for growth leaders for products used by billions of people and businesses all over the world across our apps including Facebook, Instagram, WhatsApp and Oculus. This is a leadership opportunity to drive impact end-to-end through the product development life cycle. The product growth analyst role is embedded within product teams and requires using a mix of skills including analysis, creative product ideation, and cross-functional collaboration. Success in the role is tied directly to product goals and the team rewards results-based performance.The Growth practice was started right here at Meta, putting you at the forefront of the industry with great opportunity to learn about growth from experts. It is a lean and highly regarded team with a strong and close-knit culture and emphasis on regular sharing of successful strategies, tactics and insights across products. Our team values are to own the outcome, focus on driving sustainable impact, and put team success first. There is great opportunity to be a leader and influence the direction of high-visibility and high-impact initiatives, and to see your work come to life in some of the most widely used apps in the world.Meta is an equal opportunity employer that provides competitive benefits to reward good talent. Our benefits include generous paid time off, retirement investment plans with employer matching, holistic wellness program including physical and mental health and internal community and mentorship groups.<br/><br/>Product Growth Analyst Responsibilities:<br/><br/><ul><li>Lead growth strategy across a large product area and drive cross-team alignment</li><li>Drive long term growth of Meta Inc products through a combination of data analysis, product ideation, and experimentation to optimize product experiences</li><li>Understand trends in user behavior and product usage to influence growth strategy</li><li>Identify opportunities to drive growth and prioritize them to maximize long-term growth</li><li>Execute on projects by working closely with engineering and other members of product teams to land impact on product goals. Lead experimentation from designing tests to analyzing results that lead to launch decisions<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Bachelor's degree in a directly related field, or equivalent practical experience.</li><li>6+ years experience working in an analytical or product role</li><li>Proven to effectively collaborate across variety of technical and non-technical functions to drive towards common product goals</li><li>Experience working with and influencing multi disciplinary product teams consisting but not limited to software engineers, designers, product managers and data scientists</li><li>Proficiency in quantitative analysis geared towards drawing actionable insights from complex datasets</li><li>Experience performing exploratory analysis with minimal direction to answer ambiguous open ended questions</li><li>Experimentation experience to design multivariate tests, synthesize test results and build frameworks to make data-informed launch decisions</li><li>Creative product ideation skills to apply growth tactics broadly to different product areas and think through detailed elements of a product experience</li><li>Experience with data querying languages (e.g. SQL)</li><li>Experience working on a product or service used by diverse communities<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$128,000/year to $185,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Lead growth strategy across a large product area and drive cross-team alignment\nDrive long term growth of Meta Inc products through a combination of data analysis, product ideation, and experimentation to optimize product experiences\nUnderstand trends in user behavior and product usage to influence growth strategy\nIdentify opportunities to drive growth and prioritize them to maximize long-term growth\nExecute on projects by working closely with engineering and other members of product teams to land impact on product goals. Lead experimentation from designing tests to analyzing results that lead to launch decisions", "qualifications": {"required": "Bachelor's degree in a directly related field, or equivalent practical experience.\n6+ years experience working in an analytical or product role\nProven to effectively collaborate across variety of technical and non-technical functions to drive towards common product goals\nExperience working with and influencing multi disciplinary product teams consisting but not limited to software engineers, designers, product managers and data scientists\nProficiency in quantitative analysis geared towards drawing actionable insights from complex datasets\nExperience performing exploratory analysis with minimal direction to answer ambiguous open ended questions\nExperimentation experience to design multivariate tests, synthesize test results and build frameworks to make data-informed launch decisions\nCreative product ideation skills to apply growth tactics broadly to different product areas and think through detailed elements of a product experience\nExperience with data querying languages (e.g. SQL)\nExperience working on a product or service used by diverse communities", "preferred": ""}, "skills": ["Data Analysis", "Product Ideation", "Cross-Functional Collaboration", "Growth Strategy", "User Behavior", "Experimentation", "SQL"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Meta is an equal opportunity employer that provides competitive benefits to reward good talent. Our benefits include generous paid time off, retirement investment plans with employer matching, holistic wellness program including physical and mental health and internal community and mentorship groups.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3939343490"}