{"jobTitle": "Business Development Manager", "company": {"name": "80Twenty", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Advertising Services", "description": "Our client, a rapidly growing full service creative agency working with some of the biggest names in sports, arts, culture and entertainment is looking for a Business Development Manager to join their successful team. Having already built relationships for project based campaigns with Apple, Asics, Carhartt, Inter Miami FC, LA Dodgers, Nike and the Golden State Valkyries, the agency is looking for an ambitious and accomplished Business Development Manager to help them reach the next level.\n\nWorking closely with the CEO and ownership team, this role has the opportunity to build out the wider business development function within the agency that already has a lot of inbound leads. You will be selling creative agency services into the C-suite of some of the most well known companies within sports, culture and entertainment globally, so an ability to own a sales cycle from prospecting, through to RFP, writing SOWs, closing and maintaining relationships with a client is essential for the role. A strong knowledge of creative agency services, whether brand identity, copywriting, creative design and direction or production, and an ability to speak confidently and strategically (with help from the wider team!) to those services is important.\n\n* Identify and pursue new business opportunities that align with the our client’s vision and goals.\n* Develop and implement strategies to attract high-profile clients, including those in the celebrity and elite markets.\n* Foster and maintain strong relationships with existing clients to ensure repeat business and referrals.\n* Act as the primary point of contact for key clients, ensuring exceptional service and satisfaction.\n* Develop client engagement strategies to enhance the client experience and build loyalty.\n* Represent our client at industry events, conferences, and networking opportunities to build brand awareness.\n* Utilize social media and digital platforms to engage with potential clients and showcase the company’s work.\n* Work with the team to develop and refine growth strategies and objectives.\n* Analyze performance metrics and provide regular reports on business development activities and outcomes.\n* Identify and recommend improvements to business processes and client services to support growth.\n* Establish and nurture strategic partnerships with other companies, agencies, and vendors to expand service offerings and market reach.\n* Negotiate and manage contracts with partners and vendors to ensure mutually beneficial relationships.\n\n**Requirements**\n\n* Bachelor’s degree in Business, Marketing, Communications, or a related field.\n* 3-5+ years of experience in business development, sales, or marketing, preferably in the creative industry.\n* Proven track record of achieving business growth targets and managing high-profile clients.\n* Excellent communication, negotiation, and interpersonal skills.\n* Strong strategic thinking and analytical abilities.", "responsibilities": "Identify and pursue new business opportunities that align with the our client’s vision and goals. Develop and implement strategies to attract high-profile clients, including those in the celebrity and elite markets. Foster and maintain strong relationships with existing clients to ensure repeat business and referrals. Act as the primary point of contact for key clients, ensuring exceptional service and satisfaction. Develop client engagement strategies to enhance the client experience and build loyalty. Represent our client at industry events, conferences, and networking opportunities to build brand awareness. Utilize social media and digital platforms to engage with potential clients and showcase the company’s work. Work with the team to develop and refine growth strategies and objectives. Analyze performance metrics and provide regular reports on business development activities and outcomes. Identify and recommend improvements to business processes and client services to support growth. Establish and nurture strategic partnerships with other companies, agencies, and vendors to expand service offerings and market reach. Negotiate and manage contracts with partners and vendors to ensure mutually beneficial relationships.", "qualifications": {"required": "Bachelor’s degree in Business, Marketing, Communications, or a related field. 3-5+ years of experience in business development, sales, or marketing, preferably in the creative industry. Proven track record of achieving business growth targets and managing high-profile clients. Excellent communication, negotiation, and interpersonal skills. Strong strategic thinking and analytical abilities."}, "skills": [], "postedDate": "14 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3939296619"}