{"jobTitle": "Plant Engineering Manager", "company": {"name": "CTC Global", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Manufacturing", "description": "Job Title: PLANT ENGINEERING MANAGER<br/><br/>Reports To: DIRECTOR, GLOBAL MANUFACTURING<br/><br/>Location: Irvine, CA USA<br/><br/>Department: OPERATIONS<br/><br/><strong>Summary<br/><br/></strong>The Plant Engineering Manager is responsible for providing leadership and direction to plant engineering, maintenance, and facilities at the Irvine location. This individual is responsible for implementing a world-class maintenance program, repairs, preventive maintenance, and installation of equipment at the Irvine location. This individual also provides support to all international plants to install and commission machines, troubleshoot machine failures, and provide guidance on breakdowns and preventive maintenance.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Contribute to the creation and implementation of best practice maintenance vision, strategy, processes, and procedures to aid and improve operational performance. </li><li>Lead by example - consistently promote and demonstrate high-performance standards and outcome-based thinking. </li><li>Uphold and embrace the company values.</li><li>Develop reports by conducting training meetings, one-on-one development sessions, and outside technical skills training.</li><li>Focused on preventive &amp; predictive maintenance, not reactive. </li><li>Drive toward zero unplanned equipment downtime in the facility by implementing Total .</li><li>Mentor the team to identify root causes for equipment downtime and effectively manage corrective actions.</li><li>Perform Performance Evaluations on direct reports. </li><li>Continually increasing the effectiveness of our computerized maintenance management system (CMMS).</li><li>Use CMMS effectively to drive improvements in machine uptime, response time, and optimal parts inventory.</li><li>Ensure that all maintenance operations are done in accordance with company policy and OSHA guidelines.</li><li>Ensure that the facility satisfies all industry regulations.</li><li>Ensure the facility is always in good operating condition and is reflective of our work environment and values.</li><li>Plan, budget, and schedule facility modifications as needed, including cost estimates and layouts, and manage contractors.</li><li>Expand future production capacities. </li><li>Ensure that the facility infrastructure, such as the UPS system, generator, and compressors, is maintained well.</li><li>Conduct risk assessments of processes and tasks in the department. </li><li>Perform other duties and responsibilities as needed and assigned.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>High school diploma or equivalent qualification.</li><li>Bachelor’s degree in business administration, facility management, or a similar field is preferred.</li><li>A minimum of 5 years’ experience in maintenance.</li><li>Previous experience in Maintenance Management required.</li><li>Good understanding of compressors and electrical systems.</li><li>Strong knowledge of facilities, machines, and equipment.</li><li>Excellent organizational and leadership abilities.</li><li>Exceptional communication and interpersonal skills.<br/><br/></li></ul><strong>Benefits For All Full-time Employees Include<br/><br/></strong>Medical (HMO/PPO Plan Options)<br/><br/>Dental<br/><br/>Vision<br/><br/>Group Term Life Insurance (CTC pays 100% of the premium)<br/><br/>Short-Term Disability and Long-Term Disability (CTC pays 100% of the premium)<br/><br/>Flexible Spending Account<br/><br/>401K<br/><br/>15 paid vacation days (more after 5 years)<br/><br/>9 paid holidays<br/><br/>3 paid sick leave days", "responsibilities": "Contribute to the creation and implementation of best practice maintenance vision, strategy, processes, and procedures to aid and improve operational performance. Lead by example - consistently promote and demonstrate high-performance standards and outcome-based thinking. Uphold and embrace the company values. Develop reports by conducting training meetings, one-on-one development sessions, and outside technical skills training. Focused on preventive &amp; predictive maintenance, not reactive. Drive toward zero unplanned equipment downtime in the facility by implementing Total . Mentor the team to identify root causes for equipment downtime and effectively manage corrective actions. Perform Performance Evaluations on direct reports. Continually increasing the effectiveness of our computerized maintenance management system (CMMS). Use CMMS effectively to drive improvements in machine uptime, response time, and optimal parts inventory. Ensure that all maintenance operations are done in accordance with company policy and OSHA guidelines. Ensure that the facility satisfies all industry regulations. Ensure the facility is always in good operating condition and is reflective of our work environment and values. Plan, budget, and schedule facility modifications as needed, including cost estimates and layouts, and manage contractors. Expand future production capacities. Ensure that the facility infrastructure, such as the UPS system, generator, and compressors, is maintained well. Conduct risk assessments of processes and tasks in the department. Perform other duties and responsibilities as needed and assigned.", "qualifications": {"required": "High school diploma or equivalent qualification. A minimum of 5 years’ experience in maintenance. Previous experience in Maintenance Management required. Good understanding of compressors and electrical systems. Strong knowledge of facilities, machines, and equipment. Excellent organizational and leadership abilities. Exceptional communication and interpersonal skills.", "preferred": "Bachelor’s degree in business administration, facility management, or a similar field is preferred."}, "skills": [], "postedDate": "2 months ago", "benefits": "Medical (HMO/PPO Plan Options)<br/><br/>Dental<br/><br/>Vision<br/><br/>Group Term Life Insurance (CTC pays 100% of the premium)<br/><br/>Short-Term Disability and Long-Term Disability (CTC pays 100% of the premium)<br/><br/>Flexible Spending Account<br/><br/>401K<br/><br/>15 paid vacation days (more after 5 years)<br/><br/>9 paid holidays<br/><br/>3 paid sick leave days", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3940323168"}