{"jobTitle": "Office Manager", "company": {"name": "Professional Partners Group", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "<strong>Job Summary<br/><br/></strong>We are seeking an experienced Office Administrator to oversee the daily operations of our Glendale Office. The ideal candidate will be responsible for managing secretarial staff, ensuring efficient office operations, and supporting company procedures.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Oversee and coordinate office operations and secretarial staff</li><li> Manage office supplies inventory and place orders as necessary</li><li> Handle scheduling, appointments, and meetings for office operation’s needs</li><li> Supervise secretarial staff and collaborate coverage for attorneys, to ensure optimal productivity</li><li> Manage vendor relationships and assist to negotiate contracts, as requested</li><li> Maintain a safe and secure working environment<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Proven experience in office management or similar role, preferably in the Legal industry.</li><li> Proficiency in managing support staff</li><li> Strong supervisory skills with the ability to lead a team effectively</li><li> Excellent organizational and multitasking abilities</li><li> Familiarity with vendor management and negotiation practices</li><li> Exceptional phone etiquette and front desk management skills<br/><br/></li></ul><strong>Nice-to-have Skills<br/><br/></strong><ul><li> Experience in a law firm</li><li>Experience with ProLaw and other legal software's<br/><br/></li></ul>This position offers the opportunity to contribute to a dynamic work environment, competitive compensation, and the chance to showcase your skills in a professional setting. If you are a detail-oriented individual with a passion for office management, we encourage you to apply.", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3940030225"}