{"jobTitle": "Operations Associate", "company": {"name": "The Bay Club Company", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "<strong><em>Our Mission<br/><br/></em></strong>The Bay Club Company is much more than a hospitality company.<br/><br/>We provide experiences which celebrate a healthy and vibrant lifestyle.<br/><br/><strong><em>Our Culture<br/><br/></em></strong>Our unique culture is at the heart of all we do and is guided by our values and behaviors. It’s what we expect of ourselves and each other every day. We call them the “Actions We Live By.”<br/><br/><strong><em>Our Core Values:<br/><br/></em></strong><strong>Actions We Live By. </strong>It’s who we are when we step into our <em>full power</em>.<br/><br/><strong>Keep It Real. Always. </strong>We need open and honest discussions. We need courage to speak up and to call things out that aren’t good enough. And we navigate tough conversations with empathy and grace.<br/><br/><strong>Think Ahead. Be An Owner.</strong> Always be proactive, not reactive; be on the front foot. If we want to be an owner of this business, we must act like it!<br/><br/><strong>Stay Humble. Hustle Harder. </strong>Show up and do the hard work<strong>. </strong>Be a gritty, roll-up-your-sleeves kind of crew<strong>. </strong>Know it’s never about one person–we are a part of a powerful team.<br/><br/><strong>One Team. One Voice.</strong> <strong>Moving Forward. Together. </strong>Be ONE united team. When we move in the same direction, there are no limits to what we can accomplish.<br/><br/><strong>Be Curious. Ask Why. </strong>Stay member curious<strong>. </strong>We seek to understand, and we <em>never </em>settle. We ask questions to truly understand the core of a matter.<br/><br/><strong>General Summary<br/><br/></strong>The Operations Associate is responsible for contributing to the success of the overall operation by assisting in a variety of roles throughout the club. These associates are responsible for providing the highest level of member service, maintaining club cleanliness, and consistently demonstrating a positive and professional attitude. This position enhances overall knowledge of operations and hospitality and develops career growth potential by providing experience in all aspects of the Club.<br/><br/><strong>Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.<br/><br/></strong><strong>Primary Job Functions<br/><br/></strong>Customer Service<br/><br/><ul><li>Greet members and guests upon arrival to the Club</li><li>Check members in by verifying their membership</li><li>Ensure all guests to the Club fully complete a Guest Registration Waiver and pay any applicable Guest Fees</li><li>Book appointments, program and class reservations for members</li><li>Provide information regarding Club programming and facilities</li><li>Deliver exceptional service experience to members, guests, and Associates with a goal of retaining guests for repeat business</li><li>Represent the club in a professional manner through image, dress, communication, and immediate follow through and response </li><li>Provide membership sales team with guest/prospect lead contact information <br/><br/><br/></li></ul>Reception Desk Oversight (if applicable)<br/><br/><ul><li>Operate cash register</li><li>Process payments</li><li>Manage/handle cash and balance cash drawer each shift.</li><li>Perform opening and/or closing duties, as required</li><li>Answer and transfer phone calls<br/><br/><br/></li></ul>Café Oversight (if applicable)<br/><br/><ul><li>Create and serve food and beverage items</li><li>Promote daily specials and encourage upgrades to each order</li><li>Operate cash register, process payments through cash or credit card handling and/or member account charges</li><li>Café opening and/or closing duties, as required</li><li>Maintain a clean, safe work environment according to State and Local food safety standards<br/><br/><br/></li></ul>Pool Deck Oversight (if applicable)<br/><br/><ul><li>Greet members and guests upon arrival to the Pool Area</li><li>Act as a Host in the designated area or event space</li><li>Work with the F&amp;B team to offer food and drinks from designated food outlets: (act as server, place orders, delivery refreshments, ring in tickets on register, provide support to kitchen, set up and breakdown of event space, clean-up)</li><li>Offer seating, make members/guests comfortable and provide a tour of Pool Deck amenities </li><li>Communicate and book appointments for programs and events</li><li>Provide information regarding Club programming and facilities updates</li><li>Assist with maintaining refreshment stations: Refill water, stock supplies and keep clean</li><li>Provide towels as needed, assist with towel operation<br/><br/><br/></li></ul>Parking Garage Oversight (if applicable)<br/><br/><ul><li>Warmly greeting each member with a smile</li><li>Check members and guests in by verifying their membership</li><li>When necessary, audit cars parked in garage </li><li>Perform any opening and/or closing duties, as required<br/><br/><br/></li></ul>Cleanliness<br/><br/><ul><li>Assist in maintaining the cleanliness and stock levels throughout the Club (primarily focused on Sports Desk, Locker Rooms, Lobby, Fitness Areas, Pool Deck and Surrounding Areas)</li><li>Detail cleaning and preventive maintenance responsibility such as re-stocking towel shelves, empty and wipe down trash cans, disinfect and clean toilets and showers, clean vanity mirrors and top lights, vacuum carpets, mop floors regularly, and dry mop wet areas</li><li>Restock vanity supplies and replenish inventory and janitorial products</li><li>Maintain a clean, safe work environment</li><li>Assist with laundry functions that include collecting, washing, drying, and folding towels <br/><br/><br/></li></ul>Communication and Relationships<br/><br/><ul><li>Communicate timely and follow up, as appropriate</li><li>Active participation in required events, programs, meetings and trainings <br/><br/><br/></li></ul><strong>Other Job Functions<br/><br/></strong><ul><li>Flexibility in work schedule, as job may require day and evening shifts, weekends, and holidays.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>MINIMUM QUALIFICATIONS<br/><br/></strong><strong>To perform this job successfully, an individual must be able to perform each primary job function satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></strong><strong>Skills &amp; Knowledge<br/><br/></strong><ul><li>Policies and Regulations -- Knowledge of company polices.</li><li>Written Comprehension and Expression -- Ability to read, understand and communicate information and ideas in writing so others will understand. </li><li>Oral Comprehension and Expression --Ability to understand and communicate so others can understand ideas and information.</li><li>Computer -- Ability to utilize club software program and email communication software, such as Microsoft Outlook.<br/><br/><br/></li></ul><strong>Experience &amp; Education<br/><br/></strong><ul><li>At least one year experience in the hospitality industry or related service position preferred.</li><li>Food Safety certified (if applicable)</li><li>Professional, friendly manner and excellent customer service attitude and abilities</li><li>Strong verbal communication and conflict resolution skills </li><li>Enthusiastic, responsible, and dependable team player</li><li>Self-motivated, takes initiative, anticipate the needs of others and willing to acquire new skills</li><li>Well organized and detail oriented</li><li>CPR certified<br/><br/><br/></li></ul><strong>Working Conditions/ Physical Requirements<br/><br/></strong><strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></strong>While performing the duties of this job, the Associate is regularly required to stand for extended periods; use hands and fingers, handle or feel; reach with hands and arms; and talk and hear. The Associate is occasionally required to walk; stoop, kneel, crouch, or crawl; and taste or smell. The Associate must frequently lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, and ability to adjust focus. -- should this be bullet pointed out?<br/><br/>The noise level in the work environment is usually moderate.<br/><br/>The language skills, reasoning ability, physical demands, and work environment described are representative of those that must be met by an Associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Job Description Revision<br/><br/></strong><strong>This is not necessarily an exhaustive list of all responsibilities, skills, duties, requirements, efforts or working conditions associated with this job. While this job description is intended to be an accurate reflection of the current job, management reserves the right to revise the job or to require that other or different tasks be performed when circumstances change. This job description replaces all previous descriptions for this position.<br/><br/></strong><strong><em>An Equal Opportunity Employer</em></strong><strong> <br/><br/></strong><strong><em>The Bay Club Company (“TBCC”) provides equal employment opportunities without regard to race (and all traits historically associated with race, including but not limited to, hair texture and protective hairstyles), color, religion, creed (including, but not limited to, religious dress and grooming practices), sex (including pregnancy, childbirth or related medical conditions, and breastfeeding, and other related medical conditions), sexual orientation and identity, gender, gender identity, gender expression, actual or perceived national origin/ancestry, accent or ability to speak English, age, disability, marital/familial status, source of income, veteran status, citizenship status, political activities or affiliations, medical condition, genetic information, persons with AIDS or AIDS-related condition, or persons who are victims of domestic violence.</em></strong>", "responsibilities": "The Operations Associate is responsible for contributing to the success of the overall operation by assisting in a variety of roles throughout the club. These associates are responsible for providing the highest level of member service, maintaining club cleanliness, and consistently demonstrating a positive and professional attitude. This position enhances overall knowledge of operations and hospitality and develops career growth potential by providing experience in all aspects of the Club.", "qualifications": {"required": "To perform this job successfully, an individual must be able to perform each primary job function satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "preferred": "At least one year experience in the hospitality industry or related service position preferred."}, "skills": ["Customer Service", "Hospitality", "Cash Handling", "Food Safety", "Communication", "Conflict Resolution", "Teamwork", "Organization", "Detail Oriented", "CPR"], "postedDate": "2 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3940303094"}