{"jobTitle": "Chief Operating Officer", "company": {"name": "Legal Aid Foundation of Los Angeles", "location": "Los Angeles, CA", "industry": "Law Practice"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Management and Manufacturing", "industry": "Law Practice", "description": "About the Position:\n\nAre you interested in joining an organization dedicated to increasing access to justice while addressing systemic inequities among the most vulnerable members of the Greater Los Angeles area? If yes, LAFLA is the place for you!\n\nThe Organization:  LAFLA is a nonprofit law firm that protects and advances the rights of the most underserved—leveling the playing field and ensuring that everyone can have access to the justice system. Celebrating 95 years of service to Los Angeles communities, LAFLA is the first and most experienced legal aid organization in Greater Los Angeles. LAFLA has more than 200 employees, including more than 100 attorneys, who provide free services and resources on a broad range of civil legal issues that impact healthy, safety, and self-sufficiency. Every year, LAFLA helps more than 100,000 people find their voice, regain control of their lives, and build a brighter future. Our unique combination of neighborhood offices, self-help centers at courthouses, and domestic violence clinics puts LAFLA on the frontlines in communities at the forefront of change. LAFLA also engages in impact litigation to help enact long-term systemic change—actively collaborating with a network of public and private partners to expand access to justice, identify needs in the communities we serve, and change laws and policies that adversely affect the underserved. For more information, please visit www.lafla.org .\n\nThe Position: Legal Aid Foundation is seeking a dynamic, highly motivated, and experienced leader to serve as a key member of its senior management team, working with and reporting directly to the Executive Director & Board of Directors on a broad range of issues.\n\nLAFLA is currently accepting applications for the position of Chief Operating Officer.\n\n<ul><li>Assigned location is subject to change during the course of employment. <br/><br/></li></ul>Qualifications:\n\n<ul><li>10 years of prior experience as a COO or in a related position at a nonprofit, foundation, government, or industry</li><li>A bachelor’s or advanced degree</li><li>Strong business acumen and a history of providing visionary leadership at the executive level</li><li>Proven experience executing organization growth and leading a similar or larger size successful nonprofit and/or related entity</li><li>Proven experience working with and leading a nonprofit Board and working with diverse groups of people</li><li>Experience working directly with people from diverse backgrounds and incorporating their perspectives in the consideration of impacts and outcomes of a decision-making</li><li>An understanding of the concepts of institutional and structural racism and bias and their impact on underserved and underrepresented communities;</li><li>Experience working directly with people from diverse backgrounds and incorporating their perspectives in the consideration of impacts and outcomes of a decision-making</li><li>An understanding of the concepts of institutional and structural racism and bias and their impact on underserved and underrepresented communities;</li><li>Experience thoughtfully managing complex organizations, programs, and/or operations, including driving strategies to mobilize and encourage teams and improve organizational performance;<br/><br/></li></ul>Examples of Duties:\n\nExecutive Leadership and Organizational Management\n\n<ul><li>Provide thoughtful and visionary executive leadership that is inclusive, transparent, and empowering in a manner that supports and guides the organization’s mission</li><li>Managing LAFLA day-to-day office operations and improving administrative systems, policies, and processes to facilitate responsive staff support and service;</li><li>Oversee Human Resources, IT and Facilities using active collaboration and effective leadership</li><li>Identifying, designing, and advising the Executive Director & Board of Directors on innovative and strategic projects and initiatives that are responsive to evolving organizational and/or community needs and require input and coordination across LAFLA. </li><li>Continually foster a culture that encourages collaboration between departments and recognizes positive contributions</li><li>Contribute to the strategic plan and drive its implementation<br/><br/></li></ul>Board of Directors\n\n<ul><li>Attend all Board meetings and provide reports and updates on staff as well as all current work, project timelines, and project and organizational progress</li><li>Work with the board as needed to build consensus, remind of outstanding deliverables, and offer support<br/><br/></li></ul>Financial Management and Administration\n\n<ul><li>Collaboratively working with the CFO to ensure maximum resource utilization, budget management, and maintenance of the organization in a positive financial position<br/><br/></li></ul>How to Apply:\n\nHOW TO APPLY  – Please submit a cover letter and resume online via the link: https://apply.workable.com/stronger-consulting/j/F77113D7E6/\n\nINTRODUCTORY PERIOD  – A one-year introductory period will be required.\n\nAN EQUAL OPPORTUNITY EMPLOYER  – Selection will be based solely on merit and will be without discrimination because of race, color, national origin, ancestry, ethnicity, citizenship, creed, sex, gender, sexual orientation, gender identity, transgender status, age, religion, genetic information, physical or mental disability, medical condition, military or veteran status, pregnancy, childbirth or related medical condition, marital or registered domestic partners status, or any other legally protected status.\n\nThe company is committed to equal employment opportunity and providing reasonable accommodations to qualified candidates and employees pursuant to applicable law. We value and encourage diversity and solicit applications from all qualified applicants without regard to race, color, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, military and veteran status, gender identity or expression, genetic information, or any other characteristic protected by federal, state, or local law. If you require reasonable accommodation as part of the application process or expect to require an accommodation if hired, please contact humanresources@lafla.org .\n\nBenefits & Compensation\n\nLAFLA offers a diverse environment with competitive compensation based on comparable public interest salaries. We also offer a generous benefits package for full-time employees including medical, dental, and vision for employees and dependents, life insurance, long-term disability and long-term care insurance, and 403(b) retirement plan. Employees may also qualify for bilingual supplements, law student loan reimbursements, and a cell phone stipend.", "responsibilities": "Provide thoughtful and visionary executive leadership that is inclusive, transparent, and empowering in a manner that supports and guides the organization’s mission\nManaging LAFLA day-to-day office operations and improving administrative systems, policies, and processes to facilitate responsive staff support and service;\nOversee Human Resources, IT and Facilities using active collaboration and effective leadership\nIdentifying, designing, and advising the Executive Director & Board of Directors on innovative and strategic projects and initiatives that are responsive to evolving organizational and/or community needs and require input and coordination across LAFLA. \nContinually foster a culture that encourages collaboration between departments and recognizes positive contributions\nContribute to the strategic plan and drive its implementation\nAttend all Board meetings and provide reports and updates on staff as well as all current work, project timelines, and project and organizational progress\nWork with the board as needed to build consensus, remind of outstanding deliverables, and offer support\nCollaboratively working with the CFO to ensure maximum resource utilization, budget management, and maintenance of the organization in a positive financial position", "qualifications": {"required": "10 years of prior experience as a COO or in a related position at a nonprofit, foundation, government, or industry\nA bachelor’s or advanced degree\nStrong business acumen and a history of providing visionary leadership at the executive level\nProven experience executing organization growth and leading a similar or larger size successful nonprofit and/or related entity\nProven experience working with and leading a nonprofit Board and working with diverse groups of people\nExperience working directly with people from diverse backgrounds and incorporating their perspectives in the consideration of impacts and outcomes of a decision-making\nAn understanding of the concepts of institutional and structural racism and bias and their impact on underserved and underrepresented communities;\nExperience working directly with people from diverse backgrounds and incorporating their perspectives in the consideration of impacts and outcomes of a decision-making\nAn understanding of the concepts of institutional and structural racism and bias and their impact on underserved and underrepresented communities;\nExperience thoughtfully managing complex organizations, programs, and/or operations, including driving strategies to mobilize and encourage teams and improve organizational performance;"}, "skills": [], "postedDate": "2 months ago", "benefits": "LAFLA offers a diverse environment with competitive compensation based on comparable public interest salaries. We also offer a generous benefits package for full-time employees including medical, dental, and vision for employees and dependents, life insurance, long-term disability and long-term care insurance, and 403(b) retirement plan. Employees may also qualify for bilingual supplements, law student loan reimbursements, and a cell phone stipend.", "url": "https://www.linkedin.com/jobs/view/3940233430"}