{"jobTitle": "Staff Accountant", "company": {"name": "Ernest", "industry": "Packaging and Containers Manufacturing", "size": "Not specified", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$72,000.00/yr - $77,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Accounting/Auditing", "industry": "Packaging and Containers Manufacturing", "description": "For over 77 years, Ernest has been committed to the success of our extended family, our customers, our employees, and the packaging industry itself. When you work with Ernest, you’ll enjoy the advantages of learning proven methods of success, a proactive approach, and having fun while earning what you’re worth with a lot of really awesome people. Ernest is currently in search of a Staff Accountant for our corporate office located in the city of Commerce, CA. This is a full-time position that offers a competitive pay rate, benefits, along with a WONDERFUL employee first culture.", "responsibilities": "This position is responsible for performing a variety of accounting duties to ensure accurate and timely completion of work within the Finance Department. Actively supports the achievement of the Company by performing a variety of higher level accounting duties and responsibilities. Promotes and protects Ernest’s core values including teamwork and respect of others in order to maintain a positive work environment. Builds and maintains positive working relationships within the Department, the Division, and the Company through professional interactions. Month end close and Year end close for the divisions assigned. Prepares financial statements including Balance Sheets and Income Statements. Reconciles General Ledger accounts and investigate any unreconciled differences. Prepares journal entries including proper General Ledger account, department, division, and project cost coding. Maintains monthly amortization schedules. Prepares monthly bank reconciliations and investigates any unreconciled differences. Maintains fixed assets information/depreciation for the books. Complete Sales Tax returns. Interface with other departments in the education and application of accounting policies. Travels as required to assist divisions in their annual physical inventory.", "qualifications": {"required": "Bachelor's Degree in Accounting, CPA not required. Minimum of five years’ experience in Accounting. A solid understanding of Finance and Accounting theories, practices, and terminologies. Proficiency in SAP and Vertex a plus. Must have strong computer skills and the ability to learn in a fast-paced environment. Must be able to create and/or maintain Excel spreadsheets using formulas. Must be able to work independently with minimal supervision to meet deadlines. Must demonstrate the ability to maintain a high level of confidentiality. Strong analytical and problem solving skills. Must be able to analyze a project/problem and define a better procedure/solution. Attention to detail is a must. Experience with multiple entities is a plus.", "preferred": ""}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "Competitive pay rate, benefits, along with a WONDERFUL employee first culture.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3940838235"}