{"jobTitle": "Executive Assistant", "company": {"name": "Legal Aid Foundation of Los Angeles", "industry": "Law Practice", "size": "200+ employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Law Practice", "description": "Are you interested in joining an organization dedicated to increasing access to justice while addressing systemic inequities among the most vulnerable members of the Greater Los Angeles area? If yes, LAFLA is the place for you! LAFLA is a nonprofit law firm that protects and advances the rights of the most underserved—leveling the playing field and ensuring that everyone can have access to the justice system. Celebrating 95 years of service to Los Angeles communities, LAFLA is the first and most experienced legal aid organization in Greater Los Angeles. LAFLA has more than 200 employees, including more than 100 attorneys, who provide free services and resources on a broad range of civil legal issues that impact healthy, safety, and self-sufficiency. Every year, LAFLA helps more than 100,000 people find their voice, regain control of their lives, and build a brighter future. Our unique combination of neighborhood offices, self-help centers at courthouses, and domestic violence clinics puts LAFLA on the frontlines in communities at the forefront of change. LAFLA also engages in impact litigation to help enact long-term systemic change—actively collaborating with a network of public and private partners to expand access to justice, identify needs in the communities we serve, and change laws and policies that adversely affect the underserved. For more information, please visit www.lafla.org.", "responsibilities": "Supports Executive Director in all day-to-day activities including routine and high-level administrative tasks; Develop materials (presentations, reports, scripts, etc.) for key meetings and events with staff, board members, partner organizations, and government officials; Build an understanding of organizational structure along with a deep, strategic knowledge of the Executive Directors priorities to interact with internal and external partners on behalf of the Executive Director and manage the flow of information and contacts in and out of the Executive Director’s office; Support the committees of the Board of Directors, including coordinating meetings of the Board of Directors and its committees, maintaining board documentation, preparing meeting agendas, minutes and reports, and preparing and distributing board packets; Perform administrative functions, in support of the Executive Director, such as note-taking, document preparation, invoice submission, and data entry; Create databases, conducting research, and carrying out other projects as prescribed; Serves as a gatekeeper and savvy time organizer to ensure effective calendaring, meeting schedule, and equitable prioritization of leadership time towards department needs; Serves as a liaison between the Executive Director and senior-level management staff, members of the Board Directors, donors and volunteers; Maintains quality filing and communications systems including electronic document management and archiving; Manage documents requiring signatures and authorizations; Coordinate travel arrangements, trainings, meetings and retreat logistics; Assist with planning and coordinating agency events, such as All Staff meetings; Provides administrative support to the Legal Directors by coordinating legal staff training registration, travel and other training logistics; Draft and design general correspondences, memos, charts, tables, graphs, agendas, and minutes. Proofread copy for spelling, grammar, and layout, making appropriate changes; Maintain governance and administrative files, including corporate documents, board meeting materials, contracts and vendor agreements, and travel and expense records; Exercises diplomacy, independent judgment and initiative in screening incoming calls and correspondence in a wide range of areas requiring a thorough knowledge of LAFLA’s procedures and policies; Work on complex assignments and special projects where independent action and a high degree of initiative are required; Contribute to the organization’s DEI plan and goals (via surveys, interviews, etc), supporting all DEI initiatives and helping to promote inclusion in a thoughtful way.", "qualifications": {"required": "A bachelor’s degree, and a minimum of 3 years of experience directly supporting a senior executive; Prior experience providing administrative support and developing materials for board meetings including preparing agendas, minutes, reports and coordinating meeting logistics required; Proven project management and project delivery experience; Ability to manage, anticipate, coordinate and facilitate activities with colleagues; Ability to build strong and sustainable relationships with people throughout the organization; Ability to handle sensitive and confidential situations with diplomacy; Demonstrated ability to manage multiple tasks and complex logistics in a high-pressure environment; Must have excellent inter-personal skills including verbal and written communication skills; Excellent organizational skills and attention to detail; Highly experienced in electronic communications; Strong work ethic/self-motivated multi-tasker; Excellent computer proficiency and demonstrated ability to utilize Microsoft Office 365 suite (Word, Excel, PowerPoint, Outlook), Adobe Acrobat, and video-conferencing software; Must be able to exercise independent judgment and initiative; Must be able to create reports, handle correspondence and compose letters independently or from oral or written instructions; Must be able to work evenings, and weekends as required; and Must have the ability to travel locally.", "preferred": ""}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "LAFLA offers a diverse environment with competitive compensation based on comparable public interest salaries. We also offer a generous benefits package for full-time employees including medical, dental, and vision for employees and dependents, life insurance, long-term disability and long-term care insurance, and 403(b) retirement plan. Employees may also qualify for bilingual supplements, law student loan reimbursements, and a cell phone stipend.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3940235208"}