{"jobTitle": "Operations Associate - Thousand Oaks Mall", "company": {"name": "JCPenney", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion, Transportation, Logistics, Supply Chain and Storage, and Retail", "description": "<strong>General Description<br/><br/></strong>The <strong>Operations Associate’s </strong>role is to create an outstanding customer experience by performing operations functions within the store. The Operations Associate role is an early morning position and you will work with the a team to perform functions prior to store opening.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Customer Service – You’re maneuvering around the store at a fast pace, working with all the latest merchandise, but when a customer stops to ask you a question or request assistance, there’s no one they’d rather be talking to other than you.</li><li>Executes pricing and signing – You can change ticket prices and signing on merchandise across the store better and faster than anyone!</li><li>Replenish and restock the store: You understand the needs of the customer. When merchandise is getting low, you assist your sales floor peers and leaders by pulling and preparing merchandise to go the floor in order to ensure all of our customers have the styles and sizes they need.</li><li>Receive and unload merchandise: You work with your co-workers to unload a truck and prepare the merchandise in the backroom.</li><li>Backroom standards: You keep the stockroom safe, clean, and organized .</li><li>Omnichannel: You will contribute to Omichannel efforts including Buy Online Pickup in Store, Ship from Store, Order Delivery and Returns, Shipping Online Orders, and Merchandise Receiving.</li><li>Merchandise strategy: You take the plans that have been communicated by leadership on where to place merchandise throughout the store and execute the plan with efficiency and detail. You understand the merchandising standards and work to deliver an outstanding customer experience by maintaining these standards as you flow goods to the sales floor.</li><li>Participates in a learning environment: You absorb new information from your peers or training materials on our merchandise, shrink, safety, productivity, and other business processes.<br/><br/></li></ul><strong>Core Competencies &amp; Accomplisments<br/><br/></strong><ul><li>Results: Solve problems and make smart decisions that drive sales, profit or customer service; execute your work efficiently and effectively; inspire strong performance in yourself and others</li><li>Ownership: Provide great customer service; cooperate and build positive, inclusive and respectful relationships; take accountability for your actions and outcomes</li><li>Intensity: Proactively find ways to improve the customer experience; show the confidence and courage to do what’s right; take action with energy and urgency</li><li>Work experience- 1-2 years retail experience<br/><br/></li></ul>At this time, JCPenney does not anticipate closing this job opportunity.<br/><br/><strong>What You Get<br/><br/></strong>If eligible, we offer a competitive benefits package including medical/dental/vision, term life insurance, paid vacation/holidays*, and 401(k) with Company match. All associates are eligible for an associate discount on JCPenney merchandise. For paid holidays, associates who are eligible for paid vacation (MTO) are also eligible for eight paid holidays during the calendar year. All store hourly associates scheduled to work on a designated holiday will receive additional compensation. *For paid vacation days, as well as eligibility requirements for other benefits, please visit http://www.yourjcpbenefits.com<br/><br/><strong>About JCPenney<br/><br/></strong>JCPenney is the shopping destination for diverse, working American families. With inclusivity at its core, the Company's product assortment meets customers' everyday needs and helps them commemorate every special occasion with style, quality, and value. JCPenney offers a broad portfolio of fashion, apparel, home, beauty, and jewelry from national and private brands and provides personal services including salon, portrait and optical. The Company and its 50,000 associates worldwide serve customers where, when, and how they want to shop - from jcp.com to more than 650 stores in the U.S. and Puerto Rico. In 2022, JCPenney celebrates 120 years as an iconic American brand by continuing its legacy of connecting with customers through shopping and community engagement. Please visit JCPenney's Newsroom to learn more and follow JCPenney on Facebook, Instagram, Twitter, and LinkedIn.<br/><br/><strong>Job Title:</strong> Operations Associate - Thousand Oaks Mall<br/><br/><strong>Location:</strong> Thousand Oaks, CA, United States - Thousand Oaks Mall 280 Hillcrest Dr W<br/><br/><strong>Job ID:</strong> 1096998<br/><br/>J.C. Penney Company Inc.<br/><br/>Plano, Texas", "responsibilities": "The <strong>Operations Associate’s </strong>role is to create an outstanding customer experience by performing operations functions within the store. The Operations Associate role is an early morning position and you will work with the a team to perform functions prior to store opening.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Customer Service – You’re maneuvering around the store at a fast pace, working with all the latest merchandise, but when a customer stops to ask you a question or request assistance, there’s no one they’d rather be talking to other than you.</li><li>Executes pricing and signing – You can change ticket prices and signing on merchandise across the store better and faster than anyone!</li><li>Replenish and restock the store: You understand the needs of the customer. When merchandise is getting low, you assist your sales floor peers and leaders by pulling and preparing merchandise to go the floor in order to ensure all of our customers have the styles and sizes they need.</li><li>Receive and unload merchandise: You work with your co-workers to unload a truck and prepare the merchandise in the backroom.</li><li>Backroom standards: You keep the stockroom safe, clean, and organized .</li><li>Omnichannel: You will contribute to Omichannel efforts including Buy Online Pickup in Store, Ship from Store, Order Delivery and Returns, Shipping Online Orders, and Merchandise Receiving.</li><li>Merchandise strategy: You take the plans that have been communicated by leadership on where to place merchandise throughout the store and execute the plan with efficiency and detail. You understand the merchandising standards and work to deliver an outstanding customer experience by maintaining these standards as you flow goods to the sales floor.</li><li>Participates in a learning environment: You absorb new information from your peers or training materials on our merchandise, shrink, safety, productivity, and other business processes.<br/><br/></li></ul>", "qualifications": {"required": "Work experience- 1-2 years retail experience<br/><br/>"}, "skills": [], "postedDate": "2 months ago", "benefits": "If eligible, we offer a competitive benefits package including medical/dental/vision, term life insurance, paid vacation/holidays*, and 401(k) with Company match. All associates are eligible for an associate discount on JCPenney merchandise. For paid holidays, associates who are eligible for paid vacation (MTO) are also eligible for eight paid holidays during the calendar year. All store hourly associates scheduled to work on a designated holiday will receive additional compensation. *For paid vacation days, as well as eligibility requirements for other benefits, please visit http://www.yourjcpbenefits.com", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3941458325"}