{"jobTitle": "Manager, Retail Merchandise Production", "company": {"name": "Warner Music Group", "location": "Los Angeles, CA", "industry": "Entertainment Providers, Musicians, and Book and Periodical Publishing"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Entertainment Providers, Musicians, and Book and Periodical Publishing", "description": "At Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses:<br/><br/><ul><li>Music is Everything: Music is our passion, and we can never get enough. Tastes, trends, and tech will change, but great artists and songwriters will always be our driving force.</li><li>Global Growth, Local Expertise: Music is a global language. Through communication and collaboration, our success can come from anywhere and translate everywhere.</li><li>Innovation and Insight: Pushing the boundaries requires the best information and the boldest imagination. We use both to create the future.</li><li>Empowered by People: Like the artists we serve and the music they make, our differences make us stronger. This is a place where every talent can belong and build a career.<br/><br/></li></ul>We remain committed to Diversity, Equity, and Inclusion. We know it fosters a culture where you can truly belong, contribute, and grow. We encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity.<br/><br/>Consider a career at WMG and get the best of both worlds – an innovative global music company that retains the creative spirit of a nimble independent.<br/><br/><strong>A little bit about our team:<br/><br/></strong>The merchandise production team provides production and purchasing for merchandise for US concert tours, eCommerce and outside retailers as well as corporate and label promotions. Merchandise includes a variety of branded apparel and accessories.<br/><br/><strong>Your role:<br/><br/></strong>Day to day sourcing &amp; purchasing various merchandise including decorated apparel, headwear, jewelry, etc, working closely with vendors to quote, manufacture, ship and deliver to Retail customers. Constant monitoring of multiple orders simultaneously. Collaborates with team members and communicates relevant information to leadership and delegates priorities to coordinators. Drives for Success: Proactively takes concrete actions to complete tasks. Go the “extra mile” and overcomes obstacles to improve outputs. This is a fast paced, high volume position that requires multi-tasking, resourcefulness &amp; problem solving. Supporting artists, retail sales team, product managers and other internal stakeholders to source, vet, purchase, manage production and deliver merchandise for a vast roster of artists.<br/><br/><strong>Here you’ll get to:<br/><br/></strong><ul><li>Support Merchandise Production team and a variety of internal customers (Retail Sales, Product Managers, Creative, Operations, accounting, etc)</li><li>Source, vet, develop and maintain vendor relationships across an array of suppliers</li><li>Prioritize and manage incoming orders</li><li>Create quotes and purchase orders working closely with vendors to for successful delivery</li><li>Manage production schedule</li><li>Review and approve shipping plans</li><li>Manage packing and tracking to insure all stakeholders receive records in a timely manner</li><li>Host weekly meetings w/stakeholders and vendors to review work in progress</li><li>Communicate shipment schedule to Retailers, Inventory Control and others daily</li><li>Monitor monthly invoice report to insure timely reconciliation</li><li>Maintain vendor report card and create semi annual review</li><li>Train and mentor new team members<br/><br/></li></ul><strong>About you:<br/><br/></strong><ul><li>You have 3 years Apparel Procurement/Purchasing and/or Project management experience</li><li>You have excellent organizational, time management and attention to detail skills</li><li>You can work independently yet always a team player.</li><li>You are customer focused and results driven</li><li>You enjoy training, managing and supporting team members</li><li>You enjoy a fast paced environment, can prioritize and take swift action to solve problems</li><li>You have strong communication skills</li><li>You have Google, Excel, PowerPoint skills and willing to learn new software and work flow systems<br/><br/></li></ul><strong>We’d love it if you also had:<br/><br/></strong><ul><li>Retail merchandise, Music merchandise and/or eCommerce experience</li><li>Apparel print/decorating, custom cut &amp; sew apparel and manufacturing experience</li><li>Product management system and/or Order management system experience<br/><br/></li></ul><strong>About us: <br/><br/></strong>As the home to Asylum, Atlantic, East West, Elektra, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Rhino, Roadrunner, Sire, Warner Records, Warner Classics, and several other of the world’s premier recording labels, Warner Music Group champions emerging artists and global superstars alike. And our renowned publishing company, Warner Chappell Music, represents genre-spanning songwriters and producers through a catalogue of more than one million copyrights worldwide. Redefining what it means to be a music company in the 21st century, our consumer brands include trend-setters like UPROXX, Songkick, HipHopDX, and EMP. We’re the home to WMX – the next generation services division that connects artists with fans and amplifies brands in creative, immersive, and engaging ways – and Alternative Distribution Alliance (ADA) – the ground-breaking global distribution company for independent artists and labels.<br/><br/>Together, we are <strong>Warner Music Group: Music With Vision &amp; Voice.<br/><br/></strong><strong>Love this job and want to apply?<br/><br/></strong>Click the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.<br/><br/>Don’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.<br/><br/>Thanks for your interest in working for WMG. We love it here, and think you will, too.<br/><br/><strong>Salary Range<br/><br/></strong>$60,000 to $66,560 Annually<br/><br/><strong><em>Salary ranges are included for job postings where required by law. </em></strong><em><strong>The actual base pay is dependent upon many factors, such as work experience and business needs. The pay range is subject to change at any time dependent on a variety of internal and external factors.<br/><br/></strong></em><strong>WMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.<br/><br/></strong><strong>Copyright © 2023 Warner Music Inc.<br/><br/></strong>Links to relevant documents:<br/><br/>2024 Benefits At A Glance final.pdf<br/><br/>EVerify Participation Poster.pdf<br/><br/>Right To Work .pdf", "responsibilities": "The merchandise production team provides production and purchasing for merchandise for US concert tours, eCommerce and outside retailers as well as corporate and label promotions. Merchandise includes a variety of branded apparel and accessories.<br/><br/><strong>Your role:<br/><br/></strong>Day to day sourcing &amp; purchasing various merchandise including decorated apparel, headwear, jewelry, etc, working closely with vendors to quote, manufacture, ship and deliver to Retail customers. Constant monitoring of multiple orders simultaneously. Collaborates with team members and communicates relevant information to leadership and delegates priorities to coordinators. Drives for Success: Proactively takes concrete actions to complete tasks. Go the “extra mile” and overcomes obstacles to improve outputs. This is a fast paced, high volume position that requires multi-tasking, resourcefulness &amp; problem solving. Supporting artists, retail sales team, product managers and other internal stakeholders to source, vet, purchase, manage production and deliver merchandise for a vast roster of artists.<br/><br/><strong>Here you’ll get to:<br/><br/></strong><ul><li>Support Merchandise Production team and a variety of internal customers (Retail Sales, Product Managers, Creative, Operations, accounting, etc)</li><li>Source, vet, develop and maintain vendor relationships across an array of suppliers</li><li>Prioritize and manage incoming orders</li><li>Create quotes and purchase orders working closely with vendors to for successful delivery</li><li>Manage production schedule</li><li>Review and approve shipping plans</li><li>Manage packing and tracking to insure all stakeholders receive records in a timely manner</li><li>Host weekly meetings w/stakeholders and vendors to review work in progress</li><li>Communicate shipment schedule to Retailers, Inventory Control and others daily</li><li>Monitor monthly invoice report to insure timely reconciliation</li><li>Maintain vendor report card and create semi annual review</li><li>Train and mentor new team members<br/><br/></li></ul>", "qualifications": {"required": "You have 3 years Apparel Procurement/Purchasing and/or Project management experience\nYou have excellent organizational, time management and attention to detail skills\nYou can work independently yet always a team player.\nYou are customer focused and results driven\nYou enjoy training, managing and supporting team members\nYou enjoy a fast paced environment, can prioritize and take swift action to solve problems\nYou have strong communication skills\nYou have Google, Excel, PowerPoint skills and willing to learn new software and work flow systems<br/><br/>", "preferred": "Retail merchandise, Music merchandise and/or eCommerce experience\nApparel print/decorating, custom cut &amp; sew apparel and manufacturing experience\nProduct management system and/or Order management system experience<br/><br/>"}, "skills": ["Apparel Procurement", "Purchasing", "Project Management", "Organizational Skills", "Time Management", "Attention to Detail", "Customer Service", "Teamwork", "Communication", "Google", "Excel", "PowerPoint", "Retail Merchandise", "Music Merchandise", "eCommerce", "Apparel Print", "Decorating", "Custom Cut", "Sew Apparel", "Manufacturing", "Product Management System", "Order Management System"], "postedDate": "1 month ago", "salary": {"amount": "60,000.00 - 66,560.00", "currency": "USD"}, "benefits": "2024 Benefits At A Glance final.pdf", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3941433917"}