{"jobTitle": "HR Operations Manager", "company": {"name": "SAG-AFTRA Health Plan | SAG-Producers Pension Plan", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "97,200.00/yr - 145,800.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Insurance", "description": "For more than 60 years the SAG-AFTRA Health Plan and SAG-Producers Pension Plan (the Plans) have provided health and retirement benefits to thousands of entertainment professionals and their dependents across the globe. The Plans are currently undergoing a major transformation focused on evolving our operations toward a participant-inspired experience.  This is an exciting opportunity for a skilled Human Resources Manager to support our efforts.\n\nThe Human Resources Operations Manager is a key leadership role responsible for overseeing the daily operations of the HR department and ensuring the efficient and effective delivery of HR services. This position involves managing HR systems and processes, administering HR programs, and driving process improvements to enhance operational efficiency.\n\nThis role looks to achieve operational excellence through the development of processes and reporting metrics that support the achievement of the organizations business goals. They ensure we recruit, onboard, and retain top talent while continuously improving HR services.  Reporting directly to the Director of Talent and Organizational Development and working closely with HR colleagues to ensure all HR duties are undertaken in accordance with employment law, company policy and ensuring any risk to the business is minimized.\n\nResponsibilities include, but are not limited to:\n\n* Oversee all HR operational activities, including employee data management, HRIS administration, HR policies and procedures, compliance, and HR service delivery.\n* Manage HR systems and tools, ensuring they are properly implemented, integrated, and optimized to support HR processes and data management. Stay updated on HR technology trends and recommend improvements or enhancements to streamline operations.\n* Develop, implement, and maintain HR policies, procedures, and guidelines to ensure compliance with employment laws and regulations. Review and update policies as needed to align with organizational changes and best practices.\n* Ensure accurate and confidential maintenance of employee data, including personnel files, payroll information, benefits enrollment, and other HR records. Develop and enforce data management protocols and security measures.\n* Stay up-to-date with local, state, and federal employment laws and regulations. Ensure HR processes and practices comply with legal requirements. Conduct audits and implement corrective actions as necessary.\n* Administer HR programs, such as performance management, employee onboarding, employee offboarding, benefits administration, leave management, and employee recognition programs. Continuously improve program effectiveness and efficiency.\n* Develop and generate HR reports and analytics to provide insights on key HR metrics, trends, and workforce analytics. Identify opportunities for improvement and make data-driven recommendations to enhance HR operations.\n* Continuously evaluate HR processes and identify opportunities for streamlining and automating workflows. Develop and implement process improvements to enhance operational efficiency, accuracy, and employee experience.\n* Provide guidance and support to employees on HR-related matters, including policies, benefits, payroll, and HR systems. Foster a customer service-oriented approach within the HR team to ensure prompt and accurate resolution of employee inquiries.\n* Collaborate with external vendors and service providers to ensure effective delivery of outsourced HR services and HR technology platforms. Manage vendor relationships and monitor service level agreements.\n* Manages a pay plan by conducting periodic pay surveys; scheduling and conducting job evaluations; preparing pay budgets; monitoring and scheduling individual pay actions; and recommending, planning, and implementing pay structure revisions.\n* Implements employee benefits programs and informs employees of benefits by studying and assessing benefit needs and trends; recommending benefit programs to management; obtaining and evaluating benefit contract bids; awarding benefit contracts; and designing and conducting educational programs on benefit programs.\n* Completes human resource operational requirements by scheduling and assigning employees and following up on work results. Advances human resource staff job results by counseling and disciplining employees; and planning, monitoring, and appraising job results.\n* Communicates effectively by developing and delivering communications that convey clear understanding; provides timely and helpful information and feedback to team members and others across the organization; encourages open expression of ideas and opinions.\n\nQualifications:\n\n* Bachelor’s degree in from a four-year college or university, preferably in Business Administration, Human Resources or another related field.\n* HR certification (e.g., SHRM-CP, PHR) or Master’s Degree in Human Resources Management\n* Strong knowledge of HR policies, procedures, and of California and New York state and federal labor laws and regulations.\n* Experience in HRIS administration and HR systems implementation.\n* Proven track record in process improvement and project management.\n* Strong attention to detail and accuracy in data management.\n* Demonstrated ability to prioritize tasks and meet deadlines in a fast-paced environment.\n* Strong data and talent analytic skills/ mindset, with experience problem-solving and measuring impacts and outcomes.\n* Demonstrated ability to establish and maintain effective working relationships with all levels of employees.\n\nWhat We Offer:\n\n* Competitive Market Salary\n* Comprehensive Medical, Dental, Vision insurance\n* Generous Pension Plan\n* Voluntary 401k participation \n* Home Internet Stipend (monthly) &amp; Office Equipment Reimbursement \n* Access to discounted theme park, movie tickets, etc through GreatWorkPerks\n* Continuous Education: LinkedIn Learning, Internal Learning Systems, etc.\n\nThe salary range for this position is $97,200.00 to $145,800.00 and will commensurate with experience related to the role. \n\nFor more information on Life at the Plans visit: LinkedIn: Life at the Plans\n\nSAG-AFTRA Health Plans and SAG-Producer Pension Plans provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. \n\nWe are actively seeking job applicants and are committed to inclusive hiring across departments and levels. ", "responsibilities": "Oversee all HR operational activities, including employee data management, HRIS administration, HR policies and procedures, compliance, and HR service delivery. Manage HR systems and tools, ensuring they are properly implemented, integrated, and optimized to support HR processes and data management. Stay updated on HR technology trends and recommend improvements or enhancements to streamline operations. Develop, implement, and maintain HR policies, procedures, and guidelines to ensure compliance with employment laws and regulations. Review and update policies as needed to align with organizational changes and best practices. Ensure accurate and confidential maintenance of employee data, including personnel files, payroll information, benefits enrollment, and other HR records. Develop and enforce data management protocols and security measures. Stay up-to-date with local, state, and federal employment laws and regulations. Ensure HR processes and practices comply with legal requirements. Conduct audits and implement corrective actions as necessary. Administer HR programs, such as performance management, employee onboarding, employee offboarding, benefits administration, leave management, and employee recognition programs. Continuously improve program effectiveness and efficiency. Develop and generate HR reports and analytics to provide insights on key HR metrics, trends, and workforce analytics. Identify opportunities for improvement and make data-driven recommendations to enhance HR operations. Continuously evaluate HR processes and identify opportunities for streamlining and automating workflows. Develop and implement process improvements to enhance operational efficiency, accuracy, and employee experience. Provide guidance and support to employees on HR-related matters, including policies, benefits, payroll, and HR systems. Foster a customer service-oriented approach within the HR team to ensure prompt and accurate resolution of employee inquiries. Collaborate with external vendors and service providers to ensure effective delivery of outsourced HR services and HR technology platforms. Manage vendor relationships and monitor service level agreements. Manages a pay plan by conducting periodic pay surveys; scheduling and conducting job evaluations; preparing pay budgets; monitoring and scheduling individual pay actions; and recommending, planning, and implementing pay structure revisions. Implements employee benefits programs and informs employees of benefits by studying and assessing benefit needs and trends; recommending benefit programs to management; obtaining and evaluating benefit contract bids; awarding benefit contracts; and designing and conducting educational programs on benefit programs. Completes human resource operational requirements by scheduling and assigning employees and following up on work results. Advances human resource staff job results by counseling and disciplining employees; and planning, monitoring, and appraising job results. Communicates effectively by developing and delivering communications that convey clear understanding; provides timely and helpful information and feedback to team members and others across the organization; encourages open expression of ideas and opinions.", "qualifications": {"required": "Bachelor’s degree in from a four-year college or university, preferably in Business Administration, Human Resources or another related field. HR certification (e.g., SHRM-CP, PHR) or Master’s Degree in Human Resources Management Strong knowledge of HR policies, procedures, and of California and New York state and federal labor laws and regulations. Experience in HRIS administration and HR systems implementation. Proven track record in process improvement and project management. Strong attention to detail and accuracy in data management. Demonstrated ability to prioritize tasks and meet deadlines in a fast-paced environment. Strong data and talent analytic skills/ mindset, with experience problem-solving and measuring impacts and outcomes. Demonstrated ability to establish and maintain effective working relationships with all levels of employees.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Competitive Market Salary Comprehensive Medical, Dental, Vision insurance Generous Pension Plan Voluntary 401k participation  Home Internet Stipend (monthly) &amp; Office Equipment Reimbursement  Access to discounted theme park, movie tickets, etc through GreatWorkPerks Continuous Education: LinkedIn Learning, Internal Learning Systems, etc.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3941704597"}