{"jobTitle": "Supply Chain Associate - Hybrid", "company": {"name": "Princess Cruises", "industry": "Hospitality and Travel Arrangements", "size": "Large", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Hybrid", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$18.75/hr - $25.34/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality and Travel Arrangements", "description": "Princess Cruises, Holland America Line, and Seabourn offer world-renown vacations at sea to travelers around the globe. This is an opportunity to join a dynamic, unified organization as part of their highly experienced team in our corporate office. We’re looking for an amazing Supply Chain Associate to fill this in office hybrid role, which can be based in Santa Clarita, CA, Seattle, WA or Miami, FL. You’ll be responsible for order fulfillment and expediting of essential on board supplies for the various brands under the Holland America Group. This role owns the full cycle of all processes from the issuance of the master order to vendor payments.", "responsibilities": "Expediting: Providing expediting support for multiple vessels in compliance with Supply Chain Policies and Procedures for multiple commodities, i.e. Hotel, F&B, Technical & Medical. Expediting urgent purchase order delivery requests from Vessels and Internal Customers at Corporate office and disseminates delivery information to customers. Recording all expediting information and maintaining accurate records. Maintaining all expediting related files for reports and other important documents. Preparing and maintains on-hand reports for the DC and 3rd Party Logistics Providers & expediting in accordance with vessel's requirements. Logistics: Tracing and maintaining current delivery schedules for all open purchase orders within areas of responsibility. Resolving delivery issues. Creating action lists against loading schedules. Monitoring shipment progress and recording delivery information in the department's computer system. Preparing Consolidation Reports for each vessel in accordance with loading & boarding requirements. Reviewing and approving of consolidations in accordance with loading schedules. Ensuring Logistics requirements are in place. Vendors: Ensuring vendors are paid in accordance with terms. Working closely with Finance Department and Supply Chain Business Administration for on time vendor resolution. Reconciling vendor statements for any vendor inquiries for their specific vessels. Working directly with vendors to ensure purchase order confirmation and invoicing is completed timely. Communications: Communicating effectively with suppliers, customers, co-workers and management. Be the first point of escalations for urgent matters. Responding to all messages and requests for purchase order delivery information promptly, thoroughly and professionally. Answering phone calls, e-mails and verbal requests for information expeditiously. Working closely with Supervisors & Managers along with Procurement team to ensure all Policies & Procedures are followed for master order preparation and approval.", "qualifications": {"required": "Bachelor’s Degree in Supply Chain, Engineering, Business, Economics, Hospitality, and/or Science, Agriculture required and/or preferred. Minimum 2+ years of experience, preferably in a Supply Chain Organization. Microsoft Office knowledge preferred. Advanced Excel skills – formulas, Pivot tables, vlookup. Proficiency in the use of computer business applications, with knowledge of computerized purchasing systems (Crunchtime!, Oracle and AMOS preferred). Ability to execute written and verbal communication clearly. Ability to meet deadlines. Strong ability to maintain attention to detail and accuracy while working in a fast paced environment. Ability to work under pressure. Must be legally authorized to work in the United States. Holland America is unable to sponsor or take over sponsorship of employment visas at this time (e.g., H-1B status).", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "Cruise and Travel Privileges for You and Your Family, Health Benefits, 401(k), Employee Stock Purchase Plan, Training & Professional Development, Tuition & Professional Certification Reimbursement, Rewards & Incentives.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3941995527"}