{"jobTitle": "Associate, Post Producer - Too Faced", "company": {"name": "Too Faced Cosmetics", "industry": "Personal Care Product Manufacturing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Standard", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$65,000.00 - $90,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Personal Care Product Manufacturing", "description": "Too Faced is seeking an Associate, Post Producer to join our dynamic Studio Production team. The right candidate will be ready to roll up their sleeves, work hard and have fun. This position is responsible for project managing postproduction workflows to ensure video projects remain on time while managing external editor schedules, inquiries, and deliverables. This person is obsessed with project management and thrives on delivering results through meticulous planning and effective communication.", "responsibilities": "Own postproduction workflow and schedule on all video projects. Act as liaison to traffic video briefs, specs and editing notes between external vendors and internal cross-functional teams. Send all approved video assets (copy, graphics, fonts etc.) to external editing teams. Quality Control all incoming videos ensuring videos are in correct safe zones, named correctly and meet all brief deliverable needs. Route video projects to various internal teams for feedback and approval. Distribute and archive all videos for release.", "qualifications": {"required": "3+ years’ experience in project management preferably within an in house creative or video production agency team. Superior organizational, time-management and interpersonal skills. Must have the ability to work under pressure in a fast-paced environment while being flexible with change. Proficient in CTV, Digital and Social advertising video formats and safe zones. Must be active on all social media platforms and have a strong understanding of the social video specifics and safe zones including TikTok, Pinterest, YouTube, Instagram and understand other regionally relevant/specific platforms. Experience working in Wrike, Framie.io, Adobe Creative Suite (Premier, After Effects) - within a Mac environment. Highly driven and energetic, proactive and takes initiative. Highly collaborative with strong verbal and written skills. Knowledge in the Cosmetic Industry is a plus.", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3941652636"}