{"jobTitle": "Assistant Vice President, Procurement & Expense Management", "company": {"name": "Oaktree Capital Management, L.P.", "location": "Los Angeles, CA", "industry": "Financial Services, Investment Management, and Venture Capital and Private Equity Principals"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Finance", "industry": "Financial Services", "description": "<strong>Our Company<br/><br/></strong>Oaktree is a leader among global investment managers specializing in alternative investments, with $192 billion in assets under management as of March 31, 2024. The firm emphasizes an opportunistic, value-oriented and risk-controlled approach to investments in credit, private equity, real assets and listed equities. The firm has over 1,200 employees and offices in 22 cities worldwide.<br/><br/>We are committed to cultivating an environment that is collaborative, curious, inclusive and honors diversity of thought. Providing training and career development opportunities and emphasizing strong support for our local communities through philanthropic initiatives are essential to our culture.<br/><br/>For additional information please visit our website at www.oaktreecapital.com<br/><br/><strong>Responsibilities<br/><br/></strong>The Assistant Vice President will be a member of the Corporate & Technology Services department’s Operations team. The Assistant Vice President will be responsible for supplier lifecycle management (including procurement and contract management), budget management and expense forecasting for the department’s $70mm+ budget. The candidate will report to the Operations Manager and work closely with Oaktree colleagues in other departments, including Finance, Tax, Accounting, Expense Management and Information Solutions, along with external service providers to support department operations.<br/><br/><strong>Key Responsibilities Include<br/><br/></strong><ul><li>Support the department’s supplier lifecycle including procurement and contract management as part of Oaktree’s Vendor Management program;</li><li>Support the department in ensuring strong financial stewardship through budgeting, expense forecasting, department-level spend management, and various ad hoc analyses;</li><li>Support the monthly expense reconciliation and annual budgeting process;</li><li>Support invoice processing to ensure timely payment of expenses to avoid interruption of services;</li><li>Monitor budget performance, highlighting trends and analyzing causes of unexpected variance, and work with department leads to provide recommendations for corrective actions to achieve targets;</li><li>Understand the components, drivers and evolution of the department’s expenses and identify opportunities for cost savings and process improvements;</li><li>Analyze the profitability of the department’s business including expense allocations, margin metrics and growth opportunities;</li><li>Effectively collaborate with internal departments, stakeholders, cross-functional teams, and suppliers to develop and maintain strong relationships and ensure compliance with Oaktree’s Vendor Management program;</li><li>Provide guidance to other team members on the department’s supplier lifecycle (including procurement and contracting), expense management and budget processes.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>8+ years of relevant experience across Finance, Accounting and supplier management;</li><li>Expertise at preparing and reviewing complex financial models;</li><li>Advanced understanding of budget management and forecasting;</li><li>Strong analytical skills with the ability to interpret financial data;</li><li>Experience in managing procurement processes, including commercial negotiation, and managing supplier relationships;</li><li>Ability to manage tasks with competing priorities and deadlines, while independently driving projects to completion;</li><li>Strong track record in engaging and managing stakeholders across different seniorities and functions;</li><li>Strong working knowledge of Microsoft applications e.g., Excel, PowerPoint, SharePoint;</li><li>Familiarity with Workday or other financial planning and analysis software is a plus; and</li><li>Prior knowledge of IT purchasing is a plus.<br/><br/></li></ul><strong>Personal Attributes<br/><br/></strong><ul><li>Outstanding organization skills with high attention to detail;</li><li>Outstanding initiative and a strong work ethic;</li><li>Responsible with a strong sense of dedication;</li><li>Excellent interpersonal, verbal and written communication skills;</li><li>Works well under pressure and with time constraints; and</li><li>Flexible and team-orientated with strong integrity and professionalism.<br/><br/></li></ul><strong>Education<br/><br/></strong>A Bachelor’s degree from a top university preferred.<br/><br/><strong>Base Salary Range<br/><br/></strong>$100,000 - $120,000<br/><br/>In addition to a competitive base salary, you will be eligible to receive discretionary bonus incentives, a comprehensive benefits package and a flexible work arrangement. The base salary offered will be commensurate with experience and/or qualifications, industry knowledge and expertise, as well as prior training and education.<br/><br/><strong>Equal Opportunity Employment Policy<br/><br/></strong>Oaktree is committed to diversity and to equal opportunity employment. Oaktree does not make employment decisions on the basis of race, creed, color, ethnicity, national origin, citizenship, religion, sex, sexual orientation, gender identity, gender expression, age, past or present physical or mental disability, HIV status, medical condition as defined by state law (genetic characteristics or cancer), pregnancy, childbirth and related medical conditions, veteran status, military service, marital status, familial status, genetic information, domestic violence victim status or any other classification protected by applicable federal, state and local laws and ordinances. This policy applies to hiring, placement, internal promotions, training, opportunities for advancement, recruitment advertising, transfers, demotions, layoffs, terminations, recruitment advertising, rates of pay and other forms of compensation and all other terms, conditions and privileges of employment. This policy applies to all Oaktree applicants, employees, clients, and contractors. Staff members wishing to report violations or suspected violations of this policy should contact the head of their department or Human Resources.", "responsibilities": "The Assistant Vice President will be a member of the Corporate & Technology Services department’s Operations team. The Assistant Vice President will be responsible for supplier lifecycle management (including procurement and contract management), budget management and expense forecasting for the department’s $70mm+ budget. The candidate will report to the Operations Manager and work closely with Oaktree colleagues in other departments, including Finance, Tax, Accounting, Expense Management and Information Solutions, along with external service providers to support department operations.<br/><br/><strong>Key Responsibilities Include<br/><br/></strong><ul><li>Support the department’s supplier lifecycle including procurement and contract management as part of Oaktree’s Vendor Management program;</li><li>Support the department in ensuring strong financial stewardship through budgeting, expense forecasting, department-level spend management, and various ad hoc analyses;</li><li>Support the monthly expense reconciliation and annual budgeting process;</li><li>Support invoice processing to ensure timely payment of expenses to avoid interruption of services;</li><li>Monitor budget performance, highlighting trends and analyzing causes of unexpected variance, and work with department leads to provide recommendations for corrective actions to achieve targets;</li><li>Understand the components, drivers and evolution of the department’s expenses and identify opportunities for cost savings and process improvements;</li><li>Analyze the profitability of the department’s business including expense allocations, margin metrics and growth opportunities;</li><li>Effectively collaborate with internal departments, stakeholders, cross-functional teams, and suppliers to develop and maintain strong relationships and ensure compliance with Oaktree’s Vendor Management program;</li><li>Provide guidance to other team members on the department’s supplier lifecycle (including procurement and contracting), expense management and budget processes.<br/><br/></li></ul>", "qualifications": {"required": "8+ years of relevant experience across Finance, Accounting and supplier management; Expertise at preparing and reviewing complex financial models; Advanced understanding of budget management and forecasting; Strong analytical skills with the ability to interpret financial data; Experience in managing procurement processes, including commercial negotiation, and managing supplier relationships; Ability to manage tasks with competing priorities and deadlines, while independently driving projects to completion; Strong track record in engaging and managing stakeholders across different seniorities and functions; Strong working knowledge of Microsoft applications e.g., Excel, PowerPoint, SharePoint; Familiarity with Workday or other financial planning and analysis software is a plus; and Prior knowledge of IT purchasing is a plus.", "preferred": "A Bachelor’s degree from a top university preferred."}, "skills": ["Finance", "Accounting", "Supplier Management", "Financial Modeling", "Budget Management", "Forecasting", "Analytical Skills", "Procurement", "Commercial Negotiation", "Stakeholder Management", "Microsoft Excel", "Microsoft PowerPoint", "Microsoft SharePoint", "Workday", "IT Purchasing"], "postedDate": "1 week ago", "benefits": "In addition to a competitive base salary, you will be eligible to receive discretionary bonus incentives, a comprehensive benefits package and a flexible work arrangement. The base salary offered will be commensurate with experience and/or qualifications, industry knowledge and expertise, as well as prior training and education.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3941843539"}