{"jobTitle": "Buyer", "company": {"name": "Red Bull", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "76,095.00/yr - 84,105.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Food and Beverage Services", "description": "You will be a key member of the Procurement team and is responsible for execution of procurement strategies within the Operations organization. This will require a significant focus on project management in addition to the daily support of efficient business operations. The Buyer is the primary contact with suppliers and drives negotiations, performance improvement efforts, issue resolution, risk mitigation and supplier development. The Buyer must ensure a seamless flow of materials and services to support fulfillment of business demand and expectations. As a constant source of dynamic market data and trends for assigned materials and services; you will work with internal stakeholders to provide valuable input that supports the development of our materials and services strategies. You will report to the Purchasing Manager covering categories including corporate travel, media production services, and IT.", "responsibilities": "Procurement Strategy &amp; Supplier Management\nSupport the Procurement strategy to reduce costs and drive efficiencies through optimization of sourcing processes, designs, materials and services. \nDrive cost savings initiatives and assist in the identification and execution of cost reduction strategies. \nExecute high level supplier strategies to leverage and optimize relationships. \nEngage key departments of spend and drive opportunities for value. \nMonitor and evaluate supplier performance for services and materials. \nConduct root cause analysis for supplier performance issues, drive corrective actions and resolve issues. \nProvide first line of communication with assigned suppliers. \nSupport supply chain practices that reduce totally supply chain costs, optimize inventory, reduce lead times and maximize customer service levels. \nProvide analysis and recommendations for continuous improvement initiatives for locally sourced materials and services. \nProvide reports to monitor spend and supplier performance activities. \nWork with the Risk Management Team to reduce risks associated with materials and services. \nManage supplier relationships to support business requirements.", "qualifications": {"required": "Bachelor’s Degree in Business, Supply Chain, or other related field.\n3-5 years of experience in Procurement or Strategic Sourcing.\nAbility to build strong working relationships and collaborate with internal stakeholders in self-directed and ambiguous environment.\nFunctional understanding, awareness, and application of negotiation, supply chain, sourcing and supplier management fundamentals.\nStrong analytical and system acumen (SAP Ariba, MS Excel, MS 365 etc.)\nExceptional project management, organization, and prioritization skills.\nAbility to execute procurement strategies with suppliers, including on-going negotiations, pricing, key supply chain metric improvements and day-to-day support of efficient supply chain operations.", "preferred": "Corporate travel and media production sourcing experience preferred.\nC.P.M., CIRM, PMP, A.P.P., or SCOR/Lean/Six Sigma certifications preferred."}, "skills": ["Procurement", "Strategic Sourcing", "Project Management", "Supplier Management", "Negotiation", "Supply Chain", "SAP Ariba", "MS Excel", "MS 365"], "postedDate": "1 week ago", "benefits": "Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO &amp; Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3941803011"}