{"jobTitle": "Director, Customer Experience", "company": {"name": "MeUndies", "industry": "Retail Apparel and Fashion", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$124,000.00 - $168,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail Apparel and Fashion", "description": "MeUndies is a Los Angeles-based underwear and loungewear company best known for its softer-than-soft basics. Founded in 2011, MeUndies disrupted the $110B underwear industry with the first online underwear subscription. Since then, the brand has inspired a passionate community of undie-obsessed individuals with its bold, comfortable products. And that's only the beginning… Today, MeUndies has sold more than thirty million pairs of underwear and is profitable with double-digit YoY growth. It continues to redefine the subscription market by evolving the transactional subscription to a membership centered on community and relationships with the brand. The innovative direct-to-consumer brand offers multiple purchasing options, including singles, packs, matching pairs, and monthly membership. WHY WORK AT MEUNDIES? It's more than a job. At MeUndies, we maintain a stellar brand by working collaboratively and encouraging growth with learning opportunities. There is no such thing as a minor achievement here - we celebrate it all! We look for people who stay balanced, go further, build relationships, champion differences, and are humble. We look at the necessities. We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more. We have an office you'll enjoy going to. We currently have a hybrid work schedule for most teams, meaning Fridays are an optional work-from-home day, and Mondays through Thursdays are in-office days. Although Fridays are remote/work-from-home, the office is open, and you are welcome to come in! We're set up to support comfortable working - hot desks, lounge, and casual seating areas, a Mother's Room, an on-site gym & shower, and a kitchen that makes you feel like you've never left home. We're dog-friendly, so your furry coworker can join you anytime. We don't forget the most important things. We want MeUndies to be a place where you feel safe and comfortable, which is why we have a People Ops team ready to help. When you work at MeUndies, we take your needs as an employee (and a person) seriously. Our doors are always welcome to feedback and suggestions! Plus, those extraordinary extra things. We also know how important it is to connect with your team members outside of everyday work. We offer catered lunches every in-office day, holiday parties, off-sites, and an annual retreat. MeUndies is an equal opportunity employer committed to providing a workplace and hiring process free from discrimination. All employment decisions will be made, and all qualified applicants will be considered without regard to age, race, creed, color, religion, sex (including gender, pregnancy, sexual orientation, and gender identity), ethnicity, national origin, ancestry, disability status, veteran status, genetic information, marital status, citizenship status or other legally protected characteristic protected by federal, state, or local law. In addition, MeUndies will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance. About The Role The Director of Customer Experience will lead the charge in shaping and implementing our customer experience strategy, ensuring every interaction our customers have with our brand is delightful, seamless, and unforgettable. This role involves leading dynamic customer experience team(s) and working closely with departments to bring innovative improvements to our customer support, engagement, and Voice of the Customer programs. This role reports to the VP of Customer Experience. Please note that this is a hybrid position of 4 days/week in our Los Angeles office.", "responsibilities": "Oversee our Los Angeles and Philippines customer experience teams to create best-in-class customer experiences. Analyze customer feedback, market trends, and competitive insights to identify opportunities for improvement and innovation within the customer journey. Evaluate and recommend strategic technology or service partners that can further enhance the customer experience with global scale and operational efficiency. Forecast and manage budgets to meet both long and short-term objectives in line with annual operating plans and work collaboratively with finance to provide timely and accurate reporting. Work closely with executives to devise a long-term, KPI-focused customer support strategy and execution plan, with special attention to cost and customer experience. Champion a customer-centric culture within the organization, advocating for customer needs and perspectives in strategic decision-making processes.", "qualifications": {"required": "Bachelor's degree in business, communication, or equivalent discipline. A Master's degree is a plus. 5+ years of experience managing and leading customer support organizations, ideally in e-commerce, retail, or related industries that include subscription services. Experience with CRM and e-commerce platforms, Kustomer and Shopify preferred. Demonstrated success in delivering excellent worldwide customer care for premium products and services, with best-in-class KPIs. Deep experience in evaluating and managing BPOs and other partners to deliver on established SLAs. Exceptional team leader with a proven track record in building out brilliant and highly agile teams and departments, preferably at high-growth apparel or consumer businesses. Demonstrated experience in designing highly scalable and robust customer experience & operational strategy. Ability to communicate complex insights and strategy in a clear and actionable way. Highly motivated dreamer & doer, adept at both strategic high-level thinking as well as execution. Able to travel internationally as needed for in-person collaboration with our BPO in the Philippines.", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more.", "remoteWork": "Hybrid position of 4 days/week in our Los Angeles office.", "url": "https://www.linkedin.com/jobs/view/3941632408"}