{"jobTitle": "Coordinator, Real Estate", "company": {"name": "Sony", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Management", "industry": "Entertainment Providers", "description": "<strong>Sony Corporation of America</strong>, located in New York, NY, is the U.S. headquarters of Sony Group Corporation, based in Tokyo, Japan. Sony's principal U.S. businesses include Sony Electronics Inc., Sony Interactive Entertainment LLC, Sony Music Entertainment, Sony Music Publishing and Sony Pictures Entertainment Inc. With some 900 million Sony devices in hands and homes worldwide today, a vast array of Sony movies, television shows and music, and the PlayStation Network, Sony creates and delivers more entertainment experiences to more people than anyone else on earth. To learn more: <strong>www.sony.com/en</strong>.<br/><br/><strong>Department Overview<br/><br/></strong>The Corporate Real Estate department is responsible for managing the global real estate portfolio of Sony Corporation of America and its affiliated companies. The department provides strategic planning, transaction management, project management, lease administration, and facilities management services to support Sony’s business objectives and optimize its real estate assets. The department works closely with various internal and external stakeholders. <br/><br/><strong>Position Summary<br/><br/></strong>The Coordinator, Real Estate position at Sony Corporation of America (SCA) is responsible for providing administrative and operational support to the Corporate Real Estate department. This role involves coordinating meetings, managing documents, assisting with projects, and maintaining databases related to real estate management. The Coordinator will also be responsible for various administrative tasks and ensuring the smooth operation of the department.<br/><br/><strong>This position will be on a Hybrid schedule with 2-3 days per week in the Culver City office.<br/><br/></strong><strong>Job Responsibilities<br/><br/></strong><strong>Administrative Support<br/><br/></strong><ul><li>Schedules Microsoft Teams meetings and prepares meeting agendas. </li><li>Attends regular scheduled calls and produces/distributes meeting minutes. </li><li>Facilitates document signatures using DocuSign and Adobe Sign. </li><li>Distributes monthly project reports, confirming data prior to distribution. </li><li>Prepares ad hoc reports as requested. </li><li>Manages third party invoices and ensures timely payment. </li><li>Manages records in accordance with corporate retention policy. </li><li>Prepares letters and memos. </li><li>Manages the real estate department office, including ordering supplies and sending FedEx packages. <br/><br/></li></ul><strong> Project and Operational Support<br/><br/></strong><ul><li>Prepares proposal summaries for presentation to Sony business units. </li><li>Prepares financial analysis using financial analysis software. </li><li>Abstracts leases in the CoStar Real Estate Manager and reviews abstracts by others for accuracy and quality control. </li><li>Tracks critical dates in the CoStar Real Estate Manager and prepares/distributes action memos. </li><li>Manages the project close out process and procedures. </li><li>Collects and maintains certificates of insurance in coordination with Risk Management. </li><li>Manages and tracks the TI allowances for various business units. </li><li>Confirms security deposit reimbursements. </li><li>Collects and maintains a master building contact list of leased properties. </li><li>Drafts approval documents using standard templates. <br/><br/></li></ul><strong>Other Responsibilities<br/><br/></strong><ul><li>Knowledge expert for the CoStar Real Estate Manager database, keeping the database current and organized. </li><li>Manages Real Estate commissions including sending invoices and facilitating the distribution of funds to the appropriate parties. Tracks commissions pending and received. </li><li>Assists with compiling information for annual Strategic Property Reports and Year End Reports. <br/><br/></li></ul><strong>Qualifications For Position<br/><br/></strong><strong>Your qualifications and experience should include:</strong> <br/><br/><ul><li>Minimum 2 years of prior experience </li><li>Prior commercial real estate industry experience is strongly preferred. </li><li>Prior experience reading leases or other technical documents preferred. </li><li>Advanced computer skills (Microsoft Office Suite (including Word, Excel and PowerPoint), DocuSign) necessary. </li><li>Proficiency using Technology and Database systems – CoStar Real Estate Manager and Lease Calcs preferred. </li><li>Ability to communicate effectively with different audiences and follow up as needed. </li><li>Strong organizational skills and attention to detail. <br/><br/></li></ul>In addition to competitive pay and benefits, we offer an environment and culture that promotes Diversity, Equity, and Inclusion. We are committed to creating an inclusive employee experience for you to thrive as part of Sony’s purpose to “fill the world with emotion through the power of creativity and technology.” <br/><br/><strong>Benefits:  </strong>  <br/><br/>SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.   <br/><br/> <br/><br/> <strong>What we offer you:</strong> <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)   </li><li>Employee assistance plan and comprehensive behavioral health benefits  </li><li>Fertility benefits, including, surrogacy, and adoption assistance programs    </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children   </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance   </li><li>Short-term &amp; long-term disability plans    </li><li>Up to 12 weeks of paid parental and caregiver leave    </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting  </li><li>Education assistance and student loan programs     <br/><br/></li></ul> <br/><br/><strong>Other Programs:</strong>  <br/><br/><ul><li>Flexible Work Arrangements, including hybrid work schedules </li><li>Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>Referral bonuses (subject to eligibility)    </li><li>Matching gift program    </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products, offered exclusively to Sony employees  </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)    <br/><br/></li></ul><em>The target annualized base salary range for this position is $50,000 to $60,000. The individual will be paid hourly and eligible for overtime. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. <br/><br/></em>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/><strong>Disability Accommodation for Applicants to Sony Corporation of America<br/><br/></strong>Sony Corporation of America provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at careers@sonyusa.com or by mail to: Sony Corporation of America, Human Resources Department, 25 Madison Avenue, New York, NY 10010. Please indicate the position you are applying for.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)<br/><br/><em>While SCA does not require employees to be vaccinated against COVID-19, there are certain Sony offices that require employees to be vaccinated in order to enter. If you will be located at or travel to those offices, you will be required to be fully vaccinated to enter. The Company will consider requests for reasonable accommodations for documented medical reasons and for sincerely held religious beliefs in accordance with applicable law. Please do not include proof of vaccination status or any indication of a possible request for a vaccination accommodation when submitting your application materials. If applicable, the Company will follow up with you directly to request proof of vaccination and to discuss any potential accommodations.</em>", "responsibilities": "<strong>Administrative Support<br/><br/></strong><ul><li>Schedules Microsoft Teams meetings and prepares meeting agendas. </li><li>Attends regular scheduled calls and produces/distributes meeting minutes. </li><li>Facilitates document signatures using DocuSign and Adobe Sign. </li><li>Distributes monthly project reports, confirming data prior to distribution. </li><li>Prepares ad hoc reports as requested. </li><li>Manages third party invoices and ensures timely payment. </li><li>Manages records in accordance with corporate retention policy. </li><li>Prepares letters and memos. </li><li>Manages the real estate department office, including ordering supplies and sending FedEx packages. <br/><br/></li></ul><strong> Project and Operational Support<br/><br/></strong><ul><li>Prepares proposal summaries for presentation to Sony business units. </li><li>Prepares financial analysis using financial analysis software. </li><li>Abstracts leases in the CoStar Real Estate Manager and reviews abstracts by others for accuracy and quality control. </li><li>Tracks critical dates in the CoStar Real Estate Manager and prepares/distributes action memos. </li><li>Manages the project close out process and procedures. </li><li>Collects and maintains certificates of insurance in coordination with Risk Management. </li><li>Manages and tracks the TI allowances for various business units. </li><li>Confirms security deposit reimbursements. </li><li>Collects and maintains a master building contact list of leased properties. </li><li>Drafts approval documents using standard templates. <br/><br/></li></ul><strong>Other Responsibilities<br/><br/></strong><ul><li>Knowledge expert for the CoStar Real Estate Manager database, keeping the database current and organized. </li><li>Manages Real Estate commissions including sending invoices and facilitating the distribution of funds to the appropriate parties. Tracks commissions pending and received. </li><li>Assists with compiling information for annual Strategic Property Reports and Year End Reports. <br/><br/></li></ul>", "qualifications": {"required": "Minimum 2 years of prior experience, Prior commercial real estate industry experience is strongly preferred, Prior experience reading leases or other technical documents preferred, Advanced computer skills (Microsoft Office Suite (including Word, Excel and PowerPoint), DocuSign) necessary, Proficiency using Technology and Database systems – CoStar Real Estate Manager and Lease Calcs preferred, Ability to communicate effectively with different audiences and follow up as needed, Strong organizational skills and attention to detail", "preferred": ""}, "skills": ["Microsoft Teams", "DocuSign", "Adobe Sign", "CoStar Real Estate Manager", "Lease Calcs"], "postedDate": "2 weeks ago", "benefits": "SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.   <br/><br/> <br/><br/> <strong>What we offer you:</strong> <br/><br/><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)   </li><li>Employee assistance plan and comprehensive behavioral health benefits  </li><li>Fertility benefits, including, surrogacy, and adoption assistance programs    </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children   </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance   </li><li>Short-term &amp; long-term disability plans    </li><li>Up to 12 weeks of paid parental and caregiver leave    </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting  </li><li>Education assistance and student loan programs     <br/><br/></li></ul> <br/><br/><strong>Other Programs:</strong>  <br/><br/><ul><li>Flexible Work Arrangements, including hybrid work schedules </li><li>Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs)  </li><li>Referral bonuses (subject to eligibility)    </li><li>Matching gift program    </li><li>A wide variety of employee business resource groups (EBRGs)    </li><li>Special discounts on Sony products, offered exclusively to Sony employees  </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)    <br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3941384823"}