{"jobTitle": "Assistant Store Manager - LA", "company": {"name": "Peet's Coffee", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$52,000.00 - $60,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Manufacturing, Food and Beverage Services, and Retail", "description": "Peet’s is currently seeking passionate Assistant Store Managers. The Assistant Store Manager role serves as a developmental role towards becoming a Store Manager, working towards achieving readiness within 12 to 18 months .(<em>Promotional opportunities are contingent upon availability of roles and your flexibility around work location).</em> In the role, Assistant Store Managers expand and deepen that unwavering commitment to mastery by ensuring unequaled quality and service. They focus on daily operations of the coffee bar including sales performance while ensuring excellent customer service. The Assistant Store Manager drives growth through ownership and authenticity while contributing to the development of our Baristas.<br/><br/><strong>What Does it take to be a Successful Assistant Manager?<br/><br/></strong>Inspirational Leader<br/><br/><ul><li>Promotes a culture of authenticity, respect, dignity, and integrity. </li><li>Facilitates change and supports employee growth.</li><li>Inspires a shared purpose and engagement.</li><li>Models a passion and commitment to continued success.<br/><br/></li></ul>Delivers Operational Excellence<br/><br/><ul><li>Effectively utilizes tools and has a strong sense of ownership to drive results.</li><li>Has an unwavering commitment to the quality of in-store operations and customer experience. </li><li>Champions the ongoing spirit of development and professional growth across the team.</li><li>Supports a culture that attracts, retains, and develops the highest quality Shift Leaders, Baristas, and Team Members.<br/><br/></li></ul><strong>The Ideal Candidate Will<br/><br/></strong><ul><li>Have a minimum of two years’ experience as a retail manager/supervisor with superior customer service standards and/or related experience and training.</li><li>Have the desire and ability to develop into a ‘ready now level’ for Store Manager role at Peet’s within 12 months.</li><li>Have the responsibility to drive their own development through partnership with the Store Manager and District Leader.</li><li>Consistently demonstrate performance that embodies Peet’s Vision, Mission and Values.</li><li>Carry a friendly, energetic, personable demeanor and have a passion for great customer service, with a customer-first and quality-focused mentality.</li><li>Carry themselves professionally, be agile and maintain composure in a fast-paced environment.</li><li>Have strong time-management and delegation skills.</li><li>Possess good problem-solving skills and sound judgment. </li><li>Be an excellent communicator, relating well to customers and fellow Peetniks at all levels.</li><li>Be extremely reliable and punctual.</li><li>Have the ability to perform various physical tasks during the work shift.<br/><br/></li></ul><strong>What Benefits do Assistant Store Managers Receive?<br/><br/></strong>At Peet’s we hire the best people and are committed to supporting our employees and rewarding them for their work. That’s one of the reasons we offer the following compensation and benefits<br/><br/><ul><li>Starting hourly pay, based on a 40 hour work week, between $52,000- $60,000 per year</li><ul><li>Pay ranges are determined based on several factors including:</li><ul><li>Geography (local wage requirements and market conditions)</li><li>Skills and experience (number of years and industry experience)</li><li>Location sales volume</li></ul></ul><li>401(k) plan, with generous matching</li><li>Full medical, dental and vision insurance </li><li>Employee Assistance Program including mental health resources for all employees</li><li>Tuition scholarship opportunities through Oregon State University E Campus to any of the 95+ OSU degrees offered as well as Online Career Educational Programs, through LinkedIn Learning</li><li>Opportunities for growth and advancement</li><li>Paid vacation, holidays and sick leave</li><li>Bonus program - paid monthly</li><li>Pay adjustments may be awarded in conjunction with strong employee performance documented by the performance evaluation process, role changes or market conditions.</li><li>Free coffee and fresh baked goods as well as an employee discount <br/></li></ul><em>The above statements are intended to describe the general nature and level of work being performed by people assigned to this position. Job responsibilities can change according to the operational needs of the business.<br/><br/></em>Peet’s is proud to be an Equal Opportunity Employer<br/><br/>For more information about our craft and who we are please visit our website.<br/><br/>We look forward to hearing from you!<br/><br/>", "responsibilities": "The Assistant Store Manager role serves as a developmental role towards becoming a Store Manager, working towards achieving readiness within 12 to 18 months .(<em>Promotional opportunities are contingent upon availability of roles and your flexibility around work location).</em> In the role, Assistant Store Managers expand and deepen that unwavering commitment to mastery by ensuring unequaled quality and service. They focus on daily operations of the coffee bar including sales performance while ensuring excellent customer service. The Assistant Store Manager drives growth through ownership and authenticity while contributing to the development of our Baristas.", "qualifications": {"required": "Have a minimum of two years’ experience as a retail manager/supervisor with superior customer service standards and/or related experience and training.", "preferred": "Have the desire and ability to develop into a ‘ready now level’ for Store Manager role at Peet’s within 12 months."}, "skills": [], "postedDate": "2 months ago", "benefits": "Starting hourly pay, based on a 40 hour work week, between $52,000- $60,000 per year\n\nPay ranges are determined based on several factors including:\n\nGeography (local wage requirements and market conditions)\nSkills and experience (number of years and industry experience)\nLocation sales volume\n401(k) plan, with generous matching\nFull medical, dental and vision insurance \nEmployee Assistance Program including mental health resources for all employees\nTuition scholarship opportunities through Oregon State University E Campus to any of the 95+ OSU degrees offered as well as Online Career Educational Programs, through LinkedIn Learning\nOpportunities for growth and advancement\nPaid vacation, holidays and sick leave\nBonus program - paid monthly\nPay adjustments may be awarded in conjunction with strong employee performance documented by the performance evaluation process, role changes or market conditions.\nFree coffee and fresh baked goods as well as an employee discount <br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3942503421"}