{"jobTitle": "OPERATIONS ASSOCIATE - RODEO DRIVE", "company": {"name": "CELINE", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail Luxury Goods and Jewelry", "description": "Symbol of elegance and authentic luxury with its sophisticated and timeless Collections, CELINE is a French Leather-Goods and Couture House, driven by a strong artistic and holistic vision.<br/><br/>CELINE’s ambition is to be one of the most iconic luxury brands worldwide. To make this vision a reality we are looking for agile, passionate and authentic personalities who are eager to evolve in a highly creative and challenging environment.<br/><br/><strong>YOUR WORK ENVIRONMENT<br/><br/></strong>The Operations Associate is responsible for directing the movement of all pre-sale merchandise entering and exiting the store and for ensuring that all shipping/receiving policies, procedures, and directives are implemented.<br/><br/><strong>YOUR IMPACT<br/><br/></strong><ul><li>Maintain inventory in an efficient, clean, secure, and organized fashion</li><li>Support sales staff when merchandise is needed that is in stock but not on the sales floor</li><li>Anticipate merchandise maintenance needs and providing proactive solutions to space and storage issues</li><li>Ensure that all merchandise is ticketed</li><li>Support visual, merchandising and operations needs with the moving and storage of fixtures, furniture, merchandise, props, etc. </li><li>Support the operation and maintenance of the store in regard to facility and fixture maintenance, coordinating cleaning and repair when required</li><li>Effectively participate in the timely preparation and completion of all inventories and cycle counts</li><li>Maintain an active role in the inventory reconciliation process</li><li>Manage and process all inter-store transfers, stock rotations and incoming / outgoing shipments as per policies and procedures</li><li>Understand and accurately complete all paperwork and procedures relative to inventory maintenance (i.e., damages, RTVs, etc.)</li><li>Ensure the highest standards while and packaging client merchandise</li><li>Manage all aspects of the client delivery process inclusive of troubleshooting missing deliveries</li><li>Document all deliveries to clients, track and locate merchandise when necessary</li><li>Assist other departments or on the selling floor as needed and as requested by the Assistant Store Manager/ Store Manager/ Director<br/><br/></li></ul><strong>KEYS FOR SUCCESS<br/><br/></strong>Education:<br/><br/><ul><li>Buisness School, University, or \"equivalent experience\"</li><li>Position requires minimum of 5 years of experience in a retail setting, with a focus on stock or inventory, preferably in a luxury setting. </li><li>Computer literate; learn and use various software packages. <br/><br/></li></ul>Competencies:<br/><br/><ul><li>Action oriented; result driven</li><li>Customer service oriented</li><li>Social perceptiveness</li><li>Problem-solver</li><li>Strong oral and written communication skills<br/><br/></li></ul>Languages: Foreign Languages a plus<br/><br/>Workplace: 456 N Rodeo Dr, Beverly Hills, CA 90210<br/><br/><strong>Other Information<br/><br/></strong>Potential starting date: Month year or as soon as possible<br/><br/><strong>OUR COMMITMENT<br/><br/></strong>CELINE is an equal opportunity employer. We want to offer an inclusive environment of mutual respect where we welcome diversity and all our employees feel included, developed, and heard.<br/><br/>We are committed to the prevention of all discrimination, providing equal opportunities to all applicants irrespective of gender, gender expression, disability, origin, background, religious beliefs or sexual orientation or any other basis protected by law.<br/><br/>CELINE recruits and recognizes all types of talent and singularities.<br/><br/><em>The compensation for this position ranges from $20 - $23 hourly. The rate of pay offered will be dependent upon candidate’s relevant skills and experience. In addition, there is a comprehensive benefits package including: medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks, and a retirement plan with employer contribution.</em>", "responsibilities": "The Operations Associate is responsible for directing the movement of all pre-sale merchandise entering and exiting the store and for ensuring that all shipping/receiving policies, procedures, and directives are implemented.", "qualifications": {"required": "Position requires minimum of 5 years of experience in a retail setting, with a focus on stock or inventory, preferably in a luxury setting. \nComputer literate; learn and use various software packages.", "preferred": "Buisness School, University, or \"equivalent experience\""}, "skills": ["Customer service", "Communication", "Problem-solving"], "postedDate": "1 week ago", "benefits": "The compensation for this position ranges from $20 - $23 hourly. The rate of pay offered will be dependent upon candidate’s relevant skills and experience. In addition, there is a comprehensive benefits package including: medical, dental, vision, short and long-term disability, various paid time off programs, employee discount/perks, and a retirement plan with employer contribution.", "remoteWork": "No", "salary": {"amount": "20.00 - 23.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3942867259"}