{"jobTitle": "Human Resources Partner", "company": {"name": "Hilti North America", "location": "Orange County, CA", "industry": "Construction, Industrial Machinery Manufacturing, and Civil Engineering"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Construction", "description": "What's the role?<br/><br/>The Human Resources Partner is responsible for leading the human resources functions within their customer groups. Partners with and consults line management to provide hands on and strategic human resources related, support, service, and guidance to Hilti employee and management groups. Key areas of responsibility include line management support/coaching, employee development, strategic recruiting, legal compliance, succession planning, and organizational development in support of Hilti’s business objectives, strategic initiatives, and organizational priorities.<br/><br/>Who is Hilti?<br/><br/>Hilti is making construction better by fulfilling our customers' promise as being the best partner for productivity, safety, and sustainability. We challenge norms to bring innovative, top-of-line solutions to the global construction industry, and beyond. Hilti is where people are exploring possibilities, leveraging their potential, owning their personal development and growing lasting careers.<br/><br/>What does the role involve?<br/><br/><ul><li> Manage and provide consultation to team leaders on employment related matters</li><li> Lead team leaders through the process of managing and resolving workplace concerns</li><li> Conduct thorough and objective investigations, recommend solutions, and follow up to ensure resolution of concerns</li><li> Distribute necessary communication within workgroups to leaders and team members to ensure alignment of people philosophy and company objectives</li><li> Partner with internal and external immigration resources to assist in the work authorization process, as needed</li><li> Lead and facilitate the MOMENT people philosophy through guiding team leaders and team members on the people processes (My Contribution, My Development, Hilti People Review and Year End Review)</li><li> Lead, facilitate and communicate Hilti People Review / succession planning sessions throughout the year to customer groups and update the system and actions based on calibration action points</li><li> Partner with PEO to facilitate talent management process for domestic and international team members</li><li> Manage and support the HNA Strategic Organizational Development Portfolio for assigned customer groups to include Assessment Centers and Talent Days, Emerging Leadership Development, and Internships/Co-ops to identify and develop high potential employees</li><li> Maintain up to date documentation on employee related matters and provide data and support to the Legal Department in employment law related matters</li><li> Lead, advise and coach management and team members on performance and conduct related matters to help ensure equitable, consistent, and lawful treatment of all employees in all employment actions</li><li> Consult and inform leaders on impact of compliance programs impacting their teams (e.g., EEO/AA, ADA, FLMA, WC, etc.) to ensure legal and corporate policy compliance in all Hilti North America (HNA) employment practices</li><li> Ensure employees are compensated appropriately and equitably by reviewing salary information and providing recommendations to HR Director and management based on Hilti’s compensation philosophy</li><li> Participate in talent acquisition process by Interviewing, assessing, and selecting candidates in recruiting efforts for US and Canada</li><li> Identify training needs, lead and implement learning and development initiatives relating to customer group needs</li><li> In conjunction with the People Experience Center, ensure necessary employment records are maintained in accordance with legal requirements</li><li> Advocate, participate and provide input for HNA DEI initiatives</li><li> Analyze Exit Interview process and follow up with exiting team members to get additional insight as needed</li><li> Promote Hilti through professional networking opportunities virtually and in person</li><li> Leading leaders through team member engagement activities throughout the annual people cycle to foster engaging and inclusive work environment.</li><li> Lead and facilitate team engagement sessions such as Fast Leaps, GEOS sessions, active role in Our Culture Journey</li><li> Serve as a mentor, trainer, and coach for new HR Partner I team members</li><li> Partnering as a team player with the Centers of Excellence to execute processes and achieve objectives</li><li> Make data driven decisions to synthesize data to solve complex problems, form conclusions and make recommendations</li><li> Work with continuous improvement mindset to proactively identify ways of working that will enhance processes and identify connections across all supported teams and make recommendations for improvement</li><li> Participate in (and in some cases own) key projects/initiatives (e.g. performance management, talent management &amp; development, key employee trainings, merit and bonus administration, etc.) and successfully drive to closure</li><li> Mentor other HR partners and specialists to support further development of their HR and business acumen</li><li> Other duties as assigned<br/><br/><br/></li></ul>94% of employees believe when you join the company, you are made to feel welcome<br/><br/>What do we offer?<br/><br/><ul><li> Medical/Dental/Vision coverage effective on your first day of employment </li><li> 401(k) plan with dollar-for-dollar matching, up to 6% matching, up to 6% match and fully vested after one year of employment </li><li> Generous Paid Time Off policy and holidays including two days to give back to your local community </li><li> Paid parental leave, sabbaticals, military leave </li><li> Education reimbursement and student loan assistance </li><li> Up to five days per year of back-up daycare </li><li> Life, accident and disability insurance </li><li> Employee Assistance Program (EAP), company-paid wellness screenings </li><li> Opportunities for growth – shift careers, support your professional development, or get assigned to any of the 120+ countries in which we operate <br/><br/><br/></li></ul>The salary range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skills sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the application geographic differential associated with the location at which the position may be filled.<br/><br/>At Hilti, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is $90,000 - $130,000.<br/><br/>What you need is:<br/><br/><ul><li> Bachelor’s degree required, preferably in Business, Human Resources, Social Science or equivalent<br/><br/><br/></li></ul>combination of education and applicable experience; Master’s Degree preferred<br/><br/><ul><li> Minimum 3 years of Human Resources experience at a Generalist level or 3+ years of Hilti experience at a leadership level</li><li> Human Resources certification (PHR, SPHR, SHRM-CP, SHRM-SCP) a plus</li><li> Extensive knowledge of current employment-related laws and ability to interpret federal, state and local rules and regulations related to human resources processes</li><li> Leadership experience preferred</li><li> Experience in matrixed organization a plus</li><li> Excellent written and verbal communication skills, including persuasive negotiation and interpersonal skills</li><li> Strong critical thinking skills and the ability to utilize creative and innovative approaches in problem solving</li><li> Strong organizational abilities and proficient in Microsoft Office, experience with Workday software, HRIS preferred</li><li> High level of motivation and customer focus, continuous improvement, growth mindset required in a fast-paced, results-oriented environment</li><li> Demonstrated leadership and a history of building strong partnerships both internally and externally</li><li> Detail oriented and analytical aptitude<br/><br/><br/></li></ul>Why should you apply?<br/><br/>Let’s face it, we know there are lots of other companies out there. We have an excellent mix of people, which we believe makes for a more vibrant, more innovative, more productive team. We're a big company with a family-owned feel. You will be given the opportunity to make big changes that will ripple throughout the industry while feeling right at home with the Hilti family.<br/><br/>Hilti, Inc is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.", "responsibilities": "The Human Resources Partner is responsible for leading the human resources functions within their customer groups. Partners with and consults line management to provide hands on and strategic human resources related, support, service, and guidance to Hilti employee and management groups. Key areas of responsibility include line management support/coaching, employee development, strategic recruiting, legal compliance, succession planning, and organizational development in support of Hilti’s business objectives, strategic initiatives, and organizational priorities.", "qualifications": {"required": "Bachelor’s degree required, preferably in Business, Human Resources, Social Science or equivalent<br/><br/>combination of education and applicable experience; Master’s Degree preferred<br/><br/>Minimum 3 years of Human Resources experience at a Generalist level or 3+ years of Hilti experience at a leadership level", "preferred": "Human Resources certification (PHR, SPHR, SHRM-CP, SHRM-SCP) a plus<br/><br/>Extensive knowledge of current employment-related laws and ability to interpret federal, state and local rules and regulations related to human resources processes<br/><br/>Leadership experience preferred<br/><br/>Experience in matrixed organization a plus<br/><br/>Excellent written and verbal communication skills, including persuasive negotiation and interpersonal skills<br/><br/>Strong critical thinking skills and the ability to utilize creative and innovative approaches in problem solving<br/><br/>Strong organizational abilities and proficient in Microsoft Office, experience with Workday software, HRIS preferred<br/><br/>High level of motivation and customer focus, continuous improvement, growth mindset required in a fast-paced, results-oriented environment<br/><br/>Demonstrated leadership and a history of building strong partnerships both internally and externally<br/><br/>Detail oriented and analytical aptitude"}, "skills": ["HRIS", "Workday", "Microsoft Office", "Leadership", "Communication", "Problem Solving", "Talent Management", "Employee Development", "Strategic Recruiting", "Legal Compliance", "Succession Planning", "Organizational Development"], "postedDate": "14 hours ago", "benefits": "In addition to a competitive base salary and bonus potential, we offer a robust benefits package including:<br/><br/><ul><li> Medical/Dental/Vision coverage effective on your first day of employment </li><li> 401(k) plan with dollar-for-dollar matching, up to 6% matching, up to 6% match and fully vested after one year of employment </li><li> Generous Paid Time Off policy and holidays including two days to give back to your local community </li><li> Paid parental leave, sabbaticals, military leave </li><li> Education reimbursement and student loan assistance </li><li> Up to five days per year of back-up daycare </li><li> Life, accident and disability insurance </li><li> Employee Assistance Program (EAP), company-paid wellness screenings </li><li> Opportunities for growth – shift careers, support your professional development, or get assigned to any of the 120+ countries in which we operate <br/><br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3942436859"}