{"jobTitle": "Business Analyst", "company": {"name": "Webologix Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Research, Analyst, and Information Technology", "industry": "IT Services and IT Consulting", "description": "<strong>Please Find the Below Job Description:- <br/><br/></strong><strong>Title:-</strong> Business Analyst<br/><br/><strong>Client:-</strong> Webologix<br/><br/><strong>Location:-</strong> Los Angeles, CA<br/><br/><strong>Type:-</strong> Contract<br/><br/><strong>Minimum Qualifications<br/><br/></strong><ul><li> Work with all stakeholders including business customers, vendors, and internal resources to facilitate team communication and achieve the mission.</li><li> Gathers, analyzes, defines, and documents requirements and communicates them to the technical &amp; non-technical audience.</li><li> Transforms information from elicitation sessions into business requirements and functional requirements, use cases, user stories, and software requirements<br/><br/></li></ul>specifications documents. Uses standard templates and simple, unambiguous, and concise natural language.<br/><br/><ul><li> Ability to analyze and decompose problem statements, distilling these into clearly defined requirements.</li><li> Validate data and test applications for business requirements, functionality, and usability.</li><li> Responsible for carrying out complex analysis of datasets and conducting appropriate data validation Responsible for gathering and validating datasets across multiple data sources.</li><li> Provide information on analytic results to business and functional leaders using visualizations to communicate data and metrics.</li><li> Assist with user acceptance testing.</li><li> Ability to work on multiple projects in parallel and work constructively as part of a team or teams to coordinate with developers and business users to analyze system characteristics.</li><li> Project coordination: Assist in project planning, scheduling, and monitoring activities. Track project milestones, deliverables, and dependencies to ensure timely completion and adherence to project scope.<br/><br/></li></ul><strong>Thanks &amp; Regards<br/><br/></strong><strong>Vishal Tyagi<br/><br/></strong><strong>Webologix Inc<br/><br/></strong><strong>Direct</strong><strong>- </strong><strong>+1 332529-9840<br/><br/></strong><strong>Email – vishal.tyagi@webologix.net<br/><br/></strong><strong>www.webologics.com</strong><strong> (Europe/ USA/ UK / Canada)</strong>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3942818664"}