{"jobTitle": "Purchasing Assistant", "company": {"name": "Plastpro,Inc", "industry": "Wholesale Building Materials", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "Are you technically oriented? Are you outgoing? If so – this job may be for you! Join Our Team! We are seeking professionals who have knowledge and have a great aptitude with computers. This position isn’t for everyone. We are looking for new additions to our team who possess the same drive we do to take our company to the next level. Position Objective: Provide all the professional support in the entire purchasing assigned by Company. Position Overview: The primary function of the Purchasing Coordinator is to support the team in all aspects of inventory management as well as communication and follow up with all vendors including component suppliers, printers and raw materials. The Purchasing Coordinator will follow inventory management processes, protocols, and practices to ensure that all production needs are fulfilled accurately and in a timely manner. Essential Duties And Responsibilities: Tasks and Duties: Working on all the purchasing from Taiwan and China related to inventory ordering, following up product delivery status or any other job function assigned by company. Responsible for analyzing and making decisions on the procurement of materials at the lowest cost to maintain the proper inventory level for sales demand. Follow up with vendors/forwarder to track the delivery schedule and inform customers/related departments. Coordinates purchasing details with vendors, including pricing revisions, order cancellations, discontinued items, delivery schedule revisions, invoice discrepancies, quality claims, and issue payment requests. Obtain the special order quotations from suppliers and convert to the sales-order quotations for sales department. Convert the drop ship orders to our suppliers. Follow up on various acquisitions documents (Request for quotes, proposals, purchase orders, etc.) Discusses defective or unacceptable good or services with QA personnel, production plant, sales, customers and suppliers. Maintain procurement records, such as items or services purchase contracts, costs, rebate, payment discount, shipping freight, delivery and product quality. Responsible for all the assigned special projects -- including the cost reduction projects. Obtain and maintain the ocean freight quotations from the carriers or NVOCC. Machinery and Electrical Device Used: Keyboard, mainframe and PC computer terminal, 10-key calculator, fax machine, copier and telephone. PC software includes, but is not limited to: MS Office, Exchange (e-mail), and other business programs.", "responsibilities": "Working on all the purchasing from Taiwan and China related to inventory ordering, following up product delivery status or any other job function assigned by company. Responsible for analyzing and making decisions on the procurement of materials at the lowest cost to maintain the proper inventory level for sales demand. Follow up with vendors/forwarder to track the delivery schedule and inform customers/related departments. Coordinates purchasing details with vendors, including pricing revisions, order cancellations, discontinued items, delivery schedule revisions, invoice discrepancies, quality claims, and issue payment requests. Obtain the special order quotations from suppliers and convert to the sales-order quotations for sales department. Convert the drop ship orders to our suppliers. Follow up on various acquisitions documents (Request for quotes, proposals, purchase orders, etc.) Discusses defective or unacceptable good or services with QA personnel, production plant, sales, customers and suppliers. Maintain procurement records, such as items or services purchase contracts, costs, rebate, payment discount, shipping freight, delivery and product quality. Responsible for all the assigned special projects -- including the cost reduction projects. Obtain and maintain the ocean freight quotations from the carriers or NVOCC.", "qualifications": {"required": "Not specified", "preferred": "Not specified"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3942747973"}