{"jobTitle": "Support Attorney - Work from Home", "company": {"name": "Mercury Insurance", "industry": "Insurance", "size": "Not specified", "location": "West Covina, CA"}, "location": "West Covina, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$79,638.00/yr - $143,123.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Insurance", "description": "Candidates must reside in California as in person court appearances will be required. Join an amazing team that is consistently recognized for our achievements and culture, including our most recent Forbes award of being one of America's Best Midsize Employers for 2024! Bretoi, Lutz & Stele, House Counsel Mercury Insurance is currently seeking a Support Attorney to join our team! Essential Job Responsibilities: As a Support Attorney at Mercury, you will provide support on files. Responsibility includes responding to discovery, requesting further discovery responses, legal research, law and motion, summarizing medical records and discovery, attending court appearances and depositions. Education: Law degree and admission to the Bar in the state(s) where practicing. Experience: Strong communication and negotiation skills to represent client and Company interests in litigation. Able to effectively direct legal support staff in daily operations to ensure accurate and timely completion of assigned work. Able to work independently with minimum direction and good organizational skills needed to manage a reasonable caseload. Requires a law degree and admission to the California Bar. Must also reside in the geographic region where the office is located. Preferred 0-5 years insurance defense or personal injury experience or equivalent combination of education/experience. Why choose a career at Mercury? At Mercury, we have been guided by our purpose to help people reduce risk and overcome unexpected events for more than 60 years. We are one team with a common goal to help others. Everyone needs insurance and we can’t imagine a world without it. Our team will encourage you to grow, make time to have fun, and work together to make great things happen. We embrace the strengths and values of each team member. We believe in having diverse perspectives where everyone is included, to serve customers from all walks of life. We care about our people, and we mean it. We reward our talented professionals with a competitive salary, bonus potential, and a variety of benefits to help our team members reach their health, retirement, and professional goals. Learn more about us here: https://www.mercuryinsurance.com/about/careers", "responsibilities": "As a Support Attorney at Mercury, you will provide support on files. Responsibility includes responding to discovery, requesting further discovery responses, legal research, law and motion, summarizing medical records and discovery, attending court appearances and depositions.", "qualifications": {"required": "Law degree and admission to the Bar in the state(s) where practicing. Strong communication and negotiation skills to represent client and Company interests in litigation. Able to effectively direct legal support staff in daily operations to ensure accurate and timely completion of assigned work. Able to work independently with minimum direction and good organizational skills needed to manage a reasonable caseload. Requires a law degree and admission to the California Bar. Must also reside in the geographic region where the office is located.", "preferred": "0-5 years insurance defense or personal injury experience or equivalent combination of education/experience."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive compensation, Flexibility to work from home/hybrid, Company vehicle + gas card, Paid time off (vacation time, sick time, 9 paid Company holidays, volunteer hours), Incentive bonus programs (potential for holiday bonus, referral bonus, and performance-based bonus), Medical, dental, vision, life, and pet insurance, 401 (k) retirement savings plan with company match, Engaging work environment, Promotional opportunities, Education assistance, Professional and personal development opportunities, Company recognition program, Health and wellbeing resources, including free mental wellbeing therapy/coaching sessions, child and eldercare resources, and more.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3942395589"}