{"jobTitle": "Franchise Operations Support Coordinator", "company": {"name": "JEI Learning Centers, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Project Management and Information Technology", "industry": "Education Administration Programs", "description": "<strong>Job Description<br/><br/></strong><strong>JEI Learning Centers, LLC </strong>is a leading global provider of supplementary education programs through its network of franchised learning centers.<br/><br/>JEI is seeking a full-time franchise operations support coordinator to work out of its North American Headquarters based in Los Angeles, CA.<br/><br/>Primary Responsibilities, but not limited to:<br/><br/><ul><li>Effectively and professionally represent the JEI brand and franchise system</li><li>Help develop strong business relationships with new and existing franchisees</li><li>Assist in the implementation and execution of franchise support and marketing policies and procedures with new and existing licensed franchisees</li><li>Help organize and facilitate the JEI franchise support process</li><li>Assist in franchise support and marketing initiatives</li><li>Conduct/travel to franchised grand-openings, open houses, or related events</li><li>Assist with on-site support visits to franchised locations in designated regions<br/><br/></li></ul>Required Skills:<br/><br/><ul><li>Excellent interpersonal, written, and oral communication/public speaking skills</li><li>Ability to listen to and empathize with others</li><li>Strong organizational and time management skills</li><li>Follow directions and work well with others</li><li>Complete tasks in a timely and efficient manner<br/><br/></li></ul>Education/Experience:<br/><br/><ul><li>A bachelor’s degree in business, marketing or related field is preferred. </li><li>2-3 years franchise related support experience. </li><li>Experience in K-12 educational franchise support is preferred but not required. </li><li>Experience in social media content creation and graphic design is a plus. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>JEI is one of the world's leading supplemental education service providers offering a variety of highly individualized, step-by-step enrichment programs for students ages 4-14. Since 1977, JEI has helped millions of students achieve a higher level of learning and currently operates 500 centers worldwide. The US operations of JEI currently oversees over 60 learning centers and is looking to expand through its growing network of franchisees and brand recognition efforts.<br/><br/>JEI is one of the world's leading supplemental education service providers offering a variety of highly individualized, step-by-step enrichment programs for students ages 4-14. Since 1977, JEI has helped millions of students achieve a higher level of learning and currently operates 500 centers worldwide. The US operations of JEI currently oversees over 60 learning centers and is looking to expand through its growing network of franchisees and brand recognition efforts.", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3942949106"}