{"jobTitle": "Sr. Buyer, Work Boots", "company": {"name": "Boot Barn", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$110,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Retail", "description": "SR. BUYER, WORK BOOTSREPORTS TO: VP, MEN'S BOOTSSSTATUS: EXEMPT  SummaryBoot Barn is where community comes first. We thrive on togetherness, collaboration, and belonging. We build each other up, listen intently, and implement out-of-the-box ideas. We celebrate new innovations, congratulate one another’s achievements, and most importantly support each other.  At Boot Barn, we work together to make a positive impact on the world around us, and by working collectively with encouragement, we consider ourselves “Partners.” With the values of the West guiding us, Boot Barn celebrates heritage, welcomes all, and values each unique Partner within our Boot Barn community.  Our vision is to offer everyone a piece of the American spirit – one handshake at a time.   The Sr. Buyer is responsible for executing the product vision, selection and management of the merchandising programs in men’s apparel that supports the Boot Barn merchandising strategies both in stores and ecommerce. The buyer will direct the assortment planning, quantification and timely execution of receipts against the approved class sales plans.   Essential Duties and ResponsibilitiesIdentify and manage emerging and declining trends in a timely mannerBuild a well-balanced assortment for storesPartner with cross-functional team members to develop division key concepts, key items, promotional strategies and store assortments to ensure that product is commercially viable and provides an exciting customer store experienceSuccessfully partner with private label programs and key branded vendorsEnsure purchase decisions, sales growth, inventory and gross margin management align with company strategiesDevelop a clear understanding of all merchandising systems to maximize analysis of business strategiesDrive results with strong merchandise strategies and executionClosely coordinates with vendors the timely execution of product manufacturing and deliveryDevelops class assortment plans that quantify the seasonal buys correctly by store volume group, and address regional and lifestyle differences of our customersSelects product that is assorted by price point, function and fashion that promotes multiple items in each purchaseDevelops the floor set with the visual team to create the strongest impact and engage our customers to drive salesResponds to timely to selling and marketing opportunities to ensure the continued growth of the organizationProvide supervisors with comprehensive vendor market reports after competitive shoppingDevelop, train, and mentor associate/assistant buyers with the skills needed to advance to the next levelDemonstrates high level of quality work, attendance and appearance.Demonstrates high degree of professionalism in communication, attitude and teamwork with customers, peers and management.Adhere to all local, federal and state laws in addition to Company policies, procedures, and practices.Performs any other duties that may be assigned by management.QualificationsBachelor’s degree with 3-5 years retail buying experience in either a specialty store or department store.Excellent knowledge of Excel, Word and Power PointStrong communication skills, providing direction to private label, design and product development team and brandsAbility to work as a team member, multitask and give clear direction. Builds rapport and relationships both internally and externally with Store Operations, Visuals, Marketing, Design, Private Brand, VendorsMust be task driven and pro-active when it comes to executing tasksThorough knowledge of retail math such as sales, gross margin, OTB calculations, initial mark-up calculations turnover, etc.Effective oral presentations with well-prepared content and confident deliveryStrong negotiation skillsExperience meeting multiple deadlinesCompetenciesEnsure Effective Communication - Listens carefully and attentively to others' opinions and ideas. Communicates information clearly, concisely, and professionally.Establish Trust - Follows through on commitments. Is honest and direct with others. Promotes a culture of respect for, commitment to, and compliance with Company values, beliefs, and standards. Ensures the protection of confidential information.Boot Barn Benefits & Additional Compensation OpportunitiesCompetitive salary. (insert any other compensation opportunities here)Merchandise discount: 50% off of Exclusive Brands and 40% off of third-party brands.Paid Time Off plan for year-round Boot Barn Partners.*Medical, Dental, Vision and Life Insurance.*401(k) plan with generous company matching.Flexible schedules and work/life balance.Opportunities for growth at every level – we are opening 50+ new stores each year.*For eligible Boot Barn PartnersPAY RANGE: $110,000.00 - $130,000.00*compensation varies based on geography, skills, experience, and tenure<br/>Physical DemandsIn general, the following physical demands are representative of those that must be met by a Partner to successfully perform the essential functions of this job. Reasonable accommodations may be made to allow differently abled individuals to perform the essential functions of the job.Standing, walking and squatting less than fifty percent of the work shift.Required to lift, move and carry up to 40 pounds.Ability to read, count and write to accurately complete all documentation and reports.Must be able to see, hear and speak in order to communicate with partners and customers.Specific vision abilities include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.Manual dexterity required using hands to finger; handle, feel and type; reach with hands and arms.[ ] Sedentary: Limited activity, no lifting, limited walking[ X ] Light: Office work, some lifting, bending, stooping or kneeling, walking[ ] Moderate: Mostly standing, walking, bending, frequent lifting[ ] Arduous: Heavy lifting, bending, crawling, climbing  Work EnvironmentIn general, the following conditions of the work environment are representative of those that a Partner encounters while performing the essential functions of this job. Reasonable accommodations may be made to allow differently abled individuals to perform the essential functions of the job within the environment.The workspace is clean, orderly, properly lighted and ventilated with the proper safety compliance.Noise levels are considered moderate.  Boot Barn, Inc. reserves the right to make exceptions to modify or eliminate this document or its content. This document supersedes all previous policies, procedures or guidelines pertaining to this subject.  Our core value of community bands us together in supportive and inclusive ways to drive our collective success. Boot Barn provides equal employment opportunity to all applicants and employees without regard to race, color, religion, sex, sexual orientation, age, national or ethnic origin, veteran or military status, disability, as well as any other protected status under the law.  Americans with Disabilities Act (ADA) - Boot Barn will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required by applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Boot Barn Store or Distribution Center or reach out to Human Resources at 1-949-453-4400, Option 4.  California Privacy Notice", "responsibilities": "The Sr. Buyer is responsible for executing the product vision, selection and management of the merchandising programs in men’s apparel that supports the Boot Barn merchandising strategies both in stores and ecommerce. The buyer will direct the assortment planning, quantification and timely execution of receipts against the approved class sales plans. ", "qualifications": {"required": "Bachelor’s degree with 3-5 years retail buying experience in either a specialty store or department store.Excellent knowledge of Excel, Word and Power PointStrong communication skills, providing direction to private label, design and product development team and brandsAbility to work as a team member, multitask and give clear direction. Builds rapport and relationships both internally and externally with Store Operations, Visuals, Marketing, Design, Private Brand, VendorsMust be task driven and pro-active when it comes to executing tasksThorough knowledge of retail math such as sales, gross margin, OTB calculations, initial mark-up calculations turnover, etc.Effective oral presentations with well-prepared content and confident deliveryStrong negotiation skillsExperience meeting multiple deadlines", "preferred": null}, "skills": ["Excel", "Word", "PowerPoint", "Communication", "Retail Math", "Negotiation"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "Competitive salary. (insert any other compensation opportunities here)Merchandise discount: 50% off of Exclusive Brands and 40% off of third-party brands.Paid Time Off plan for year-round Boot Barn Partners.*Medical, Dental, Vision and Life Insurance.*401(k) plan with generous company matching.Flexible schedules and work/life balance.Opportunities for growth at every level – we are opening 50+ new stores each year.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3942842903"}