{"jobTitle": "Manager, Finance Transformation", "company": {"name": "Sony Pictures Entertainment", "industry": "Entertainment Providers", "size": "Large", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Entertainment Providers", "description": "Sony Pictures Entertainment is looking for a Manager of Finance Transformation to help drive the transformation of the finance function across all SPE Business Units and functions including Motion Pictures, Television, Networks, Corporate Functions, Development, Production, Marketing, and Distribution. This individual will join a team of change-agents who are the keepers of the Finance Vision and trusted partners in realizing that vision by acting as the in-house consulting arm to the Finance Organization. This role will provide consultative and project management support across a portfolio of projects that improve the financial planning, reporting, analytical, and commercial support capabilities across the company. This individual will leverage their finance, technology, and consulting skills to partner directly with senior executives from multiple business units and functions across the company.", "responsibilities": "Working with key stakeholders to map and assess current state of teams, systems, and processes, aiming to identify pain points and inefficiencies. Identifying, evaluating, designing, and implementing more streamlined and value-added systems, go-forward processes, and analytical outputs. Overseeing development of the project business case including the cost-benefit analysis and other support for the quantitative and qualitative assessment of projects. Developing and executing against project plans in partnership with team members and business stakeholders – driving initiatives through to completion. Leading meetings with key stakeholders and developing accompanying agenda and materials that drive projects forward. Using agile methodology and, at times, role as Scrum Master to lead projects, managing tasks, issues, risks, and action items while facilitating meetings and eliminating impediments to the team. Collaborating with technical teams to provide input on technical solutions and support end-to-end solution delivery. Ongoing presentation of progress and findings to senior management, making recommendations based on analysis and trends and securing sponsorship and organizational alignment. Contributing to CFO special projects, potentially including - targeted business analyses, planning large scale events, leading initiatives improving the attraction and retention of top talent, and contributing to varied initiatives supporting the Finance Vision. Mentor staff both inside Finance Transformation and across Finance via a portfolio of initiatives.", "qualifications": {"required": "BA/BS degree or substantial coursework in an analytics discipline including business, accounting, finance, and systems engineering. Excellent written and verbal communication skills, and ability to interface effectively with executive stakeholders and all other levels of an organization. Multiple years of experience and proficiency in meeting with stakeholders to structure problems or opportunities, diagraming current and future states, and developing and selling solutions. High proficiency in developing and presenting PowerPoint decks that explain complex problems, solutions, and initiatives. Proficiency in project management and facilitation –structuring discussion, prioritizing work, setting timelines, and identifying and removing roadblocks. Fundamental understanding of Financial Planning and Accounting systems, reports, models, and processes. Proficiency in reviewing complex financial reports and models; Intermediate skill in building complex financial models. Desire to identify and solve problems that improve corporate processes and achieve business strategies. Must have strong qualitative and quantitative analytical skills, an inquisitive mindset, and ability to think strategically. Extraordinarily high level of motivation, self-reliance, and commitment to working diligently and overcoming obstacles to continually add value to the team. Agile experience a plus. Great team player, willingness to work effectively with a wide range of stakeholders. Expertise with multiple analytic tools and demonstrably high technological aptitude: advanced Excel is a must; proficiency with some analytical or visualization software is preferred including SQL, R, Python, VBA, SAP BPC, SAC, Power BI, Tableau, Alteryx, etc. a plus. High level of focus on work quality and attention to detail. Entertainment or media experience a plus.", "preferred": "4+ years of experience in a consulting or financial role."}, "skills": ["Finance", "Project Management", "Analytical Skills", "Communication", "Agile Methodology", "Problem Solving", "Financial Reporting", "Stakeholder Management", "PowerPoint", "Excel"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3942676324"}