{"jobTitle": "Sales Assistant", "company": {"name": "HOLLY HUNT", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "53,600.00 - 66,725.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Furniture and Home Furnishings Manufacturing", "description": "Why join us?<br/><br/>For nearly four decades, Holly Hunt has been the defining voice in modern luxury interiors. We offer exquisite furnishings, an unparalleled showroom experience, and unwavering service to the residential and commercial design trade. During that time, we’ve stayed true to our passions, values, and deep beliefs—that well-designed spaces enrich one’s life experience, that quality of materials and craftsmanship can never be compromised, and that supporting our clients with the tools and resources to create beautiful environments is the ultimate reward.<br/><br/>Our purpose is to design for the good of humankind. It’s the ideal we strive toward each day in everything we do. Being a part of MillerKnoll means being a part of something larger than your work team, or even your brand. We are redefining modern for the 21st century. And our success allows MillerKnoll to support causes that align with our values, so we can build a more sustainable, equitable, and beautiful future for everyone.<br/><br/>POSITION PROFILE<br/><br/>The Sales Assistant is an integral part of the Holly Hunt Showroom. Their responsibilities are to work closely with the Sales Associate, Clients, Corporate Office, Outside Sales Associate, and Represented Vendors, to ensure the smooth processing and production of orders. The Sales Assistant is also responsible for much of the logistics required for the showroom.<br/><br/>Primary Responsibilities<br/><br/><ul><li>Answer incoming phone calls, transfer to appropriate Sales Associate</li><li>Enter all new clients on customer card (assign SC account#), collect Resale form to turn into corporate – send new client welcome packet to all new account holders</li><li>Update expired resale info</li><li>Process credit card payments, record deposits in Navision, release orders</li><li>Double check all order packets for accuracy</li><li>Assist in coordinating correct freight charges for client orders and ensuring ship to information is complete</li><li>Make sure COM ID form is complete and sent to vendor as required</li><li>Update approvals for SFAs / DFAs</li><li>Request freight updates if ship to changes or expedited freight is required post order</li><li>Run weekly Order Status reports, manage open orders, update clients on ECD, add RDDs, review order hold reports</li><li>Expedite orders partnering Client First team to prioritize hot orders</li><li>Follow up on Balance Due Notices to collect payments</li><li>Provide tracking updates to clients</li><li>Initiate customer service claims to Client First teams, expediting replacements/repairs as needed</li><li>Get estimates and facilitate local repairs, coordinate with clients or receiving warehouse</li><li>Complete and submit refund request forms for overpayments</li><li>Maintain sales tools (order tear sheets, catalogs, finish samples, etc) on sales floor and order when needed</li><li>Be a team player, cover breaks as needed</li><li>Acknowledge every client that comes into the showroom</li><li>Work with clients in the showroom and on the phone as needed</li><li>Pull sample/tear sheets and perform fabric shops as needed</li><li>Assist with mailers and eblasts<br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li>Bachelor's degree preferred</li><li>1-2 years working in a retail, design, or showroom environment, luxury experience preferred</li><li>Ability to multitask</li><li>Excellent communication skills both written and verbal</li><li>Some lifting (20-50 lbs max)</li><li>Proficient in Microsoft Word/Excel/Outlook<br/><br/></li></ul>Who We Hire?<br/><br/>Simply put, we hire everyone. Holly Hunt is comprised of people of all abilities, gender identities and expressions, ages, ethnicities, sexual orientations, veterans from every branch of military service, and more. Here, you can bring your whole self to work. We’re committed to equal opportunity employment, including veterans and people with disabilities.<br/><br/>A starting compensation range for this role is $53,600.00 - $66,725.00. Relevant salary considerations will include candidate qualifications and experience, other business/organizational needs and market factors . You may also be eligible to receive a geographic premium, annual discretionary incentive and equity awards which are subject to the rules governing these programs. The company offers a full spectrum of benefits including Medical, Prescription Drug, Dental, Vision, Health Savings Account, Dependent Day Care Savings Account, Life Insurance, Disability and Other Insurance Plans, Paid Time Off (including Vacation and Parental Leave), Holidays, 401(k), and Short/Long Term Disability, in addition to other special perks reserved for our associates.<br/><br/>This organization participates in E-Verify Employment Eligibility Verification. In general, MillerKnoll positions are closed within 45 days and are open for applications for a minimum of 5 days. We encourage our prospective candidates to submit their application(s) expediently so as not to miss out on our opportunities. We frequently post new opportunities and encourage prospective candidates to check back often for new postings.<br/><br/>MillerKnoll complies with applicable disability laws and makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact MillerKnoll Talent Acquisition at careers_help@millerknoll.com.", "responsibilities": "The Sales Assistant is an integral part of the Holly Hunt Showroom. Their responsibilities are to work closely with the Sales Associate, Clients, Corporate Office, Outside Sales Associate, and Represented Vendors, to ensure the smooth processing and production of orders. The Sales Assistant is also responsible for much of the logistics required for the showroom.<br/><br/>Primary Responsibilities<br/><br/><ul><li>Answer incoming phone calls, transfer to appropriate Sales Associate</li><li>Enter all new clients on customer card (assign SC account#), collect Resale form to turn into corporate – send new client welcome packet to all new account holders</li><li>Update expired resale info</li><li>Process credit card payments, record deposits in Navision, release orders</li><li>Double check all order packets for accuracy</li><li>Assist in coordinating correct freight charges for client orders and ensuring ship to information is complete</li><li>Make sure COM ID form is complete and sent to vendor as required</li><li>Update approvals for SFAs / DFAs</li><li>Request freight updates if ship to changes or expedited freight is required post order</li><li>Run weekly Order Status reports, manage open orders, update clients on ECD, add RDDs, review order hold reports</li><li>Expedite orders partnering Client First team to prioritize hot orders</li><li>Follow up on Balance Due Notices to collect payments</li><li>Provide tracking updates to clients</li><li>Initiate customer service claims to Client First teams, expediting replacements/repairs as needed</li><li>Get estimates and facilitate local repairs, coordinate with clients or receiving warehouse</li><li>Complete and submit refund request forms for overpayments</li><li>Maintain sales tools (order tear sheets, catalogs, finish samples, etc) on sales floor and order when needed</li><li>Be a team player, cover breaks as needed</li><li>Acknowledge every client that comes into the showroom</li><li>Work with clients in the showroom and on the phone as needed</li><li>Pull sample/tear sheets and perform fabric shops as needed</li><li>Assist with mailers and eblasts<br/><br/></li></ul>", "qualifications": {"required": "1-2 years working in a retail, design, or showroom environment, luxury experience preferred, Ability to multitask, Excellent communication skills both written and verbal, Some lifting (20-50 lbs max), Proficient in Microsoft Word/Excel/Outlook", "preferred": "Bachelor's degree"}, "skills": ["Microsoft Word", "Microsoft Excel", "Microsoft Outlook", "Communication", "Sales"], "postedDate": "2 weeks ago", "benefits": "A starting compensation range for this role is $53,600.00 - $66,725.00. Relevant salary considerations will include candidate qualifications and experience, other business/organizational needs and market factors . You may also be eligible to receive a geographic premium, annual discretionary incentive and equity awards which are subject to the rules governing these programs. The company offers a full spectrum of benefits including Medical, Prescription Drug, Dental, Vision, Health Savings Account, Dependent Day Care Savings Account, Life Insurance, Disability and Other Insurance Plans, Paid Time Off (including Vacation and Parental Leave), Holidays, 401(k), and Short/Long Term Disability, in addition to other special perks reserved for our associates.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3942958179"}