{"jobTitle": "Account Executive (West)", "company": {"name": "HeadLight", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "HeadLight, founded in 2005, delivers industry-leading technology to transportation construction teams. Our photo-driven inspection and verification technology enables clients to streamline and mobilize project inspections, communications, and documentation leading to superior project deliveries. The HeadLight platform has been used on transportation construction projects nationwide. Customers include large departments of transportation, top-tier consulting engineering firms, contractors, equipment manufacturers, and industry-related materials companies.", "responsibilities": "Working with Segment Leaders, you will establish a vision and plan to guide your long-term approach to new logo pipeline generation within your defined region. You will consistently deliver ARR revenue targets to support HeadLight's YoY growth - dedication to the number and to deadlines. Develop and execute consultative/solution sales tactics to generate pipeline, drive sales opportunities and deliver repeatable and predictable bookings. Identify, pursue, engage, and close sales opportunities with top public- and private-sector accounts in your region. In collaboration with Solutions Engineering team, guide prospects on appropriate and value-focused solution sets from among HeadLight's suite of solutions. Explore the full spectrum of relationships and business possibilities across the client's entire org chart. Expand relationships and orchestrate complex deals across more diverse business stakeholders. Provide guidance and coordination to other Growth team members involved in the sales cycle as needed to deliver bookings. Work as a team for the most efficient use and deployment of resources. Provide timely and insightful input back to other corporate functions, including Marketing and Communications, Operations, Customer Experience, and Solutions. Position HeadLight's solutions at both the functional and \"business value\" level with target stakeholders. Champion HeadLight to prospective clients during sales presentations, site visits, industry event attendance, and product demonstrations.", "qualifications": {"required": "You have 5+ years experience in full-cycle sales experience in B2B and/or B2G SaaS with an exceptional track record of meeting/exceeding sales targets. You have experience in negotiating and closing SaaS deal sizes of at least $100k/year in terms of annual contract value (ACV) and sales cycles of 4-6 months. Ready to travel (up to 30% of the time) to customers in the Western US. You possess excellent communication & interpersonal skills and can liaise effectively with senior stakeholders. You are comfortable using Sales Enablement platforms and CRM (eg. Salesforce). You are results-driven, tenacious, and a strong team player. You have experience selling complex software solutions with the construction and infrastructure industries.", "preferred": "Not specified"}, "skills": ["Sales", "B2B", "B2G", "SaaS", "CRM", "Sales Enablement", "Communication", "Interpersonal Skills"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Accrued PTO, Sick Time, 401k Match, Employee Paid Medical, Dental, and Vision Premiums, Home Office subsidy, Monthly Telecommunications Reimbursement, Salary Range: $110-130K base compensation plus additional uncapped commission incentive.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3943546333"}