{"jobTitle": "Lead Organizer", "company": {"name": "LA Voice", "industry": "Internet Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Internet Publishing", "description": "LA Voice Lead Organizer\n\nOrganization:\n\nLA Voice believes all people have power and a voice. Every day we amplify that power by uniting diverse faith voices and equipping grassroots leaders to organize for what their communities need, winning systemic changes that improve the lives of all county residents. We are an interfaith, multi-racial, multicultural organization of 70 faith and spiritual communities that represent more than 50,000 families in Los Angeles County. (See our Facebook page L.A. Voice or website www.lavoice.org). Our core strategic values are: exponential growth of grassroots leadership; bridging to belong across differences; and confrontation with power for social transformation leading to racial equity and inclusion.\n\nOur diverse and experienced team works with communities across the county to create a Los Angeles with racial equity and abundant life for all.\n\nLA Voice is a member of Faith in Action (www.faithinaction.org), the largest grassroots spiritual and congregational organizing network in the U.S. and a member of PICO California, an effective, highly respected grassroots organization playing a significant role to turn the tide toward inclusion and equity and create a true state of belonging.\n\nPosition Summary:\n\nLA Voice is seeking to hire a full-time Lead Organizer to support and develop spiritually-centered/faith-based grassroots leadership and power in Los Angeles County. The ideal candidate will have significant experience and training in community organizing, ideally as a Lead Organizer or other management role; effective communication and time management skills; emotional intelligence; comfort or fluency in multiple ethnic and religious communities; a passion—and proven track record— of developing organization and other people’s leadership and growth; and clarity that undoing racism is central to the struggle for our shared future. This is an amazing opportunity to be a part of a diverse and growing team that is creating positive, systemic change in Los Angeles and California.", "responsibilities": "Provides strategic leadership on a collaborative team with fellow lead organizers and the Director of Organizing, co-creating and implementing long term plans for building county-wide power for racial and economic justice in alignment with LA Voice’s organization-wide strategy. Demonstrates a disciplined focus on intentional leadership through 1:1 conversations— identifying interests, values, potential leadership, and inviting grassroots members/leaders into meaningful roles in the public arena. Recruits, develops, and supports grassroots leaders to exercise power for social change through organization, and team structure development — listening, building relational power, identifying issues, training leaders, and organizing actions with policy-makers and decision makers at local, countywide, and state levels. Builds intentional relationships with clergy and religious/spiritual leaders: identifying interests and challenges in congregations, inviting clergy into strategic leadership exploring how LA Voice membership meets congregational needs and constructing strategies for congregational development. Manages at least one Community Organizer and supports their growth and development.", "qualifications": {"required": "Minimum five years experience in community organizing. Driven, self-disciplined and flexible. Group leadership skills; track record that includes nurturing, managing, and guiding teams of people successfully toward shared goals. Facility working with clergy and people of faith from different communities. Effective interpersonal and relational skills; self-reflective and hungry for growth. Experience effectively managing and developing skills of past staff team members. Demonstrated success developing and leading organizing campaigns to win tangible benefits for the community. Commitment and track record of bridging across differences--including race, faith, and life experience--in order to nurture a staff team, an organization, and a county of belonging. CA driver’s license and access to a reliable automobile (with at minimum, liability insurance).", "preferred": "Knowledge of and experience organizing in Los Angeles County. More than six years of impactful community organizing. Fluency in Spanish or other language relevant to our organizing. Experience doing integrated voter engagement, including canvassing, phone banking, and/or using PDI. Experience organizing with people who have been incarcerated, people without immigration documents, or people experiencing homelessness/housing displacement/severe rent burden. Life experience with incarceration, being without immigration documents, or homelessness/housing displacement/severe rent burden. Bachelor’s degree, Master’s degree or other advanced coursework."}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "This is a full-time, salaried position. The job includes regular evening work and some weekend work. The role requires frequent travel within LA County to meet with grassroots leaders, in addition to weekly staff meetings at our offices in Downtown LA. Salary is competitive for the region and based on experience and demonstrated capacities, in a range from $70,000-$95,000. LA Voice’s compensation structure was developed from best practices in equitable and transparent compensation, and includes a generous benefits package including matching 401(k); 15 days paid vacation increasing to 20 after three years of service and 25 after five years (plus holidays, including the week between Christmas and New Year); and medical, dental, and vision insurance. LA Voice is an Equal Opportunity Employer and does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), or any other basis protected by law.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3943945054"}