{"jobTitle": "Interior Designer", "company": {"name": "HOK", "industry": "Architecture and Planning", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$100,000 to $110,000", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Architecture and Planning", "description": "HOK is a collective of future-forward thinkers and designers who are driven to face the critical challenges of our time. We are dedicated to improving people's lives, serving our clients and healing the planet. Together, we cultivate a culture of design excellence at the confluence of art and science, blending the power of creative expression with a clear sense of purpose. We are currently seeking an Interior Designer to join our team. As an Interior Designer, you are responsible for interpreting, organizing and executing the conceptual design of a project. Utilizing creativity, foresight and judgment to meet project requirements and objectives through project completion.", "responsibilities": "Conducts programming efforts such as space planning, layout and utilization of furnishings and equipment, lighting and color coordination. Develops innovative design concepts which are practical, aesthetic, safe and conducive to intended purposes and function which is reflective of client goals and within project budget. Implements all phases of a design project which includes contracts, budgeting, scheduling, planning, design, documentation, specifications and construction, including the selection and specification of furniture. Responsible for maintaining positive client relationships throughout project. Keeps client apprised of project progress on regular basis. Initiates and maintains contract with other key project individuals for clarification, coordination and negotiation of critical issues. Conducts programming efforts such as space planning, layout and utilization of furnishings and equipment, lighting and color coordination. Responsible for selection and specification of furniture, lighting, flooring, wall covering and artwork. Estimates material requirements and costs. Solicits bids and assists Project Manager and client in subcontracting fabrication, installation, and arrangement of the materials, finishes, and furnishings required. Responsible for keeping the project, or a phase of a project, on schedule. Responsible for communication with other disciplines, vendors, and contractors to ensure incorporation of all information into project requirements and provides support as necessary. Leads the Construction Administration phase responding to RFI’s, CO’s, reviewing shop drawings and involved in the field site reviews. Responsible for managing project using the Deltek Vision; complete work plans; including identification of project team members, budget, consultants, schedule for completion, fees and labor costs as well as project change notices or other actions taking place on the assigned project. Responsible for financial outcome of projects. Implements and utilizes HOK Standards for all projects and processes. Ensures project documentation and contracts are in compliance with the standards set forth by the Technical Board. Incorporates Integrated Sustainable Design solutions into projects. Takes personal responsibility for fostering a green workplace through sustainable work practices.", "qualifications": {"required": "Requires a Bachelor’s degree in architecture, interior design or foreign equivalent. Prior experience in interiors projects required. Must be professional Interior Designer and have passed the NCIDQ exam or be a registered Architect with current license required. If registered Architect, NCARB registration preferred. LEED credential required within 6 months of employment.", "preferred": "Possess creative talent in conceptual design and rendering skills of either hand or computer sketching. Advanced knowledge of design principles and the ability to interpret design concepts and layouts, including commonly used concepts, practices, and procedures within the profession. Knowledge of design, trends, construction methodology, materials application and manufacturer-supplier appropriateness. Advanced knowledge of furniture, fixture and equipment (FF&E), architectural/interior finishes, lighting, signage, art, and color schemes to carryout design intent. Knowledge of building regulations and safety codes. Knowledge of design techniques, tools, and principles involved in production of precision technical plans, blueprints, drawings, and models. Thorough knowledge of sustainability, integrated design and LEED guidelines. Knowledge of buildingSMART, Building Information Modeling (BIM) and Integrated Project Delivery (IPD). Proven ability to prioritize in order to meet deadlines and provide high quality service to clients. Proficiency in the basic technical skills of interior design including the following computer skills: Proficiency in MS Office, including Word, Excel and Outlook. Proficiency in Newforma preferred. Proficiency in AutoCAD/Architectural Desktop. Proficiency in Revit is preferred. Knowledge of 3D Modeling software such as 3D Studio Max and Viz 2006. Knowledge of Photoshop, Illustrator, Sketchup, and InDesign graphic software. Ability to effectively meet deadlines. Ability to communicate effectively, both verbally and in writing. Ability to work in team environment."}, "skills": ["Interior Design", "Space Planning", "Project Management", "Client Relations", "Sustainable Design"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "HOK is committed to providing our employees with a comprehensive benefits plan to meet their current and future needs. Benefits include medical, dental and vision coverage; 401(K) savings plans; disability, life and accident insurance; paid time off (PTO); and parental leave. In addition, HOK employees enjoy a flexible work schedule with the option to work remotely on Mondays and Fridays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3943662372"}