{"jobTitle": "Content Planning Manager", "company": {"name": "The Walt Disney Company", "location": "Glendale, CA", "industry": "Entertainment Providers"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "84,500.00/yr - 113,300.00/yr", "currency": "USD"}, "jobFunction": "Art/Creative and Design", "industry": "Entertainment Providers", "description": "<strong>About The Role &amp; Team<br/><br/></strong>Disney’s Direct to Consumer team oversees the Hulu and Disney+ streaming businesses within Disney Entertainment, helping to bring The Walt Disney Company’s best-in-class storytelling to fans and families everywhere. The Disney+ Subscriber Engagement and Content Programming team is responsible for leading content planning, scheduling, on-service merchandising, slate management, and programming insights that contribute to a cohesive strategic content approach for the service.<br/><br/>What You Will Do<br/><br/>The Content Planning Manager supports the Disney+ Global Content Planning division within the Disney+ Global Subscriber Engagement and Content Programming organization. They collaborate with International Planning teams and domestic stakeholders to facilitate effective communication and implementation of global plans and priorities.<br/><br/>Reporting to the Senior Manager of Content Planning, the Content Planning Manager will have experience in title management and a proven background in project management to assist in the day-to-day management of Airtable trackers and deliverables, as well as to provide support for ad-hoc data consolidation as needed. With a keen eye for detail and ability to interpret and track high volumes of data, we are looking for a collaborative, results-oriented team member who excels in meticulous, logistical planning work.<br/><br/><strong>Responsibilities<br/><br/><br/></strong><ul><li>Lead day-to-day planning and data management needs for the Disney+ title intake processes including tasks as: managing and preparing spreadsheets and documents, data entry, large-scale data audits, ongoing data cleanup and tracking title intake milestones.</li><li>Providing insight as to content planning within software tool development, Airtable ecosystem enhancements, interface creation, and user acceptance testing (UTA).</li><li>Various ad-hoc tasks such as inputting and tracking updates and generating reports as required.</li><li>Approach any challenges with a solution-oriented attitude and serve as project manager for ad hoc requests as they come up.</li><li>Represent Disney+ Content Planning in meetings with a professional and enthusiastic demeanor.<br/><br/><br/></li></ul><strong>Required Qualifications &amp; Skills<br/><br/><br/></strong><ul><li>3+ years minimum experience within digital media and entertainment in fields related to title management, slate planning, content strategy, content curation, localization, lifecycle planning, or project management.</li><li>Proficient in interpreting and tracking large amounts of data with an analytical mentality, effectively applying insights to strategy to get results.</li><li>Proficiency in Airtable, Excel, Google Docs, Google Sheets, and Salesforce</li><li>Solid track record of effectively documenting detailed processes with a strong emphasis on meeting deadlines consistently.</li><li>Exceptional communication, interpersonal, and problem-solving abilities that facilitate seamless collaboration within teams.</li><li>Adept at quickly learning and adapting to new tools and technologies to enhance productivity and efficiency.</li><li>Skilled in maintaining a diplomatic and collaborative approach, fostering positive relationships and forward-thinking solutions.</li><li>Demonstrating meticulous attention to detail and a commitment to ensuring accuracy in all tasks.</li><li>Ability to effectively prioritize tasks and communicate effectively in high-pressure, fast-paced environments.</li><li>Taking a proactive and self-sufficient approach to problem-solving and continuously seeks opportunities for skill development and improvement.<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/><br/></strong><ul><li>Ability to enhance title planning and suggest effective solutions.</li><li>Extensive project management experience.</li><li>Proficiency in crafting Airtable bases and interfaces.</li><li>Familiarity with JIRA and software UAT testing</li><li>Previous experience in SVOD or Linear TV industry is a strong advantage.</li><li>Passion and insight into The Walt Disney Company segments, brands and franchises, the elements that define them, and expertise to build further audience engagement.<br/><br/><br/></li></ul>Required Education<br/><br/><br/><ul><li>Bachelor’s degree<br/><br/><br/></li></ul>Disability accommodation for employment applications<br/><br/>The Walt Disney Company and its Affiliated Companies are Equal Employment Opportunity employers and welcome all job seekers including individuals with disabilities and veterans with disabilities. If you have a disability and believe you need a reasonable accommodation in order to search for a job opening or apply for a position, email Candidate.Accommodations@Disney.com with your request. This email address is not for general employment inquiries or correspondence. We will only respond to those requests that are related to the accessibility of the online application system due to a disability.<br/><br/>The Walt Disney Company is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world.<br/><br/>The hiring range for this position in Glendale, California is $84,500 to $113,300 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "responsibilities": "<ul><li>Lead day-to-day planning and data management needs for the Disney+ title intake processes including tasks as: managing and preparing spreadsheets and documents, data entry, large-scale data audits, ongoing data cleanup and tracking title intake milestones.</li><li>Providing insight as to content planning within software tool development, Airtable ecosystem enhancements, interface creation, and user acceptance testing (UTA).</li><li>Various ad-hoc tasks such as inputting and tracking updates and generating reports as required.</li><li>Approach any challenges with a solution-oriented attitude and serve as project manager for ad hoc requests as they come up.</li><li>Represent Disney+ Content Planning in meetings with a professional and enthusiastic demeanor.<br/><br/><br/></li></ul>", "qualifications": {"required": "3+ years minimum experience within digital media and entertainment in fields related to title management, slate planning, content strategy, content curation, localization, lifecycle planning, or project management.\nProficient in interpreting and tracking large amounts of data with an analytical mentality, effectively applying insights to strategy to get results.\nProficiency in Airtable, Excel, Google Docs, Google Sheets, and Salesforce\nSolid track record of effectively documenting detailed processes with a strong emphasis on meeting deadlines consistently.\nExceptional communication, interpersonal, and problem-solving abilities that facilitate seamless collaboration within teams.\nAdept at quickly learning and adapting to new tools and technologies to enhance productivity and efficiency.\nSkilled in maintaining a diplomatic and collaborative approach, fostering positive relationships and forward-thinking solutions.\nDemonstrating meticulous attention to detail and a commitment to ensuring accuracy in all tasks.\nAbility to effectively prioritize tasks and communicate effectively in high-pressure, fast-paced environments.\nTaking a proactive and self-sufficient approach to problem-solving and continuously seeks opportunities for skill development and improvement.<br/><br/><br/>", "preferred": "Ability to enhance title planning and suggest effective solutions.\nExtensive project management experience.\nProficiency in crafting Airtable bases and interfaces.\nFamiliarity with JIRA and software UAT testing\nPrevious experience in SVOD or Linear TV industry is a strong advantage.\nPassion and insight into The Walt Disney Company segments, brands and franchises, the elements that define them, and expertise to build further audience engagement.<br/><br/><br/>"}, "skills": ["Title Management", "Slate Planning", "Content Strategy", "Content Curation", "Localization", "Lifecycle Planning", "Project Management", "Airtable", "Excel", "Google Docs", "Google Sheets", "Salesforce", "JIRA", "Software UAT Testing", "SVOD", "Linear TV"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3943829496"}