{"jobTitle": "Shipping Receiving Coordinator", "company": {"name": "MashPoint - Technology & Staffing- merged with HuMetis group Inc", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$18/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "The Shipping and Receiving Coordinator supports Shipping and Receiving Team with coordinating activities and creating shipping documentation to external customers or other facilities. Confirms delivery completion in the business system, coordinates outbound freight for carriers, and audits all export shipments, while following policies, procedures and safety regulations.", "responsibilities": "Verifies and maintains records on incoming and outgoing shipments. Creates shipping documentation, including packing lists, bills of lading, and address labels for all outbound shipments. Ensures that inventories are secure, properly identified and readily accessible to authorized personnel. Coordinates outbound freight for carriers, and audits all export shipments. Confirms delivery completion in the business system. Communicates with other functions regarding traffic and logistic coordination, and contract administration. Follows all safety policy and procedures. Other responsibilities as assigned. Regular, consistent and punctual attendance is required. May need to work nights and weekends, variable schedule(s) and additional hours as necessary.", "qualifications": {"required": "A Secondary Certificate/High School Diploma or equivalent combination of relevant education and work experience that will allow successful performance of job expectations. 2 years or more of relevant experience.", "preferred": "Knowledge and experience in Shipping and Receiving management processes and the ability to coordinate activities for a team. Excellent internal and external customer service skills. Strong attention to detail, good organizational skills and the ability to prioritize with changing situations. Ability to solve typical problems by evaluating and selecting solutions from established options. Good interpersonal, verbal and written communication skills to drive tasks to completion. Proficient in Microsoft Office Suite."}, "skills": ["Shipping and Receiving management", "Customer service", "Organizational skills", "Problem-solving", "Communication", "Microsoft Office Suite"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3943858948"}