{"jobTitle": "Associate, Corporate Compliance", "company": {"name": "Ares Management Corporation", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Business Development and Sales", "industry": "Financial Services", "description": "<em>Over the last 20 years, Ares’ success has been driven by our people and our culture. Today, our team is guided by our core values – Collaborative, Responsible, Entrepreneurial, Self-Aware, Trustworthy – and our purpose to be a catalyst for shared prosperity and a better future. Through our recruitment, career development and employee-focused programming, we are committed to fostering a welcoming and inclusive work environment where high-performance talent of diverse backgrounds, experiences, and perspectives can build careers within this exciting and growing industry.<br/><br/></em><strong>Job Description<br/><br/></strong>The Ares Legal &amp; Compliance Department oversees and manages Ares’ global Legal, Regulatory and Compliance functions and programs. Under the leadership of the Global Chief Compliance Officer, the Compliance and Regulatory functions are comprised of teams that operate collaboratively with a global focus, including Regulatory, which oversees all global regulatory matters including the Advisers Act, Investment Company Act and FINRA; European and Asia Pacific Compliance, which oversees region-specific compliance and regulatory matters; and Financial Crimes Prevention, which oversees Ares’ adherence to financial crimes-related rules and regulations.<br/><br/>As a member of Compliance at Ares, you will work with and support the Corporate Compliance team to ensure that we continue to build an environment where issues are handled with integrity, we do what is in the best interest of our clients, and that we comply with all regulatory requirements. The ideal candidate will demonstrate keen attention to details, results-oriented, growth mindset and the ability to perform in a fast paced and dynamic environment.<br/><br/><strong>Primary Functions And Essential Responsibilities<br/><br/></strong><ul><li>Support the administering of the Corporate Compliance polices, including Code of Ethics and Conduct and Anti-Corruption policies;</li><li>On a daily basis, respond to inquiries relating to gifts &amp; entertainment, and screen lists of invitees to Ares-sponsored events;</li><li>Assist in processing and escalating Code of Conduct and Anti-Corruption matters including pre-clearance of business gifts and entertainment and political contributions as well as Conflict of Interest policy matters such as employee outside business activity requests;</li><li>Support the onboarding of new employees into our Compliance program including, i) new hire access activation; ii) new hire training and disclosure form tracking; iii) tracking current employee statuses for certifications/access maintenance; and iv) tracking temporary workers;</li><li>Support offboarding process for terminated employees;</li><li>Assist in the creation and delivery of training materials to staff members;</li><li>Participate in Compliance program initiatives, projects, etc. beyond core responsibilities;</li><li>Utilize compliance system technology to leverage information sharing and enable collaboration;</li><li>Identify exceptions to policies and escalate as appropriate for further analysis to address root cause assessment;</li><li>Be a daily resource to Ares’ global employee base on compliance questions and issues;</li><li>Help maintain internal procedures and training materials that are critical to the effectiveness and continuity of the Ares Corporate Compliance program;</li><li>Help maintain, track and report key performance indicators/metrics for Corporate Compliance team as assigned; and</li><li>Assist with intake requests for record retention and data management.<br/><br/></li></ul><strong>Education<br/><br/></strong><strong>QUALIFICATIONS <br/><br/></strong><ul><li>Bachelor’s degree preferred</li><li>Compliance Certificate considered a plus<br/><br/></li></ul><strong>Experience Required<br/><br/></strong><ul><li>2 to 4 years of compliance and/or paralegal experience within the financial services industry</li><li>Proficiency with Microsoft Office Suite (Excel, Word, PowerPoint)<br/><br/></li></ul><strong>General Requirements And Personal Attributes<br/><br/></strong><ul><li>Energetic, initiative-taking, coachable, detailed oriented and organized;</li><li>Enjoys a fast-paced environment with changing and evolving responsibilities;</li><li>Knowledge and experience with SEC regulations and laws;</li><li>Solid written, verbal and interpersonal skills;</li><li>Strong analytical and critical thinking skills;</li><li>Creative, entrepreneurial, able to work in teams under high pressure and contribute to a collaborative environment;</li><li>Resilient with ability to adapt to changing business priorities and emerging technologies;</li><li>Invested in own personal development;</li><li>Consistently pursues client experience excellence;</li><li>Familiarity with Compliance trading and CRM systems such as StarCompliance, ComplianceAlpha or Salesforce would be an added advantage.<br/><br/></li></ul><strong>Reporting Relationships<br/><br/></strong><strong>Compensation<br/><br/></strong>The anticipated base salary range for this position is listed below. Total compensation may also include a discretionary performance-based bonus. Note, the range takes into account a broad spectrum of qualifications, including, but not limited to, years of relevant work experience, education, and other relevant qualifications specific to the role.<br/><br/>$100,000 - $115,000<br/><br/>The firm also offers robust Benefits offerings. Ares U.S. Core Benefits include Comprehensive Medical/Rx, Dental and Vision plans; 401(k) program with company match; Flexible Savings Accounts (FSA); Healthcare Savings Accounts (HSA) with company contribution; Basic and Voluntary Life Insurance; Long-Term Disability (LTD) and Short-Term Disability (STD) insurance; Employee Assistance Program (EAP), and Commuter Benefits plan for parking and transit.<br/><br/>Ares offers a number of additional benefits including access to a world-class medical advisory team, a mental health app that includes coaching, therapy and psychiatry, a mindfulness and wellbeing app, financial wellness benefit that includes access to a financial advisor, new parent leave, reproductive and adoption assistance, emergency backup care, matching gift program, education sponsorship program, and much more.<br/><br/><em>There is no set deadline to apply for this job opportunity. Applications will be accepted on an ongoing basis until the search is no longer active.</em>", "postedDate": "2 weeks ago", "qualifications": {"required": "2 to 4 years of compliance and/or paralegal experience within the financial services industry\nProficiency with Microsoft Office Suite (Excel, Word, PowerPoint)", "preferred": "Bachelor’s degree\nCompliance Certificate"}, "skills": ["Microsoft Office", "Compliance", "SEC Regulations", "Financial Services", "CRM", "Salesforce", "StarCompliance", "ComplianceAlpha"], "benefits": "Comprehensive Medical/Rx, Dental and Vision plans; 401(k) program with company match; Flexible Savings Accounts (FSA); Healthcare Savings Accounts (HSA) with company contribution; Basic and Voluntary Life Insurance; Long-Term Disability (LTD) and Short-Term Disability (STD) insurance; Employee Assistance Program (EAP), and Commuter Benefits plan for parking and transit.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3944635563"}