{"jobTitle": "Training & Community Partnership Specialist / Community Health Education / Full Time", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "44,304.00-$76,544.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE<br/><br/>Ranked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California.<br/><br/>Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children.<br/><br/>The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation.<br/><br/>Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding.<br/><br/>It’s Work That Matters.<br/><br/>Overview<br/><br/><ul><li>This is a Remote position with occasional in-person onsite visits a couple times a month. Candidates must reside in CA.**<br/><br/></li></ul>Schedule: Days, 9am-5:30pm<br/><br/>Purpose Statement/Position Summary: The Integrated Delivery Systems (IDS) Department works to help ensure we provide comprehensive support to our patients and families. Within IDS, the Community Health Education team consists primarily of the community health workers who support enhanced care management and community health worker benefit. The team manages the social needs of the patients at CHLA, working in collaboration with care teams. Also, within IDS, our Center for Healthy Adolescent Transition (CHAT) provides support to adolescent and young adult patients to build their self-advocacy skills and support their transfer from CHLA to the adult healthcare system. The Training and Community Partnership Specialist is responsible for providing staff leadership, team training, project coordination, and community network building for the teams within IDS at CHLA. This position works directly with department leadership and in collaboration with other department staff to develop and coordinate ongoing training for our Community Health Workers, Peer Mentors, and Navigators to grow capacity and skills. This role will also be responsible for independently building a network of community partners. In addition, this position uses initiative to formulate and provide expertise and leadership to internal and external constituents.<br/><br/>Minimum Qualifications/Work Experience: 2+ years’ project coordination or community organization experience. Experience in community health setting and/or building curriculum and/or partnerships preferred. Bilingual English/Spanish preferred.<br/><br/>Education/Licensure/Certification: Bachelor's degree required.<br/><br/>Pay Scale Information<br/><br/>$44,304.00-$76,544.00<br/><br/>CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.<br/><br/>Children's Hospital Los Angeles (CHLA) is a leader in pediatric and adolescent health both here and across the globe. As a premier Magnet teaching hospital, you’ll find an environment that’s alive with learning, rooted in care and compassion, and home to thought leadership and unwavering support. CHLA is dedicated to creating hope and building healthier futures - for our patients, as well as for you and your career!<br/><br/>CHLA has been affiliated with the Keck School of Medicine of the University of Southern California since 1932.<br/><br/>At Children’s Hospital Los Angeles, our work matters. And so do each and every one of our valued team members. CHLA is an Equal Employment Opportunity employer. We consider qualified applicants for all positions without regard to race, color, religion, creed, national origin, sex, gender identity, age, physical or mental disability, sexual orientation, marital status, veteran or military status, genetic information or any other legally protected basis under federal, state or local laws, regulations or ordinances. We will also consider for employment qualified applicants with criminal history, in a manner consistent with the requirements of state and local laws, including the LA City Fair Chance Ordinance and SF Fair Chance Ordinance.<br/><br/>Qualified Applicants with disabilities are entitled to reasonable accommodation under the California Fair Employment and Housing Act and the Americans with Disabilities Act. Please contact CHLA Human Resources if you need assistance completing the application process.<br/><br/>Diversity inspires innovation. Our experiences, perspectives and backgrounds allow us to better serve our patients and create a strong community at CHLA.<br/><br/>Community Health Education", "responsibilities": "The Integrated Delivery Systems (IDS) Department works to help ensure we provide comprehensive support to our patients and families. Within IDS, the Community Health Education team consists primarily of the community health workers who support enhanced care management and community health worker benefit. The team manages the social needs of the patients at CHLA, working in collaboration with care teams. Also, within IDS, our Center for Healthy Adolescent Transition (CHAT) provides support to adolescent and young adult patients to build their self-advocacy skills and support their transfer from CHLA to the adult healthcare system. The Training and Community Partnership Specialist is responsible for providing staff leadership, team training, project coordination, and community network building for the teams within IDS at CHLA. This position works directly with department leadership and in collaboration with other department staff to develop and coordinate ongoing training for our Community Health Workers, Peer Mentors, and Navigators to grow capacity and skills. This role will also be responsible for independently building a network of community partners. In addition, this position uses initiative to formulate and provide expertise and leadership to internal and external constituents.", "qualifications": {"required": "2+ years’ project coordination or community organization experience. Experience in community health setting and/or building curriculum and/or partnerships preferred. Bilingual English/Spanish preferred.", "preferred": "Bachelor's degree required."}, "skills": ["Community Health", "Curriculum Development", "Project Coordination", "Community Outreach", "Training", "Partnership Development", "Bilingual", "English", "Spanish"], "postedDate": "1 week ago", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3944754237"}