{"jobTitle": "Marketing Insights Manager - Facebook", "company": {"name": "Meta", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "187,000.00/yr - 258,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "Facebook has been helping people connect for over 20 years – and we’re focused on making the next 20 just as successful. Increasingly, people on Facebook come together not only to connect with friends and family, but to discover and explore their world with the help of others. With over 3B people on the platform, people are finding others who share the same passions and interests they do, exchanging tips &amp; tricks on how get things done, and sharing life moments. We are seeking a Marketing Insights Manager to help guide Facebook’s evolution to meet these needs. The Marketing Insights Manager will lead our FB Insights team that focuses on product application and is an integral part of the product marketing and product development orgs working to shape the future of Facebook. This team is tasked with identifying ways to evolve our product and communications to better deliver on our vision, looking around corners to see where we need to explore next, working with a broad cross functional team to convene tables and move these ideas forward, and leading a team of 3 researchers who drive this work. A successful Marketing Insights Manager is insanely curious, a strategic thinker, understands how a strategy can drive business outcomes, is a visionary team leader, and can develop and grow research talent. In this role you will need to balance being a visionary leader and an everyday executor, and know how to drive change throughout the organization.<br/><br/>Marketing Insights Manager - Facebook Responsibilities:<br/><br/><ul><li>This role is responsible for shaping Facebook’s app vision/strategy and delivering measurable progress in partnership with a wide array of stakeholders. Specifically:</li><li>Identify product/user experiences that are most significant for delivering our app strategy.</li><li>Partner to shape product/marketing vision and understand how to support it, e.g. convening tables, removing roadblocks.</li><li>Understand product roadmaps and category shifts to identify the right near- and long-term investments for the team – setting their work up for success and finding opportunities to deliver consumer value.</li><li>Build relationships proactively across Product and Product Marketing to build influence and earn a seat at the table.</li><li>Be able to work well with and foster relationships that can drive action with both product teams and PMM marketing.</li><li>Lead the team by setting a vision, identifying scope, and working with your team on what areas each should focus on. This means identifying the work and helping them to thrive in the space, aligning them with the right stakeholders, having strategic conversations about how the work maps to our strategy, and helping them grow their careers and skills.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>12+ years Research expertise, extensive experience in both quantitative and qualitative market research</li><li>5+ years of team management/leadership experience with a track record of building and developing high functioning teams</li><li>Track record of being recognized for great research that uses fresh approaches to unlock solutions and/or creates change to product decisions that leads to business impact</li><li>Has experience executing product research that brings together product and marketing strategy to influence a singular brand vision</li><li>Must be entrepreneurial: This is like running a small business, with scarce resources</li><li>Be a demonstrated strategic thinker, with proven problem-solving skills</li><li>Is insanely curious and wonders what is happening next before others do</li><li>Exemplifies building relationships and proactively identifying who to work with</li><li>Knows how to be a Leader vs. a Manager</li><li>Exemplifies driving business outcomes through insights gleaned from research<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Has worked in consulting or at a brand/strategy agency</li><li>Experience to deliver concise, executive level, communications that focus on influencing business decisions</li><li>A demonstrated history of operating independently, prioritizing multiple work streams simultaneously and delivering measurement brand/product outcomes</li><li>Deep understanding and appreciation for Facebook and how it works<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$187,000/year to $258,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "This role is responsible for shaping Facebook’s app vision/strategy and delivering measurable progress in partnership with a wide array of stakeholders. Specifically: Identify product/user experiences that are most significant for delivering our app strategy. Partner to shape product/marketing vision and understand how to support it, e.g. convening tables, removing roadblocks. Understand product roadmaps and category shifts to identify the right near- and long-term investments for the team – setting their work up for success and finding opportunities to deliver consumer value. Build relationships proactively across Product and Product Marketing to build influence and earn a seat at the table. Be able to work well with and foster relationships that can drive action with both product teams and PMM marketing. Lead the team by setting a vision, identifying scope, and working with your team on what areas each should focus on. This means identifying the work and helping them to thrive in the space, aligning them with the right stakeholders, having strategic conversations about how the work maps to our strategy, and helping them grow their careers and skills.", "qualifications": {"required": "12+ years Research expertise, extensive experience in both quantitative and qualitative market research 5+ years of team management/leadership experience with a track record of building and developing high functioning teams Track record of being recognized for great research that uses fresh approaches to unlock solutions and/or creates change to product decisions that leads to business impact Has experience executing product research that brings together product and marketing strategy to influence a singular brand vision Must be entrepreneurial: This is like running a small business, with scarce resources Be a demonstrated strategic thinker, with proven problem-solving skills Is insanely curious and wonders what is happening next before others do Exemplifies building relationships and proactively identifying who to work with Knows how to be a Leader vs. a Manager Exemplifies driving business outcomes through insights gleaned from research", "preferred": "Has worked in consulting or at a brand/strategy agency Experience to deliver concise, executive level, communications that focus on influencing business decisions A demonstrated history of operating independently, prioritizing multiple work streams simultaneously and delivering measurement brand/product outcomes Deep understanding and appreciation for Facebook and how it works"}, "skills": ["Research", "Market Research", "Team Management", "Leadership", "Product Research", "Strategic Thinking", "Problem Solving", "Relationship Building"], "postedDate": "2 weeks ago", "benefits": "$187,000/year to $258,000/year + bonus + equity + benefits Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3944835548"}