{"jobTitle": "Warehouse Associate", "company": {"name": "Sunco.com", "industry": "Retail", "size": "Not specified", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$20.00/hr - $20.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Who We Are\nWe are Sunco Lighting, an online lighting retailer based in Valencia, CA. Thanks to our amazing and talented employees, today we are one of the largest online lighting retailers in the US. We value our collaborative, open, and people-first culture deeply, and we are invested in making Sunco a positive place where our team members thrive every day.\n\nWhat We Do\nWe light up the world, literally. Customers have chosen Sunco to provide millions of LED lights, and trust us for our exceptional customer service, eco-conscious product expertise, and unmatched value.\n\nWhat We Offer\nWe offer a competitive benefits package including comprehensive health and wellness coverage, 401k with company match, dental & vision benefits, and options for education reimbursement. We value work-life balance and offer a generous time off policy.\n\nNotice to Applicants: This exciting opportunity is an in office position M-F between the hours of 8 am - 5 pm. This position is full-time and on-site at our office in Valencia Ca.", "responsibilities": "Receiving Role:\nReceive lighting products shipments\nUnload shipping containers and separates according to whether the product is to go into stock or to be shipped out to 3PL\nPallets are wrapped and labeled for stock and/or shipping purposes\nPallets that are going to stock are scanned into the Warehouse management system, then placed in bins for future shipment\nPallets designated for current shipment stay on the warehouse floor for pickup by freight carrier(s)\n\nShipping Role:\nPickers – pick the product from bins, scan from inventory system, place on packers conveyor belt\nPackers – double-check pulled product, pack into appropriate shipping boxes, tape the box and place on the conveyor belt\nVerifies - Inspect all outbound orders for accuracy, quality, and damages. Report issues to warehouse manager\nShipment coordinators – coordinates shipments with carriers, such as FedEx, UPS, or USPS by choosing the least expensive, creating tracking information for labels, puts freight label on package, sorts by FedEx, UPS, or USPS freight pallet to be shipped.\n\nQuality Control Role:\nProcess customer returns\nTest returned product: If the product passes inspection and testing then repackage and put back into stock so it can be resold.\nTest returned product: If the product fails then it’s placed in a defective bin.\nCreate conversion orders. Product shipped out when 3PL is running low in-between large orders being shipped out.\n\nForklift Operator:\nMinimum 6 months experience operating MHE in a fast-paced warehouse environment\nExperience operating: Reach trucks, sit down forklifts, double deep rack stocking and order processing\nMust have six months experience performing put away and letdowns of Shipping and Receiving product pallets\n\nOther duties include:\nReport any discrepancies found\nFollow quality service standards and comply with procedures, rules and regulations\nContribute to daily inbound and outbound warehouse operations\nEfficiently and accurately pick, pack and ship single item and bulk orders.\nResponsible for inventory management in an accurate and timely manner.\nVerification of the material against picking list and system if necessary. (RF scanner)Stocking and storing all materials assigned by category in its corresponding location.\nMaintain a clean and safe work area and update supplies as needed\nPerform other tasks as needed\nCommunicate and cooperate with supervisors and coworkers", "qualifications": {"required": "High School Diploma (GED) or higher\nFamiliarity with modern warehousing practices and methods\nAbility to work overtime when required & meet deadlines\nAbility to critically think through problems with minimal supervision\nAbility to work in varying temperatures, depending upon season\nGood organizational and time management skills\nExperience with operating pallet jacks and forklifts\nPhysical demands\nMust be capable of standing and/or walking for extended periods of time.\nMust be able to lift up to 50lbs.\nMust be able to unload 2-3 shipping containers daily\nMust be able to utilize pallet jacks to move pallets and boxes", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "401(k)401(k) matching, Dental insurance, Health insurance, Life insurance, Paid time off, Vision insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3944494181"}