{"jobTitle": "Project Manager - Marketing Services", "company": {"name": "Live Nation Entertainment", "location": "Beverly Hills, CA", "industry": "Entertainment Providers"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$104,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "Job Summary:<br/><br/><strong><strong>WHO ARE WE?<br/><br/></strong></strong>Live Nation Entertainment is the world’s leading live entertainment company, composed of global market leaders: Ticketmaster, Live Nation Concerts, and Live Nation Media &amp; Sponsorship. Ticketmaster is the global leader in event ticketing with over 550 million tickets sold annually and more than 12,000 clients worldwide. Live Nation Concerts is the largest provider of live entertainment in the world promoting more than 40,000 shows and 100+ festivals annually for nearly 4,000 artists in over 40 countries. These businesses allow Live Nation Media &amp; Sponsorship to create strategic music marketing programs that connect over 1,000 brands with the 98 million fans that attend Live Nation Entertainment events each year. For additional information, visit www.livenationentertainment.com.<br/><br/><strong> <br/><br/></strong><strong><strong>WHO ARE YOU?<br/><br/></strong></strong>Passionate and motivated. Driven, with an entrepreneurial spirit. Resourceful, innovative, forward thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on!<br/><br/><strong><strong>THE TEAM<br/><br/></strong></strong>Marketing Services is a service driven organization that provides product vision and support to develop technology (or leverage existing technology) that allows for intelligent scale and sophistication of Ticketmaster and Live Nation marketing programs.<br/><br/><strong>Marketing Services consists of the following teams:<br/><br/></strong><ul><li>MARKETING AUTOMATION: Maximize Live Nation marketing while reducing operational cost through automation of marketing campaign creation/optimization and internal tools.</li><li>PERSONALIZATION: Leveraging the latest Data Science and Machine Learning to deliver Content Recommendations and Custom Audiences to the Web, the App, and CRM.</li><li>CRM MARKETING: Build capabilities that enable sustainable relationships with our fans through personalized, relevant, and timely communications.</li><li>MEASUREMENT, SIGNALS &amp; ANALYTICS PLATFORMS: Provide actionable, accurate, and regular marketing performance and fan behavioral data for use by Business Intelligence and Marketing Management teams. Reducing operational overhead and helping to improve marketing and reporting efficiency through automating reporting tasks.</li><li>DATA SCIENCE: Leveraging industry-leading analytical methodologies for working with large datasets to extract meaningful business insights and creatively solve business problems.<br/><br/></li></ul><strong>THE ROLE<br/><br/></strong>Live Nation is dedicated to building a world class marketing organization powered by world class marketing technology. Our mission is to connect the right fans with the right events at the right time. We aim to do this at scale for hundreds of millions of fans across hundreds of thousands of events with billions of tickets to sell.<br/><br/>We are looking for a strong Project Manager who can thrive in a fast-paced environment focused on supporting the engineering teams that deliver our marketing technology applications and services. We are seeking candidates who are proactive, self-starters and have a proven track record of delivering world-class products, preferably in data intensive organizations.<br/><br/>The ideal candidate should be an accomplished professional who possesses the passion, experience, skills and abilities to help extend Marketing Services PMO.<br/><br/>If you are someone who is motivated by driving value to the business, holds themselves to a high standard, is meticulously detailed, can work and learn independently, and loves working collaboratively – with no ego – for the betterment of a team, please apply today.<br/><br/><strong>What This Role Will Do<br/><br/></strong><ul><li>Serve as Scrum Master/Project Manager for one or more engineering teams.</li><li>Collaborate with Product and Tech Leads to establish prioritization, planning and execution processes.</li><li>Identify and quickly resolve changes in scope, schedules and resource requirements.</li><li>Identify and communicate risks; work with subject matter experts to develop and implement risk mitigation plans.</li><li>Prioritize and track issues and create remediation plans for resolution of impediments in priority order.</li><li>Coordinate with interdependent teams, aligning roadmaps and deliverables to meet deadlines. </li><li>Understand and maintain focus on business value and KPIs.</li><li>Maintain accurate project reporting information and up-to-date project assets and metrics.</li><li>Ensure open and clear communication regarding product releases, roadmaps, and challenges.<br/><br/></li></ul><strong>What This Person Will Bring<br/><br/></strong><ul><li>Bachelor’s degree or equivalent work experience.</li><li>3-5 years of experience in Agile Project Management, with experience in a data intensive organization a plus.</li><li>Certification in one or more project management frameworks (CSM, PMP, etc.) or applicable experience managing an engineering team with direct responsibility for delivery of business value.</li><li>Experience establishing Agile Project Management process within an existing team.</li><li>Experience with all phases of large-scale, complex, cross discipline technology projects, including scope definition, schedule development and management, communications, and stakeholder engagement activities.</li><li>Working knowledge of both Jira and Confluence or similar tools.</li><li>Asana and Smartsheet experience is a plus.</li><li>Excellent knowledge of agile techniques, artifacts, values and principles and passionate about continuous improvement.</li><li>Excellent communication, presentation skills and ability to adjust delivery approach, language and level of detail to meet technical, non-technical, and executive audience needs.</li><li>Ability to lead efficient meetings and guide a group towards agreed upon objectives.</li><li>Detail oriented with strong time management and organizational skills.</li><li>Excellent problem solving and critical thinking skills.</li><li>Able to manage competing priorities with little supervisory input.</li><li>Flexible and responsive to changing situations.</li><li>Self-motivated with the ability to work independently and as part of a team.</li><li>Ability to inspire and motivate teams.</li><li>Desire to work in a fast-paced, multi-task, fluid environment capable of reacting instantly to changes in a competitive business environment.<br/><br/></li></ul><strong>Benefits &amp; Perks<br/><br/></strong>Our motto is ‘Taking Care of Our Own’ through 6 pillars of benefits:<br/><br/><ul><li>HEALTH: Medical, Vision and Dental benefits for you and your family, including Flexible Spending Accounts (FSA) and Health Savings Accounts (HSAs)</li><li>YOURSELF: Generous paid time off policy including paid holidays, sick time and paid days off for your birthday, Free concert tickets</li><li>WEALTH: 401(k) program with company match, Stock Program</li><li>FAMILY: New parent programs &amp; support including caregiver leave and childcare cash, infertility support</li><li>CAREER: Tuition reimbursement, student loan repayment internal growth and development programs &amp; trainings</li><li>OTHERS: Volunteer time off, crowdfunding network<br/><br/></li></ul>Live Nation’s policy regarding vaccinations and masking related to a pandemic or other infectious disease control measures, acts of God, health and safety mandates and/or restrictions imposed by applicable local, state or federal governments has evolved over time. Currently, we strongly encourage employees to be fully vaccinated from such infectious diseases for which vaccinations are available. You are expected to follow Live Nation’s health and safety protocols and policies as they change from time to time<em>.<br/><br/></em><strong>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/></strong>We are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion. You will be working in an inclusive environment and be encouraged to bring your whole self to work. We will do all that we can to help you successfully balance your work and homelife. As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with. It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities.<br/><br/>Live Nation strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.<br/><br/>We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas.<br/><br/>We also afford equal employment opportunities to qualified individuals with a disability. For this reason, Live Nation will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Live Nation also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Live Nation will also provide reasonable religious accommodations on a case by case basis.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job<br/><br/>Live Nation recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.<br/><br/>The expected compensation for this position in California is:<br/><br/>$104,000.00 USD - $130,000.00 USD<br/><br/><ul><li>Please note that the compensation information provided is a good faith estimate for this position only and is provided pursuant to the California Salary Transparency in Job Advertisements Law. It is estimated based on what a successful California applicant might be paid. It assumes that the successful candidate will be in California or perform the position from California. Similar positions located outside of California will not necessarily receive the same compensation. Live Nation takes into consideration a candidate’s education, training, and experience, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the California Law, a potential new employee’s salary history will not be used in compensation decisions.</li></ul>", "responsibilities": "What This Role Will Do<br/><br/><ul><li>Serve as Scrum Master/Project Manager for one or more engineering teams.</li><li>Collaborate with Product and Tech Leads to establish prioritization, planning and execution processes.</li><li>Identify and quickly resolve changes in scope, schedules and resource requirements.</li><li>Identify and communicate risks; work with subject matter experts to develop and implement risk mitigation plans.</li><li>Prioritize and track issues and create remediation plans for resolution of impediments in priority order.</li><li>Coordinate with interdependent teams, aligning roadmaps and deliverables to meet deadlines. </li><li>Understand and maintain focus on business value and KPIs.</li><li>Maintain accurate project reporting information and up-to-date project assets and metrics.</li><li>Ensure open and clear communication regarding product releases, roadmaps, and challenges.<br/><br/></li></ul>", "qualifications": {"required": "What This Person Will Bring<br/><br/><ul><li>Bachelor’s degree or equivalent work experience.</li><li>3-5 years of experience in Agile Project Management, with experience in a data intensive organization a plus.</li><li>Certification in one or more project management frameworks (CSM, PMP, etc.) or applicable experience managing an engineering team with direct responsibility for delivery of business value.</li><li>Experience establishing Agile Project Management process within an existing team.</li><li>Experience with all phases of large-scale, complex, cross discipline technology projects, including scope definition, schedule development and management, communications, and stakeholder engagement activities.</li><li>Working knowledge of both Jira and Confluence or similar tools.</li><li>Asana and Smartsheet experience is a plus.</li><li>Excellent knowledge of agile techniques, artifacts, values and principles and passionate about continuous improvement.</li><li>Excellent communication, presentation skills and ability to adjust delivery approach, language and level of detail to meet technical, non-technical, and executive audience needs.</li><li>Ability to lead efficient meetings and guide a group towards agreed upon objectives.</li><li>Detail oriented with strong time management and organizational skills.</li><li>Excellent problem solving and critical thinking skills.</li><li>Able to manage competing priorities with little supervisory input.</li><li>Flexible and responsive to changing situations.</li><li>Self-motivated with the ability to work independently and as part of a team.</li><li>Ability to inspire and motivate teams.</li><li>Desire to work in a fast-paced, multi-task, fluid environment capable of reacting instantly to changes in a competitive business environment.<br/><br/></li></ul>", "preferred": null}, "skills": ["Jira", "Confluence", "Agile Project Management", "Data Science", "Machine Learning", "Marketing Automation", "CRM", "Business Intelligence", "Marketing Management", "Asana", "Smartsheet"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Benefits &amp; Perks<br/><br/>Our motto is ‘Taking Care of Our Own’ through 6 pillars of benefits:<br/><br/><ul><li>HEALTH: Medical, Vision and Dental benefits for you and your family, including Flexible Spending Accounts (FSA) and Health Savings Accounts (HSAs)</li><li>YOURSELF: Generous paid time off policy including paid holidays, sick time and paid days off for your birthday, Free concert tickets</li><li>WEALTH: 401(k) program with company match, Stock Program</li><li>FAMILY: New parent programs &amp; support including caregiver leave and childcare cash, infertility support</li><li>CAREER: Tuition reimbursement, student loan repayment internal growth and development programs &amp; trainings</li><li>OTHERS: Volunteer time off, crowdfunding network<br/><br/></li></ul>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3944415223"}