{"jobTitle": "Senior Data Analyst (Remote!)", "company": {"name": "Super.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "80,000.00/yr - 145,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Financial Services", "description": "About Super.com We started Super.com to help maximize lives–both the lives of our customers and the lives of our employees– so that everyone can experience all that life has to offer. For our employees, our promise is that Super.com is more than just a job; it’s an opportunity to unlock one’s potential, where learning is celebrated and impact is realized. We are more than a fast-paced, high-growth tech company; we care about our people and take career progression seriously. This is your career and our aim is to supercharge it through the people, the work, and the programs that fuel who we are. About this team As a Senior Data Analyst you will be reporting into a centralized Analytics &amp; Data Science team designed to foster the data driven culture at Super.com. The multi-disciplinary team supports our travel vertical which specializes in hotel inventory distribution to end users. Our team operates at the intersection of data-driven decision-making and novel product development. We are dedicated to rapidly experimenting. The team is responsible for developing performant pricing strategies, optimizing acquisition channels, and evaluating marketing strategies aimed at attracting high-intent, quality users. About this role We are seeking a skilled Senior Data Analyst to join our Travel vertical. This new team member will work with travel-related data, such as: hotel inventory availability, price competitiveness, and customer journey flows within our mobile application and on our website. You will use data to confidently answer strategic questions and uncover insights about paid and organic traffic that will drive our business strategy and rapid growth. A major component of this role is data quality investigations, whereby you will query granular data to understand if our tracking plans are functioning as intended, particularly surrounding our native reinforcement learning pricing model. A significant aspect of your role will be to uphold the integrity and accuracy of our data. You willl conduct detailed investigations using that data by querying information in its most granular state to verify the effectiveness of our tracking and analytics systems and recommend improvements. With your strong analytical skills in both SQL and Python, you will excel in quantitative analysis and confidently be able to translate your findings to business stakeholders. This position offers a dynamic and impactful opportunity to assume ownership of your work as you conduct in-depth analyses to implement, debug, QA, and refine our data processes. You will work closely with our Travel leadership team to answer some of the company’s most urgent and impactful questions, and be exposed to rich data about the travel industry. Responsibilites<br/><br/><ul><li>Data-driven Culture: As an ambassador for our data-driven culture, you will leverage complex datasets to generate actionable insights that influence product strategy and drive results</li><li> Investigate Trends &amp; Anomalies: With a keen eye for detail, you will investigate and analyze trends and anomalies in our pricing model data. This includes supporting debugging efforts and drilling down into data to uncover the root causes of changes in conversion rates and top-line financial metrics.</li><li>Data Management: you will access, clean and organize raw data in a way that makes sense for you, your team and your stakeholders</li><li>Business Understanding: you will determine the why behind our data-driven insights, and how the data both explains and impacts our business decisions. This includes analyzing how our various pricing strategies affect different customer segments and types of hotel properties. You will also be using these insights to formulate strategic recommendations<br/><br/><br/></li></ul>Preferred Experience<br/><br/><ul><li>Advanced level proficiency in SQL and Python for data analytics</li><li>Experience with 1 or more dashboarding tools and comfortability with Git</li><li>Mentorship experience with a keen interest in teaching and peer reviewing work from other team members</li><li>3+ years of Experience working with data (as an Analyst, Scientist, or similar)</li><li>Strong technical and problem-solving skills, with the ability to analyze and model a high volume of relational and potentially unstructured data</li><li>Experience working in a fast paced, high growth startup environment or the travel industry</li><li>Excellent verbal and written communication skills, capable of presenting data and insights clearly to both technical and non-technical audiences<br/><br/><br/></li></ul>Bonus Points<br/><br/><ul><li>Proficiency with tools such as DBT, Amplitude, Snowflake and Looker</li><li>Ability to independently collaborate with business stakeholders and create data models designed to address specific questions and uncover valuable business insights</li><li>Bachelors in STEM and an advanced degree in Analytics, Data Science or equivalent<br/><br/><br/></li></ul>We've got you covered!<br/><br/><ul><li>Competitive salary packages, equity options, great benefits from day one, wellness budgets, as well as personal and team-level development budgets </li><li>We are remote first – you have the flexibility to work from around the world and the hours that make sense for you– so that you can do your best work while living life on your own terms </li><li>Other perks include: unlimited PTO, recharge days, travel discounts on SuperTravel, Weekly UberEats credit and much more!</li><li>We welcome new family additions with generous parental leave and a flexible return-to-work plan</li><li>This is just scratching the surface– see our careers site for a more detailed overview of our perks &amp; benefits<br/><br/><br/></li></ul>We Believe in Equal Opportunity We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Accommodations are available on request for candidates taking part in all aspects of the selection process. If needed, please notify our Talent Acquisition Partner. As part of our compensation philosophy at Super.com we benchmark roles based on geographic location. The base salary range for this position is $80,000 USD - $145,000 USD", "responsibilities": "Data-driven Culture: As an ambassador for our data-driven culture, you will leverage complex datasets to generate actionable insights that influence product strategy and drive results\n Investigate Trends &amp; Anomalies: With a keen eye for detail, you will investigate and analyze trends and anomalies in our pricing model data. This includes supporting debugging efforts and drilling down into data to uncover the root causes of changes in conversion rates and top-line financial metrics.\nData Management: you will access, clean and organize raw data in a way that makes sense for you, your team and your stakeholders\nBusiness Understanding: you will determine the why behind our data-driven insights, and how the data both explains and impacts our business decisions. This includes analyzing how our various pricing strategies affect different customer segments and types of hotel properties. You will also be using these insights to formulate strategic recommendations", "qualifications": {"preferred": "Advanced level proficiency in SQL and Python for data analytics, Experience with 1 or more dashboarding tools and comfortability with Git, Mentorship experience with a keen interest in teaching and peer reviewing work from other team members, 3+ years of Experience working with data (as an Analyst, Scientist, or similar), Strong technical and problem-solving skills, with the ability to analyze and model a high volume of relational and potentially unstructured data, Experience working in a fast paced, high growth startup environment or the travel industry, Excellent verbal and written communication skills, capable of presenting data and insights clearly to both technical and non-technical audiences, Proficiency with tools such as DBT, Amplitude, Snowflake and Looker, Ability to independently collaborate with business stakeholders and create data models designed to address specific questions and uncover valuable business insights, Bachelors in STEM and an advanced degree in Analytics, Data Science or equivalent", "required": ""}, "skills": ["SQL", "Python", "Data Analytics", "Dashboarding", "Git", "Mentorship", "Data", "Technical Skills", "Problem Solving", "Startup Environment", "Travel Industry", "Communication", "DBT", "Amplitude", "Snowflake", "Looker", "Business Stakeholders", "Data Models", "STEM", "Analytics", "Data Science"], "postedDate": "2 months ago", "benefits": "Competitive salary packages, equity options, great benefits from day one, wellness budgets, as well as personal and team-level development budgets, We are remote first – you have the flexibility to work from around the world and the hours that make sense for you– so that you can do your best work while living life on your own terms, Other perks include: unlimited PTO, recharge days, travel discounts on SuperTravel, Weekly UberEats credit and much more!, We welcome new family additions with generous parental leave and a flexible return-to-work plan, This is just scratching the surface– see our careers site for a more detailed overview of our perks &amp; benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3944023231"}