{"jobTitle": "Creative Project Manager", "company": {"name": "GOOD AMERICAN", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Retail Apparel and Fashion", "description": "Good American is the first fully inclusive fashion brand that celebrates all dimensions of female power. Offering quality, style, and substance in every size — 00-32, we are committed to challenging industry norms by empowering all women to feel sexy and confident no matter their size or shape. The brand was launched in October 2016, by Emma Grede and Khloé Kardashian, to empower all women to celebrate their bodies with confidence by offering high-quality designs in all sizes. What started as the largest denim launch in history, has evolved into an iconic and inclusive fashion line of denim, ready-to-wear, swim, shoes and activewear.<br/><br/>The Creative Operations Manager at Good American will oversee and manage the Brand Creative and Brand Marketing workflow processes.. Reporting to the Director of Integrated Marketing, this role ensures that all project requirements, deadlines, budgets, and schedules are on track to keep the departments running smoothly. This position requires someone with the experience and ability to field requests from outside departments, manage their timelines, and work with the team to prioritize and meet deadlines.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Manage day-to-day communication, timelines, and deliverables across creative teams/vendors in support of product launches, photo shoots, design/brand projects, and marketing initiatives</li><li>Create project and distribute workback timelines to ensure campaign deliverables, including roadmaps, events, UGC, retail, wholesale, and other special projects, are on-time for their respective deadlines</li><li>Drive collaboration and communication cross-functionally to ensure creative delivery is aligned with set timelines and briefs; manage creative resourcing and ensure the team is aligned to priorities, timeframes and overall brief</li><li>Oversee the briefing process that will be used by multiple departments, making sure the creative team has what they need to execute projects </li><li>Manage and assign cross-functional Creative Request forms for new projects as they are requested.</li><li>Flag project roadblocks, schedule changes, potential missed deadlines, and shifting project scope with all stakeholders during weekly cross-functional meetings.</li><li>Determine and manage file organizational structure for creative team</li><li>Streamline communication across multiple departments and send out all roll-out emails to the company.</li><li>Coordinate sourcing to outside contractors and vendors as necessary.</li><li>Look ahead and plan strategies to alleviate rushed projects and maintain a healthy workload.</li><li>Partner closely with the Creative Director on long term strategic planning and creative resourcing, systems, and tools to support goals</li><li>Collaborate with the Director of Integrated Marketing to prepare status reports by gathering, analyzing, and summarizing relevant information.<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>Communicator: Strong communication skills to streamline interactions across multiple departments.</li><li>Proactive: Ability to look ahead and plan strategies to manage workload effectively.</li><li>Detail-Oriented: You have a keen eye for detail, from punctuation and grammar to product naming conventions.</li><li>Positive and Collaborative: You bring positive, healthy energy to the organization and thrive in a collaborative environment. You love and seek valuable stakeholder feedback.</li><li>Flexible and Goal-Oriented: You are flexible, open-minded, and goal-oriented, able to adapt in a fast-paced environment with changing objectives.<br/><br/></li></ul><strong>Desired Attributes<br/><br/></strong><ul><li>6+ Years Experience: You have proven experience in managing complex projects and workflows within a fast-paced e-commerce or creative agency.</li><li>Process-Minded: You know how to self-teach new programs, apps, workflows, and best practices.</li><li>Ego-Free: You are an ego-free partner who leaves drama, excuses, and time-wasters at the door.</li><li>Team Player: You are a team player who invites straightforward feedback and is ready to implement it.</li><li>Fashion-Lover: You understand and embody the Good American lifestyle.</li><li>Friendly Colleague: You enjoy working as part of a larger unit towards a shared goal and understand what it takes to get there.</li><li>Nice to Have: Familiarity with analytics tools and metrics to measure the performance of marketing campaigns and content initiatives<br/><br/></li></ul>Please note that this role requires to be onsite four days a week.<br/><br/>Good American participate in company-wide initiatives to advance social and environmental performance, such as sustainability training, DEI training, volunteering, or participation in internal committees.<br/><br/>WE ARE B CORP CERTIFIED!!!<br/><br/>As our business has grown so has our responsibility to our community, our planet and our business. Being B Corp certified means we will continue to put people and planet up there with profit.", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3945062032"}