{"jobTitle": "Operations Specialist & Exec Assistant", "company": {"name": "Dolby Laboratories", "location": "Los Angeles, CA", "industry": "Computers and Electronics Manufacturing, Entertainment Providers, and Broadcast Media Production and Distribution"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "94,000.00/yr - 113,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Computers and Electronics Manufacturing, Entertainment Providers, and Broadcast Media Production and Distribution", "description": "Join the leader in entertainment innovation and help us design the future. At Dolby, science meets art, and high tech means more than computer code. As a member of the Dolby team, you’ll see and hear the results of your work everywhere, from movie theaters to smartphones. We continue to revolutionize how people create, deliver, and enjoy entertainment worldwide. To do that, we need the absolute best talent. We’re big enough to give you all the resources you need, and small enough so you can make a real difference and earn recognition for your work. We offer a collegial culture, challenging projects, and excellent compensation and benefits, not to mention a Flex Work approach that is truly flexible to support where, when, and how you do your best work.<br/><br/>The Marketing department creates passion and relevance for the \"Dolby Difference\" driving sell-in and sell-thru of Dolby enabled devices, services, content, and experiences across multiple constituents – partners, creators, consumers, and developers.<br/><br/>We are seeking a highly organized and detail-oriented individual to join our Global Marketing team as an Operations Specialist and Executive Admin Assistant. This role will be responsible for providing operational support to ensure smooth departmental functioning while also assisting executives with administrative tasks. The ideal candidate thrives in a fast-paced environment, possesses excellent communication skills, and can effectively manage multiple priorities. At Dolby Laboratories, you’ll have the opportunity to work at the intersection of technology and entertainment, contributing to innovative projects that impact audiences globally.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Collaborate with cross-functional and global teams to streamline processes and optimize operational efficiency within the Global Marketing department.</li><li>Assist in developing and implementing standardized procedures and workflows to enhance productivity and effectiveness.</li><li>Manage departmental budgets, track expenses, and prepare financial reports as needed.</li><li>Coordinate logistics for marketing events, including venue booking, travel arrangements, and material preparation.</li><li>Serve as a point of contact for internal and external stakeholders, addressing inquiries and facilitating communication.</li><li>Conduct research and analysis to support strategic decision-making and identify areas for improvement.</li><li>Maintain accurate records, databases, and documentation related to projects, contracts, and vendor agreements.<br/><br/></li></ul>Executive Administrative Assistant Responsibilities:<br/><br/><ul><li>Provide comprehensive administrative support to senior executives within the Global Marketing department.</li><li>Manage calendars, schedule meetings, and coordinate travel arrangements for executives.</li><li>Prepare and edit correspondence, presentations, and other documents with a high level of accuracy and professionalism.</li><li>Screen incoming calls, emails, and correspondence, responding or redirecting as appropriate.</li><li>Organize and prioritize tasks, ensuring timely completion of assignments and deadlines.</li><li>Assist in preparing materials for meetings, including agendas, presentations, and reports.</li><li>Handle confidential information with discretion and maintain confidentiality at all times.<br/><br/></li></ul>Qualifications:<br/><br/></strong><ul><li>Bachelor's degree in Business Administration, Marketing, or related field preferred.</li><li>Proven experience in operations management, administrative support, or a similar role.</li><li>Strong organizational skills with the ability to multitask and prioritize effectively.</li><li>Excellent communication skills, both written and verbal.</li><li>Proficiency in Microsoft Office Suite and other relevant software applications with attention to detail and a commitment to accuracy.</li><li>Ability to work independently with minimal supervision and as part of a team.</li><li>Discretion and professionalism when handling sensitive information.<br/><br/></li></ul>Preferred Qualifications:<br/><br/></strong><ul><li>Experience working in a global or multinational organization.</li><li>Knowledge of marketing principles and practices.</li><li>Familiarity with project management tools and software.</li><li>Previous experience working as part of an Ops team.</li><li>Previous experience supporting C-level executives or senior management.<br/><br/></li></ul>The San Francisco/Bay Area base salary range for this full-time position is $94,000 - 113,000, which can vary if outside this location, plus bonus, benefits, and some roles may also include equity. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, competencies, experience, market demands, internal parity, and relevant education or training. Your recruiter can share more about the specific salary range and perks and benefits for your location during the hiring process.<br/><br/><em>Dolby will consider qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code, Article 49, and Administrative Code, Article 12<br/><br/></em><strong>Equal Employment Opportunity:<br/><br/></strong>Dolby is proud to be an equal opportunity employer. Our success depends on the combined skills and talents of all our employees. We are committed to making employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, family status, medical condition, disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state, and local laws and ordinances.<br/><br/>]]&gt;<br/><br/>", "responsibilities": "Operations Specialist Responsibilities:<br/><br/><ul><li>Collaborate with cross-functional and global teams to streamline processes and optimize operational efficiency within the Global Marketing department.</li><li>Assist in developing and implementing standardized procedures and workflows to enhance productivity and effectiveness.</li><li>Manage departmental budgets, track expenses, and prepare financial reports as needed.</li><li>Coordinate logistics for marketing events, including venue booking, travel arrangements, and material preparation.</li><li>Serve as a point of contact for internal and external stakeholders, addressing inquiries and facilitating communication.</li><li>Conduct research and analysis to support strategic decision-making and identify areas for improvement.</li><li>Maintain accurate records, databases, and documentation related to projects, contracts, and vendor agreements.<br/><br/></li></ul>Executive Administrative Assistant Responsibilities:<br/><br/><ul><li>Provide comprehensive administrative support to senior executives within the Global Marketing department.</li><li>Manage calendars, schedule meetings, and coordinate travel arrangements for executives.</li><li>Prepare and edit correspondence, presentations, and other documents with a high level of accuracy and professionalism.</li><li>Screen incoming calls, emails, and correspondence, responding or redirecting as appropriate.</li><li>Organize and prioritize tasks, ensuring timely completion of assignments and deadlines.</li><li>Assist in preparing materials for meetings, including agendas, presentations, and reports.</li><li>Handle confidential information with discretion and maintain confidentiality at all times.<br/><br/></li></ul>", "qualifications": {"required": "Proven experience in operations management, administrative support, or a similar role. Strong organizational skills with the ability to multitask and prioritize effectively. Excellent communication skills, both written and verbal. Proficiency in Microsoft Office Suite and other relevant software applications with attention to detail and a commitment to accuracy. Ability to work independently with minimal supervision and as part of a team. Discretion and professionalism when handling sensitive information.", "preferred": "Experience working in a global or multinational organization. Knowledge of marketing principles and practices. Familiarity with project management tools and software. Previous experience working as part of an Ops team. Previous experience supporting C-level executives or senior management."}, "skills": ["Operations Management", "Administrative Support", "Microsoft Office Suite", "Project Management", "Communication", "Organization", "Prioritization", "Research", "Analysis", "Budget Management", "Event Coordination", "Stakeholder Management", "Record Keeping", "Database Management", "Documentation", "Calendar Management", "Meeting Scheduling", "Travel Arrangements", "Correspondence", "Presentation Preparation", "Document Editing", "Call Screening", "Email Management", "Task Prioritization", "Deadline Management", "Meeting Preparation", "Confidentiality"], "postedDate": "1 week ago", "benefits": "The San Francisco/Bay Area base salary range for this full-time position is $94,000 - 113,000, which can vary if outside this location, plus bonus, benefits, and some roles may also include equity. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, competencies, experience, market demands, internal parity, and relevant education or training. Your recruiter can share more about the specific salary range and perks and benefits for your location during the hiring process.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3945929647"}