{"jobTitle": "Manager, Label & Product Management", "company": {"name": "Warner Music Group", "industry": "Entertainment Providers, Musicians, and Book and Periodical Publishing", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,500.00 - $75,000.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Entertainment Providers, Musicians, and Book and Periodical Publishing", "description": "At Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses: Music is Everything, Global Growth, Local Expertise, Innovation and Insight, Empowered by People. We remain committed to Diversity, Equity, and Inclusion. We know it fosters a culture where you can truly belong, contribute, and grow. We encourage applications from people of any age, gender identity, sexual orientation, race, religion, ethnicity, disability, veteran status, and any other characteristic or identity. Consider a career at WMG and get the best of both worlds – an innovative global music company that retains the creative spirit of a nimble independent.", "responsibilities": "The Label & Product Management role is a unique opportunity to work with exciting signed artists and independent label partners ADA while guiding them through best practices and helping to get their creative content to the masses with a specific focus on 10K Projects and their Rap/Hip-Hop/R&B repertoire. In addition to being at the forefront of a creative community, this position has visibility and engagement in new methods of music consumption. By way of Label Management with an emphasis on Product Management + Digital Strategy, this role will have the ability to make a meaningful impact on 10k Projects and ADA’s business while also developing strong relationships with our partners, employees and co-workers.", "qualifications": {"required": "Minimum 3+ years of label / distribution experience with an emphasis on Product Management and Digital Commerce/Marketing. Passion for Rap/Hip-Hop/R&B/Reggae music. A strong understanding of digital accounts with an ability to activate those relationships. Broad knowledge of music, independent record labels and artist managers. Strong knowledge of sales and production/metadata. Track record of managing productive relationships with independent labels, artists and artist managers.", "preferred": "Showcase a strong knowledge and passion for music across Rap/Hip-Hop/R&B/Reggae. Be motivated, creative, innovative, highly organized, detailed and multi-task oriented while working under pressure. Have strong management skills with the ability to drive projects to completion. Have excellent oral and written communication skills. Have the ability to translate analysis into actionable strategy. Have an exemplary knowledge of the digital media with an understanding of how it influences and moves popular culture."}, "skills": ["Music Industry Knowledge", "Product Management", "Digital Marketing", "Sales Strategy", "Relationship Management"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "WMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.", "remoteWork": "This position will require being in the office 4 days a week.", "url": "https://www.linkedin.com/jobs/view/3945654157"}