{"jobTitle": "Senior Business Systems Analyst", "company": {"name": "UNIS", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $115,000.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Truck Transportation", "description": "<strong>Job Details<br/><br/></strong>Job Location<br/><br/>Valley View, Buena Park, CA - Buena Park, CA<br/><br/>Salary Range<br/><br/>$100,000.00 - $115,000.00 Salary/year<br/><br/><strong>Description<br/><br/></strong><strong> <strong>Job Title: Senior Business System Analyst</strong> <br/><br/></strong><strong>Job Summary<br/><br/></strong>We are seeking a detail-oriented and experienced Senior Business System Analyst with a robust IT background and preferably programming experience. The ideal candidate will bring a strong understanding of e-procurement systems and have experience with logistics or e-commerce systems. This role demands expertise in analyzing business workflows, documenting system requirements, and designing system mockups/wireframes. A significant part of this role involves working within an agile development environment and requiring excellent communication skills in English.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> System Analysis &amp; Workflow Design: Perform thorough analysis of existing business processes and systems. Design, document, and improve workflows and processes using flowcharts and diagrams. <br/><br/></li></ul><strong> <strong>Requirements Gathering &amp; Documentation:</strong> </strong> Collaborate with stakeholders across the organization to gather and document system requirements. Ensure clarity and alignment between business needs and technical capabilities.<br/><br/><strong> <strong>E-Procurement &amp; E-Commerce Expertise:</strong> </strong> Apply your knowledge and experience with e-procurement and e-commerce/logistics systems to drive system improvements and efficiencies.<br/><br/><strong> <strong>Mockup/Wireframe Design:</strong> </strong> Develop intuitive and functional mockups and wireframes for system enhancements and new features, facilitating a clear vision of proposed changes.<br/><br/><strong> <strong>Agile Development Practices:</strong> </strong> Participate in agile development cycles, effectively integrating and practicing agile methodologies in project management and system development.<br/><br/><strong> <strong>Communication &amp; Collaboration:</strong> </strong> Serve as a vital link between business stakeholders and the development team, ensuring clear communication of requirements and project goals. Exhibit exceptional communication skills in English, both written and verbal, to articulate complex ideas clearly and effectively.<br/><br/><strong> <strong>Project Management:</strong> </strong> Oversee projects related to system improvements from conception through implementation, ensuring adherence to deadlines, budgets, and quality standards.<br/><br/><strong>Qualifications<br/><br/></strong><strong> <strong>Requirements:</strong> <br/><br/></strong><ul><li> Bachelor’s degree in information technology, Computer Science, Business Administration, or a closely related field. <br/><br/></li></ul>Strong foundation in IT with a preference for candidates with programming skills.<br/><br/>Demonstrated experience with e-procurement systems and familiarity with logistics or e-commerce systems.<br/><br/>Proficient in analyzing business systems, documenting workflows/processes, and identifying improvement opportunities.<br/><br/>Skilled in creating detailed system requirements documents and designing mockups/wireframes.<br/><br/>Knowledgeable in agile development methodologies with practical experience applying these principles to projects.<br/><br/>Excellent communication skills in English, capable of engaging effectively with both technical and non-technical stakeholders.<br/><br/>Proven ability to manage multiple projects simultaneously, prioritizing tasks as needed.", "responsibilities": "System Analysis &amp; Workflow Design: Perform thorough analysis of existing business processes and systems. Design, document, and improve workflows and processes using flowcharts and diagrams. <br/><br/>Requirements Gathering &amp; Documentation: Collaborate with stakeholders across the organization to gather and document system requirements. Ensure clarity and alignment between business needs and technical capabilities.<br/><br/>E-Procurement &amp; E-Commerce Expertise: Apply your knowledge and experience with e-procurement and e-commerce/logistics systems to drive system improvements and efficiencies.<br/><br/>Mockup/Wireframe Design: Develop intuitive and functional mockups and wireframes for system enhancements and new features, facilitating a clear vision of proposed changes.<br/><br/>Agile Development Practices: Participate in agile development cycles, effectively integrating and practicing agile methodologies in project management and system development.<br/><br/>Communication &amp; Collaboration: Serve as a vital link between business stakeholders and the development team, ensuring clear communication of requirements and project goals. Exhibit exceptional communication skills in English, both written and verbal, to articulate complex ideas clearly and effectively.<br/><br/>Project Management: Oversee projects related to system improvements from conception through implementation, ensuring adherence to deadlines, budgets, and quality standards.", "qualifications": {"required": "Bachelor’s degree in information technology, Computer Science, Business Administration, or a closely related field. <br/><br/>Strong foundation in IT with a preference for candidates with programming skills.<br/><br/>Demonstrated experience with e-procurement systems and familiarity with logistics or e-commerce systems.<br/><br/>Proficient in analyzing business systems, documenting workflows/processes, and identifying improvement opportunities.<br/><br/>Skilled in creating detailed system requirements documents and designing mockups/wireframes.<br/><br/>Knowledgeable in agile development methodologies with practical experience applying these principles to projects.<br/><br/>Excellent communication skills in English, capable of engaging effectively with both technical and non-technical stakeholders.<br/><br/>Proven ability to manage multiple projects simultaneously, prioritizing tasks as needed."}, "skills": ["IT", "e-procurement", "logistics", "e-commerce", "system analysis", "workflow design", "requirements gathering", "documentation", "mockup design", "wireframe design", "agile development", "project management", "communication", "English"], "postedDate": "2 months ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3945831196"}