{"jobTitle": "VP, Talent (Celeb)", "company": {"name": "United Entertainment Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$95,000.00 - $156,000.00", "currency": "USD"}, "jobFunction": "Public Relations and Information Technology", "industry": "Public Relations and Communications Services and IT Services and IT Consulting", "description": "UEG is an award-winning global agency that specializes in making brands famous. We create breakthrough marketing campaigns by partnering brands with the people, properties, and platforms that shape pop-culture. Our business specializes in the entertainment, sports, and lifestyle space and provides a full suite of services that include celebrity engagements, influencer programming, music-film-tv/digital-sports partnerships, communications, branded content, and experiential.  <br/><br/>The team at UEG is a dynamic group, bringing together best-in-class expertise across entertainment, sports, and lifestyle, paired with a strong understanding of brand building and effective marketing communications. This is a fast-paced high-performance environment where we combine passion for culture with the innate desire to create industry-changing work for our clients. <br/><br/>We are searching for a culture-hungry individual who believes in the power of celebrity talent to drive authentic brand-building work for our clients. We don’t believe in transactional relationships and therefore need a candidate who understands the art and science of landing the right voice/s for any of the brands we oversee at UEG. This work is fast paced and demands a leader who has a strong POV of the space and is ahead of the trends. A candidate must have relevant experience in working with globally recognized celebrity level talent, a passion for pop-culture and its infusion into the consumer brand ecosphere. <br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Develop strategic approaches to brand-appropriate celebrity relationships. </li><li>Convey deep understanding of the value of diverse level of celebrities for diverse range of services </li><li>Identify, vet, and secure partnerships with celebrity talent who align with client brands and campaign goals. </li><li>Build and maintain strong relationships with celebrity agents and managers and navigate complex negotiations with them </li><li>Confidently talk clients and partners through the details of any celebrity negotiations – when they are challenging and when they are going smoothly. </li><li>Act as oversite of a dedicated team who are responsible for all celebrity talent relationships and campaigns for within a portfolio of brands ensuring a high quality of work output across all deliverables while adhering to deadlines and budget parameters of the full life cycle of the program (research, procurement, deal development, management of execution &amp; measurement).  </li><li>Provide direct input and management on marketing initiatives across diverse set of clients and industry verticals </li><li>Evangelize the role and impact of celebrity marketing on successful content marketing strategies. Serve as a subject matter expert proactively bringing thought leadership and trends both to the agency team and to Client partners. </li><li>Participation in the development of program/campaign ideas as it relates to content creative, usage or earned opportunities. </li><li>In partnership with social strategy team, development of brand talent partnership strategies and approach specifically around size and scale, archetype, and channel priorities. </li><li>Oversight of creation of talent contracts with a strong knowledge in SAG, Federal Trade Commission guidelines (FTC) and standard deals. </li><li>Stay up to date with the latest trends, tools, and best practices incelebrity partnerships, and talent deals </li><li>Partner with measurement team to ensure proper use of proprietary dashboard and database to track and measure all campaigns. </li><li>Ongoing business development and growth within the portfolio based on key client relationships, opportunistic pitches, ideation and overall quality/health of the business. <br/><br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>Minimum of 10+ years of experience relevant to the role and industry with strong work examples and references. </li><li>A deep knowledge of talent management including pricing and valuation, term development and platform performance. </li><li>Experience evaluating, negotiating, planning and procurement of talent partners </li><li>Strong understanding of social media platforms, trends, and measurement approaches. </li><li>Ability to manage the budgets and interdisciplinary account teams on sizable pieces of business </li><li>Experience managing account profitability, new business solicitation, and quality of account service and employee development within an agency setting </li><li>Strong, proven industry contacts and relationships with agents, reps, managers and lawyers are mandatory.  </li><li>Superior written and verbal communications skills along with the proven ability to consistently make sound judgments and effectively motivate and manage teams. </li><li>Strong collaborator and mentor with the ability to bring out the best in agency talent to produce great work for clients. </li><li>Strong work ethic with the ability to deliver quality recommendations <br/><br/><br/></li></ul>$95,000 - $156,000 a year<br/><br/>An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "postedDate": "1 week ago", "skills": ["celebrity talent", "brand-building", "marketing campaigns", "entertainment", "sports", "lifestyle", "celebrity engagements", "influencer programming", "music-film-tv", "digital-sports partnerships", "communications", "branded content", "experiential", "brand building", "marketing communications", "pop-culture", "consumer brand ecosphere", "talent management", "pricing and valuation", "term development", "platform performance", "social media platforms", "trends", "measurement approaches", "budgets", "account teams", "account profitability", "new business solicitation", "account service", "employee development", "industry contacts", "agents", "reps", "managers", "lawyers", "written and verbal communications", "judgments", "teams", "collaboration", "mentoring", "work ethic", "quality recommendations"], "url": "https://www.linkedin.com/jobs/view/3945538349"}