{"jobTitle": "Executive Assistant - Hybrid", "company": {"name": "ImmunityBio, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "48.08 per hour (entry-level qualifications) to $55.29 per hour (highly experienced)", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Biotechnology Research", "description": "<strong>Company Overview<br/><br/></strong>ImmunityBio, Inc. (NASDAQ: IBRX) is a commercial-stage biotechnology company developing cell and immunotherapy products that are designed to help strengthen each patient’s natural immune system, potentially enabling it to outsmart the disease and eliminate cancerous or infected cells. We envision a day when we no longer fear cancer, but can conquer it, thanks to the biological wonder that is the human immune system. Our scientists are working to develop novel therapies that harness that inherent power by amplifying both branches of the immune system, attacking cancerous or infected cells today while building immunological memory for tomorrow. The goal: to reprogram the patient’s immune system and treat the host rather than just the disease.<br/><br/>Why ImmunityBio?<br/><br/><ul><li> ImmunityBio is developing cutting-edge technology with the goal to transform the lives of patients with cancer and develop next-generation therapies and vaccines that complement, harness and amplify the immune system to defeat cancers and infectious diseases.</li><li> Opportunity to join a publicly traded biopharmaceutical company with headquarters in Southern California.</li><li> Work with a collaborative team with the ability to work across different areas of the company.</li><li> Ability to join a growing company with professional development opportunities.<br/><br/></li></ul><strong>Position Summary<br/><br/></strong>The Executive Assistant will assist the General Counsel, Chief Financial Officer and Senior Vice President, Human Resources by performing high-level administrative work. The role will navigate the executive calendars to support prioritization of business needs and travel planning; and will serve as a liaison with internal and external stakeholders while maintaining confidentiality.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Coordinates a variety of travel, meetings, and other calendar appointments, requiring interaction with both internal and external contacts.</li><li>Anticipates the executive’s needs and prepares required materials for conferences, meetings, calls, and various appointments.</li><li>Process all invoices to ensure timely and accurate payments. </li><li>Track contracts through negotiation, approval, distribution, and execution process including the required follow-ups with legal, business, and finance.</li><li>Assist in managing calendar in Outlook; manage contacts lists and send invitations.</li><li>Screen and draft internal and external correspondence, emails, memos, and reports.</li><li>Prepare and submit expense reports and reimbursements.</li><li>Maintains contract tracking spreadsheet including keeping it up to date.</li><li>Process and maintain tracking for any appropriate individual certification or licensure requirements such a JD, CPA, etc.</li><li>Maintains and tracks the department budgets.</li><li>Assist with filing annual reports and federal and state securities filings, including other required post‑closing state applications and filings.</li><li>Create and maintain Standard Operating Procedures (SOPs) for all processes.</li><li>Maintain organizational charts and entity lists.</li><li>Performs other duties and projects as assigned.<br/><br/></li></ul><strong>Education &amp; Experience<br/><br/></strong><ul><li>Bachelor’s degree in business administration or related field</li><li>10+ years’ professional experience as an Executive Assistant</li><li>Prior experience working with confidential information in a human resources, legal and/or finance department required</li><li>Certified Notary Public is a plus but not required<br/><br/></li></ul><strong>Knowledge, Skills, &amp; Abilities<br/><br/></strong><ul><li>Able to demonstrate considerable judgement and initiative to resolve problems and manage calendars</li><li>Ability to maintain proprietary, trade secret and confidential information</li><li>Strong organizational and planning skills</li><li>Strong knowledge of standard productivity software tools (e.g. MS Office suite, especially Excel &amp; PowerPoint)</li><li>Budgeting and basic finance knowledge</li><li>Supreme organizational and communication (verbal &amp; written) skills</li><li>Positive attitude</li><li>Ability to juggle multiple tasks at any one time and stay one step ahead</li><li>Demonstrated capabilities and willingness to learn the use of internal tools &amp; processes for communications, scheduling, and travel</li><li>Proactive, resourceful, efficient, energetic, and a genuine desire to work well with people</li><li>A desire to learn within a dynamic environment.</li><li>Strong attention to detail and ability to maintain confidentiality</li><li>Ability to effectively prioritize and multi-task under limited direction, and ability to shift priorities quickly while working under tight timelines</li><li>Superior oral and written communication skills<br/><br/></li></ul><strong>Working Environment / Physical Environment<br/><br/></strong><ul><li>This position works hybrid (on site and remote) in El Segundo, CA</li><li>This is primarily a position that works at a computer most of the time<br/><br/></li></ul>This position is eligible for a discretionary bonus and equity award. The hourly base pay range for this position is below. The specific rate will depend on the successful candidate’s qualifications, prior experience as well as geographic location.<br/><br/>$48.08 per hour (entry-level qualifications) to $55.29 per hour (highly experienced)<br/><br/>The application window is anticipated to close on 60 days from when it is posted or sooner if the position is filled or closed.<br/><br/>ImmunityBio employees are as valuable as the people we serve. We have built a resource of robust benefit offerings to best support the total wellbeing of our team members and their families. Our competitive total rewards benefits package, for eligible employees, include: Medical, Dental and Vision Plan Options<br/><br/><ul><li> Health and Financial Wellness Programs</li><li> Employer Assistance Program (EAP)</li><li> Company Paid and Voluntary Life/AD&amp;D, Short-Term and Long-Term Disability</li><li> Healthcare and Dependent Care Flexible Spending Accounts</li><li> 401(k) Retirement Plan with Company Match</li><li> 529 Education Savings Program</li><li> Voluntary Legal Services, Identity Theft Protection, Pet Insurance and Employee Discounts, Rewards and Perks</li><li> Paid Time Off (PTO) includes: 11 Holidays</li><li> Exempt Employees are eligible for Unlimited PTO</li><li> Non-Exempt Employees are eligible for 10 Vacation Days, 56 Hours of Health Pay, 2 Personal Days and 1 Cultural Day</li><li> We are committed to providing you with the tools and resources you need to optimize your Health and Wellness.<br/><br/></li></ul>At ImmunityBio, we are an equal opportunity employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law.<br/><br/>ImmunityBio is a mandatory vaccination employer for COVID-19 and its variants. The Company requires that its employees be fully vaccinated as of their start date. If you require a medical or religious accommodation we will engage in the interactive process with you. Proof of vaccination will be required prior to start. If we make you an offer and you are not yet vaccinated, we will accommodate a delay in start date. ImmunityBio may also mandate that its employees receive vaccine boosters, and all accommodation laws will be followed.", "responsibilities": "The Executive Assistant will assist the General Counsel, Chief Financial Officer and Senior Vice President, Human Resources by performing high-level administrative work. The role will navigate the executive calendars to support prioritization of business needs and travel planning; and will serve as a liaison with internal and external stakeholders while maintaining confidentiality.", "qualifications": {"required": "Bachelor’s degree in business administration or related field, 10+ years’ professional experience as an Executive Assistant, Prior experience working with confidential information in a human resources, legal and/or finance department required", "preferred": "Certified Notary Public"}, "skills": ["Microsoft Office", "Excel", "PowerPoint", "Outlook", "Budgeting", "Finance", "Communication", "Organization", "Planning", "Problem Solving", "Travel", "Scheduling", "Confidentiality"], "postedDate": "2 months ago", "benefits": "Medical, Dental and Vision Plan Options, Health and Financial Wellness Programs, Employer Assistance Program (EAP), Company Paid and Voluntary Life/AD&amp;D, Short-Term and Long-Term Disability, Healthcare and Dependent Care Flexible Spending Accounts, 401(k) Retirement Plan with Company Match, 529 Education Savings Program, Voluntary Legal Services, Identity Theft Protection, Pet Insurance and Employee Discounts, Rewards and Perks, Paid Time Off (PTO) includes: 11 Holidays, Exempt Employees are eligible for Unlimited PTO, Non-Exempt Employees are eligible for 10 Vacation Days, 56 Hours of Health Pay, 2 Personal Days and 1 Cultural Day", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3945854295"}