{"jobTitle": "Maintenance Lead", "company": {"name": "Gold's Gym", "location": "Montclair, CA"}, "location": "Montclair, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Wellness and Fitness Services", "description": "<strong>Why is it great to work here?<br/><br/></strong>Gold’s Gym is growing fast and looking for a Maintenance Lead, to help us keep our gyms able to provide world class experience to our members. We’ll challenge your skills, talents and abilities and reward your every success. Here is just some of the benefits you will get by being a Gold’s Gym employee:<br/><br/><ul><li>Work with great people everyday</li><li>Free gym memberships and discounts</li><li>Opportunities to grow within the company</li><li>Be a part of the most recognized gym brand in the world<br/><br/><br/></li></ul><strong>What sets us apart from the rest:<br/><br/></strong><ul><li>Integrity to build lasting relationships</li><li>Passion for people in the communities we serve</li><li>Pride in what we do and who we are</li><li>Leadership development (ongoing)</li><li>Excellence in execution</li><li>But most of all…. we are more than a gym; we are a family!!<br/><br/><br/></li></ul><strong>We want talented individuals who:<br/><br/></strong><ul><li>Are passionate and take pride in their work</li><li>Can work in a dynamic, fast-paced, environment</li><li>Able to work with various machinery and equipment</li><li>Works great with others</li><li>Can troubleshoot issues quickly and effectively</li><li>Able to handle multiple projects timely and effectively</li><li>Desire to be better than you ever have before<br/><br/><br/></li></ul><strong>When you come to work, you'll:<br/><br/></strong><ul><li>Initiate maintenance and safety programs for a variety of facility equipment</li><li>Be responsible for the preventative maintenance of machinery to include HVAC</li><li>Oversee the cleanliness of our gyms done by our janitorial staff</li><li>Keep compliant and aware of all changes with regulatory agencies like OSHA</li><li>Demonstrate awareness and knowledge of all emergency procedures</li><li>Manage all aspects of the buildings, exterior grounds, equipment, inventory overall facility</li><li>Process and oversee deliveries</li><li>Manage maintenance and janitorial staff, to include housekeeping</li><li>Plan and schedule facility modifications, including cost estimates for the facility <br/><br/><br/></li></ul><strong>There are some MUST HAVES:<br/><br/></strong><ul><li>High school diploma (Trade School or college work highly preferred)</li><li>Ability to achieve aggressive deadlines working accurately at a fast pace</li><li>Ability to read, analyze and interpret complex plans and layouts</li><li>Ability to solve practical problems</li><li>Able to deal with multiple variables</li><li>Organizational skills and attention to details</li><li>Ability to deliver complex topics to management, clients and/or public groups <br/><br/><br/></li></ul>This role requires the ability to move and lift up to 35 lbs. Standing, for extended periods of time and ensuring a professional demeanor, clear communication, and appearance in a clean uniform are also required<br/><br/><strong>ASK YOURSELF IF YOU HAVE WHAT IT TAKES….. COME BE APART OF THE FAMILY LEGACY TODAY!<br/><br/></strong><em>We Celebrate Everyone!! Gold’s Gym SoCal and all its affiliated clubs are an equal opportunity employers. We are proud of our diversity and are committed to creating an inclusive environment for all employees, applicants, vendors, and members alike.</em> <em>All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law</em>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3945284630"}