{"jobTitle": "Associate, Mesa West Capital, Loan Originations", "company": {"name": "Morgan Stanley", "industry": "Financial Services, Investment Banking, and Investment Management", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "140,000.00/yr - 160,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Financial Services, Investment Banking, and Investment Management", "description": "Morgan Stanley Investment Management (“MSIM”), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and $1.5 trillion in assets under management or supervision as of March 31, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide.<br/><br/>Mesa West Capital, a subsidiary of Morgan Stanley Investment Management, is a commercial real estate portfolio lender with over $8 billion in assets under management. Headquartered in Los Angeles with offices in New York, Chicago, Houston and San Francisco, Mesa West has been a leading provider of commercial real estate debt since its founding in 2004.<br/><br/>Mesa West provides non-recourse first mortgage loans for core/core-plus, value-add, and transitional properties throughout the United States. Its lending portfolio includes all major property types with loan sizes ranging from $20 million to $400 million. Since inception, the firm has sourced and closed more than 400 transactions totaling over $27 billion. Mesa West manages institutional capital through a series of private equity funds (open-end, closed-end and separate account mandates). This is an opportunity to join a successful, market-leading platform, and participate in the further growth of the company.<br/><br/>For more information please visit our website at www.mesawestcapital.com.<br/><br/><strong>Job Description<br/><br/></strong>The Associate candidate will be based in the Los Angeles office and work within the Originations group in a collaborative team environment to help review, underwrite and close commercial real estate loans. The candidate will have the opportunity to interact directly with all levels of senior management, including the investment committee, as well as direct client contact often not seen in other organizations.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li> Source new financing opportunities and market the firm through active participation in the real estate community.</li><li> Review and screen commercial real estate financing opportunities.</li><li> Create detailed financial analyses of commercial real estate financing opportunities using Excel and Argus.</li><li> Coordinate efforts leading to transaction closing.</li><li> Review, approve and research property, financial, market and legal due diligence matters.</li><li> Prepare internal investment memoranda.</li><li> Participate in the ongoing asset management and servicing of all investments and act as resource for Asset Management and Servicing personnel post-closing.<br/><br/></li></ul><strong>Qualifications Required<br/><br/></strong><ul><li> At least 3 to 5 years of experience in an analytic support role which could include real estate, finance, banking, equity, and corporate finance.</li><li> Strong academic background and undergraduate degree in business, finance, economics, management or real estate. Real estate program or coursework a plus.</li><li> Strong analytical and quantitative approach to business and problem solving.</li><li> An understanding of financial modeling including discounted cash flows, IRR calculation and scenario analysis.</li><li> Real estate underwriting and valuation experience a plus.</li><li> Excellent Microsoft Excel skills with the ability to create models from scratch. Argus experience a plus.</li><li> Experience with or understanding of basic capital markets principals including interest rate calculations and basic bond math.</li><li> Strong written and verbal communication skills. The candidate must be able to articulate ideas and thoughts well both orally and in writing.</li><li> Ability to work independently and in a team setting.</li><li> Detail oriented, good organizational skills and the ability to effectively multi-task, undertaking a large number and variety of tasks while maintaining the highest work product standards.</li><li> Strong work ethic.<br/><br/></li></ul>Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.<br/><br/>It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.<br/><br/>Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).<br/><br/><strong>Wage Transparency Statement<br/><br/></strong>Expected base pay rates for the role will be between $140,000 and $160,000 per year at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.<br/><br/><strong>Posting Date<br/><br/></strong>Aug 21, 2024<br/><br/><strong>Primary Location<br/><br/></strong>Americas-United States of America-California-Los Angeles<br/><br/><strong>Job<br/><br/></strong>Real Estate<br/><br/><strong>Employment Type<br/><br/></strong>Full Time<br/><br/><strong>Job Level<br/><br/></strong>Associate", "responsibilities": "The Associate candidate will be based in the Los Angeles office and work within the Originations group in a collaborative team environment to help review, underwrite and close commercial real estate loans. The candidate will have the opportunity to interact directly with all levels of senior management, including the investment committee, as well as direct client contact often not seen in other organizations.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li> Source new financing opportunities and market the firm through active participation in the real estate community.</li><li> Review and screen commercial real estate financing opportunities.</li><li> Create detailed financial analyses of commercial real estate financing opportunities using Excel and Argus.</li><li> Coordinate efforts leading to transaction closing.</li><li> Review, approve and research property, financial, market and legal due diligence matters.</li><li> Prepare internal investment memoranda.</li><li> Participate in the ongoing asset management and servicing of all investments and act as resource for Asset Management and Servicing personnel post-closing.<br/><br/></li></ul>", "qualifications": {"required": "At least 3 to 5 years of experience in an analytic support role which could include real estate, finance, banking, equity, and corporate finance.<br/>Strong academic background and undergraduate degree in business, finance, economics, management or real estate. Real estate program or coursework a plus.<br/>Strong analytical and quantitative approach to business and problem solving.<br/>An understanding of financial modeling including discounted cash flows, IRR calculation and scenario analysis.<br/>Real estate underwriting and valuation experience a plus.<br/>Excellent Microsoft Excel skills with the ability to create models from scratch. Argus experience a plus.<br/>Experience with or understanding of basic capital markets principals including interest rate calculations and basic bond math.<br/>Strong written and verbal communication skills. The candidate must be able to articulate ideas and thoughts well both orally and in writing.<br/>Ability to work independently and in a team setting.<br/>Detail oriented, good organizational skills and the ability to effectively multi-task, undertaking a large number and variety of tasks while maintaining the highest work product standards.<br/>Strong work ethic.<br/><br/>", "preferred": ""}, "skills": ["Real Estate", "Finance", "Banking", "Equity", "Corporate Finance", "Financial Modeling", "Discounted Cash Flow", "IRR Calculation", "Scenario Analysis", "Real Estate Underwriting", "Valuation", "Microsoft Excel", "Argus", "Capital Markets", "Interest Rate Calculations", "Bond Math", "Communication", "Teamwork", "Problem Solving", "Multitasking", "Organization"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3945053206"}