{"jobTitle": "Director of Business Development", "company": {"name": "SpiderOak", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "Who are We?\n\nWe want to change the world, and we've already done it once. SpiderOak has been building encrypted software since before the first iPhone was released.\n\nSpiderOak is committed to building secure and reliable software that protects our customers' data. Our approach is fundamentally different from most mainstream security companies. Instead of adding layers of security on top of an insecure system, we build software that is inherently secure.\n\nSpiderOak builds need-to-know technology that supports customers working in hostile environments. Traditional systems trust IT infrastructure to maintain the whole security system, even though the news is rife with evidence that this model does not work. Our software combines end to end encryption with a distributed ledger (aka Blockchain) technology to offer best-in-class security with no backdoors.\n\nCandidate must possess an active security clearance.\n\nWho We Need\n\nSpiderOak is looking for an individual contributor to grow our space business. This individual contributor will report to the Chief Revenue Officer. This position will be focused on US Government space and unmanned systems acquisitions while developing markets in commercial space and unmanned autonomous systems markets.\n\nDuties/Responsibilities: \n\n<ul><li>Hunt prospects through capture management. You will know everything happening in US Government Space Opportunities and map mission needs against SpiderOak cybersecurity capabilities.</li><li>Identify, recruit and manage partners for the adoption of SpiderOak technology in support of end user requirements.</li><li>Shape technical efforts with government, and articulate needs for which the customer themselves may not realize yet.</li><li>Lead individual captures from shaping through to proposal and closing.</li><li>Generate sales qualified leads, target accounts, develop a pipeline, and manage deals through the pipeline.</li><li>Create OEM partner agreements with system integrators, solution, and product providers.</li><li>Engage Government operators, programmers, and acquisitions in targeted, planned approach to enable capture success.</li><li>Promote SpiderOak at events and industry days, and write thought-leadership white papers.</li><li>Conduct market research and analysis.</li><li>As needed, act as subject matter expert and complete additional tasks as directed.<br/><br/></li></ul>What You'll Bring\n\n<ul><li>BS degree required to complete this role successfully.</li><li>Be able to maintain security clearance (TS/SCI)</li><li>At least three years of a demonstrated track record of developing solutions and closing on opportunities in the US Government.</li><li>Excellent verbal and written communication skills.The ability to interact at all levels of the government and the commercial sector.</li><li>Expert-level understanding of the space industry and government acquisition process.</li><li>Ability to work within a team to articulate customer needs when required.</li><li>Excellent organizational skills and attention to detail.</li><li>Proficient with Microsoft Office Suite or related software.<br/><br/></li></ul>Physical Requirements: \n\n<ul><li>Prolonged periods of sitting at a desk and working on a computer.</li><li>Travel is required. </li><li>Must be able to lift up to 15 pounds at a time, as necessary.<br/><br/></li></ul>What We Provide\n\nSpiderOak Inc. and Mission Systems is a 100% remote-based working environment. Our culture is built on trust and flexibility. We believe our employees are the key to our success, and welcome new ideas and talents.\n\nWe are an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. In other words, we welcome you just as you are!\n\nTo learn more about SpiderOak Inc. and Mission Systems, visit our website at: https://spideroak.com/home/", "postedDate": "2 months ago", "skills": ["Security Clearance", "Capture Management", "Government Acquisition", "Space Industry", "Partner Management", "Sales", "Business Development", "Microsoft Office Suite", "Market Research", "Communication", "Teamwork", "Organizational Skills", "Attention to Detail"], "url": "https://www.linkedin.com/jobs/view/3945926335"}