{"jobTitle": "Manager, Strategic Sourcing", "company": {"name": "Mindteck", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "IT Services and IT Consulting", "description": "Establishes strong relationships with key WBD stakeholders in the Production & Content Supply Chain category. Builds a strong understanding of strategic business direction, objectives, requirements and priorities across Production & Content Supply Chain categories. Effectively works with functional and business groups as a trusted advisor to identify sourcing opportunities, develop and implement sourcing strategies for Production & Content Supply Chain across WBD to deliver against Production & Content Supply Chain business objectives. Supports the development of category strategy recommendations in a concise and persuasive fashion and leads implementation of the sourcing strategy (optimization, process enhancements, sole source or short-list negotiations, leverage added scope, competitive bidding, reverse auctions, etc.)  Is resourceful in obtaining relevant information for developing new category strategies and supporting decisions within the category and/or sourcing engagements for the business unit. Conducts comprehensive supplier analysis (strategic direction, financial health/risk due diligence, market position, power within industry, capabilities & capacity, risk assessment)  Develops and implements supplier relationship programs that cut across multiple WBD business divisions Identifies and implements large scale, complex projects across divisions and territories. May involve outsourcing analysis and total cost of ownership considerations.  Compiles and synthesizes both business requirements and external market conditions to develop optimal category strategy with full understanding of potential shortfalls and risk mitigation plans.  Develops and assembles required Request for Information (RFI), Request for Quotation (RFQ) or Request for Proposal (RFP) to facilitate development of sourcing strategy. Leads the entire Request for Proposal (RFP) process which includes leading cross-functional teams in selecting partners to facilitate real estate related requirements. Demonstrates consistent success in meeting or exceeding goals, timelines, and expectations for multiple projects that may be occurring simultaneously. Breaks paradigms to look at financial/analytical problems in new ways. Develops detailed analyses of financial statements and industry cost drivers. Conceives and develops complex analytical & pricing models, including analysis of financial statements and industry cost drivers. Can apply various types of financial analyses to address challenges. Analyzes market/category trends and historical spending patterns to identify opportunities for supplier consolidation and (re)negotiations.  Leads and develop negotiation strategies, contract analyses, sourcing communications and meetings.  Possesses the experience and confidence to make well-judged decisions independently, which consider the short- and long-term impacts to the interests of the business. Collaborates with stakeholders and legal counsel to lead global negotiations and contract coordination.  Has the necessary business acumen to be thoroughly conversant in the intent and rationale behind contract provisions from a business as well as legal perspective, and acts as a liaison between the contracting entities, legal groups, and other parties as necessary.Technology requirements: <br/><br/> Bachelor's Degree in Business Management or a technical major is required. Experience in the Media & Entertainment industry with exposure to Production & Content Supply Chain is required Professional accreditation in sourcing / procurement preferred<br/><br/> 5-8 years strategy, operations, and sourcing experience in a sophisticated sourcing environment<br/><br/> Solid experience and highly developed subject matter expertise in Production & Content Supply Chain Must have proven project management experience, excellent communication skills, ability to analyze and resolve complex issues, and a team building work style for a fast-paced environment. Experience in working with Production & Content Supply Chain executives in formulating and executing on business strategy Experience in working in a large, global, decentralized and matrixed organization. Curious, passionate, self-starter, strong customer service orientation with the highest integrity and work ethics. Strong supplier management/performance measurement monitoring experience. Must be knowledgeable of, and experienced in, application of Strategic Sourcing best practices. Ability to deliver professional and effective communications, verbally or in writing thorough presentations that are persuasive, and result in positive impact on the business.  Advance analytical skills and demonstrated application of category-specific best practices. Able to conceive, comprehend, analyze, translate and apply complex business strategies/practices/requirements into RFXs & analytical/financial models. Strong project leader, emphasis on execution, multi-tasking & managing multiple priorities. Highly collaborative and agile team player. Able to gain trust, strong service orientation, impeccable customer focus with the ability to influence others. Self-motivated, works independently, minimal direction needed. Ability to manage multiple projects & tasks that may be occurring simultaneously with tight timelines", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3945096234"}