{"jobTitle": "Sales Assistant", "company": {"name": "Zegna", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "20.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>About Zegna<br/><br/></strong>Following the path traced by the founder Ermenegildo over 110 years ago, ZEGNA is now internationally recognized as a leading global luxury menswear brand. Established as a fabric maker in the mountains of Piedmont, ZEGNA is part of the Ermenegildo Zegna Group, which counts more than 6,000 employees. Managed by Gildo Zegna as Chairman and CEO, Ermenegildo Zegna Group designs, creates, and distributes luxury ready-to-wear and accessories under both the ZEGNA and Thom Browne brands to over 500 stores. The Group also operates TOM FORD FASHION through a long-term license agreement with The Estée Lauder Companies Inc. to over 100 stores. As of 30th September 2023, ZEGNA has 403 stores of which 242 are directly operated. The brand remains committed to leveraging its rich heritage to build a better present and future.<br/><br/><strong>YOUR OPPORTUNITY<br/><br/></strong>As a<strong> Sales Assistant </strong>for Zegna, you will aid in transforming a customer’s store visit into a memorable luxury shopping experience. As Brand Ambassadors, you help support the Customer Advisors and help create an atmosphere of passion and enthusiasm for the Zegna collections.<br/><br/>Reporting directly to the Store Manager, you will support the sales team through retail operational excellence and aid in ensuring the stores’ overall image. The role stands at the very center of our organization as they continue to safeguard the growth and longevity of our Brand.<br/><br/><strong>How You Will Contribute<br/><br/></strong><ul><li>Actively communicate customer, product, and other store information within the store team to ensure customer and business needs are met.</li><li>Support selling flow activities by consistently updating customer profiles, executing gift packages and aid in the overall preparation for client appointments </li><li>Create Calendar for confirmed appointments</li><li>Support with pulling + organizing product for large scale appointments</li><li>Ensure POS and Alteration Stations are stocked + organized</li><li>Consult with Customer Advisors to discover their needs by exploring customer preferences and occasions for which the customers are shopping.</li><li>Utilize company provided (iPod/iPad) technology to offer a complete and integrated luxury experience.</li><li>Take ownership of resolving customer issues or complaints with empathy, while adhering to Zegna customer service policies such as alteration, damage, and repair, global return policies, etc. </li><li>Support the MTM department in entering orders in FIT when floor support is not needed</li><li>Drive and perform onsite audits of store physical inventories</li><li>Ensure in-store visual merchandising adheres to Merchandising guidelines</li><li>Purchase of all packing related materials, packaging, and general supplies for the store</li><li>Support back of house operations (shipping &amp; receiving items) </li><li>Adhere to Zegna store operations and time and attendance policies and standards.<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>Is passionate and open-minded</li><li>Generates customer delight</li><li>Proficient with digital technology</li><li>Excellent written and verbal communication skills</li><li>The hiring range for this position ranges from $20-$25/hr. The rate of pay offered will be dependent upon candidates' relevant skills and experience.</li></ul>", "responsibilities": "As a Sales Assistant for Zegna, you will aid in transforming a customer’s store visit into a memorable luxury shopping experience. As Brand Ambassadors, you help support the Customer Advisors and help create an atmosphere of passion and enthusiasm for the Zegna collections.<br/><br/>Reporting directly to the Store Manager, you will support the sales team through retail operational excellence and aid in ensuring the stores’ overall image. The role stands at the very center of our organization as they continue to safeguard the growth and longevity of our Brand.", "qualifications": {"required": "Is passionate and open-minded, Generates customer delight, Proficient with digital technology, Excellent written and verbal communication skills"}, "skills": ["Customer Service", "Sales", "Retail", "Luxury Goods", "Communication"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3945646383"}