{"jobTitle": "Vice President of Sales - Aerospace", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$240,000.00/yr - $270,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Staffing and Recruiting", "description": "<strong>Who We Are<br/><br/></strong>We are a leading Aerospace Manufacturer (OEM) for Engineered Components. We're dedicated to providing top-notch products and services for our clients in the Aerospace industry, while also being dedicated to providing an excellent work environment and culture for our employees. As our company begins to expand, we're looking for a Vice President of Sales to help take our company to the next level!<br/><br/><strong>Position Overview:</strong> The Vice President of Sales Aerospace is a highly visible role that requires strong strategic and customer facing skills, as well as the ability to work well with cross-functional teams. The Vice President of Sales will be responsible for driving revenue growth and meeting or exceeding sales goals for the aerospace industry.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Develop and lead a sales strategy to meet or exceed revenue goals for the Aerospace industry.</li><li>Manage sales process including customer onboarding, pricing strategy, and relationships with OEM, manufacturing, and aviation suppliers.</li><li>Work with marketing and product teams to develop sales collateral and product roadmaps.</li><li>Maintain a thorough understanding of the Aerospace industry and competitive landscape.</li><li>Regularly monitor customer satisfaction and drive customer loyalty programs.</li><li>Report to senior management on sales and performance metrics.</li><li>Cultivate a customer-centric culture among sales team.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in Business, Engineering, or related field.</li><li>Minimum of 10 years of sales experience in the Aerospace industry.</li><li>Strong P&amp;L and budgeting experience.</li><li>Ability to build relationships with key industry players.</li><li>Highly organized with exceptional communication and problem-solving skills.</li><li>Experience in managing a sales team and developing sales plans for the MRO and OEM markets.</li><li>Ability to travel onsite to Orange County, CA as needed</li><li>Ability to travel domestically and internationally up to 50%<br/><br/></li></ul>Compensation: $240,000 - $270,000 Base Salary + Bonus/Commission.<br/><br/>Excellent Benefits and 401k Package.<br/><br/><strong>Benefits<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/><strong>Email Your Resume In Word To<br/><br/></strong>chris.minyon@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : CM23-1798995 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Chris Minyon - Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.<br/><br/>", "responsibilities": "Develop and lead a sales strategy to meet or exceed revenue goals for the Aerospace industry. Manage sales process including customer onboarding, pricing strategy, and relationships with OEM, manufacturing, and aviation suppliers. Work with marketing and product teams to develop sales collateral and product roadmaps. Maintain a thorough understanding of the Aerospace industry and competitive landscape. Regularly monitor customer satisfaction and drive customer loyalty programs. Report to senior management on sales and performance metrics. Cultivate a customer-centric culture among sales team.", "qualifications": {"required": "Bachelor's degree in Business, Engineering, or related field. Minimum of 10 years of sales experience in the Aerospace industry. Strong P&amp;L and budgeting experience. Ability to build relationships with key industry players. Highly organized with exceptional communication and problem-solving skills. Experience in managing a sales team and developing sales plans for the MRO and OEM markets. Ability to travel onsite to Orange County, CA as needed Ability to travel domestically and internationally up to 50%", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Compensation: $240,000 - $270,000 Base Salary + Bonus/Commission. Excellent Benefits and 401k Package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3946210640"}