{"jobTitle": "Global Supply Manager, Engine", "company": {"name": "Relativity Space", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "96,000—$122,000 USD", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "At Relativity Space, we have two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. Both contribute to our long-term vision of creating humanity’s industrial base on Mars, paving the way for interplanetary life to expand the possibilities of the human experience. This journey begins right here on Earth – where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity, thanks to our iterative approach that accelerates design, testing, and development while minimizing costs. While our groundbreaking research and development in 3D printing pushes the boundaries of large-scale additive manufacturing.\n\nYour journey with us is more than just a job – it’s an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate, creative individuals. Join us on this extraordinary journey, as we work together to transform our vision into reality.\n\nAbout The Team\n\nSupply Chain at Relativity encompasses direct supply management for all Terran-R parts and materials, indirect supply management for the Long Beach site, and materials management. Put simply, we own the value chain from identification of a need to delivery to our internal customer. The Supply Chain team’s vision is to build a best-in-class, responsive, and data-driven supply chain management organization that is a key competitive advantage for Relativity. Supply Chain is currently putting that vision into practice through sourcing long-lead parts, production equipment, and infrastructure projects for Terran R production. We have had numerous accomplishments with high-dollar, impactful projects by collaborating closely with finance, manufacturing, and engineering to deliver excellent value and keep our aggressive Terran R schedule on track.\n\nAs a Global Supply Manager, Engine, you’ll work closely with stakeholders across Powder Bed Fusion Engineering and Operations, Machine Shop, Propulsion Engineering, Manufacturing Operations, Supply Chain Planning, and more to design and scale both existing and novel supply chains in the design and development of complex components that create a competitive advantage for the enterprise. Commodities managed will include: Raw Materials, Internal Production Consumables, @ Special Processing for Engine Components.\n\nAbout The Role\n\n<ul><li>Own the development and implementation of our supply chain strategy for the Terran-R vehicle structures.</li><li>Conduct comprehensive assessment on existing subcomponent supply chains and refine end-to-end operating model to ensure near-term material demand is fulfilled through development, qualification, and initial production.</li><li>Be accountable for on time delivery of all responsible parts, working closely with program management to ensure lead times support build cadence.</li><li>Leverage forecasts to develop commodity strategies and drive sourcing activities through contract implementation.</li><li>Operationalize ERP for digital management of end-to-end component lifecycle.</li><li>Build strategic, long-term relationships with supply partners to always maximize value for both parties.</li><li>Develop relationships with internal stakeholders to anticipate requirements and implement procurement strategies aligned to business requirements.<br/><br/></li></ul>About You\n\n<ul><li>Bachelor’s degree in Engineering, Supply Chain/Operations Management, Economics/Finance, or similar.</li><li>2+ years of demonstrated success in a strategic sourcing, manufacturing or engineering role. Experience with aerospace development programs preferred, but not required.</li><li>Knowledge of enterprise applications (i.e., PLM, ERP, MES) and experience in sophisticated data modeling techniques.</li><li>Knowledge of contract structures, contract negotiations, contract implementation, and vendor management.</li><li>Basic negotiation skills.<br/><br/></li></ul>Nice To Haves But Not Required\n\n<ul><li>Master’s degree in Engineering, Business Administration, Supply Chain/Operations Management, or similar.</li><li>New Product Development (NPD) or Introduction (NPI) supply chain experience, preferably within aerospace or frontier technology industries.<br/><br/></li></ul>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nAt Relativity Space, we are committed to transparency and fairness in our compensation practices. Actual compensation will be determined based on experience, qualifications, and other job-related factors.\n\nCompensation is only one part of our total rewards package. Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more! To see some of the benefits &amp; perks we offer, please visit here.\n\nHiring Range\n\n$96,000—$122,000 USD", "responsibilities": "Own the development and implementation of our supply chain strategy for the Terran-R vehicle structures.Conduct comprehensive assessment on existing subcomponent supply chains and refine end-to-end operating model to ensure near-term material demand is fulfilled through development, qualification, and initial production.Be accountable for on time delivery of all responsible parts, working closely with program management to ensure lead times support build cadence.Leverage forecasts to develop commodity strategies and drive sourcing activities through contract implementation.Operationalize ERP for digital management of end-to-end component lifecycle.Build strategic, long-term relationships with supply partners to always maximize value for both parties.Develop relationships with internal stakeholders to anticipate requirements and implement procurement strategies aligned to business requirements.", "qualifications": {"required": "Bachelor’s degree in Engineering, Supply Chain/Operations Management, Economics/Finance, or similar.2+ years of demonstrated success in a strategic sourcing, manufacturing or engineering role. Experience with aerospace development programs preferred, but not required.Knowledge of enterprise applications (i.e., PLM, ERP, MES) and experience in sophisticated data modeling techniques.Knowledge of contract structures, contract negotiations, contract implementation, and vendor management.Basic negotiation skills.", "preferred": "Master’s degree in Engineering, Business Administration, Supply Chain/Operations Management, or similar.New Product Development (NPD) or Introduction (NPI) supply chain experience, preferably within aerospace or frontier technology industries."}, "skills": ["Supply Chain Management", "Sourcing", "Manufacturing", "Engineering", "Aerospace", "ERP", "PLM", "MES", "Data Modeling", "Contract Negotiation", "Vendor Management"], "postedDate": "1 week ago", "benefits": "Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3946014313"}