{"jobTitle": "Assistant Director of Labs and Makerspaces", "company": {"name": "Chapman University", "industry": "Higher Education", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Business Development and Sales", "industry": "Higher Education", "description": "<strong>Job Description<br/><br/></strong><strong>About the Department<br/><br/></strong>The rapidly growing Dale E. and Sarah Ann Fowler School of Engineering (FSE) seeks highly motivated colleagues to help build Chapman University’s newest school. Opened in the fall of 2019, FSE offers undergraduate degree programs in Computer Science, Computer Engineering, Data Science, Software Engineering, and Electrical Engineering, along with a new graduate degree program, a MS in Electrical Engineering and Computer Science. The School also offers several interdisciplinary minors and themed inquiry programs that allow students from across other Chapman programs to explore engineering.<br/><br/>FSE is housed in the new Swenson Family Hall of Engineering, a cutting-edge facility that supports student learning, campus-wide project activities, and faculty-led research. Within Swenson Hall is an open-access makerspace, the Design / Create/ Innovate Lab (DCI), consisting of four rooms that house a wide variety of low and high-end fabrication equipment. The DCI Lab supports academic and personal projects and welcomes individuals from all levels of making, design, and innovation experience. A goal of the lab is to encourage an inclusive and supportive community of makers across the entire campus community who want to become more familiar with the tools and resources in the spaces. In addition to the DCI Lab, FSE has two instructional labs housed within Swenson Hall: the Signals and Cyber Lab and the Circuits and Structures Lab.<br/><br/><strong>About The Position<br/><br/></strong>Fowler Engineering is looking for a collaborative and goal-oriented Assistant Director of Labs and Makerspaces who is passionate about technology and its implications for making, as well as improving accessibility to this technology. The Assistant Director position will oversee and ensure a smooth, collaborative and inclusive operation of the DCI Lab and instructional labs. This includes development and oversight of training materials, safety standards, and operating protocols. Develop and implement innovative solutions to the management, training, and support of students, curricula, research, personnel, and equipment. Provide technical support and mentorship in various interdisciplinary course-related projects, extracurricular activities, and academic research. Oversee the inventory and maintenance of equipment, supplies and assets ensuring functionality and safety. The Assistant Director also leads, supervises and manages three full-time technical staff and an average of twelve student assistants. Oversight of operations, duties, and management of staff and students will continue to grow along with the expansion of FSE activities, enrollment and programs.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Oversee and ensure a smooth and collaborative operation of the Fowler School of Engineering (FSE) Design/Create/Innovate (DCI) Lab makerspaces and instructional labs. Recommends, develops, and implements processes to ensure optimal efficiency and use of resources. </li><li>Create and maintain an open, positive, and welcoming space for students, faculty, and staff at all levels of making, design, and innovation experience. </li><li>Hire, train, and supervise technical staff and student employees. Help them be effective facilitators and mentors in the spaces. </li><li>Ensure the safe and efficient operation of the facilities. Develop safety policies, procedures and programs; act as a responsible party for individual safety and the safety of others. Establish and facilitate training on equipment, technology, and safety. </li><li>Guide and support students and faculty in course-related projects, engineering-specific extracurricular activities, and academic research related to the manufacturing/making facilities and programs. </li><li>Develop and implement innovative and modern solutions to the management, training and support of students, curricula, research, personnel, and equipment. </li><li>Oversee and encourage partnerships with non-Chapman users, industry professionals, non-engineering departments, campus partners, students, faculty, underrepresented communities, research, outreach, etc. </li><li>Develop and execute activities, events and programs to increase engagement and usage of the DCI Lab and makerspace resources. </li><li>Lead the development, planning, and execution of lab and prototyping facilities, including equipment selection, facility layout, safety standards, and the integration of those facilities into the School’s research and education agendas. </li><li>Oversee maintenance needs, ensure completion, and conduct routine/preventive maintenance to ensure uninterrupted services of equipment and facilities. Troubleshoot and perform basic maintenance of equipment as needed. </li><li>Develop and monitor lab and makerspace budgets and expenditures. Identify and advise on new equipment purchases by upholding a working knowledge of equipment and tools that are becoming most useful or necessary. </li><li>Guide faculty and recommend on the selection and sourcing of equipment, instructional supplies, and materials. Oversee ordering, receiving and distribution of lab supplies and equipment loans. </li><li>Manage inventory and documentation of equipment, tools, and supplies necessary for labs and makerspaces. Oversee the DCI Lab point-of-sale system and cashiers. </li><li>Direct the development and execution of the summer workshop curriculum; manage and train workshop staff; oversee ordering, receipt and preparation of workshop supplies and materials. </li><li>Coordinate with leadership, staff and various university departments on space use and allocation, special events, storage, and facilities access. </li><li>Serve on committees and service to the University and college as needed. <br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>A Bachelor's degree in supporting fields of engineering and technology, or related field. A combination of formal education and experience required. </li><li>Outstanding record of supervisory and management experience with the ability to lead and foster an inclusive learning environment. </li><li>Ability to supervise, train, and evaluate employees, including organizing, prioritizing, and scheduling work assignments in a makerspace or equivalent environment. </li><li>Familiarity with and ability to operate basic and advanced prototyping equipment such as manual and numerical control metalworking equipment, electronics test and measurement equipment, 3D printers, laser cutters, and woodworking equipment, and helping others with these technologies. </li><li>Excellent oral and written English language skills with the ability to interact with diverse individuals and groups at all organizational levels, both inside and outside of the University. </li><li>Ability to handle complex situations and multiple responsibilities simultaneously mixing long-term projects with the urgency of immediate demands, and strong problem solving and organizational skills. </li><li>Ability to demonstrate and enforce proper health and safety procedures and regulations. </li><li>Ability to work within a budget effectively and monitor expenditures. </li><li>Experience maintaining a workspace and ability to oversee space improvement processes and maintenance service programs. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>Chapman University is a nationally ranked institution offering traditional undergraduate and graduate programs in the heart of Orange County, one of Southern California’s most diverse and vibrant regions. The university achieved R2 status in the Carnegie Classification of Institutions of Higher Education, a distinction held by just 10 percent of all U.S. universities.<br/><br/>Chapman University does not discriminate on the basis of race, color, gender, religion, national or ethnic origin, disability, age, marital status or sexual orientation in the administration of its education policies or any other policies or programs administered by the university.<br/><br/>Chapman University is a nationally ranked institution offering traditional undergraduate and graduate programs in the heart of Orange County, one of Southern California’s most diverse and vibrant regions. The university achieved R2 status in the Carnegie Classification of Institutions of Higher Education, a distinction held by just 10 percent of all U.S. universities. Chapman University does not discriminate on the basis of race, color, gender, religion, national or ethnic origin, disability, age, marital status or sexual orientation in the administration of its education policies or any other policies or programs administered by the university.", "responsibilities": "<ul><li>Oversee and ensure a smooth and collaborative operation of the Fowler School of Engineering (FSE) Design/Create/Innovate (DCI) Lab makerspaces and instructional labs. Recommends, develops, and implements processes to ensure optimal efficiency and use of resources. </li><li>Create and maintain an open, positive, and welcoming space for students, faculty, and staff at all levels of making, design, and innovation experience. </li><li>Hire, train, and supervise technical staff and student employees. Help them be effective facilitators and mentors in the spaces. </li><li>Ensure the safe and efficient operation of the facilities. Develop safety policies, procedures and programs; act as a responsible party for individual safety and the safety of others. Establish and facilitate training on equipment, technology, and safety. </li><li>Guide and support students and faculty in course-related projects, engineering-specific extracurricular activities, and academic research related to the manufacturing/making facilities and programs. </li><li>Develop and implement innovative and modern solutions to the management, training and support of students, curricula, research, personnel, and equipment. </li><li>Oversee and encourage partnerships with non-Chapman users, industry professionals, non-engineering departments, campus partners, students, faculty, underrepresented communities, research, outreach, etc. </li><li>Develop and execute activities, events and programs to increase engagement and usage of the DCI Lab and makerspace resources. </li><li>Lead the development, planning, and execution of lab and prototyping facilities, including equipment selection, facility layout, safety standards, and the integration of those facilities into the School’s research and education agendas. </li><li>Oversee maintenance needs, ensure completion, and conduct routine/preventive maintenance to ensure uninterrupted services of equipment and facilities. Troubleshoot and perform basic maintenance of equipment as needed. </li><li>Develop and monitor lab and makerspace budgets and expenditures. Identify and advise on new equipment purchases by upholding a working knowledge of equipment and tools that are becoming most useful or necessary. </li><li>Guide faculty and recommend on the selection and sourcing of equipment, instructional supplies, and materials. Oversee ordering, receiving and distribution of lab supplies and equipment loans. </li><li>Manage inventory and documentation of equipment, tools, and supplies necessary for labs and makerspaces. Oversee the DCI Lab point-of-sale system and cashiers. </li><li>Direct the development and execution of the summer workshop curriculum; manage and train workshop staff; oversee ordering, receipt and preparation of workshop supplies and materials. </li><li>Coordinate with leadership, staff and various university departments on space use and allocation, special events, storage, and facilities access. </li><li>Serve on committees and service to the University and college as needed. <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>A Bachelor's degree in supporting fields of engineering and technology, or related field. A combination of formal education and experience required. </li><li>Outstanding record of supervisory and management experience with the ability to lead and foster an inclusive learning environment. </li><li>Ability to supervise, train, and evaluate employees, including organizing, prioritizing, and scheduling work assignments in a makerspace or equivalent environment. </li><li>Familiarity with and ability to operate basic and advanced prototyping equipment such as manual and numerical control metalworking equipment, electronics test and measurement equipment, 3D printers, laser cutters, and woodworking equipment, and helping others with these technologies. </li><li>Excellent oral and written English language skills with the ability to interact with diverse individuals and groups at all organizational levels, both inside and outside of the University. </li><li>Ability to handle complex situations and multiple responsibilities simultaneously mixing long-term projects with the urgency of immediate demands, and strong problem solving and organizational skills. </li><li>Ability to demonstrate and enforce proper health and safety procedures and regulations. </li><li>Ability to work within a budget effectively and monitor expenditures. </li><li>Experience maintaining a workspace and ability to oversee space improvement processes and maintenance service programs. <br/><br/></li></ul>", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3946109004"}