{"jobTitle": "Regional Manager, LA Area (Free Benefits)!", "company": {"name": "Barker Management Inc", "industry": "Real Estate", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$75,000.00 - $90,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Real Estate", "description": "Barker Management Inc. is a leader in the Property Management Services industry who has provided quality service to customers since 1972! We consider the employees of Barker to be one of our most valuable resources. Our continued success depends on service-oriented employees making a difference for Barker and our customers every day. The loyalty, commitment, and dedication of Barker people have provided the winning edge in the competitive market we serve. Our customers trust Barker and the services we provide.", "responsibilities": "The Regional Manager is responsible for all aspects of on-site operations for each of the developments assigned, including, but not limited to both physical and financial conditions. Coordinates, manages, supervises and acts as the primary liaison between the on-site personnel, Company’s Central Office personnel, and the owners and investors for each development. Responsible for representing the Company, acting in the best interest of Company and the owner(s)/investor(s), and communicating accurate and timely information to and from Company and the owner(s)/investor(s).", "qualifications": {"required": "Experience with Affordable Housing / Low-Income Housing", "preferred": "Understanding of accounting & management software"}, "skills": ["Property Management", "Affordable Housing", "Team Leadership", "Financial Management", "Customer Service"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Car Allowance! Free medical, dental and vision after your first 90 days! 80 hours of paid vacation, 12 paid holidays and 80 hours of sick pay as well!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3946042952"}