{"jobTitle": "Account Executive", "company": {"name": "We Are RALLY", "industry": "Public Relations and Communications Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Public Relations and Communications Services", "description": "CALLING ALL BIG-HEARTED, BIG THINKING PEOPLE. ARE YOU READY TO DO THE BEST WORK OF YOUR LIFE? We seek those committed to big, bold, meaningful progress. Progress that matters. Progress that acknowledges every person and every voice. Join us. RALLY is an advocacy agency with a proven track record of driving progress around complex political and social issues. Organizations like the ACLU, Black Lives Matter, March for Our Lives, EarthJustice, and GoFundMe are among the more than 500 clients who have chosen RALLY to be their accomplice in this work. As an agency, we strive to be co-pilots with our clients. We seek those committed to big, meaningful progress. Progress that matters. Progress that acknowledges every person and every voice. RALLY is strengthened by our team’s diversity, including race and ethnicity, age, national origin, religion, sexual orientation, and gender identity and expression. RALLY is an equal-opportunity employer, and all applicants will be considered. We strongly encourage folks from all backgrounds to apply.", "responsibilities": "Performing fundamental public relations tasks, such as developing and editing high-quality media materials (press releases, briefing memos, media advisories, pitch sheets) and pitching and placing stories by and about clients in print, online, and broadcast outlets. Demonstrating tactical proficiency in media relations, including creating and driving outreach plans, message development, management of events, and effective training of spokespersons on speeches and presentations. Collaborating on account teams for multiple clients, including leading more complex projects with the support of a Principal or Account Manager. Anticipating client needs, as well as internal team needs and assignments, on a daily basis. Organizing and staffing events, desk-side briefings, and other out-of-office client functions. Monitoring trends and changes in news media, social media, and political and nonprofit landscapes. Conducting research with the ability to distill key points and offer strategic insights on the information gathered. Contributing one new business idea per quarter. Managing and executing multiple, detailed tasks and projects for assigned client accounts. Attending regular staff, team, and client meetings, and providing input and feedback on business improvement, including the craft of client service, staff development, and office procedures. Supporting press outreach, including identifying and pitching news items and leading proactive communications and rapid response efforts. Providing strategic support and day-to-day supervision for smaller client accounts, including Account Associate and Fellow mentorship, supervision, and oversight of work product quality. Implementing forward-thinking branding, messaging and communications plans to achieve clients’ goals for diverse audiences, including the general public, media, political decision-makers, and other stakeholders. Pursuing your professional development plan developed in collaboration with your supervisor and mentor. Showing initiative by taking on new projects and actively growing new skill sets. Executing administrative responsibilities as assigned. Contributing to strategic growth and brand positioning for the firm overall.", "qualifications": {"required": "Bachelor's degree, Three-five years of experience in public interest advocacy, public relations, or demonstrated equivalent at a firm/agency, foundation/association, or in an electoral campaign, Strong written and verbal communication skills and proven ability to effectively organize and manage multiple responsibilities, Experience in the issue advocacy space and using communications to advance progressive issues, Strong understanding of public relations concepts and tactics, including drafting press releases, building press lists, pitching, and engaging with reporters, Ability to communicate clearly and effectively, both verbally and in written format, with varying levels of company staff, clients, media, and vendors, Strong computer skills, experience with Google Workspace, as well as Microsoft Office Suite, and a working knowledge of other web-based tools and platforms, Ability to manage project workflow, manage multiple tasks under tight deadlines, Innovative and solutions-oriented mindset, Demonstrate resourcefulness, optimism, and flexibility in approach to project assignments, Highly organized and detail-oriented, Intellectual curiosity, high emotional intelligence, and a sense of humor, Team player with the ability to step into leadership roles.", "preferred": "Not specified"}, "skills": ["Public Relations", "Media Relations", "Project Management", "Strategic Thinking", "Client Relations"], "postedDate": "2 months ago", "applicationDeadline": "July 26th", "benefits": "Flexible time off policy, Two months of work-from-anywhere time in July and December, Twelve Federal holidays, including Juneteenth and Indigenous Peoples’ Day, One week of paid time off between Christmas and New Year’s Day, A one-month paid sabbatical after seven years of employment.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3946441752"}