{"jobTitle": "Business Development Manager", "company": {"name": "Blew & Associates, P.A.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales, Business Development, and Customer Service", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Blew is expanding again and we are looking to add a dynamic Business Development Manager. Blew is a full service Surveying, Engineering and Environmental firm. We work in the areas of land development, commerical real estate due diligence, construction services, zoning, environmental assessments, renewable energy and much more. Consider joining a firm with over 130 years of experience.<br/><br/>The BMD will need to develop and retain a quality client base comprised of REIT's, Owner Developers, Private Equity, Law Firms, Title Companies, Corporations and Lenders, with significant commercial real estate portfolio holdings in a variety of capacities through the acquisition of new business. Have indepth understanding of the projects you sell in order to interface with clients and legal counsels on complex commercial real estate and zoning regulations. Will have an ongoing responsibility for maintaining the client relationship and servicing the customer's needs throughout the entire due diligence process, through closing.<br/><br/>The BDM will:<br/><br/><ul><li>Communicate proactively with and respond in a timely manner to clients</li><li>Compile lists of prospective customers for use as sales leads, based on information from trade publications, business directories, industry ads, trade shows, internet websites, and other various sources</li><li>Develop and execute a call and travel plan for the area assigned to include phone calls and appointments with qualified client leads</li><li>Assess individual client needs and develop, present and implement a plan to satisfy those needs</li><li>Stay highly visible in market by attending commercial real estate industry functions</li><li>Demonstrate knowledge of the products we sell by using samples, and client requirements, while emphasizing service features and benefits<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Ability to listen to customers and understand their needs and objectives to better respond and offer services and solutions</li><li>Demonstrates poise and resolve, in a fast-paced environment</li><li>Demonstrates persistence, tenacity and consistency in pursuing client prospects</li><li>Strong interpersonal communication skills</li><li>Flexible with the ability to adapt strategy to ever-changing conditions</li><li>Understanding of market and competition with the ability to identify external threats and opportunities</li><li>Ability to persuade and influence others</li><li>Strong negotiation skills</li><li>Visibility requires maintaining a professional appearance and providing a positive company image to the public</li><li>Detail Oriented</li><li>Ability to take direction and grow with company</li><li>Good communication skills (both written and verbal)<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>100% coverage of health benefits including Medical and Dental with optional family and/or dependent enrollment paid by employee at a group rate</li><li>50% company contribution towards Vision coverage</li><li>Tuition reimbursement (up to $5,250 per year)</li><li>401(k) matching program: company match 100% of your deferrals up to 3% of your compensation, plus 50% of your deferrals over 3% not exceeding 5% of your compensation</li><li>100% employer paid Short-Term Disability with employee buy up options</li><li>100% employer paid Life Insurance Coverage with employee buy up options</li><li>Paid Parental Leave</li><li>Holiday Pay</li><li>Sick Pay</li><li>Vacation Pay</li><li>Company Computer</li><li>Company Cell Phone</li><li>Bonuses and Commission may apply</li></ul>", "postedDate": "2 months ago", "skills": [], "benefits": "100% coverage of health benefits including Medical and Dental with optional family and/or dependent enrollment paid by employee at a group rate\n50% company contribution towards Vision coverage\nTuition reimbursement (up to $5,250 per year)\n401(k) matching program: company match 100% of your deferrals up to 3% of your compensation, plus 50% of your deferrals over 3% not exceeding 5% of your compensation\n100% employer paid Short-Term Disability with employee buy up options\n100% employer paid Life Insurance Coverage with employee buy up options\nPaid Parental Leave\nHoliday Pay\nSick Pay\nVacation Pay\nCompany Computer\nCompany Cell Phone\nBonuses and Commission may apply", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3947298022"}