{"jobTitle": "Category Manager, Global Product Sourcing (Packaging)", "company": {"name": "Herbalife", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "128,260.00 to 143,660.00 USD Annually", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Wellness and Fitness Services", "description": "<strong>Overview<br/><br/></strong><strong>THE ROLE: <br/><br/></strong>The Category Manager, Global Product Sourcing will be responsible for managing global categories of direct spend across all regions (Americas, Europe, India, China and Asia Pacific). As the corporate expert for specific global packaging direct categories, this person will be the point person for supplier communication, pricing, contracts, and strategic commodity supply decision making. The individual selected for this position will lead cross-functional teams and projects for 2-3 global categories to maximize total value, generate supply-chain efficiencies, manage the relationships with strategic supplier partners and introduce supplier innovation and technologies across all Herbalife business units.<br/><br/>In addition, this role will be expected to utilize his/her knowledge to enhance and leverage Herbalife's buying power to source materials required for Herbalife's products at a competitive rate and streamline material use across key finished goods suppliers.<br/><br/><strong>HOW YOU WOULD CONTRIBUTE: <br/><br/></strong><ul><li>Lead global cross-functional packaging focused teams on integrating and optimizing the global supply chain for complex categories or commodity groups across world-wide locations. </li><li>Drive long term strategies for global, cross-functional teams to generate supply chain improvement and efficiencies through the optimization of processes, designs, materials, and suppliers. </li><li>Reduce cost on a regular basis and be accountable for realizing $500M - $1MM in related cost savings or cost avoidance per calendar year. </li><li>Develop global business plans and multi-year strategies with key strategic supplier partners to foster product and supply chain innovation and proactively introduce new technologies utilizing key global partners and prospects’ full capabilities. </li><li>Support Research &amp; Development through conceptualization and development of new products by providing formula component costing, commodity expertise and supply chain risk assessments. </li><li>Negotiate and executes supply agreements with favorable terms to Herbalife. </li><li>Track market conditions for key commodities and work proactively with suppliers and with finished goods manufacturers to minimize potential cost increases and realize potential cost savings. </li><li>Access and engage executive level contacts at suppliers garnering support for mutual global supply chain initiatives and objectives. </li><li>Lead two-way communication with suppliers in global categories to ensure challenges and issues receive appropriate response and resolution. </li><li>Conduct the supplier segmentation process and negotiate global alignment to leverage spend within the multi-year global commodity strategy. </li><li>Close partnership with Packaging Engineering, ESG, Quality, R&amp;D, Marketing, CI, and Operations. <br/><br/><br/></li></ul><strong>WHAT’S SPECIAL ABOUT THE TEAM: <br/><br/></strong>The Global Product Sourcing team is newly rebranded and reorganized to leverage global category management and category expertise. Working with a team of over 50+ Direct Sourcing colleagues around the world, the team is focused to identify the best opportunity to source for any region, delivering incremental value and external innovation back to the brand and customer. With true global sourcing scale and responsibility, we concentrate to sync process and encourage regular collaboration to source the best Products at a global scale.<br/><br/><strong>Qualifications<br/><br/></strong><strong>SKILLS AND BACKGROUND REQUIRED TO BE SUCCESSFUL: <br/><br/></strong><ul><li>7 years of purchasing and procurement experience, of which at least 2 years is specifically in sourcing or category management. </li><li>Experience working in a fast-paced environment managing multiple projects concurrently. </li><li>Demonstrated record of exceeding goals in cost savings and supplier performance. </li><li>Experience working in an environment where Sourcing is an influencer rather than a decision maker. </li><li>Strong understanding of Sourcing best practices and strategies to execute opportunities for cost savings, risk mitigation and innovation. </li><li>Strong strategic and analytical skills to develop complex, multi-year strategic business plans for innovation in global categories. </li><li>Well-developed understanding of contract development and negotiation. <br/><br/><br/></li></ul><strong>EDUCATION<br/><br/></strong><ul><li>B.S. Degree in Business, Accounting, Finance, Supply Chain Management or related field<br/><br/><br/></li></ul>At Herbalife, we value doing what’s right. We are proud to be an equal opportunity employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected characteristic. We value diversity, strive for inclusivity, and believe the differences among our teammates is a key contributor to Herbalife’s ongoing success.<br/><br/>Herbalife offers a variety of benefits to eligible employees in the U.S. (limited to the 50 States and the District of Columbia), which includes Group Health Programs, other Voluntary Benefit Programs, and Paid Time Off. Group Health Programs include Medical, Dental, Vision, Health Savings Account (HSA), Flexible Spending Accounts (FSA), Basic Life/AD&amp;D; Short-Term and Long-Term Disability and an Employee Assistance Program (EAP).<br/><br/>Other Voluntary Benefit Programs include a 401(k) plan, Wellness Incentive Program, Employee Stock Purchase Plan (ESPP), Supplemental Life/Critical Illness/Hospitalization/Accident Insurance, and Pet Insurance. Paid time off includes Company-observed U.S. Holidays, Floating Holidays, Vacation, Sick Time, a Volunteer Program, Paid Maternity and Paternity Leave, Bereavement Leave, Personal Leave and time off for voting.<br/><br/>If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please email your request to [email protected].<br/><br/>Hiring Range: 128,260.00 to 143,660.00 USD Annually<br/><br/>", "responsibilities": "<ul><li>Lead global cross-functional packaging focused teams on integrating and optimizing the global supply chain for complex categories or commodity groups across world-wide locations. </li><li>Drive long term strategies for global, cross-functional teams to generate supply chain improvement and efficiencies through the optimization of processes, designs, materials, and suppliers. </li><li>Reduce cost on a regular basis and be accountable for realizing $500M - $1MM in related cost savings or cost avoidance per calendar year. </li><li>Develop global business plans and multi-year strategies with key strategic supplier partners to foster product and supply chain innovation and proactively introduce new technologies utilizing key global partners and prospects’ full capabilities. </li><li>Support Research &amp; Development through conceptualization and development of new products by providing formula component costing, commodity expertise and supply chain risk assessments. </li><li>Negotiate and executes supply agreements with favorable terms to Herbalife. </li><li>Track market conditions for key commodities and work proactively with suppliers and with finished goods manufacturers to minimize potential cost increases and realize potential cost savings. </li><li>Access and engage executive level contacts at suppliers garnering support for mutual global supply chain initiatives and objectives. </li><li>Lead two-way communication with suppliers in global categories to ensure challenges and issues receive appropriate response and resolution. </li><li>Conduct the supplier segmentation process and negotiate global alignment to leverage spend within the multi-year global commodity strategy. </li><li>Close partnership with Packaging Engineering, ESG, Quality, R&amp;D, Marketing, CI, and Operations. <br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>7 years of purchasing and procurement experience, of which at least 2 years is specifically in sourcing or category management. </li><li>Experience working in a fast-paced environment managing multiple projects concurrently. </li><li>Demonstrated record of exceeding goals in cost savings and supplier performance. </li><li>Experience working in an environment where Sourcing is an influencer rather than a decision maker. </li><li>Strong understanding of Sourcing best practices and strategies to execute opportunities for cost savings, risk mitigation and innovation. </li><li>Strong strategic and analytical skills to develop complex, multi-year strategic business plans for innovation in global categories. </li><li>Well-developed understanding of contract development and negotiation. <br/><br/><br/></li></ul>", "preferred": "<ul><li>B.S. Degree in Business, Accounting, Finance, Supply Chain Management or related field<br/><br/><br/></li></ul>"}, "skills": ["Sourcing", "Category Management", "Supply Chain Management", "Procurement", "Negotiation", "Strategic Planning", "Cost Reduction", "Supplier Management", "Risk Mitigation", "Innovation"], "postedDate": "1 week ago", "benefits": "Herbalife offers a variety of benefits to eligible employees in the U.S. (limited to the 50 States and the District of Columbia), which includes Group Health Programs, other Voluntary Benefit Programs, and Paid Time Off. Group Health Programs include Medical, Dental, Vision, Health Savings Account (HSA), Flexible Spending Accounts (FSA), Basic Life/AD&amp;D; Short-Term and Long-Term Disability and an Employee Assistance Program (EAP).<br/><br/>Other Voluntary Benefit Programs include a 401(k) plan, Wellness Incentive Program, Employee Stock Purchase Plan (ESPP), Supplemental Life/Critical Illness/Hospitalization/Accident Insurance, and Pet Insurance. Paid time off includes Company-observed U.S. Holidays, Floating Holidays, Vacation, Sick Time, a Volunteer Program, Paid Maternity and Paternity Leave, Bereavement Leave, Personal Leave and time off for voting.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3947662411"}