{"jobTitle": "Director, Global HR Compliance", "company": {"name": "FDH Aero", "location": "Commerce, CA", "industry": "Aviation and Aerospace Component Manufacturing"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources", "industry": "Aviation and Aerospace Component Manufacturing", "description": "FDH Aero is a trusted global supply chain partner for aerospace and defense companies. With more than 55 years of experience, it specializes in c-class components that include hardware, electrical, chemical, and consumable products and services for global OEM and aftermarket customers. At FDH Aero, we understand that the strength of our brand comes from our people, and our culture empowers every team member to contribute and grow. As a global team, our culture is rooted in five (5) core values that begin with the words “We are” and include: service-first, respectful, amplifiers, open-minded and accountable.<br/><br/>FDH Aero is headquartered in Commerce, California, and has operations across the Americas, EMEA and APAC. FDH Aero has locations in 14 countries across the globe, with more than 1,200 best-in-industry employees and over 650,000 square feet of inventory space.<br/><br/>For more information, please visit the FDH Aero website .<br/><br/>FDH Aero is a leading aerospace, supply chain, and defense company with a global footprint. We are seeking a seasoned and dynamic Director of Global HR Compliance to oversee compliance initiatives across the Americas, EMEA (Europe, Middle East, and Africa), UK, and APAC (Asia-Pacific) regions. As the Director of Global HR Compliance, you will play a pivotal role in ensuring that our HR policies and practices align with legal requirements and industry standards across diverse geographical locations.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Develop and implement a comprehensive global HR compliance strategy that addresses regulatory requirements, industry standards, and company policies. Collaborate with senior leadership to integrate compliance considerations into strategic business decisions</li><li>Provide oversight and guidance on HR compliance matters for the Americas, EMEA, UK, and APAC regions. Stay abreast of legislative changes and emerging trends in each region to ensure proactive compliance measures</li><li>Lead the development, review, and implementation of HR policies and procedures to ensure compliance with relevant laws and regulations in all jurisdictions where FDH Aero operates. Partner with HR and legal teams to address compliance gaps and mitigate risks</li><li>Develop and deliver training programs and communication initiatives to enhance awareness of HR compliance requirements among employees and managers globally. Ensure that training materials are tailored to regional nuances and languages as needed</li><li>Establish and maintain processes for conducting regular audits and monitoring activities to assess HR compliance effectiveness. Identify areas of improvement and implement corrective actions as necessary</li><li>Oversee investigations into HR compliance violations, including discrimination, harassment, and misconduct allegations. Develop and implement remediation plans to address identified issues and prevent recurrence</li><li>Ensure compliance with data privacy and security regulations, including GDPR, CCPA, and other relevant laws governing the collection, use, and protection of employee data. Collaborate with IT and legal teams to implement data privacy safeguards and incident response protocols</li><li>Evaluate and manage relationships with third-party vendors, including background check providers, HR technology vendors, and legal consultants, to ensure compliance with contractual obligations and regulatory requirements</li><li>Partner with HR, legal, IT, finance, and other departments to address cross-functional compliance issues and initiatives. Foster a culture of compliance and ethical behavior throughout the organization</li><li>Prepare regular reports and presentations for senior leadership and regulatory agencies on HR compliance activities, trends, and risks. Maintain accurate documentation of compliance efforts and outcomes</li><li>Performs other duties as needed<br/><br/></li></ul>Basic Qualifications<br/><br/>\n<ul><li>Bachelor's degree in Human Resources, Business Administration, Legal Studies, or related field; advanced degree preferred</li><li>10+ years of progressive experience in HR compliance, with at least 5 years in a global leadership role</li><li>In-depth knowledge of HR laws and regulations across the Americas, EMEA, UK, and APAC regions</li><li>Strong understanding of data privacy and security regulations, including GDPR and CCPA</li><li>Demonstrated experience developing and implementing HR policies, training programs, and compliance controls</li><li>Excellent communication, interpersonal, and leadership skills, with the ability to influence and collaborate across diverse stakeholders</li><li>Proven track record of effectively managing compliance investigations, audits, and remediation efforts</li><li>Certification in HR (e.g., SHRM-SCP, SPHR) or Compliance (e.g., CCEP) is a plus</li><li>Must be able to travel</li><li>A strong understanding of employment laws and regulations across different regions, including the Americas, EMEA, UK, and APAC, is essential. This includes familiarity with labor laws, anti-discrimination laws, data privacy regulations (e.g., GDPR, CCPA), and other relevant legislation</li><li>The ability to navigate and understand the nuances of HR compliance requirements in diverse international markets is crucial. This includes cultural awareness, sensitivity to regional differences, and the ability to tailor compliance strategies accordingly</li><li>Must be able to develop and implement a strategic compliance framework that aligns with the organization's goals and objectives</li><li>This involves anticipating future compliance challenges, identifying emerging trends, and proactively addressing potential risks</li><li>As a senior leader within the HR function, the Director of Global HR Compliance must have strong leadership abilities to inspire and guide cross-functional teams. This includes the capacity to influence stakeholders at all levels of the organization and drive a culture of compliance and ethical behavior</li><li>The ability to analyze complex compliance issues, identify root causes, and develop effective solutions is essential</li><li>The Director of Global HR Compliance must be able to make informed decisions under pressure and navigate ambiguous situations with confidence.</li><li>Clear and effective communication is critical for conveying compliance requirements, training employees, and reporting on compliance activities to senior leadership and regulatory authorities </li><li>Should be able to communicate complex concepts in a clear and concise manner to a diverse audience</li><li>Given the importance of compliance in HR processes, meticulous attention to detail is necessary to ensure that policies, procedures, and practices align with legal requirements and industry standards. This includes thorough documentation and record-keeping practices.<br/><br/></li></ul>FDH Aero  is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.", "postedDate": "3 months ago", "skills": ["HR Compliance", "Global HR", "Compliance Strategy", "HR Policies", "Data Privacy", "GDPR", "CCPA", "HR Audits", "Compliance Investigations", "HR Training", "Leadership", "Communication", "International HR", "Employment Law", "Labor Law", "Anti-Discrimination", "Compliance Management", "Risk Management", "Stakeholder Management", "Strategic Planning", "Problem Solving", "Decision Making", "Attention to Detail", "Documentation", "Record Keeping"], "url": "https://www.linkedin.com/jobs/view/3947922558"}