{"jobTitle": "Executive Assistant to CEO - Start-Up", "company": {"name": "Skylus Organization", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000 to $100,000", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Technology, Information and Internet", "description": "The Skylus Organization is the personal office of Mr. Jay Skylus. Skylus Organization has a phenomenal opportunity for a seasoned Executive Assistant to the CEO (EA). This is a full-time on-site opportunity in Long Beach, California. The EA is a generalist who performs day-to-day administrative and operations responsibilities on behalf of the CEO and serves as the primary point of contact for the CEO. The Skylus Organization oversees multiple, high growth early stage ventures. Therefore, the most successful candidates will have prior experience in a start-up environment. The EA will have strong professional verbal and written communication skills, conduct, and significant real-world experience supporting high performance founders or c-level executives. You will use your expertise, diligence, \"can do\" attitude, and organizational skills to leverage the CEO's time. As the Executive Assistant to the CEO, you understand the high stakes nature of early stage startups. You have a high degree of emotional intelligence and excellent interpersonal skills to navigate dynamic environments in real-time with utmost professionalism. The organization's operations require domestic (frequently during crunch periods to meet customer deadlines) and occasional international travel. The EA must be willing to travel, sometimes on short notice.", "responsibilities": "Serve as the primary point of contact for all matters pertaining to the CEO including those of a highly confidential or critical nature. Prioritize and determine appropriate course of action, referral, or response, exercising judgement to reflect CEO's preferences. Provide \"gatekeeper\" and \"gateway\" role, providing a bridge for smooth communication between the CEO and staff, demonstrating leadership to maintain credibility, trust, and support with the executive management team. Relentlessly manage the CEO's time. Organize and maintain the calendar, appointments, action items and support the CEO by informing him of all commitments and responsibilities. Follow up on behalf of the CEO, when appropriate. Work closely with the CEO to keep him well informed of upcoming commitments and responsibilities, following up appropriately. Act as a \"barometer,\" having a sense for the issues taking place in the environment and keeping the CEO updated. Anticipate CEO's needs in advance of meetings, conferences, etc. Arrange travel, travel plans, itineraries, agendas, visas and accommodation and ensure that all relevant documents are available for travel related activities. Research, compile, organize, graph, and accurately portray information. Plan and coordinate Executive Team meetings, retreats, staff meetings, and company events, as assigned. Support HR initiatives and recruiting events, as requested. Create and present presentations as assigned. Perform special projects as directed. Perform administrative, operational, and office management responsibilities. Assist with other administrative duties, as required. Assist with personal appointments and errands.", "qualifications": {"required": "Bachelor's degree or equivalent. Ability to travel for work related matters. Ability to maintain confidentiality, tact, and discretion regarding all matters relating to CEO and business operations. Proficiency in Microsoft Office and G Suite. Is a quick study and has the ability to develop situational awareness with limited information. Ability to complete a high volume of scheduling, event coordination, tasks, and projects. Ability to be flexible with regards to work setting. Ability to perform at a high level when working in the office, at home, or on the road during times of travel. Ability to react with appropriate levels of urgency to situations and events that require quick response or turnaround. Ability to perform and track multiple tasks/priorities without losing focus. General availability (nights/weekends) for time urgent matters, emergencies, such as scheduling, or time-sensitive tasks (i.e. rebooking missed flights, last-minute VIP visit coordination, etc.) Ability to travel domestically and internationally, as needed to support CEO during meetings, conferences, etc.", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Performance-based promotions and/or bonuses, no minimum time requirement for promotions. Insurance - Health, Dental, Vision. Vacation, PTO, and Holiday Pay. Stock Incentive Opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3947795481"}