{"jobTitle": "Compliance Analyst", "company": {"name": "South Bay Workforce Investment Board", "industry": "Human Resources", "size": "Not specified", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$25.03 - $31.19 per hour", "currency": "USD"}, "jobFunction": "Legal", "industry": "Human Resources", "description": "The South Bay Workforce Investment Board, Inc. (SBWIB, Inc.) is seeking a diligent and detail-oriented Compliance Analyst to join our Contracts team. The ideal candidate will have prior experience in contract management, possess strong analytical skills, and exhibit a keen attention to detail. They should also demonstrate the ability to implement and enforce policies, procedures, and contracts effectively. The primary responsibility of the Compliance Analyst will be to oversee training providers and ensure that their documents and contracts are current and compliant with legislative requirements. Additionally, they will play a key role in aligning these efforts with our company goals.", "responsibilities": "Under the direction of the Compliance Manager, the duties of the Compliance Analyst include, but are not limited to, the following: Assist in the preparation and review of training provider contract proposals for public institutions, for-profit vocational schools, and non-profit organizations. Ensure that training provider proposals are properly evaluated based on SBWIB criteria. Secure necessary approvals and ensure that the standard procedures are followed. Conduct site evaluations of new training providers. Conduct monitoring evaluation visits of approved training providers to ensure continued compliance with SBWIB criteria and with state, federal, and local laws. Assist in resolving complaints and issues related to contract performance. Draft and negotiate contracts for all assigned training providers. Ensure that files are maintained with required documents for all assigned training providers. Maintain online databases (ETPL and I-TRAIN) of training providers, including entering, reviewing, and updating data of approved sites and training programs for assigned training providers. Assist potential training providers via phone, email, or in person to assist in completing contract proposals. Compile quarterly activity reports for assigned training providers. Provide clerical support to the Compliance Department as necessary. Other duties as assigned.", "qualifications": {"required": "Graduation from an accredited college with a degree in Business Administration or a related field, At least 2 years of professional experience in contracts, workforce development, or a related field, Strong analytical and organizational skills, Effective communication, writing, and reading abilities, Proficiency in administrative procedures and various computer applications and programs, Ability to work collaboratively and positively with others, Capacity to manage multiple tasks and projects efficiently, Capability to perform well under pressure and meet deadlines, Possession of a valid driver’s license, Reliable transportation with current vehicle insurance, Successful completion of background and reference clearances, Adherence to all safety protocols enforced by the Company.", "preferred": "or any satisfactory combination of experience and training which demonstrates the knowledge, skills and abilities to perform the below duties (education may be substituted by experience on a year-for-year basis)."}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "This is a full-time, nonexempt position (40 hours/week), generally with a starting wage of $25.03 - $31.19 per hour, commensurate with experience. Our Company offers a comprehensive employee benefits package, which includes 75% health cost reimbursement (for employee only), sick and vacation time, holidays and a competitive 401k plan. Employer is eligible for student loan forgiveness (PSLF). All full-time employees are invited to participate in the company’s health benefits package after completing the 60-90-day employment introductory period.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3947842239"}