{"jobTitle": "Attorney (Leadership Rotation Program)", "company": {"name": "Atticus", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Law Practice", "description": "About Atticus<br/><br/>At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it.<br/><br/>Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.<br/><br/>We've helped more than 20,000 people in need (see our 6,000+ five-star reviews) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We just closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 52 to 91 last year and we expect to grow again in 2024.<br/><br/>The Job<br/><br/>We hire smart lawyers and set them loose on hard problems — most of which have nothing to do with traditional legal practice.<br/><br/>Because legal expertise and lawyer relationships are deeply embedded in everything we do, we’ve found that attorneys thrive here in roles most startups would never give them: building digital products, leading customer service teams, running sales, setting strategy, among others. So we hire great folks and empower them. Over the last two years, we’ve attracted lawyers from firms like Munger Tolles, Hueston Hennigan, Quinn Emanuel, Gunderson Dettmer, and Cravath — and schools like Harvard, Stanford, UChicago, and UVA. Most have been promoted once or twice already and play critical roles across all functions.<br/><br/>As a result, we created the Attorney Leadership Rotation Program: a role that allows attorneys to transition from traditional legal practice to the business and technology sectors, gain exposure and experience across core parts of our business, and take ownership for company priorities. In your first year you will design and shape your own rotations through 3-4 areas across Atticus, creating a portfolio of projects that could include product design, legal research and opinion writing, serving clients, and providing legal advice.<br/><br/>Options for this first year could include:<br/><br/><ul><li>Client service &amp; experience: Intake, advise and refer our clients; provide legal advice to dozens of needy people every week, and handle complex situations requiring prudent judgment (we’ll provide all the training you need). </li><li>Lawyer sales &amp; management: Vet, sell, and onboard our partner law firms; track their compliance with service level agreements and provide coaching and feedback to strengthen their operations. </li><li>Direct representation: Own all aspects of disability cases from intake to hearing, developing evidence, working with clients, and winning them benefits. </li><li>Privacy compliance strategy: Research, refine, and defend our regulatory compliance strategy; work with teams across the company to develop and implement risk mitigation plans. <br/><br/></li></ul>After your first year you will specialize and lead any number of key business priorities. You will work with our leadership team to identify where your path goes next, but it could include:<br/><br/><ul><li>Launching a new field of law and managing its profit &amp; loss</li><li>Building and managing a new offering for lawyers (e.g., a CLE program)</li><li>Transitioning to a leadership role such as General Manager, Managing Attorney, or Deputy General Counsel</li><li>Specializing in any of the above departments and functions<br/><br/></li></ul>This program is a unique opportunity to do meaningful social impact work as an attorney in a rapidly scaling startup with smart and caring coworkers where we put a premium on work-life balance. Your path from here could include growing as an executive at Atticus or transitioning further into tech/business as a founder or executive.<br/><br/>Qualifications<br/><br/>Required:<br/><br/><ul><li>You have 3-5 years of experience at a top law firm, government agency, or non-profit where you exhibited a track record of achievement. </li><li>You have a degree from a top law school where you demonstrated strong academic performance and are admitted to at least one state bar. </li><li>You are comfortable in a variety of interpersonal conversations; you can be empathetic and kind when speaking with average people in a moment of crisis, and can be thoughtful and organized when interacting with other attorneys. </li><li>You are a resourceful team-player ready to dive into a scrappy startup environment where you will get your hands dirty; you’re eager to take on tasks ranging from strategic priorities to tactical necessities. </li><li>You excel at building strong relationships and working with teams across a company. </li><li>You have a demonstrated commitment to doing good and helping people. <br/><br/></li></ul>Bonus / Nice-to-Have:<br/><br/><ul><li>You have several years of meaningful work experience prior to attending law school, especially in business environments. </li><li>You have experience at a startup or other fast-paced, agile environment. <br/><br/></li></ul>We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech or law, we’d love to meet you.<br/><br/>Salary And Benefits<br/><br/>This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture. We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.<br/><br/>We offer competitive pay — including equity — and generous benefits:<br/><br/><ul><li>Medical and dental insurance with 100% of employee premiums covered</li><li>15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)</li><li>Free membership to OneMedical</li><li>$1,000 reimbursable stipend for education and training outside of work</li><li>Student loan repayment assistance, 401(k), and optional HSA</li><li>Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</li><li>Humble, thoughtful, smart, fun colleagues</li><li>Paid parental leave<br/><br/></li></ul>We anticipate a base salary of $150,000 in addition to equity and benefits.<br/><br/>Location<br/><br/>This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.<br/><br/>", "responsibilities": "In your first year you will design and shape your own rotations through 3-4 areas across Atticus, creating a portfolio of projects that could include product design, legal research and opinion writing, serving clients, and providing legal advice.<br/><br/>Options for this first year could include:<br/><br/><ul><li>Client service &amp; experience: Intake, advise and refer our clients; provide legal advice to dozens of needy people every week, and handle complex situations requiring prudent judgment (we’ll provide all the training you need). </li><li>Lawyer sales &amp; management: Vet, sell, and onboard our partner law firms; track their compliance with service level agreements and provide coaching and feedback to strengthen their operations. </li><li>Direct representation: Own all aspects of disability cases from intake to hearing, developing evidence, working with clients, and winning them benefits. </li><li>Privacy compliance strategy: Research, refine, and defend our regulatory compliance strategy; work with teams across the company to develop and implement risk mitigation plans. <br/><br/></li></ul>After your first year you will specialize and lead any number of key business priorities. You will work with our leadership team to identify where your path goes next, but it could include:<br/><br/><ul><li>Launching a new field of law and managing its profit &amp; loss</li><li>Building and managing a new offering for lawyers (e.g., a CLE program)</li><li>Transitioning to a leadership role such as General Manager, Managing Attorney, or Deputy General Counsel</li><li>Specializing in any of the above departments and functions<br/><br/></li></ul>", "qualifications": {"required": "You have 3-5 years of experience at a top law firm, government agency, or non-profit where you exhibited a track record of achievement. \nYou have a degree from a top law school where you demonstrated strong academic performance and are admitted to at least one state bar. \nYou are comfortable in a variety of interpersonal conversations; you can be empathetic and kind when speaking with average people in a moment of crisis, and can be thoughtful and organized when interacting with other attorneys. \nYou are a resourceful team-player ready to dive into a scrappy startup environment where you will get your hands dirty; you’re eager to take on tasks ranging from strategic priorities to tactical necessities. \nYou excel at building strong relationships and working with teams across a company. \nYou have a demonstrated commitment to doing good and helping people. <br/><br/>", "preferred": "You have several years of meaningful work experience prior to attending law school, especially in business environments. \nYou have experience at a startup or other fast-paced, agile environment. <br/><br/>"}, "skills": [], "postedDate": "2 months ago", "benefits": "Medical and dental insurance with 100% of employee premiums covered\n15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)\nFree membership to OneMedical\n$1,000 reimbursable stipend for education and training outside of work\nStudent loan repayment assistance, 401(k), and optional HSA\nFree snacks, drinks, weekly lunches, and regular team dinners/events/retreats\nHumble, thoughtful, smart, fun colleagues\nPaid parental leave<br/><br/>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3947619986"}