{"jobTitle": "Sr. Account Executive - Influencer Marketing", "company": {"name": "Creator Deck", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$80,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Creator Deck is a modern marketing and media company. Launched in 2008, we are pioneers in the high growth influencer industry, serving some of the most prestigious brands in apparel, beauty, beverage, and arts. We are guided by our core values: to Show Care, Build Credibility, Make an Impact, Think Towards the Future, and Be Genuine.\n\nTHE TEAM\n\nCreator Deck was founded to create an authentic, fair, empathetic, and diverse space for creativity and collaboration. These elements have remained core to us as we’ve grown. We look for people who can think disruptively and meet challenges with a fierce creative spirit. Our team unites a diverse group of people from various backgrounds, who enjoy the collaborative, creative processes that go into making anything - from a single post, to a comprehensive marketing strategy, to a fully fledged brand.\n\nThe Sr. Account Executive plays a pivotal role in orchestrating, managing, and leading projects across our various brand partners to ensure the continued success and health of those accounts as well as serving as one of our key client facing thought leader within the business. This multifaceted position involves overseeing talent partnerships, coordinating campaigns, ensuring brand alignment, optimizing campaign performance, leading strategy development and execution with key stakeholders.", "responsibilities": "Driving ongoing strategic solutions beyond campaign success and leading discussions with larger teams and clients in a confident way (lead decision-making based on the big picture and client business priorities, KPIs and overarching client goals; driving discussion and feedback with client; leading own team to execute on any strategy shifts). Strong independent problem-solving skills, applying own skills and knowledge to enhance customer engagements. Act as consult for planning strategy (such as: assessing timelines, deliverables, flagging any concerns or dependencies that may impact the campaign). Maintain constant communication with clients, providing updates, addressing queries, and ensuring campaign expectations are met. Provide comprehensive and timely updates to internal and external teams, handling status calls, and preparing reports. Proactively suggest new approaches, brainstorm innovative ideas, and stay updated on industry trends. Successful execution of multi-campaign scope with overarching YoY strategy components which requires a team. Execute and manage multiple influencer campaigns, maintaining deadlines, content quality, and communication with talent and internal/external teams. Source and recommend talent, building lists tailored to campaign objectives and niche requirements. Monitor campaign performance, compile data, and derive actionable insights for campaign optimization and reporting. Act as a primary contact for talent, addressing inquiries, facilitating content creation, triaging crisis, and ensuring satisfaction for both parties. Develop trend-driven briefs, aligning product focus with current market trends for influencer content. Helping to complete RFPs and aiding in the development of strategies and execution of new business opportunities. Maintain organized platforms and documentation for project tracking and content repository. Handle miscellaneous tasks such as product shipment coordination, report vetting, and data management. Jumping in on ad hoc requests and projects as they come in.", "qualifications": {"required": "A passion for the influencer + social space - particularly the fashion and beauty space! Proficiency in managing timelines, tracking budgets, and multitasking across simultaneous campaigns. Excellent communication skills for effective client interactions, team collaboration, and talent management. Analytical and strategic mindset to derive actionable insights from campaign performance data. Adaptability, attention to detail, and a proactive approach to problem-solving. Familiarity with industry tools/platforms is beneficial.", "preferred": "Not specified"}, "skills": ["Strategic thinking", "Client relations", "Campaign management", "Problem-solving", "Communication", "Analytical skills"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Medical (Kaiser), Dental and Vision (Beam) insurance. We cover 100% premium so there is no out-of-pocket cost for you. For a spouse and/or dependents, we pay for 50% coverage. 50k Life Insurance. We covered 100% of the employee’s cost. Voluntary Life Insurance (additional). FSA. Open Time Off Policy. 401K (beginning 3 months after start date).", "remoteWork": "Fully remote, but candidates must be located within California, Texas, New York, New Jersey, Nevada, or Arizona.", "url": "https://www.linkedin.com/jobs/view/3948895169"}