{"jobTitle": "Administrative Assistant (HR / Finance)", "company": {"name": "3 Arts Entertainment", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00-25.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "Talent management company 3 Arts Entertainment seeks a proactive and detail-oriented Administrative Assistant to support the operations department. This role will report to the HR Manager and the Controller, and will support executives with scheduling, coordinating, maintaining records, and other administrative tasks. The ideal candidate will have excellent communication, organizational, and prioritization skills. This is a great opportunity for an administrative professional to gain entertainment industry experience in a fast-paced and inclusive company culture.\n\nResponsibilities\n\n* Handle and coordinate active calendars\n* Schedule and confirm meetings\n* Answer phones and direct as needed\n* Organize files and manage data/records retention\n* Assist HR-related tasks such as benefits registration and recruiting\n* Support employee onboarding and offboarding\n* Other administrative tasks as assigned\n\n\nQualifications\n\n* Bachelor's degree or equivalent experience\n* Strong interpersonal, customer service and communication skills\n* Ability to multitask\n* Proficient in Microsoft Office suite\n\n\nThe compensation for this role is $20-25 per hour depending on education and experience. 3 Arts also offers a generous PTO package and outstanding health insurance coverage.", "responsibilities": "Handle and coordinate active calendars, Schedule and confirm meetings, Answer phones and direct as needed, Organize files and manage data/records retention, Assist HR-related tasks such as benefits registration and recruiting, Support employee onboarding and offboarding, Other administrative tasks as assigned", "qualifications": {"required": "Bachelor's degree or equivalent experience, Strong interpersonal, customer service and communication skills, Ability to multitask, Proficient in Microsoft Office suite", "preferred": ""}, "skills": ["Microsoft Office"], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "The compensation for this role is $20-25 per hour depending on education and experience. 3 Arts also offers a generous PTO package and outstanding health insurance coverage.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948079956"}