{"jobTitle": "Front Desk Manager", "company": {"name": "Gold's Gym", "industry": "Wellness and Fitness Services", "size": "51-200 employees", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Other", "industry": "Wellness and Fitness Services", "description": "If you are passionate about fitness and a person who wants to change lives every day for an UNBELIEVABLE company then keep reading! Gold’s Gym Socal and its affiliated clubs are growing fast and looking for an hourly Front Desk Manager to help our teams to provide world-class service for our members by utilizing in-depth knowledge of company products and programs. We’ll challenge your skills, talents, and abilities and reward your every success. Here is just some of the benefits you will get by being a Gold’s Gym SoCal employee: Work in a fun environment with great people, Great benefits package, John Hancock 401k, Aflac supplemental insurance options, free gym memberships, and discounts, Opportunities to grow within the company. What sets us apart from the rest: Dedication to our members’ successes and goals, Integrity which creates life-long relationships, Passion for people in the communities we serve, Pride in what we do and who we are, Leadership development (ongoing), Excellence in execution, But most of all…. we are more than a gym; we are a family! We want talented individuals who: Have a positive, upbeat, and outgoing attitude, Are passionate about hospitality and excellence for our members, Can work in a dynamic, fast-paced, goal-oriented environment without sacrificing quality of service, Have fitness industry experience (preferred), Love to constantly learn and grow. When you come to work you’ll: Manage Operations team to ensure policies and procedures are followed at all times, Hires, trains and supervises operations team members for the front desk, Kids Club and Housekeeping Associates, Serves as Liaison with Corporate Customer Care Department assisting General Manager with member and/or operational issues, Responsible for control of cash deposit with GM sign off ensuring daily deposits are made on time, Serves as Liaison with cleaning team daily to ensure proper level of cleanliness maintained at all times including daily management of the cleaning checklists, Works in cooperation with GM to manage/process cancellations following procedures in place to retain member, Assists GM with management of Medallia to ensure all members concerns are addressed in a timely manner, Assists GM with bi-weekly payroll to ensure all missed punches are corrected and submitted on time with payroll signed off by the indicated deadline, Enforces all club rules, policies and promotes proper execution of all procedures, Keep the club fully staffed thorough review of applications, interviewing making hiring recommendations to the general manager, Manage membership questions, concerns, and inquiries for their facility, Train staff to be the face of the club by providing hospitality to all members and guests, Lead by example, Conduct weekly meetings with direct reports to review performance and offer direction, inspiration, and guidance toward achieving individual and club goals. There are some MUST HAVES: Ability to use sound business judgment and have strong analytical skills, Ability to effectively communicate with constituents, Effective listening skills, Effective delegation and follow-up skills, Effective planning and organization skills, Demonstrates ability to create a positive environment, Demonstrates willingness and openness for self-development, Ability to identify and use resources to improve overall operations, Strong leadership qualities coupled with excellent motivational, communication, and team-building skills will make you an ideal candidate for this position. College degree preferred, Current CPR Certification is required. This role requires the ability to move and lift up to 25 lbs. Standing or walking for extended periods of time and ensuring a professional demeanor, clear communication, and appearance in a clean uniform are also required. ASK YOURSELF IF YOU HAVE WHAT IT TAKES….. COME BE APART OF THE FAMILY LEGACY TODAY! We Celebrate Everyone!! Gold’s Gym SoCal and all it’s affiliated clubs are an equal opportunity employer. We are proud of our diversity and are committed to creating an inclusive environment for all employees, applicants, vendors, and members alike. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.", "responsibilities": "Manage Operations team to ensure policies and procedures are followed at all times, Hires, trains and supervises operations team members for the front desk, Kids Club and Housekeeping Associates, Serves as Liaison with Corporate Customer Care Department assisting General Manager with member and/or operational issues, Responsible for control of cash deposit with GM sign off ensuring daily deposits are made on time, Serves as Liaison with cleaning team daily to ensure proper level of cleanliness maintained at all times including daily management of the cleaning checklists, Works in cooperation with GM to manage/process cancellations following procedures in place to retain member, Assists GM with management of Medallia to ensure all members concerns are addressed in a timely manner, Assists GM with bi-weekly payroll to ensure all missed punches are corrected and submitted on time with payroll signed off by the indicated deadline, Enforces all club rules, policies and promotes proper execution of all procedures, Keep the club fully staffed thorough review of applications, interviewing making hiring recommendations to the general manager, Manage membership questions, concerns, and inquiries for their facility, Train staff to be the face of the club by providing hospitality to all members and guests, Lead by example, Conduct weekly meetings with direct reports to review performance and offer direction, inspiration, and guidance toward achieving individual and club goals.", "qualifications": {"required": "Current CPR Certification is required.", "preferred": "Fitness industry experience (preferred)"}, "skills": ["Management", "Leadership", "Customer Service", "Communication", "Team Building"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Great benefits package, John Hancock 401k, Aflac supplemental insurance options, free gym memberships, and discounts, Opportunities to grow within the company", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3948377741"}