{"jobTitle": "Regional Sales Manager", "company": {"name": "Verve", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Verve Motion is building a world-class team to commercialize wearable solutions to augment and protect industry workers across multiple verticals. Verve's connected wearable system can be worn all day, every day by industry associates to reduce fatigue, mitigate risk of injury, and augment performance. Verve is building a world-class team to commercialize wearable solutions that empower the way people move in the world. Our first product is a lightweight, connected wearable system that can be worn all day, every day by industry associates to improve worker safety, and experience. Verve is growing and launching partnerships with some of the leading companies in the world to augment and protect their workforce and we have the unique potential to change the lives of millions of workers.<br/><br/>We are looking for a talented Regional Sales Manager to drive sales as we work towards creating the warehouse of the future.<br/><br/>More info at vervemotion.com<br/><br/>ROLE<br/><br/><ul><li>Identify, reach and influence senior-level decision makers, stakeholders and industry influencers within targeted company types, accounts and territories</li><li>Work closely with senior executives to develop sales strategies and tactics to close business and build reference accounts</li><li>Be responsible for developing a robust pipeline and close sales in the supply chain and logistics industry</li><li>Drive referenceable customer satisfaction in your accounts</li><li>Expertly demonstrate Verve Motion technology to end users</li><li>Develop champions, stakeholder mind-share, and close at the VP/C-level</li><li>Collaborate with other members of the customer success team, engineering and product teams to exceed customer expectations and develop customer relationships</li><li>Meet and/or exceed sales and new business goals<br/><br/></li></ul>YOU:<br/><br/><ul><li>Are excited to work in a fast-paced, fast-growing startup</li><li>Have a track record of exceeding sales quotas and new business targets for B2B products</li><li>Ability to operate and move complex sales through multiple stakeholders within organizations</li><li>Demonstrated success working closely with senior executives to develop sales strategies and tactics to close business and build reference accounts</li><li>Client advocate that develops deep relationships throughout an organization</li><li>Experience commercializing technology in the supply chain / warehouse markets is a plus</li><li>Have excellent communication and organizational skills</li><li>Have strong analytical, problem-solving and multitasking skills</li><li>50%+ travel and/or customer face time<br/><br/></li></ul>We offer:<br/><br/><ul><li>The opportunity to make an immediate and visible impact in a fast-growing company with lots of potential as we work towards transforming worker safety, well-being and experience of millions of workers in the US</li><li>Passionate and fun teammates</li><li>Wear robots at work!<br/><br/></li></ul>Verve is dedicated to building a diverse team of individuals who are committed to contributing to an inclusive environment. Some of our core values include respect for all, serving the greater good, and welcoming individuals from diverse backgrounds, experiences, and perspectives.<br/><br/>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Even if you do not check every box, but see yourself contributing, please apply.<br/><br/>Powered by JazzHR<br/><br/>d7Nh5k19He", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3948666757"}