{"jobTitle": "Business Development Account Manager- Torrance, CA", "company": {"name": "Prime Matter Labs", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$45,000.00 - $60,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "Business Development Account Manager<br/><br/>Location: Los Angeles, CA<br/><br/>Salary Range: $45,000.00 to $60,000.00<br/><br/>Who we are:<br/><br/>We’re Prime Matter Labs, a personal care product manufacturer with over 40 years of experience formulating, compounding, and filling products for some of the most successful and respected brands in the world.<br/><br/>We exist to bring better products to the world by empowering our customers to bring their ideas to life. We strive to be their most valuable partner, delivering a level of efficiency, service, and support unmatched in the industry.<br/><br/>In 2020 we embarked on a bold new vision to be the leading product development and production partner in the country for emerging and established brands. To realize that vision, we’ve invested at an unprecedented level in new technology, processes, and plans that will completely rethink the way that brands view and interact with their manufacturer. We’re building the platform that will allow us to serve as the foundation of our customer’s branded products, from their first sample to their million-unit product run, and every step in between.<br/><br/>Come help us build the future of the personal care and beauty landscape, one partnership at a time.<br/><br/>What we’re looking for:<br/><br/>We’re searching for a business development account manager that has a proven track record of putting the customer first. This person will be able to quickly understand existing processes, while constantly looking for opportunities to think outside the box and improve or create new systems. Our BD account manager will be a driven, self-motivated person who thrives in a fast-paced environment, thinking quickly on their feet. They will be the face of the company to our most valuable customers, using their strong communication skills to ensure that projects are managed with complete coordination internally and externally.<br/><br/>How you’ll fit in: <br/><br/>As a key point of contact to our most important customers, you will be providing them excellent customer service, managing key project deliverables, answering questions, and ultimately ensuring they are completely satisfied with our partnership. You will contribute to building profitable and long-term relationships, and helping us reach business objectives, all while you build your career.<br/><br/>What you’ll do:<br/><br/><ul><li>Be the customer’s voice within our organization, driving customer satisfaction by ensuring everyone understands their needs</li><li>Partner with the sales team to ensure they have all of the information, tools, and support they need to maintain our accounts and grow our business. </li><li>Manage new and existing products through development, production, and re-order, ensuring on time delivery and clear communication throughout</li><li>Provide consistent updates to our customers on project status and needs, ensuring they are informed at all times</li><li>Coordinate finished product pickup by communicating with the accounting and shipping department to ensure on time delivery</li><li>Manage Inventory, assessing on hand inventory for customer supplied components vs allocations for current orders and coordinating arrival of pending items between customer and production teams</li><li>Coordinate the sample production and delivery process for new project samples</li><li>Provide the production team with clear, consistent updates on customer needs to ensure on time delivery of orders<br/><br/></li></ul>What you have: <br/><br/><ul><li>2+ years of experience working as a customer service or business development representative, ideally in a manufacturing or supply chain environment</li><li>Excellent verbal, written and interpersonal communication skills</li><li>Experience participating in and facilitating meetings</li><li>Excellent attention to detail, time management, and organizational skills</li><li>Ability to analyze data, establish clear priorities quickly, and drive the decision making process</li><li>Ability to work effectively under tight timelines, handle multiple projects, and meet deadlines</li><li>Strong collaboration and administrative skills, and a knack for engaging with customers</li><li>Experience in data entry and MS Office (Word, Excel, Outlook and PowerPoint.)</li><li>Bachelor’s Degree in Business Administration or related field preferred<br/><br/></li></ul>What we’re offering: <br/><br/><ul><li>Competitive compensation package</li><li>Health, dental, and vision benefits</li><li>401K match program</li><li>The spirit of a startup with the security of an established, profitable industry leader</li><li>The opportunity to make waves in a $250B industry<br/><br/></li></ul>At PML, we believe that a diverse, equitable and inclusive workplace makes us a more relevant, more competitive, and more resilient company. We welcome people from all backgrounds, ethnicities, cultures, and experiences. Prime is an equal opportunity employer.<br/><br/>Powered by JazzHR<br/><br/>NoraGBs2G0", "responsibilities": "<ul><li>Be the customer’s voice within our organization, driving customer satisfaction by ensuring everyone understands their needs</li><li>Partner with the sales team to ensure they have all of the information, tools, and support they need to maintain our accounts and grow our business. </li><li>Manage new and existing products through development, production, and re-order, ensuring on time delivery and clear communication throughout</li><li>Provide consistent updates to our customers on project status and needs, ensuring they are informed at all times</li><li>Coordinate finished product pickup by communicating with the accounting and shipping department to ensure on time delivery</li><li>Manage Inventory, assessing on hand inventory for customer supplied components vs allocations for current orders and coordinating arrival of pending items between customer and production teams</li><li>Coordinate the sample production and delivery process for new project samples</li><li>Provide the production team with clear, consistent updates on customer needs to ensure on time delivery of orders<br/><br/></li></ul>", "qualifications": {"required": "2+ years of experience working as a customer service or business development representative, ideally in a manufacturing or supply chain environment, Excellent verbal, written and interpersonal communication skills, Experience participating in and facilitating meetings, Excellent attention to detail, time management, and organizational skills, Ability to analyze data, establish clear priorities quickly, and drive the decision making process, Ability to work effectively under tight timelines, handle multiple projects, and meet deadlines, Strong collaboration and administrative skills, and a knack for engaging with customers, Experience in data entry and MS Office (Word, Excel, Outlook and PowerPoint.)", "preferred": "Bachelor’s Degree in Business Administration or related field"}, "skills": ["Customer Service", "Business Development", "Manufacturing", "Supply Chain", "Communication", "Meeting Facilitation", "Time Management", "Organizational Skills", "Data Analysis", "Decision Making", "Project Management", "Collaboration", "Administrative Skills", "Data Entry", "MS Office", "Word", "Excel", "Outlook", "PowerPoint", "Business Administration"], "postedDate": "2 months ago", "benefits": "<ul><li>Competitive compensation package</li><li>Health, dental, and vision benefits</li><li>401K match program</li><li>The spirit of a startup with the security of an established, profitable industry leader</li><li>The opportunity to make waves in a $250B industry<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948079538"}