{"jobTitle": "Training and Professional Development Manager (25536)", "company": {"name": "Plaza de la Raza Child Development Services, Inc.", "industry": "Education Administration Programs", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Education Administration Programs", "description": "<strong>POSITION: </strong> Training &amp; Professional Development Manager<br/><br/><strong>JOB CODE: </strong> MAD1<br/><br/><strong>OCCUPATIONAL GROUPING: </strong>Management<br/><br/><strong>REPORTS TO: </strong> Executive Director<br/><br/><strong>CLASSIFICATION: </strong> Exempt<br/><br/><strong>POSITION TYPE: </strong> Full Time/Full Year (12-Months)<br/><br/><strong>SALARY GRADE: </strong> 58<br/><br/><strong>MONTHLY SALARY RANGE: </strong> $8,109.68 to $8,951.57<br/><br/><strong>Program Summary<br/><br/></strong>Plaza de la Raza Child Development Services, Inc. (Plaza) is a comprehensive early childhood education program with a focus on school readiness for children zero to five years of age. Developmentally appropriate services are provided for children from low-income families, zero to five years of age. Plaza de la Raza currently serves over 700 children and their families.<br/><br/><strong>DEFINITION<br/><br/></strong>This position manages the planning, organization, coordination, and implementation of Training and Technical Assistant goals and plans of the agency. Ensures regulatory and legal compliance with federal, state, and local requirements. Serves as a resource for all Program Services and Education Services staff.<br/><br/><strong>SUPERVISION RECEIVED AND EXERCISED<br/><br/></strong>Under the general direction of the Executive Director, supervises the Mentor Coaches.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li> Manages the learning management process/system to develop and maintain training plans/inclusive of on-demand opportunities that are in line with current program Professional Development needs by creating content, developing modules, tracking and monitoring completion and evaluation data.</li><li> Develops, disseminates and analyzes surveys that guide quality improvement and professional development opportunities.</li><li> Analyzes and assesses the implementation of curriculum in classrooms and ensures all activities, lesson plans, and materials are developmentally appropriate.</li><li> Assesses all classroom practices to ensure their adherence to program policies and early childhood education best practices.</li><li> Works collaboratively with PDLR Leadership team to develop and implement systematic training and technical assistance plans based on current data sources for all programs that adhere to funding source requirements.</li><li> Supervises, Mentor Coaches and Education Coordinators in developing effective coaching strategies that support adult-learning styles.</li><li> Oversees Coaching Program and uses data to drive coaching strategies aligned with goals and performance indicators inclusive of Classroom Assessment Scoring System (CLASS), Practice-Based Coaching, ongoing classroom observations and feedback, working with the external coaching teams and coordinating with quality improvement frameworks.</li><li> Oversees the delivery of coaching/mentoring sessions staff on a regular basis as determined by staff needs and assessments.</li><li> Coordinates the facilitation of coaching groups, training events (virtual and in-person) and other professional development events.</li><li> Coordinates the implementation of the identified research-based coaching program for teaching staff and home visiting.</li><li> Ensures training and coaching opportunities align with program goals, school readiness goals, and curricula by analyzing and assessing ongoing monitoring data, education staff data and child outcomes data.</li><li> Supports the implementation of professional development plans by coordinating training and processing training requests that are data-driven.</li><li> Provide training to employees and provide technical assistance when applicable.</li><li> Provides feedback and supports the implementation of the Professional Development Plans.<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><strong>Knowledge of:<br/><br/></strong>Effective strategies that support training and development, learning technologies, performance analysis and needs assessment, training program design, evaluation and assessment, communication and presentation skill, adult learning principles, project management, change management, compliance and regulations, leadership and team management, culturally sensitivity, data analysis and problem solving.<br/><br/><strong>Ability To<br/><br/></strong><ul><li> Ability to work with mathematical concepts such as probability and statistical inference. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.</li><li> Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and procedure manuals.</li><li> Ability to effectively present information and respond to questions from stakeholders.</li><li> Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.</li><li> Must have intermediate knowledge of computer programs in a Windows environment, including Word, Excel, PowerPoint, and E-mail.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong>Education: <br/><br/></strong>Bachelor’s degree from an accredited four-year college or university with a major in Education, Child Development, Public Administration, Social Welfare, or a related field is required. A master’s degree in a related field, and certification in education and administration is highly desirable. Must be CLASS Reliable within nine (12) months of hire.<br/><br/><strong>Experience<br/><br/></strong>Five (5) years of professional, supervisory, data analysis, and/or management experience associated with educational, social services, and family development programs that are related to Head Start and Early Head Start Services. A minimum of one (1) year experience of training development experience and coaching experience.<br/><br/><strong>Health Qualifications<br/><br/></strong><ul><li> Successful completion of an initial health examination, performed by or under the supervision of a physician, to determine, at a minimum, if the prospective employee can perform the physical requirements of the job description.</li><li> Proof of the absence of Tuberculosis, from a physician so that the prospective employee is cleared to work with children and families.</li><li> Documentation of current immunizations against influenza, Measles, Mumps &amp; Rubella (MMR) and Pertussis (TDAP).<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong>The physical demands and work environment characteristics described here are representative of those that must be met, or are encountered, by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to sit; use hands to finger, handle or feel objects, tools or controls; reach with hands and arms; and talk or hear. The employee is occasionally required to stand; walk; climb or balance; and stoop, kneel, crouch or crawl. Specific vision abilities required by this job include close vision, distant vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.<br/><br/><strong>Additional Requirements<br/><br/></strong><ul><li> Fingerprint clearances from the Department of Justice (DOJ), the Federal Bureau of Investigation (FBI), and the Child Abuse Index prior to starting employment.</li><li> Completed and signed statement of any pending and/or prior criminal arrests/charges/convictions related to child sexual abuse, child abuse and neglect, and/or violent felonies.</li><li> Verification that determines eligibility for employment in the United States of America.</li><li> A valid California driver’s license and the availability of private transportation or the ability to obtain transportation to perform position duties is required.</li><li> As a mandated reporter of child abuse, must immediately report any suspected child abuse and/or neglect to Child Protective Services.<br/><br/></li></ul><strong>MAINTAIN PROFESSIONAL AND ETHICAL STANDARDS<br/><br/></strong><ul><li> Maintains confidentiality in accordance with Agency policy and legal requirements.</li><li> Respects and maintains rights and privacy of all staff, parents, and children.</li><li> Attends mandated trainings and meetings, and seek out staff development opportunities.</li><li> Works as a team member with all staff and maintain a positive work ethic.</li><li> Acts conscientiously in performing routine duties.<br/><br/></li></ul>Adheres to Plaza de la Raza's Standard of Conduct which indicates that staff members are required to adhere to<br/><br/><strong>The Following Codes Of Conduct<br/><br/></strong><ul><li> Respect and promote the unique identity of each child and family and refrain from stereotyping on the basis of gender, race, ethnicity, culture, religion, or disability;</li><li> Follow program confidentiality policies concerning information about children, families and other staff members;</li><li> Maintain visual observation of children at all times and not leave any child alone or unsupervised while under their care;</li><li> Use positive methods of child guidance and will not engage in corporal punishment, emotional or physical abuse, or humiliation.</li><li> Not employ methods of discipline that involve isolations, the used of food as punishment or reward, or the denial of basic needs.</li><li> Not solicit or accept personal gratuities, favors or anything of significant monetary value form contractors or potential contractors.</li><li> Maintain respect and promote professional relationships with the Los Angeles County Office of Education (LACOE), families, staff and children.</li><li> Refrain from the unlawful manufacture, distribution, dispensing, possession, or use of alcoholic beverage, controlled substance, and tobacco products in the workplace or at any activity funded by federal or state funds.</li><li> Maintain adherence to LACOE, state, or federal mandates, including but not limited to program eligibility determination regulations for Early Head Start, Head Start or state preschool services.</li><li> Enrolling pregnant women and children that are not eligible to receive Early Head Start or Head Start services.<br/><br/></li></ul><strong>EQUAL OPPORTUNITY EMPLOYER<br/><br/></strong>Plaza de la Raza Child Development Services Inc. is an equal opportunity employer to all. Plaza de la Raza Child Development Services is committed to creating a community in which a diverse population can learn, live, and work in an atmosphere of tolerance, civility, and respect for the rights and sensibilities of each individual regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.<br/><br/><strong>BENEFIT PLANS<br/><br/></strong>Plaza Offers Eligible Employees The Opportunity To Select Plans And Programs That Meet Individual And Family Needs Through Our Comprehensive Benefit Plans Listed Below<br/><br/><strong>Health Care:</strong> Medical (Kaiser), Dental (Guardian), Vision (Guardian), Long Term Disability Insurance, Life Insurance, Accident and Hospital Coverages.<br/><br/><strong>Financial: </strong>401(k) Plan<br/><br/><strong>Paid Time Off: </strong>Vacation, Holidays, Sick Leave, Bereavement Leave and Jury Duty<br/><br/><strong>Work/Life Solutions: </strong>Life Assistance Program<br/><br/><strong>APPLICATION PROCESS<br/><br/></strong><ul><li> Complete an online employment application on www.plazadelarazacds.org; and submit the required documentation: 1) Cover Letter; 2) Resume; 3) Transcripts reflecting degree and major; and 4) CLASS certification, if applicable. Only complete application packets will be considered for the screening and selection process.</li><li> Submit official transcripts prior to date of hire.</li></ul>", "responsibilities": "This position manages the planning, organization, coordination, and implementation of Training and Technical Assistant goals and plans of the agency. Ensures regulatory and legal compliance with federal, state, and local requirements. Serves as a resource for all Program Services and Education Services staff.", "qualifications": {"required": "Bachelor’s degree from an accredited four-year college or university with a major in Education, Child Development, Public Administration, Social Welfare, or a related field is required. A master’s degree in a related field, and certification in education and administration is highly desirable. Must be CLASS Reliable within nine (12) months of hire.<br/><br/>Five (5) years of professional, supervisory, data analysis, and/or management experience associated with educational, social services, and family development programs that are related to Head Start and Early Head Start Services. A minimum of one (1) year experience of training development experience and coaching experience.", "preferred": "Must be CLASS Reliable within nine (12) months of hire."}, "skills": ["Training and Development", "Learning Technologies", "Performance Analysis", "Needs Assessment", "Training Program Design", "Evaluation and Assessment", "Communication and Presentation", "Adult Learning Principles", "Project Management", "Change Management", "Compliance and Regulations", "Leadership and Team Management", "Culturally Sensitivity", "Data Analysis", "Problem Solving", "Mathematical Concepts", "Probability", "Statistical Inference", "Fractions", "Percentages", "Ratios", "Proportions", "General Business Periodicals", "Professional Journals", "Technical Procedures", "Governmental Regulations", "Reports", "Business Correspondence", "Procedure Manuals", "Stakeholders", "Practical Problems", "Concrete Variables", "Instructions", "Written", "Oral", "Diagram", "Schedule", "Word", "Excel", "PowerPoint", "E-mail", "Head Start", "Early Head Start Services", "Coaching", "Health Examination", "Physician", "Physical Requirements", "Tuberculosis", "Immunizations", "Influenza", "Measles", "Mumps", "Rubella", "Pertussis", "Fingerprint Clearances", "Department of Justice", "Federal Bureau of Investigation", "Child Abuse Index", "Criminal Arrests", "Charges", "Convictions", "Child Sexual Abuse", "Child Abuse", "Neglect", "Violent Felonies", "Verification", "Eligibility", "Employment", "United States of America", "California Driver’s License", "Private Transportation", "Mandated Reporter", "Child Abuse", "Neglect", "Child Protective Services", "Confidentiality", "Agency Policy", "Legal Requirements", "Rights", "Privacy", "Staff", "Parents", "Children", "Mandated Trainings", "Meetings", "Staff Development Opportunities", "Team Member", "Positive Work Ethic", "Conscientiously", "Routine Duties", "Standard of Conduct", "Unique Identity", "Gender", "Race", "Ethnicity", "Culture", "Religion", "Disability", "Family Care", "Medical Leave", "Gender Expression", "Gender Identity", "Genetic Information", "Marital Status", "Medical Condition", "Military", "Veteran Status", "National Origin", "Political Affiliation", "Religious Creed", "Sex", "Pregnancy", "Childbirth", "Breastfeeding", "Related Medical Conditions", "Sexual Orientation", "Benefit Plans", "Health Care", "Medical", "Dental", "Vision", "Long Term Disability Insurance", "Life Insurance", "Accident", "Hospital Coverages", "Financial", "401(k) Plan", "Paid Time Off", "Vacation", "Holidays", "Sick Leave", "Bereavement Leave", "Jury Duty", "Work/Life Solutions", "Life Assistance Program", "Online Employment Application", "Cover Letter", "Resume", "Transcripts", "Degree", "Major", "CLASS Certification", "Application Packets", "Screening", "Selection Process", "Official Transcripts", "Date of Hire"], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "Plaza Offers Eligible Employees The Opportunity To Select Plans And Programs That Meet Individual And Family Needs Through Our Comprehensive Benefit Plans Listed Below<br/><br/><strong>Health Care:</strong> Medical (Kaiser), Dental (Guardian), Vision (Guardian), Long Term Disability Insurance, Life Insurance, Accident and Hospital Coverages.<br/><br/><strong>Financial: </strong>401(k) Plan<br/><br/><strong>Paid Time Off: </strong>Vacation, Holidays, Sick Leave, Bereavement Leave and Jury Duty<br/><br/><strong>Work/Life Solutions: </strong>Life Assistance Program", "remoteWork": null, "salary": {"amount": "8,109.68 to $8,951.57", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3948105629"}