{"jobTitle": "User Experience Designer, Early Career", "company": {"name": "Google", "location": "San Bruno, CA"}, "location": "San Bruno, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "102,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Art/Creative, Design, and Engineering", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Mountain View, CA, USA; Austin, TX, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; San Jose, CA, USA; San Bruno, CA, USA; New York, NY, USA**. **Minimum qualifications:**<br/><br/> <ul><li>Bachelor's degree in Design (e.g., Interaction, Graphic, Visual Communications, Product, Industrial), Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience.</li><li>Experience with industry standard design tools (e.g., Photoshop, Illustrator, Sketch, InVisio, Figma, Principle, etc.).</li><li>Portfolio highlighting design principles for web or mobile platforms.<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>Certification in Grow with Google, UX Design, or similar.</li><li>1 year of experience working with designers, researchers, engineers, content strategists, and product managers throughout the design process (e.g., creating user flows, wireframes, and building user interface mockups/prototypes).</li><li>Experience designing across multiple platforms (e.g., Android, iOS, and Web).</li><li> Excellent leadership, communication and collaboration skills.<br/><br/></li></ul> **About The Job**<br/><br/> At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Google’s Interaction Designers take complex tasks and make them intuitive and easy-to-use for billions of people around the globe. Throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes—you’ll envision how people will experience our products, and bring that vision to life in a way that feels inspired, refined, and even magical.<br/><br/> Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.<br/><br/> As an Interaction Designer, you’ll rely on user-centered design methods to craft industry-leading user experiences—from concept to execution. Like all of our UX jobs, you’ll collaborate with your design partners to leverage and evolve the Google design language to build beautiful, innovative, inspired products that people love to use.<br/><br/> User experience is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to gather insights that inform product strategy and design. Our UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and simplicity. We work on collaborative teams to solve complex challenges and craft experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”<br/><br/> The US base salary range for this full-time position is $102,000-$150,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/> **Responsibilities**<br/><br/> <ul><li>Help to define the user model and user interface for Google products and features.</li><li>Develop detailed storyboards, mockups, and prototypes to communicate interaction and design ideas.</li><li>Collaborate with product managers, engineers, researchers, writers, and cross-functional stakeholders to understand requirements, and provide creative solutions.</li><li>Evaluate the usability of new and existing products and make constructive suggestions for change.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Help to define the user model and user interface for Google products and features.</li><li>Develop detailed storyboards, mockups, and prototypes to communicate interaction and design ideas.</li><li>Collaborate with product managers, engineers, researchers, writers, and cross-functional stakeholders to understand requirements, and provide creative solutions.</li><li>Evaluate the usability of new and existing products and make constructive suggestions for change.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Design (e.g., Interaction, Graphic, Visual Communications, Product, Industrial), Human-Computer Interaction, Computer Science, a related field, or equivalent practical experience.\nExperience with industry standard design tools (e.g., Photoshop, Illustrator, Sketch, InVisio, Figma, Principle, etc.).\nPortfolio highlighting design principles for web or mobile platforms.", "preferred": "Certification in Grow with Google, UX Design, or similar.\n1 year of experience working with designers, researchers, engineers, content strategists, and product managers throughout the design process (e.g., creating user flows, wireframes, and building user interface mockups/prototypes).\nExperience designing across multiple platforms (e.g., Android, iOS, and Web).\n Excellent leadership, communication and collaboration skills."}, "skills": ["Photoshop", "Illustrator", "Sketch", "InVisio", "Figma", "Principle", "UX Design", "Android", "iOS", "Web", "Leadership", "Communication", "Collaboration"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948469305"}