{"jobTitle": "Retail Customer Service Specialist (full-time/part-time)", "company": {"name": "Living Spaces Furniture", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Furniture and Home Furnishings Manufacturing, Retail, and Manufacturing", "description": "Position Summary<br/><br/>The primary role of the Retail Customer Service Specialist /Operations Specialist is to partner with the Operations Supervisor to ensure success in all guest interactions and transactions with a Guest First mentality. Will maintain the cash office and Operations counter with precise execution of Standard Work.<br/><br/>Position Description<br/><br/><strong>Essential Duties and Responsibilities </strong>include the following. Other duties may be assigned.<br/><br/><ul><li>Complete and demonstrate the ability to effectively execute all company training modules</li><li>Greet and engage guests on sales floor</li><li>Help in Kids Spaces as needed</li><li>Ensure team completes and demonstrates the ability to effectively execute to company expectations</li><li>all new hire and ongoing training modules</li><li>Completes required training in the expected timeframe, and participates in ongoing learning opportunities</li><li>Execute standard work expectation in the front end, fun room, prep kitchen, and beverage bar</li><li>Assist Store Manager in resolving guest escalations, returns, discounts</li><li>Ensure check-out/in processes is executed</li><li>Execute cash office procedures to exacting standards in Standard Work about 40% of the day</li><li>Establish a self-audit routine in compliance with Asset Protection Audit</li><li>Ability to work weekends and most holidays</li><li>Able to work in a fast-paced environment</li><li>Perform all guest email follow-up</li><li>Ability to effectively communicate with all levels of leadership</li><li>Ability to work weekends and most holidays</li><li>Able to work in a fast-paced environment<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Education/Experience: </strong>High School Diploma or GED equivalent. 1 year of retail experience in a direct customer interactive environment required. 1-2 years of customer service experience. High volume experience is preferred. Equivalent combination of education and experience will be considered.<br/><br/><strong>Computer Skills: </strong>To perform this job successfully, an individual must have proficient experience in Microsoft Office programs.<br/><br/><strong>Position Hiring Range<br/><br/></strong>The hiring pay range provides a guide for what we would reasonably pay for the position. Pay will be determined by several factors, including but not limited to: applicant’s education, relevant work experience, knowledge, skills and abilities, as well as internal equity and alignment with geographic market data. Living Spaces reserves the right to modify this pay range at any time. Pay is determined by various factors including market demand, applicable skills, work experience and education, location, company budget, and in-demand skill sets.<br/><br/>Compensation: $16.95 - $22.00<br/><br/>Retail, Guest Services, and Distribution Center Team Members are eligible to receive team bonus based on meeting specific goals and KPI’s.<br/><br/><strong>Benefits Include<br/><br/></strong><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401(k) (full and part time eligible)</li><li>Vacation</li><li>Sick Time</li><li>Flex Spending Account</li><li>Employee Assistance Program<br/><br/></li></ul>For more details, please visit our website at: Careers (livingspaces.com)<br/><br/><strong>Equal Opportunity Employer<br/><br/></strong>It is our policy to abide by all federal, state, and local laws prohibiting employment discrimination based solely on a person’s race, color, religious creed, sex, national origin, ancestry, citizenship status, pregnancy, physical disability, mental disability, age, military status, or status as a Vietnam-era or special disabled veteran, marital status, registered domestic partner or civil union status, gender (including sex stereotyping and gender identity or expression), medical condition (including but not limited to, cancer related or HIV/AIDS related), sexual orientation, or any other protected status except where a reasonable, bona fide occupational qualification exists.<br/><br/><strong>E-Verify<br/><br/></strong>Living Spaces participates in E-Verify. All newly-hired team members are queried through this electronic system established by the Department of Homeland Security (DHS) and the Social Security Administration (SSA) to verify their identity and employment eligibility.<br/><br/>Applicant Privacy", "responsibilities": "<strong>Essential Duties and Responsibilities </strong>include the following. Other duties may be assigned.<br/><br/><ul><li>Complete and demonstrate the ability to effectively execute all company training modules</li><li>Greet and engage guests on sales floor</li><li>Help in Kids Spaces as needed</li><li>Ensure team completes and demonstrates the ability to effectively execute to company expectations</li><li>all new hire and ongoing training modules</li><li>Completes required training in the expected timeframe, and participates in ongoing learning opportunities</li><li>Execute standard work expectation in the front end, fun room, prep kitchen, and beverage bar</li><li>Assist Store Manager in resolving guest escalations, returns, discounts</li><li>Ensure check-out/in processes is executed</li><li>Execute cash office procedures to exacting standards in Standard Work about 40% of the day</li><li>Establish a self-audit routine in compliance with Asset Protection Audit</li><li>Ability to work weekends and most holidays</li><li>Able to work in a fast-paced environment</li><li>Perform all guest email follow-up</li><li>Ability to effectively communicate with all levels of leadership</li><li>Ability to work weekends and most holidays</li><li>Able to work in a fast-paced environment<br/><br/></li></ul>", "qualifications": {"required": "High School Diploma or GED equivalent. 1 year of retail experience in a direct customer interactive environment required. 1-2 years of customer service experience. High volume experience is preferred. Equivalent combination of education and experience will be considered.", "preferred": "Proficient experience in Microsoft Office programs."}, "skills": ["Microsoft Office"], "postedDate": "1 week ago", "benefits": "<ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401(k) (full and part time eligible)</li><li>Vacation</li><li>Sick Time</li><li>Flex Spending Account</li><li>Employee Assistance Program<br/><br/></li></ul>", "salary": {"amount": "16.95 - $22.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948044441"}