{"jobTitle": "Retention & Merchandising Strategy Manager", "company": {"name": "Dr. Squatch", "location": "Marina del Rey, CA"}, "location": "Marina del Rey, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "80,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Personal Care Product Manufacturing", "description": "Why We Exist and What We Do:\n\nAt Dr. Squatch (www.drsquatch.com), we’re raising the bar on men’s personal care with our line of natural, high-performance products. We’re on a high-growth, fast-moving ride, continually introducing new product categories, launching into retailers nationwide, and growing internationally. We have been recognized and certified by Great Place to Work® multiple times, and we achieved status as a certified B Corp in 2023. We are looking for passionate, talented people who want to join us in our mission to inspire and educate men to be happier and healthier!\n\nAbout the Role:\n\nDr. Squatch is looking for a detail-oriented and results-driven Retention & Merchandising Strategy Manager to join the Retention Team and support our efforts in engaging, nurturing, and driving customer loyalty. In this role, you will be responsible for managing and optimizing our retention strategies across retention platforms (direct mail, email, SMS, loyalty), driving list growth, and leading performance reporting. You will be pivotal in enhancing customer loyalty and driving continuous growth through innovative and data-driven approaches.\n\nThis role will report to the Associate Director of Retention and work collaboratively across all Marketing teams. The Retention Strategist will work hand-in-hand with key company leaders to manage critical business tasks and strategies.\n\nThis full-time, hybrid position with company benefits is based in Marina del Rey, CA, and will require 3 days per week in-office.\n\nThe anticipated base compensation range for this role will be $80,000 to $120,000. Compensation will be commensurate with the candidate's experience and local market rates.\n\nWhat You'll Do:\n\n<ul><li>Drive Retention and Monetization Strategy for our DTC business, partnering cross-functionally with Lifecycle and other Marketing teams to implement key initiatives</li><li>Rigorously measure and report on performance on a weekly basis, adjusting strategies based on data-driven insights to maximize effectiveness</li><li>Set, manage, and track budget for Retention across platforms and vendors, identifying opportunities and working with LC and leadership to implement them</li><li>Oversee and execute comprehensive re-engagement campaigns through direct mail, email, SMS, and other lifecycle marketing platforms</li><li>Drive email & SMS list growth initiatives (e.g., on-site pop-up testing), collaborating closely with external vendors</li><li>Define and implement strategic merchandising and monetization strategies<br/><br/></li></ul>About You:\n\n<ul><li>Minimum 2+ years of experience in marketing at a consumer brand, agency, management consulting, investment banking, or consumer technology</li><li>Strong analytical skills and experience with modeling</li><li>Scrappy, determined, team player</li><li>Problem solver with a sense of urgency</li><li>Entrepreneurial mindset and ability to take ownership</li><li>Excellent communication and presentation skills</li><li>Bachelor's degree in quantitative field preferred (engineering, mathematics, statistics, etc.)</li><li>Experience working in the consumer products industry preferred</li><li>You can get things done without perfect resources, are innovative and work with a sense of urgency</li><li>You have high standards, take ownership of your work and are invested in the outcome</li><li>You proactively help others, stay positive, and have a good sense of humor</li><li>Analytically driven and curious</li><li>Comfort with a rapidly evolving work environment, and experience taking initiative</li><li>Test and Learn mentality</li><li>Highly energetic and uplifts people around them</li><li>Learns new technology/business software with ease<br/><br/></li></ul>Who We Are:\n\nOur core values come naturally and make us a better, more whole, and unique team. We are Bold & Innovative - we are creative, rethink how things are done, and find a way. We Play to Win - we have high standards, we encourage ownership of work, we are scrappy, we act with urgency, and we invest in the outcome of our work. We are Team Squatch - we are humble, help others outside our own wheelhouse, stay positive, have fun, and have approachable and transparent leadership.\n\nWe offer a competitive salary in a growth-focused & collaborative team environment. Benefits include medical, dental, vision, 401k with Squatch match, and PTO. We also have great perks like healthy snacks, frequent company events, and of course, free products!\n\nDiversity, Equity & Inclusion @ Squatch:\n\nWe firmly believe that Team Squatch is a place for everyone and we’re proud to be an equal opportunity employer who is committed to inclusion and diversity. We do not discriminate based on any characteristic protected by federal or state law. We embrace differences and are building a company and culture that is represented by a variety of backgrounds, perspectives, life experiences, and skills.\n\nFor Applicants with Disabilities. Reasonable accommodation will be made so that qualified applicants with disabilities may participate in the application process. If you need any accommodations during the hiring process, please let us know when you submit your application and we'll do our very best to adjust as needed.\n\nFor Information regarding Data Privacy, please review https://www.drsquatch.com/pages/privacy-policy.\n\nUnsolicited Resume Policy. Dr. Squatch (“DRSQ”) employs an internal Talent Acquisition department. Exceptionally, DRSQ may choose to supplement that internal team with support from temporary staffing agencies, placement services, and/or recruiting agencies (“Agency”). Agencies are hereby specifically directed NOT to contact DRSQ employees directly in an attempt to present candidates. DRSQ’s Talent Acquisition team is responsible for all candidate presentations to our hiring managers.\n\nTo protect the interests of all parties, Dr. Squatch will not accept unsolicited resumes from any source other than directly from a candidate. Any unsolicited resumes sent to DRSQ, including unsolicited resumes sent to a DRSQ email address or mailing address, directly to DRSQ employees, or to DRSQ’s resume database will be considered property of Dr. Squatch.\n\nDRSQ will not pay a placement, service or other fee for any placement resulting from the receipt of an unsolicited resume. This also includes partial resumes, LinkedIn profiles, general candidate profiles, and/or candidate details or information. DRSQ will consider any candidate for whom an Agency has submitted an unsolicited resume to have been referred by the Agency free of any charges or fees.\n\nDRSQ’s Talent Acquisition team must provide advance written approval to an Agency to submit resumes and/or profiles for a specific job-opening, and the approval must be in conjunction with a valid fully executed staffing, placement or other service agreement. DRSQ will not pay a fee to any Agency that does not have a fully executed agreement in place prior to submission, receipt and placement of candidates.", "responsibilities": "<ul><li>Drive Retention and Monetization Strategy for our DTC business, partnering cross-functionally with Lifecycle and other Marketing teams to implement key initiatives</li><li>Rigorously measure and report on performance on a weekly basis, adjusting strategies based on data-driven insights to maximize effectiveness</li><li>Set, manage, and track budget for Retention across platforms and vendors, identifying opportunities and working with LC and leadership to implement them</li><li>Oversee and execute comprehensive re-engagement campaigns through direct mail, email, SMS, and other lifecycle marketing platforms</li><li>Drive email & SMS list growth initiatives (e.g., on-site pop-up testing), collaborating closely with external vendors</li><li>Define and implement strategic merchandising and monetization strategies<br/><br/></li></ul>", "qualifications": {"required": "Minimum 2+ years of experience in marketing at a consumer brand, agency, management consulting, investment banking, or consumer technology\nStrong analytical skills and experience with modeling\nScrappy, determined, team player\nProblem solver with a sense of urgency\nEntrepreneurial mindset and ability to take ownership\nExcellent communication and presentation skills\nYou can get things done without perfect resources, are innovative and work with a sense of urgency\nYou have high standards, take ownership of your work and are invested in the outcome\nYou proactively help others, stay positive, and have a good sense of humor\nAnalytically driven and curious\nComfort with a rapidly evolving work environment, and experience taking initiative\nTest and Learn mentality\nHighly energetic and uplifts people around them\nLearns new technology/business software with ease", "preferred": "Bachelor's degree in quantitative field preferred (engineering, mathematics, statistics, etc.)\nExperience working in the consumer products industry preferred"}, "skills": ["Marketing", "Retention", "Monetization", "DTC", "Lifecycle Marketing", "Direct Mail", "Email Marketing", "SMS Marketing", "Loyalty Programs", "List Growth", "Performance Reporting", "Data Analysis", "Budget Management", "Merchandising", "Consumer Products", "Problem Solving", "Communication", "Presentation Skills", "Teamwork", "Entrepreneurship", "Ownership", "Analytical Skills", "Quantitative Analysis", "Data-Driven Decision Making", "Test and Learn", "Innovation", "Urgency", "High Standards", "Collaboration", "Leadership", "Positive Attitude", "Technology", "Business Software"], "postedDate": "5 days ago", "benefits": "We offer a competitive salary in a growth-focused & collaborative team environment. Benefits include medical, dental, vision, 401k with Squatch match, and PTO. We also have great perks like healthy snacks, frequent company events, and of course, free products!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948491693"}