{"jobTitle": "PrEP Navigator", "company": {"name": "APLA Health", "industry": "Non-profit Organization Management", "size": "51-200 employees", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Non-profit Organization Management", "description": "The PrEP Navigator will provide client-centered PrEP and PEP education, engagement, patient navigation and adherence counseling to PrEP and PEP patients to ensure patient engagement and retention in PrEP services.", "responsibilities": "Provide clients with basic introductory education regarding PrEP/PEP. Conduct and document screenings for PrEP/PEP eligibility including sexual and behavioral risk assessments, health literacy, and insurance coverage. Conduct follow-up visits to offer adherence and retention counseling based on client’s needs. Schedule clients with the PrEP Enrollment Specialist. Coordinate client appointments for PrEP/PEP initial and follow-up medical and non-medical visits. Provide PrEP/PEP education and support regarding adherence, missed dose protocols, side effects and symptoms of conversion. Assist in scheduling appointments for patients receiving PrEP. Enter client data into eCW and Red Cap, LA County’s service documentation system. Ensure proper collection, storage, and transmission of data used in reporting, research, and program evaluation. Provide education about Post-Exposure Prophylaxis (PEP), and other effective biomedical and prevention interventions; refer eligible, interested clients to primary care medical services at an APLA Health clinic. Review and maintain up-to-date and accurate knowledge of emerging scientific research regarding biomedical HIV prevention strategies, including PrEP, PEP and related interventions. Maintain highest level of client confidentiality; follow HIPAA regulations.", "qualifications": {"required": "High School Diploma AND a minimum of 1 years of experience providing HIV education or risk reduction counseling OR one (1) year experience as a PrEP Navigator. Must demonstrate understanding of PrEP/PEP and have a strong socio-cultural identification with one or more of the target populations (Black/African American MSM, Black/African-American and Latinx cisgender heterosexual women, transgender persons, people who inject drugs and persons under 30 years of age living with HIV or at high risk for HIV). Experience in a nonprofit environment preferred; specific training/experience with HIV and other health related issues preferred. Training/experience working in HIV prevention and health education/health promotion and program development. Bilingual- Spanish speaking preferred.", "preferred": "Bilingual- Spanish speaking preferred."}, "skills": ["HIV education", "Patient navigation", "Adherence counseling", "Health literacy", "Risk assessment"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3948469091"}