{"jobTitle": "Part Time Receptionist (AM)", "company": {"name": "Silverado", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Hospitals and Health Care", "description": "Be part of a renowned team at Silverado, a Fortune Magazine Best Workplace in Aging Services™, where exceptional care meets exceptional careers! For 27 years, Silverado associates have wholeheartedly delivered unmatched care and enriched the lives of those we’ve been privileged to serve.<br/><br/>At Silverado, we prioritize not only our residents but also our valued associates. As a certified Great Place to Work, we provide competitive compensation and exceptional benefits to our full-time team members.<br/><br/><strong>We are currently seeking </strong><strong>a Receptionist who is passionate about making a difference for our Beverly Place </strong><strong>Community!<br/><br/></strong><strong>Shift Schedule:</strong> <strong>Part-Time, AM Shifts, Saturdays and Sundays<br/><br/></strong><strong>Why choose Silverado Beverly Place?<br/><br/></strong><ul><li>We're ranked 6th nationwide by Fortune Magazine in their Best Workplaces in Aging Services list, marking our 3rd consecutive year in the top 10! </li><li>Certified as a Great Place to Work® for seven consecutive years </li><li>We value internal mobility; Silverado provides growth opportunities for just about any position on our teams </li><li>We offer education assistance programs to support school reimbursements and provide paid training <br/><br/></li></ul><strong>The Non-negotiables<br/><br/></strong><ul><li>High school diploma </li><li>At least one year experience dealing with the public via telephone and in person</li><li>Strong computer skills– especially with Word and Excel</li><li>Excellent customer service skills and outstanding verbal and written communication skills</li><li> Strong ability to multi-task<br/><br/></li></ul><strong>What You'll Be Doing<br/><br/></strong><ul><li>Answer telephone calls in a professional manner and direct appropriately</li><li>Receive, separate and distribute incoming mail and prepare outgoing mail</li><li>Greet visitors and direct </li><li>Maintains files on the computer and updates information as necessary pertaining to associates and clients</li><li>Assist with clerical duties and office functions as assigned<br/><br/></li></ul>Anticipated pay range<br/><br/>$18—$19 USD<br/><br/><strong>We Are Looking For Someone Who<br/><br/></strong><ul><li>Loves people </li><li>Has compassion and patience </li><li>A quick learner who is dedicated to professional growth</li><li>Is ethical, honest, dependable, and open-minded </li><li>Is an effective communicator in both verbal and written English <br/><br/></li></ul><strong>Silverado Offers The Following Benefits To Eligible Employees<br/><br/></strong><ul><li>401(k) matching</li><li>Health, Dental and Vision Insurance</li><li>Flexible Spending Account (FSA), Health Savings Account (HSA) </li><li>Paid time off</li><li>Tuition reimbursement and professional development assistance </li><li>Referral program</li><li>Other amazing benefits such as Pet Insurance, Auto and Home Insurance and Discount Programs!</li><li> Silverado is not using outside recruiters to source for this position and will not accept agency or non-Silverado recruiter represented candidates in connection with this job posting. *<br/><br/></li></ul><strong>To view California Consumer Privacy Act (CCPA) information, please visit this page: </strong>https://www.silverado.com/legal-disclaimers/#Consumer-Privacy-Act-Disclosure<br/><br/><strong>To maintain our world class standard, all offers of employment with Silverado are contingent upon a satisfactory background check as well as drug screening, a physical and TB testing (if required for the position). Silverado also uses E-Verify to confirm work authorization with both the Social Security Administration and the Department of Homeland Security. <br/><br/></strong>EOE/M/F/D/V<br/><br/>", "postedDate": "2 months ago", "salary": {"amount": "18—$19 USD", "currency": "USD"}, "skills": ["Word", "Excel", "Customer Service", "Communication"], "benefits": "401(k) matching, Health, Dental and Vision Insurance, Flexible Spending Account (FSA), Health Savings Account (HSA), Paid time off, Tuition reimbursement and professional development assistance, Referral program, Pet Insurance, Auto and Home Insurance and Discount Programs!", "url": "https://www.linkedin.com/jobs/view/3948080032"}