{"jobTitle": "Production Planner", "company": {"name": "Hadrian", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00 - 110,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "<strong>About Us<br/><br/></strong>https://www.youtube.com/watch?v=tEUW3ljWX90<br/><br/>Hadrian builds software-defined high-precision component factories for the top aerospace companies in the world. We are in search of individuals with the drive to augment manufacturing, helping enable our engineers to build complex, yet elegant software as well as machinists who have a passion for pushing the trade forward.<br/><br/><strong>Position Overview:<br/><br/></strong>The Production Planner is responsible for preparing work schedules, tracking progress, updating critical path schedules, and communicating changes. You will track production activity to help ensure a smooth and controlled flow of materials, troubleshoot potential scheduling problems, assist with providing solutions, identify material deficiencies and remove blockers to ensure on-time product delivery.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Demand and Supply Management</li><li>Allocate demand-supply signals and regularly review their status to evaluate the short and long-term health of the system.</li><li>Alert the go-to-market team when orders are off track or require customer adjustments.</li><li>Scheduling and Coordination</li><li>Collaborate with all departments to understand and address critical work requests, both ahead of and behind targets, to mitigate scheduling risks.</li><li>Prepare daily work schedules, track progress, update critical path schedules, and communicate changes.</li><li>Organize and communicate daily priorities to Factory Leads, Technicians, and Programming Teams.</li><li>Factory Support and Optimization</li><li>Assist Factory Leads with workforce allocation and capacity planning, ensuring optimal resource use.</li><li>Push/pull work into the shop to improve lead times, reduce queue time, and meet scheduling needs</li><li>Use operations, supply chain, and engineering support to eliminate internal and external blockers for on-time product delivery.</li><li>Oversee and optimize the factory’s overall capacity to ensure alignment with production demands and company goals</li><li>Communication and Reporting</li><li>Advise leadership on necessary adjustments to daily work activities.</li><li>Provide daily visibility, weekly status updates, and monthly reviews on schedule performance, while monitoring and maintaining relevant metrics.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>2 or more years of experience in procurement, logistics, supply chain or similar role.</li><li>Experience with inventory management and capacity planning.</li><li>Exceptional attention to detail and organizational skills, with the ability to manage multiple projects and deadlines simultaneously.</li><li>Strong communication and interpersonal skills with the ability to collaborate effectively with cross-functional teams.</li><li>Knowledge of ERP/MRP systems.</li><li>Ability to solve practical problems and deal with a variety of changing situations under stress.</li><li>Ability to analyze data and create reports which accurately reflect the state of the business.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Supply Chain, Engineering or related discipline</li><li>2 or more years of practical experience with ERP/MRP systems in a production environment.</li><li>Previous experience in supply chain/logistics within manufacturing.<br/><br/></li></ul><strong>Success Factors<br/><br/></strong><ul><li>Intelligence: Find signal and prioritize in an environment with high variability.</li><li>Autonomous: Create targeted and pragmatic goals for individual work streams that tie to larger business outcomes.</li><li>Fair/Predictable: Understand the importance of standardization of people and physical processes.</li><li>Decisiveness: Drive quick decisions and action instead of remaining stuck in analytical hell.<br/><br/></li></ul>$70,000 - $110,000 a year<br/><br/>For this role, the target salary range is $70,000 - $110,000 (actual range may vary based on experience).<br/><br/>This is the lowest to highest salary we reasonably and in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the range may be modified in the future. An employee's pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, geographic location, performance, and business or organizational needs.<br/><br/>In addition to salary and equity, we offer:<br/><br/><ul><li> 100% coverage of platinum medical, dental, vision, and life insurance plans for employees</li><li> 401k</li><li> Relocation stipend if you're moving from outside of LA</li><li> Flexible vacation policy<br/><br/></li></ul><strong>ITAR REQUIREMENTS:<br/><br/></strong>To conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here .", "responsibilities": "The Production Planner is responsible for preparing work schedules, tracking progress, updating critical path schedules, and communicating changes. You will track production activity to help ensure a smooth and controlled flow of materials, troubleshoot potential scheduling problems, assist with providing solutions, identify material deficiencies and remove blockers to ensure on-time product delivery.", "qualifications": {"required": "2 or more years of experience in procurement, logistics, supply chain or similar role.\nExperience with inventory management and capacity planning.\nExceptional attention to detail and organizational skills, with the ability to manage multiple projects and deadlines simultaneously.\nStrong communication and interpersonal skills with the ability to collaborate effectively with cross-functional teams.\nKnowledge of ERP/MRP systems.\nAbility to solve practical problems and deal with a variety of changing situations under stress.\nAbility to analyze data and create reports which accurately reflect the state of the business.", "preferred": "Bachelor’s degree in Supply Chain, Engineering or related discipline\n2 or more years of practical experience with ERP/MRP systems in a production environment.\nPrevious experience in supply chain/logistics within manufacturing."}, "skills": ["Procurement", "Logistics", "Supply Chain", "Inventory Management", "Capacity Planning", "ERP", "MRP", "Communication", "Interpersonal Skills", "Problem Solving", "Data Analysis", "Reporting"], "postedDate": "2 months ago", "benefits": "100% coverage of platinum medical, dental, vision, and life insurance plans for employees\n401k\nRelocation stipend if you're moving from outside of LA\nFlexible vacation policy", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948978594"}