{"jobTitle": "Planner II", "company": {"name": "Parker Hannifin", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "81,226.00/yr - $106,179.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Aviation and Aerospace Component Manufacturing, Appliances, Electrical, and Electronics Manufacturing, and Automation Machinery Manufacturing", "description": "<strong>Position Summary<br/><br/></strong><strong>Planner II <br/><br/></strong><strong>Location: Simi Valley <br/><br/></strong><strong>About Parker Hannifin Aerospace Group<br/><br/></strong><ul><li> At Parker Aerospace, we develop technologies and innovative solutions that enable reliable, efficient, and increasingly sustainable flight for the lifecycle of the aircraft, including aftermarket support. Our passionate people with deep engineering expertise, together with our breadth of differentiated technologies, ensure that we make the extraordinary happen and continue to shape the future of aviation in partnership with our customers.</li><li> As a member of our team, you are instrumental in fulfilling our mission: 'Enabling Engineering Breakthroughs that Lead to a Better Tomorrow.' Pursuing a career at Parker presents unlimited opportunities for both professional and personal development. Working with some of the most brilliant minds in the industry, your contributions will be pivotal in developing innovative technologies and products, significantly contributing to Parker’s goal of addressing the world’s most pressing engineering challenges.</li><li> At Parker, our team members belong, matter, and make a difference. We believe that the key to bringing talented new team members into our organization is to focus on everyone’s talents and potential rather than the job specification. If you have innovative ideas and a commitment to excellence, we are more than happy to consider you for other roles in Parker that may be a good fit.</li><li> Parker Meggitt Simi Valley Fire, Safety, and Power Division site is a fully integrated location with product responsibility from Marketing and Engineering, through Supplier Management, Program Management, and Manufacturing ending with delivery to the customers.</li><li> Parker Meggitt is a worldwide leader in multiple Commercial and Military Aerospace product lines including Fire and Smoke Detection and Extinguishing systems, Bleed Air Overheat detection systems, Actuators, Rudder Pedal Assemblies, Pumps, Fuel Gauging Systems, High-Temperature cables, and more.</li><li> Parker Meggitt – Simi Valley, CA is also a key supplier to select Energy markets including Nuclear gas Analyzers and Nuclear containment vessel penetration Cables. We work directly with the largest global aerospace companies including Airbus, Boeing, Embraer, Lockheed Martin, and many others.<br/><br/></li></ul><strong>Job Title: Planner II<br/><br/></strong><strong>Job Designation<br/><br/></strong>The Planner II uses expertise in defining the required purchases or deliverables by planning, scheduling and monitoring the movement of materials or services throughout the product life cycle. Analyzes procurement planning requirements for specific area and maintains appropriate levels of inventory at planned levels.<br/><br/><strong>Job Core Responsibilities<br/><br/></strong><ul><li>Defines the required purchases or deliverables by planning, scheduling and monitoring the movement of materials, goods or services throughout the product life cycle</li><li>Utilizes SAP and MRP in the planning, monitoring, and launching of production work orders and outside process orders in support of Operations’ objectives, on time customer order fulfillment, and various materials' objectives like inventory optimization</li><li>Works on a wide variety of complex planning activities where production techniques are new or variable</li><li>Initiates purchase orders and amendments for parts, services, and/or special tools</li><li>Planes recent schedules and inventory control parameters for products and services, consistent with requirements or as arranged with requisition</li><li>Works from engineering plans and production specifications to establish production schedules, labor loading and capacity requirements</li><li>Arranges for submission and inspection of products as required and assures timely execution of products and service sourcing activities</li><li>Reschedules in case of design changes, labor and material shortages, backlogs and other interruptions</li><li>Other responsibilities as assigned</li><li>Consistent exercise of independent judgment and discretion in matters of significance</li><li>Regular, consistent and punctual attendance is required. May need to work nights and weekends, variable schedule(s) and additional hours as necessary<br/><br/></li></ul><strong>Job Specifications<br/><br/></strong><strong>Education : </strong>Bachelor’s Degree<br/><br/><strong>Years Experience : </strong>7 - 10 years of relevant experience<br/><br/><strong>Skills<br/><br/></strong><ul><li>Knowledge of procurement/planning best practices and experience with managing tight development program deadlines in aerospace/manufacturing environment</li><li>Experience in Enterprise Resource Planning (ERP) and Material Requirements Planning (MRP) systems</li><li>Highly organized with the ability to work under pressure to meet deadlines</li><li>Solves complex problems and exercises judgment based on the analysis of multiple sources of information</li><li>Excellent interpersonal and communication skills (written and verbal), with ability to drive tasks to completion</li><li>Proficient in Microsoft Office Suite and database management tools</li><li>APICS CPIM Certification preferred<br/><br/></li></ul><strong>Health And Wellbeing<br/><br/></strong><strong>Come join the Parker Meggitt Aerospace Team! We are proud to offer competitive benefits designed with health, wealth, and well-being in mind. Our competitive package includes:<br/><br/></strong><ul><li>Comprehensive medical, dental, and vision coverage from day one, including Health Savings and Reimbursement Accounts.</li><li>Wellness incentive credits leading to reduced healthcare premiums.</li><li>Access to Employee Assistance Program (EAP) for health and well-being support.</li><li>On-site facilities: cafeteria with a wide array of food options, mini-mart, and vending machines.</li><li>Participation in health and emotional well-being challenges with rewards.<br/><br/></li></ul><strong>Financial Security And Growth<br/><br/></strong><ul><li>Competitive salary with an annual bonus incentive plan.</li><li>Retirement benefits: 401(k) with 5% company match opportunity.</li><li>Income Protection, Life Insurance, Accidental Life and dismemberment Insurance, Short and Long-Term Disability insurance.<br/><br/></li></ul><strong>Work-Life Balance And Flexibility<br/><br/></strong><ul><li>Generous Paid Time Off: 120 hours, plus up to 15 paid holidays including a company-wide shut down between Christmas and New Year’s.</li><li>Parental Leave: 4 weeks at 100% pay for new family additions.</li><li>Extras like Adoption Assistance, financial guidance resources, paid jury duty, bereavement time, and time off for citizenship testing, marriage, and birth.<br/><br/></li></ul><strong>Career Advancement And Education<br/><br/></strong><ul><li>Career development opportunities with up to $10,000 tuition reimbursement per year.</li><li>Support for ongoing education through our Educational Reimbursement program.<br/><br/></li></ul><strong>Parker Purpose Opportunities<br/><br/></strong><ul><li>Business Resource Groups promoting diversity, equity and inclusion.</li><li>Volunteering day off and social committee activities throughout the year.<br/><br/></li></ul><strong>Additional Benefits<br/><br/></strong><ul><li>Employee Perks on various services (car purchases, computer purchases, life adventures, etc.) </li><li>Employee Referral program - Refer a family member or friend and receive a generous award for referrals that are hired (up to $4,000)</li><li>Dress for Your Day policy, offering flexible work attire options.<br/><br/></li></ul><strong>Equal Employment Opportunity<br/><br/></strong>Parker is an Equal Opportunity and Affirmative Action Employer. Parker is committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job related reasons regardless of race, ethnicity, color, religion, sex, sexual orientation, age, national origin, disability, gender identity, genetic information, veteran status, or any other status protected by law. However, U.S. Citizenship, Permanent Residency or other appropriate status is required for certain positions, in accord with U.S. import &amp; export regulations.<br/><br/>Salary: $81,226 - $106,179 - $131,131<br/><br/>(“Minority / Female / Disability / Veteran / VEVRAA Federal Contractor”)<br/><br/>If you would like more information about Equal Employment Opportunity as an applicant under the law, please go to Know Your Rights: Workplace Discrimination is Illegal (eeoc.gov) and Genetic Information Discrimination<br/><br/><strong>Drug Tests<br/><br/></strong><strong>Drug-Free Workplace<br/><br/></strong>In accordance with Parker’s policies and applicable state laws, Parker provides for a drug-free workplace. Therefore, all applicants seeking employment with Parker will be subject to drug testing as a condition of employment.", "responsibilities": "The Planner II uses expertise in defining the required purchases or deliverables by planning, scheduling and monitoring the movement of materials or services throughout the product life cycle. Analyzes procurement planning requirements for specific area and maintains appropriate levels of inventory at planned levels.", "qualifications": {"required": "Knowledge of procurement/planning best practices and experience with managing tight development program deadlines in aerospace/manufacturing environment, Experience in Enterprise Resource Planning (ERP) and Material Requirements Planning (MRP) systems, Highly organized with the ability to work under pressure to meet deadlines, Solves complex problems and exercises judgment based on the analysis of multiple sources of information, Excellent interpersonal and communication skills (written and verbal), with ability to drive tasks to completion, Proficient in Microsoft Office Suite and database management tools", "preferred": "APICS CPIM Certification"}, "skills": ["Procurement", "Planning", "Aerospace", "Manufacturing", "ERP", "MRP", "Microsoft Office", "Database Management", "APICS CPIM"], "postedDate": "17 hours ago", "benefits": "Comprehensive medical, dental, and vision coverage from day one, including Health Savings and Reimbursement Accounts., Wellness incentive credits leading to reduced healthcare premiums., Access to Employee Assistance Program (EAP) for health and well-being support., On-site facilities: cafeteria with a wide array of food options, mini-mart, and vending machines., Participation in health and emotional well-being challenges with rewards., Competitive salary with an annual bonus incentive plan., Retirement benefits: 401(k) with 5% company match opportunity., Income Protection, Life Insurance, Accidental Life and dismemberment Insurance, Short and Long-Term Disability insurance., Generous Paid Time Off: 120 hours, plus up to 15 paid holidays including a company-wide shut down between Christmas and New Year’s., Parental Leave: 4 weeks at 100% pay for new family additions., Extras like Adoption Assistance, financial guidance resources, paid jury duty, bereavement time, and time off for citizenship testing, marriage, and birth., Career development opportunities with up to $10,000 tuition reimbursement per year., Support for ongoing education through our Educational Reimbursement program., Business Resource Groups promoting diversity, equity and inclusion., Volunteering day off and social committee activities throughout the year., Employee Perks on various services (car purchases, computer purchases, life adventures, etc.) , Employee Referral program - Refer a family member or friend and receive a generous award for referrals that are hired (up to $4,000), Dress for Your Day policy, offering flexible work attire options.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948960304"}