{"jobTitle": "Global Head of Marketing, Instagram", "company": {"name": "Instagram", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "296,000.00/yr - 356,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Meta is looking for an experienced Marketing Leader with a passion for building global brands and proven experience developing and executing insights-driven marketing efforts that build affinity and engagement with Instagram’s audiences. In this role, you will act as Instagram’s CMO to lead Brand and Product Marketing teams driving brand strategy, integrated and product marketing, and brand building aimed at growing and engaging Instagram’s global community of potential and current users across the marketing funnel. This leader will be responsible for developing our overall strategy while flawlessly executing our brand strategy, programs and product launches at scale.The ideal candidate will have strong experience with consumer marketing and product development, proven ability to develop cross-functional partnerships with product and business teams, and a track record of running multi-channel campaigns for high-profile global brands within the consumer tech or CPG industries. You will be expected to apply analytical rigor, a deep understanding of country-level market dynamics, and the right mix of brand and product knowledge to deliver effective marketing plans for measurable ROI to the business.To be successful at Meta, you need to embrace the hacker ethos: an ability to move fast, iterate and always be adding value. The successful candidate will need to be tenacious and open, creative and analytical. This person must be able to connect the dots between the business, product strategy and brand strategy, and extract true insights that translate into inspiring briefs that spark world class creativity. They must have a proven ability to build influence and drive alignment across matrixed stakeholders, be a highly effective operator, and inspire and support a growing team with deep care, thoughtfulness and mentorship.<br/><br/>Global Head of Marketing, Instagram Responsibilities:<br/><br/><ul><li>Lead the strategic vision and execution of Instagram’s iconic brand and global marketing programs</li><li>Influence Instagram’s product strategy and roadmap through research, testing and insights, and building effective go-to-market strategies to bring innovative advertising experiences to market</li><li>Develop, manage, and grow a team of integrated, brand and product marketers for Instagram</li><li>Define and manage comprehensive outbound marketing strategy and planning including segmentation, targeting, market sizing, media and communications plan, roll-out strategy, and integration with PR, Editorial, growth, partnerships and performance marketing</li><li>Lead and collaborate with a multitude of cross-functional stakeholders to deliver world-class marketing campaigns, product launches and GTMs</li><li>Develop, manage and support the execution of integrated marketing communications efforts that encompass a 360 approach across various channels (digital, social, traditional media, etc.) to support key narratives and impact stories</li><li>Track, distill and guide performance of campaigns to provide data-backed insights to optimize campaigns and find new opportunity areas</li><li>Ensure all efforts are based on solid hypothesis design and are structured to deliver against clear success metrics, utilizing a test-and-learn approach</li><li>Partner closely with creative teams and agency partners to bring strategy to life through quality creative</li><li>Lead market assessment, quantitative analysis, and qualitative feedback and represent our users internally</li><li>Build strong collaborative relationships and alliances with key internal and external teams and partners to prioritize and establish the team’s roadmap, delivering against clearly defined brand objectives while ensuring positive and productive team environments</li><li>Model inclusive behaviors and build a diverse organization that values, respects, and taps into different backgrounds and perspectives<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>12+ years of experience with brand and product marketing, consumer products and/or brand management, with brands and at companies with global scale</li><li>8+years of experience with team leadership, cross-functional team leadership, or team management</li><li>Track record of developing global strategy and delivering impactful communication and campaigns internationally - proven with data</li><li>Data Driven - displayed and proven experience in using data to both (i) inform strategy and communication (ii) develop meaningful GTM approaches that drive business outcomes</li><li>Experience building mass-market consumer-centric brands</li><li>Experience developing and executing large-scale or global integrated marketing campaigns (online/offline advertising, web, events), including experience with both brand-building and acquisition marketing initiatives</li><li>Experience partnering with external companies (partners, agencies, vendors, retailers) and influencing / managing up to executive, VP and cross-functional leadership</li><li>Experience partnering with product management, product design, and other cross-functional teams (Analytics, Research, Creative etc) to drive business results</li><li>Demonstrated experience utilizing consumer research and data to drive actionable insights to inform marketing strategy and improve the consumer experience</li><li>Experience managing multiple campaigns and/or product launch GTMs simultaneously, working with many different internal and external teams to ensure we are launching our programs seamlessly and to the highest impact</li><li>Bachelor's Degree<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience leading consumer marketing for large-scale tech brands</li><li>Experience working and thriving in a self-starter, fast-paced and changing environment<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$296,000/year to $356,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.<br/><br/>", "responsibilities": "Lead the strategic vision and execution of Instagram’s iconic brand and global marketing programs\nInfluence Instagram’s product strategy and roadmap through research, testing and insights, and building effective go-to-market strategies to bring innovative advertising experiences to market\nDevelop, manage, and grow a team of integrated, brand and product marketers for Instagram\nDefine and manage comprehensive outbound marketing strategy and planning including segmentation, targeting, market sizing, media and communications plan, roll-out strategy, and integration with PR, Editorial, growth, partnerships and performance marketing\nLead and collaborate with a multitude of cross-functional stakeholders to deliver world-class marketing campaigns, product launches and GTMs\nDevelop, manage and support the execution of integrated marketing communications efforts that encompass a 360 approach across various channels (digital, social, traditional media, etc.) to support key narratives and impact stories\nTrack, distill and guide performance of campaigns to provide data-backed insights to optimize campaigns and find new opportunity areas\nEnsure all efforts are based on solid hypothesis design and are structured to deliver against clear success metrics, utilizing a test-and-learn approach\nPartner closely with creative teams and agency partners to bring strategy to life through quality creative\nLead market assessment, quantitative analysis, and qualitative feedback and represent our users internally\nBuild strong collaborative relationships and alliances with key internal and external teams and partners to prioritize and establish the team’s roadmap, delivering against clearly defined brand objectives while ensuring positive and productive team environments\nModel inclusive behaviors and build a diverse organization that values, respects, and taps into different backgrounds and perspectives", "qualifications": {"required": "12+ years of experience with brand and product marketing, consumer products and/or brand management, with brands and at companies with global scale\n8+years of experience with team leadership, cross-functional team leadership, or team management\nTrack record of developing global strategy and delivering impactful communication and campaigns internationally - proven with data\nData Driven - displayed and proven experience in using data to both (i) inform strategy and communication (ii) develop meaningful GTM approaches that drive business outcomes\nExperience building mass-market consumer-centric brands\nExperience developing and executing large-scale or global integrated marketing campaigns (online/offline advertising, web, events), including experience with both brand-building and acquisition marketing initiatives\nExperience partnering with external companies (partners, agencies, vendors, retailers) and influencing / managing up to executive, VP and cross-functional leadership\nExperience partnering with product management, product design, and other cross-functional teams (Analytics, Research, Creative etc) to drive business results\nDemonstrated experience utilizing consumer research and data to drive actionable insights to inform marketing strategy and improve the consumer experience\nExperience managing multiple campaigns and/or product launch GTMs simultaneously, working with many different internal and external teams to ensure we are launching our programs seamlessly and to the highest impact\nBachelor's Degree", "preferred": "Experience leading consumer marketing for large-scale tech brands\nExperience working and thriving in a self-starter, fast-paced and changing environment"}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "$296,000/year to $356,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3948974980"}