{"jobTitle": "Navigator - Housing", "company": {"name": "Downtown Women's Center", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other, Information Technology, and Management", "industry": "Non-profit Organizations", "description": "<strong>Summary<br/><br/></strong>The Downtown Women’s Center seeks a full-time Housing Navigator to provide landlord engagement, landlord retention, landlord mediation, and intensive case management services to individual women and families who are unhoused. The Community Based Housing Department supports women who have experienced trauma to get connected to permanent housing. As an advanced case management position, the Housing Navigator will help identify available housing stock in Los Angeles County and assist women with securing permanent housing. This position is part of an interdisciplinary team and provides innovative services that are at the forefront of homeless services. An ideal candidate practices Trauma-Informed Care and provides case management services with a strengths-based approach, is communicative, flexible, and creative. This position is part of the Housing Department and reports directly to the Housing Navigation Supervisor.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Develop, cultivate, and maintain positive partnerships with Los Angeles County landlords and property management companies. </li><li>Coordinate and collaborate regularly host landlord engagement and appreciation events. </li><li>Advocate for fair housing and safe living conditions for participants. In addition, the Housing Navigator provides landlord-participant mediation in which Housing Navigators provide problem-solving solutions. This may require the Housing Navigator to provide these services in person. </li><li>Manage a caseload of 20 participants, providing individualized support and guidance throughout the housing search and placement process. </li><li>Creates and develops individual housing search plan for each participant, bio-psycho-social assessments, and budget worksheet quarterly, including goals to ensure housing stability and successful tenancy. </li><li>Assist in searching and securing housing opportunities, including the completion of housing applications and securing required documentation (e.g., Social Security card, birth certificate, prior rental history, income documentation). </li><li>Reviews and completes a housing safety assessment plan and lease agreements. </li><li>Establishes procedures and resources to retain housing, including developing a housing support crisis plan that includes prevention and early intervention services when housing is at risk. </li><li>If included in the housing support plan, identifying, and securing resources to cover expenses, such as security deposit, moving costs, adaptive aids, environmental modifications, moving costs, and other expenses. </li><li>Work closely with the Time Limited Subsidies – Every Woman Housed team. </li><li>Implement and consistently practice harm reduction, trauma informed care, housing first, and integrated care interventions in daily work. </li><li>Maintain accurate and timely records of activities and services provided to each participant using HMIS/Clarity, and other tracking systems. </li><li>Maintain up to date, accurate, and complete data and progress notes, records, and communication logs regarding referrals, housing applications, and participate in quarterly reviews as required by the project and its funding sources. Quarterly review requires Housing Navigator to respond to colleagues’ feedback and make necessary corrections in a timely manner. </li><li>Provide weekly and monthly written reports, and additional reports as assigned. </li><li>Collaborate with landlord data collection. </li><li>Work closely with other departments to provide housing leads and support for unhoused clients. </li><li>Other duties as assigned to support the mission of the organization. <br/><br/></li></ul>Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.<br/><br/><strong>Competencies <br/><br/></strong><ul><li>Cultural humility and responsiveness </li><li>Trauma-informed </li><li>Collaboration Skills </li><li>Organization Skills </li><li>Decision Making </li><li>Communication Proficiency </li><li>Relationship Management </li><li>Empathy</li><li>Creativity</li><li>Flexibility <br/><br/></li></ul><strong>Supervisory Responsibility <br/><br/></strong>This position does not have supervisory responsibilities.<br/><br/><strong>Work Environment <br/><br/></strong>This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets, and fax machines.<br/><br/><strong>Physical Demands <br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear. Specific vision abilities required by this job include close vision and the ability to adjust focus. This position would also require the ability to lift files, open filing cabinets and bend or stand on a stool as necessary.<br/><br/><strong>Position Type and Expected Hours of Work <br/><br/></strong>This is a full-time, nonexempt position. Days and hours of work are 8:30am-5pm.<br/><br/><strong>Travel <br/><br/></strong>Regular travel throughout Los Angeles County is required in this position.<br/><br/><strong>Required Education, Experience, And Qualifications<br/><br/></strong><ul><li>Preferred bachelor’s degree in social work or related field and strong knowledge of the complexity of poverty and women’s homelessness, domestic violence, mental illness, trauma, substance abuse, health issues, and older adults preferred. </li><li>Experience working directly with landlords through property management, real estate or housing navigation services preferred. </li><li>Two years of experience working as a case manager/housing specialist/similar position and knowledge of community resources preferred </li><li>Resourcefulness in locating housing (market rate rent and subsidized housing) </li><li>Knowledge of Fair Housing laws, eviction prevention, and experience working directly with landlords through property management, real estate, or housing navigation services </li><li>Ability to build and sustain relationships </li><li>Excellent active listening and crisis intervention skills with ability to exercise and model good judgment. </li><li>Strong interpersonal, written, and oral communication skills; proven ability to communicate with diverse audiences. </li><li>Ability to manage multiple tasks and priorities, including proficiency in balancing direct service responsibilities with effective record-keeping. </li><li>Strong administrative skills and proficiency in Microsoft Office Suite (Word, Excel, Outlook) required </li><li>HMIS, CHAMP or other database management preferred. </li><li>Critical Time Intervention Certification a plus. </li><li>Current valid California state driver’s license, insurance, and vehicle with good driving record required. </li><li>Oral and written fluency in Spanish and English a plus. </li><li>Cultural humility. </li><li>Must be a CA resident and live no more than 80 miles from DWC; must be available for in-person meetings at DWC. </li><li>Must provide documentation of a negative TB test result within the last twelve months, on first day of hire. </li><li>You will be required to be up to date on your vaccinations against COVID-19 and provide documentation. If you are fully vaccinated and not yet eligible to receive a booster dose, then you must receive the booster dose within 30 days of becoming eligible and eligibility begins 5 months after receiving the final primary dose. If you are fully vaccinated and have received a booster dose, you are considered up to date with your vaccinations. Unvaccinated individuals must receive their 1st dose before their first day of hire. Partially vaccinated (for 2-dose series) individuals must receive their 2nd dose within 30 days of being hired. The second dose of a two-dose vaccine series is due 4 weeks after the primary dose. <br/><br/></li></ul><strong>Pay Range <br/><br/></strong>$24.03 – 25.48/hour<br/><br/><strong>Work Authorization/Security Clearance <br/><br/></strong>Being authorized to work in the U.S. is a precondition of employment. DWC does not sponsor employment visas, such as H-1B.<br/><br/>Downtown Women’s Center provides equal employment opportunities (EEO) to all employees and applicants and actively seeks candidates who reflect the rich diversity of the communities that we serve. We are committed to a work environment that embraces and promotes individuality and inclusion. We believe that diversity and inclusion of varied perspectives, backgrounds, and life experiences are essential to our organization’s effectiveness, and allow us to serve our clients in the respectful, responsive, and understanding way that they deserve. We define diversity in broad terms to include race, ethnicity, age, gender, religion, sexual orientation, gender identity and expression, mental or physical disability, marital status, pregnancy, military and veteran status, medical condition, geography, socio-economic status, and other unique attributes that make us who we are.<br/><br/>Downtown Women’s Center complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/><strong>Other Duties<br/><br/></strong>Please note this job description is not designed to cover or contain a comprehensive listing of all activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.", "responsibilities": "Develop, cultivate, and maintain positive partnerships with Los Angeles County landlords and property management companies. \nCoordinate and collaborate regularly host landlord engagement and appreciation events. \nAdvocate for fair housing and safe living conditions for participants. In addition, the Housing Navigator provides landlord-participant mediation in which Housing Navigators provide problem-solving solutions. This may require the Housing Navigator to provide these services in person. \nManage a caseload of 20 participants, providing individualized support and guidance throughout the housing search and placement process. \nCreates and develops individual housing search plan for each participant, bio-psycho-social assessments, and budget worksheet quarterly, including goals to ensure housing stability and successful tenancy. \nAssist in searching and securing housing opportunities, including the completion of housing applications and securing required documentation (e.g., Social Security card, birth certificate, prior rental history, income documentation). \nReviews and completes a housing safety assessment plan and lease agreements. \nEstablishes procedures and resources to retain housing, including developing a housing support crisis plan that includes prevention and early intervention services when housing is at risk. \nIf included in the housing support plan, identifying, and securing resources to cover expenses, such as security deposit, moving costs, adaptive aids, environmental modifications, moving costs, and other expenses. \nWork closely with the Time Limited Subsidies – Every Woman Housed team. \nImplement and consistently practice harm reduction, trauma informed care, housing first, and integrated care interventions in daily work. \nMaintain accurate and timely records of activities and services provided to each participant using HMIS/Clarity, and other tracking systems. \nMaintain up to date, accurate, and complete data and progress notes, records, and communication logs regarding referrals, housing applications, and participate in quarterly reviews as required by the project and its funding sources. Quarterly review requires Housing Navigator to respond to colleagues’ feedback and make necessary corrections in a timely manner. \nProvide weekly and monthly written reports, and additional reports as assigned. \nCollaborate with landlord data collection. \nWork closely with other departments to provide housing leads and support for unhoused clients. \nOther duties as assigned to support the mission of the organization.", "qualifications": {"required": "Preferred bachelor’s degree in social work or related field and strong knowledge of the complexity of poverty and women’s homelessness, domestic violence, mental illness, trauma, substance abuse, health issues, and older adults preferred. \nExperience working directly with landlords through property management, real estate or housing navigation services preferred. \nTwo years of experience working as a case manager/housing specialist/similar position and knowledge of community resources preferred \nResourcefulness in locating housing (market rate rent and subsidized housing) \nKnowledge of Fair Housing laws, eviction prevention, and experience working directly with landlords through property management, real estate, or housing navigation services \nAbility to build and sustain relationships \nExcellent active listening and crisis intervention skills with ability to exercise and model good judgment. \nStrong interpersonal, written, and oral communication skills; proven ability to communicate with diverse audiences. \nAbility to manage multiple tasks and priorities, including proficiency in balancing direct service responsibilities with effective record-keeping. \nStrong administrative skills and proficiency in Microsoft Office Suite (Word, Excel, Outlook) required \nHMIS, CHAMP or other database management preferred. \nCritical Time Intervention Certification a plus. \nCurrent valid California state driver’s license, insurance, and vehicle with good driving record required. \nOral and written fluency in Spanish and English a plus. \nCultural humility. \nMust be a CA resident and live no more than 80 miles from DWC; must be available for in-person meetings at DWC. \nMust provide documentation of a negative TB test result within the last twelve months, on first day of hire. \nYou will be required to be up to date on your vaccinations against COVID-19 and provide documentation. If you are fully vaccinated and not yet eligible to receive a booster dose, then you must receive the booster dose within 30 days of becoming eligible and eligibility begins 5 months after receiving the final primary dose. If you are fully vaccinated and have received a booster dose, you are considered up to date with your vaccinations. Unvaccinated individuals must receive their 1st dose before their first day of hire. Partially vaccinated (for 2-dose series) individuals must receive their 2nd dose within 30 days of being hired. The second dose of a two-dose vaccine series is due 4 weeks after the primary dose.", "preferred": "Preferred bachelor’s degree in social work or related field and strong knowledge of the complexity of poverty and women’s homelessness, domestic violence, mental illness, trauma, substance abuse, health issues, and older adults preferred. \nExperience working directly with landlords through property management, real estate or housing navigation services preferred. \nTwo years of experience working as a case manager/housing specialist/similar position and knowledge of community resources preferred"}, "skills": ["Trauma-Informed Care", "Case Management", "Strengths-Based Approach", "Communication", "Flexibility", "Creativity", "Cultural Humility", "Responsiveness", "Collaboration", "Organization", "Decision Making", "Communication Proficiency", "Relationship Management", "Empathy", "Microsoft Office Suite", "HMIS", "CHAMP", "Critical Time Intervention", "Spanish", "English"], "postedDate": "2 weeks ago", "salary": {"amount": "24.03 – 25.48/hour", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3948073784"}