{"jobTitle": "Membership Specialist", "company": {"name": "UFC GYM", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Wellness and Fitness Services", "description": "The Membership Specialist (MS) will represent UFC GYM by providing a welcoming, informative and entertaining experience for all members and guests during their visits. The Membership Specialist is responsible for driving potential members into the gym to deliver industry leading customer services to them as well as our current members. This service must translate into exceeding personal revenue targets issued by management through both internal and external prospecting.<br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong>Lead Generation &amp; Appointment Booking<br/><br/><ul><li>External marketing, promotions and prospecting. This is a daily activity and requires off site promotions including distributing passes, building relationships with local merchants and branding events to inform the community of UFC gym and services, ultimately resulting into leads. (A lead is a non-member’s name and contact information.)</li><li>Internal marketing and prospecting. This includes collecting leads at the point of enrollment and from the current member base through relationship building and referral tables. These activities must translate into lead gathering. </li><li>Book membership appointments through productive phone activities and meet or exceed monthly appointment goals set forth by the company. </li><li>Ensure that appointments are booked to translate into enough guests and meet or exceed monthly guest goal set forth by the company.<br/><br/><br/></li></ul>Guest Touring, Membership Presentations, &amp; Personal Production<br/><br/><ul><li>Ensure that 100% of guests are presented the “Fitness Tour” when touring guests around the gym as detailed in the Membership Specialist Playbook. (These tours should translate into enrolling half of the guests that are seen on a membership (50% Closing) and enrolling with Personal Training (25%). </li><li>Use the company approved presentation when presenting membership options to non-members. Ensure each new member meets a manager before completing the sales process and exiting the gym. Proper presentation and introductions to the manager should translate to 50% closing of guests. </li><li>Ensure Personal Sales Room Financial goals are met or exceeded each month</li><li>New Member Sales Revenue (NMS), Point of Sales Personal Training Revenue (POS PT) and New Electronic Funds Transfer Sets (EFT). </li><li>Ensure Sales Drivers are Held accountable to meeting or exceeding the required sales behaviors that will lead to delivering the Key Metrics set forth by management.</li><li>Ensure integrity of each sale by attaching supporting documents and signature (corporate approved specials, discounts, etc.) with each agreement. <br/><br/><br/></li></ul>Customer Service<br/><br/><ul><li>Follow up with members that have enrolled to ensure we are exceeding expectations.</li><li>Provide the highest level of customer service possible when communicating and interacting with guests. </li><li>Assist in maintaining a clean and operational facility.</li><li>Accountable for saving members that are requesting to cancel their membership. If the Membership Specialist is unable to convince a member from canceling they must have any manager meet the member and sign off on the cancellation. <br/><br/><br/></li></ul>Miscellaneous<br/><br/><ul><li>Sales Schedule: Schedules are set a month in advance and given during the first week of each month and approved by the General Manager. All Membership Specialist must be available to work Weekends and Holidays. Requests for days off must be given in writing and exceptions can be made by the General Manager. </li><li>Mandatory Meetings: Monthly “All Team Meeting” and “Daily Production Meetings” are mandatory. </li><li>Uniform Policy: The Membership Specialist uniform consists of a UFC Gym Black Polo, Long Dress Slacks (Black, Blue or Khaki) or Jeans (Blue or Black) in good condition with no rips or holes. Dress shoes or Casual Dress Shoes must be worn in good condition. No athletic shoes allowed. Black jackets may be worn. No hoodies or sweatshirts. No hats or head wear. </li><li>Timekeeping: Membership Specialists must record time worked while using the company check-in system. Membership Specialists must be in uniform and perform work activities when punched in. Specialists must also punch out for lunch with-in 5 hours and working off the clock in not permitted. In the event of a missed punch, the Membership Specialist must fill out the adjustment form and turn in to management.<br/><br/><br/></li></ul><strong> REQUIRED QUALIFICATIONS: <br/><br/></strong><strong>Knowledge, Skills &amp; Abilities<br/><br/></strong><ul><li>In-depth knowledge of sales practices and techniques.</li><li>General understanding of Fitness Industry.</li><li>Ability to work with computers. </li><li>Must have good interpersonal communication skills.</li><li>Excellent customer service skills</li><li>Independent, self-starter with strong organizational skills.</li><li>Must be a team player<br/><br/><br/></li></ul>Minimum certifications/educational level:<br/><br/><ul><li>High school degree or GED required.</li><li>Must complete company sales training and orientation program.<br/><br/><br/></li></ul>Minimum experience:<br/><br/><ul><li>1-2 years sales experience preferred.<br/><br/><br/></li></ul><em> This franchise is independently owned and operated by a franchisee. Your application will go directly to the franchisee, and all hiring decisions will be made by the management of this franchisee. All inquiries about employment at this franchisee should be made directly to the franchise location, and not to UFC Gym.</em>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3949317787"}