{"jobTitle": "Escrow Assistant", "company": {"name": "First American", "industry": "Financial Services", "size": "51-200 employees", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$18.70/hr - $25.00/hr", "currency": "USD"}, "jobFunction": "Sales and Management", "industry": "Financial Services", "description": "For over 25 years, Pango Group has been one of California's leading independent escrow resources, and much of that is accredited to building a people-first culture. We’re firm believers that when a company holds true to its mission, vision, and values and invests in its people, the sky's the limit when it comes to creating amazing partnerships, happy clients, and a fulfilled team of employees. Our partnership with First American brought together two people-first companies, and that’s been an integral part of our mutual success, including being named one of the Los Angeles Best Places to Work for the eight consecutive years and Fortune 100 Best Companies to Work For list for nine consecutive years. We hire hungry, humble, and smart individuals (that’s why you’re here!) and believe the inclusion of everyone is very important. This is true throughout all of our brands and offices, which has led us to be included in more than 50 regional best places to work. \n\nWhat We Do\nEnable you to apply your administrative, support and interpersonal skills to your team and our customer as we lead the industry in transforming how residential real estate transactions are completed. We value our culture and need energetic people that love the details while thriving in delivering exceptional customer experiences.\n\nCome join Glen Oaks Escrow at First American, where we recognize our true worth is our people. We are looking to add an Escrow Assistant to our growing team. In this role you will work in a dynamic, fast-paced setting supporting our Escrow team in a variety of ways including customer support and administrative duties.  This position plays a key role in making the dream of home ownership a reality.", "responsibilities": "Assist in the escrow process, such as opening orders, inputting closing statement information, preparing documents for closing, handling the complete disbursement and follow-up. Communicate regularly with customers during the escrow process flow. Interpret various agreements as they relate to escrow closings. Working with a variety of technologies to enable escrow transactions, assisting customers to ensure a phenomenal customer experience.", "qualifications": {"required": "High school diploma or equivalent. 2+ years of escrow-related experience preferred.", "preferred": "Passion for helping customers while maintaining a professional and positive attitude. Excellent verbal and written communication with both our internal teams and external customers. Problem solver with strong organizational skills, is detail oriented, a natural curiosity with an eagerness to learn. Thrives in contributing to a team working together to deliver beyond customer expectations. Knowledge of MS Office suite and ability to quickly adapt to new software applications and technologies."}, "skills": ["Customer Service", "Communication", "Organizational Skills", "MS Office", "Escrow Process"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "By choice, we don’t simply accept individuality – we embrace it, we support it, and we thrive on it! Our People First Culture celebrates diversity, equity and inclusion not simply because it’s the right thing to do, but also because it’s the key to our success. We are proud to foster an authentic and inclusive workplace For All. You are free and encouraged to bring your entire, unique self to work. First American is an equal opportunity employer in every sense of the term. Based on eligibility, First American offers a comprehensive benefits package including medical, dental, vision, 401k, PTO/paid sick leave and other great benefits like an employee stock purchase plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3949886459"}