{"jobTitle": "Operations Supervisor - 1st Shift", "company": {"name": "GXO Logistics, Inc.", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$66,560.00 - $79,872.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "At GXO, we’re constantly looking for talented individuals at all levels who can deliver the caliber of service our company requires. You know that a positive work environment creates happy employees, which boosts productivity and dedication. On our team, you’ll have the support to excel at work and the resources to build a career you can be proud of.<br/><br/>1st Shift, Wednesday - Sunday, 5:30am - 3:30pm<br/><br/>We are looking for an Operations Supervisor who can bring out the best in his/her team. If you know how to encourage people to continually raise the bar, while taking responsibility for all day-to-day warehouse operations, you might be an ideal fit for our growing company. As a member of our team, you’ll have the committed support to excel at your job and the resources to build an exciting career.<br/><br/><strong><strong>Pay, Benefits And More.<br/><br/></strong></strong>The annual salary range for this role is $66,560 - $79,872. GXO, in good faith, believes this is the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range and this range is only applicable for jobs to be performed in California. This rate may be modified in the future. We offer a comprehensive package of benefits including paid time off, medical/dental/vision insurance, 401(k), and other benefits to eligible employees. You can apply for this role by clicking on the Apply now button at the bottom of this posting (or through the Employee Job Hub if you are a current GXO employee). Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company’s sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/><strong><strong>Pay, Benefits And More. <br/><br/></strong></strong>We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability and more.<br/><br/><strong>What you’ll do on a typical day: <br/><br/><br/></strong><ul><li>Ensure efficient daily operations of the warehouse; prepare schedules </li><li>Supervise the team and provide training and coaching to improve performance </li><li>Monitor work quality to consistently deliver exceptional customer service </li><li>Demonstrate an understanding of the company quality policy </li><li>Adhere to the 7S program and maintain a clean environment at all times </li><li>Communicate well with leadership, team members and other departments </li><li>Implement continuous improvement action plans <br/><br/><br/></li></ul><strong>What you need to succeed at GXO: <br/><br/></strong>At a minimum, you’ll need:<br/><br/><br/><ul><li>2 years of relevant work experience </li><li>Experience with Microsoft Office (Word, Excel and Outlook) and computerized scanner equipment </li><li>Availability to work a flexible schedule as needed, including planned and unplanned overtime, which may include weekends<br/><br/><br/></li></ul>It’d be great if you also have:<br/><br/><br/><ul><li>Bachelor's degree in Logistics or a related field</li><li>2 years of managerial or supervisory experience</li><li>Bilingual English/Spanish</li><li>Experience in an AS9100 or ISO environment</li><li>Warehousing or Third-Party Logistics (3PL) experience <br/><br/><br/></li></ul>This job requires the ability to:<br/><br/><br/><ul><li>Lift objects of various shapes, sizes and weights</li><li>Stand, sit or walk for extended periods of time</li><li>Reach (including above your head), bend, climb, push, pull, twist, squat and kneel </li><li>Handle or manage tools or equipment</li><li>Tolerate hot or cold warehouse environments<br/><br/><br/></li></ul><strong>We engineer faster, smarter, leaner supply chains.<br/><br/></strong>#appcast5<br/><br/>GXO is a leading provider of cutting-edge supply chain solutions to the most successful companies in the world. We help our customers manage their goods most efficiently using our technology and services. Our greatest strength is our global team – energetic, innovative people of all experience levels and talents who make GXO a great place to work.<br/><br/>We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran or other protected status.<br/><br/>GXO adheres to CDC, OSHA and state and local requirements regarding COVID safety. All employees and visitors are expected to comply with GXO policies which are in place to safeguard our employees and customers.<br/><br/>All applicants who receive a conditional offer of employment may be required to take and pass a pre-employment drug test.<br/><br/>The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. Review GXO's candidate privacy statement here.", "responsibilities": "Ensure efficient daily operations of the warehouse; prepare schedules\nSupervise the team and provide training and coaching to improve performance\nMonitor work quality to consistently deliver exceptional customer service\nDemonstrate an understanding of the company quality policy\nAdhere to the 7S program and maintain a clean environment at all times\nCommunicate well with leadership, team members and other departments\nImplement continuous improvement action plans", "qualifications": {"required": "2 years of relevant work experience\nExperience with Microsoft Office (Word, Excel and Outlook) and computerized scanner equipment\nAvailability to work a flexible schedule as needed, including planned and unplanned overtime, which may include weekends", "preferred": "Bachelor's degree in Logistics or a related field\n2 years of managerial or supervisory experience\nBilingual English/Spanish\nExperience in an AS9100 or ISO environment\nWarehousing or Third-Party Logistics (3PL) experience"}, "skills": ["Microsoft Office", "Excel", "Outlook", "Warehousing", "Logistics", "Management", "Supervisory", "Training", "Customer Service", "Quality Policy", "Communication", "Continuous Improvement"], "postedDate": "2 days ago", "benefits": "The annual salary range for this role is $66,560 - $79,872. GXO, in good faith, believes this is the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range and this range is only applicable for jobs to be performed in California. This rate may be modified in the future. We offer a comprehensive package of benefits including paid time off, medical/dental/vision insurance, 401(k), and other benefits to eligible employees. You can apply for this role by clicking on the Apply now button at the bottom of this posting (or through the Employee Job Hub if you are a current GXO employee). Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company’s sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/>We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3949499940"}