{"jobTitle": "Development Manager", "company": {"name": "Inner City Law Center", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "66,560.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Legal Services", "description": "(Full-Time, Exempt Position)<br/><br/>Inner City Law Center (ICLC) is a nonprofit law firm located in the Skid Row neighborhood of Los Angeles. We are looking for extraordinary people to help us end homelessness in Los Angeles. Founded on the fundamental principle that every person should always be treated with dignity and respect, ICLC fights for justice for low-income tenants, working-poor families, people who are disabled or experiencing homelessness, people living with HIV/AIDS, and homeless veterans.<br/><br/><strong>Position Description: </strong>Reporting to the Director of Development, the Development Manager plays an important role in advancing the fundraising goals of Inner City Law Center. The Development Manager will help in strengthening and maintaining our fundraising systems and data using Salesforce and other platforms, coordinate annual mailings and manage special events. The Development Manager will work collaboratively with the Director of Development on building upon our individual giving donor program, including identification, cultivation, solicitation and stewardship of donors and look for ways to increase engagement with our donors and foster growth with our sponsors and partners. The Development Manager will also contribute to the preparation of annual reports and other department communication pieces.<br/><br/><strong>Responsibilities: <br/><br/></strong><ul><li>Work with the Director of Development to create key strategies to drive Inner City Law Center’s fundraising efforts. </li><li>Design, create and produce appeals and campaigns targeted to donors and potential donors; manage, produce and lead the year-end appeal. </li><li>Coordinate logistics and administration for Annual Luncheon and other development events. </li><li>Support in identifying, cultivating, securing and stewarding donors (individual and corporate) and developing our Individual Giving program. </li><li>Research and prospect new corporate partners; conduct meetings with corporate partners to discuss funding opportunities and partnership enhancements. </li><li>Support all areas of development including direct mail and digital campaign solicitations, donor presentations, annual reports and newsletters. </li><li>Collaborate on team-wide development projects, including fundraising campaigns and special events. </li><li>Maintain a highly collaborative relationship with other ICLC departments and programs and identify and capture client stories and testimonials to support development outreach and communications campaigns. </li><li>Work with volunteers, Annual Luncheon Committee and other ICLC staff as necessary for department events and initiatives. </li><li>Maintain clear and accurate records in Salesforce. </li><li>Generate reports in Salesforce to support prospect research, mailings and other department needs. </li><li>Perform other duties as assigned. <br/><br/><br/></li></ul><strong>Hiring Criteria</strong>: A minimum of five years of experience in a nonprofit role (ideally in development), managing fundraising systems, individual donor relationships and/or corporate partnerships. Commitment to ICLC’s mission and values. Excellent oral and written communication skills. Strong computer, design, and data management skills. Proficiency in Salesforce, different fundraising platforms, and Microsoft Office suite applications strongly preferred. Other nonprofit CRM experience acceptable. Demonstrated track record in creating and maintaining rigorous and accurate organizational systems and data. Bachelor's degree in communications, English, Marketing, Arts Administration, Design or other relevant fields preferred. Equivalent experience considered in lieu of formal education. Must have access to reliable transportation. Experience working with organizations that serve vulnerable populations strongly preferred. These include, but are not limited to unhoused, at-risk, foster, disabled, migrant, incarcerated, refugee, impoverished elderly, low income, and disadvantaged LGBTQ+ communities, as well as survivors of domestic abuse, human trafficking or those experiencing substance abuse or mental health challenges. Commitment to social justice and community engagement.<br/><br/><strong>Compensation: </strong>Salary ranges from $66,560 to $80,000 and is commensurate with qualifications and experience. Excellent benefits.<br/><br/><strong>How to Apply:</strong> Cover letters and resumes are reviewed upon receipt and applications will be accepted until the position is filled. To apply, please upload your resume and cover letter detailing interest in the position directly to our website at https://innercitylaw.org/join-our-team/. Applications will not be considered if both resume and cover letter are not provided. <br/><br/><em>Inner City Law Center is committed to having a diverse staff and an equitable and inclusive workplace. To read our full DEI Statement, please click here. <br/><br/></em><em>ICLC is an equal opportunity employer and all qualified applicants will receive consideration without regard to their race, religion, ancestry, national origin, sex, sexual orientation, gender identity, transgender status, age, disability, marital status, or medical condition. All qualified applicants with criminal histories shall be considered in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.  <br/><br/></em><em>To keep our Staff and Clients safe, ICLC requires all Staff to have received the COVID-19 vaccine. </em>", "responsibilities": "Work with the Director of Development to create key strategies to drive Inner City Law Center’s fundraising efforts. \nDesign, create and produce appeals and campaigns targeted to donors and potential donors; manage, produce and lead the year-end appeal. \nCoordinate logistics and administration for Annual Luncheon and other development events. \nSupport in identifying, cultivating, securing and stewarding donors (individual and corporate) and developing our Individual Giving program. \nResearch and prospect new corporate partners; conduct meetings with corporate partners to discuss funding opportunities and partnership enhancements. \nSupport all areas of development including direct mail and digital campaign solicitations, donor presentations, annual reports and newsletters. \nCollaborate on team-wide development projects, including fundraising campaigns and special events. \nMaintain a highly collaborative relationship with other ICLC departments and programs and identify and capture client stories and testimonials to support development outreach and communications campaigns. \nWork with volunteers, Annual Luncheon Committee and other ICLC staff as necessary for department events and initiatives. \nMaintain clear and accurate records in Salesforce. \nGenerate reports in Salesforce to support prospect research, mailings and other department needs. \nPerform other duties as assigned.", "qualifications": {"required": "A minimum of five years of experience in a nonprofit role (ideally in development), managing fundraising systems, individual donor relationships and/or corporate partnerships. Commitment to ICLC’s mission and values. Excellent oral and written communication skills. Strong computer, design, and data management skills. Demonstrated track record in creating and maintaining rigorous and accurate organizational systems and data. Must have access to reliable transportation.", "preferred": "Proficiency in Salesforce, different fundraising platforms, and Microsoft Office suite applications strongly preferred. Other nonprofit CRM experience acceptable. Bachelor's degree in communications, English, Marketing, Arts Administration, Design or other relevant fields preferred. Equivalent experience considered in lieu of formal education. Experience working with organizations that serve vulnerable populations strongly preferred. These include, but are not limited to unhoused, at-risk, foster, disabled, migrant, incarcerated, refugee, impoverished elderly, low income, and disadvantaged LGBTQ+ communities, as well as survivors of domestic abuse, human trafficking or those experiencing substance abuse or mental health challenges. Commitment to social justice and community engagement."}, "skills": ["Salesforce", "Fundraising", "Nonprofit", "Donor Relations", "Corporate Partnerships", "Data Management", "Microsoft Office", "Communication", "Design"], "postedDate": "2 months ago", "benefits": "Excellent benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3949883671"}