{"jobTitle": "Licensed Clinical Psychologist (CA Licensure)", "company": {"name": "Clarity Pediatrics", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "115,000.00-125,000.00/year", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Internet Publishing", "description": "About Clarity Pediatrics:<br/><br/>Clarity Pediatrics is reimagining pediatric chronic care, starting with ADHD. Nearly 10% of people in the US are diagnosed with ADHD, and for parents, it can feel impossible to find the right care. We are building a virtual pediatric ADHD clinic that delivers trusted care to all families. Our new clinical model is tech-enabled, backed by the best science, and has the potential to deliver exceptional health outcomes to transform a child’s trajectory. In the future, our pediatric care platform will expand rapidly to other common chronic conditions like asthma, allergies, and obesity.<br/><br/>Our co-founders and leadership team have deep domain expertise in healthcare. Our CEO has led two startups to &gt;$100M in ARR and profitability. Our Chief Medical Officer trained at UCSF and Stanford. Until recently, he was a Medical Director building specialty care services at Kaiser Permanente. Earlier, he worked at IDEO. Our Behavioral Health team is led by expert psychologists who have trained at children’s hospitals and academic medical centers and are committed to delivering evidence-based treatment and outstanding care to families.<br/><br/>We have raised $10M in seed capital from top VCs who have led investments in category-defining health-tech companies like One Medical, Hims, Spring Health, Cityblock, Honor, and Tia. We attracted angels from the world’s top digital health companies like CityBlock, Livongo, Ginger, Hims, Quartet, Pill Club and more.<br/><br/>About the role:<br/><br/>We're looking for licensed Child and Adolescent Clinical Psychologists to join our growing team. As a Psychologist at Clarity Pediatrics, you'll provide clinical services including ADHD diagnostic assessments and group therapy (parent training in behavior management).<br/><br/>This position reports directly to the Head of Behavioral Health and is 100% remote. For our team members based in the San Francisco Bay Area, we have opportunities to come together in person monthly. For our team members outside of the San Francisco Bay Area, we may also have opportunities to meet in person yearly.<br/><br/>What you'll do:<br/><br/><ul><li>Conduct ADHD diagnostic assessments</li><li>Provide treatment recommendations tailored to each family’s presenting concerns, including referring to community providers for additional evaluation and services as needed</li><li>Group therapy (parent training in behavior management) for parents/caregivers of children with ADHD (and comorbid ADHD and Autism Spectrum Disorder [ASD])</li><li>In addition to direct clinical care, opportunities for program development, program evaluation, research, etc. may be available based on employee interest and company needs<br/><br/></li></ul>Who we're looking for:<br/><br/><ul><li>Doctorate in Psychology from an APA-accredited graduate program (PhD or PsyD)</li><li>Completed a clinical internship from an APA-accredited internship program</li><li>Licensed psychologist in California, with openness to obtaining licensure in additional states with the support of the company</li><li>Experience conducting pediatric ADHD assessments</li><li>Experience seeing patients in integrated primary care settings</li><li>Experience delivering evidence-based treatments to pediatric ADHD populations</li><li>Experience working with families from different cultural backgrounds and willingness to receive ongoing training and support in advancing your skills in delivering culturally responsive treatment</li><li>Desire to contribute to tech-enabled care innovation and excitement around creating new ways of delivering outstanding care to families</li><li>Confidence using technology to deliver virtual care and support to families</li><li>This position is remote and requires that candidates have access to a strong, reliable, secure internet connection in a private location</li><li>Fast learner, especially when applying new technologies and tools</li><li>Ability to deliver services during peak hours (e.g., 8-9am PT, 5-8pm PT, and/or Saturday 9am-12pm PT) for a minimum of 6 hours/week<br/><br/></li></ul>What we offer:<br/><br/>Opportunity to join a multi-disciplinary clinical team dedicated to providing integrated care to patients and families. We aim to give our behavioral health team the tools they need to provide excellent care including weekly peer consultation groups, guidance from ADHD experts and researchers, and opportunities to pursue ongoing professional development.<br/><br/>Contribute to the development of a better behavioral healthcare system for patients and providers. Our team is dedicated to setting clinicians up for success, and you’ll be encouraged to help us make improvements to our care models, workflows, and clinical tools in order to make your work easier and more enjoyable.<br/><br/>Focus on your strengths. We appreciate how different clinical backgrounds help us learn from each other and take better care of patients. We encourage our clinicians to develop special areas of interest and expertise to become leaders within the team.<br/><br/>Compensation &amp; benefits:<br/><br/><ul><li>Pay Range: $115,000-125,000/year</li><li>Competitive salary with opportunity to maximize compensation through bonuses</li><li>Medical, dental, and ancillary benefits, including 401K</li><li>Competitive PTO</li><li>Remote-friendly culture</li><li>More - we are evolving, let us know what benefits matter most to you<br/><br/></li></ul>Powered by JazzHR<br/><br/>zAM6Om2u4T", "responsibilities": "<ul><li>Conduct ADHD diagnostic assessments</li><li>Provide treatment recommendations tailored to each family’s presenting concerns, including referring to community providers for additional evaluation and services as needed</li><li>Group therapy (parent training in behavior management) for parents/caregivers of children with ADHD (and comorbid ADHD and Autism Spectrum Disorder [ASD])</li><li>In addition to direct clinical care, opportunities for program development, program evaluation, research, etc. may be available based on employee interest and company needs<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Doctorate in Psychology from an APA-accredited graduate program (PhD or PsyD)</li><li>Completed a clinical internship from an APA-accredited internship program</li><li>Licensed psychologist in California, with openness to obtaining licensure in additional states with the support of the company</li><li>Experience conducting pediatric ADHD assessments</li><li>Experience seeing patients in integrated primary care settings</li><li>Experience delivering evidence-based treatments to pediatric ADHD populations</li><li>Experience working with families from different cultural backgrounds and willingness to receive ongoing training and support in advancing your skills in delivering culturally responsive treatment</li><li>Desire to contribute to tech-enabled care innovation and excitement around creating new ways of delivering outstanding care to families</li><li>Confidence using technology to deliver virtual care and support to families</li><li>This position is remote and requires that candidates have access to a strong, reliable, secure internet connection in a private location</li><li>Fast learner, especially when applying new technologies and tools</li><li>Ability to deliver services during peak hours (e.g., 8-9am PT, 5-8pm PT, and/or Saturday 9am-12pm PT) for a minimum of 6 hours/week<br/><br/></li></ul>", "preferred": ""}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "<ul><li>Pay Range: $115,000-125,000/year</li><li>Competitive salary with opportunity to maximize compensation through bonuses</li><li>Medical, dental, and ancillary benefits, including 401K</li><li>Competitive PTO</li><li>Remote-friendly culture</li><li>More - we are evolving, let us know what benefits matter most to you<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3949285507"}