{"jobTitle": "Urban/Associate Planner (FT - Hybrid)", "company": {"name": "CSG Consultants, Inc.", "industry": "Construction, Architecture and Planning, and Civil Engineering", "size": "Not specified", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$35.00 to $52.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Construction, Architecture and Planning, and Civil Engineering", "description": "We are currently hiring an Urban/Associate Planner to join CSG Consultants. The Urban/Associate Planner is the journey-level classification in the professional Planner series. The incumbent in this classification is responsible for performing, with regular supervision, routine to complex planning duties in the administration of land use regulations, General Plan, environmental review, and design review. Depending on area of expertise, the Urban/Associate Planner may be primarily assigned to one or more of the following specialties: current planning, long-range planning, architectural review, transportation planning, or Geographic Information Systems (GIS) mapping. The Associate Planner works under the supervision of senior planning staff and performs difficult and specialized planning assignments. This classification is distinguished from the Urban/Assistant Planner class which handles the less complex assignments. Municipal Planning experience is strongly desired.", "responsibilities": "Assists the senior staff in the administration of subdivision and land use regulations. Performs professional level work in the field of current or advanced planning, zoning, and design review. Advises applicants and property owners in filing applications for land use review, including mapping and compiling data, General Plan, zoning, subdivision, variances, use permits, environmental review, and design review. Reviews planning project and permit applications and plans for completeness and for compliance with applicable codes, and consistency with development and design standards. Reviews building plans, parcel maps, and subdivision proposals for compliance with regulations. Processes applications and non-structural plans necessary for issuance of a variety of permits. Files, routes, and tracks applications and permit documents to City departments and staff, and coordinates with other regulatory agencies and individuals concerned with proposed developments. Conducts site inspections and field investigations. Provides support to the Permit Center, coordinates with property owners, project developers, public officials, and consultants in review of plans for development. Performs review for compliance with the state or local Model Water Efficient Landscape Ordinance (MWELO). Maintains planning data using various software programs. Confers with, advises, and serves as liaison to project applicants, City staff and consultants, and the general public. Acts as a Project Manager for more complex planning applications. Researches, analyzes, and interprets social, economic, population, and land use data and trends. Prepares technical planning reports, presentations, recommendations, and graphic exhibits. Assists in the training, and technical and functional skill sharing with the Planning Dept./Division. May represent the municipality/Planning Division and make presentations at various Planning advisory committees, regional meetings, other committees, and agencies. Conducts routine and/or complex architectural review. Gathers or maintains demographic data or other related statistics. Prepares a variety of reports and draft ordinances for City staff, the City Council, Board of Supervisors, Zoning Administrator, and the Planning Commission. Compiles information and makes recommendations on special studies. Prepares correspondence and other similar documents to fulfill policy and legal requirements. Prepares and maintains project schedules and budgets, as necessary. Reviews and/or peer reviews CEQA compliance documentation. Performs other related duties as required.", "qualifications": {"required": "Two (2) years of responsible professional city/urban planning experience supplemented by a bachelor’s degree from an accredited college or university with major course work in urban planning, architecture, or a related field. An equivalent combination of experience and education sufficient to perform the essential job functions and provide the required knowledge and abilities is qualifying. A Master’s degree in planning may be substituted for one year of the required experience.", "preferred": "Municipal Planning experience is strongly desired."}, "skills": ["Planning", "Zoning", "Design Review", "GIS Mapping", "Project Management"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "CSG’s comprehensive benefits package includes 401(k) plus company match, Employee Stock Ownership Program (Eligibility requirements must be met to qualify), 12 paid holidays, 3 weeks of paid time off (PTO), medical, dental, vision, FSA, EAP, Life/AD&D, LTD, voluntary life insurance, casual work environment and professional development program.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3949819412"}