{"jobTitle": "Project Manager", "company": {"name": "PM2CM, Inc.", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "PM2CM has an exciting long-term opportunity for a dynamic, organized, and results-oriented Project Manager to work on electrical infrastructure projects for one of the largest utility companies in Southern California. While prior electrical infrastructure experience is preferred, we firmly believe that core project management skills from other construction projects are transferable. We invite applications from Project Managers with 7 or more years of proven experience to apply.<br/><br/>Become a Project Manager at one of the largest utility companies in Southern California, managing electric infrastructure projects.<br/><br/>The primary purpose of the Project Manager role is to improve the success rate of projects by applying project management principles, methods, tools, and standards. Individuals are typically certified as Professional Project Managers and apply their knowledge and experience in a variety of functions and projects across the organization.<br/><br/>As a Project Manager, your work will help power our planet, reduce carbon emissions, and create cleaner air for everyone. Are you ready to take on the challenge to help us build the future?<br/><br/><strong>A Day in the Life</strong> - Get ready to think big, work smart, and shine bright! Manage projects and programs within the organization. Projects and programs may include the relocation of existing facilities, small civil capital projects, and overseeing the implementation of software.<br/><br/>We are hiring two Project Managers:<br/><br/><ul><li> PM - Big Creek: The Project Manager must be able to travel when needed to the Big Creek field office</li><li> PM - Catalina Island: The Project Manager must be able to travel to Catalina twice a week when needed<br/><br/></li></ul>The positions are based in Rosemead, CA. Hybrid-Remote (Tuesday and Wednesday in the office/field).<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Demonstrated prior experience in managing multiple construction projects that have Engineering-Procurement-Construction-Closeout phases that span multiple years (a minimum of 24-month project life cycle)</li><li>In this position, the Project Manager will be responsible for issuing the Authorization to Construct, ensuring all project prerequisites are met to facilitate a timely construction start</li><li>Proven experience in coordinating with multiple stakeholders and ensuring deliverable hand-offs between stakeholders are completed in a timely and efficient manner</li><li>Must possess excellent communication skills and effectively communicate project status, progress, budget, and cost information to stakeholders and senior management</li><li>Facilitate project team meetings, ensuring key decisions and action items are documented and communicated to relevant stakeholders</li><li>Resolve issues promptly, establish task priorities, and manage conflicts with team members and functional managers</li><li>Possess strong project management core competencies in the areas of planning, scheduling, cost tracking and budget management, risk analysis, and mitigation</li><li>Proven experience in working with field construction managers and construction contractors<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in an applicable profession, business, or technical discipline, or an equivalent combination of education, training, and experience</li><li>Minimum of 7 years of project management experience, preferably in a consulting environment</li><li>Skilled in Microsoft Office Suite and Projects, Primavera P6, SAP, and In</li><li>PMP or PMI-ACP certification is preferred, but not required<br/><br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Construction management experience</li><li>Environmental and permitting experience</li><li>Utility experience<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>Medical, Dental, Vision, and 401K.", "responsibilities": "Manage projects and programs within the organization. Projects and programs may include the relocation of existing facilities, small civil capital projects, and overseeing the implementation of software.<br/><br/>Demonstrated prior experience in managing multiple construction projects that have Engineering-Procurement-Construction-Closeout phases that span multiple years (a minimum of 24-month project life cycle)<br/><br/>In this position, the Project Manager will be responsible for issuing the Authorization to Construct, ensuring all project prerequisites are met to facilitate a timely construction start<br/><br/>Proven experience in coordinating with multiple stakeholders and ensuring deliverable hand-offs between stakeholders are completed in a timely and efficient manner<br/><br/>Must possess excellent communication skills and effectively communicate project status, progress, budget, and cost information to stakeholders and senior management<br/><br/>Facilitate project team meetings, ensuring key decisions and action items are documented and communicated to relevant stakeholders<br/><br/>Resolve issues promptly, establish task priorities, and manage conflicts with team members and functional managers<br/><br/>Possess strong project management core competencies in the areas of planning, scheduling, cost tracking and budget management, risk analysis, and mitigation<br/><br/>Proven experience in working with field construction managers and construction contractors", "qualifications": {"required": "Bachelor's degree in an applicable profession, business, or technical discipline, or an equivalent combination of education, training, and experience<br/><br/>Minimum of 7 years of project management experience, preferably in a consulting environment<br/><br/>Skilled in Microsoft Office Suite and Projects, Primavera P6, SAP, and In<br/><br/>PMP or PMI-ACP certification is preferred, but not required", "preferred": "Construction management experience<br/><br/>Environmental and permitting experience<br/><br/>Utility experience"}, "skills": ["Project Management", "Construction Management", "Primavera P6", "SAP", "Microsoft Office", "Risk Analysis", "Budget Management", "Stakeholder Management", "Communication", "Problem Solving"], "postedDate": "2 months ago", "benefits": "Medical, Dental, Vision, and 401K.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3949815696"}