{"jobTitle": "Warehouse Shipping and Receiving (3rd Shift)", "company": {"name": "MSI", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "19 to $19 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Building Materials", "description": "<strong>Summary: </strong>The shipping and receiving is responsible for unloading inbound containers, conducting quality control on received products, and organizing them in the warehouse. Additionally, responsibilities include reviewing shipping orders, Picking product for orders, ensuring accuracy in shipping documents, operating equipment safely, and maintaining a clean work environment.<br/><br/><strong>Work Hours:</strong> Sunday to Thursday from 5:00 PM - 3:30AM and alternative Friday.<br/><br/><strong>Compensation: </strong>This hourly, non-exempt position pays from $19 to $19 per hour, with overtime compensated at 1.5 times the base rate. New hires usually earn between $62,836 and $80,644 annually, or more, depending on experience, premium pay differential, overtime hours, and bonuses.<br/><br/><strong>To perform this job successfully, the individual must be able to complete the following essential duties and responsibilities:<br/><br/></strong><ul><li></li><ul><li>Unload inbound containers, perform quality control on incoming products, and organize products in the warehouse.</li><li>Review shipping orders to determine necessary quantity and transportation requirements.</li><li>Ensure accuracy of all shipping documents and maintain shipping-related data.</li><li>Collect and organize documentation for outbound freight.</li><li>Pick product and stage for outbound loading.</li><li>Safely and efficiently operate equipment such as forklifts and pallet jacks.</li><li>Maintain a clean, neat, and organized work environment.</li><li>Keep an equipment checklist and perform preventative maintenance of equipment.</li><li>Perform additional duties as required and or requested.<br/></li></ul></ul><strong>Additionally the candidate must meet the following Education and/or Experience requirements:<br/><br/></strong><ul><li>High School Education or equivalent required.</li><li>1-2 years of Warehouse experience</li><li>One (1) year of experience operating a Forklift.</li><li>Ability to use a computer or tablet a plus</li><li>Good communication and organizational skills</li><li>Ability to follow instructions and work under pressure</li><li>Ability to lift up to 50 lbs.<br/><br/></li></ul><strong>This Role Has The Following Physical Demands<br/><br/></strong><ul><li>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li><li>While performing the duties of this job, the employee is regularly required to use their hands to handle objects, tools, or controls; reach with their hands and arms; and communicate verbally. The employee frequently walks, stands and occasionally sits.</li><li>The employee must regularly lift, pull and move up to 50 pounds and occasionally up to 70lbs. Specific vision abilities required by this job include close vision.</li><li>This is a safety-sensitive position.<br/><br/></li></ul><strong>Benefits:</strong> MSI offers a comprehensive benefits package that includes:<br/><br/><ul><li>Referral, Holiday, and Annual Bonuses</li><li>Annual pay increases</li><li>Paid Time Off</li><li>Medical, Dental, and Vision Insurance</li><li>Company-paid Short Term and Long Term disability;</li><li>Company-paid Life Insurance</li><li>Tuition Reimbursement</li><li>Traditional and Roth 401(k) plans with company matching contributions</li><li>Charitable donation matching programs</li><li>Free, company-sponsored 1-on-1 tutoring for children/dependents of MSI employees in grades k-12, including free tutoring for SAT and ACT tests.<br/><br/></li></ul><strong>About MSI:</strong> Founded in 1975, MSI is a leading supplier of flooring tile, countertops, wall and backsplash tile and hardscaping surfaces products in North America. Headquartered in Orange, California, MSI also maintains over 50 state-of-the-art showroom and distribution centers across the U.S. and Canada. MSI's product line includes an extensive offering of Granite, Quartz, Porcelain, Luxury Vinyl flooring, Slate, Marble, Travertine, Sandstone, Limestone, Quartzite, onyx, stacked stone and pavers imported from over 36 countries on six continents.<br/><br/><strong>Over the years, MSI has been the recipient of many prestigious awards including: <br/><br/></strong><ul><li>Top 5 fastest growing companies - OC Business Journal</li><li>Supplier Diversity Award - Home Depot</li><li>#1 Flooring Distributor multiple years in a row - Floor Covering Weekly</li><li>Top Workplaces Award winner multiple times - Top Workplaces</li><li>MSI Founder named the Entrepreneur of the Year - Ernst and Young<br/><br/></li></ul><em>MSI is an equal opportunity employer that celebrates diversity and fosters inclusion and belonging for all employees. We provide a work environment that allows all employees to do their best work, free from all forms of discrimination. No employee or applicant will be discriminated against on the basis of race, ethnicity, age, sex, gender identity or expression, sexual orientation, citizenship status, military status, religion, disability status, or any other legally protected group. MSI provides reasonable accommodations for all employees and applicants. If you believe you require an accommodation, please speak with your recruiter or a member of our HR team.</em>", "responsibilities": "The shipping and receiving is responsible for unloading inbound containers, conducting quality control on received products, and organizing them in the warehouse. Additionally, responsibilities include reviewing shipping orders, Picking product for orders, ensuring accuracy in shipping documents, operating equipment safely, and maintaining a clean work environment.", "qualifications": {"required": "High School Education or equivalent required.\n1-2 years of Warehouse experience\nOne (1) year of experience operating a Forklift.\nAbility to use a computer or tablet a plus\nGood communication and organizational skills\nAbility to follow instructions and work under pressure\nAbility to lift up to 50 lbs."}, "skills": ["Forklift", "Warehouse", "Quality Control", "Shipping", "Receiving", "Inventory", "Communication", "Organization", "Equipment Operation"], "postedDate": "1 week ago", "benefits": "MSI offers a comprehensive benefits package that includes:\nReferral, Holiday, and Annual Bonuses\nAnnual pay increases\nPaid Time Off\nMedical, Dental, and Vision Insurance\nCompany-paid Short Term and Long Term disability;\nCompany-paid Life Insurance\nTuition Reimbursement\nTraditional and Roth 401(k) plans with company matching contributions\nCharitable donation matching programs\nFree, company-sponsored 1-on-1 tutoring for children/dependents of MSI employees in grades k-12, including free tutoring for SAT and ACT tests.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3949219754"}