{"jobTitle": "Creative Strategy Development Manager", "company": {"name": "Lyft", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "104,880.00 - 131,100.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Ground Passenger Transportation", "description": "At Lyft, our mission is to improve people’s lives with the world’s best transportation. To do this, we start with our own community by creating an open, inclusive, and diverse organization.<br/><br/>Lyft Media’s vision is to build the largest transportation media network. We leverage media to elevate the transportation experience for our users while building an exciting and sustainable advertising business. Our assets include Lyft in-app sponsorship opportunities, the largest bike share network in the country, and in-car entertainment screens. Our work is fun, challenging, and rewarding and we are looking for a customer-focused team member passionate about solving problems, delighting our agency partners, and winning new business.<br/><br/>As a Creative Sales Development Manager at Lyft Media you will play a critical role in partnering with our internal sales team to achieve its goals. This individual will play a crucial part in the early stages of the sales process by ideating, developing and executing marketing strategies and initiatives to drive sales growth, increase brand visibility, and differentiate Lyft Media in the competitive advertising landscape. We are looking for individuals who love solving interesting problems, are highly adaptable, and care deeply about delivering unique advertising experiences that drive business outcomes.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Marketing Strategy: Develop and execute comprehensive marketing plans and strategies to support the Lyft Media's advertising business</li><li>Idea Development: Work cross functionally across Sales, Account Management, Product, and Product Marketing to create compelling advertising solutions to present during the RFP process. CSD will then work to build these ideas into sales collateral, presentations, and custom proposals that effectively communicate Lyft Media's value proposition and advertising solutions to prospective clients.</li><li>Brand Positioning: Define and articulate Lyft Media's unique selling propositions, competitive advantages, and brand positioning to differentiate our offerings in the market and drive brand awareness and preference. </li><li>Market Research: Conduct market research, competitive analysis, and customer insights to identify trends, opportunities, and challenges in the advertising industry, and leverage findings to inform marketing strategies and tactics.</li><li>Cross-Functional Collaboration: Collaborate closely with the sales, product, and creative teams to align marketing initiatives with sales objectives, product launches, and client needs, and ensure consistent messaging and brand voice across all touchpoints.</li><li>Collateral Development: Build out of custom advertising solutions into pitch specific presentations that effectively communicate Lyft Media's value proposition and advertising solutions to prospective clients.<br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Business Administration, or related field</li><li>6+ years of experience in digital advertising creative strategy, sales development, and strategy</li><li>Proven track record of success in marketing roles within the advertising, technology, or related industries, with a focus on B2B marketing and ad revenue growth</li><li>Strong creative and strategic thinking skills, with the ability to develop innovative marketing strategies and translate complex concepts into compelling messaging and visuals.</li><li>Excellent communication and presentation skills, with the ability to effectively articulate ideas and influence stakeholders at all levels.</li><li>Strong project management skills, with the ability to prioritize and manage multiple projects simultaneously in a fast-paced, deadline-driven environment.</li><li>Collaborative mindset and ability to work cross-functionally with diverse teams to achieve common goals and drive results.</li><li>Passion for the advertising industry and a deep understanding of emerging trends, technologies, and best practices.<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Great medical, dental, and vision insurance options</li><li>Mental health benefits</li><li>Family building benefits</li><li>In addition to 12 observed holidays, salaried team members have unlimited paid time off, hourly team members have 15 days paid time off</li><li>401(k) plan to help save for your future</li><li>18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligible</li><li>Pre-tax commuter benefits</li><li>Lyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program<br/><br/></li></ul><em>Lyft is an equal opportunity/affirmative action employer committed to an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law. <br/><br/></em><em>This role is fully remote in Los Angeles, candidates for this role must be based in the Los Angeles metro area. #Remote<br/><br/></em><em>The expected base pay range for this position in the Los Angeles area is $104,880 - $131,100. Salary ranges are dependent on a variety of factors, including qualifications, experience and geographic location. Range is not inclusive of potential equity offering, bonus or benefits. Your recruiter can share more information about the salary range specific to your working location and other factors during the hiring process.</em>", "responsibilities": "Marketing Strategy: Develop and execute comprehensive marketing plans and strategies to support the Lyft Media's advertising business\nIdea Development: Work cross functionally across Sales, Account Management, Product, and Product Marketing to create compelling advertising solutions to present during the RFP process. CSD will then work to build these ideas into sales collateral, presentations, and custom proposals that effectively communicate Lyft Media's value proposition and advertising solutions to prospective clients.\nBrand Positioning: Define and articulate Lyft Media's unique selling propositions, competitive advantages, and brand positioning to differentiate our offerings in the market and drive brand awareness and preference. \nMarket Research: Conduct market research, competitive analysis, and customer insights to identify trends, opportunities, and challenges in the advertising industry, and leverage findings to inform marketing strategies and tactics.\nCross-Functional Collaboration: Collaborate closely with the sales, product, and creative teams to align marketing initiatives with sales objectives, product launches, and client needs, and ensure consistent messaging and brand voice across all touchpoints.\nCollateral Development: Build out of custom advertising solutions into pitch specific presentations that effectively communicate Lyft Media's value proposition and advertising solutions to prospective clients.", "qualifications": {"required": "Bachelor's degree in Marketing, Business Administration, or related field\n6+ years of experience in digital advertising creative strategy, sales development, and strategy\nProven track record of success in marketing roles within the advertising, technology, or related industries, with a focus on B2B marketing and ad revenue growth\nStrong creative and strategic thinking skills, with the ability to develop innovative marketing strategies and translate complex concepts into compelling messaging and visuals.\nExcellent communication and presentation skills, with the ability to effectively articulate ideas and influence stakeholders at all levels.\nStrong project management skills, with the ability to prioritize and manage multiple projects simultaneously in a fast-paced, deadline-driven environment.\nCollaborative mindset and ability to work cross-functionally with diverse teams to achieve common goals and drive results.\nPassion for the advertising industry and a deep understanding of emerging trends, technologies, and best practices."}, "skills": [], "postedDate": "4 days ago", "benefits": "Great medical, dental, and vision insurance options\nMental health benefits\nFamily building benefits\nIn addition to 12 observed holidays, salaried team members have unlimited paid time off, hourly team members have 15 days paid time off\n401(k) plan to help save for your future\n18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligible\nPre-tax commuter benefits\nLyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3950767305"}