{"jobTitle": "Duty Manager - SNA", "company": {"name": "Unifi", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Airlines and Aviation", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong><strong>Pay Range: </strong>$66,560 - $70,000<br/><br/><strong><strong>Essential Functions / Key Responsibilities <br/><br/></strong></strong><ul><li>Oversees and coordinates team activities related to the operation. </li><li>Monitors and enforces safe and compliant working environment in accordance with TSA, DOT, USPS and OSHA regulations and all applicable laws. </li><li>Coaches, counsels and mentors employees and enforces Company policies and procedures, including issuing disciplinary action as required. </li><li>Promotes and adheres to Unifi policy concerning Safety, Anti-Harassment and Equal Employment Opportunity. </li><li>Assists in recruiting, administrative, payroll, employee scheduling, and general administrative duties. </li><li>Monitors staffing and overtime use and operational and financial performance of assigned shift/station. </li><li>Promotes team-building initiatives and performs coaching/mentoring activities to develop and motivate team members. </li><li>Performs other related duties as assigned within the appropriate skill and experience capabilities expected for this position. <br/><br/></li></ul><strong><strong>Basic Qualifications <br/><br/></strong></strong><strong>Pre-requisites: <br/><br/></strong><ul><li>Must be a local (in-state) resident. </li><li>Valid In-State Driver’s License. </li><li>Ability to pass a pre-employment drug screen. </li><li>Ability to pass up to a 10-year background check. </li><li>Must be at least 18 years of age. </li><li>Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986. </li><li>Must complete ramp and SIDA training to obtain airport authority identification security. <br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>Four+ years of relevant experience. Must be open minded and ready to work as part of a detail-oriented team. <br/><br/></li></ul><strong><strong>Knowledge, Skills &amp; Abilities: <br/><br/></strong></strong><ul><li>Excellent customer service skills. </li><li>Strong work ethic. </li><li>Ability to work in a team-oriented environment. <br/><br/></li></ul><strong><strong>Knowledge, Skills &amp; Abilities: <br/><br/></strong></strong><ul><li>Able to communicate information and instructions verbally and/or via radio equipment. </li><li>Able to communicate effectively in a professional manner. </li><li>Strong leadership qualities and ability to create a passionate and efficient workforce. </li><li>Able to effectively resolve employee conflicts. </li><li>Ability to apply creative solutions that have a positive impact on results. <br/><br/></li></ul><strong>Working Conditions <br/><br/></strong><strong><strong>Work Schedule: <br/><br/></strong></strong>You will need to have flexibility to work a variety of shifts, including nights, weekends, holidays and overtime. We operate in a shift bid environment.<br/><br/><strong><strong>Work Environment: <br/><br/></strong></strong><ul><li>Must be able to be alert to moving vehicles or aircraft and use radio equipment. </li><li>Enjoy the outdoors on a daily basis (sun, rain, sleet or snow!) May be exposed to a wide variety of weather conditions, jet and machinery noises, fumes, dirt and dust for extended periods. <br/><br/></li></ul><strong><strong>Physical Demands/Requirements: <br/><br/></strong></strong><ul><li>Must be able to lift / carry / push / pull and move items of 70 pounds and/or more on a regular basis and repetitively lift weights of 40 to 50 pounds on raised surfaces. </li><li>Must be able to walk, climb, bend, kneel, crawl, and stoop on a frequent basis and for extended periods. </li><li>Must be able to work in cramped or high places. </li><li>Must be able to carry heavy items up and down jet way stairs.</li></ul>", "responsibilities": "Oversees and coordinates team activities related to the operation. Monitors and enforces safe and compliant working environment in accordance with TSA, DOT, USPS and OSHA regulations and all applicable laws. Coaches, counsels and mentors employees and enforces Company policies and procedures, including issuing disciplinary action as required. Promotes and adheres to Unifi policy concerning Safety, Anti-Harassment and Equal Employment Opportunity. Assists in recruiting, administrative, payroll, employee scheduling, and general administrative duties. Monitors staffing and overtime use and operational and financial performance of assigned shift/station. Promotes team-building initiatives and performs coaching/mentoring activities to develop and motivate team members. Performs other related duties as assigned within the appropriate skill and experience capabilities expected for this position.", "qualifications": {"required": "Must be a local (in-state) resident. Valid In-State Driver’s License. Ability to pass a pre-employment drug screen. Ability to pass up to a 10-year background check. Must be at least 18 years of age. Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986. Must complete ramp and SIDA training to obtain airport authority identification security. Four+ years of relevant experience. Must be open minded and ready to work as part of a detail-oriented team.", "preferred": null}, "skills": ["Customer Service", "Teamwork", "Communication", "Leadership", "Problem Solving"], "postedDate": "2 months ago", "salary": {"amount": "66,560.00 - 70,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3950304049"}