{"jobTitle": "Plant Manager", "company": {"name": "PeepTek Solutions, Inc.", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "Our client in Valencia is seeking an experienced Plant Manager to organize and oversee the daily operations of our company. You will be the one to ensure that our business is well-coordinated and productive by managing its procedures and coaching its people. The area of responsibility for this role is very wide and thus requires thorough knowledge of various company processes. The ideal candidate must be competent and able to plan many different kinds of operational activities. The successful candidate will have demonstrated experience in manufacturing, precision sheet metal, machining, assembly, mechanical engineering and manufacturing leadership including excellent knowledge of lean manufacturing strategies, continuous improvement, He/She must be an excellent leader who can discover the most efficient ways to run the business.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Superior to make decisions for operational activities and set strategic goals</li><li>Plan and monitor the day-to-day running of business to ensure smooth progress</li><li>Supervise staff from different departments and provide constructive feedback</li><li>Evaluate regularly the efficiency of business procedures according to organizational objectives and apply improvements</li><li>Manage procurement processes and coordinate material and resources allocation</li><li>Oversee customer support processes and organize them to enhance customer satisfaction</li><li>Review financial information and adjust operational budgets to promote profitability</li><li>Revise and/or formulate policies and promote their implementation</li><li>Manage relationships/agreements with external partners/vendors</li><li>Evaluate overall performance by gathering, analyzing and interpreting data and metrics</li><li>Ensure that the company runs with legality and conformity to established regulations</li><li> Oversee diverse production activities including prototype orders, first production runs and repeat orders</li><li> Partner with Safety Manager to maintain Safety Program which includes safety trainings, safety walks, safety reviews and accident investigation activities</li><li>Partner with Quality Manager to maintain ISO 9001 and AS9100 registration status; Including internal auditing, procedure review, corrective action and other required activities</li><li>Partner with Human Resources to address issues related to hiring, performance reviews, employee training and information sharing</li><li>Oversee training and implementation of policies and procedures into the company’s operations</li><li>Knowledge of precision sheet metal machinery and equipment, specifically Amada NC laser/punch and Amada Brake Presses<br/><br/></li></ul><strong>Requirements And Skills<br/><br/></strong><ul><li>Proven experience as Plant Manager or equivalent position minimum of 5 years</li><li>Must be self-directed, organized and have ability to work in a fast paced, pressured working environment</li><li>Excellent organizational and leadership abilities</li><li>Outstanding communication and people skills</li><li>Knowledge of industry’s legal rules and guidelines</li><li>In depth knowledge of diverse business functions and principles (e.g. supply chain, finance, customer service etc.)</li><li>Working knowledge of data analysis and performance/operation metrics</li><li>Familiarity with MS Office and various business software (e.g. ERP, CRM, Six Sigma training)</li><li>BSc/BA in business administration or relevant field; MSc/MA will be a plus<br/><br/></li></ul>Job Type: Full-time<br/><br/>Pay: $100,000.00 - $125,000.00 per year<br/><br/>Benefits:<br/><br/><ul><li>401(k)</li><li>401(k) matching</li><li>Dental insurance</li><li>Health insurance</li><li>Life insurance</li><li>Paid time off</li><li>Referral program</li><li>Retirement plan</li><li>Vision insurance<br/><br/></li></ul>Schedule:<br/><br/><ul><li>8 hour shift</li><li>Monday to Friday<br/><br/></li></ul>Ability to commute/relocate:<br/><br/><ul><li>Valencia, CA 91355: Reliably commute or planning to relocate before starting work (Required)<br/><br/></li></ul>Work Location: In person<br/><br/>Powered by JazzHR<br/><br/>tIpwnRlM6O", "responsibilities": "Superior to make decisions for operational activities and set strategic goalsPlan and monitor the day-to-day running of business to ensure smooth progressSupervise staff from different departments and provide constructive feedbackEvaluate regularly the efficiency of business procedures according to organizational objectives and apply improvementsManage procurement processes and coordinate material and resources allocationOversee customer support processes and organize them to enhance customer satisfactionReview financial information and adjust operational budgets to promote profitabilityRevise and/or formulate policies and promote their implementationManage relationships/agreements with external partners/vendorsEvaluate overall performance by gathering, analyzing and interpreting data and metricsEnsure that the company runs with legality and conformity to established regulations Oversee diverse production activities including prototype orders, first production runs and repeat ordersPartner with Safety Manager to maintain Safety Program which includes safety trainings, safety walks, safety reviews and accident investigation activitiesPartner with Quality Manager to maintain ISO 9001 and AS9100 registration status; Including internal auditing, procedure review, corrective action and other required activitiesPartner with Human Resources to address issues related to hiring, performance reviews, employee training and information sharingOversee training and implementation of policies and procedures into the company’s operationsKnowledge of precision sheet metal machinery and equipment, specifically Amada NC laser/punch and Amada Brake Presses", "qualifications": {"required": "Proven experience as Plant Manager or equivalent position minimum of 5 yearsMust be self-directed, organized and have ability to work in a fast paced, pressured working environmentExcellent organizational and leadership abilitiesOutstanding communication and people skillsKnowledge of industry’s legal rules and guidelinesIn depth knowledge of diverse business functions and principles (e.g. supply chain, finance, customer service etc.)Working knowledge of data analysis and performance/operation metricsFamiliarity with MS Office and various business software (e.g. ERP, CRM, Six Sigma training)", "preferred": "BSc/BA in business administration or relevant field; MSc/MA will be a plus"}, "skills": ["Lean Manufacturing", "Continuous Improvement", "Manufacturing", "Precision Sheet Metal", "Machining", "Assembly", "Mechanical Engineering", "Leadership", "Customer Service", "Data Analysis", "MS Office", "ERP", "CRM", "Six Sigma"], "postedDate": "2 months ago", "benefits": "401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offReferral programRetirement planVision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3950778793"}