{"jobTitle": "Account Manager, Supply Partnerships", "company": {"name": "MediaAlpha", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "MediaAlpha is a customer acquisition solutions provider powered by technology and data science. The company provides industry-leading solutions designed to reach consumers shopping within high-consideration categories such as property and casualty insurance, health insurance, life insurance, personal finance, travel, education, and more.<br/><br/><strong>Role Overview<br/><br/></strong>We're seeking an enthusiastic Account Manager to join our team. In this role, you'll work closely with the Supply Partnerships team, primarily focusing on maintaining process documentation and onboarding new publishers. You'll handle day-to-day onboarding tasks, assist in managing small to mid-level accounts, and conduct optimization activities using our proprietary supply-side platform. The ideal candidate will be committed to delivering high-quality work, possess exceptional organizational skills, and thrive in a client-service environment.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Set up and provide day-to-day account management for our new and existing publishing partners, with the expectation of onboarding and managing 50+ small-to-midsize accounts.</li><li>Gain a deep understanding of each supply partner's revenue model and platform implementation, including all relevant technical details, to monitor performance, recommend solutions, and optimize partnership revenue.</li><li>Assist in prioritizing account management activities and initiatives by thoroughly understanding the partner's needs, industry trends, revenue potential, and the company's account management best practices.</li><li>Generate and maintain reports for internal users and external clients</li><li>Provide account management support for all new product initiatives and recommend new platform features based on publisher, internal feedback, and internal requirements.</li><li>Bring a strong technical background, a desire to troubleshoot and QA problems, and effectively communicate issues to technical resources.</li><li>Establish and maintain effective communication and working relationships with all team members.</li><li>Resolve partner issues efficiently and proactively.</li><li>Assist in achieving publisher retention and team revenue goals.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>1+ years of experience in significant account or client management in online advertising preferred.</li><li>Bachelor's degree in business, or related field preferred. </li><li>Proficient in Excel (Vlookup, pivot tables, data manipulation) and data presentation skills required.</li><li>Strong client-service orientation.</li><li>Obsessive attention to detail.</li><li>Data-driven mindset and accompanying skillset. </li><li>Ability to articulate and communicate concisely and thoughtfully, particularly with written communications.</li><li>Ability to manage multiple competing priorities in a dynamic start-up environment.</li><li>Eagerness to learn, drive to improve, and a willingness to make mistakes.</li><li>Collaborative disposition and enthusiastic outlook.<br/><br/><br/><br/></li></ul><strong>Compensation &amp; Benefits<br/><br/></strong>We are excited to offer a competitive base pay range of $65,000 to $97,000 per year for this position, based on experience and qualifications. But that's not all - as a valued member of our team, you will also have access to an array of top-notch benefits, including:<br/><br/><ul><li>Annual bonus program and participation in our Restricted Stock Unit program</li><li>100% Employer-paid health, dental, and vision insurance for you, your dependents, and spouse or registered domestic partner</li><li>100% Employer paid long term disability, and life insurance</li><li>401(k) retirement plan with matching contributions to help you plan for your future</li><li>Open Paid Time Off policy with a birthday day off and 11 holidays </li><li>Professional development reimbursement </li><li>Cell Phone, Wellness, and Internet expense reimbursement, along with a subscription to the Calm App</li><li>100% fully paid parental leave for team members up to 22 weeks for the primary caregiver and 12 weeks for the secondary caregiver </li><li>Dog-friendly offices (LA and AZ) along with a $300 pet adoption reimbursement <br/><br/></li></ul><strong>Diversity, Equity, and Inclusion<br/><br/></strong>MediaAlpha is committed to fostering, cultivating, and maintaining a culture of diversity, equity, and inclusion. Our philosophy and actions are built on the premise that as an employer and citizens of our communities, we can create opportunities for lasting change.<br/><br/><strong>Fair Chance<br/><br/></strong>MediaAlpha will consider qualified applicants, including those with criminal histories, in a manner consistent with state and local \"Fair Chance\" laws. We are also committed to providing reasonable accommodations for qualified applicants with disabilities and disabled veterans in our application process. If you need assistance or an accommodation due to a disability, please contact us at peopleops@mediaalpha.com or (213) 316-6256.", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "postedDate": "2 months ago", "qualifications": {"required": "1+ years of experience in significant account or client management in online advertising preferred.", "preferred": "Bachelor's degree in business, or related field preferred. \nProficient in Excel (Vlookup, pivot tables, data manipulation) and data presentation skills required."}, "skills": ["Excel", "Data Presentation", "Client Management", "Online Advertising"], "benefits": "Annual bonus program and participation in our Restricted Stock Unit program\n100% Employer-paid health, dental, and vision insurance for you, your dependents, and spouse or registered domestic partner\n100% Employer paid long term disability, and life insurance\n401(k) retirement plan with matching contributions to help you plan for your future\nOpen Paid Time Off policy with a birthday day off and 11 holidays \nProfessional development reimbursement \nCell Phone, Wellness, and Internet expense reimbursement, along with a subscription to the Calm App\n100% fully paid parental leave for team members up to 22 weeks for the primary caregiver and 12 weeks for the secondary caregiver \nDog-friendly offices (LA and AZ) along with a $300 pet adoption reimbursement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3951204310"}