{"jobTitle": "MRB Coordinator", "company": {"name": "Galaxy Infotech Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job Responsibilities<br/><br/><ul><li>Experience on MRB (Material review board) activities, NCs (Non conformances), QN (Quality notifications), Concessions of metallic parts/structures.</li><li>Experience on detailed sizing of metallic parts/structures including Static, Fatigue of repairs/alterations/NCs using classical hand calculations.</li><li>Should have experience of creating substantiation of Non conformances on engine/ structural metallic component. Metallic Material properties knowledge is a must.</li><li>Knowledge of elastomers (seals, diaphragms) and assemblies, fluid systems, electronic components are an added advantage.</li><li>Tools Knowledge: CAD modelling, SAP, PDM, Catia V5 (optional), SolidWorks and EPDM, FEM modelling, Ansys, tolerance stack analysis, MS word, MS excel, Mathcad.</li><li>Aerospace structural/engines/Systems knowledge is an added advantage. Experience on aircraft components certification report and evaluation of the NCs (non-conformances).</li><li>FAA, and EASA specifications knowledge is an added advantage.</li><li>Should be able to communicate and collaborate between different stakeholders (airworthiness teams, Quality team, manufacturing team, design team, stress team, vendors, suppliers etc.).</li><li>Experience of managing out of box returns – (OOB) and driving RCCA for non-conforming product is an added advantage.</li><li>Should be able to manage MRB inventory and QN count metric to customer daily.</li><li>Collaborating with Purchasing Team to execute return to vendor (RTV) actions and Issuing concessions to end customer.</li><li>Travel to various suppliers may be expected depending on the assignment.</li><li>Demonstrated ability to organize and prioritize a variety of activities and tasks while dealing with change.<br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><ul><li>Bachelor’s degree science or engineering fields Physics, Chemistry, Aerospace, Mechanical or Manufacturing Engineering. Will consider associate’s degree in engineering and 4 years of professional experience in manufacturing/Aerospace industry, in lieu of Bachelors or Diploma with min 7 years of relevant experience.</li><li>US Citizenship per ITAR regulations to comply with export compliance and site SSA requirements.</li><li>Strong background/experience in QNs/Concessions / MRB and in providing frontline support to manufacturing operations. Knowledge of production and aerospace components is an added advantage.</li><li>Good reporting and communication skills on project status and progress, lead effectively at all levels within an organization and be flexible in your approach.</li><li>Strong demonstrable experience of problem-solving techniques e.g. 5 why’s, 8D, DMAIC.</li><li>Experience in process control awareness is preferred.</li><li>Must be able to obtain/maintain Security Clearance.</li><li>Multi-tasking and dynamic capacity.</li><li>Proficiency with basic office computer software, specifically the Microsoft office suite (Word, Excel, PowerPoint, Outlook, etc.)..</li><li>Experience working with customer specifications and standards.</li></ul>", "postedDate": "2 months ago", "qualifications": {"required": "Bachelor’s degree science or engineering fields Physics, Chemistry, Aerospace, Mechanical or Manufacturing Engineering. Will consider associate’s degree in engineering and 4 years of professional experience in manufacturing/Aerospace industry, in lieu of Bachelors or Diploma with min 7 years of relevant experience.", "preferred": "US Citizenship per ITAR regulations to comply with export compliance and site SSA requirements."}, "skills": ["MRB", "Quality Notifications", "Concessions", "Static", "Fatigue", "CAD Modelling", "SAP", "PDM", "Catia V5", "SolidWorks", "EPDM", "FEM Modelling", "Ansys", "Tolerance Stack Analysis", "MS Word", "MS Excel", "Mathcad", "Aerospace Structural", "Engines", "Systems", "Aircraft Components Certification", "FAA", "EASA", "Communication", "Collaboration", "Out Of Box Returns", "RCCA", "Inventory Management", "QN Count Metric", "Purchasing", "Return To Vendor", "Concessions", "Travel", "Organization", "Prioritization", "Problem Solving", "5 Why's", "8D", "DMAIC", "Process Control", "Security Clearance", "Multi Tasking", "Microsoft Office Suite", "Customer Specifications", "Standards"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3951778810"}