{"jobTitle": "Music Content Investment Manager - Los Angeles", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$98,400.00/yr - $232,222.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>About the Team:<br/>The TikTok Music Content Investment Team is a newly formed team that focuses on partnership or acquisition opportunities in the music content space on a global level. The team will work with TikTok music content strategy team and operations teams in evaluating market opportunities, executing partnership or acquisition projects, performing detailed financial analysis and valuations of music content and related assets that would help shape the future of TikTok music businesses. Together, the team works with higher management on setting overall strategic direction, and be responsible for the results of partnership and acquisitions.<br/><br/>Responsibilities:<br/>- Develop and implement investment strategies for acquiring and managing music content<br/>- Evaluate music content acquisition strategy by conducting rigorous industry research, closely monitoring ongoing music investment landscape, and presenting relevant analyses and insights with actionable recommendations to senior management<br/>- Research and work on strategic frameworks for evaluating potential investment targets that are aligned with TikTok's music content strategic priorities<br/>- Work cross-functionally with legal, BD, product units across operational teams in TikTok, conduct due diligence and support negotiations<br/>- Prepare financial valuation models for target companies in the wider music ecosystem, including market size and growth assessment, financials projection, and synergies evaluation <br/><br/>Qualifications<br/><br/>Minimum Qualifications:<br/>- Bachelor’s or Master’s degree in Finance, Economics or relevant fields<br/>- 3+ years experience at a reputable investment bank, management consulting firm, or private equity firm <br/>- Strong corporate finance knowledge and valuation modeling skills  <br/>- Demonstrated experience in thinking strategically about issues and working cross-functionally with internal and external stakeholders  <br/>- High performer with commitment to operational excellence, strong data sense, and experience in investment acquisition and development - A team player with a positive and humble attitude <br/>- Well organized with outstanding attention to detail and the ability to plan and deliver on tight deadlines in a fast paced environment<br/><br/>Preferred Qualifications:<br/>- Familiarity with global music content, including artists, tracks, trends, asset valuation, trend drivers etc.<br/>- Excellent communication skills and a strong music industry network<br/>- Entrepreneurial mindset and proactive in identifying and solving problems<br/>- Passion for music with a deep understanding of TikTok and music trends<br/>- Knowledge of digital music distribution, music industry trends across all genres<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $98400 - $232222 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Develop and implement investment strategies for acquiring and managing music content\n- Evaluate music content acquisition strategy by conducting rigorous industry research, closely monitoring ongoing music investment landscape, and presenting relevant analyses and insights with actionable recommendations to senior management\n- Research and work on strategic frameworks for evaluating potential investment targets that are aligned with TikTok's music content strategic priorities\n- Work cross-functionally with legal, BD, product units across operational teams in TikTok, conduct due diligence and support negotiations\n- Prepare financial valuation models for target companies in the wider music ecosystem, including market size and growth assessment, financials projection, and synergies evaluation ", "qualifications": {"required": "Bachelor’s or Master’s degree in Finance, Economics or relevant fields\n- 3+ years experience at a reputable investment bank, management consulting firm, or private equity firm \n- Strong corporate finance knowledge and valuation modeling skills  \n- Demonstrated experience in thinking strategically about issues and working cross-functionally with internal and external stakeholders  \n- High performer with commitment to operational excellence, strong data sense, and experience in investment acquisition and development - A team player with a positive and humble attitude \n- Well organized with outstanding attention to detail and the ability to plan and deliver on tight deadlines in a fast paced environment", "preferred": "Familiarity with global music content, including artists, tracks, trends, asset valuation, trend drivers etc.\n- Excellent communication skills and a strong music industry network\n- Entrepreneurial mindset and proactive in identifying and solving problems\n- Passion for music with a deep understanding of TikTok and music trends\n- Knowledge of digital music distribution, music industry trends across all genres"}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3951205215"}