{"jobTitle": "Supply Chain Manager", "company": {"name": "Oldcastle Infrastructure", "industry": "Construction", "location": "Azusa, CA", "size": ""}, "location": "Azusa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Management, Manufacturing, and Supply Chain", "industry": "Construction, Glass, Ceramics and Concrete Manufacturing, and Wholesale Building Materials", "description": "INWESCO, a CRH company, is a leading provider of metal and fiberglass products and accessories for the power, water utility, and telecom markets throughout the western and southwestern United States. But we’re more than just a manufacturer. We are a trusted and strategic solutions partner to engineers, contractors, distributors, specifiers, and more. As part of the CRH Infrastructure Products business, we’re leading the industry with innovative, sustainable solutions with a safety-first mindset.\n\n<strong><u>Job Summary</u></strong>\n\nOldcastle Infrastructure is looking for a Supply Chain Manager to support our metals manufacturing business. As a Supply Chain Manager, you will support process standardization, equipment procurement, inventory management, and delivery logistics for Oldcastle Infrastructure.\n\n<strong><u>Key Responsibilities</u></strong>\n\n<ul><li>Develop standard processes and trainings for manufacturing operations, and internals installation</li><li>Optimization and capacity planning for internal supply network</li><li>Develop quality assurance processes and conduct routine assessments</li><li>Build relationships with key internal stakeholders and partners at plants</li><li>Develop inventory plan for standard products and internal components in close coordination with plants</li><li>Participate in yearly time studies across product lines</li><li>Create and update VOP list for all process paths in coordination with metals manufacturing facilities</li><li>Support product internalization efforts</li><li>Oversee creation of automated processes for operations data reporting</li></ul>\n\n<strong><u>Required Competencies</u></strong>\n\n<strong>Drives Results</strong> – Consistently achieve results, despite challenges. Has a strong bottom-line mentality and has a track record of exceeding goals. Pushes self and others to achieve results.\n\n<strong>Action Oriented</strong> – Takes initiative. Identifies and seizes new opportunities. Action oriented on challenges, without unnecessary planning. Sees challenges as opportunities instead of obstacles.\n\n<strong>Outcome Focused</strong> – Builds strong relationships and delivers scalable solutions. Prioritizes outcomes over process. Establishes and maintains effective relationships, within and outside the team. Takes accountability and ownership of ideas, ensuring any solution meets project and company goals.\n\n<strong>Collaborates</strong> – Enjoyable to work with. Builds partnerships and works collaboratively with others to meet shared objectives. Credits others for their contributions and accomplishments. Easily gains trust and support of others and partners well to get work done.\n\n<strong>Decisiveness</strong> – Can take calculated risks by exercising engineering judgment and taking measured action. Ability to make decisions with limited knowledge and adapts per outcomes. Identifies project red flags and acts in best interest of organization and customer.\n\n<strong>Innovative – </strong>Embraces innovation and views failure as a learning opportunity. Always a student. Technology driven and continually seeking for a better way. Inspires others to explore new ideas and approaches. Follows industry trends and competitive landscape.\n\n<strong>Planning and Priority Setting</strong> – Identifies actions required to complete tasks and the best method to accomplish them quickly and efficiently. Handles multiple, competing priorities with confidence and communicates timelines and outcomes effectively to Customers and stakeholders.\n\n<strong><u>Key Performance Measurements</u></strong>\n\n<ul><li>Customer lead times and service benchmarks</li><li>Cycle Count Program Accuracy Metrics</li><li>Inventory Accuracy Metrics</li><li>On Time Delivery Metrics</li><li>Supplier On Time Deliver Metrics</li><li>Continuous improvement metrics</li></ul>\n\n<strong><u>Position Requirements</u></strong>\n\n<ul><li>Bachelor’s Degree and/or 5 years work experience in supply chain management</li><li>Experience managing projects and implementation</li><li>Advanced Microsoft Excel Skills Set</li><li>Strong analytical and problem-solving skills</li><li>Excellent communicator and organized</li><li>Enthusiasm and passion for business and achieving organizational goals</li><li>Collaborator with ability to share thoughts openly, accept new ideas, and get the job done in a highly interactive process</li><li>Travel 50%</li></ul>\n\n<strong><u>Compensation</u></strong>\n\n<ul><li>Salary - $100,000 to 120,000/year plus bonus</li></ul>\n\n<strong><u>What CRH Offers You</u></strong>\n\n<ul><li>Highly competitive base pay</li><li>Comprehensive medical, dental and disability benefits programs</li><li>Group retirement savings program</li><li>Health and wellness programs</li><li>A diverse and inclusive culture that values opportunity for growth, development, and internal promotion</li></ul>\n\n<strong><u>About CRH</u></strong>\n\nCRH has a long and proud heritage. We are a collection of hundreds of family businesses, regional companies and large enterprises that together form the CRH family. CRH operates in a decentralized, diversified structure that allows you to work in a small company environment while having the career opportunities of large international organization.\n\nIf you’re up for a rewarding challenge, we invite you to take the first step and apply today! Once you click apply now, you will be brought to our official employment application. Please complete your online profile and it will be sent to the hiring manager. Our system allows you to view and track your status 24 hours a day. Thank you for your interest!\n\nOldcastle Infrastructure, a CRH Company, is an Affirmative Action and Equal Opportunity Employer.\n\nEOE/Vet/Disability", "responsibilities": "Develop standard processes and trainings for manufacturing operations, and internals installation\nOptimization and capacity planning for internal supply network\nDevelop quality assurance processes and conduct routine assessments\nBuild relationships with key internal stakeholders and partners at plants\nDevelop inventory plan for standard products and internal components in close coordination with plants\nParticipate in yearly time studies across product lines\nCreate and update VOP list for all process paths in coordination with metals manufacturing facilities\nSupport product internalization efforts\nOversee creation of automated processes for operations data reporting", "qualifications": {"required": "Bachelor’s Degree and/or 5 years work experience in supply chain management\nExperience managing projects and implementation\nAdvanced Microsoft Excel Skills Set\nStrong analytical and problem-solving skills\nExcellent communicator and organized\nEnthusiasm and passion for business and achieving organizational goals\nCollaborator with ability to share thoughts openly, accept new ideas, and get the job done in a highly interactive process\nTravel 50%", "preferred": ""}, "skills": ["Supply Chain Management", "Project Management", "Microsoft Excel", "Analytical Skills", "Problem Solving", "Communication", "Organization", "Collaboration"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Highly competitive base pay\nComprehensive medical, dental and disability benefits programs\nGroup retirement savings program\nHealth and wellness programs\nA diverse and inclusive culture that values opportunity for growth, development, and internal promotion", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3952263612"}