{"jobTitle": "Event Operations Coordinator", "company": {"name": "Lugano Diamonds", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>About Us<br/><br/></strong>Guided by our core values – The Lugano Way – our team embodies a proactive mindset that fuels our drive for success. We work with a people-first mentality and foster an environment of continuous learning and mutual growth. Our ultimate goal? To consistently find a path to YES and deliver remarkable in all we do. Through innovation, teamwork, and collaboration, we bring this to life. Join us in shaping a future of brilliance and endless possibilities.<br/><br/><strong>About You<br/><br/></strong>Join our dynamic Operations team as an Event Operations Coordinator and take on a pivotal role in delivering exceptional client experiences. Reporting to the Manager of Event Operations, you'll collaborate closely with internal departments to ensure the flawless execution of key initiatives, including event logistics, inventory management, shipping and receiving, and workplace support. This role presents exciting opportunities for both domestic and international travel.<br/><br/>Your success in this position hinges on your organizational prowess, attention to detail, adherence to processes, and ability to adapt, manage timelines, and oversee events from inception to completion. Moreover, this role offers a chance to delve deep into luxury company operations while forging strong partnerships with diverse departments and vendors. You'll also engage directly with clients and high-level executives, further enriching your expertise in the field.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li><strong>Event logistics planning and execution:</strong> Work closely with Lugano's Customer Experience team to coordinate and execute logistics for all planned events. Lead assigned event operations, ensuring thorough organization and communication with external vendors and internal departments. Follow checklists, book relevant logistics vendors, and oversee detailed planning. Lead event setup and breakdown and conduct post-event discussions to identify and implement improvements.</li><li><strong>Internal &amp; External Collaboration:</strong> Engage with vendors to execute events, securing necessary services and materials for each event and partner with all departments to facilitate seamless operations across different locations, including events and sales teams inventory, security and any other relevant teams.</li><li><strong>Inventory &amp; Shipping:</strong> Prepare and manage supplies, packaging inventory, and preparations for each event, maintaining high levels of organization. Support deliveries and shipments during events and in HQ. practice careful handling, and adherence to internal policies.</li><li><strong>Operational Support: </strong>Collaborate with the team to promote and support various operational projects and initiatives, assisting with workplace operations, shipping, inventory, and security. Contribute to the development of processes, procedures, and company policies.</li><li><strong>Travel &amp; Flexibility: </strong>This role entails extensive travel, necessitating flexibility and a willingness to adjust your schedule to support events outside of regular work hours, notably during evenings and weekends.<br/><br/></li></ul><strong>What You Bring<br/><br/><br/><br/></strong><ul><li><strong>Organizational &amp; Attention to Detail:</strong> You possess meticulous organizational skills and a methodical approach to task execution, coupled with strong attention to detail in fast-paced, evolving environments.</li><li><strong>Proactivity &amp; Problem-Solving:</strong> You have inherent curiosity and a proactive attitude toward finding solutions. You can follow established processes while also being open to innovative problem-solving, thinking outside the box, and generating solutions on the spot. Additionally, you exhibit effective prioritization and multitasking capabilities.</li><li><strong>Communication &amp; Collaboration:</strong> Your communication abilities are clear and concise, enabling effective interaction with diverse individuals. You also have a collaborative mindset and thrive as a valuable team player.</li><li><strong>Technology Proficiency:</strong> You are proficient in utilizing technology for information processing, data analysis, and organization.<br/><br/></li></ul><strong>Pay Transparency<br/><br/><br/><br/></strong>The targeted base compensation is $25/hour plus an annual bonus. The total compensation package is determined by work location and additional factors, including job-related skills, experience, and relevant education or training.<br/><br/><strong>Our Work Environment<br/><br/><br/><br/></strong>Our workplace is clean, orderly, appropriately lighted, and ventilated with the proper safety compliance. Noise levels are considered low and daily physical activities are considered medium: office work, occasionally lifting up to 51 pounds, bending, stooping, kneeling, or walking. Employees must have the stamina to work long hours if assigned. Hours and days of work may vary by position. Reasonable accommodation may be made to allow people with disabilities to perform the essential functions of their job within the environment.<br/><br/><strong>Our Benefits<br/><br/></strong>Lugano Diamonds is a fast-growing company with many opportunities for you to master your craft and grow your career. We are proud to offer employees a generous compensation package that includes commission and bonus plans for all employees, multi-option healthcare plans, 401k with match, and paid time off. Join the team and carve your own path to the future.<br/><br/><strong>Being You at Lugano<br/><br/></strong>Lugano is committed to creating a diverse work environment that recruits and rewards employees based on capabilities and performance. We are inclusive, celebrate our differences, and welcome a broad range of perspectives and ideas without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.<br/><br/><strong>Join Our Team – </strong>Where People, Leadership, Innovation, and Passion come first.<br/><br/>CCPA disclosure notice here.", "responsibilities": "Work closely with Lugano's Customer Experience team to coordinate and execute logistics for all planned events. Lead assigned event operations, ensuring thorough organization and communication with external vendors and internal departments. Follow checklists, book relevant logistics vendors, and oversee detailed planning. Lead event setup and breakdown and conduct post-event discussions to identify and implement improvements. Engage with vendors to execute events, securing necessary services and materials for each event and partner with all departments to facilitate seamless operations across different locations, including events and sales teams inventory, security and any other relevant teams. Prepare and manage supplies, packaging inventory, and preparations for each event, maintaining high levels of organization. Support deliveries and shipments during events and in HQ. practice careful handling, and adherence to internal policies. Collaborate with the team to promote and support various operational projects and initiatives, assisting with workplace operations, shipping, inventory, and security. Contribute to the development of processes, procedures, and company policies. This role entails extensive travel, necessitating flexibility and a willingness to adjust your schedule to support events outside of regular work hours, notably during evenings and weekends.", "qualifications": {"required": "Meticulous organizational skills and a methodical approach to task execution, coupled with strong attention to detail in fast-paced, evolving environments. Inherent curiosity and a proactive attitude toward finding solutions. Ability to follow established processes while also being open to innovative problem-solving, thinking outside the box, and generating solutions on the spot. Effective prioritization and multitasking capabilities. Clear and concise communication abilities, enabling effective interaction with diverse individuals. Collaborative mindset and thrive as a valuable team player. Proficiency in utilizing technology for information processing, data analysis, and organization.", "preferred": ""}, "skills": ["Event Logistics", "Vendor Management", "Inventory Management", "Shipping and Receiving", "Workplace Support", "Organizational Skills", "Attention to Detail", "Problem Solving", "Communication", "Collaboration", "Technology Proficiency"], "postedDate": "2 months ago", "benefits": "Lugano Diamonds is a fast-growing company with many opportunities for you to master your craft and grow your career. We are proud to offer employees a generous compensation package that includes commission and bonus plans for all employees, multi-option healthcare plans, 401k with match, and paid time off.", "remoteWork": "No", "salary": {"amount": "25/hour", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3952658676"}