{"jobTitle": "Transportation Manager", "company": {"name": "W3Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Our client is looking to add a Transportation Manager to their team. In this role, you will be wholly responsible for a feed mill's truck/trailer shop. This includes customer service, driver management and truck and trailer management. This position offers a competitive salary and a comprehensive benefits package.<br/><br/>Background/Experience<br/><br/>\n<ul><li>A minimum of 5 years of recent, continuous experience managing a truck/trailer shop is MANDATORY. (Preferably for a manufacturing company.)</li><li>Responsible for customer pickups at the supplier sites in a 24/7 service environment.</li><li>Manage company and contract CDL drivers under FMCSA and DOT guidelines; customer service; driver efficiency, and load factors.</li><li>5 years of experience in the trucking industry and knowledge of trucking regulations are required.</li><li>Customer service experience and college degree desired.<br/><br/></li></ul>Responsibilities<br/><br/>\n<ul><li>Supports company operations by maintaining office systems and staff, reporting directly to General Manager.</li><li>Services customers by arranging transportation (to and from their manufacturing sites) in the most efficient manner and maintaining the highest service level reasonably.</li><li>Hiring drivers, managing and hiring owner-operators, following and tracking sites' FMCSA scores, conducting driver safety meetings, and directing the truck/trailer shop.</li><li>In some cases, the manager will also oversee the maintenance and repair of customer equipment.<br/><br/></li></ul>DISPATCHING (This is only a portion of the job, not looking for dispatchers at this time.)<br/><br/>\n<ul><li>Completes operational requirements by scheduling and assigning drivers, and following up on work results. This includes data entry in the S2SQL system in building BOLs.</li><li>Assigns outbound finish shipments, if required for that region.</li><li>Keeps management informed by reviewing and analyzing daily/weekly efficiency reports; summarizing information; identifying trends for the trucking operation.</li><li>Maintains Load Efficiency within maximum legal weight (including axles).</li><li>Route drivers in a manner that reduces non-productive (not on the road) time.</li><li>Minimize driver and shop over time.</li><li>Conduct safety meetings and timely incident investigations</li><li>Customers are not to wait for service longer than the agreed-upon time.</li><li>Communication between customers and dispatch so that the customer always knows what they can expect and is notified when there are any changes in plans.</li><li>Communicates closely with plant management.</li><li>Ensure that procedures in place are properly followed.</li><li>Perform ride-a-longs with drivers to understand the job and any items to improve upon.</li><li>Understands the equipment used and advise for changes for the next contract renewal.</li><li>Knows the cost to the plant floor of the material.<br/><br/></li></ul>Additional Responsibilities<br/><br/>\n<ul><li>Back up to the PM or GM when off-site or on vacation.</li><li>Back up to the office manager for the following duties as needed:</li><ul><li>Providing customer service by answering customer calls and responding appropriately</li><li>Preparing Payroll</li><li>Data Entry</li><ul><li>Input all raw material loads on a daily basis.</li><li>Confirm all finished feed loads on a daily basis.</li><li>Confirm all supplement loads as they arrive.</li></ul></ul></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3952551416"}