{"jobTitle": "Store Assistant Manager", "company": {"name": "Daiso USA", "location": "Arcadia, CA"}, "location": "Arcadia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "As an Assistant Store Manager, provide support to the store manager in the management of store operations. In support of the store manager, he/she is responsible for store staff shift management, labor hour control, human resource development, product ordering, inventory control, and operational management of product development. He/she is also responsible for ensuring compliance with store laws and regulations, and accurately reporting any store problems or issues to the store manager and instructors.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Improvement of customer service quality, customer relations, cleanliness, implementation</li><li>Recruitment, leadership staff training, staff counseling, and building effective work operations</li><li>Management and supervision of staff, compliance with company rules and regulations, monitoring and guidance of working conditions and attitudes, and shift management</li><li>Appropriate ordering, creation of sales areas that do not run out of stock, loss control, and inventory control</li><li>Execution and management of sales plans, merchandise organization, and merchandise replenishment management</li><li>Sales goal, basket counts, MH, loss, inventory turnover days</li><li>Cash register float money management/Safe money management</li><li>Management and organize forms, documents, manuals, files, and records</li><li>Store, equipment and fixtures management</li><li>Store security, crime prevention, store interior/BR organization and tidiness</li><li>Management and control based on guidelines developed by the company. <br/><br/></li></ul><strong>Education Requirements<br/><br/></strong>High school Diploma/GED<br/><br/><strong>Work Experience Requirements<br/><br/></strong>2+ Years<br/><br/><strong>Knowledge, Skills, And Abilities Requirements<br/><br/></strong><ul><li>Previous experience as a sales associate</li><li>Experience in inventory oversight</li><li>Strong communication skills and building good relationships</li><li>Ability to achieve sales goals</li><li>Ability to respond to the speed of change in the store/company</li><li>Execution of head office information and instructions</li><li>Able to lead store problems to a positive resolution </li><li>Positive attitude, reliability, and cooperativeness in work </li><li>Must be flexible to work evenings and weekend shifts</li></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3952724933"}