{"jobTitle": "Store Manager - Beverly Hills", "company": {"name": "alice + olivia", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>TITLE:</strong> STORE MANAGER<br/><br/><strong>REPORTS TO:</strong> DISTRICT MANAGER/DIRECTOR OF STORES<br/><br/><strong>JOB DESCRIPTION:<br/><br/></strong>Our mission does not solely aim to create a unique customer experience. We produce leaders by instilling confidence, knowledge, and a stylist’s mentality. The Store Manager is responsible is responsible for driving the business forward by providing an exceptional customer experience and creating long-lasting client relationships. The Store Manager is a sales floor role, focused on creating an environment in which feedback is constant and the customer is always the top priority. It is the responsibility of the Store Manager to cultivate a store team that supports and motivates one another, and to create a legacy for themselves. This individual must oversee and manage the operations of the store to ensure they run smoothly, optimizing profitability and efficiency.<br/><br/><strong>COMPETENCIES:<br/><br/></strong><ul><li>Customer focus</li><li>Drive for results</li><li>Team player</li><li>Time management</li><li>Personal credibility</li><li>Business acumen</li><li>Communication</li><li>Managerial courage</li><li>Managing performance</li><li>Motivating others<br/><br/></li></ul><strong>THE RESPONSIBILITIES:<br/><br/></strong><ul><li>Meet personal and store sales goals by ensuring that each customer receives outstanding customer service</li><li>Establish a returning client business by developing and maintaining long lasting relationships</li><li>Actively outreach to client base to strengthen relationship via email, phone call and text messaging</li><li>Utilize company selling culture and training tools to meet and exceed KPI expectations</li><li>Actively learn and speak to the trends of each collection, with the end goal of always building stronger stylists</li><li>Maintain an active sales floor presence to lead by example and coach staff to develop strong client relationships</li><li>Provide in the moment feedback on the sales floor, with the goal of inspiring and developing the sales team</li><li>Maintain organization, upkeep, and cleanliness of both the front and back of house</li><li>Recruit, hire, onboard, and train all new hires</li><li>Participate in all Divisions of Responsibility (Human Resources, Operations, Client Services, and Visuals) to support overall business and develop as a well-rounded leader</li><li>Ensure the integrity of payroll and the payroll process</li><li>Actively support Diversity, Equity, and Inclusion initiatives</li><li>Ensure that the sales floor is maintained and beautifully reflects the brand</li><li>Cultivate an environment which promotes teamwork and comradery</li><li>Remain coachable and open to feedback to continuously develop in your role</li><li>Act as a leader in the District and as a partner to fellow Store Managers<br/><br/></li></ul><strong>REQUIREMENTS: <br/><br/></strong><ul><li>Previous management experience required</li><li>Previous sales experience required</li><li>Ability to constantly bend, open, lift, carry and move merchandise and fixtures up to 25 pounds as needed</li><li>Continuous standing and walking; ability to move around all store areas and be accessible to customers</li><li>Ability to occasionally climb ladders as needed</li><li>Ability to work daily with telephone, POS and computer equipment</li><li>Ability to work a flexible schedule including days, nights, weekends, and holidays<br/><br/></li></ul><strong>SALARY &amp; BENEFITS: <br/><br/></strong><ul><li>$85,000-$95,000/yr</li><li>Monthly and seasonal bonuses</li><li>Clothing allowance</li><li>401(k) with an employer match</li><li>Medical, dental, and vision</li><li>Floating holidays</li></ul>", "postedDate": "2 days ago", "salary": {"amount": "85,000.00/yr - 95,000.00/yr", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3952728910"}