{"jobTitle": "Logistics Coordinator", "company": {"name": "MM International, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$25.00/hr - $27.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Personal Care Product Manufacturing", "description": "<strong>Title- Logistics Coordinator<br/><br/></strong><strong>Duration- 6 months contract to start with<br/><br/></strong><strong>Location- Los Angeles, CA, 90065<br/><br/></strong><strong>Pay Rate- $25-27.00/ hr.<br/><br/></strong><strong>Summary<br/><br/></strong><ul><li>As a Logistics Coordinator I, you will play a crucial role in overseeing the transportation and delivery of goods from origin to destination. You will work closely with internal teams, external vendors, and clients to ensure seamless coordination and execution of logistics operations. The ideal candidate will possess strong organizational skills, attention to detail, and the ability to thrive in a fast-paced environment.<br/><br/></li></ul><strong>Roles &amp; Responsibilities<br/><br/></strong><ul><li>Coordinate the movement of goods, including scheduling transportation, tracking shipments, and ensuring timely delivery.</li><li>Communicate effectively with carriers, suppliers, and customers to arrange pickups and deliveries and resolve any transportation issues.</li><li>Monitor inventory levels and collaborate with procurement and warehouse teams to optimize stock levels and minimize stockouts.</li><li>Ensure compliance with regulatory requirements and company policies related to transportation and logistics operations.</li><li>Utilize logistics software and systems to track shipments, generate reports, and analyze performance metrics.</li><li>Identify opportunities for process improvement and cost optimization within the supply chain.</li><li>Maintain accurate records of shipments, invoices, and other documentation.</li><li>Provide exceptional customer service by addressing inquiries, resolving complaints, and addressing any issues during transit.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Bachelor's degree in logistics, supply chain management, business administration, or a related field.</li><li>Proven 2+ years of experience in logistics coordination, preferably in a similar industry.</li><li>Strong understanding of transportation regulations and logistics processes.</li><li>Excellent communication skills, both verbal and written.</li><li>Proficiency in logistics software and Microsoft Office Suite.</li><li>Ability to prioritize tasks and manage multiple projects simultaneously.</li><li>Detail-oriented with a focus on accuracy and efficiency.</li><li>Adaptability and problem-solving skills to navigate unforeseen challenges in the supply chain.</li><li>Commitment to customer satisfaction and continuous improvement.</li></ul>", "postedDate": "3 months ago", "skills": ["Logistics", "Transportation", "Inventory Management", "Supply Chain Management", "Customer Service", "Communication", "Microsoft Office Suite", "Logistics Software"], "url": "https://www.linkedin.com/jobs/view/3952725900"}