{"jobTitle": "Material Handler", "company": {"name": "Super King Markets", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Summary/Objective<br/><br/></strong>This position receives, stores, and distributes material, tools, equipment and products within the warehouse, ensuring accuracy and timeliness of all job functions.<br/><br/><strong>Essential Functions<br/><br/></strong>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li> Assist shipping and receiving unloading trucks, checking in merchandise, matching purchase orders to sales orders and distributing to sales associates for processing.</li><li> Read customer orders, work orders, shipping orders or requisitions to determine items to be moved, gathered or distributed and/or shipped.</li><li> Move materials and items from receiving or storage areas to shipping or to other designated areas.</li><li> Sort and place materials or items on racks, shelves or in bins according to predetermined sequence such as size, type, style, color, expiration, or product code.</li><li> File requisitions, work orders or requests for materials, tools or other stock items and distribute items to shipping or to designated route driver storage area.</li><li> Ensure warehouse is accessible and safe for salespeople and customer traffic.</li><li> Assemble customer orders from stock and place orders on pallets or shelves, or relocate orders to a holding area or shipping department.</li><li> Mark materials with identifying information using appropriate method.</li><li> Open bales, crates and other containers.</li><li> Record amounts of materials or items received or distributed via appropriate computer program.</li><li> Assist in counting of physical inventory.</li><li> Weigh and count items for distribution within plant to ensure conformance to company standards.</li><li> May be assigned facilities maintenance duties as needed.</li><li> Complete requisition forms to order supplies from varies departments.</li><li> Prepare parcels for shipping/mailing.</li><li> Sweep, dust, and mop. Organize warehouse and work area for orderliness at all times.</li><li> Wear mandatory safety equipment.</li><li> Follow and apply all safety rules to ensure cluster-free workplace environment.</li><li> Requires exposure to varying weather conditions for performance of indoor/outdoor duties.</li><li> Requires exposure to varying weather conditions for performance of indoor/outdoor duties.</li><li> Perform cleanup duties in work areas, bathrooms, shelves and assist in the cleanup of other departments. Cleaning duties such as, mop floors, dust, and minor repairs</li><li> Follow all safety rules in accordance with Company policies, OSHA, and Health department.</li><li> Other duties may be assigned as needed.<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li> Communication Proficiency</li><li> Organizational Skills</li><li> Mathematical Skills</li><li> Technical Capacity</li><li> Thoroughness</li><li> Time Management<br/><br/></li></ul><strong>Supervisory Responsibility<br/><br/></strong>This position has no direct supervisory responsibilities.<br/><br/><strong>Work Environment<br/><br/></strong>This position works in a warehouse setting, with some outdoor exposure during the week. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines, and standard warehouse equipment such as hand trucks, box cutters, electric jack, forklift, and tape dispensers.<br/><br/><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/>While performing the duties of this job, the employee is regularly required to use hands to finger, handle or feel; reach with hands and arms; and talk or hear. The employee frequently is required to stand; walk; and stoop, kneel, crouch or crawl.The employee is occasionally required to sit and climb or balance. The employee must regularly lift and/or move objects up to 10 pounds, frequently lift and/or move objects up to 50 pounds, and occasionally lift and/or move objects that weigh more than 100 pounds. Specific vision abilities required by this job", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3952753773"}