{"jobTitle": "Part Time Merchandiser - Simi Valley, CA", "company": {"name": "American Greetings", "industry": "Manufacturing and Retail", "size": "Not specified", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Associate", "salary": {"amount": "$16.20/hr - $18.00/hr", "currency": "USD"}, "jobFunction": "Sales, Other, and Customer Service", "industry": "Manufacturing and Retail", "description": "American Greetings is a global leader in the Celebrations marketplace. Celebrate with us and join our team today! As a Merchandiser with American Greetings, you are a vital part of our company’s purpose: helping people celebrate holidays, each other, and all of life’s special moments, by making the world a more thoughtful and caring place every single day. We are looking for merchandisers to service the American Greetings Department in retail locations. The starting pay is $16.20 per hour with two increases during the first year of employment (the listed rates are subject to change based on work location). After 6 months of employment the pay rate will increase to $17.10. After 1 year of continued employment the pay rate will increase to $18.00. We offer flexible work scheduling. We provide paid training and mileage reimbursement. This route will service the following retail locations: Ralphs, 2726 E Los Angeles Ave, Simi Valley, CA, 93065; Walmart, 255 Cochran Street and Five Below, 1555 Simi Town Center Way Ste 582. The weekly average hours are 8 hours per week. The weekly hours may increase to an average of 20 hours per week around holidays.", "responsibilities": "Merchandise and maintain all product displays within the greeting card department as well as other areas of the store as needed. Work in a fast paced retail environment utilizing your effective time management skills. Partner and build relationships with retail store associates and management during daytime retail business hours. Use a company provided tablet to perform basic job functions, such as reviewing weekly service and tasks, inventory functions, time entry, etc. Ability to speak, read, write, and understand English is required.", "qualifications": {"required": "18 years or older, Ability to lift up to 40 pounds with or without reasonable accommodation, Access to reliable transportation as most routes have multiple retail locations, Access to reliable internet to receive critical job information and updates, Meet scheduling needs - Occasional weekends, the day before and after major holidays as needed (e.g., Valentine's Day, Easter, Mother's Day, Father's Day, Halloween, Thanksgiving, and Christmas)", "preferred": "No Experience Necessary! We will train you!"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Flexible work scheduling, paid training, mileage reimbursement.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3952217364"}