{"jobTitle": "Marketing Associate- Hot Wheels", "company": {"name": "Mattel, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$72,000.00 - $89,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Manufacturing, Design Services, and Entertainment Providers", "description": "CREATIVITY IS OUR SUPERPOWER. It’s our heritage and it’s also our future. Because we don’t just make toys. We create innovative products and experiences that inspire fans, entertain audiences and develop children through play. Mattel is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.<br/><br/><strong>The Team:<br/></strong>Mattel’s US Commercial Marketing team localizes the global brand strategy to perform in our largest market. The team is responsible for line selection, creating pricing, overseeing the local P&amp;L and driving the go-to-market strategy in the U.S. The Marketing Associate for the Vehicles business (HW Licensed Entertainment) will report to the Manager. HW Licensed Entertainment segment features a portfolio of powerhouse IP including Disney, Universal, Nintendo, etc.<br/><br/><strong>What Your Impact Will Be<br/><br/></strong><ul><li>Analyze marketing programs to develop recommendations for optimization</li><li>Support day-to-day marketing activities, including local insights collection and synthesis of performance of brand/products</li><li>Assist with overall execution of key marketing programs on any assigned brands</li><li>Drive marketing execution with a cross-functional team </li><li>Assist in managing brand activation to commercial financial targets</li><li>Contribute to the planning and activation of brand campaigns in the US market, including pricing, placement and promotion levers</li><li>Work on a diverse range of complex business issues with varying scope using available reference materials and established precedents as assigned</li><li>Assist with the management of the P&amp;L for the portfolio – update line items, quota inputs, pricing scenarios, etc.</li><li>Perform in-depth POS analysis on key items/segments by utilizing various data base</li><li>Conduct competitive analysis on new product launches<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Bachelor’s degree in marketing, business or related field</li><li>2-3 years’ related work experience</li><li>Strong quantitative analysis skills, critical thinking and financial knowledge</li><li>Fundamental understanding of marketing principles and business</li><li>Demonstrated strong team player</li><li>Intermediate Microsoft Excel and Power point skills</li><li>Possess a positive ‘can do’ attitude</li><li>Tenacious, curious and eager to grow personally and professionally</li><li>Ability to find creative solutions to problems as they arise</li><li>Able to work within timelines for brand analyses and reporting projects</li><li>Comfortable working in a fast-paced environment</li><li>Experience in category management, trade or brand marketing, space planning, consumer research, sales and/or finance is a PLUS<br/><br/></li></ul>The annual base salary range for this position is between $72,000 and $89,000.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>Don’t meet every single requirement? At Mattel we are dedicated to building a diverse and inclusive workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>How We Work<br/><br/></strong>We are a purpose driven company aiming to empower generations to explore the wonder of childhood and reach their full potential. We live up to our purpose employing the following behaviors<br/><br/><ul><li>We collaborate Being a part of Mattel means being part of one team with shared values and common goals. Every person counts and working closely together always brings better results. Partnership is our process and our collective capabilities is our superpower.</li><li>We innovate At Mattel we always aim to find new and better ways to create innovative products and experiences. No matter where you work in the organization, you can always make a difference and have real impact. We welcome new ideas and value new initiatives that challenge conventional thinking.</li><li>We execute We are a performance-driven company. We strive for excellence and are focused on pursuing best-in-class outcomes. We believe in accountability and ownership and know that our people are at their best when they are empowered to create and deliver results.<br/><br/></li></ul><strong>Our Approach to Flexible Work:<br/></strong>We embrace a flexible work model designed to empower a culture of growth, optimism, and wellbeing, where every employee can reach their full potential. Combining purposeful in-person collaboration with flexibility, our focus is to optimize performance and drive connection for moments that matter.<br/><br/><strong>Who We Are<br/><br/></strong>Mattel is a leading global toy and family entertainment company and owner of one of the most iconic brand portfolios in the world. We engage consumers and fans through our franchise brands, including Barbie, Hot Wheels, Fisher-Price, American Girl, Thomas &amp; Friends, UNO, Masters of the Universe, Matchbox, Monster High, MEGA and Polly Pocket, as well as other popular properties that we own or license in partnership with global entertainment companies. Our offerings include toys, content, consumer products, digital and live experiences. Our products are sold in more than 195 countries in collaboration with the world’s leading retail and ecommerce companies.<br/><br/>Mattel is recognized as a Great Place to Work™ and as one of Fast Company’s Best Workplaces for Innovators in 2022.<br/><br/>Visit us at https //jobs.mattel.com/ and www.instagram.com/MattelCareers .<br/><br/>Mattel is an Affirmative Action/Equal Opportunity Employer where we want you to bring your authentic self to work every day. We welcome all job seekers including minorities, females, veterans, military spouses, individuals with disabilities, and those of all sexual orientations and gender identities.<br/><br/>Videos to watch<br/><br/>The Culture at Mattel<br/><br/>Mattel Investor Highlights", "responsibilities": "<ul><li>Analyze marketing programs to develop recommendations for optimization</li><li>Support day-to-day marketing activities, including local insights collection and synthesis of performance of brand/products</li><li>Assist with overall execution of key marketing programs on any assigned brands</li><li>Drive marketing execution with a cross-functional team </li><li>Assist in managing brand activation to commercial financial targets</li><li>Contribute to the planning and activation of brand campaigns in the US market, including pricing, placement and promotion levers</li><li>Work on a diverse range of complex business issues with varying scope using available reference materials and established precedents as assigned</li><li>Assist with the management of the P&amp;L for the portfolio – update line items, quota inputs, pricing scenarios, etc.</li><li>Perform in-depth POS analysis on key items/segments by utilizing various data base</li><li>Conduct competitive analysis on new product launches<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s degree in marketing, business or related field</li><li>2-3 years’ related work experience</li><li>Strong quantitative analysis skills, critical thinking and financial knowledge</li><li>Fundamental understanding of marketing principles and business</li><li>Demonstrated strong team player</li><li>Intermediate Microsoft Excel and Power point skills</li><li>Possess a positive ‘can do’ attitude</li><li>Tenacious, curious and eager to grow personally and professionally</li><li>Ability to find creative solutions to problems as they arise</li><li>Able to work within timelines for brand analyses and reporting projects</li><li>Comfortable working in a fast-paced environment</li><li>Experience in category management, trade or brand marketing, space planning, consumer research, sales and/or finance is a PLUS<br/><br/></li></ul>", "preferred": ""}, "skills": ["Marketing", "Business", "Quantitative Analysis", "Financial Knowledge", "Teamwork", "Microsoft Excel", "PowerPoint", "Problem Solving", "Time Management", "Category Management", "Trade Marketing", "Brand Marketing", "Space Planning", "Consumer Research", "Sales", "Finance"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "The annual base salary range for this position is between $72,000 and $89,000.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3952429829"}