{"jobTitle": "Business Analyst, Amazon Fresh", "company": {"name": "Amazon", "location": "Arlington, VA"}, "location": "Arlington, VA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "66,900.00/year - 143,100.00/year", "currency": "USD"}, "jobFunction": "Strategy/Planning, Analyst, and Information Technology", "industry": "Software Development", "description": "Do you have relentless grit, a love for problem solving, high ownership, high learn and be curious, and some level of retail business experience (so absolutely everything isn’t a ramp, since we technically support all retail functions)? If so, this role is for you!<br/><br/>We are looking for an experienced Business Analyst who is excited about using data analysis and acquiring deep business expertise to answer difficult business questions that drive decision and action for the Amazon Fresh business. This role will focus on solving critical catalog defects in the US and will be responsible for analyzing all aspects of our business to provide insights that inform business strategy and solve complex problems.<br/><br/>Our team seeks to Invent and Simplify solutions that increase the speed and quality of decision-making through business analysis and reporting, econometric research and models, business process automation, and cloud computing infrastructure. Analytics is the first line of defense for analyzing acute business problems that inform or impact KPIs.<br/><br/>In this role, you must be comfortable dealing with ambiguity, be an effective communicator, and be organized. Our business moves rapidly, and it’s important to be able to adapt to the latest changes in the business, systems, tools, and techniques for extracting, processing, analyzing, modeling, and taking action on data. You will work directly with business stakeholders to define strategy and requirements, and then lead analyses from design through delivery.<br/><br/>Key job responsibilities<br/><br/>As a Business Analyst on our team, you will focus on exciting and challenging problems, including:<br/><br/><ul><li> Own the design, development, and maintenance of ongoing and ad-hoc metrics, reports, and analyses, to drive key business decisions</li><li> Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format</li><li> Partner with BIEs and Finance to scale automated solutions and collect stakeholder feedback to drive improvement over time</li><li> Develop mechanisms and metrics to track stakeholder satisfaction and drive projects to continuously improve satisfaction scores</li><li> Learn new technology and techniques such that you can meaningfully support product and process innovation</li><li> Engage business stakeholders in constructive dialogues to convert business problems into logic problems that can be solved with data, scripting, and visualizations</li><li> Work closely with data engineering, product management, and business stakeholders to deliver features to customers<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor's degree or equivalent</li><li> 3+ years of business analyst, data analyst or similar role experience</li><li> 3+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience</li><li> Experience in Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau</li><li> Experience with data visualization using Tableau, Quicksight, or similar tools</li><li> Experience with SQL</li><li> Experience defining requirements and using data and metrics to draw business insights</li><li> Experience making business recommendations and influencing stakeholders</li><li> Proven problem solving skills, project management skills, attention to detail, and exceptional organizational skills</li><li> Ability to display complex quantitative data in a simple, intuitive format and to present findings in a clear and concise manner<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Master's degree in business or analytical discipline</li><li> 5+ years of business analyst, data analyst or similar role experience</li><li> 5+ years of business or financial analysis experience</li><li> 5+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience</li><li> Prior experience in Retail, Consumables, and/or Supply Chain Management industry</li><li> Proficient in a programming language (e.g., Python) for automation of data extraction, processing, and computation</li><li> Experience working with AWS products and environment (e.g., Redshift, S3)<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2673624", "responsibilities": "As a Business Analyst on our team, you will focus on exciting and challenging problems, including:<br/><br/><ul><li> Own the design, development, and maintenance of ongoing and ad-hoc metrics, reports, and analyses, to drive key business decisions</li><li> Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format</li><li> Partner with BIEs and Finance to scale automated solutions and collect stakeholder feedback to drive improvement over time</li><li> Develop mechanisms and metrics to track stakeholder satisfaction and drive projects to continuously improve satisfaction scores</li><li> Learn new technology and techniques such that you can meaningfully support product and process innovation</li><li> Engage business stakeholders in constructive dialogues to convert business problems into logic problems that can be solved with data, scripting, and visualizations</li><li> Work closely with data engineering, product management, and business stakeholders to deliver features to customers<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent, 3+ years of business analyst, data analyst or similar role experience, 3+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience, Experience in Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau, Experience with data visualization using Tableau, Quicksight, or similar tools, Experience with SQL, Experience defining requirements and using data and metrics to draw business insights, Experience making business recommendations and influencing stakeholders, Proven problem solving skills, project management skills, attention to detail, and exceptional organizational skills, Ability to display complex quantitative data in a simple, intuitive format and to present findings in a clear and concise manner", "preferred": "Master's degree in business or analytical discipline, 5+ years of business analyst, data analyst or similar role experience, 5+ years of business or financial analysis experience, 5+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience, Prior experience in Retail, Consumables, and/or Supply Chain Management industry, Proficient in a programming language (e.g., Python) for automation of data extraction, processing, and computation, Experience working with AWS products and environment (e.g., Redshift, S3)"}, "skills": ["Business Analyst", "Data Analysis", "Retail", "Supply Chain Management", "Excel", "Tableau", "SQL", "AWS", "Redshift", "S3", "Python", "Problem Solving", "Project Management", "Communication", "Data Visualization", "Quicksight"], "postedDate": "1 day ago", "benefits": "Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3952436743"}