{"jobTitle": "Digital Media Buyer", "company": {"name": "VENDO", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Marketing Services", "description": "<strong>Who You Are<br/><br/></strong>You know the future of retail is eCommerce, and you want to have a hand in helping shape how CPG brands interact with the digital ecosystem. Innovative, focused, and forward-thinking, you're able to anticipate problems before they happen, lead with passion and efficacy, and inspire people to do their best work daily. Keen to measure what matters, you are data-driven in your decision making. Revenue and growth naturally are extensions of your energy to do your best work and achieve results for your clients and within your team.<br/><br/>// DAY-TO-DAY //<br/><br/><ul><li>Plan, manage, and execute digital marketing strategy across a variety of ad platforms for multiple clients simultaneously. </li><li>Understanding and execution of paid search and social advertising, including Google, Meta (Facebook, Instagram), TikTok, etc. </li><li>Continuously monitor campaign performance and return-on-ad-spend (ROAS) and/or cost-per-acquisition (CPA), while suggesting and executing ongoing optimization strategies to hit and exceed assigned KPIs. </li><li>Leverage Google Analytics and other tools to review traffic performance and provide ongoing optimization suggestions. </li><li>Create and analyze campaign performance reports to inform relevant teams. </li><li>Prepare research and insights to inform ongoing media recommendations. </li><li>Manage budget allocations and bid parameters to deliver most efficient results. </li><li>Maintain strong media and technology vendor relationships and act as a resource for industry data and trends. </li><li>Constantly learn and experiment new effective bidding, ad placement, and management techniques. </li><li>Manage and leverage each campaign’s risk and loss pool for ongoing testing and experimentation. </li><li>Develop a collaborative relationship with internal and external creative teams to develop cutting-edge media assets. </li><li>Participate in budget allocation for different channels and platforms. <br/><br/></li></ul><strong> What You Bring<br/><br/></strong><ul><li>Experience in digital advertising, including paid search and social platforms. Includes campaign setup, optimization, and reporting to clients. </li><li>Passion for eCommerce and ongoing learning with a deep understanding of the digital marketing ecosystem and how media buying fits into the larger picture of digital marketing. </li><li>Knowledge of the following platforms: Google Ads, Facebook/Meta ads, TikTok. </li><li>Excellent organization, tactical, analytical/data management, Excel, and communication skills. <br/><br/></li></ul><strong> Experience<br/><br/></strong><ul><li>Google Ads: 1 year required </li><li>Meta (Facebook/Instagram) Ads: 1 year recommended<br/><br/></li></ul>This position is a Remote/Telecommute role.<br/><br/>Powered by JazzHR", "postedDate": "2 months ago", "skills": ["Google Ads", "Facebook Ads", "TikTok", "Google Analytics", "Digital Marketing", "eCommerce", "Paid Search", "Social Advertising", "Campaign Management", "Optimization", "Reporting", "Excel", "Communication", "Data Management", "Media Buying"], "url": "https://www.linkedin.com/jobs/view/3953329725"}