{"jobTitle": "EPC Sales Director", "company": {"name": "Qcells USA Corp.", "industry": "Renewable Energy Semiconductor Manufacturing", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "170,000.00/yr - 195,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Renewable Energy Semiconductor Manufacturing", "description": "<strong>Description<br/><br/></strong>Title:EPC Sales Director <br/><br/>Department: Utility Solution Sales <br/><br/>Location: Irvine, CA<br/><br/>Supervisor: Head of Utility Solution Sales<br/><br/>FLSA Status: Exempt <br/><br/>Position Status: Permanent, Full-time <br/><br/>Work Status (Remote/Hybrid/In-Office): Hybrid  <br/><br/>EPC Sales Director<br/><br/>HanwhaQcellsUSA Corp (QcellsUSA), headquartered in Irvine, CA, specializes in providing utility-scale modules, solar photovoltaic (PV), and battery energy storage systems (BESS) project development, along with Engineering, Procurement, and Construction (EPC) services for solar and BESS projects nationwide.QcellsUSA delivers comprehensive turnkey solutions encompassing the entire utility-scale project lifecycle. By choosingQcellsUSA for turnkey solutions, customers can reduce uncertainty and risk, leading to enhanced investment returns and contributing to a more sustainable future.<br/><br/>QcellsUSA’s complete turnkey solutions seamlessly integrate the expertise of our Module, Development, and EPC teams, while ensuring close coordination with other vital internal groups such as Project Finance, Systems Integration, and Legal. This collaborative approach ensures thatQcellsUSA projects deliver exceptional value and performance. With several multi-billion-dollar investments,Qcellsis pioneering the establishment of the only complete module supply chain in the U.S., including the expansion of our Georgia module manufacturing facility, which stands as the largest in the Western Hemisphere.<br/><br/>As an integral part of the globalQcellsbrand,QcellsUSA benefits from a legacy of excellence in photovoltaic manufacturing.Qcellsis renowned worldwide for its high-performance, superior-quality solar cells and modules. With dual headquarters in Seoul, South Korea (Global Executive HQ) andThalheim, Germany (Technology &amp; Innovation HQ),Qcellsoperates under the umbrella of Hanwha Group, a FORTUNE Global 500 company and one of the top 8 business conglomerates in South Korea.<br/><br/><strong>Summary<br/><br/></strong>The EPC Sales Director is a self-starter who provides leadership in the organization and is accountable for business development and sales effort. This position reports to the Head of Utility Solution Sales or another management personnel that the President of the Company may designate. This positionreports to the Irvine, CA office but willmaintainahybrid schedule of working out of their home office and the Irvine, CA office.Working hours are Monday throughFriday, from 8:00am to 5:00pm or 9:00am to 6:00pm local time. This position is expected to travel up to30%of the time.<br/><br/><strong>Essential Job Function &amp; Responsibilitie<br/><br/></strong><ul><li>Regular attendance, in accordance with company's attendance policy and supervisory assignment, is an essential job duty requirement for this position; and</li><li>Leads strategies to obtain new utility-scale solar EPC business.  </li><li>Tracks and supports key project initiatives within speci&amp;#64257;ed target accounts.  </li><li>Possesses and cultivates long-term relationships with key management personnel within the customer organization, spanning across procurement, engineering, process controls, operations, and the like.  </li><li>Develops and executes strategic account plans to ensure business goals are achieved.  </li><li>Develops e&amp;#64256;ective di&amp;#64256;erentiators and negotiation strategies and understands all key commercial and legal issues.  </li><li>Reports annual business plan and market evaluation, a weekly report on revenue and margins, actions completed, look ahead travel, and action plans.<br/><br/></li></ul><strong>Required Qualification<br/><br/></strong><ul><li>Bachelor’s Degree in engineering preferred. </li><li>8-10 years of EPC sales or execution. </li><li>A proven track record of utility-scale solar EPC sales and possess existing relationships at the executive level within customer organizations. </li><li>Solar industry experience preferred. </li><li>Pro&amp;#64257;cient knowledge of project engineering, procurement, and construction processes/procedures. </li><li>Excellent verbal and written communication skills.</li><li>Regular attendance, in accordance with company's attendance policy and supervisory assignment, is an essential job duty requirement for this position</li><li>Perform other duties and special projects as assigned byManagement<br/><br/></li></ul>PHYSICAL DEMANDS<br/><br/><ul><li>Stationary Position: frequently remains stationary up to 90% of the time and sitting up to 8 hours in a day</li><li>Move/Traverse: infrequently bend, stand, stoop and/or walk</li><li>Carry Weight: infrequently carry weight and/or lift objects (light to heavy) weighing up to 10 pounds</li><li>Hearing and Speech: frequently communicates with the ability to hear and talk on a regular basis with employees, coworkers, and all personnel matters; must be able to exchange accurate information in these situations</li><li>Sight: frequent use of sight to detect images on computer, office documents, and office objects near and far</li><li>Climb: occasionally ascends/descends on stairway to get to office upper and lower floors</li><li>Travel: up to 30% as needed<br/><br/></li></ul>WORK ENVIRONMENT<br/><br/><ul><li>Regular professional, office business setting</li><li>Noise level ranges from low to moderate (if in office setting)</li><li>Noise level ranges from moderate to high (if on construction worksite)<br/><br/></li></ul><strong>SALARY RANGE FOR POSITION<br/><br/></strong>The anticipated starting pay range of this position, which is to be located in Irvine, CA is$170,000 - $195,000 base salary per year.<br/><br/><em>This job position is specific to Qcells USA Corp. only and not any other Hanwha affiliates. The above-listed salary range is required by the California Pay Transparency Act and may differ depending on the location of those candidates hired nationwide. The salary range shared in the job description is for the listed position and only pertains to the candidate if they work in Irvine, CA. Actual compensation is influenced by a wide array of factors including but not limited to internal pay equity, skill set, education, licenses and certifications, geographic location, essential job duties and requirements, and the necessary experience relative to the job’s minimum qualifications. If candidates are considered for a nationwide role, then the compensation range will follow the marketability of the job function within those states. An additional discretionary bonus structure or incentives may be offered as part of the overall compensation package, in addition to the full range of medical, dental, and/or other benefits, dependent on the level and position offered.<br/><br/></em>Hanwha Qcells is proud to be an at-will Equal Opportunity Employer and prohibits discrimination against race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, pregnancy, citizenship, disability, protected veteran status and any other classification protected by applicable federal, state or local law. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/>We are committed to the full inclusion of all qualified individuals. As part of this commitment, Hanwha Qcells will provide reasonable accommodations to all qualified individuals with disabilities to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment. Please contact us to request accommodations at hr-usa@qcells.com.<br/><br/>Nothing in this statement shall imply implicitly or explicitly a guarantee of employment outside our at-will employment opportunity.<br/><br/>This job position is specific to Qcells USA Corp. only and not any other Hanwha affiliates. The above-listed salary range is required by the California Pay Transparency Act and may differ depending on the location of those candidates hired nationwide. The salary range shared in the job description is for the listed position and only pertains to the candidate if they work in Irvine, CA. Actual compensation is influenced by a wide array of factors including but not limited to internal pay equity, skill set, education, licenses and certifications, geographic location, essential job duties and requirements, and the necessary experience relative to the job’s minimum qualifications. If candidates are considered for a nationwide role, then the compensation range will follow the marketability of the job function within those states. An additional discretionary bonus structure or incentives may be offered as part of the overall compensation package, in addition to the full range of medical, dental, and/or other benefits, dependent on the level and position offered.<br/><br/>You may view your privacy rights by reviewing Qcells' Privacy Policy or by contacting our HR team for a copy.", "responsibilities": "<ul><li>Regular attendance, in accordance with company's attendance policy and supervisory assignment, is an essential job duty requirement for this position; and</li><li>Leads strategies to obtain new utility-scale solar EPC business.  </li><li>Tracks and supports key project initiatives within speci&amp;#64257;ed target accounts.  </li><li>Possesses and cultivates long-term relationships with key management personnel within the customer organization, spanning across procurement, engineering, process controls, operations, and the like.  </li><li>Develops and executes strategic account plans to ensure business goals are achieved.  </li><li>Develops e&amp;#64256;ective di&amp;#64256;erentiators and negotiation strategies and understands all key commercial and legal issues.  </li><li>Reports annual business plan and market evaluation, a weekly report on revenue and margins, actions completed, look ahead travel, and action plans.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s Degree in engineering preferred. </li><li>8-10 years of EPC sales or execution. </li><li>A proven track record of utility-scale solar EPC sales and possess existing relationships at the executive level within customer organizations. </li><li>Solar industry experience preferred. </li><li>Pro&amp;#64257;cient knowledge of project engineering, procurement, and construction processes/procedures. </li><li>Excellent verbal and written communication skills.</li><li>Regular attendance, in accordance with company's attendance policy and supervisory assignment, is an essential job duty requirement for this position</li><li>Perform other duties and special projects as assigned byManagement<br/><br/></li></ul>"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3953644220"}