{"jobTitle": "Senior Project Manager – Environmental Assessment & Remediation", "company": {"name": "Kleinfelder", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Science, and Engineering", "industry": "Civil Engineering, Environmental Services, and Utilities", "description": "<strong>Job Description<br/><br/></strong><strong>Take Your Environmental Career to the Next Level<br/><br/></strong>Are you ready to be challenged, make a difference, and experience professional growth in your career? Kleinfelder's Environmental team is looking for you! From environmental planning, permitting, remediation, and site characterization to chemical data management and hydrogeology, Kleinfelder offers a variety of services designed to provide technically appropriate and cost-effective solutions.<br/><br/><strong>Step into Your New Role<br/><br/></strong>The San Diego Area (San Diego and Imperial Counties) is seeking a Senior Project Manager to join the environmental team. This person will manage environmental projects and be our primary point of contact with key regional clients. The candidate must have an extensive assessment and remediation background and proven successful project portfolio building skills. <strong>This candidate will lead project management, technical execution, team engagement, and strategic client and business development for multi-disciplinary industrial and construction environmental clients.<br/><br/></strong>This person will be based out of our San Diego headquarters office. The candidate must have an extensive site characterization assessment and remediation background.<br/><br/>Skills and Experience:<br/><br/><ul><li> Direct and oversee environmental Phase I / II site assessments, soil and groundwater assessments, feasibility studies, remedial action plans, remediation system design/operation, construction, multi-media compliance efforts, and other supporting technical studies; </li><li> Direct and oversee large programs and multiple projects simultaneously within scope, schedule and ensure quality is achieved on project deliverables; </li><li> Well-developed presentation, loss prevention, and interpersonal skills; </li><li> Advanced technical writer/detailed reviewer of data/reports; </li><li> Experience/working-knowledge with San Diego Department of Health, Regional Water Quality Control Boards, and California Department of Toxic Substances Control; experience working with US Navy is a plus; and </li><li> High level of competency in environmental consulting including financial management, client management, and risk management. <br/><br/></li></ul>This opportunity encompasses analysis of environmental data from environmental an/or hydrogeologic investigations, familiarity with remediation systems, and regulatory compliance.<br/><br/>Responsibilities include:<br/><br/><ul><li> Business development activities, leading and supporting proposal and contract interview activities </li><li> Project team management; </li><li> Front-line client interaction/communications; </li><li> Quality assurance/quality control (QA/QC) accountability; </li><li> Data analyses and calculations in support of scientific investigations and engineered solutions; and </li><li> Planning and oversight of field investigation programs </li><li> Coordination of regulatory communications/meetings. <br/><br/></li></ul>The role also encompasses:<br/><br/><ul><li> Staff supervision and team leadership; </li><li> Assisting with career tracking in loss prevention and risk management; and </li><li> Client management. <br/><br/></li></ul>As a senior project manager and role model, this leadership position requires an excellent attitude and an ability to communicate and effectively manage a talented bench of internal and external team members.<br/><br/>Experience:<br/><br/>Progressive experience in environmental consulting, in-depth knowledge of California and federal environmental regulations, history of strong client relationships and the ability to provide high-end technical advisory support and win new contracts.<br/><br/>6-7 years of project management experience with multi-disciplinary environmental compliance projects and proven responsibility with scope / schedule / budget. Supervisory experience preferred.<br/><br/>Education:<br/><br/>BS (MS preferred) from an accredited college/university with a major in civil/environmental/chemical engineering, geology, or related field is required. Professional licensure (PE or PG) required.<br/><br/><strong> POSITION CONDITIONS <br/><br/></strong><ul><li> This position is performed in an office and field environment. </li><li> Candidate must pass a medical surveillance that includes drug screening. </li><li> Ability to lift up to 25lbs. </li><li> Up to 20% of time may be dedicated to field activities in varying environmental conditions including inclement weather. </li><li> Some night and weekend work may be required for this position. </li><li> May periodically require travel and stays outside of the greater San Diego area. </li><li> Personal vehicle use for travel to / from project site is expected. <br/><br/></li></ul><strong>Move Forward with Kleinfelder<br/><br/></strong>Kleinfelder has been connecting great people to the best work since 1961. We are engineers, scientists, and construction professionals providing solutions that improve our clients' transportation, water, energy, and other private infrastructure. As a responsive, cross-disciplinary team of bright, curious, and innovative problem-solvers, we are dedicated to doing the right thing, every day, on every project from over 85 offices in the US, Canada, and Australia. Connecting great people to the best work is our purpose - together, we deliver.<br/><br/><strong>Progress with an Employer that Values You<br/><br/></strong>Kleinfelder is an inclusive organization free from discrimination. We are a stronger organization when we are a diverse workforce and believe that throughdiversity, equity, and inclusion comes creativity, innovation, and unity. We are proud to offer the following:<br/><br/><strong> Benefits: </strong>Kleinfelder offers an excellent compensation and benefits package, including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays. The expected salary range for the position is displayed in accordance with the California Pay Transparency Law. Final agreed upon compensation is based upon individual qualifications and experience. Salary range: 141,440-216,455<br/><br/><strong> Career Development: </strong>We are committed to investing in the professional development of our staff, offering each employee every opportunity to grow, develop, and take control of their career paths. We support these efforts through reimbursements for continuing education as well as many of the expenses associated with trainings and certifications, and opportunities for career development through our internal Mentoring Program.<br/><br/><strong> Equal Opportunity: </strong>Kleinfelder is an Equal Opportunity Employer - Minorities/Women/Disabled/Veterans. (Compliant with the new VEVRAA and Section 503 rules)<br/><br/><strong>NOTICE TO THIRD PARTY AGENCIES <br/><br/></strong>Please note that Kleinfelder does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, Kleinfelder will not consider or agree to payment for any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, Kleinfelder explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resume, including those submitted to hiring managers, are deemed to be the property of Kleinfelder.", "responsibilities": "Responsibilities include:<br/><br/><ul><li> Business development activities, leading and supporting proposal and contract interview activities </li><li> Project team management; </li><li> Front-line client interaction/communications; </li><li> Quality assurance/quality control (QA/QC) accountability; </li><li> Data analyses and calculations in support of scientific investigations and engineered solutions; and </li><li> Planning and oversight of field investigation programs </li><li> Coordination of regulatory communications/meetings. <br/><br/></li></ul>", "qualifications": {"required": "Progressive experience in environmental consulting, in-depth knowledge of California and federal environmental regulations, history of strong client relationships and the ability to provide high-end technical advisory support and win new contracts.<br/><br/>6-7 years of project management experience with multi-disciplinary environmental compliance projects and proven responsibility with scope / schedule / budget. Supervisory experience preferred.<br/><br/>Education:<br/><br/>BS (MS preferred) from an accredited college/university with a major in civil/environmental/chemical engineering, geology, or related field is required. Professional licensure (PE or PG) required.", "preferred": null}, "skills": ["Environmental Assessment", "Remediation", "Project Management", "Environmental Compliance", "Business Development", "Client Management", "Technical Writing", "Data Analysis", "Regulatory Compliance", "Team Leadership", "Supervisory Experience", "California Environmental Regulations", "Federal Environmental Regulations"], "postedDate": "1 day ago", "benefits": "Kleinfelder offers an excellent compensation and benefits package, including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays. The expected salary range for the position is displayed in accordance with the California Pay Transparency Law. Final agreed upon compensation is based upon individual qualifications and experience. Salary range: 141,440-216,455<br/><br/>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3953121557"}