{"jobTitle": "District Manager", "company": {"name": "7 Leaves Cafe", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "This job contributes to 7 Leaves' success by directing and leading a team of store managers in opening new and managing existing corporate locations and in meeting or exceeding financial, operational, and customer service goals. You will be responsible for directing a variety of stores by implementing strategies and ensuring their successful execution. Pay starts at: $65,000 Key Responsibilities Responsibilities and essential job functions include but are not limited to the following: Leadership - Manages with integrity, honesty, and knowledge that promotes the culture, values, and mission of 7 Leaves Cafe Responsible for building and maintaining a core bench strength of managers and supervisors in your District. Setting goals with the Store Managers and modeling how we work together to organize and achieve those goals through tools such as performance reviews, reports, etc. Identifies and communicates key responsibilities and practices to make sure the Store Managers promote a successful attitude, leadership, and teamwork to achieve business results. Providing Store Managers with coaching, feedback, and developmental opportunities that build effective teams. Ensures Store Managers and team Members adhere to legal and operational compliance requirements and provides themselves as a resource for all policies, procedures, issues, etc. Monitors store training to ensure consistent execution of compliance with the company's brand standards and operating guidelines Oversees training and development of Store Managers directly and indirectly manages and makes effective staffing decisions Provides coaching, direction, and leadership support to team members to develop future management members Planning and Execution - Developing strategic and operational plans for the Store Managers, directing the execution, and measuring results: Executes company's rollouts and ensures such programs are aligned with 7 Leaves' goals and objectives Analyze and develop district-level strategies to achieve each store's financial, operational, and customer-service goals, while addressing each store's unique strengths and challenges Locate the opportunities for growth within the district &amp; store to provide the most efficient and effective operation while also maintaining excellent customer service Prepares, communicates, and educates Store Managers and Team Members on changes in policies and practices Collaborates with related departments (HR, Marketing, Finance, etc. to make sure that team efforts are aligned with overall business objectives Helps to remove barriers from Store Managers and provide them with the needed support services such as marketing promotions, customer service support, and new technology tools and processes to increase productivity Oversees the servicing of existing locations to ensure customer satisfaction and sales growth. Actively stays connected with customers to provide feedback for improvement. Required Knowledge, Skills, and Abilities Experience in building and leading field teams (3+ years) Experience in food &amp; beverage management of 2 or more stores, departments, or units. P&amp;L, inventory, operations, and customer service (3+ years) Experience leading a team of 6 or more, including training and coaching, with strong leadership and communication skills (3+ years) Strong organizational, interpersonal, and problem-solving skills. Effective communication and follow-up skills are a minimum requirement. Ability to apply sound business principles and practices to project management and change management processes Financial management skills, including analysis of profit and loss and return on investment Ability to build long-term business relationships, execute business plans and meet sales objectives Proficiency in computer basics (Google G-suite) Physical Requirements Prolonged periods of standing, stooping, and walking ___________________________________ 7 Leaves Cafe is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law. This organization participates in E-verify . Job Posted by ApplicantPro", "responsibilities": "Responsibilities and essential job functions include but are not limited to the following: Leadership - Manages with integrity, honesty, and knowledge that promotes the culture, values, and mission of 7 Leaves Cafe Responsible for building and maintaining a core bench strength of managers and supervisors in your District. Setting goals with the Store Managers and modeling how we work together to organize and achieve those goals through tools such as performance reviews, reports, etc. Identifies and communicates key responsibilities and practices to make sure the Store Managers promote a successful attitude, leadership, and teamwork to achieve business results. Providing Store Managers with coaching, feedback, and developmental opportunities that build effective teams. Ensures Store Managers and team Members adhere to legal and operational compliance requirements and provides themselves as a resource for all policies, procedures, issues, etc. Monitors store training to ensure consistent execution of compliance with the company's brand standards and operating guidelines Oversees training and development of Store Managers directly and indirectly manages and makes effective staffing decisions Provides coaching, direction, and leadership support to team members to develop future management members Planning and Execution - Developing strategic and operational plans for the Store Managers, directing the execution, and measuring results: Executes company's rollouts and ensures such programs are aligned with 7 Leaves' goals and objectives Analyze and develop district-level strategies to achieve each store's financial, operational, and customer-service goals, while addressing each store's unique strengths and challenges Locate the opportunities for growth within the district &amp; store to provide the most efficient and effective operation while also maintaining excellent customer service Prepares, communicates, and educates Store Managers and Team Members on changes in policies and practices Collaborates with related departments (HR, Marketing, Finance, etc. to make sure that team efforts are aligned with overall business objectives Helps to remove barriers from Store Managers and provide them with the needed support services such as marketing promotions, customer service support, and new technology tools and processes to increase productivity Oversees the servicing of existing locations to ensure customer satisfaction and sales growth. Actively stays connected with customers to provide feedback for improvement.", "qualifications": {"required": "Experience in building and leading field teams (3+ years) Experience in food &amp; beverage management of 2 or more stores, departments, or units. P&amp;L, inventory, operations, and customer service (3+ years) Experience leading a team of 6 or more, including training and coaching, with strong leadership and communication skills (3+ years) Strong organizational, interpersonal, and problem-solving skills. Effective communication and follow-up skills are a minimum requirement. Ability to apply sound business principles and practices to project management and change management processes Financial management skills, including analysis of profit and loss and return on investment Ability to build long-term business relationships, execute business plans and meet sales objectives Proficiency in computer basics (Google G-suite) Physical Requirements Prolonged periods of standing, stooping, and walking"}, "skills": ["Leadership", "Team Management", "Training", "Coaching", "Strategic Planning", "Operational Planning", "Financial Management", "Customer Service", "Communication", "Problem Solving", "Google G-suite"], "postedDate": "2 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3953869586"}