{"jobTitle": "Benefits Manager", "company": {"name": "AO Globe Life", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "Job Description:<br/><br/>Step into our legacy of serving working class families since 1951, providing life, accident, and supplemental health products to safeguard members of labor unions, credit unions, associations, and their beloved families. We are seeking representatives who can forge long-term relationships with clients, meeting them where they feel most comfortable: their homes, through the convenience of Zoom Virtual Calls.<br/><br/>About Us:<br/><br/><ul><li>Parent Company: Globe Life</li><li>Growth: Achieved over 20% growth last year, affirming our essential business status even during the pandemic</li><li>Location: Remote work available for candidates based in the US<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Communication Skills: Excellent communication skills for clear and effective client interactions</li><li>Technical Proficiency: Basic computer knowledge for seamless virtual engagement</li><li>Work Ethic: Strong work ethic with a commitment to delivering exceptional service</li><li>Personality: Outgoing, fun, and energetic personality that leaves a positive and lasting impression</li><li>Time Management: Exceptional time management skills to ensure productive and efficient work</li><li>Leadership Experience: Prior experience in leadership or management is valued and offers growth opportunities<br/><br/></li></ul>Job Benefits:<br/><br/><ul><li>Remote Work: Enjoy the freedom of 100% remote work from the comfort of your home</li><li>Weekly Pay: Peace of mind with weekly pay, based on a structured schedule designed for success</li><li>Performance Bonuses: Unlock bonus-structured contracts that recognize your exceptional performance</li><li>Health Insurance: Prioritize your well-being with health insurance reimbursement</li><li>Life Insurance: Secure your future with comprehensive life insurance coverage</li><li>Flexible Schedule: Delight in a personalized schedule that accommodates your individual needs</li><li>Retirement Plan: Plan for retirement with confidence through our robust retirement plan</li><li>Renewals: Benefit from renewals, rewarding your long-term commitment<br/><br/></li></ul>Application Process:<br/><br/><ul><li>Interviews: All interviews will be conducted via Zoom, ensuring your safety and convenience<br/><br/></li></ul>Join Us:<br/><br/>Join our legacy of protecting families since 1951 by submitting your application today. Become part of our team and embark on a rewarding work-from-home opportunity with Globe Life.<br/><br/>Submit your application on JazzHR now and take the first step towards a fulfilling career!<br/><br/>Powered by JazzHR<br/><br/>OTEreNHPDW", "postedDate": "2 months ago", "skills": [], "benefits": "Remote Work: Enjoy the freedom of 100% remote work from the comfort of your home\nWeekly Pay: Peace of mind with weekly pay, based on a structured schedule designed for success\nPerformance Bonuses: Unlock bonus-structured contracts that recognize your exceptional performance\nHealth Insurance: Prioritize your well-being with health insurance reimbursement\nLife Insurance: Secure your future with comprehensive life insurance coverage\nFlexible Schedule: Delight in a personalized schedule that accommodates your individual needs\nRetirement Plan: Plan for retirement with confidence through our robust retirement plan\nRenewals: Benefit from renewals, rewarding your long-term commitment", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3953221828"}