{"jobTitle": "Director, Order Management", "company": {"name": "Red Bull", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "121,695.00/yr - 134,505.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Food and Beverage Services", "description": "The Director of Order Management will lead VMI and DP order management/fulfillment teams. This role develops the overall strategy for the Replenishment and Order Management process for RBDC and third-party DPs. He/she will set inventory targets across all distribution facilities within the US to enable the highest possible customer satisfaction. You will partner with Finance and Distribution to ensure Financial Sales targets are met through proper execution, target days on hand are maintained, and changes and challenges for Distributors are communicated.\n\nYou will have exposure to Inventory Planning, Logistics, Distribution, Forecasting, and Finance and work closely with his/her peers in Red Bull North America to assist in developing, implementing, and sharing best practices.\n\n**All the responsibilities we'll trust you with:**\n\n**ORDERS FULFILLMENT**\n\n* Lead and Update SKU inventory levels Across RBDC and VMI DPs within established targets to prevent stock-outs and overstock situations, especially during product transitions (promotional packaging, new items, and phase-out items).\n* Lead Sales Order Process from SOET Entry to Execution.\n* Partner with the Supply Planning Team to apply a zero-cut method for all Orders.\n* Develop KPIs and Dashboards to report Service Level and ways of improvement.\n* Assist inventory reconciliation between customer systems and Red Bull North America.\n\n**CUSTOMER SERVICE**\n\n* Strong Relationship with Sr Director of Distribution and Finance.\n* Communicate with the customers about product stocking levels and seasonal fluctuations to ensure there are no stockouts or out-of-code risks.\n* Lead customer reviews to identify and implement opportunities for continuous improvement. Weekly/Monthly customer reporting (Inventory level, PO report).\n* Periodic follow-up with existing and potential customers and training customers on supply chain/inventory best practices.\n* Create reporting and clear messaging to internal and external stakeholders.\n\n**LOGISTICS/FINANCE**\n\n* Ensure Replenishment Orders are in full truckload quantities to minimize transportation costs and optimize truckload utilization.\n* Develop Process to Optimize case pick/cross-dock efficiency.\n* Partner with Trade Finance to ensure Financial Sales projections are aligned with LE and highlight potential variations.\n\n**PROJECT MANAGEMENT**\n\n* Sponsor new VMI customer implementations.\n* Identify opportunities for process adaptation and create tools to increase business efficiency.\n* Establish a strong network and foster collaboration with key stakeholders and team members.\n\n**MISCELLANEOUS OPERATIONS SUPPORT**\n\nLead/support operations-related and ad-hoc projects.\n\n**PEOPLE MANAGEMENT**\n\n* Conduct reviews with your team members, set yearly goals, and support their growth within Red Bull Responsible for hiring new team members as needed.\n\n**Your areas of knowledge and expertise that matter most for this role:**\n\n* Bachelor’s degree in Supply Chain, Business, or related field with undergraduate statistical analysis or engineering focus\n* 10 plus years of experience in Supply Chain related roles such as Replenishment Planning, Order Management, and Inventory Planning\n* Eager to service an important clientele and perform at exceptional levels of customer service.\n* Strong Time Management Skills - Managing numerous projects at once, in a high-paced environment.\n* Self-motivated team member who can drive resolution to issues with strong problem-solving skills.\n* Deep knowledge and experience in SAP ERP, APO SNP and IBP\n* Experience with WMS software a plus (Encompass, VIP, EOStar, etc.)\n* Previous experience with VMI/DRP/CPFR implementation is highly recommended.\n* Advanced user in MS Office Suite (Word, Excel, Power Point, Access, Visio)\n* APICS certification a plus\n\nThe base salary range for this position is $121,695 to $134,505 + cash incentives Actual salary offer may vary based on work experience. The base pay range is subject to change and may be modified in the future.\n\nOur current Benefits include:\n\nComprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO & Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location).", "responsibilities": "Lead and Update SKU inventory levels Across RBDC and VMI DPs within established targets to prevent stock-outs and overstock situations, especially during product transitions (promotional packaging, new items, and phase-out items). Lead Sales Order Process from SOET Entry to Execution. Partner with the Supply Planning Team to apply a zero-cut method for all Orders. Develop KPIs and Dashboards to report Service Level and ways of improvement. Assist inventory reconciliation between customer systems and Red Bull North America. Strong Relationship with Sr Director of Distribution and Finance. Communicate with the customers about product stocking levels and seasonal fluctuations to ensure there are no stockouts or out-of-code risks. Lead customer reviews to identify and implement opportunities for continuous improvement. Weekly/Monthly customer reporting (Inventory level, PO report). Periodic follow-up with existing and potential customers and training customers on supply chain/inventory best practices. Create reporting and clear messaging to internal and external stakeholders. Ensure Replenishment Orders are in full truckload quantities to minimize transportation costs and optimize truckload utilization. Develop Process to Optimize case pick/cross-dock efficiency. Partner with Trade Finance to ensure Financial Sales projections are aligned with LE and highlight potential variations. Sponsor new VMI customer implementations. Identify opportunities for process adaptation and create tools to increase business efficiency. Establish a strong network and foster collaboration with key stakeholders and team members. Lead/support operations-related and ad-hoc projects. Conduct reviews with your team members, set yearly goals, and support their growth within Red Bull Responsible for hiring new team members as needed.", "qualifications": {"required": "Bachelor’s degree in Supply Chain, Business, or related field with undergraduate statistical analysis or engineering focus 10 plus years of experience in Supply Chain related roles such as Replenishment Planning, Order Management, and Inventory Planning Eager to service an important clientele and perform at exceptional levels of customer service. Strong Time Management Skills - Managing numerous projects at once, in a high-paced environment. Self-motivated team member who can drive resolution to issues with strong problem-solving skills. Deep knowledge and experience in SAP ERP, APO SNP and IBP Experience with WMS software a plus (Encompass, VIP, EOStar, etc.) Previous experience with VMI/DRP/CPFR implementation is highly recommended. Advanced user in MS Office Suite (Word, Excel, Power Point, Access, Visio)", "preferred": "APICS certification a plus"}, "skills": ["Supply Chain", "Replenishment Planning", "Order Management", "Inventory Planning", "Customer Service", "Time Management", "Problem Solving", "SAP ERP", "APO SNP", "IBP", "WMS", "VMI", "DRP", "CPFR", "MS Office Suite", "Word", "Excel", "Power Point", "Access", "Visio", "APICS"], "postedDate": "2 days ago", "benefits": "Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO & Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3953821229"}