{"jobTitle": "Quantitative UX Researcher, University Grad", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "99,000.00/yr - 163,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Technology, Information and Internet", "description": "Our UX Research team is designing for the global diversity of human needs, which requires us to deeply understand the behaviors of the people behind them. Our researchers tackle some of the most complex challenges to gain deeper insights into how people interact with each other and the world around them, and work collaboratively to contribute new ideas to products that impact the experiences of billions of people on a global scale.We are looking for an experienced individual contributor who will help elevate the practice of research with creative but rigorous qualitative, quantitative, and/or design research methods. The right candidate will be an effective communicator, passionate about understanding people, curious about the relationship between data, technology and society, comfortable in a flat, fast-moving organization, and a great collaborator.This job description represents different UX Research opportunities for full-time new graduate roles across Meta’s family of apps and services.<br/><br/>Quantitative UX Researcher, University Grad Responsibilities:<br/><br/><ul><li>Design and execute end-to-end custom primary research using a wide variety of methods</li><li>Work closely with product teams, as well as other researchers, to identify important research questions</li><li>Act as a thought leader in research, while advocating for people who use our products</li><li>Generate insights that shape how product teams think about medium and long-term product strategy</li><li>Communicate results and illustrate suggestions in compelling and creative ways</li><li>Work cross-functionally with design, product management, data science, content strategy, engineering, and marketing<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Currently has or in the process of obtaining MA/MS in a human behavior-related field, such as Human-Computer Interaction, Psychology, Sociology, Communication, Anthropology, Information Science, Computer Science, or Political Science</li><li>Knowledge of research methods in at least one subset of methods (e.g., survey design and quantitative data analysis, ethnography) - qualitative and/or quantitative research</li><li>Experience conveying research findings and implications to audiences</li><li>Analytical, project management, and problem-solving experience</li><li>Experience with autonomy and independent decision making to weigh tradeoffs and balance demands</li><li>Experience mentoring other researchers and maintain our team's standard of work</li><li>Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience with consumer products, consumer insights, or product research</li><li>Currently has or in the process of obtaining PhD in a human behavior-related field, such as Human-Computer Interaction, Psychology, Sociology, Communication, Anthropology, Information Science, Computer Science, or Political Science<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$99,000/year to $163,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Design and execute end-to-end custom primary research using a wide variety of methods\nWork closely with product teams, as well as other researchers, to identify important research questions\nAct as a thought leader in research, while advocating for people who use our products\nGenerate insights that shape how product teams think about medium and long-term product strategy\nCommunicate results and illustrate suggestions in compelling and creative ways\nWork cross-functionally with design, product management, data science, content strategy, engineering, and marketing", "qualifications": {"required": "Currently has or in the process of obtaining MA/MS in a human behavior-related field, such as Human-Computer Interaction, Psychology, Sociology, Communication, Anthropology, Information Science, Computer Science, or Political Science\nKnowledge of research methods in at least one subset of methods (e.g., survey design and quantitative data analysis, ethnography) - qualitative and/or quantitative research\nExperience conveying research findings and implications to audiences\nAnalytical, project management, and problem-solving experience\nExperience with autonomy and independent decision making to weigh tradeoffs and balance demands\nExperience mentoring other researchers and maintain our team's standard of work\nMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment", "preferred": "Experience with consumer products, consumer insights, or product research\nCurrently has or in the process of obtaining PhD in a human behavior-related field, such as Human-Computer Interaction, Psychology, Sociology, Communication, Anthropology, Information Science, Computer Science, or Political Science"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "$99,000/year to $163,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3953550459"}