{"jobTitle": "Material Planner", "company": {"name": "Harbinger", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00/yr - 110,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing", "description": "<strong>About Harbinger<br/><br/></strong>Harbinger Motors Inc. is a Southern California-based electric vehicle manufacturer on a mission to transform the automotive and transportation industries, bringing to market EVs developed from the ground up to address the needs of the Medium Duty vehicle industry. This broad, and to date poorly addressed, market segment includes class 4 to 7 commercial delivery vehicles, RVs and utility vehicles, among others. Leveraging a foundation of proprietary, in-house developed vehicle technologies, Harbinger's first-of-its-kind EV platform will bring enhancements in vehicle performance, durability and operator comfort. And importantly, Harbinger's vehicles will be priced for zero acquisition premium relative to traditional gas- and diesel-based competitors, removing one of the most tenacious barriers to EV adoption.<br/><br/>Harbinger's team, with operations in Southern California and Michigan, includes industry veterans with expertise in powertrain, battery, chassis and software development, along with leaders in advanced manufacturing, corporate development, operations and finance. Our team members come from leading innovators, both in and out of the automotive industry, including Tesla, Rivian, Canoo, Ford, Anduril, and SpaceX.<br/><br/>Founded in 2021, Harbinger is a venture-backed startup on a rapid growth trajectory, looking for candidates that thrive on tackling complex challenges and who share in our passion to bring clean transportation alternatives to a segment of the market starving for innovation.<br/><br/><strong>Job Overview<br/><br/></strong>As a Material Planner at Harbinger Motors, you will be integral to our manufacturing operations, ensuring efficient production scheduling through material planning and inventory management. Your role will be pivotal in maintaining seamless supply chain operations and meeting production targets with precision.<br/><br/><strong>What You’ll Do</strong> <br/><br/><ul><li>Production Scheduling and Coordination:</li><ul><li>Collaborate closely with production managers and schedulers to develop and optimize detailed production schedules aligned with customer demand and capacity constraints.</li><li>Monitor production progress and adjust schedules as needed to accommodate changes in demand or operational requirements.</li></ul><li>Inventory Management and Optimization:</li><ul><li>Maintain accurate inventory levels of raw materials, components, and finished goods to support uninterrupted production.</li><li>Utilize ERP and inventory management systems to track stock levels, analyze usage patterns, and forecast future material needs.</li><li>Implement strategies to minimize stock-outs, reduce excess inventory, and optimize inventory turnover.</li></ul><li>Supplier Relationship Management:</li><ul><li>Coordinate with suppliers to ensure timely delivery of materials, components, and sub-assemblies in accordance with production schedules.</li><li>Evaluate supplier performance based on metrics such as on-time delivery, quality standards, and cost-effectiveness.</li><li>Negotiate supplier agreements, terms, and pricing to achieve optimal procurement outcomes.</li></ul><li>Demand Planning and Forecasting:</li><ul><li>Analyze historical data, market trends, and sales forecasts to generate accurate demand forecasts.</li><li>Collaborate with sales, marketing, and production teams to validate forecasts and adjust plans as necessary.</li><li>Develop contingency plans to mitigate supply chain risks and ensure continuity of material supply.</li></ul><li>Continuous Improvement Initiatives:</li><ul><li>Identify opportunities to optimize production processes, reduce lead times, and enhance overall supply chain efficiency.</li><li>Implement lean manufacturing principles and best practices to drive continuous improvement in material planning and inventory management.</li><li>Lead or participate in cross-functional teams focused on process improvement projects.</li></ul><li>Cross-functional Collaboration:</li><ul><li>Foster strong relationships and effective communication with cross-functional teams including procurement, logistics, quality assurance, and engineering.</li><li>Provide timely updates on material availability, production status, and potential issues impacting schedules.</li><li>Collaborate on initiatives to resolve supply chain bottlenecks and improve operational performance.<br/></li></ul></ul><strong>Who You Are<br/><br/></strong><ul><li>Bachelor’s degree in Supply Chain Management, Operations Management, Business Administration, or a related field.</li><li>Proven experience in material planning, production scheduling, or supply chain management within the automotive or manufacturing industry.</li><li>Proficiency in ERP systems (e.g., SAP, Oracle) and advanced skills in Excel for data analysis and reporting.</li><li>Strong analytical abilities with a focus on problem-solving and decision-making in a fast-paced environment.</li><li>Excellent interpersonal and communication skills to effectively collaborate with internal teams and external suppliers.<br/><br/></li></ul>Rev up your career with our electrifying compensation and benefits package! At Harbinger Motors, we understand that your skills, experience, and expertise are as unique as our cutting-edge electric vehicles. That's why we tailor our offers to suit your individual profile, considering your years of experience, specialized knowledge, and market demands.<br/><br/>In addition to a competitive base salary, our perks charge ahead of the competition:<br/><br/><ul><li>100% Comprehensive Health Coverage: You and your loved ones are covered with top-tier medical, dental, and vision insurance.</li><li>Accelerate Your Wealth: As one of our first 100 employees, you'll have the opportunity to rev up your financial future with early-stage stock options.</li><li>Unleash Your Time: Take control of your work-life balance. Salaried teammates receive flexible PTO and the freedom to celebrate holidays and wellness days as you see fit.</li><li>Cruise into Vacations: Enjoy an exciting annual vacation stipend to help you recharge your batteries.</li><li>Fuel Your Day: Forget brown bag lunches; we've got you covered with paid lunches and dinners to keep you energized.<br/><br/></li></ul>These are just a few of our benefits and perks, as we're constantly adjusting and adding more benefits to best serve our teammates. At Harbinger Motors, we don't just offer jobs; we provide the fuel for your career journey. Join us in shaping the future of sustainable transportation, where your hard work and dedication are always rewarded.<br/><br/>Get ready to drive your career forward with us!<br/><br/>California Pay Range<br/><br/>$75,000—$110,000 USD<br/><br/><strong>Equal Opportunity<br/><br/></strong>Harbinger is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law.<br/><br/>Harbinger is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at info@harbingermotors.com.<br/><br/><strong>Candidate Data Privacy<br/><br/></strong>Harbinger may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Harbinger may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.<br/><br/>Harbinger may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our HR, legal, and finance teams, and the team(s) with the position(s) for which you are applying; (ii) Harbinger affiliates; and (iii) Harbinger’s service providers, including providers of background checks, staffing services, and cloud services.<br/><br/>Harbinger may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, the United Kingdom, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.<br/><br/>Please note that we are currently not accepting applications from third party application services. Any unsolicited resumes or candidate profiles submitted in response to our job posting shall be considered the property of Harbinger and are not subject to payment of referral or placement fees if any such candidate is later hired by Harbinger unless you have a signed written agreement in place with us which covers the applicable job posting.", "responsibilities": "As a Material Planner at Harbinger Motors, you will be integral to our manufacturing operations, ensuring efficient production scheduling through material planning and inventory management. Your role will be pivotal in maintaining seamless supply chain operations and meeting production targets with precision.<br/><br/><strong>What You’ll Do</strong> <br/><br/><ul><li>Production Scheduling and Coordination:</li><ul><li>Collaborate closely with production managers and schedulers to develop and optimize detailed production schedules aligned with customer demand and capacity constraints.</li><li>Monitor production progress and adjust schedules as needed to accommodate changes in demand or operational requirements.</li></ul><li>Inventory Management and Optimization:</li><ul><li>Maintain accurate inventory levels of raw materials, components, and finished goods to support uninterrupted production.</li><li>Utilize ERP and inventory management systems to track stock levels, analyze usage patterns, and forecast future material needs.</li><li>Implement strategies to minimize stock-outs, reduce excess inventory, and optimize inventory turnover.</li></ul><li>Supplier Relationship Management:</li><ul><li>Coordinate with suppliers to ensure timely delivery of materials, components, and sub-assemblies in accordance with production schedules.</li><li>Evaluate supplier performance based on metrics such as on-time delivery, quality standards, and cost-effectiveness.</li><li>Negotiate supplier agreements, terms, and pricing to achieve optimal procurement outcomes.</li></ul><li>Demand Planning and Forecasting:</li><ul><li>Analyze historical data, market trends, and sales forecasts to generate accurate demand forecasts.</li><li>Collaborate with sales, marketing, and production teams to validate forecasts and adjust plans as necessary.</li><li>Develop contingency plans to mitigate supply chain risks and ensure continuity of material supply.</li></ul><li>Continuous Improvement Initiatives:</li><ul><li>Identify opportunities to optimize production processes, reduce lead times, and enhance overall supply chain efficiency.</li><li>Implement lean manufacturing principles and best practices to drive continuous improvement in material planning and inventory management.</li><li>Lead or participate in cross-functional teams focused on process improvement projects.</li></ul><li>Cross-functional Collaboration:</li><ul><li>Foster strong relationships and effective communication with cross-functional teams including procurement, logistics, quality assurance, and engineering.</li><li>Provide timely updates on material availability, production status, and potential issues impacting schedules.</li><li>Collaborate on initiatives to resolve supply chain bottlenecks and improve operational performance.<br/></li></ul></ul>", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Operations Management, Business Administration, or a related field.\nProven experience in material planning, production scheduling, or supply chain management within the automotive or manufacturing industry.\nProficiency in ERP systems (e.g., SAP, Oracle) and advanced skills in Excel for data analysis and reporting.\nStrong analytical abilities with a focus on problem-solving and decision-making in a fast-paced environment.\nExcellent interpersonal and communication skills to effectively collaborate with internal teams and external suppliers.", "preferred": ""}, "skills": ["Supply Chain Management", "Operations Management", "Business Administration", "ERP", "SAP", "Oracle", "Excel", "Data Analysis", "Problem Solving", "Decision Making", "Interpersonal Skills", "Communication Skills"], "postedDate": "2 months ago", "benefits": "Rev up your career with our electrifying compensation and benefits package! At Harbinger Motors, we understand that your skills, experience, and expertise are as unique as our cutting-edge electric vehicles. That's why we tailor our offers to suit your individual profile, considering your years of experience, specialized knowledge, and market demands.<br/><br/>In addition to a competitive base salary, our perks charge ahead of the competition:<br/><br/><ul><li>100% Comprehensive Health Coverage: You and your loved ones are covered with top-tier medical, dental, and vision insurance.</li><li>Accelerate Your Wealth: As one of our first 100 employees, you'll have the opportunity to rev up your financial future with early-stage stock options.</li><li>Unleash Your Time: Take control of your work-life balance. Salaried teammates receive flexible PTO and the freedom to celebrate holidays and wellness days as you see fit.</li><li>Cruise into Vacations: Enjoy an exciting annual vacation stipend to help you recharge your batteries.</li><li>Fuel Your Day: Forget brown bag lunches; we've got you covered with paid lunches and dinners to keep you energized.<br/><br/></li></ul>These are just a few of our benefits and perks, as we're constantly adjusting and adding more benefits to best serve our teammates. At Harbinger Motors, we don't just offer jobs; we provide the fuel for your career journey. Join us in shaping the future of sustainable transportation, where your hard work and dedication are always rewarded.<br/><br/>Get ready to drive your career forward with us!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3953195233"}