{"jobTitle": "Material Handler (Early)", "company": {"name": "Apex - Spacecraft Manufacturing", "industry": "Defense and Space Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "Spacecraft represent the most pressing unmet need across the entire aerospace industry. As more launch vehicles come online and the cost to orbit decreases, more companies launching payloads to space continue to emerge. For the first time in history, this influx of payload companies combined with reduced launch costs has resulted in a massive increase in need for commercial spacecraft platforms, known as satellite buses. These buses hold the payloads of our customers and are flown on launch vehicles. Apex manufactures these satellite buses as scale using a combination of software, vertical integration, and hardware that is designed for manufacturing. Our spacecraft enable the future of society: ranging from earth observation to communications and more. We’d love for you to join us on our mission of providing humankind access to the galaxy beyond our planet. We are seeking a Material Handling Team Member to work closely within the Supply Chain and Production Control Team. The Supply Chain team is a key function in procuring & managing the production flow of goods and services to ensure manufacturing readiness. The Material Handler position is on site at the Apex Production facility. The main responsibilities are movement of goods throughout the facility, this includes raw materials, kitted parts, sub assembly, finished goods, and much more. This position also requires the ability to deliver & retrieve goods from local vendors. A valid drivers license is required.", "responsibilities": "Movement of materials throughout Apex production facility. Locating of product within inventory and movement to applicable location. Transact all material movements within the applicable systems. Visually inspect all product outgoing from inventory for physical damage prior to movement. Support of the production floor material movements. Use assistance to load, unload and store a variety of materials. This includes but is not limited to forklifts, pallet jacks, or high bay vehicles. Perform preventative maintenance to avoid major machine breakdowns. Keep equipment and surrounding areas clean. Perform other duties as assigned.", "qualifications": {"required": "U.S. Person status is required as this position needs to access export controlled data. 1-3 years of relevant experience in warehousing, shipping, receiving, or manufacturing. Ability to multitask. Customer service experience. A valid drivers license. Hours are from 8:00am to 5:00pm. Must be willing to work overtime as needed. Previously forklift qualified.", "preferred": "Not specified"}, "skills": ["Material handling", "Inventory management", "Forklift operation", "Customer service"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Apex believes in creating a work environment that you look forward to embracing every day. Our employees love working at Apex, and we want you to love it too. We offer the following benefits: Shared upside: receive equity in Apex, letting you benefit from the work you create. Best-in-class healthcare, dental, vision, and life insurance plans. The primary's premium is 99%+ covered. Enjoy our comprehensive PTO package, fostering employee well-being. Competitive 401(k) plan and matching. Paternity/maternity leave. Daily lunch, unlimited snacks, and regular office BBQs! Your dream desk setup, tools, and whatever else you need to be your most productive self. A world class office located in Culver City, filled with amazing coworkers and social gatherings for you and your family.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3954267040"}