{"jobTitle": "Warehouse Associate - Ontario, CA", "company": {"name": "WEG Electric Corp. (USA)", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$21.00/hour", "currency": "USD"}, "jobFunction": "Strategy/Planning and Information Technology", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "WEG Electric Corp. has a great opportunity for a Warehouse Associate to join our team in Ontario, CA. This role receives, stores, picks, packs, and distributes material, tools, equipment, and products within the warehouse.<br/><br/><strong>STARTING RATE: $21.00/hour<br/><br/></strong><strong>Primary Responsibilities<br/><br/></strong><ul><li>Convey materials and items from receiving or production areas to storage or to other designated areas.</li><li>Sort and place items on racks, shelves, or in bins, according to predetermined sequence such as size, type, style, color, or product code.</li><li>Fill requisitions, work orders, or requests for materials, tools, or other stock items.</li><li>Assemble customer orders from stock and places orders on pallets or shelves, or conveys orders to packing station or shipping.</li><li>Mark materials with identifying information.</li><li>Open bales, crates, and other containers.</li><li>Record amounts of materials or items received or distributed.</li><li>Operate forklift to transport stored items from shelves to package area for shipment.</li><li>Frequently lift/carry up to 50 lbs. and push up to 25 lbs.</li><li>Other duties and tasks as assigned.<br/><br/></li></ul><strong>Education<br/><br/></strong><ul><li>No education required. HS diploma or GED preferred.<br/><br/></li></ul><strong>Knowledge / Training<br/><br/></strong><ul><li>Demonstrated proficiency operating a sit-down/stand-up forklift and the ability to become certified.</li><li>Knowledge of order picking, receiving product, understanding how to piece orders together, and outbound product loading/unloading.</li><li>Product on racking and bulk storage and cycle counting.</li><li>General warehouse safety is strongly desired.</li><li>Ability to use common hand tools.<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>No experience required. 6 - 12 months of related experience is preferred.<br/><br/></li></ul><strong>About WEG Electric Corp.<br/><br/></strong>WEG is the largest industrial electric motor manufacturer in the Americas and one of the largest manufacturers of electric motors in the world producing more than 21 million units annually. Founded in 1961, WEG operates mainly in the sector of capital goods, having five main businesses: Motors, Energy, Automation, Coatings Transmission &amp; Distribution, providing global solutions for electric motors, variable frequency drives, soft starters, controls, panels, transformers, and generators. The US corporate office is located in Duluth, GA with manufacturing units in Minnesota, Indiana and Missouri with over 30 thousand employees worldwide. Visit our website to learn more: www.weg.net<br/><br/>We offer a pleasant work environment, competitive compensation and full benefits package. To Apply: All candidates must submit an updated resume and complete our application in order to be considered for this position. Must be authorized to work in the United States. WEG does not offer visa sponsorship for this role.<br/><br/><em>We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.</em>", "responsibilities": "This role receives, stores, picks, packs, and distributes material, tools, equipment, and products within the warehouse.", "qualifications": {"required": "Demonstrated proficiency operating a sit-down/stand-up forklift and the ability to become certified.", "preferred": "HS diploma or GED, 6 - 12 months of related experience"}, "skills": ["Forklift Operation", "Order Picking", "Receiving", "Shipping", "Warehouse Safety"], "postedDate": "2 months ago", "benefits": "We offer a pleasant work environment, competitive compensation and full benefits package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3954850813"}