{"jobTitle": "Top-Tier Executive Assistant", "company": {"name": "Ketosource Limited", "location": "San Marino, CA"}, "location": "San Marino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Administrative", "industry": "Wellness and Fitness Services, Technology, Information and Internet, and Education Administration Programs", "description": "Founded in 2015, Ketosource Limited has grown to become the #1 European nutraceutical and health optimisation company in the Ketogenic & Fasting space.<br/><br/>Our success has been founded on raising the standard in three areas:<br/><br/><ul><li>Scientific Foundation: Our team comprises scientists and we undertake research to back our solutions with evidence and data.</li><li>Quality Standards: We’re raising the standard of nutrition products to pharma-like standards. Through formulation to production we work to the highest active ingredient purity and lowest contaminant levels. </li><li>Lifestyle Integration: Health is a human challenge. We acknowledge this and work with people to understand their obstacles and integrate solutions that work with their lifestyle for the long term.<br/><br/></li></ul><strong>Our Solutions Combine The Following<br/><br/></strong><ul><li>Health products: We develop and distribute a range of premium keto and fasting nutrition products. </li><li>Digital services: We leverage technology to best support our customers’ journey to results. These include online courses, knowledge databases (video, text), AI and algorithms, and coaching services.</li><li>Strategic partner solutions: We work closely with other unique companies with the best solutions that complement our own.<br/><br/></li></ul>We are a small team focused on making a meaningful impact on the health of humanity. Our mission is to build health solutions that help humanity live longer and better quality lives. We are driven by ambitious goals, fast execution, and a strong sense of urgency. Join us if you want to shape the next generation of health optimisation companies.<br/><br/><strong>The Role<br/><br/></strong><strong>Engagement Management<br/><br/></strong><ul><li>Managing the founder’s email inbox. Including screening spam and categorising action items to bring them to attention, and drafting appropriate responses.</li><li>This daily aspect of your role supports momentum by ensuring responsive communication and that messages don’t get dropped or left by the way-side, or slow down activities of the company.</li><li>Maintenance of a contact management system.<br/><br/></li></ul><strong>Audits and Reviews<br/><br/></strong><ul><li>As the founder’s right-hand you will audit, review and check activities throughout the company. This will require you to understand the standards for each area - you’re supported by checklists and standards guidelines.</li><li>Attention to detail and diligence is critical in this role, to reduce the oversight and time needed by the founder in many activities.<br/><br/></li></ul><strong>Monitoring & Reporting<br/><br/></strong><ul><li>You will track the progress and status of different tasks, issues, activities and people.</li><li>As relevant you will report on these, and also follow up and check on status.<br/><br/></li></ul><strong>Research<br/><br/></strong><ul><li>Part of your day to day will be research on new topics, companies or contacts to provide background to new decisions or to prepare for meetings.</li><li>One important part will be identification and research on the credibility and experience of the top experts in fields we are interested in.<br/><br/></li></ul><strong>Project Management<br/><br/></strong><ul><li>Coordination and Oversight: Manage and coordinate cross-functional projects to ensure alignment with organizational goals. This includes overseeing project timelines, ensuring deadlines are met, and highlighting issues to the CEO.</li><li>Communication and Reporting: Act as a liaison between the CEO and various partners, facilitating clear and efficient communication. Prepare regular progress reports for review, ensuring CEO is informed.<br/><br/></li></ul><strong>Ad Hoc Project and Sprint Activity<br/><br/></strong><ul><li>Beyond these activities there will be adhoc project involvement based on your strengths.<br/><br/></li></ul><strong>Routine Admin Tasks<br/><br/></strong><ul><li>Carrying out a wide variety of daily and weekly tasks to support various parts of the company including accounting, operations, marketing and research.<br/><br/></li></ul><strong>Content & Publishing<br/><br/></strong><ul><li>Creating and transforming content based on specific workflows and knowledge sources.</li><li>Checking and publishing content in our publishing systems e.g. email, social media, blogs, website.<br/><br/></li></ul><strong>Routine Personal Admin Tasks<br/><br/></strong><ul><li>Support for personal research and tasks for the CEO.<br/><br/></li></ul><strong>Ideal Profile<br/><br/></strong><strong>An Education Background In The Following Will Be Advantageous<br/><br/></strong><ul><li>Bachelor’s degree or higher in a STEM field (e.g., Computer Science, Engineering, Mathematics, Physics, Chemistry, Biology) from an accredited institution.<br/><br/></li></ul>For this role we are looking for exceptional strengths in:<br/><br/><strong>Written Communication<br/><br/></strong><ul><li>This includes emails, and general writing for content.</li><li>Formatting and visuals - you should also have any eye for presentation to be able to check and ensure the quality of visual content.<br/><br/></li></ul><strong>Language Abilities<br/><br/></strong><ul><li>First: Your English must be flawless as this will be the main working language.</li><li>Second: It will be very advantageous if you have a working level of Spanish. </li><li>Third: Other advantageous languages include German, Italian, and French.<br/><br/></li></ul><strong>Standards and Attention to Detail<br/><br/></strong><ul><li>You should have exceptionally high standards for your work and that of others and the attention to detail to be able to spot areas to improve.</li><li>Ability to assess standards: When given a set of criteria you should be able to clearly assess standards based on these criteria.<br/><br/></li></ul><strong>Research<br/><br/></strong><ul><li>You should be a smart researcher who knows how to find things quickly and understands information quality. If you always just rely on ‘googling’ this is not sufficient. We’re looking for someone who knows how to research effectively.<br/><br/></li></ul><strong>Tech<br/><br/></strong><ul><li>You should be very comfortable with tech - we are a company that leverages the best tech/ and latest systems - so understanding and using these is part of virtually all your activity.</li><li>Specifically you should understand and be very comfortable with:</li><li>Notion (Kanban Boards, Tables, Pages)</li><li>Google Workspace (Gmail, Google Calendar, Google Sheets)</li><li>ChatGPT (AI prompts and use)<br/><br/></li></ul><strong>Self-Organization<br/><br/></strong><ul><li>You should have excellent proactive self-organisation and know how to manage and prioritise a task list</li><li>This translates to never missing or dropping tasks, meeting deadlines or communicating early when deadlines may need to change.<br/><br/></li></ul><strong>Self-Learner & Resourcefulness<br/><br/></strong><ul><li>You are a keen and enthusiastic and self-driven learner. You are constantly learning, love the journey and progress you make from this.</li><li>You are a self-starter and proactive and able to take initiative to overcome obstacles you come across in your tasks.<br/><br/></li></ul><strong>What's on Offer?<br/><br/></strong><ul><li>DESIGNED FOR MEANINGFUL IMPACT ON PEOPLE’S HEALTH: We hold ourselves accountable to results and are innovating on health optimisation solutions.</li><li>PERSONAL GROWTH FOCUSED ENVIRONMENT: In today's world if you're not growing, you're falling behind. We put both personal and professional growth as a top priority.</li><li>MEANINGFUL RELATIONSHIPS: From team mates, to clients to our partners we were founded with the idea that meaningful relationships are scarcer today than they should be.</li><li>LIFESTYLE FLEXIBILITY: Location and time flexibility to make the most of how you work, and take care of your personal life and goals.</li></ul>", "postedDate": "2 months ago", "skills": ["Notion", "Google Workspace", "ChatGPT", "Research", "Communication", "English", "Spanish", "German", "Italian", "French", "Tech", "Self-Organization", "Self-Learner", "Resourcefulness"], "url": "https://www.linkedin.com/jobs/view/3954211619"}