{"jobTitle": "Certified Coder I (Remote: CO, NV, PA, UT, WA, TX, OK or MO)", "company": {"name": "PIH Health", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "The Certified Coder I is responsible for all group practice coding activities, including encounter review, missing charge reconciliation, RCx Rules review and reconciliation, and communication with the providers and office staff for outstanding issues and education.<br/><br/>PIH Health is a nonprofit, regional healthcare network that serves approximately 3 million residents in the Los Angeles County, Orange County and San Gabriel Valley region. The fully integrated network is comprised of PIH Health Downey Hospital, PIH Health Good Samaritan Hospital, PIH Health Whittier Hospital, 37 outpatient medical office buildings, a multispecialty medical (physician) group, home healthcare services and hospice care, as well as heart, cancer, digestive health, orthopedics, women’s health, urgent care and emergency services. The organization is nationally recognized for excellence in patient care and patient experience, and the College of Healthcare Information Management Executives (CHIME) has identified PIH Health as one of the nation’s top hospital systems for best practices, cutting-edge advancements, quality of care and healthcare technology. For more information, visit PIHHealth.org or follow us on Facebook, Twitter, or Instagram.<br/><br/><strong>Required Skills<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li>Must possess strong interpersonal communication skills.</li><li>Have excellent verbal and written communication, problem-solving and decision-making skills.</li><li>Demonstrate complete technical knowledge of ICD10 CM coding as well and CPT and HCPCS procedural coding.</li><li>Must have thorough knowledge of anatomy and physiology and medical terminology.</li><li>Must be proficient with coding guidelines and pro fee coding/billing requirements.</li><li>Work remotely</li><li>Internet connectivity from home location with minimum data speed of 100 Mbps down / 10 Mbps up</li><li>Familiarity with computers and encoding software and the general principle of Health Information Management/Medical Records is preferred.<br/><br/><br/></li></ul><strong>Required Experience<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li>Current Certified Coding Specialist (CCS) or Certified Professional Coder (CPC), or 5 years relevant experience and actively pursuing a CCS or CPC and be certified within 6 months of the hire date is required.</li><li>Maintain Certification with annual CE units required. </li><li>The individual must reside in one of the following states: Colorado, Missouri, Nevada, Oklahoma, Pennsylvania, Texas, Utah or Washington State<br/><br/><br/></li></ul><strong>Preferred:<br/><br/></strong><ul><li>Two years coding experience in a pro fee setting is preferred.</li><li>An Associate of Science or Bachelor of Science degree in Health Information from an approved AHIMA program is preferred. <br/><br/><br/></li></ul><strong>Address<br/><br/></strong>12401 Washington Blvd.<br/><br/><strong>Salary<br/><br/></strong>21.60-32.40<br/><br/><strong>Shift<br/><br/></strong>Days<br/><br/><strong>FLSA Status<br/><br/></strong>Non-Exempt<br/><br/><strong>Zip Code<br/><br/></strong>90602", "responsibilities": "The Certified Coder I is responsible for all group practice coding activities, including encounter review, missing charge reconciliation, RCx Rules review and reconciliation, and communication with the providers and office staff for outstanding issues and education.", "qualifications": {"required": "Must possess strong interpersonal communication skills. Have excellent verbal and written communication, problem-solving and decision-making skills. Demonstrate complete technical knowledge of ICD10 CM coding as well and CPT and HCPCS procedural coding. Must have thorough knowledge of anatomy and physiology and medical terminology. Must be proficient with coding guidelines and pro fee coding/billing requirements. Work remotely Internet connectivity from home location with minimum data speed of 100 Mbps down / 10 Mbps up Familiarity with computers and encoding software and the general principle of Health Information Management/Medical Records is preferred. Current Certified Coding Specialist (CCS) or Certified Professional Coder (CPC), or 5 years relevant experience and actively pursuing a CCS or CPC and be certified within 6 months of the hire date is required. Maintain Certification with annual CE units required. The individual must reside in one of the following states: Colorado, Missouri, Nevada, Oklahoma, Pennsylvania, Texas, Utah or Washington State", "preferred": "Two years coding experience in a pro fee setting is preferred. An Associate of Science or Bachelor of Science degree in Health Information from an approved AHIMA program is preferred."}, "skills": ["Interpersonal Communication", "Communication", "Problem Solving", "Decision Making", "ICD10 CM Coding", "CPT Coding", "HCPCS Coding", "Anatomy and Physiology", "Medical Terminology", "Coding Guidelines", "Pro Fee Coding", "Billing Requirements", "Remote Work", "Internet Connectivity", "Computers", "Encoding Software", "Health Information Management", "Medical Records", "Certified Coding Specialist (CCS)", "Certified Professional Coder (CPC)"], "postedDate": "2 months ago", "salary": {"amount": "21.60-32.40", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3954179832"}