{"jobTitle": "Founding Attorney", "company": {"name": "Amicus", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Technology, Information and Internet", "description": "What You'll Do:<br/><br/><ul><li>Drafting and preparing pleadings and other work products</li><li>Working with our proprietary software online portal to review generative AI outputs and work product drafts</li><li>Helping craft drafting, review, and editing processes for pleadings and other work products</li><li>Editing and reviewing draft work products</li><li>Testing out the latest versions of generative AI platforms for drafting and preparing pleadings and other work products<br/><br/></li></ul><strong>What You’ll Need:<br/><br/></strong><ul><li>Bachelor’s or higher degree</li><li>Juris Doctor (JD) degree from an accredited law school</li><li>Admission to CA bar and in good standing</li><li>Additional bar admissions including NY, FL, NV, etc. are a bonus</li><li>At least 5-10 years of experience in CA civil litigation, preferably with experience in both plaintiff-side employment and personal injury practice</li><li>Extensive experience with drafting and preparing pleadings, motions, and other legal documents, discovery in the civil litigation context, oral advocacy and appearing in Court, motion practice, and taking/defending depositions</li><li>Strong background in various types of employment cases including: discrimination, wrongful termination, wage and hour, retaliation, PAGA, breach of contract, and sexual harassment litigation</li><li>Strong background in various types of personal injury cases including: auto, slip &amp; fall, motorcycle, wrongful death, medical malpractice, premises liability, product liability, insurance disputes, TBI, and catastrophic injury</li><ul><li>Exposure to medical defects, mass torts, etc. is a bonus</li></ul><li>Arbitration and trial experience strongly preferred</li><li>Litigation experience in state and federal court</li><li>Exceptional interpersonal and communication skills, with the ability to build strong relationships with clients and team members. </li><li>Strong work ethic, professionalism and positive attitude</li><li>Attention to detail and strong analytical skills</li><li>Exposure to generative AI tools and platforms, preferably experience using these tools for drafting, proofreading, legal research, etc. (knowledge of foundation models is a bonus)</li><li>Experience with case management software and e-discovery platforms highly preferred (Clio, Filevine, Smokeball, Relativity, Disco, Everlaw, etc.)<br/><br/></li></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3954747534"}