{"jobTitle": "Assistant, Buying and Merchandising", "company": {"name": "REVOLVE", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "Buying &amp; Merchandising Assistant<br/><br/><strong>Meet The Owned Brand Division Of REVOLVE<br/><br/></strong><em>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand and a go-to source for discovery and inspiration, REVOLVE delivers an engaging customer experience from a vast yet curated offering of over 45,000 products. Founded in Los Angeles in 2003 by co-CEOs, Michael Mente and Mike Karanikolas, REVOLVE’s family of brands includes their luxury offering, FWRD and a portfolio of 24 owned brands such as Lovers + Friends, Tularosa, NBD and RAYE.<br/><br/></em><em>The Owned Brand division within REVOLVE is an industry-leading fashion design and production house based in Los Angeles. Leveraging the power of REVOLVE’s data driven merchandising, combined with raw creative talent, results in an unparalleled ability to identify specific market niches and develop brands that each have their own identity, designed with a distinct consumer interest and personality in mind.<br/><br/></em>At REVOLVE the most successful team members have the thirst and creativity to redefine fashion retail for the 21st century, making REVOLVE the leading online retail destination targeted towards Millennial and Generation Z consumers seeking premium fashion. With a team of 1,000 strong, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment.<br/><br/>Some of the sweetest perks we offer aren’t in a typical benefit package like hefty discounts on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.<br/><br/>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or .<br/><br/>Are you ready to set the standard for Premium apparel<br/><br/><strong>Main Purpose Of The Buying &amp; Merchandising Assistant Role<br/><br/></strong>This is a full time role for a candidate who is driven by the buying and merchandising aspect of the apparel process. This position will assist the Buyers with day to day buying tasks. The person in this role will bring with the drive and passion for following trends and understanding analytics. This position requires an out of the box thinker with exceptional organizational skills that will thrive in a fast-paced environment.<br/><br/><strong>Major Responsibilities<br/><br/></strong>Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li>Support buyers during sketch reviews</li><li>Lead on outreach and order creation for Re-Orders and Re-Cuts</li><li>Email correspondences in a timely and communicative manner</li><li>Assist buyers with day to day administrative tasks include but not limited to re-shoot requests, RAs, etc.</li><li>Support byers with style reporting, troubleshooting/investigation and buy meeting prep</li><li>Lead and past cancel reporting</li><li>Lead on any special projects within the department</li><li>Build strong relationships with buyers, sales analysts, product developers and designers <br/><br/></li></ul><strong>Required Competencies<br/><br/></strong>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/><ul><li>High level of attention to detail</li><li>Ability to multi-task while staying organized while under tight deadlines</li><li>High sense of urgency, punctuality and timeliness</li><li>Flexible personality willing to take direction and change as business needs change/grow</li><li>Must have a strong work ethic and motivation to learn</li><li>Works well individually, as well as, with a team</li><li>Must be able and willing to lift and carry up to 10 lbs., perform frequent repetitive finger, hand and wrist motions, as well as, bending, stooping, reaching, squatting, kneeling, pushing, and pulling</li><li>Must be able to sit for extended periods of time <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Degree in Fashion, Merchandising, Merchandising Management or similar field</li><li>1+ year work experience in assistant/admin level position within Buying or Merchandising department or similar field</li><li>Proficient in Gmail, Excel, Word and online navigation</li><li>Understanding of garment bodies and fashion trends<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Quick and accurate typing skills or experience with data entry<br/><br/></li></ul>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day.<br/><br/>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.<br/><br/>A reasonable estimate of the current base hourly/salary range is $21.00- $23.00/hr.<br/><br/><strong>Attention<br/><br/></strong>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.", "responsibilities": "Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li>Support buyers during sketch reviews</li><li>Lead on outreach and order creation for Re-Orders and Re-Cuts</li><li>Email correspondences in a timely and communicative manner</li><li>Assist buyers with day to day administrative tasks include but not limited to re-shoot requests, RAs, etc.</li><li>Support byers with style reporting, troubleshooting/investigation and buy meeting prep</li><li>Lead and past cancel reporting</li><li>Lead on any special projects within the department</li><li>Build strong relationships with buyers, sales analysts, product developers and designers <br/><br/></li></ul>", "qualifications": {"required": "High level of attention to detail, Ability to multi-task while staying organized while under tight deadlines, High sense of urgency, punctuality and timeliness, Flexible personality willing to take direction and change as business needs change/grow, Must have a strong work ethic and motivation to learn, Works well individually, as well as, with a team, Must be able and willing to lift and carry up to 10 lbs., perform frequent repetitive finger, hand and wrist motions, as well as, bending, stooping, reaching, squatting, kneeling, pushing, and pulling, Must be able to sit for extended periods of time, Degree in Fashion, Merchandising, Merchandising Management or similar field, 1+ year work experience in assistant/admin level position within Buying or Merchandising department or similar field, Proficient in Gmail, Excel, Word and online navigation, Understanding of garment bodies and fashion trends", "preferred": "Quick and accurate typing skills or experience with data entry"}, "skills": ["Gmail", "Excel", "Word", "Fashion", "Merchandising"], "postedDate": "2 months ago", "benefits": "hefty discounts on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.", "url": "https://www.linkedin.com/jobs/view/3954437446"}