{"jobTitle": "Senior Data Science Manager", "company": {"name": "Coinbase", "industry": "Technology, Information and Internet", "size": "1001-5000 employees", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$236,725.00 - $278,500.00", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet", "description": "At Coinbase, our mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web3 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.\n\nThere are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.\n\nWho You Are\n\nYou’ve got positive energy. You’re optimistic about the future and determined to get there. \nYou’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0. \nYou appreciate direct communication. You’re both an active communicator and an eager listener - because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.\nYou can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.\nYou have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.\nYou want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone.\n\nData Science is an integral component of Coinbase’s product and decision making process: we work in partnership with Product, Engineering and Design to influence the roadmap and better understand our users. With a deep expertise in experimentation, analytics and advanced modeling, we produce insights and drive decisions which directly move the company’s bottom line.\n\nWe’re looking for an experienced manager to lead the Wallet data science team, a fast growing area of the business that’s not only working on some of the most cutting edge web3 applications, but which is also critical to Coinbase’s mission of bringing one billion people onchain. They’ll work with their team to devise strategies to help grow the product, support a culture of experimentation, and hold a high bar for rigorous and analytical decision making.", "responsibilities": "Manage, mentor and grow a team of data scientists and build solid working partnerships with product teams; Act as a strategic thought partner to product teams and Coinbase executives; lead the team to execute on data-based analyses to help prioritize product opportunities and provide actionable recommendations; Standardize best practices for analysis, modeling and experimentation; develop scalable processes to help the team solve pain points and meet goals; Design communication structure and cadence with team members; synthesize data learnings into compelling stories and communicate them throughout Coinbase; Act as the business metrics owner for performance management; Drive data team and organizational level initiatives to scale our insights through better systems and automation.", "qualifications": {"required": "BA / BS degree business, computer science, statistics, applied mathematics, or any scientific or computational degree; 5+ years of experience as a hands-on leader of a high-performing data science/analytics team; 10+ years of experience providing business insights and driving data science initiatives; Experience in both internal and external storytelling and executive presentations; Experience overseeing large, complex and cross-functional initiatives; Expertise with analytics tools, data visualization, SQL, R, or Python as applied to data science and analytics; Deep knowledge of data models and experimental design and execution; Excellent ability to communicate complicated and nuanced insights in accessible language to relevant stakeholders; Demonstrate our core cultural values: clear communication, positive energy, continuous learning, and efficient execution; Self-driven and able to create plans for analytics projects and build collaboration within the team.", "preferred": "Masters or PhD in computer science, statistics, applied mathematics, or any scientific or computational degree; Experience building causal inference models and overseeing synthetic experimentation; Domain experience in Fintech product and growth areas; Experience manipulating large amounts of structured and unstructured data."}, "skills": ["Data Science", "Analytics", "Leadership", "Communication", "Problem Solving", "Collaboration"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).", "remoteWork": "Remote-first company.", "url": "https://www.linkedin.com/jobs/view/3954466527"}