{"jobTitle": "Accounts Payable Clerk", "company": {"name": "Trispoke Managed Services Pvt. Ltd.", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Outsourcing and Offshoring Consulting", "description": "Accounts Payable Clerk – Anaheim, CA<br/><br/>Pay - $25.00/hr on W2!<br/><br/><strong>8 AM to 6 PM<br/><br/>US Citizens required.<br/><br/>3 - Months Contract with potential to extension.<br/><br/></strong>Please send me a word copy of your resume and your contact information if you are interested in below mentioned opportunity.<br/><br/><strong>Job Description<br/><br/></strong>The Accounts Payable Clerk, reporting to Manager Disbursements, is responsible for daily matching and coding of invoices of assigned vendors. Data entry is required by the job. Communications with vendors, purchasing staff, warehouse receiving and inspection, and others as needed. Filing of paid as well as unpaid invoices when applicable for assigned vendors.<br/><br/><strong>Major Functions<br/><br/></strong><ul><li> Match and code invoices to packing slips and purchase orders</li><li> Input coded invoices into computer system</li><li> Communicate with vendors, buyers, Receiving and Inspection, and others as needed to get invoices paid timely</li><li> File and pull documents as needed</li><li> Answer phones, emails, and Teams communications timely</li><li> Perform other duties as assigned by Management<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Technical/Functional skills:<br/><br/>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li> Basic computer skills.<br/><br/></li></ul><strong>Language Skills<br/><br/></strong>Ability to read and comprehend simple instructions, short correspondence, and memos. Ability to write simple correspondence. Ability to effectively present information in one-on-one and small group situations to customers, clients, and other employees of the organization.<br/><br/><strong>Mathematical Skills<br/><br/></strong>Ability to calculate figures and amounts.<br/><br/><strong>PHYSICAL DEMANDS<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is frequently required to walk; sit; use hands to finger, handle, or feel; reach with hands and arms; and talk or hear. The employee is occasionally required to stand. The employee must frequently lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.<br/><br/><strong>WORK ENVIRONMENT<br/><br/></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>The noise level in the work environment is usually quiet.<br/><br/><strong>Education/Experience/Licenses Etc.<br/><br/></strong>AA degree or High School Diploma with experience equivalent to 3-4 years in Accounts Payables.<br/><br/><strong>Highly Preferred<br/><br/></strong>Experience in manufacturing / Aerospace industry working with Supply Chain and warehouse.<br/><br/>Knowledge of Outlook and Excel required.<br/><br/>SOX and GAAP audit familiarity a plus.<br/><br/>Ariba and Concur experience a plus.<br/><br/><strong>For more jobs</strong> : https://www.linkedin.com/company/trispoke-managed-services-pvt-ltd/jobs<br/><br/>#nowhiring #hiring #jobsearch #jobopening #careers #jobhunt #employment #jobposting #HR #work #staffing #jobopenings #jobseekers #jobfair #jobalert #jobhunter #jobapplication #explorepage", "postedDate": "2 months ago", "qualifications": {"required": "Basic computer skills.", "preferred": "Experience in manufacturing / Aerospace industry working with Supply Chain and warehouse.<br/><br/>Knowledge of Outlook and Excel required.<br/><br/>SOX and GAAP audit familiarity a plus.<br/><br/>Ariba and Concur experience a plus."}, "skills": ["Computer Skills", "Outlook", "Excel", "SOX", "GAAP", "Ariba", "Concur"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955694927"}