{"jobTitle": "Legal & Business Affairs Executive", "company": {"name": "WME | William Morris Endeavor", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "127,500.00/yr - 170,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Entertainment Providers", "description": "<strong>Who We Are<br/><br/></strong>Endeavor is a global sports and entertainment company, home to many of the world’s most dynamic and engaging storytellers, brands, live events, and experiences. The Endeavor network specializes in talent representation through entertainment agency WME; sports operations and advisory, event management, media production and distribution, and brand licensing through IMG; live event experiences and hospitality through On Location; full-service marketing through global cultural marketing agency 160over90; and sports data and technology through IMG ARENA and OpenBet. Endeavor is also the majority owner of TKO Group Holdings (NYSE: TKO), a premium sports and entertainment company comprising UFC and WWE.<br/><br/>WME seeks a talented and highly motivated lawyer to join its growing legal and business affairs team, primarily supporting its sports marketing agents.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Negotiating and managing a high volume of short-form and long-form contracts, including endorsement, appearance, license and other image-rights and personal-services agreements, primarily for athlete clients and always under tight deadlines </li><li>Acting as an entrepreneurial business partner by providing actionable guidance to agents, contributing to agent training, and working collaboratively and inclusively across departments to drive progress </li><li>Advising internally on business and legal issues, including questions of contract interpretation, dispute resolution and compliance matters </li><li>Implementing and refining systems for tracking and sharing information, and for driving innovation </li><li>Fostering positive long-term relationships with the agency’s clients and customers <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Admitted attorney (NY or CA) with 4-10 years of transactional legal/business affairs experience, ideally with at least 2 at a firm </li><li>Experience with endorsement and/or licensing contracts </li><li>Outstanding drafting, negotiation, analytical and organizational skills </li><li>Excellent interpersonal and communication skills, including the ability to interact with a range of personalities and styles in a dynamic, fast-paced environment </li><li>Demonstrated passion for your chosen field, and a genuine commitment to workplace equity </li><li>Sound judgment, a curious mind, a strong work ethic, and a creative approach to problem solving </li><li>Grit, tenacity and flexibility <br/><br/></li></ul>Endeavor unites and brings people together in our love of sport, culture, and entertainment. We understand this can only be accomplished when we lead with a lens of diversity, equity, and inclusion in everything we do. As a global company that drives culture, we strive to reflect the world’s diverse voices.  <br/><br/>Endeavor is an equal opportunities employer and encourages applications from suitably qualified and eligible candidates regardless of sex, race, disability, age, sexual orientation, or religion or belief.<br/><br/><em>Per local requirements and in the interest of transparency, the range shown below reflects the prevalent current hiring range for this position. Hiring pay rates are based on a number of factors, including location and may vary depending on job-related qualifications, knowledge, skills and experience. Endeavor strives to provide locally competitive rewards packages, which include base rate along with, as applicable, short- and long-term incentives, growth and developmental opportunities, and robust benefits, such as health care, retirement, vacation and other paid time off, and additional offerings.<br/><br/></em><strong>Hiring Range Minimum<br/><br/></strong>$127,500 annually<br/><br/><strong>Hiring Range Maximum<br/><br/></strong>$170,000 annually", "responsibilities": "Negotiating and managing a high volume of short-form and long-form contracts, including endorsement, appearance, license and other image-rights and personal-services agreements, primarily for athlete clients and always under tight deadlines Acting as an entrepreneurial business partner by providing actionable guidance to agents, contributing to agent training, and working collaboratively and inclusively across departments to drive progress Advising internally on business and legal issues, including questions of contract interpretation, dispute resolution and compliance matters Implementing and refining systems for tracking and sharing information, and for driving innovation Fostering positive long-term relationships with the agency’s clients and customers", "qualifications": {"required": "Admitted attorney (NY or CA) with 4-10 years of transactional legal/business affairs experience, ideally with at least 2 at a firm Experience with endorsement and/or licensing contracts Outstanding drafting, negotiation, analytical and organizational skills Excellent interpersonal and communication skills, including the ability to interact with a range of personalities and styles in a dynamic, fast-paced environment Demonstrated passion for your chosen field, and a genuine commitment to workplace equity Sound judgment, a curious mind, a strong work ethic, and a creative approach to problem solving Grit, tenacity and flexibility"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Endeavor strives to provide locally competitive rewards packages, which include base rate along with, as applicable, short- and long-term incentives, growth and developmental opportunities, and robust benefits, such as health care, retirement, vacation and other paid time off, and additional offerings.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3955565902"}