{"jobTitle": "Shuttle Manager On Duty", "company": {"name": "ABM Industries", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Facilities Services", "description": "<strong>Job Description<br/><br/></strong><strong>Pay:</strong> $66,560.00 per year.<br/><br/>The pay listed is the salary range for this position. Any specific offer will vary based on the successful applicant’s education, experience, skills, abilities, geographic location, and alignment with market data.<br/><br/>You may be eligible to participate in a Company incentive or bonus program.<br/><br/><strong>Benefit Information:<br/><br/></strong>ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit ABM 2024 Employee Benefits | Staff &amp; Management<br/><br/><strong>Position Responsibilities<br/><br/><br/></strong><ul><li>Preparation of weekly schedule for CSRs and Facility Coordinators; monitoring of all parking shuttle operations and revenue activities on the event log.</li><li>Will manage a team of 30 - 45 shuttle drivers on various shifts.</li><li> Managing the master change fund to meet the change bank needs unique to the volume of each operating cashier shift.</li><li> Daily drop of all cashier deposits and transfer to Auditing Clerk.</li><li> Filling out fund and drop accountability forms and other reports daily.</li><li> Entering Cashiers’ TOD amounts into the Parking RDMS.</li><li> Transfer of all cashier tickets and related paperwork to audit department daily.</li><li> Handling of guest problems at the exit, including fee adjustments per policy.</li><li> Maintenance of accurate space count throughout the shift.</li><li> Monitoring of CSRs and Facility Coordinators for uniform compliance.</li><li> Management of the shift according to the policy and procedures outlined in the parking operations manual.</li><li> Collecting and updating of License Plate Inventory and recording gate readings nightly.</li><li> Logging and dispatching all police tow requests.</li><li> Collecting fees and recording all impound releases.</li><li> Overseeing the towing and impoundment operation, including research, notification of owners, titling, and sale of abandoned vehicles.</li><li> Monitor the PARCS equipment for error messages and malfunctions.</li><li> Answer calls from CSRs regarding equipment issues.</li><li> Search LPI for vehicles as required.</li><li> Send all trouble tickets regarding any PARCS equipment to HUB in a timely manner.</li><li> Track the opening and closing of all garages.</li><li> Answer intercom calls from guests and employees.</li><li> Manually control gates, as necessary.</li><li>Performs other duties as assigned or requested.<br/><br/><br/></li></ul><strong>Knowledge, Skills &amp; Abilities<br/><br/><br/></strong><ul><li>One to three years of management or supervisory experience.</li><li>Proven knowledge of shuttle and transportation operations.</li><li>Good communication skills both written and verbal.</li><li>Proven knowledge of MS Office including word, excel, outlook and powerpoint.<br/><br/><br/></li></ul><strong>About Us<br/><br/></strong>ABM (NYSE: ABM) is one of the world’s largest providers of facility services and solutions. A driving force for a cleaner, healthier, and more sustainable world, ABM provides essential services and forward-looking performance solutions that improve the spaces and places that matter most. From curbside to rooftop, ABM’s comprehensive services include janitorial, engineering, parking, electrical and lighting, energy and electric vehicle charging infrastructure, HVAC and mechanical, landscape and turf, and mission critical solutions. ABM serves a wide range of industries – from commercial office buildings to universities, airports, hospitals, data centers, manufacturing plants and distribution centers, entertainment venues and more. Founded in 1909, ABM serves over 20,000 clients, with annualized revenue approaching $8 billion and more than 100,000 team members in 350+ offices throughout the United States, United Kingdom, Republic of Ireland, and other international locations. For more information, visit www.abm.com.<br/><br/>ABM is proud to be an Equal Opportunity Employer qualified applicants without regard race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran or any other protected factor under federal, state, or local law. ABM is committed to working with and providing reasonable accommodation to individuals with disabilities. If you have a disability and need assistance in completing the employment application, please call 888-328-8606. We will provide you with assistance and make a determination on your request for reasonable accommodation on a case-by-case basis.<br/><br/>ABM participates in the U.S. Department of Homeland Security E-Verify program. E-Verify is an internet-based system used to electronically confirm employment eligibility.<br/><br/>ABM is a military-friendly company proudly employing thousands of men and women who have served in the U.S. military. With ABM, you’ll have access to a world-class training program and ample opportunities to use the skills you developed while serving our country. Whether you’re looking for a frontline or professional position, you can find post-military career opportunities across ABM.<br/><br/>ABM directs all applicants to apply at www.abm.com ABM does not accept unsolicited resumes.", "responsibilities": "<ul><li>Preparation of weekly schedule for CSRs and Facility Coordinators; monitoring of all parking shuttle operations and revenue activities on the event log.</li><li>Will manage a team of 30 - 45 shuttle drivers on various shifts.</li><li> Managing the master change fund to meet the change bank needs unique to the volume of each operating cashier shift.</li><li> Daily drop of all cashier deposits and transfer to Auditing Clerk.</li><li> Filling out fund and drop accountability forms and other reports daily.</li><li> Entering Cashiers’ TOD amounts into the Parking RDMS.</li><li> Transfer of all cashier tickets and related paperwork to audit department daily.</li><li> Handling of guest problems at the exit, including fee adjustments per policy.</li><li> Maintenance of accurate space count throughout the shift.</li><li> Monitoring of CSRs and Facility Coordinators for uniform compliance.</li><li> Management of the shift according to the policy and procedures outlined in the parking operations manual.</li><li> Collecting and updating of License Plate Inventory and recording gate readings nightly.</li><li> Logging and dispatching all police tow requests.</li><li> Collecting fees and recording all impound releases.</li><li> Overseeing the towing and impoundment operation, including research, notification of owners, titling, and sale of abandoned vehicles.</li><li> Monitor the PARCS equipment for error messages and malfunctions.</li><li> Answer calls from CSRs regarding equipment issues.</li><li> Search LPI for vehicles as required.</li><li> Send all trouble tickets regarding any PARCS equipment to HUB in a timely manner.</li><li> Track the opening and closing of all garages.</li><li> Answer intercom calls from guests and employees.</li><li> Manually control gates, as necessary.</li><li>Performs other duties as assigned or requested.<br/><br/><br/></li></ul>", "qualifications": {"required": "One to three years of management or supervisory experience. Proven knowledge of shuttle and transportation operations. Good communication skills both written and verbal. Proven knowledge of MS Office including word, excel, outlook and powerpoint."}, "skills": ["Shuttle", "Transportation", "Management", "Supervisory", "Communication", "MS Office", "Word", "Excel", "Outlook", "PowerPoint"], "postedDate": "2 months ago", "benefits": "ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit ABM 2024 Employee Benefits | Staff &amp; Management", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955270044"}