{"jobTitle": "Retail Bench Store Manager - 120 - LA-Orange County, CA Market", "company": {"name": "Michaels Stores", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "68,400.00 - 91,300.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Store - LA-SANTA ANA, CA<br/><br/>Store Managers are expected to spend the vast majority of their time on managerial work. This includes leading and managing a team; holding the team accountable to deliver a great customer experience while achieving the desired results; ensuring the store and team is ready to deliver the Customer Brand Promises; and planning and communicating store workload activities and KPI’s to ensure proper execution by your team within budget. Minimal, if any, time is expected to be spent on non-managerial tasks, such as cashiering, setting POGs, and stocking shelves.<br/><br/><strong>Major Activities<br/><br/></strong><ul><li>Lead and manage all aspects of the store, including adherence to Standard Operating Procedures (SOP’s) and Company programs to ensure compliance to applicable laws and requirements; ensure execution of Company policies and standards; hold team accountable for store conditions and results</li><li>Deliver sales plan/profit plan and other KPIs in conjunction with our annual performance objectives; manage the store team to achieve their role KPI’s</li><li>Lead the execution of our customer brand promises.</li><li>Implement and lead the shrink and safety programs to deliver goals</li><li>Use the company tools to set, prioritize and communicate goals and provide overall management to team members and customers.</li><li>Staff the store with qualified Team Members: Hire, train, observe and coach the team to achieve results; lead the performance management process, and if necessary, disciplinary process; identify talent and develop Team Members for advancement; utilize the leadership competencies for continued self-development</li><li>Interacts with others in an accepting and respectful manner; remains positive and respectful, even in difficult situations; promotes commitment to the organization’s vision and values; projects a positive image and serves as a role model for others</li><li>Serve as Manager on Duty (MOD)</li><li>Maintain Operational understanding of all store departments; cross trained, and ensures all Managers are cross trained in Custom Framing selling and production<br/><br/></li></ul><strong>Other Duties As Assigned<br/><br/></strong><strong>Minimum Type of experience the job requires<br/><br/></strong><ul><li>Retail management leadership experience<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Ability to remain standing for long periods of time</li><li>Ability to move throughout the store</li><li>Regular bending, lifting, carrying, reaching and stretching</li><li>Some lifting of heavy items and accessing high shelves by ladder or similar equipment</li><li>If you need help performing these functions of your job, please contact supervisor so that we may engage in the interactive process with you and find a reasonable accommodation<br/><br/></li></ul><strong>Work Environment<br/><br/></strong><ul><li>Public retail store setting supervising Team Members and taking care of our customers; all public areas are climate controlled; some stock rooms may not be climate controlled; some outdoor work; Frame shop contains glass cutter and heat press; work hours include nights, weekends and early mornings<br/><br/></li></ul><strong>Applicants in the U.S. must satisfy federal, state, and local legal requirements of the job. <br/><br/></strong><strong>Total Base Pay Range for this Position:<br/><br/></strong>$68,400.00 - $91,300.00<br/><br/>For 50 years, Michaels has been the best place for all things creative. We strive to inspire our customers, cultivate confident leaders, and serve our communities by fostering an inclusive environment for everyone to learn, shop, and create. At Michaels, everyone has a seat at our craft table and every Team Member is encouraged to hone their craft with opportunities for personal and professional growth. From our Stores and Distribution Centers to Artistree and our Support Center, our best-in-class team is committed to delivering on our purpose to fuel the joy of creativity. As the leading creative destination in North America, we operate over 1,290 stores in 49 states and Canada and online at Michaels.com and Michaels.ca. The Michaels Companies, Inc. also owns Artistree, a manufacturer of custom and specialty framing merchandise, and MakerPlace by Michaels, a dedicated handmade goods marketplace.<br/><br/><strong>Michaels is an Equal Opportunity Employer. We are here for all Team Members and all Makers to create, innovate and be better together. <br/><br/></strong><em>Michaels is committed to the full inclusion of all qualified individuals. In keeping with this commitment, Michaels will assure that people with disabilities are provided reasonable accommodations. Accordingly, if a reasonable accommodation is required to fully participate in the job application or interview process, to perform the essential functions of the job, and/or to receive all other benefits and privileges of employment, please contact Customer Care at 1-800-642-4235 (1800-MICHAEL).<br/><br/></em>EEOC Know Your Rights Poster in English<br/><br/>EEOC Know Your Rights Poster in Spanish<br/><br/>EEOC Poster Optimized for Screen Readers<br/><br/>Federal FMLA Poster <br/><br/>Federal EPPAC Poster<br/><br/>", "responsibilities": "Store Managers are expected to spend the vast majority of their time on managerial work. This includes leading and managing a team; holding the team accountable to deliver a great customer experience while achieving the desired results; ensuring the store and team is ready to deliver the Customer Brand Promises; and planning and communicating store workload activities and KPI’s to ensure proper execution by your team within budget. Minimal, if any, time is expected to be spent on non-managerial tasks, such as cashiering, setting POGs, and stocking shelves.", "qualifications": {"required": "Retail management leadership experience"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "For 50 years, Michaels has been the best place for all things creative. We strive to inspire our customers, cultivate confident leaders, and serve our communities by fostering an inclusive environment for everyone to learn, shop, and create. At Michaels, everyone has a seat at our craft table and every Team Member is encouraged to hone their craft with opportunities for personal and professional growth. From our Stores and Distribution Centers to Artistree and our Support Center, our best-in-class team is committed to delivering on our purpose to fuel the joy of creativity. As the leading creative destination in North America, we operate over 1,290 stores in 49 states and Canada and online at Michaels.com and Michaels.ca. The Michaels Companies, Inc. also owns Artistree, a manufacturer of custom and specialty framing merchandise, and MakerPlace by Michaels, a dedicated handmade goods marketplace.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955079907"}