{"jobTitle": "Specimen Logistics Specialist", "company": {"name": "ICONMA", "location": "Duarte, CA"}, "location": "Duarte, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "13.00/hr - 19.01/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Location: Duarte, CA/Irwindale, CA<br/><br/>Duration: 12 months with possible contract to Hire<br/><br/><strong>Position Summary<br/><br/></strong>The Specimen Logistics Specialist working in the Pathology Logistics receiving area is responsible for the efficient and accurate processing of laboratory samples and collection/transport supplies throughout Client.<br/><br/>Route, transport and store laboratory specimens and collection/transport supplies in an expeditious manner, assuring that specimens are transported carefully and at the correct temperature to ensure that sample integrity is not compromised.<br/><br/><strong>Essential Functions<br/><br/></strong><strong>SPECIMEN LOGISTICS: <br/><br/></strong>Follows established Standard Operating Procedures (SOPs) for day-to-day operation for<br/><br/>all logistics functions.<br/><br/>Follows packaging and temperature transport algorithms, per specimen and test(s) ordered, to ensure specimens are stored and transported between campuses in optimal conditions.<br/><br/>Complies with Client policies and procedures on specimen processing and handling.<br/><br/>Attend required laboratory training and complies with specimen handling/packaging procedures.<br/><br/>Utilizes the Laboratory Information System (LIS) to track receiving / delivery of specimens to final destination.<br/><br/>Utilizes the Laboratory Logistics software to manage specimen pick-up &amp; delivery.<br/><br/>Utilizes the Laboratory Information System (LIS) to accession/order laboratory specimens as they are delivered to the receiving room ensuring correct data entry of required elements.<br/><br/>Ensures proper and complete patient identification is present on requisitions and specimen labels.<br/><br/>Ensures no unidentified specimens leave the facility of origin or are transported further until labeling concern has been resolved.<br/><br/>Comply with all Client policies and procedures, including HIPPA and Safety procedures.<br/><br/>Ensures all specimens are appropriately packaged for safe shipment, including manual safety check of all specimen containers.<br/><br/>Actively supports the transport of specimens within the Rivergrade or Duarte campus.<br/><br/>For the Rivergrade campus, this position will support specimen transport from and between receiving area(s) and to the destination lab(s).<br/><br/>For the Duarte campus, this position may require transport of STAT specimens or support the specimen couriers during breaks or other related gaps in transport coverage.<br/><br/>Properly handles ambient, refrigerated, and frozen specimens; storing in the correct location/temperature.<br/><br/>Sorts specimens to enable delivery to the proper laboratory departments for testing.<br/><br/>Prepare samples for transport to the required laboratory departments utilizing correct transport container to maintain sample integrity during transport.<br/><br/>Follows established processes so that all specimens are appropriately packaged for safe shipment, performs manual safety check of all specimen containers.<br/><br/>Maintains collection kit(s) volumes and ensures they are provided to collection sites in a timely manner, and used within expiration date.<br/><br/>Performs clerical duties necessary to process specimens; responsible for all documentation required for tasks performed.<br/><br/>Notifies Pathology Logistics Supervisor/Pathology Logistics Lead immediately of any specimen issues so that resolution can be made quickly.<br/><br/><strong>Quality Improvement / Customer Service<br/><br/></strong>Participates in process improvement initiatives for Pathology Logistics Receiving area staff at all Client locations.<br/><br/>Communicates appropriately with Client staff and laboratory coworkers.<br/><br/>Participates in all required training to include specialized specimen transport procedures.<br/><br/>Immediately notifies Pathology Logistics Supervisor/Pathology Logistics Lead of any non conformance issues.<br/><br/>Follows all OSHA, DOT, and Packaging, Handling, Storage &amp; Transportation (PHS&amp;T) rules, regulations, and guidelines relating to the proper handling of lab specimens when transporting samples.<br/><br/>Completes training and competency assessment according to department and regulatory requirements.<br/><br/>Supports a culture of safety and an efficient working environment<br/><br/>Minimum Education: High School Diploma<br/><br/>Minimum Experience: 0-1 year experience in laboratory specimen receiving/processing<br/><br/>department<br/><br/>Preferred Education: Associate degree in Biological Sciences, Healthcare Administration,<br/><br/>Business Administration, Logistics, Supply Chain, or another relevant field<br/><br/>Preferred Experience: Two (2) years of Experience in a customer service-oriented position<br/><br/><strong>Skills/Abilities<br/><br/></strong>Good communication and interpersonal skills.<br/><br/>Working knowledge of specimen transport requirements.<br/><br/>Must be able to interact with a variety of personnel at various levels within and outside Client<br/><br/>Software: Basic computer skills<br/><br/>Laboratory Information Systems (Epic)<br/><br/><strong>Physical Demands<br/><br/></strong>Atmosphere and environment associated with laboratory and office settings.<br/><br/>Moderate physical effort (lift/carry up to 25 lbs/walking.)<br/><br/>Potential exposure to infection from disease-bearing specimens.<br/><br/>Potential exposure to hazards of handling diseased organs/tissues.<br/><br/><em>As an equal opportunity employer, ICONMA provides an employment environment that supports and encourages the abilities of all persons without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.</em>", "responsibilities": "The Specimen Logistics Specialist working in the Pathology Logistics receiving area is responsible for the efficient and accurate processing of laboratory samples and collection/transport supplies throughout Client.", "qualifications": {"required": "Good communication and interpersonal skills.", "preferred": "Associate degree in Biological Sciences, Healthcare Administration, Business Administration, Logistics, Supply Chain, or another relevant field"}, "skills": ["Laboratory Information Systems", "Epic"], "postedDate": "2 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955290822"}