{"jobTitle": "Shipping & Receiving Associate", "company": {"name": "McNICHOLS CO.", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00/hr - 19.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "With 19 service centers nationwide, McNICHOLS CO. is North America’s leading supplier and fabricator of “Hole Products”, including Perforated and Expanded Metals, Wire Mesh and Designer Metals, as well as a complete line of Metal Grating and Flooring Products. Founded in 1952 by the late Robert L. McNichols, the Company was established on strong values, high ethical standards and a commitment to employees and customers.<br/><br/>We have an exciting opportunity for a Shipping and Receiving Associate to join our team. The Shipping and Receiving Associate is responsible for performing warehouse functions including shipping, receiving, picking inventory and wrapping/crating orders according to detailed order and quality requirements.<br/><br/>All uniforms, steel toed boots, and safety equipment is provided in a clean, safe work environment. We also offer an excellent training program, skill based pay, and great opportunities for career growth.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Pack and ship customer orders.</li><li>Accurately receive incoming material to maintain inventory integrity.</li><li>Safely operate forklifts and other lift equipment, handle material and load and unload LTL carriers.</li><li>Organize material pulls for orders to maintain an efficient workflow.</li><li>Process incoming material including inspecting and receiving POs, interbranch and vendor material, customer returns and damaged freight.</li><li>Provide excellent customer service; answer phone, direct walk up customers to sales, and answer questions.</li><li>Assure timely shipment of orders and communicate issues.</li><li>Maintain high quality standards by following standardized procedures and processes.</li><li>Follow required safety and quality procedures.</li><li>Order and maintain proper shipping and packing supplies including skids, strapping and labels.</li><li>Properly tag and hold incoming LTL material or returned orders in preparation for receiving</li><li>Call carriers to arrange order pickups.</li><li>Use power tools such as chop saw, banders and packaging machines</li><li>Maintain equipment by following routine preventative maintenance requirements<br/><br/><br/></li></ul>Qualifications<br/><br/><ul><li>High School diploma or equivalent</li><li>Intermediate computer knowledge; capable of using inventory systems and RF scanners </li><li>Experience with UPS Worldship and Fed Ex shipping programs preferred</li><li>Experience driving a forklift; side loader and overhead crane experience a plus</li><li>Ability to stand for extended periods of time, lift material up to 50 pounds, and perform other physical tasks. </li><li>Ability to work independently and in a fast paced team environment</li><li>Excellent communications skills both verbal and written</li><li>Strong attention to detail and accuracy.</li><li>Must be able to work overtime as required<br/><br/><br/></li></ul>McNICHOLS is proud to reward our team with quarterly recognition incentives and a generous benefits package including 1st day eligibility for health insurance, three weeks of PTO, 9+ paid holidays, 401k with employer match and Company provided disability/life insurance.<br/><br/>McNICHOLS CO. is a Drug Free Workplace and strong advocate of workforce diversity.<br/><br/>We invite you to visit mcnichols.com/careers to learn more.", "responsibilities": "The Shipping and Receiving Associate is responsible for performing warehouse functions including shipping, receiving, picking inventory and wrapping/crating orders according to detailed order and quality requirements.", "qualifications": {"required": "High School diploma or equivalent, Intermediate computer knowledge; capable of using inventory systems and RF scanners, Experience driving a forklift; side loader and overhead crane experience a plus, Ability to stand for extended periods of time, lift material up to 50 pounds, and perform other physical tasks., Ability to work independently and in a fast paced team environment, Excellent communications skills both verbal and written, Strong attention to detail and accuracy., Must be able to work overtime as required", "preferred": "Experience with UPS Worldship and Fed Ex shipping programs"}, "skills": ["UPS Worldship", "Fed Ex", "Forklift", "Inventory Management", "Customer Service", "Shipping", "Receiving", "Warehouse", "Safety", "Quality Assurance"], "postedDate": "3 months ago", "benefits": "All uniforms, steel toed boots, and safety equipment is provided in a clean, safe work environment. We also offer an excellent training program, skill based pay, and great opportunities for career growth. McNICHOLS is proud to reward our team with quarterly recognition incentives and a generous benefits package including 1st day eligibility for health insurance, three weeks of PTO, 9+ paid holidays, 401k with employer match and Company provided disability/life insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955496364"}