{"jobTitle": "Mail Clerk with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "Overview What do you get when you bring together a team of bright individuals and place them into an environment where \"work\" means making a difference in the lives of people across the globe? You get Sciolex Corporation, a fast-growing defense contractor focused on providing the U.S. Government a level of service that surpasses the epitome of excellence. Our core services include systems engineering technical advice, technical support, and administrative assistance. From our humble beginning as a small Service Disabled, Veteran Owned Small Business in Chantilly, VA, Sciolex Corporation is now the home for over 1,000 employees across the U.S. Over the past 17 years, Sciolex Corporation has constructed an environment that celebrates diversity and encourages a positive work/life balance, all while supporting government missions that our employees are proud to be a part of. When you work for Sciolex Corporation, you are working for a stable company that values you and is committed to ensuring you receive the utmost employee care. Responsibilities The Mail Clerk is a permanent, full-time position supporting the overall mission of the U.S. Citizenship and Immigration Services (USCIS) by facilitating the operations of a local Field Office. As a Mail Clerk, your responsibilities would include:<br/><br/><ul><li>Routing messages, documents packages and mail to various business concerns or governmental agencies,</li><li>Sorting or opening incoming and outgoing mail,</li><li>Metering outgoing mail,</li><li>Obtaining receipts for articles delivered and keeping log of items received and delivered,</li><li>Updating mail logs and government systems,</li><li>Scanning large multi-page documents,</li><li>Other duties as assigned. Qualifications &amp; Physical Requirements</li><li>High school diploma or equivalent</li><li>Must be able to obtain a Public Trust/Suitability Clearance under the Department of Homeland Security from the United States Citizenship and Immigration Services</li><li>Ability to read and understand proficiently in English</li><li>Ability to lift and carry up to 45 lbs. or more in a physical environment</li><li>Ability to perform tasks while bending, stooping, climbing, and reaching At Sciolex Corporation, our top priorities and most valuable resources are our employees, which is why we offer a competitive total compensation package. We are a proud Equal Opportunity Employer (EOE) who celebrates diversity in and out of our organization. Come see where your opportunities for success can flourish. NOTICE: Sciolex Corporation NEVER asks job applicants to issue any payment, service fees, or banking information to Sciolex Corporation or its recruiters as part of our application process. Before providing any personal information to outside parties, verify that the job you are applying for appears on our Careers site.</li></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3955575254"}