{"jobTitle": "Material Handler", "company": {"name": "Quality Aluminum Forge", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Mechanical Or Industrial Engineering", "description": "<strong>Summary<br/><br/></strong>Prepares parts, assemblies, and other items for shipment, and receives, verifies, and records incoming materials.<br/><br/><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES </strong>include the following. Other duties may be assigned.<br/><br/><ul><li>Wraps and packages completed parts and assemblies and boxes for shipment to customer.</li><li>Performs part-marking, Rockwell hardness, Conductivity tests per written work order instructions.</li><li>Verifies quantities to be part-marked, packaged, and shipped and examines outgoing shipments to ensure shipments meet specifications.</li><li>Prepares and secures cartons, crates, pallets, and other containers for shipment of goods.</li><li>Stamps, stencils, labels, or affixes identifying information and shipping instructions onto cartons, pallets, crates, or containers as required.</li><li>Determines method of shipment and posts weights and shipping charges, and affixes postage as necessary.</li><li>Compares identifying information and counts, weighs, or measures items of incoming and outgoing shipments to verify information against bills of lading, invoices, orders, or other records.</li><li>Unpacks and examines incoming shipments, rejects damaged items, records shortages, and communicates with the buyer and/or shipper to reconcile damages and shortages. Routes items to the appropriate departments as required.</li><li>Monitors and maintains appropriate inventory levels of shipping materials and supplies.</li><li>Uses handtrucks, pallet jacks, forklifts, and material handling equipment to move shipments from shipping and receiving area to storage or work areas.</li><li>Meets established standards for productivity and quality. Confers with supervisor when problems arise which impact expected level of performance.</li><li>Responsible for supporting and ensuring compliance to ISO 9002/AS9100 Quality Management Systems.</li><li>Must contribute to a positive work environment.</li><li>Performs any task required to support customer requirements and company goals.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Three or more months related experience and/or training.</li><li>Ability to program, operate and conduct maintenance on Rockwell, Conductivity and part marking ID machines.</li><li>Ability to read and interpret documents such as safety rules, operating and maintenance instructions, blueprints, and procedure manuals.</li><li>Ability to write reports and business correspondence and effectively present information.</li><li>Ability to add, subtract, multiply, and divide using whole numbers, common fractions, and decimals.</li><li>Ability to carry out detailed but uninvolved written or oral instructions.<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong><ul><li>The employee is frequently required to use hands to finger, handle, or feel, reach with hands and arms, and talk or listen.</li><li>The employee is regularly required to sit, stand, walk, stoop, or crouch.</li><li>The employee must regularly lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds.</li><li>Specific vision abilities required by this job include close vision, and ability to adjust focus.</li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></li></ul>We believe a workforce with diverse backgrounds and skills helps us realize our full potential. We are proud to be an equal-opportunity employer, providing an inclusive workplace with growth opportunities for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual origin, gender identity, national origin, disability, or protected Veteran status.<br/><br/>SIFCO has a competitive compensation and benefits package, including medical, dental, vision, life insurance, disability, flexible spending accounts, supplemental insurance, and a 401(k) plan with a generous match.<br/><br/>If you need assistance with the application process due to a disability, please email Applications@sifco.com.", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3955156686"}