{"jobTitle": "Assistant Scheduler", "company": {"name": "Landmark Properties, Inc.", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "Landmark Construction, Landmark Properties', in-house general contractor, is looking for an Assistant Scheduler to join our team. Here’s a link to our construction website where you can learn more:\n\nhttps://www.landmarkproperties.com/construction/\n\nOur Assistant Scheduler is based in our Corporate Offices or sit in a Satellite Corporate office in one of the following locations:\n\n<ul><li>Athens, GA</li><li>Atlanta, GA</li><li>Minneapolis, MN</li><li>State College, PA</li><li>Irvine, CA<br/><br/></li></ul>The Assistant Scheduler is a position in the Construction department that supports the company during the design, preconstruction, and construction phases, assisting in creating and troubleshooting construction schedules for implementation and management. This position will support the companies under construction projects, acting as a liaison between the corporate office and project teams supporting each team with any scheduling oversite necessary.\n\n<strong>Reports to:</strong> Scheduling Manager<br/><br/><strong>Direct Reports: </strong>None<br/><br/><strong>Duties/Responsibilities:</strong> The duties listed below are an outline of the Assistant Scheduler’s responsibilities and should not be considered an all-inclusive list. As the needs of the organization change, these duties may be modified as needed.<br/><br/><ul><li>Assist in pre-construction planning and preliminary schedule development.</li><li>Support management and project teams in the planning, development, and maintenance of construction schedules.</li><li>Conducts schedule update/maintenance on assigned projects and ensures teams are operating within Landmark scheduling program parameters.</li><li>Participate in development of lean weekly work plans with project teams.</li><li>Facilitate collaborative planning sessions (pull planning, etc.) with Landmark project teams, subcontractors, designers, and stakeholders to get input for sequencing and durations, as it relates to overall project milestones.</li><li>Review schedule updates, including critical path and near-term schedules, to ensure the schedule accurately reflects activity on the project.</li><li>Identify and communicate opportunities / alternatives to schedule in collaboration with project team.</li><li>Troubleshoot, monitor, and communicate potential scheduling problems.</li><li>Assist in analyzing and communicating the impact of changes to the schedule.</li><li>Communicate as needed with Operations Manager on status of projects.</li><li>Utilize analytics to identify and report on project trends.</li><li>Assist in gathering monthly schedule information to help update, analyze, and prepare monthly executive reports of the project’s progress, including trend and progress reports.</li><li>Assist in identifying lessons learned on projects and communicate this information to the project teams.</li><li>Assist in ensuring historical archiving of construction schedules.<br/><br/></li></ul><strong>Education &amp; Experience<br/><br/></strong><ul><li>Bachelor’s degree in Construction Management or applicable discipline preferred.</li><li>Minimum of 2 to 4 years of scheduling experience on large-scale construction projects.</li><li>Strong knowledge of construction planning.</li><li>Knowledge of multi-family and high-rise type construction preferred.<br/><br/></li></ul><strong>Preferred Knowledge, Skills, &amp; Abilities<br/><br/></strong><ul><li>Familiarity with Oracle Primavera scheduling software or P6.</li><li>Working knowledge of Microsoft Office products.</li><li>Communicate effectively through clear verbal, written, schedule graphics and can explain schedule and positions in a formal meeting.</li><li>Ability to facilitate and run meetings, gather schedule updates, and perform under deadline pressure.</li><li>Proven ability to work independently and efficiently, while engaging internal project members, trade partners, and owners.</li><li>Develop and maintain relationships with project team and trade partners.<br/><br/></li></ul><strong>Work Environment<br/><br/></strong><ul><li>The work environment characteristics described herein are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The noise level in the work environment is usually moderate.</li><li>Travel: This position will require regular travel to project sites to update and review the construction schedule with the project team.<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</li><li>While performing the duties of this job, the employee is frequently required to stand; walk; sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl and talk or hear.</li><li>Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception, and the ability to adjust focus.</li><li>The employee may infrequently drive a vehicle (intrastate and interstate travel) or be subject to air travel for purposes of Company business.<br/><br/></li></ul>The base pay scale for this position ranges from $80,000 - $92,000 annually depending on a variety of factors including market factors in the geographical location where the candidate works.<br/><br/><em>Landmark Properties, Inc. does not accept unsolicited resumes from search firms or agencies. Any resume submitted to any employee of Landmark Properties, Inc. without a prior written search agreement will be considered unsolicited and the property of Landmark Properties, Inc. <br/><br/></em>Landmark Properties is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "responsibilities": "The duties listed below are an outline of the Assistant Scheduler’s responsibilities and should not be considered an all-inclusive list. As the needs of the organization change, these duties may be modified as needed.<br/><br/><ul><li>Assist in pre-construction planning and preliminary schedule development.</li><li>Support management and project teams in the planning, development, and maintenance of construction schedules.</li><li>Conducts schedule update/maintenance on assigned projects and ensures teams are operating within Landmark scheduling program parameters.</li><li>Participate in development of lean weekly work plans with project teams.</li><li>Facilitate collaborative planning sessions (pull planning, etc.) with Landmark project teams, subcontractors, designers, and stakeholders to get input for sequencing and durations, as it relates to overall project milestones.</li><li>Review schedule updates, including critical path and near-term schedules, to ensure the schedule accurately reflects activity on the project.</li><li>Identify and communicate opportunities / alternatives to schedule in collaboration with project team.</li><li>Troubleshoot, monitor, and communicate potential scheduling problems.</li><li>Assist in analyzing and communicating the impact of changes to the schedule.</li><li>Communicate as needed with Operations Manager on status of projects.</li><li>Utilize analytics to identify and report on project trends.</li><li>Assist in gathering monthly schedule information to help update, analyze, and prepare monthly executive reports of the project’s progress, including trend and progress reports.</li><li>Assist in identifying lessons learned on projects and communicate this information to the project teams.</li><li>Assist in ensuring historical archiving of construction schedules.<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 2 to 4 years of scheduling experience on large-scale construction projects.", "preferred": "Bachelor’s degree in Construction Management or applicable discipline preferred., Strong knowledge of construction planning., Knowledge of multi-family and high-rise type construction preferred.<br/><br/>"}, "skills": ["Oracle Primavera", "P6", "Microsoft Office"], "postedDate": "2 months ago", "salary": {"amount": "80,000 - 92,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955585190"}