{"jobTitle": "Senior Sales Executive", "company": {"name": "BBC Studios", "industry": "Broadcast Media Production and Distribution", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$200,000.00 - $215,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Broadcast Media Production and Distribution", "description": "BBC Studios, a global content company with bold British creativity at its heart, is a commercial subsidiary of the BBC Group, creatively and financially supporting the BBC, its partners, and the wider industry. We combine the strengths of the UK’s most awarded producer with a world-class distributor. Taking ideas from thought to screen and beyond, our activities range from content financing, development, production, through to global program sales, branded services, consumer products, live events and ancillaries. Together with our independent production labels and content sales partners, we deliver thousands of hours of content annually to the BBC and other broadcasters and services, including Amazon, Apple TV, Channel 4, Channel Five, Discovery, Disney, National Geographic, Netflix, Migu, PBS, Sky and YouTube. BBC Studios Productions creates high quality, award-winning content across an extraordinary range of genres and specialisms. Recent credits, made by BBC Studios Productions and its indie labels, include Happy Valley 3, Frozen Planet II, Strictly Come Dancing/Dancing with the Stars, Killing Eve, Am I Being Unreasonable, Grenfell: The Untold Story, Prehistoric Planet, JoJo and Gran Gran, Top Gear, The One Show and Royal and ceremonial events.", "responsibilities": "Provide Industry Experience and Deal Negotiating Expertise. Apply content licensing expertise in US and global rights and deal structure across multi-platforms (linear, pay, streaming, etc.). Spearhead strategy and process under EVP, US Content Sales and in partnership with division management. Leverage knowledge of all IP rights, including SVOD, Pay, Basic Cable, AVOD/FAST in order to negotiate deals which maximize value and optionality. Demonstrate leadership on advancing negotiations to close with effective interface with Business and Legal Affairs teams. Utilize and foster deep industry contacts and strong, existing relationships on all sides of the business to effect deal flow for Company’s current fiscal year revenue targets. Craft revenue targets by program, by partner, by channel. Apply business development experience to expanding customer base. Establish and maintain relationships across a spectrum of collaborators including internal production, marketing and business and legal affairs to aid in moving business priorities forward and in a timely manner. Interface regularly with senior leadership and continually evolve revenue generating strategies in partnership with team and brand execs taking into consideration the dynamic and evolving US media landscape. Define, implement and enforce department and inter-departmental protocols, procedures and best practices across the team that drive stronger results and efficiencies. Examine business and department workflows to identify and resolve process gaps within content licensing and management systems providing recommendations and improvements. Apply content analytics and research insights to commercial strategy in effecting unit’s current fiscal plan. Utilize trends and data to provide product opportunities and pricing scenarios to management. Provide hands-on support of presentations and corporate initiatives that include high-level communication and presentation skills that speak to and achieve business goals. Function within a central sales group, embracing cross-collaboration with immediate team members and internal BBCS constituents as a central way of working. Apply leadership skills to managing, developing and motivating junior sales staff.", "qualifications": {"required": "University degree (BA/BS) from an accredited university. 5+ Years Experience in Content Licensing/Partnerships", "preferred": "Excellent verbal and written communication skills. Fluency with industry content analytics including program performance across streaming and linear platforms. Demonstrated ability to manage and motivate team through intense negotiation, strategy and prep process."}, "skills": ["Content Licensing", "Negotiation", "Sales Strategy", "Business Development", "Team Management"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "100% Employer-Paid Medical and Dental Insurance (PPO plans), Generous Paid Time Off, Flexible, Hybrid Working Arrangements, Work/life balance, Free Retirement Consulting to All Employees, Pet Insurance, Commuter Benefits, Gym Reimbursement, Bagel Mondays, Monthly Happy Hours, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3955847353"}