{"jobTitle": "Senior Manager of Infrastructure Engineering", "company": {"name": "Unreal Staffing, Inc", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00 - $200,000.00", "currency": "USD"}, "jobFunction": "Engineering", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Our Engineering Team\n\nWe are a compact, fully remote engineering team focused on developing, maintaining, and enhancing a cutting-edge user-facing application and various internal tools. Our team's significant impact stems from:\n\n- Supporting each other as individuals within the team and across the organization\n- Adapting to technological advancements, user feedback, and shifting business priorities\n- Being passionate about our work and fostering a proactive learning environment\n- Valuing the balance between professional and personal commitments - recognizing that work is just one part of life\n- Seizing opportunities to work across different products and technology layers\n- Taking full ownership of projects that drive our mission and positively affect educators\n\nWho We're Looking For\n\nAs we expand, we aim to build a dedicated team focusing on DevOps, security, and infrastructure. We seek a technically skilled, hands-on leader with a people-first approach to establish this new function and team. Our ideal candidate is passionate about building and maintaining high-performance, reliable, scalable, and secure systems that delight developers, support teams, and users. Equally important is the enthusiasm to foster a vibrant, diverse, and collaborative engineering team.\n\nYour Experience:\n\nYou bring:\n\n- More than 2 years managing a diverse engineering team\n- Experience in the education or educational technology sector is a plus\n- Over 5 years in roles like DevOps, Site Reliability, or Infrastructure engineering\n- At least 3 years at a senior engineering level\n\nAs a senior engineer, you have:\n\n- Full-stack web development experience\n- Effective communication skills for both technical and non-technical audiences\n- Comprehensive understanding of security best practices, performance, monitoring, automation, escalation, and site reliability\n- Optimized data storage solutions tailored to specific needs\n- Proficiency with version control systems, CI/CD pipelines, automation tools, testing frameworks, and Infrastructure as Code\n- Demonstrated expertise in deploying, testing, managing, and monitoring cloud services in production environments\n\nAs an engineering manager, you have:\n\n- Enhanced processes, methodologies, and infrastructure, boosting team motivation, productivity, quality, and reliability in measurable ways\n- Identified strengths and growth areas in each engineer, fostering individual and team development\n- Built trusting and supportive relationships with direct reports\n\nOur Technology\n\nWe are always open to exploring new technologies and their potential benefits. Familiarity with our current stack is not mandatory, though equivalent experience is beneficial: GitHub, Cypress, CircleCI, Docker, DataDog, MongoDB, PostgreSQL, Azure AI, and various AWS services (CloudFormation, EC2, ECS, Fargate, Lambda, RDS, Redshift, DynamoDB).\n\nTechnical Responsibilities\n\n- Improve CI/CD processes and system operations to enhance efficiency, observability, latency, scalability, security, and reliability\n- Collaborate on product and technical strategy with managers and cross-functional team leaders to advance our mission\n- Provide technical guidance to engineers through code reviews, pairing, teaching, and coaching\n- Lead technically on high-risk, complex projects\n- Research and evaluate new technologies and tools, developing proofs-of-concept\n\nPeople Responsibilities\n\n- Build and lead a high-performing, diverse engineering team that delivers data-driven results to support our mission\n- Enhance team skill sets and support each engineer's career growth\n- Develop relationships based on care and trust with team members\n- Foster a team culture of psychological safety, inclusion, and continuous improvement\n- Offer open, honest communication and thoughtful feedback to individuals and the team\n\nRequirements\n\nYour Role:\n\n- Manage and mentor the Product Management Team to drive product innovation and excellence\n- Collaborate with the CEO and Head of Content to shape product and design strategies\n- Enhance the maturity of our product management and design workflows\n- Support the growth and success of product managers and designers through coaching and mentorship\n- Embrace a remote work culture with occasional travel for key events and development opportunities\n\nWhat You'll Do:\n\n- Oversee and mentor the Product Management Team to drive product development and excellence\n- Work closely with the CEO and Head of Content to shape product and design strategies\n- Enhance the maturity of our product management and design workflows\n- Support the growth and success of product managers and designers through coaching and mentorship\n- Embrace a remote work environment with some travel for key events and development opportunities\n\nYour Experience Includes:\n\n- Leading a high-performing team of product managers to success\n- Creating and iterating on product management and design systems\n- Coaching and developing product managers and designers\n- Successfully influencing product and design decisions at a strategic level\n\nBenefits\n\n- Compensation in the range of $140,000-$200,000 based on location and experience\n- Flexible time off policy\n- Medical, dental, and vision coverage\n- 401k matching\n- Profit sharing\n- Family and Medical Leave\n- Family-building reimbursement\n- Universal Basic Income\n- Mental health services benefit\n- A truly motivated, passionate, and fun team. We're collectively interested in helping you grow in your career\n\nTravel\n\nLimited travel is required, including for onboarding, professional development, and team events.", "responsibilities": "Manage and mentor the Product Management Team to drive product innovation and excellence. Collaborate with the CEO and Head of Content to shape product and design strategies. Enhance the maturity of our product management and design workflows. Support the growth and success of product managers and designers through coaching and mentorship. Embrace a remote work culture with occasional travel for key events and development opportunities.", "qualifications": {"required": "More than 2 years managing a diverse engineering team. Experience in the education or educational technology sector is a plus. Over 5 years in roles like DevOps, Site Reliability, or Infrastructure engineering. At least 3 years at a senior engineering level.", "preferred": "Full-stack web development experience. Effective communication skills for both technical and non-technical audiences. Comprehensive understanding of security best practices, performance, monitoring, automation, escalation, and site reliability. Optimized data storage solutions tailored to specific needs. Proficiency with version control systems, CI/CD pipelines, automation tools, testing frameworks, and Infrastructure as Code. Demonstrated expertise in deploying, testing, managing, and monitoring cloud services in production environments."}, "skills": ["DevOps", "Site Reliability", "Infrastructure Engineering", "Full-stack Web Development", "Cloud Services Management", "CI/CD Pipelines", "Automation Tools", "Testing Frameworks", "Infrastructure as Code"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Compensation in the range of $140,000-$200,000 based on location and experience. Flexible time off policy. Medical, dental, and vision coverage. 401k matching. Profit sharing. Family and Medical Leave. Family-building reimbursement. Universal Basic Income. Mental health services benefit. A truly motivated, passionate, and fun team. We're collectively interested in helping you grow in your career.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3955652271"}