{"jobTitle": "Neodent Territory Manager", "company": {"name": "Neodent", "industry": "Medical Equipment Manufacturing", "size": "51-200 employees", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000+/Annually", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Medical Equipment Manufacturing", "description": "Ready to make an impact? We develop, manufacture, and supply dental implants, clear aligners, instruments, CADCAM prosthetics and biomaterials for use in esthetic dentistry, tooth replacement and restoration solutions or to prevent tooth loss. We empower our employees to perform and make an impact, to question the status quo, to drive change, to stay ahead of the competition. From the first Dental Implant in 1974 to the latest Digital Solution – we do things differently than others. We deliver innovation based on evidence. This is part of our employer culture as well as an exceptional team spirit that truly encourages diversity and a powerful “can-do” attitude. As a Territory Manager, you are empowered to operate your territory like your own business, while also contributing to the brand and region's overall growth strategy. Your main responsibility is to meet Straumann’s sales objectives for your assigned product portfolio by establishing profitable relationships with targeted practices across the dental community in your territory. This involves driving case production by reaching out to high-performing doctors to secure new business, nurturing existing accounts, assisting with initial case submissions, and fostering referrals. A successful candidate should have existing connections within the dental provider network and a strong dedication to prioritizing customer success, as their achievements directly impact ours. This field-based position requires the ability to independently meet sales targets and thrive with minimal direct supervision.", "responsibilities": "Drive profitable sales growth and maximize sales revenue within a defined territory by developing, maintaining, and advancing existing accounts and prospects through the sale of Implant, Regenerative and Restorative product lines. Create an unparalleled customer experience by acting as a strategic business partner to existing customers within the defined territory by focusing on customers’ growth goals and how Straumann can help them achieve these goals. Achieve new business targets by proactively identifying, targeting, and converting prospect accounts and new business with dentists and oral surgeons in the defined territory. Prepare and maintain territory business plans, sales forecasts, and a sales promotion activity budget. Assess current performance and forecast when change is necessary. Collaborate with Product Marketing and Market Communications to support the execution of all marketing launch plans and new product sales objectives. Ensure referral network is regularly managed and develop referral networks for non-active GP’s. Attend and represent Straumann at customer events as required, including but not limited to regional events and national trade shows. Effectively and efficiently leverage education events to develop existing customers, build brand loyalty and gain new customers. Develop Study Clubs within the territory, actively participate, ensure Straumann presentation is rolled out in study club, and develop customer relationships with existing and new participants. Keep abreast of key clinical studies and scientific papers supporting Straumann’s product benefits. Regular use of all sales tools, such as SAP CRM, to effectively plan and measure sales activities against territory’s current customer base and prospective customers. Routinely run reports to align trends, customer needs, and opportunities with territory business strategy. All employees with customer facing interactions are required to log quality activities with every Straumann customer and prospect. Other related duties as assigned. Frequent travel (including overnight travel) is required and will vary depending upon the specific territory.", "qualifications": {"required": "Bachelor’s Degree – OR – 4+ years progressive work experience. 3+ years of sales experience in high-growth corporate markets.", "preferred": "Medical Device Industry experience. General computer efficiency including ability to operate Microsoft Word, Excel, and PowerPoint. Strong oral and written communications, including presentation skills. Prior sales experience with Physicians as the principal point of contact. Effective communication skills with the ability to present and negotiate. Capable of working both collaboratively with team members within the region as well as independently. Confident in using different insights and adapts selling approach based on customers’ needs and situation. Maintains integrity, high ethics, and professional codes of conduct at all times. Able to deliver highly complex information in clear, structured, and compelling manner. Proficiency in consultative selling with knowledge of the Challenger technique or related method."}, "skills": [], "postedDate": "17 hours ago", "applicationDeadline": "", "benefits": "Very Competitive total compensation plans (some positions include discretionary performance bonuses or Performance Share Units). A 401(K) plan to help you plan for your future with an employer match. Great health, dental and vision insurance packages to fit your needs to ensure you’re happy and healthy. Straumann contributes a healthy portion towards employees’ premium. Generous PTO allowance - plenty of time to recharge those batteries!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3955071192"}