{"jobTitle": "Production Manager", "company": {"name": "Huish Outdoors", "industry": "Sporting Goods Manufacturing", "size": "Not specified", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85000 - $90000", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Sporting Goods Manufacturing", "description": "Huish Outdoors is passionate about dive and watersports. We develop products that fuel the human spirit for adventure, keep people active, exploring, and enjoying our world's aquatic environments. We are a team who is passionate about what we do, and we are. Our team is made up of amazing people who are outdoor enthusiasts that embrace and drive change. Production Manager responsibilities include but may not be limited to overseeing all activities related to production of scuba regulators for various Huish brands. Responsible for the production of new retail-ready scuba regulators, sub-assemblies, and kits. The Production Manager provides guidance, support, and motivation to the team. They delegate and coordinate tasks and oversee the activities of the department directly and through production Leads. They monitor processes, represent their team, and train and audit staff to make sure tasks are performed accurately. The position provides ethical leadership and coaching to the production team and ensure that all key performance indicators (KPIs) are met. Responsible for all day-to-day operations of the production department and leading the team in delivering WOW to our customers. The Production Manager is accountable for the finished product and ensures quality and productivity targets are met. The role includes responsibilities that can overlap with others. For example, a General Manager, Manager, Supervisor, and Lead may communicate and support strategy with the team and provide direction. Working closely with Quality Control and Engineering is also required.", "responsibilities": "Deliver on KPIs for the production department, including but not limited to, turn-around times, safety, quality, materials use, productivity, serialization and tracking, transfers/shipments employee efficiency and workspace cleanliness and organization as guided by management. Manage the workflow and production schedule of regulators, sub-assemblies, repair kits and individual parts picking and packaging. Ensure unit targets are met within quality expectations and meet promise dates. Work side by side with production team to build scuba regulators related assemblies and kits. Assemble, test, package and rework products as required. Manage the production team to assess employee effectiveness. Provide coaching, feedback, and performance management to team members as needed. Perform annual reviews, set goals and meet quarterly for progress review on goals. Provide training for new hires and continuing education for the production team as needed. Collaborate with the QC department for all products and processes. Confirm that all work meets Huish Outdoors's quality standard and perform and lead the team in ongoing quality assurance. Assess employee effectiveness. Provide coaching, counseling, corrective action and feedback, and performance management to team members as needed. Develop team member strengths and improve on individual and work process weaknesses. Provide training (with the aid of the quality and engineering departments) for new hires and ongoing training for team as needed. Work the General Manager and material handlers to track component utilization and report concerns about shortage of parts required to produce to the plan. Communicate team goals, organize team initiatives, and evaluate team progress. Other duties as assigned.", "qualifications": {"required": "High school diploma with 5 years+ experience working on or managing a production line", "preferred": "3+ years' experience in a Lead production role or supervising a team preferred. Proficient ability to communicate effectively with others using written and spoken English including the ability to provide clear, constructive feedback to employees preferred. Expert comprehension skills preferred. Expert ability to model Huish Outdoors's commitment to a respectful, diverse, inclusive, and collaborative work environment preferred. Expert knowledge of HUISH regulator product line preferred. Attention to detail safety and ability to focus on small details to meet Huish Outdoors' quality standards preferred. Ability to lift at least 50 pounds helpful. Ability to assertively solve strategic problems and deal with a variety of variables in situations where only limited standardization exists helpful. Proficient in MS Office application, NetSuite, Advanced manufacturing systems and WMS helpful."}, "skills": ["Communication", "Organizational skills", "Delegation"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3956749702"}