{"jobTitle": "Assistant Sales Manager", "company": {"name": "Melissa Shoes USA", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Retail Apparel and Fashion", "description": "<strong>About Melissa<br/><br/></strong>For over four decades, Melissa has been at the forefront of the footwear industry, merging fashion, art, and design with sustainability. Our iconic jelly shoes have become a symbol of innovation, collaborating with legendary designers like Karl Lagerfeld, Jean-Paul Gaultier, Jason Wu, and Vivienne Westwood. We pride ourselves on being 100% vegan, cruelty-free, and committed to environmental consciousness, with all our shoes made from at least 30% recycled materials.<br/><br/>We are seeking a passionate and driven <strong>Assistant Manager</strong> to join our team at the <strong>Glendale Galleria</strong>. If you’re excited about fashion, sustainability, and leading a dynamic team, this is the perfect role for you!<br/><br/><strong>Key Responsibilities<br/><br/></strong>As an Assistant Manager at Melissa, you will:<br/><br/><ul><li>Achieve Sales Goals: Meet and exceed personal and store KPIs and sales targets, driving the overall success of the store.</li><li>Lead and Inspire: Motivate and guide the sales team, fostering a culture of continuous improvement and productivity.</li><li>Stay Ahead of Trends: Keep up-to-date with fashion industry trends and market movements, sharing insights with the team to enhance customer experiences.</li><li>Deliver Exceptional Service: Ensure that every customer interaction reflects Melissa’s commitment to outstanding service and quality, resolving any issues swiftly and effectively.</li><li>Build Client Relationships: Cultivate and maintain strong customer relationships, leveraging tools like personal shopper IG to encourage repeat business.</li><li>Maintain Store Standards: Collaborate with the store manager to ensure the store is always safe, well-presented, and aligned with our brand’s visual identity.</li><li>Manage Operations: Oversee cash control procedures, assist with stock management, shipping, and inventory tasks, and ensure staff adherence to all operational policies.</li><li>Training and Development: Provide ongoing training to staff, ensuring they are equipped with the skills and knowledge needed to excel in their roles.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Proven experience in a retail management role, preferably within the fashion industry.</li><li>Strong leadership skills with the ability to motivate and inspire a team.</li><li>Passion for fashion, sustainability, and customer service.</li><li>Flexibility to work nights, weekends, and overnight shifts as needed.</li><li>Excellent communication and organizational skills.<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Competitive Pay: Hourly wage based on experience, plus generous sales commissions and spiffs.</li><li>Career Growth: Opportunities for advancement within Melissa.</li><li>Employee Discounts: Enjoy exclusive discounts on Melissa products.</li><li>Professional Development: Access to training and development programs to enhance your career.</li></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3956551342"}