{"jobTitle": "Sales Associate - Beverly Hills", "company": {"name": "Hublot", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$60,000.00/yr - $65,000.00/yr", "currency": "USD"}, "jobFunction": "Customer Service and Sales", "industry": "Retail Luxury Goods and Jewelry", "description": "<em>A master in the Art of Fusion, respecting the tradition and creative vision of the 21st century, Swiss watchmaker Hublot places innovation at the heart of its growth strategy. Driven by a young spirit, resolutely looking to the future, Hublot's teams are constantly looking for innovative concepts, which is Hublot’s trademark. Beyond the development of major watchmaking complications, Hublot is associated with the biggest names in the world of sport, through collaborations with FIFA, UEFA, Kylian Mbappé, Usain Bolt, Novak Djokovic and many more. Hublot touches on many varied fields including music - with the famous virtuoso pianist Lang Lang as well as DJ Snake - and art with Takashi Murakami or Sang Bleu, among others.</em><br/>As a committed and dedicated member of the team, the Sales Associate plays a key role in helping the boutique to achieve success through the achievement of team targets. Customer service is at the heart of this role and ensuring a high level of brand and product knowledge is vital to achieve a positive brand experience for the clients and repeat sales.<br/><u>ESSENTIAL JOB FUNCTIONS</u><br/><ul><li>Professionally handling and advising customers of products and services resulting in the achievement of store sales targets</li><li>Merchandising displays and ensuring high standards are maintained within the store</li><li>Provide high quality service to customers face-to- face and over the telephone</li><li>Completing sale documentation and efficient use of internal till and stock systems</li><li>Altering and fitting customers watches</li><li>Maintain high level of product and brand knowledge</li><li>Attend and contribute to brand events</li><li>Build client relationships and develop client book</li><li>Capturing clients and potential client’s information and complete CRM database</li><li>Supporting in Instagram posting of the boutique when needed by creating content</li><li>Support in open and closing procedure of the boutique</li><li>Provide in-store after-sales service working with the after-sales teams to achieve a high level of customer service and satisfaction</li></ul><br/><br/><strong><u>Profile: </u></strong><ul><li>3+ years retail experience with the majority of time spent in luxury</li><li>Previous experience in Watch industry desired</li><li>Proactive, independent and team spirit</li><li>Highly professional manner and customer service skills</li><li>Ability to develop extensive brand and product knowledge</li><li>Able to meet sales targets and to work effectively within a team</li></ul><br/>Full Time Regular position with full benefits<br/>Location: Beverly Hills, Rodeo Drive", "responsibilities": "As a committed and dedicated member of the team, the Sales Associate plays a key role in helping the boutique to achieve success through the achievement of team targets. Customer service is at the heart of this role and ensuring a high level of brand and product knowledge is vital to achieve a positive brand experience for the clients and repeat sales.<br/><u>ESSENTIAL JOB FUNCTIONS</u><br/><ul><li>Professionally handling and advising customers of products and services resulting in the achievement of store sales targets</li><li>Merchandising displays and ensuring high standards are maintained within the store</li><li>Provide high quality service to customers face-to- face and over the telephone</li><li>Completing sale documentation and efficient use of internal till and stock systems</li><li>Altering and fitting customers watches</li><li>Maintain high level of product and brand knowledge</li><li>Attend and contribute to brand events</li><li>Build client relationships and develop client book</li><li>Capturing clients and potential client’s information and complete CRM database</li><li>Supporting in Instagram posting of the boutique when needed by creating content</li><li>Support in open and closing procedure of the boutique</li><li>Provide in-store after-sales service working with the after-sales teams to achieve a high level of customer service and satisfaction</li></ul>", "qualifications": {"required": "3+ years retail experience with the majority of time spent in luxury, Previous experience in Watch industry desired, Proactive, independent and team spirit, Highly professional manner and customer service skills, Ability to develop extensive brand and product knowledge, Able to meet sales targets and to work effectively within a team"}, "skills": ["Customer Service", "Sales", "Retail"], "postedDate": "3 days ago", "benefits": "Full Time Regular position with full benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3956835509"}