{"jobTitle": "Terminal Manager - Atlas", "company": {"name": "Cargomatic", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Join a rapidly growing company disrupting the trucking industry! Cargomatic is the #1 technology platform and digital marketplace for powering world-class, local trucking. Take a look around you. Literally everything humans build, grow, or sell has spent time on a truck. Local trucking is the lifeblood of every regional economy, and yet this $82 billion industry still relies heavily on phone calls and fax machines. Cargomatic is transforming the way goods move around every local node in the supply chain by connecting shippers and commercial truck drivers with mobile technology. We are solving complex, real-world problems every day, and giving full transparency to the shipping process. Cargomatic was named to the list of Built In Best Places to Work for 2023 & 2024, which recognizes the benefits we offer, our people-first culture, and commitment to supporting our employees’ success, growth, and well-being.Job Overview:Atlas Marine, a subsidiary of Cargomatic, is seeking an experienced Terminal Manager to lead our drayage operation in Long Beach, California. The ideal candidate will have extensive experience managing container operations, coordinating logistics, and overseeing daily terminal activities. This role is critical in ensuring efficient operations and maintaining high standards of service.Responsibilities:<ul><li>Operational Management: Oversee the day-to-day operations of the terminal, including container handling, drayage, and storage.</li><li>Team Leadership: Manage and lead a team of professionals, including scheduling, training, and performance evaluations.</li><li>Driver Coordination: Act as the primary point of contact for drivers; manage schedules, resolve conflicts, and ensure compliance with safety standards.</li><li>Corporate Reporting: Prepare and submit regular reports on terminal operations, productivity, and other key performance indicators to senior management.</li><li>Compliance and Safety: Ensure all operations comply with federal, state, and local regulations. Promote a culture of safety and proactive risk management.</li><li>Customer Relations: Maintain strong relationships with customers, address concerns promptly, and ensure customer satisfaction.</li><li>Strategic Planning: Participate in strategic planning for terminal operations, including resource allocation, operational improvements, and long-term goals.</li></ul>Requirements:<ul><li>Experience: Minimum of 5 years of experience in a Terminal Manager position with a focus on container operations.</li><li>Knowledge: In-depth understanding of the logistics and transportation industry, particularly in drayage and container management.</li><li>Leadership Skills: Proven ability to lead and motivate a team, with strong interpersonal and communication skills.</li><li>Problem Solving: Excellent problem-solving skills with the ability to handle unexpected challenges and make decisions under pressure.</li><li>Technical Skills: Proficiency in relevant software and technologies used in terminal operations.</li><li>Education: Bachelor’s degree in Logistics, Transportation Management, Business Administration, or related field preferred.</li></ul>What's In It for You<ul><li>Competitive compensation</li><li>Medical, dental, and vision benefits</li><li>401K company match program</li><li>Flexible paid time off (PTO) and paid holidays</li><li>Join a high-growth company redefining logistics and supply chain!<br/></li></ul>The expected salary range for this role is $90,000 to $150,000. The actual base pay offered will be determined on factors such as experience, skills, training, location, certifications, education, and other factors permitted by law. Decisions will be made on a case-by-case basis. In addition to the base salary, this position may be eligible for performance-based incentives.To learn more about how we use your data,<em><strong>Click Here</strong></em>.", "responsibilities": "Oversee the day-to-day operations of the terminal, including container handling, drayage, and storage. Manage and lead a team of professionals, including scheduling, training, and performance evaluations. Act as the primary point of contact for drivers; manage schedules, resolve conflicts, and ensure compliance with safety standards. Prepare and submit regular reports on terminal operations, productivity, and other key performance indicators to senior management. Ensure all operations comply with federal, state, and local regulations. Promote a culture of safety and proactive risk management. Maintain strong relationships with customers, address concerns promptly, and ensure customer satisfaction. Participate in strategic planning for terminal operations, including resource allocation, operational improvements, and long-term goals.", "qualifications": {"required": "Minimum of 5 years of experience in a Terminal Manager position with a focus on container operations. In-depth understanding of the logistics and transportation industry, particularly in drayage and container management. Proven ability to lead and motivate a team, with strong interpersonal and communication skills. Excellent problem-solving skills with the ability to handle unexpected challenges and make decisions under pressure. Proficiency in relevant software and technologies used in terminal operations.", "preferred": "Bachelor’s degree in Logistics, Transportation Management, Business Administration, or related field"}, "skills": ["Container Operations", "Logistics", "Drayage", "Team Leadership", "Driver Coordination", "Corporate Reporting", "Compliance", "Safety", "Customer Relations", "Strategic Planning"], "postedDate": "2 months ago", "benefits": "Competitive compensation, Medical, dental, and vision benefits, 401K company match program, Flexible paid time off (PTO) and paid holidays, Join a high-growth company redefining logistics and supply chain!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3956796091"}