{"jobTitle": "Assistant General Manager", "company": {"name": "Amirian Management Company", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong><strong>ASSISTANT GENERAL MANAGER<br/><br/></strong>SUMMARY: The Assistant Manager is responsible for creating a culture that reflects the company values. Responsibilities include managing the daily operations of the restaurant, including selection, development and performance management of employees. In addition, the Assistant Manager oversees the inventory and ordering of food and supplies, optimizes profits and ensures the guests are satisfied with their dining experience. The Assistant Manager reports to the Restaurant General Manager.<br/><br/><strong>Primary Responsibilities Include<br/><br/></strong>FINANCIAL<br/><br/><ul><li>Adhere to company standards and service levels to increase sales.</li><li>Responsible for ensuring that all financial and personnel/payroll related administrative duties are completed accurately, on time and in accordance with company policies and procedures.<br/><br/></li></ul>FOOD SAFETY AND PLANNING<br/><br/><ul><li>Maintains a safe, secure, and healthy environment by establishing, following, and enforcing sanitations standards and procedures and complying with health and legal regulations.</li><li>Responsible for ensuring consistent high quality food preparation and service.</li><li>Maintain professional restaurant image, including restaurant cleanliness, proper uniforms, and appearance standards.</li><li>Maintain accurate inventory and control cost of goods.</li><li>Supervise portion control and quantities of preparation to minimize waste.</li><li>Estimate food needs, place orders with distributor, and schedule the delivery of food and supplies.</li><li>Must be ServSafe certified and uphold all ServSafe guidelines.</li><li>Complete weekly Food Excellence Self-Assessment.<br/><br/></li></ul>GUEST SERVICE<br/><br/><ul><li>Ensure positive guest service in all areas. Respond to complaints, taking any and all appropriate actions to turn dissatisfied guests into return guests.<br/><br/></li></ul>OPERATIONS<br/><br/><ul><li>Ensure a safe working environment for employees and guests to reduce the risk of injury and accidents. Completes accident reports promptly in the event that a guest or employee is injured.</li><li>Manage shifts which include: daily decision making, scheduling, planning while upholding standards, product quality and cleanliness.</li><li>Investigate and resolve complaints concerning food quality and service.<br/><br/></li></ul>PERSONNEL<br/><br/><ul><li>Ensures all employees complete training.</li><li>Communicating job expectations, planning, monitoring, and enforcing policies and procedures.</li><li>Develop employees by providing ongoing feedback and establishing performance expectations.</li><li>Prepare schedules and ensure that the restaurant is fully staffed for all shifts.</li><li>Develop Crewmembers to become Shift Leaders and develop Shift Leaders to become Assistant Managers.<br/><br/></li></ul><strong>Accountabilities<br/><br/></strong><ul><li>Maintains compliance with all state, local and federal regulations, as well as company policies and procedures. Performs loss prevention audits to ensure all laws are being followed.</li><li>Upholds company’s purpose and values.</li><li>Keeps Restaurant General Manager promptly and fully informed of all issues (i.e. problems, unusual matters of significance and positive events) and takes prompt corrective action where necessary or suggest alternative courses of action.</li><li>Completes job responsibilities in a timely and effective manner.</li><li>Maintains a favorable working relationship with all company employees to foster and promote a cooperative and harmonious working climate which will be conducive to maximum employee morale, productivity and efficiency/effectiveness.</li><li>Accomplishes company goals by accepting ownership</li><li>Performs other duties and responsibilities as required or requested.</li></ul>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3956381656"}