{"jobTitle": "Wealth Management Chief of Staff**", "company": {"name": "Morgan Stanley", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "100,000.00/yr - 180,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Analyst", "industry": "Financial Services, Investment Banking, and Investment Management", "description": "<strong>Position Summary<br/><br/></strong>The Chief of Staff is a strategic partner that supports a Financial Advisor/Private Wealth Advisor Team. The role provides an opportunity to contribute to the growth of the team by managing all business operations and overseeing the essential activities of all Support Professionals alongside their productivity. The Chief of Staff plays a critical role in enhancing the client experience for their Financial Advisor/Private Wealth Advisor team by creating, developing, and executing on strategic plans to ensure the alignment of team priorities and business goals. This dynamic leader will oversee all business planning, business development, marketing, and client relationship operations to help support the Financial Advisor/Private Wealth Advisor team scale their business.<br/><br/><strong>DUTIES And RESPONSIBILITIES<br/><br/></strong><ul><li> Oversee team Support Professionals to ensure alignment on team priorities and business goals</li><li> Serve as a coordinator for business matters related to the team, ensuring that they are directed to the appropriate contact, addressed properly, efficiently and judiciously, and track progress until resolved</li><li> Coordinate and guide strategic business initiatives to achieve desired results, including acquisition of assets and growth and performance tracking of Financial Advisors</li><li> Organize and prioritize critical issues and required information for Advisors to facilitate efficient decision making</li><li> Lead team in establishing and cultivating relationships with new and existing clients and key stakeholders</li><li> Proactively assess client needs to determine the proper course of action and delegate to the appropriate individual on the team to manage</li><li> Manage team client communications strategy</li><li> Interview candidates for hire, train team members, oversee and regulate group workflow and workload</li><li> May take client orders and provide market quotes within Compliance guidelines</li><li> Evaluates, develops, and implements new services offered by the firm to determine how to integrate them into current service offering<br/><br/></li></ul><strong>EDUCATION, EXPERIENCE, KNOWLEDGE, And SKILLS<br/><br/></strong><strong>Education and/or Experience<br/><br/></strong><ul><li> 10+ years of work experience in a field relevant to the position required; Mandarin fluency is a plus</li><li> Advanced degree or professional certification or industry experience required</li><li> Active Series 7 (GS) and Series 66 (AG/RA) or Series 63 (AG) and Series 65 (RA) required</li><li> Willingness to obtain additional licenses and/or designations as required<br/><br/></li></ul><strong>Knowledge/Skills<br/><br/></strong><ul><li> Enjoys working with people and solving problems</li><li> Evidence of strong leadership skills or previous supervisory experience</li><li> Strong industry and product knowledge, including understanding of applicable compliance rules and regulations</li><li> Ability to think and execute strategically, prioritize and resolve complex problems and escalate as necessary</li><li> Detail-oriented with superior organizational and time management skills, including delegation of work</li><li> Effective written and verbal communication skills, providing comprehensive feedback and solutions to complex issues</li><li> Exceptional conflict resolution skills</li><li> Team player with the ability to collaborate with others</li><li> Proficient in applicable software applications</li><li> Ability and interest to work in a fast-paced, evolving environment<br/><br/></li></ul><strong>Reports To<br/><br/></strong>Business Service Officer and/or Market Business Service Officer<br/><br/>Expected base pay rates for the role will be between $100,000 and $180,000 per year at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.<br/><br/>Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.<br/><br/>It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.<br/><br/>Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet)<br/><br/><strong>Posting Date<br/><br/></strong>Aug 22, 2024<br/><br/><strong>Primary Location<br/><br/></strong>Americas-United States of America-California-Pasadena<br/><br/><strong>Job<br/><br/></strong>Wealth Management<br/><br/><strong>Employment Type<br/><br/></strong>Full Time<br/><br/><strong>Job Level<br/><br/></strong>Vice President", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3956719511"}