{"jobTitle": "Warehouse Supervisor", "company": {"name": "Legends", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "22.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Spectator Sports, Entertainment Providers, and Hospitality", "description": "The Role<br/><br/>The Warehouse Supervisor is responsible for coordinating and executing warehouse operations and procedures in order to ensure departmental effectiveness and efficiency so that all product, supply and equipment needs are met throughout the venue. Under the direction of the Warehouse Manager, this individual will be supporting the planning and preparation process for events assigning tasks and delegating responsibilities to warehouse staff. A top priority will be to ensure that the highest levels of safety, organization and sanitation are maintained throughout all warehousing and storage areas.<br/><br/><strong>Company Overview<br/><br/></strong>Legends is a holistic agency that specializes in delivering solutions for legendary brands. We approach each project with our 360-degree service solution. Our Global Planning, Global Sales, and Hospitality service solutions collaborate on every project to ensure success across each of our six verticals including professional sports, collegiate, attractions, entertainment, international, and conventions.<br/><br/>Our intellectual property is our people. It's our expertise that makes up Legends. We know what it's like to be on the team, business, or athletic department side, which drives our passion in creating solutions for our partners. Collectively, our leadership has over 300 years of experience in sales and sponsorship, analytics and valuation, hospitality and operations.<br/><br/><strong>Responsibilities<br/><br/></strong>The Warehouse Supervisor is responsible for coordinating and executing warehouse operations and procedures in order to ensure departmental effectiveness and efficiency so that all product, supply and equipment needs are met throughout the venue. Under the direction of the Warehouse Manager, this individual will be supporting the planning and preparation process for events assigning tasks and delegating responsibilities to warehouse staff. A top priority will be to ensure that the highest levels of safety, organization and sanitation are maintained throughout all warehousing and storage areas.<br/><br/><ul><li> Ensure the control procedures are being used for cataloging, inventory control, bulk storage and distribution of materials, equipment and supplies and assist in maintaining this supply system.</li><li> Coordinate all warehousing activities with management team.</li><li> Receive store and distribute supplies and equipment in large centralized warehousing operations.</li><li> Use storage systems, policies and procedures to ensure maximum use and efficiency of space and storage areas in warehousing operations.</li><li> Submit reports of damage, outdated stock or supplies, over and under shipments, return of goods to vendor, etc.</li><li> Contact vendors to reconcile invoice discrepancies, shortages, over shipments or to arrange for emergency shipments or requisitions.</li><li> Ensure compliance with all applicable health and safety regulations.</li><li> Perform other related duties, tasks and responsibilities as required from time to time.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> High school degree.</li><li> Two years’ experience in the receipt, storage or distribution of food and beverage, supplies or equipment, including at least 1 year at the supervisory level in an entertainment or convention center venue.</li><li> Ability to promote and participate in a team environment.</li><li> Ability to understand written and oral direction and to communicate same with others.</li><li> Requires occasional lifting of up to 50 pounds in weight (boxes).</li><li> Hours are often extended or irregular to include nights, weekends and holidays.<br/><br/></li></ul><strong>Compensation<br/><br/></strong>Part-Time $22.00hr<br/><br/>Follow and encourage your team to follow all safety policies and procedures, including but not limited to looking for and reporting any unsafe work conditions, and complete company-wide safety training and any additional job specific safety training.<br/><br/>Report all safety incidents (injuries and illnesses) into the company’s risk management system (Origami Risk) on the same day that the safety incident has been reported to you.<br/><br/>Legends is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, disability, or genetic information.<br/><br/>", "responsibilities": "The Warehouse Supervisor is responsible for coordinating and executing warehouse operations and procedures in order to ensure departmental effectiveness and efficiency so that all product, supply and equipment needs are met throughout the venue. Under the direction of the Warehouse Manager, this individual will be supporting the planning and preparation process for events assigning tasks and delegating responsibilities to warehouse staff. A top priority will be to ensure that the highest levels of safety, organization and sanitation are maintained throughout all warehousing and storage areas.<br/><br/><ul><li> Ensure the control procedures are being used for cataloging, inventory control, bulk storage and distribution of materials, equipment and supplies and assist in maintaining this supply system.</li><li> Coordinate all warehousing activities with management team.</li><li> Receive store and distribute supplies and equipment in large centralized warehousing operations.</li><li> Use storage systems, policies and procedures to ensure maximum use and efficiency of space and storage areas in warehousing operations.</li><li> Submit reports of damage, outdated stock or supplies, over and under shipments, return of goods to vendor, etc.</li><li> Contact vendors to reconcile invoice discrepancies, shortages, over shipments or to arrange for emergency shipments or requisitions.</li><li> Ensure compliance with all applicable health and safety regulations.</li><li> Perform other related duties, tasks and responsibilities as required from time to time.<br/><br/></li></ul>", "qualifications": {"required": "High school degree. Two years’ experience in the receipt, storage or distribution of food and beverage, supplies or equipment, including at least 1 year at the supervisory level in an entertainment or convention center venue. Ability to promote and participate in a team environment. Ability to understand written and oral direction and to communicate same with others. Requires occasional lifting of up to 50 pounds in weight (boxes). Hours are often extended or irregular to include nights, weekends and holidays.<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Legends is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, disability, or genetic information.<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3956537639"}