{"jobTitle": "Senior Operations Associate", "company": {"name": "Shinkei", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Fisheries", "description": "<strong>Responsibilities<br/><br/></strong><ul><li>Logistics Management:</li><ul><li>Develop and implement logistics strategies to ensure efficient transportation of fish from port to distributors and chefs for producer partners.</li><li>Develop and implement other strategies, including packaging and materials. </li><li>Coordinate with logistics partners and stakeholders to streamline processes and reduce costs.</li><li>Monitor and manage inventory levels, ensuring timely delivery of products.</li></ul><li>Purchasing &amp; Supply Chain:</li><ul><li>Source and purchase robot parts and materials required for manufacturing.</li><li>Establish and maintain relationships with suppliers and vendors to ensure quality and timely delivery of parts.</li><li>Identify and mitigate supply chain risks to prevent disruptions.</li></ul><li>Manufacturing &amp; Deployment Support:</li><ul><li>Develop and implement logistics strategies to ensure efficient build out, installation and field deployment of robots.</li><li>Collaborate with the manufacturing team to ensure seamless production processes.</li><li>Monitor production schedules and address any issues that arise to minimize delays.</li></ul><li>Office Management:</li><ul><li>Oversee daily office operations, ensuring a productive and organized work environment.</li><li>Manage office supplies and equipment, coordinating maintenance and repairs as needed.</li></ul><li>Continuous Improvement:</li><ul><li>Identify opportunities for process improvements and implement changes to enhance efficiency and productivity.</li><li>Analyze data and metrics to track performance and make informed decisions.<br/></li></ul></ul><strong>What You Will Need<br/><br/></strong><ul><li>Bachelor’s degree in Business Administration, Operations Management, Supply Chain Management, or a related field.</li><li>Minimum of 4 years of experience in logistics, supply chain management, or operations, preferably in the food, industrials or robotics industry.</li><li>Strong understanding of logistics and supply chain principles and best practices.</li><li>Excellent problem-solving skills and ability to manage multiple tasks simultaneously.</li><li>Proficiency in relevant software and tools (e.g., ERP systems, MS Office Suite).</li><li>Strong communication and interpersonal skills, with the ability to work effectively with cross-functional teams.</li><li>Detail-oriented and highly organized with a focus on continuous improvement.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3957817284"}