{"jobTitle": "Data Analytics Engineer", "company": {"name": "Mattermost", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Software Development", "description": "Mattermost provides secure, workflow-centric collaboration for technical and operational teams that need to meet nation-state-level security and trust requirements. We serve technology, public sector, national defense, and financial services industries with customers ranging from tech giants to the world’s largest banks, to the U.S. Department of Defense and governmental agencies around the world.<br/><br/>Our self-hosted and cloud offerings provide integrated workflow automation, AI-acceleration, ChatOps with team messaging, audio calling and screen share on an open core platform vetted and deployed by the world’s most secure and mission critical organizations.<br/><br/>We co-build the future of collaboration with over 4,000 open source project contributors who’ve provided over 30,000 code improvements towards our shared product vision, which is translated into 20 languages.<br/><br/>To learn more, visit www.mattermost.com<br/><br/>Mattermost is seeking a passionate data enthusiast to solve data analytics and engineering problems for the Marketing, Sales, Product and Engineering organizations. As a data-driven organization, Mattermost relies on our data team to drive insights into various areas, ensure data quality across systems, iterate on current key business metrics, and dive into complex datasets to answer business-critical questions.<br/><br/>In this role, you will help build and maintain a highly-performant data engineering stack and work closely with the Marketing, Sales, Product and Engineering organizations to deeply understand customer trends, analyze user activities, product adoption, and sales results in order to surface insights that impact the health of the overall business. If you are data-obsessed, love connecting the dots, thrive in an iterative environment, and aren’t afraid to get your hands dirty, this is the role for you.<br/><br/><strong>About Our Tools<br/><br/></strong><ul><li>Tool Stack: dbt, Airflow, Snowflake, Looker, Rudderstack, Stitch, Hightouch, Salesforce, Google Analytics, Clearbit, Google Sheets/Excel, Kubernetes, etc.</li><li>Coding Languages: SQL, Python, LookML<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>Proactively identify data-related issues, investigate root causes and drive them to resolution across Marketing, Sales, Product, and Engineering functional areas</li><li>Work with the other Data Engineering team members to ensure relevant, high-quality, raw data is ingested into our data warehouse and correctly modeled for performant analytics</li><li>Build and maintain models that provide the analytics that will help the functional teams predict results and report on performance.</li><li>Participate in the development process for our Marketing, Sales, Product and Engineering analytics reporting. This includes meeting with internal customers to understand their needs, understanding the core data models, writing code to enrich and transform raw data to analytics data and designing and iterating dashboards</li><li>Be hands-on with monitoring tools, work with large data sets, and provide insights into our performance(e.g. Engineering). This includes writing queries to access data, performing analysis, utilizing your technical expertise as well as a variety of internal tools and/or collaborating with other teams as needed</li><li>Become an expert at maintaining a variety of internal data systems and automate and script repetitive tasks where needed</li><li>Support other larger-org teams regarding the most effective ways of collecting the data and enforce its quality.</li><li>Provide guidance to functional leaders on KPIs, metrics and business decisions including accurate analysis of user and business data</li><li>Educate and help empower other larger-org team members on data-related aspects<br/><br/></li></ul><strong>Required Background/Skills<br/><br/></strong><ul><li>5+ years of demonstrated experience in data analysis or analytics engineering</li><li>Experience with schema design, data modeling and metadata management</li><li>Experience applying Software Engineering best practices to data analytics including CI/CD, version control, etc.</li><li>Experience with building and maintaining data pipelines</li><li>In-depth knowledge of (at least) one data warehouse system</li><li>Experience with building reports to various stakeholders</li><li>Strong SQL skills</li><li>Excellent written and verbal communication skills</li><li>Demonstrable teamwork skills and resourcefulness<br/><br/></li></ul>Mattermost is an EEO Employer. We are a remote-first, open source company.<br/><br/>We are constantly working towards adding more countries/regions to this list, but first we need to make sure we are compliant with local laws and regulations, which takes time.<br/><br/>Mattermost is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people from all walks of life. We don't discriminate against staff or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!", "responsibilities": "Proactively identify data-related issues, investigate root causes and drive them to resolution across Marketing, Sales, Product, and Engineering functional areas\nWork with the other Data Engineering team members to ensure relevant, high-quality, raw data is ingested into our data warehouse and correctly modeled for performant analytics\nBuild and maintain models that provide the analytics that will help the functional teams predict results and report on performance.\nParticipate in the development process for our Marketing, Sales, Product and Engineering analytics reporting. This includes meeting with internal customers to understand their needs, understanding the core data models, writing code to enrich and transform raw data to analytics data and designing and iterating dashboards\nBe hands-on with monitoring tools, work with large data sets, and provide insights into our performance(e.g. Engineering). This includes writing queries to access data, performing analysis, utilizing your technical expertise as well as a variety of internal tools and/or collaborating with other teams as needed\nBecome an expert at maintaining a variety of internal data systems and automate and script repetitive tasks where needed\nSupport other larger-org teams regarding the most effective ways of collecting the data and enforce its quality.\nProvide guidance to functional leaders on KPIs, metrics and business decisions including accurate analysis of user and business data\nEducate and help empower other larger-org team members on data-related aspects", "qualifications": {"required": "5+ years of demonstrated experience in data analysis or analytics engineering\nExperience with schema design, data modeling and metadata management\nExperience applying Software Engineering best practices to data analytics including CI/CD, version control, etc.\nExperience with building and maintaining data pipelines\nIn-depth knowledge of (at least) one data warehouse system\nExperience with building reports to various stakeholders\nStrong SQL skills\nExcellent written and verbal communication skills\nDemonstrable teamwork skills and resourcefulness"}, "skills": ["dbt", "Airflow", "Snowflake", "Looker", "Rudderstack", "Stitch", "Hightouch", "Salesforce", "Google Analytics", "Clearbit", "Google Sheets", "Excel", "Kubernetes", "SQL", "Python", "LookML"], "postedDate": "2 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3957893285"}