{"jobTitle": "Product Marketing Manager - Data & Location Services", "company": {"name": "Esri", "location": "Redlands, CA"}, "location": "Redlands, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "66,560-$110,240 USD", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development, IT Services and IT Consulting, and Technology, Information and Internet", "description": "Overview<br/><br/>As a Product Marketing Manager at Esri, you'll work on helping to expand and grow Esri’s industry-leading data and location services into new and existing markets. Collaborate with product, industry, and sales managers to create and execute impactful marketing strategies that drive sales and raise awareness of Esri's cutting-edge spatial analysis products. This in an opportunity to showcase your marketing expertise while working for a company committed to science, sustainability, community, education, research, and positive change.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Develop and execute go-to-market strategies for Esri’s data and location services</li><li>Spearhead the communication strategy for changes in product functionality and lifecycle changes, both internally and externally, including at events and/or tradeshows</li><li>Understand user and buyer persona needs to create positioning and messaging</li><li>Lead, coordinate, and execute product launches, product releases, and multi-channel enablement</li><li>Work with corporate and industry marketing teams to execute campaigns</li><li>Partner with cross-functional teams do drive awareness and adoption of Esri technology</li><li>Create engaging content, including web pages, case studies, video and other assets to aid in the customer journey</li><li>Work with product management, product engineering, and global business development throughout the product life cycle</li><li>Aid in the creation of sales enablement materials to help with internal education and awareness</li><li>Provide insight into competitive capabilities</li><li>Develop and monitor key performance indicators to measure product performance in market<br/><br/></li></ul>Requirements<br/><br/>\n<ul><li>2+ years of experience in product, industry, or corporate marketing; communications; business development; consulting; or similar field</li><li>Proven verbal and written communications skills; ability to understand and convey technical information in a non-technical manner</li><li>Strong interpersonal skills and thrives in a cross-functional team environment</li><li>Experience with marketing technology and common marketing concepts</li><li>Strong project management and problem-solving skills with previous experience leading programs or highly visible projects</li><li>Ability to exercise good judgment within defined procedures and practices to determine appropriate action</li><li>Self-starter, detail and task-oriented; able to successfully manage multiple priorities with guidance from leadership</li><li>Ability to travel 10-20% of the time for strategic meetings, events and/or tradeshows</li><li>Bachelor's in business, marketing, or related field</li><li>Visa sponsorship is not available for this posting; applicants must be authorized to work for any employer in the U.S.<br/><br/></li></ul>Recommended Qualifications<br/><br/>\n<ul><li>Demonstrated ability in releasing and growing innovative technology products</li><li>Experience with cloud and data center infrastructure technologies</li><li>Experience communicating and presenting to senior leadership to drive alignment and influence recommendations and trade-offs</li><li>Experience using GIS applications</li><li>Master's (MBA and/or a computer science, engineering, technology background)<br/><br/></li></ul>Total Rewards<br/><br/>Esri’s competitive total rewards strategy includes industry-leading health and welfare benefits: medical, dental, vision, basic and supplemental life insurance for employees (and their families), 401(k) and profit-sharing programs, minimum accrual of 80 hours of vacation leave, twelve paid holidays throughout the calendar year, and opportunities for personal and professional growth. Base salary is one component of our total rewards strategy. Compensation decisions and the base range for this role take into account many factors including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs.<br/><br/>A reasonable estimate of the base salary range is<br/><br/>$66,560-$110,240 USD<br/><br/>About Esri<br/><br/>At Esri, diversity is more than just a word on a map. When employees of different experiences, perspectives, backgrounds, and cultures come together, we are more innovative and ultimately a better place to work. We believe in having a diverse workforce that is unified under our mission of creating positive global change. We understand that diversity, equity, and inclusion is not a destination but an ongoing process. We are committed to the continuation of learning, growing, and changing our workplace so every employee can contribute to their life’s best work. Our commitment to these principles extends to the global communities we serve by creating positive change with GIS technology. For more information on Esri’s Racial Equity and Social Justice initiatives, please visit our website here.<br/><br/>If you don’t meet all of the preferred qualifications for this position, we encourage you to still apply!<br/><br/>Esri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need reasonable accommodation for any part of the employment process, please email askcareers@esri.com and let us know the nature of your request and your contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address.<br/><br/>Esri Privacy Esri takes our responsibility to protect your privacy seriously. We are committed to respecting your privacy by providing transparency in how we acquire and use your information, giving you control of your information and preferences, and holding ourselves to the highest national and international standards, including CCPA and GDPR compliance.<br/><br/>", "responsibilities": "Develop and execute go-to-market strategies for Esri’s data and location services\nSpearhead the communication strategy for changes in product functionality and lifecycle changes, both internally and externally, including at events and/or tradeshows\nUnderstand user and buyer persona needs to create positioning and messaging\nLead, coordinate, and execute product launches, product releases, and multi-channel enablement\nWork with corporate and industry marketing teams to execute campaigns\nPartner with cross-functional teams do drive awareness and adoption of Esri technology\nCreate engaging content, including web pages, case studies, video and other assets to aid in the customer journey\nWork with product management, product engineering, and global business development throughout the product life cycle\nAid in the creation of sales enablement materials to help with internal education and awareness\nProvide insight into competitive capabilities\nDevelop and monitor key performance indicators to measure product performance in market", "qualifications": {"required": "2+ years of experience in product, industry, or corporate marketing; communications; business development; consulting; or similar field\nProven verbal and written communications skills; ability to understand and convey technical information in a non-technical manner\nStrong interpersonal skills and thrives in a cross-functional team environment\nExperience with marketing technology and common marketing concepts\nStrong project management and problem-solving skills with previous experience leading programs or highly visible projects\nAbility to exercise good judgment within defined procedures and practices to determine appropriate action\nSelf-starter, detail and task-oriented; able to successfully manage multiple priorities with guidance from leadership\nAbility to travel 10-20% of the time for strategic meetings, events and/or tradeshows\nBachelor's in business, marketing, or related field\nVisa sponsorship is not available for this posting; applicants must be authorized to work for any employer in the U.S.", "preferred": "Demonstrated ability in releasing and growing innovative technology products\nExperience with cloud and data center infrastructure technologies\nExperience communicating and presenting to senior leadership to drive alignment and influence recommendations and trade-offs\nExperience using GIS applications\nMaster's (MBA and/or a computer science, engineering, technology background)"}, "skills": ["Marketing", "Product Management", "Communication", "Project Management", "Sales", "Business Development", "GIS"], "postedDate": "2 weeks ago", "benefits": "Esri’s competitive total rewards strategy includes industry-leading health and welfare benefits: medical, dental, vision, basic and supplemental life insurance for employees (and their families), 401(k) and profit-sharing programs, minimum accrual of 80 hours of vacation leave, twelve paid holidays throughout the calendar year, and opportunities for personal and professional growth. Base salary is one component of our total rewards strategy. Compensation decisions and the base range for this role take into account many factors including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958054540"}