{"jobTitle": "Member Enrollment Specialist (Full-time)", "company": {"name": "Wellth", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>OVERVIEW<br/><br/></strong>Wellth is a fast growing digital health company based in Los Angeles that just raised our Series B from leading investors including SignalFire. We use behavioral economics, habit science, and technology to motivate behavior change in some of the highest need and most underserved populations in the US, drastically changing their health outcomes for the better. We have demonstrated our results with several large health insurers (e.g., cut down hospitalization rates by 44% on behalf of Centene AZ) and now are scaling rapidly (&gt;120% year over year revenue growth). Our goal is not to just be another digital health startup but to be the category leader in improving health outcomes for hard to engage populations.<br/><br/>Most importantly, our work quite literally saves lives every day. We are a mission-driven company where you would have the chance to work with extremely talented people and see tangible differences that directly result from your initiative.<br/><br/>Visit us at www.wellthapp.com for more information.<br/><br/><strong>JOB DESCRIPTION<br/><br/></strong>As a Member Enrollment Specialist, you will be the first point of contact to our prospective members, with the task of contacting them via phone to introduce and explain the Wellth program and assist them with enrollment by showing them how to download and use our app. You will also work with the rest of the Member Operations team to conduct feedback outreaches to better help members' voices be heard.<br/><br/>Our ideal candidate has a passion for healthcare and a desire for personal growth, and a motivated individual will have the opportunity to grow within the company as it expands.<br/><br/><strong>JOB LOCATION<br/><br/></strong>This is a remote position (United States)<br/><br/><strong>JOB HOURS<br/><br/></strong><ul><li>Full-time: 40 hours weekly</li><li>Scheduling ranges from Monday - Saturday, between the hours of 6 AM - 8 PM PST </li><li>Initial base pay: up to $18/hr, plus monthly bonus<br/><br/></li></ul><strong>REQUIRED SKILLS<br/><br/></strong><ul><li>Excellent interpersonal skills</li><li>Ability to quickly build rapport with prospective members over the phone</li><li>Capable of effectively overcoming objections and conveying benefits to a population base that will benefit from the Wellth program</li><li>Positive attitude and empathy for patient needs</li><li>Strong organizational skills and the ability to efficiently make a high volume of outbound calls on a daily basis</li><li>Attention to detail and ability to follow proper processes and procedures with care</li><li>Ability to simplify information and communicate effectively, verbal + written</li><li>High School Diploma or GED</li><li>Knowledge of Android and iOS mobile technology; capable of guiding less tech savvy individuals through app download and usage</li><li>Bilingual nice to have - English and Spanish<br/><br/></li></ul><strong>OTHER JOB REQUIREMENTS<br/><br/></strong>We are looking to hire someone who is self-motivated and goal-oriented with a high degree of professionalism. You will be the face of our company to these patients, and we want you to represent the company at all times. As a representative, you will be expected to provide a high level of service when introducing the Wellth program and helping patients enroll. You must have a clear and professional speaking voice/telephone manner with the ability to be friendly, courteous, and helpful. This role requires patience as we work with a population struggling with chronic diseases who are oftentimes intimidated by technology. Patients are not always familiar with Wellth and require directed guidance to download the app and learn to use it. Individuals best suited for this role are empathetic and want to make a positive impact in the healthcare field.<br/><br/><strong>BENEFITS<br/><br/></strong>Benefits for Full-Time employees include Health, Dental, and Vision Insurances, 401(k) and FSA accounts, Life Insurance, PTO and Paid Holidays.<br/><br/><em>Wellth is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, ethnicity, national origin, citizenship, gender, gender identity, sexual orientation, age, veteran status, disability, genetic information, or any other protected characteristic.</em>", "responsibilities": "As a Member Enrollment Specialist, you will be the first point of contact to our prospective members, with the task of contacting them via phone to introduce and explain the Wellth program and assist them with enrollment by showing them how to download and use our app. You will also work with the rest of the Member Operations team to conduct feedback outreaches to better help members' voices be heard.", "qualifications": {"required": "Excellent interpersonal skills, Ability to quickly build rapport with prospective members over the phone, Capable of effectively overcoming objections and conveying benefits to a population base that will benefit from the Wellth program, Positive attitude and empathy for patient needs, Strong organizational skills and the ability to efficiently make a high volume of outbound calls on a daily basis, Attention to detail and ability to follow proper processes and procedures with care, Ability to simplify information and communicate effectively, verbal + written, High School Diploma or GED, Knowledge of Android and iOS mobile technology; capable of guiding less tech savvy individuals through app download and usage, Bilingual nice to have - English and Spanish"}, "skills": ["Interpersonal Skills", "Communication", "Customer Service", "Phone Skills", "Sales", "Empathy", "Organization", "Time Management", "Detail Oriented", "Problem Solving", "Android", "iOS", "Bilingual", "Spanish"], "postedDate": "2 months ago", "benefits": "Benefits for Full-Time employees include Health, Dental, and Vision Insurances, 401(k) and FSA accounts, Life Insurance, PTO and Paid Holidays.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3958006430"}