{"jobTitle": "Operations Coordinator I", "company": {"name": "Prospect Medical Systems", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "size": "Not specified", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Finance", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "description": "We are hospitals and affiliated medical groups, working closely together for the benefit of every person who comes to us for care. We build comprehensive networks of quality healthcare services that are designed to offer our patients highly coordinated, personalized care and help them live healthier lives. Through collaboration, we strive to provide all of our patients and medical group members with the quality, affordable healthcare they need and deserve.", "responsibilities": "Monitor and audit contract applications such as CONFAX, CDA and STRIA to ensure that the documentation is correctly and appropriately processed and stored. Mails letters, Contracts, MOU's or Amendments to provider. Upon mailing of letters and/or documentation tracks delivery of certified mail. Logs Letters of Interest (LOIs) in CDA and forwards per department policy. Creates, maintains and updates CDA and contract summaries with current, accurate contract and demographic information. Maintains contract filing protocol and ensures proper filing. Supports Queue Coordinator when needed to review and respond to all requests received in the Provider Contracting/Medical Management request Queue (PCON). Reviews and responds to Provider Contracting inquiries and Claims Queue (5000 Queue). Supports contracting department by drafting contracts, MOUs, Amendments, and letters. Generates and tracks mass amendment projects by creating merged documents, mailing documents, tracking documents from mailing to receipt. Receives and/or routes calls to facilitate and resolve customer service of other contracting related issues. Completes special projects and performs other duties as needed and as assigned.", "qualifications": {"required": "High School Diploma", "preferred": "One (1) year of healthcare related experience and knowledge of contracting and credentialing functions."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3958699567"}