{"jobTitle": "Senior Architectural Project Manager/Designer (Education K-14)", "company": {"name": "Arcadis", "industry": "Professional Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Professional Services", "description": "Our Global Architecture & Urbanism Division offers a diverse range of solutions focusing on human-centric design, sustainability, and technology. Join our team as a Senior Project Manager/Designer specializing in K-14 education projects. We're seeking motivated individuals with 15-25 years of experience who thrives on challenges and excel in communication. As a successful candidate, you'll be involved in all project phases, collaborating with design team, consultants, contractors, and clients. You'll contribute to brainstorming sessions, client and project management, and see your ideas implemented. Our award-winning practice offers a collaborative studio environment, diverse team, and excellent benefits for a fulfilling work-life balance.", "responsibilities": "Partner with the studio manager to establish a planning and design vision; Lead the design for multiple education projects; Present and sell design solutions at client meetings and public hearings; Communicate openly, embrace mentorship and nurture the next generation of designers; Lead the process to coordinate the opportunity response (example: RFP), prepares proposals, submissions and client presentations; Plans, coordinates, and manages the project process for projects; Coordinate the design, construction and management of projects, including liaising with clients, agencies - such as DSA, CDE, etc., contractors, suppliers and consultants; Apply knowledge of building codes and zoning bylaws.", "qualifications": {"required": "Bachelor's degree in Architecture; 15+ years of Architecture experience including leading design efforts; 10+ years' experience as a Project Architect for K-14 education work; Experience on agency reviews such as DSA, local jurisdictions, etc.; Licensed Architect preferred; LEED accreditation preferred; Familiarity with REVIT, SketchUp, Photoshop, Miro, & Illustrator; Strong verbal and written communication; Organized, detail-oriented and self-starter.", "preferred": ""}, "skills": ["Architecture", "Project Management", "Design", "Communication", "Team Collaboration", "Building Codes", "Zoning Bylaws"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Excellent benefits for a fulfilling work-life balance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3958137613"}