{"jobTitle": "Brand Strategist, Company Marketing", "company": {"name": "Meta", "location": "Menlo Park, CA"}, "location": "Menlo Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "180,000.00/yr - 252,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Meta is looking for a Brand Strategy leader to work on the Corporate Marketing team. Brand Strategy is responsible for identifying the most important brand opportunities across Meta’s portfolio; embedding with product teams to understand roadmaps, and build enduring brand systems and tools that help teams make enduring decisions. For example, the team defines the company’s brand architecture strategy, develops positioning and naming models, and supports the development of identity systems, brand marketing campaigns and activations, as well as product experiences. The ideal person for this role knows how to energize and direct teams to solve complex problems. They have a strong background in developing cogent, creative and insights-driven brand strategies. They are excited about the technologies Meta creates and the potential of AI and the metaverse. They are a doer and simplifier with the unique ability to solve problems, collaborate and drive cross-org alignment on some of our most timely and high-priority brand initiatives. They are a highly skilled communicator with a proven ability to ask and answer difficult questions, form quick (but sound) perspectives, advise stakeholders and be a true partner to multi-disciplinary teams. They are a hybrid thinker: equal parts analytical acumen and creative fluency. Finally, they are able to look beyond individual brands and teams to optimize for our goals as a company (a portfolio of brands).<br/><br/>Brand Strategist, Company Marketing Responsibilities:<br/><br/><ul><li>Lead discussions and recommendations on what brand types are appropriate for new or existing products, services, and programs, and what brand within the portfolio they might leverage in-market</li><li>Author strategic briefs for product, creative and marketing partners</li><li>Collaborate with our internal insights team and external partners to design and analyze research and measurement</li><li>Develop and refine tools (e.g., frameworks, decision trees, guidelines, trainings) to equip the company</li><li>Partner with creative, comms, media, policy, product and more to develop cohesive go-to-market strategies</li><li>Bring your brand and visual identity lens to work, ensuring we’re applying existing systems and identifying opportunities to develop new systems<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>12+ years experience in a strategist or planning role at a brand-side company, agency or consultancy</li><li>Experience building, implementing and optimizing brand foundations</li><li>Experience partnering with product teams (product design, content design, product management) and using brand strategy to inform product experiences and GTM executions</li><li>Experience collaborating with dynamic and matrixed organizations</li><li>Experience partnering with creative and/or design teams</li><li>Experience leveraging data, research and insights to inform strategies and recommendations</li><li>A self-starter who thrives in a fast-paced and ever-changing environment</li><li>Experience in presenting to executive and senior leadership<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience working with company and sub-brand architectures</li><li>Experience developing brand architecture, naming systems, and messaging frameworks</li><li>Experience developing 360 brand activations</li><li>Tech sector background</li><li>Experience developing and rolling out cross-org strategies for brand implementation and/or governance</li><li>Previous people management experience — this role is not managing today, but may in the future<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$180,000/year to $252,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3958384783"}