{"jobTitle": "Senior Building Envelope Consultant - Project Manager", "company": {"name": "Partner Engineering & Science, Inc.", "industry": "Environmental Services", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "110,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Environmental Services", "description": "<strong>About Us<br/><br/></strong>Partner offers full-service engineering, environmental, and energy consulting and design services throughout the Americas, Europe, and around the globe. As a leading firm in the CRE industry, we have over 1,200 + employees in more than 40 offices. We want to be the best home for talented professionals in our field! We know that if we hire the best and the brightest, the clients will come, and we will continue to build our company. Our internally focused mission has led to Partner being recognized on ENR’s Top 500 Design Firms List, LABJ’s 100 Fastest Growing List, Inc. 5000’s Fastest-Growing Private Companies in America, and Zweig’s Best Firms to Work For. Our entrepreneurial environment is one where each person can have an impact. Join our team of talented people!<br/><br/>Learn more about Partner at www.partneresi.com.<br/><br/><strong>Summary<br/><br/></strong>Partner Engineering and Science, Inc. is looking to hire a Senior Waterproofing/Roofing Consultant to support the Building Envelope Solutions team. This senior-level position is responsible for providing review of design and construction documents, field forensic investigation, building envelope assessment, implementation of QA/QC during construction through review of submittals, RFIs, and review/inspection/testing of ongoing work in the field. Provide investigation and analysis of existing buildings and site testing.  The Project Manager is responsible for coordination/collaboration with both internal and external team members including Consultants, A/E professionals, Owners, and Contractors for successful completion of all services pertaining to the project(s) assigned.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage projects and teams, from inception to completion, in a variety of waterproofing/roofing-related projects in both new and existing construction. </li><li>Provide critical evaluation of building envelope performance. </li><li>Provide expert input as to design and construction of building envelopes (with strong emphasis on waterproofing and roofing systems). </li><li>Provide design assistance services related to waterproofing and roofing systems including input as to the appropriate use and selection of materials and details. </li><li>Conduct investigations and repair of existing failing waterproofing and roofing</li><li>Provide reviews and input as to development of waterproofing and roofing details and specifications. </li><li>Provide expert review of waterproofing and roofing project submittal and RFI documents</li><li>Inspect and supervise inspection of work in progress related to the waterproofing and roofing systems. </li><li>Organize field data to facilitate analysis and problem solving. </li><li>Prepare professional review and inspection reports in Partner’s format. </li><li>Provide and manage client services, communicating progress, reporting, technical discussion of findings, recommendations, and project close-out. </li><li>Provide and coordinate scheduling and implementation of project needs. </li><li>Attend project meetings, including leading meetings or portions of meetings related to waterproofing and roofing. </li><li>Provide business development services by providing exceptional service and garnering repeat and referral clients. <br/><br/></li></ul><strong>MINIMUM QUALIFICATIONS:<br/><br/></strong><ul><li>Minimum of 10 years’ experience in building envelope consulting with sound knowledge of building materials, field investigation methods, and scientific principles as they relate to performance of waterproofing and roofing systems. </li><li>BS in Architecture/Engineering or Construction-related field from an ABET-accredited university or 20+ years’ experience and recognized industry credentials such as RRO, RRC, RWC, REWC, etc. </li><li>Written and spoken English proficiency. </li><li>Proficient in writing and editing of project specifications and technical reports. </li><li>Strong written and oral communication skills. </li><li>Demonstrated ability to meet deadlines. </li><li>Ability to work both independently and in a team environment. </li><li>Ability to work in the field and to travel outside local area as workload and projects require. </li><li>Work collaboratively on multiple solutions for clients and objectively summarize the benefits and shortfalls of each. </li><li>Must be proficient in technology, including the use of Word, Excel, PowerPoint, and other Office suite software. Proficiency in CAD is a plus. <br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Must be able to read, write, speak &amp; comprehend English</li><li>Must be able to communicate clearly in person and over the telephone</li><li>Visual acuity adequate to perform job duties, including reading information from printed sources and computer screen</li><li>Requires frequent bending, reaching, standing, walking, sitting, pushing and pulling exerted regularly throughout the work shift<br/><br/></li></ul><strong>Compensation<br/><br/></strong>Salary range: $110,000 to $130,000. This is what we reasonably expect to pay for the role<br/><br/>The wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled.<br/><br/>You may also be eligible to participate in a discretionary annual incentive program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance.<br/><br/><strong>Benefits<br/><br/></strong>Competitive benefits package including health insurance, dental insurance, vision insurance, vacation and sick time, and a 401(k) plan with a company match.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>It is Partner Engineering and Science, Inc’s (The Company) policy to provide equal employment opportunity for all applicants and employees. The Company does not unlawfully discriminate on the basis of race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), gender identity, gender expression, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition or information including genetic information, family care status, military caregiver status, veteran status, marital status, or any other basis protected by local, state, or federal laws.<br/><br/><strong>California Consumer Privacy Act<br/><br/></strong>We collect personal information from you in connection with your application for employment with Partner Engineering and Science, Inc. For details on what personal information we collect and the purposes for which we collect it, please visit:<br/><br/>https://www.partneresi.com/about/careers/california-consumer-privacy-act", "responsibilities": "<ul><li>Manage projects and teams, from inception to completion, in a variety of waterproofing/roofing-related projects in both new and existing construction. </li><li>Provide critical evaluation of building envelope performance. </li><li>Provide expert input as to design and construction of building envelopes (with strong emphasis on waterproofing and roofing systems). </li><li>Provide design assistance services related to waterproofing and roofing systems including input as to the appropriate use and selection of materials and details. </li><li>Conduct investigations and repair of existing failing waterproofing and roofing</li><li>Provide reviews and input as to development of waterproofing and roofing details and specifications. </li><li>Provide expert review of waterproofing and roofing project submittal and RFI documents</li><li>Inspect and supervise inspection of work in progress related to the waterproofing and roofing systems. </li><li>Organize field data to facilitate analysis and problem solving. </li><li>Prepare professional review and inspection reports in Partner’s format. </li><li>Provide and manage client services, communicating progress, reporting, technical discussion of findings, recommendations, and project close-out. </li><li>Provide and coordinate scheduling and implementation of project needs. </li><li>Attend project meetings, including leading meetings or portions of meetings related to waterproofing and roofing. </li><li>Provide business development services by providing exceptional service and garnering repeat and referral clients. <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Minimum of 10 years’ experience in building envelope consulting with sound knowledge of building materials, field investigation methods, and scientific principles as they relate to performance of waterproofing and roofing systems. </li><li>BS in Architecture/Engineering or Construction-related field from an ABET-accredited university or 20+ years’ experience and recognized industry credentials such as RRO, RRC, RWC, REWC, etc. </li><li>Written and spoken English proficiency. </li><li>Proficient in writing and editing of project specifications and technical reports. </li><li>Strong written and oral communication skills. </li><li>Demonstrated ability to meet deadlines. </li><li>Ability to work both independently and in a team environment. </li><li>Ability to work in the field and to travel outside local area as workload and projects require. </li><li>Work collaboratively on multiple solutions for clients and objectively summarize the benefits and shortfalls of each. </li><li>Must be proficient in technology, including the use of Word, Excel, PowerPoint, and other Office suite software. Proficiency in CAD is a plus. <br/><br/></li></ul>", "preferred": null}, "skills": ["Waterproofing", "Roofing", "Building Envelope", "Construction", "Project Management", "Design", "Engineering", "Environmental", "Energy", "QA/QC", "Forensic Investigation", "Building Materials", "Field Investigation", "Scientific Principles", "Architecture", "Construction Management", "English Proficiency", "Technical Writing", "Communication", "Deadlines", "Teamwork", "Field Work", "Travel", "Problem Solving", "Word", "Excel", "PowerPoint", "CAD"], "postedDate": "2 months ago", "applicationDeadline": null, "benefits": "Competitive benefits package including health insurance, dental insurance, vision insurance, vacation and sick time, and a 401(k) plan with a company match.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3958849598"}