{"jobTitle": "Operations Manager", "company": {"name": "Amazon", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Distribution, and Supply Chain", "industry": "Software Development", "description": "Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.<br/><br/>Our Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.<br/><br/><strong>Key Responsibilities And Job Elements<br/><br/></strong><ul><li> Support, mentor, and motivate your salaried and hourly workforce</li><li> Lead large-scope projects with site and regional impact</li><li> Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance</li><li> Manage safety, quality, productivity, and customer delivery promises</li><li> Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives</li><li> Lift up to 49 pounds and frequently push, pull, squat, bend, and reach</li><li> Stand/walk for up to 12 hours during shifts</li><li> Work in an environment where the noise level varies and can be loud</li><li> Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)</li><li> Continuously climb and descend stairs (applies to sites with stairs)<br/><br/></li></ul>Our fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Operations Managers based on location preference and the business’ current openings.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of employee and performance management experience</li><li> Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience</li><li> Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 1+ years of performance metrics, process improvement or lean techniques experience<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $81,900/year in our lowest geographic market up to $150,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2680115", "salary": {"amount": "81,900.00/year - $150,100.00/year", "currency": "USD"}, "postedDate": "2 weeks ago", "remoteWork": "No", "responsibilities": "Support, mentor, and motivate your salaried and hourly workforce\nLead large-scope projects with site and regional impact\nBuild and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance\nManage safety, quality, productivity, and customer delivery promises\nCollaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\nLift up to 49 pounds and frequently push, pull, squat, bend, and reach\nStand/walk for up to 12 hours during shifts\nWork in an environment where the noise level varies and can be loud\nWork in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\nContinuously climb and descend stairs (applies to sites with stairs)", "qualifications": {"required": "3+ years of employee and performance management experience\nBachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\nWork a flexible schedule/shift/work area, including weekends, nights, and/or holidays", "preferred": "1+ years of performance metrics, process improvement or lean techniques experience"}, "url": "https://www.linkedin.com/jobs/view/3958443958"}