{"jobTitle": "Facilities General Manager", "company": {"name": "ABM Industries", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Facilities Services", "description": "<strong>Job Description<br/><br/></strong><strong>PAY</strong>: Up to $100,000.00 annually<br/><br/>The pay listed is the salary range for this position. Any specific offer will vary based on the successful applicant’s education, experience, skills, abilities, geographic location, and alignment with market data.<br/><br/>You may be eligible to participate in a Company incentive or bonus program.<br/><br/>ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit 2024-Recruitment-Staff-Mgmt-11.6.23.pdf (abm.com)<br/><br/><strong>Position Responsibilities<br/><br/></strong>Will develop, implement, direct and support \"best practices\", ABM polices and standards in quality management, job and site safety programs, and personnel administration. Promotes positive employer/employee /customer relationships and interactions. Implements employee training and skill enhancement programs, provides structured employee disciplinary procedures.<br/><br/>Responsible for maintaining positive customer relations from property management level up to senior executive level. Supports ABM activities in budget preparation and vendor/contactor oversight and is responsible to help manage cost and to identify and institute cost savings projects.<br/><br/>Provides on-going oversight and support for ABM administration, budgetary and financial procedures, processes, and standards. Responsible to develop, enhance and submit various professional level written reports, surveys, correspondence on a timely basis. Supports and assists in development of new business opportunities for ABM.<br/><br/>Reports daily to ABM Director and executive levels of the organization. Interacts with various organizational support elements including administrative, human resources, financial, quality control and safety departments.<br/><br/>Will supervise a staff.<br/><br/>Will manage staffing and operation across various facilities including but not limited to all event facilities operations.<br/><br/>Payroll reporting.<br/><br/>Prepare monthly financial reports.<br/><br/>Facility maintenance including repairs, proposals and project management.<br/><br/>Perform other duties as assigned or requested.<br/><br/><strong>Knowledge, Skills &amp; Abilities<br/><br/></strong>A minimum of five to eight years’ experience in the field and prior management experience in facilities, Aviation and/or janitorial management is preferred.<br/><br/>Proven experience in doing pricing &amp; staffing buildups for new opportunities.<br/><br/>Proven knowledge of MS Office Applications including word, excel and PowerPoint.<br/><br/>Good verbal and written communication skills.<br/><br/>Must have experience managing Union employees.<br/><br/>Proven ability to work well in a customer focused team environment.<br/><br/>Available to work Flexible hours that may include morning, evening, weekends, late nights and/or holidays.<br/><br/>Proven to identify top talent, create teams, and train/develop/retain great people.<br/><br/>Proven ability to think through complex issues and allocate time to execute multiple tasks and changing priorities.<br/><br/>Proven ability to motivate and influence others through personal actions and examples.<br/><br/>Effective organization, and leadership skills.<br/><br/>Proficient in Excel in order to prepare and present regular reports on performance, goals, and strategic initiatives.<br/><br/><strong>About Us<br/><br/></strong>ABM (NYSE: ABM) is one of the world’s largest providers of facility services and solutions. A driving force for a cleaner, healthier, and more sustainable world, ABM provides essential services and forward-looking performance solutions that improve the spaces and places that matter most. From curbside to rooftop, ABM’s comprehensive services include janitorial, engineering, parking, electrical and lighting, energy and electric vehicle charging infrastructure, HVAC and mechanical, landscape and turf, and mission critical solutions. ABM serves a wide range of industries – from commercial office buildings to universities, airports, hospitals, data centers, manufacturing plants and distribution centers, entertainment venues and more. Founded in 1909, ABM serves over 20,000 clients, with annualized revenue approaching $8 billion and more than 100,000 team members in 350+ offices throughout the United States, United Kingdom, Republic of Ireland, and other international locations. For more information, visit www.abm.com.<br/><br/>ABM is proud to be an Equal Opportunity Employer qualified applicants without regard race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran or any other protected factor under federal, state, or local law. ABM is committed to working with and providing reasonable accommodation to individuals with disabilities. If you have a disability and need assistance in completing the employment application, please call 888-328-8606. We will provide you with assistance and make a determination on your request for reasonable accommodation on a case-by-case basis.<br/><br/>ABM participates in the U.S. Department of Homeland Security E-Verify program. E-Verify is an internet-based system used to electronically confirm employment eligibility.<br/><br/>ABM is a military-friendly company proudly employing thousands of men and women who have served in the U.S. military. With ABM, you’ll have access to a world-class training program and ample opportunities to use the skills you developed while serving our country. Whether you’re looking for a frontline or professional position, you can find post-military career opportunities across ABM.<br/><br/>ABM directs all applicants to apply at www.abm.com ABM does not accept unsolicited resumes.", "responsibilities": "Will develop, implement, direct and support \"best practices\", ABM polices and standards in quality management, job and site safety programs, and personnel administration. Promotes positive employer/employee /customer relationships and interactions. Implements employee training and skill enhancement programs, provides structured employee disciplinary procedures.<br/><br/>Responsible for maintaining positive customer relations from property management level up to senior executive level. Supports ABM activities in budget preparation and vendor/contactor oversight and is responsible to help manage cost and to identify and institute cost savings projects.<br/><br/>Provides on-going oversight and support for ABM administration, budgetary and financial procedures, processes, and standards. Responsible to develop, enhance and submit various professional level written reports, surveys, correspondence on a timely basis. Supports and assists in development of new business opportunities for ABM.<br/><br/>Reports daily to ABM Director and executive levels of the organization. Interacts with various organizational support elements including administrative, human resources, financial, quality control and safety departments.<br/><br/>Will supervise a staff.<br/><br/>Will manage staffing and operation across various facilities including but not limited to all event facilities operations.<br/><br/>Payroll reporting.<br/><br/>Prepare monthly financial reports.<br/><br/>Facility maintenance including repairs, proposals and project management.<br/><br/>Perform other duties as assigned or requested.", "qualifications": {"required": "A minimum of five to eight years’ experience in the field and prior management experience in facilities, Aviation and/or janitorial management is preferred.<br/><br/>Proven experience in doing pricing &amp; staffing buildups for new opportunities.<br/><br/>Proven knowledge of MS Office Applications including word, excel and PowerPoint.<br/><br/>Good verbal and written communication skills.<br/><br/>Must have experience managing Union employees.<br/><br/>Proven ability to work well in a customer focused team environment.<br/><br/>Available to work Flexible hours that may include morning, evening, weekends, late nights and/or holidays.<br/><br/>Proven to identify top talent, create teams, and train/develop/retain great people.<br/><br/>Proven ability to think through complex issues and allocate time to execute multiple tasks and changing priorities.<br/><br/>Proven ability to motivate and influence others through personal actions and examples.<br/><br/>Effective organization, and leadership skills.<br/><br/>Proficient in Excel in order to prepare and present regular reports on performance, goals, and strategic initiatives."}, "skills": ["Management", "Facilities Management", "Aviation", "Janitorial", "MS Office", "Excel", "PowerPoint", "Communication", "Teamwork", "Leadership"], "postedDate": "2 months ago", "benefits": "ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit 2024-Recruitment-Staff-Mgmt-11.6.23.pdf (abm.com)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958170666"}