{"jobTitle": "Account Representative I, Amazon Canada", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "43,300.00/year - 92,600.00/year", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Business Development", "industry": "Software Development", "description": "Amazon’s growing Canada Marketplace Sales team is looking for a Sales Account Representative to drive success and growth within key Amazon business groups. This role is for candidates who are passionate about selling, and helping small and medium business grow. The ideal candidate has a history of achieving goals and exceeding deliverables. Successful hires are strong analytical thinkers and problem solvers who thrive in fast-paced dynamic environments. They are strong communicators, effective listeners and project managers who are able to balance multiple and often conflicting priorities. The ability to manage a valuable prospect list is vital; candidates must be comfortable prospecting, cold-calling, and negotiating via phone on both transactional and strategic branding-based deals. This is an exciting opportunity to learn about our solutions and how these drive the overall Amazon business.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> BA/BS degree or equivalent experience with equivalent being</li><li> 2 years of sales experience</li><li> Experience meeting sales targets using a solutions-focused approach.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Ability to thrive in an ambiguous environment.</li><li> Ability to work with legal, product, and internal business owners to reach mutually beneficial agreements.</li><li> Always does what is right for the customer – relentlessly customer-focused.</li><li> Creative, has initiative, and can constructively advocate on behalf of sellers internally.</li><li> Ability to prioritize and manage multiple responsibilities.</li><li> Sound business judgment, proven ability to influence others, and strong analytical skills.</li><li> 2 + years of demonstrated communication and presentation skills.</li><li> Ability to communicate fluently in French in both writing and verbally.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $43,300/year in our lowest geographic market up to $92,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2680631", "responsibilities": null, "qualifications": {"required": "BA/BS degree or equivalent experience with equivalent being\n2 years of sales experience\nExperience meeting sales targets using a solutions-focused approach.", "preferred": "Ability to thrive in an ambiguous environment.\nAbility to work with legal, product, and internal business owners to reach mutually beneficial agreements.\nAlways does what is right for the customer – relentlessly customer-focused.\nCreative, has initiative, and can constructively advocate on behalf of sellers internally.\nAbility to prioritize and manage multiple responsibilities.\nSound business judgment, proven ability to influence others, and strong analytical skills.\n2 + years of demonstrated communication and presentation skills.\nAbility to communicate fluently in French in both writing and verbally."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3958910038"}