{"jobTitle": "Manager, Repair Field Operations", "company": {"name": "Otis Elevator Co.", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$105,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Consumer Services", "description": "The Anaheim, CA branch of Otis Elevator Company is searching for a highly motivated Field Operations Manager to oversee the repair of equipment as well as employee selection, training and safety for all assigned projects.<br/><br/><strong>Job Responsibilities:<br/><br/></strong><ul><li>Must have the ability to lead and direct the field operations for a large volume of non-contract repair and hydraulic elevator modernization</li><li>Open order sales support, route control, scheduling and quality assurance</li><li>Maintaining customer quality assurance; emphasis on safety, improving efficiencies, managing the expenditure of labor, materials and performance to estimate</li><li>Ability to coordinate daily activities with the branch’s’ project manager and work well with general contractors, owner’s agency and developers for various modernization sites</li><li>Providing technical support</li><li>Authorizing change orders</li><li>Drive safety in the workplace<br/><br/></li></ul><strong>Education</strong><strong>:<br/><br/></strong><ul><li>High school education, or equivalent required.</li><li>Associate or technical degree is a plus</li><li>BA/BS degree in operations, construction management, general management, or similar degree preferred for candidates who do not have technical field experience<br/><br/></li></ul><strong>Experience/Qualifications:<br/><br/></strong><ul><li>3+ years of Elevator industry experience is required for candidates who do not have a college degree.</li><li>Candidates must have excellent communication skills and be able to work in a highly team-oriented and dynamic environment.</li><li>Self-motivated individuals who have the ability to manage many simultaneous projects and responsibilities are a must.</li><li>Candidates must have strong computer skills.</li><li>Experience leading a team of technicians in the elevator or similar industry is strongly desired.<br/><br/></li></ul><strong>Location/Relocation</strong>:<br/><br/><ul><li>The job duties for this role require work to be performed 100% in the office or on job sites. Remote work is not available. By submitting your application, you are willing and able to meet these requirements. </li><li>Relocation assistance is not available for this position. <br/><br/></li></ul>The salary range for this role is $105,000 - $160,000. We may ultimately pay more or less than the posted range, and the range may change in the future. Pay within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, and business or organizational needs.<br/><br/>Otis is the world’s largest elevator and escalator manufacturing, installation and service business. We serve customers in over 200 countries and territories around the world and maintain more than 2 million elevators and escalators globally. Our Gen2® elevator system, energy-saving ReGenTM drive technology and Link escalator solutions have set industry standards for innovation and performance. Otis has more than 68,000 employees, including engineers, digital technology experts, sales and functional specialists, as well as factory and field technicians. We are proud to be a global team that continues to rise to the challenges of a fast-moving, high-performance company. Together, the people of Otis are creating new ideas and opportunities by collaborating across time zones, geographies and cultures to better serve our customers. So just imagine where you can take your career!<br/><br/>If you live in a city, chances are we will give you a lift or play a role in keeping you moving every day.<br/><br/>Otis is the world’s leading elevator and escalator manufacturing, installation, and service company. We move 2 billion people every day and maintain approximately 2.2 million customer units worldwide, the industry's largest Service portfolio.<br/><br/>You may recognize our products in some of the world’s most famous landmarks including the Eiffel Tower, Empire State Building, Burj Khalifa and the Petronas Twin Towers! We are 69,000 people strong, including engineers, digital technology experts, sales, and functional specialists, as well as factory and field technicians, all committed to meeting the diverse needs of our customers and passengers in more than 200 countries and territories worldwide. We are proud to be a diverse, global team with a proven legacy of innovation that continues to be the bedrock of a fast-moving, high-performance company.<br/><br/>When you join Otis, you become part of an innovative global industry leader with a resilient business model. You’ll belong to a diverse, trusted, and caring community where your contributions, and the skills and capabilities you’ll gain working alongside the best and brightest, keep us connected and on the cutting edge. <br/><br/>We provide opportunities, training, and resources, that build leadership and capabilities in Sales, Field, Engineering and Major Projects and our Employee Scholar Program is a notable point of pride, through which Otis sponsors colleagues to pursue degrees or certification programs.<br/><br/>Today, our focus more than ever is on people. As a global, people-powered company, we put people – passengers, customers, and colleagues – at the center of everything we do. We are guided by our values that we call our Three Absolutes – prioritizing Safety, Ethics, Quality in all that we do. If you would like to learn more about environmental, social and governance (ESG) at Otis click here.<br/><br/>Become a part of the Otis team and help us #Buildwhatsnext!<br/><br/><strong><em>Otis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. </em></strong> <em>To request an accommodation in completing an employment application due to a special need or a disability, please contact us at careers@otis.com.<br/><br/></em><strong>Privacy Policy and Terms:<br/><br/></strong>Click on this link to read the Policy and Terms", "responsibilities": "Must have the ability to lead and direct the field operations for a large volume of non-contract repair and hydraulic elevator modernization\nOpen order sales support, route control, scheduling and quality assurance\nMaintaining customer quality assurance; emphasis on safety, improving efficiencies, managing the expenditure of labor, materials and performance to estimate\nAbility to coordinate daily activities with the branch’s’ project manager and work well with general contractors, owner’s agency and developers for various modernization sites\nProviding technical support\nAuthorizing change orders\nDrive safety in the workplace", "qualifications": {"required": "3+ years of Elevator industry experience is required for candidates who do not have a college degree.\nCandidates must have excellent communication skills and be able to work in a highly team-oriented and dynamic environment.\nSelf-motivated individuals who have the ability to manage many simultaneous projects and responsibilities are a must.\nCandidates must have strong computer skills.\nExperience leading a team of technicians in the elevator or similar industry is strongly desired.", "preferred": "High school education, or equivalent required.\nAssociate or technical degree is a plus\nBA/BS degree in operations, construction management, general management, or similar degree preferred for candidates who do not have technical field experience"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958436446"}