{"jobTitle": "Senior Account Manager", "company": {"name": "EasyLlama", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "105,000.00/yr - 115,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "EasyLlama is revolutionizing the compliance solutions landscape with its suite of modern, interactive, and engaging products. We're leaving behind the outdated, costly, and uninspiring methods of compliance and embracing innovation to create safer, more positive, and inclusive workplaces. Our mobile-friendly platform meet employees where they are, fostering higher levels of engagement and alignment.<br/><br/>As the top-rated compliance solution provider, EasyLlama boasts a customer herd of over 7,000 satisfied clients. Our clientele includes industry leaders such as Shake Shack, Hilton, Skims, JiffyLube, and Y Combinator, with more joining our ranks every day. With a sparkling 4.7 rating on G2 from over 50 reviews, EasyLlama continues to set the standard for excellence in compliance solutions.<br/><br/>We're not just reshaping compliance training; we're reshaping the future of workplace compliance altogether. Join us as we lead the charge towards safer, more compliant, and more inclusive work environments.<br/><br/>Our Growth<br/><br/>At EasyLlama, we're thriving by focusing on innovation and customer-centric solutions, even in a challenging economy. Our commitment to delivering exceptional value has strengthened our customer relationships, leading to sustained growth and retention. To learn more about our growth check out this video from our CEO, Sam Devyver, celebrating our recognition on the prestigious Inc. 5000 list of the fastest-growing private companies in America for 2024.<br/><br/>The Role<br/><br/>To help us continue our mission, we are seeking an Senior Account Manager to retain and expand our top accounts and work with Fortune 1000 caliber clients. The right candidate will be responsible for executing strategic account plans to deliver maximum value to customers and be a trusted advisor. Manage complete existing customer lifecycle, building relationships with executive stakeholders as well as our day to day contacts. Be able to recognize challenges and proactively offer recommendations based on customer's specific needs and industry. Present and speak to HR and Compliance leaders about value delivered, mitigating risk, and pitching new features and offerings.<br/><br/><strong>What You'll Do:<br/><br/></strong><ul><li>Expand our largest accounts. You will have an upsell target and will hunt to identify new revenue streams in your book of business.</li><li>Manage renewals and mitigate risks to downsizing and churn.</li><li>Build a deep understanding of the EasyLlama product.</li><li>Manage the full lifecycle for existing customers: Ensure they are properly onboarded and supported by the CS team, that they are getting the maximum value from EasyLlama (based on their unique challenges within their org and industry), and that they are aware of new features and offerings.</li><li>Develop pipeline, manage account plans, create proposals and SOWs, and forecast for your book of business.</li><li>Develop a winning proactive account strategy in conjunction with the CS team.</li><li>Collaborate with Marketing on outbound campaigns within your book.</li><li>Collaborate with product and leadership to establish a GTM strategy.<br/><br/></li></ul><strong>Who You Are:<br/><br/></strong><ul><li>3 to 5+ years of enterprise quota-carrying SaaS account management </li><li>A hunter who can drive new outbound expansion strategy as well as maintain strong current relationships</li><li>Proven track record of exceeding NRR and bookings targets</li><li>Excellent communication and presentation skills, both spoken and written</li><li>Strong business acumen</li><li>Internally motivated and organized</li><li>Bonus points for working in eLearning or HR Tech<br/><br/></li></ul><strong>How We'll Take Care of You:</strong> <br/><br/><ul><li>Salary range:</li><ul><li>Base Compensation: $105,000 to $115,000</li><li>OTE (Total Compensation): $175,000 to $191,667</li></ul><li>Flexible, fully remote environment</li><li>Generous vacation time - Recharging is essential. We respect your time off and encourage it.</li><li>Competitive employer-sponsored health insurances</li><li>401(k) + company matching</li><li>Professional development reimbursements</li><li>Monthly remote work credit<br/></li></ul><strong>The Interview Process:<br/><br/></strong><ul><li>Recruiter Initial Screening</li><li>Hiring Manager Interview</li><li>Take Home Project / Assignment</li><li>Assignment Presentation </li><li>Final Interview</li><li>Reference Check<br/><br/></li></ul>The EasyLlama herd is fully remote, with employees distributed across the US and Canada. To ensure the best employee experience, we offer competitive compensation packages, comprehensive benefits, an annual wellness stipend, PTO, 401k with company matching, and monthly team events to nurture connection!<br/><br/>At EasyLlama, we strive to walk the walk. We are helping make workplaces all over the globe safer and more inclusive, including our own. We honor employees and candidates from all walks of life and all experiences, regardless of race, ethnicity, veteran status, disability, sexual orientation, gender identity or religion.", "responsibilities": "Expand our largest accounts. You will have an upsell target and will hunt to identify new revenue streams in your book of business.\nManage renewals and mitigate risks to downsizing and churn.\nBuild a deep understanding of the EasyLlama product.\nManage the full lifecycle for existing customers: Ensure they are properly onboarded and supported by the CS team, that they are getting the maximum value from EasyLlama (based on their unique challenges within their org and industry), and that they are aware of new features and offerings.\nDevelop pipeline, manage account plans, create proposals and SOWs, and forecast for your book of business.\nDevelop a winning proactive account strategy in conjunction with the CS team.\nCollaborate with Marketing on outbound campaigns within your book.\nCollaborate with product and leadership to establish a GTM strategy.", "qualifications": {"required": "3 to 5+ years of enterprise quota-carrying SaaS account management \nA hunter who can drive new outbound expansion strategy as well as maintain strong current relationships\nProven track record of exceeding NRR and bookings targets\nExcellent communication and presentation skills, both spoken and written\nStrong business acumen\nInternally motivated and organized\nBonus points for working in eLearning or HR Tech", "preferred": ""}, "skills": ["SaaS", "Account Management", "Sales", "Business Development", "Customer Relationship Management (CRM)", "Marketing", "Product Management", "eLearning", "HR Tech"], "postedDate": "2 months ago", "benefits": "Salary range:\nBase Compensation: $105,000 to $115,000\nOTE (Total Compensation): $175,000 to $191,667\nFlexible, fully remote environment\nGenerous vacation time - Recharging is essential. We respect your time off and encourage it.\nCompetitive employer-sponsored health insurances\n401(k) + company matching\nProfessional development reimbursements\nMonthly remote work credit", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3958005512"}