{"jobTitle": "Post Production Supervisor", "company": {"name": "Sony Pictures Animation", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "2000 to 3800/week", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Sony Pictures Animation is looking for a Post Production Supervisor responsible for an upcoming feature animation project. The Post Production Supervisor will collaborate with and manage communication between filmmakers, vendors, and Post executives.<br/><br/>Sony Pictures Animation is a pre-production animation studio based in Culver City, California, creating both feature animation and animated series with artists from around the world. We pride ourselves on empowering filmmakers to lead the creative process, and allowing the hand of the artist to be truly felt, with the goal of producing bold and innovative visual storytelling.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Work with Producers and Post executives to meet overall production scheduling and budget requirements.</li><li>Schedule and/or attend all post-related meetings and sessions, including mixes, reviews, ADR, color correction, QC, etc.</li><li>Manage the post schedule, making sure all scheduling and budgetary concerns are addressed and communicated to all relevant parties.</li><li>Identifying and vetting post facilities for sound, color, etc including requisitioning bids and negotiating rates.</li><li>Provide guidance as needed throughout the finishing stages of production through post production including facilitating communication with sound, music, and post houses.</li><li>Partners with internal Sony delivery departments as well as external distribution partners to coordinate the generation and completion of all post elements and deliverables.</li><li>Monitor the work on all phases of post, setting goals and shifting priorities as needed. Alert Producers and Post executives to any problems/concerns.</li><li>Responsible for keeping up to date on current and emerging technologies for Post Production processes and delivery.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>5+ years experience or equivalent in Post Production in a managerial role on a feature animation film</li><li>Demonstrated managerial experience, leading a team within a professional, fast-paced environment</li><li>Excellent attention to details and accuracy, strong time management and organization skills</li><li>Ability to work well independently and within a team, maintaining a positive attitude while anticipating, and proactively addressing, issues.</li><li>Demonstrated ability to prioritize, meet deadlines, change course of action quickly and maintain professionalism under pressure<br/><br/></li></ul>The anticipated base salary for this position is $2000 to $3800/week. This role may also qualify for incentives and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Animation is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.", "responsibilities": "Work with Producers and Post executives to meet overall production scheduling and budget requirements. Schedule and/or attend all post-related meetings and sessions, including mixes, reviews, ADR, color correction, QC, etc. Manage the post schedule, making sure all scheduling and budgetary concerns are addressed and communicated to all relevant parties. Identifying and vetting post facilities for sound, color, etc including requisitioning bids and negotiating rates. Provide guidance as needed throughout the finishing stages of production through post production including facilitating communication with sound, music, and post houses. Partners with internal Sony delivery departments as well as external distribution partners to coordinate the generation and completion of all post elements and deliverables. Monitor the work on all phases of post, setting goals and shifting priorities as needed. Alert Producers and Post executives to any problems/concerns. Responsible for keeping up to date on current and emerging technologies for Post Production processes and delivery.", "qualifications": {"required": "5+ years experience or equivalent in Post Production in a managerial role on a feature animation film, Demonstrated managerial experience, leading a team within a professional, fast-paced environment, Excellent attention to details and accuracy, strong time management and organization skills, Ability to work well independently and within a team, maintaining a positive attitude while anticipating, and proactively addressing, issues., Demonstrated ability to prioritize, meet deadlines, change course of action quickly and maintain professionalism under pressure"}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "This role may also qualify for incentives and/or comprehensive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958005120"}