{"jobTitle": "After School Program Leader: Part-Time, Culver City", "company": {"name": "After-School All-Stars, Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Education and Training", "industry": "Education Management", "description": "#Parttime #AfterSchool #Elementary #Zip90066 #CulverCity #DelRey #MarVista #Marina #Sports #Athletics #Soccer #Basketball #Dance #Cheer #Coach<br/><br/><strong>Hourly Rate is $19.50<br/><br/></strong><strong>Basic Assignment<br/><br/></strong>The Program Leader will assist in providing leadership and support in academic, cultural and recreational enrichment. Under the direct supervision of the ASAS-LA Program Coordinator, the Program Leader will provide a safe environment that educates, enlightens and inspires youth in a school setting.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> Experience working with students in grades K-12 in recreational, educational and/or community youth outreach setting.</li><li> Ability to work cooperatively and collaboratively with School District staff, parents and community leaders.</li><li> Familiarity with quality criteria for after school programs.</li><li> Ability to communicate effectively and demonstrate sensitivity to others as well as respond to critical incidents and act swiftly in an emergency situation.</li><li> CPR and First Aid Certifications.</li><li> Must be 18 years of age.</li><li> Must have obtained high school graduate or GED, have an Associates Degree, or have 60 completed college units or have successfully passed ASAS-LA Instructional Aide exam.</li><li> Criminal record clearance by being fingerprinted prior to working with youth.</li><li> Clearance of TB Test within 60 days of hire.</li><li> Physical ability to lead and participate in structured activities.</li><li> Fluency in a language other than English highly desirable.<br/><br/></li></ul><strong>Major Functions<br/><br/></strong><ul><li> Lead and assist in planning (prep time) &amp; implementation of the daily after-school program under the direction of a Program Coordinator.</li><li> Maintain a 20:1 ratio using dynamic student recruitment and retention strategies.</li><li> Lead and assist in preparing a creative environment using academic, cultural and recreational enrichment including the preparation of needed supplies and materials.</li><li> Use age appropriate methods that include youth development principles. Supervise students in the activity areas.</li><li> Maintain professional attitude, rapport and appearance with al program stakeholders.</li><li> Communicate with school staff, parents and other family members regarding program activities, student needs academic performance and events..</li><li> Attend all required staff meetings and trainings.</li><li> Escort/supervise youth to ASAS-LA field trips and events</li><li> Responsible for the distribution of supper/snack and daily attendance tracking.</li><li> Availability to work evenings and weekends if necessary.</li><li> Willing to travel off-site meetings, trainings and events.</li><li> To perform other duties as assigned.<br/><br/></li></ul>This job description is not intended to be all-inclusive. It is understood that the employee will also perform other reasonable related business duties if requested by the immediate supervisor or director. Job descriptions are reviewed periodically and may be revised if deemed necessary. This job description is not a written or implied contract.<br/><br/><strong> Equal Employment Opportunity</strong>", "postedDate": "2 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3958150368"}