{"jobTitle": "Clinical Diabetes Sales Specialist - Orange County, CA", "company": {"name": "Tandem Diabetes Care", "location": "Aliso Viejo, CA"}, "location": "Aliso Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "87,300.00/yr - $109,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Medical Equipment Manufacturing", "description": "GROW WITH US: <br/><br/>Tandem Diabetes Care creates new possibilities for people living with diabetes, their loved ones, and their healthcare providers through a positively different experience. We’d love for you to team up with us to “innovate every day,” put “people first,” and take a “no-shortcuts” approach that has propelled us to become a leader in the diabetes technology industry.<br/><br/>STAY AWESOME:<br/><br/>Tandem Diabetes Care is proud to manufacture and sell the t:slim X2 insulin pump with Control-IQ technology. We’re also so much more than that. Our company’s human-centered approach to design, development, and support delivers innovative products and services for people who use insulin. Since many of our own team members live with type 1 diabetes, or have a loved one impacted by diabetes, the work is personal, and we are committed to the cause. Learn more at tandemdiabetes.com.<br/><br/>A DAY IN THE LIFE:<br/><br/><ul><li>Please note that the candidate must reside in the Orange County area with ability to cover other parts of SoCa areas as needed*<br/><br/></li></ul>Directly responsible for the promotion and sale of Tandem Diabetes products and clinical services within an assigned territory in partnership with a Territory Manager (“territory sales team”). The territory sales team is expected to work together to plan and ensure achievement of sales goals through clinical acceptance of Tandem products’ insulin pump therapy. Identifies potential customers, establishes and develops business relationships to facilitate the sales of Tandem Diabetes' products and clinical services. Uses clinical expertise to provide account sales support and continuing education in direct contact to patients, physicians and their staff on the technical use of insulin pump therapy and special considerations related to pump therapy in the marketplace in order to generate sales. Promotes Tandem Diabetes products and services by providing additional education on topics such as diabetes self-management skills, emergency management and community resources as determined by client needs.<br/><br/>YOU’RE AWESOME AT:<br/><br/><ul><li>Covers assigned territory in partnership with Territory Manager to ensure the territory meets or exceeds company sales goals as established by Sales Management.</li><li>Develops successful strategies with assigned Territory Manager to address clinical concerns in the sales territory to ensure the sale of Tandem Diabetes products/services and to ensure the retention of existing relationships.</li><li>Efficiently uses available tools and resources to identify sales leads and gather the information required to determine if prospecting criteria have been satisfied.</li><li>Effectively promotes Tandem’s unique market position, approach and value to the prospect (e.g., ability to integrate/coordinate with providers, impact on claims or other outcomes, clinical and technical differentiation from competitors).</li><li>Provides information in a professional manner to various health care professionals (MDs, DOs, NPs, RNs, CDCEs, RPhs, etc.) in order to convince them to recommend/prescribe Tandem products/services when indicated in the course of appropriate therapy.</li><li>Creates value for the health care professionals by differentiating Tandem Diabetes Care products and clinical services.</li><li>Educates prospects/customers regarding industry/healthcare trends, web-based solutions, Tandem products, services and outcomes, and/or other population health management issues.</li><li>Schedules, delivers and coordinates product trainings in the assigned territory for patients, customers, and health care professionals (Certified Diabetes Care and Education Specialists, Endocrinologists) in order to familiarize patients, customers, and health care professionals with the benefits of Tandem Diabetes’ products and related services.</li><li>Completes all product training, documentation and communication with HCPs in a thorough and timely manner per company policy.</li><li>Establishes and maintains excellent professional relationships with health care professionals to support the sale of Tandem Diabetes products /services.</li><li>Responsible for initial and ongoing recertification of contracted and non-contracted Tandem Pump Trainers in the territory.</li><li>Conducts educational classes for patients through direct patient care that support diabetes education in relation to insulin pump therapy and other advanced diabetes management skills in order to gain prospective and retain existing customers.</li><li>Interacts with Regional Clinical Manager for guidance on technical and training issues.</li><li>Promotes sharing of relevant clinical information and trends with regional sales team.</li><li>Collaborates with Customer Technical Support Specialists and Clinical Support Specialist team to identify and address post-sale product issues, and additional patient education training needs.</li><li>Supports strategic business planning (i.e. forecasting and developing short term &amp; long term goals and objectives) for assigned Territory.</li><li>Provides products/services information directly to the consumer/end user via health fairs, conventions or in conjunction with promotions.</li><li>Attends and participates in all corporate sales training, sales meetings, and assigned conventions, trade shows and symposia.</li><li>Keeps records updated in the customer relationship management software (CRM), for all business dealings within assigned territory.</li><li>Maintains all assigned company property, equipment, records, selling aids and samples in a manner consistent with company policies.</li><li>Establishes and maintains a territory call cycle that will minimize administrative time and maximize time and effort spent with sales prospects and customers.</li><li>Prepares weekly and monthly clinical sales reports as requested by Sales Management within required deadlines.</li><li>Maintains expenses within established corporate guidelines and submits expense reports on a timely basis; exhibits personal integrity in dealing with all allowable business expenditures.</li><li>Confirms completion of required training plan before assuming job responsibilities.</li><li>Ensures work is performed in compliance with company policies including Privacy/HIPAA and other regulatory, legal, and safety requirements.<br/><br/></li></ul>EXTRA AWESOME:<br/><br/><ul><li>RN, RD or RPh or equivalent combination of education and applicable job experience.</li><li>Advanced Diabetes Education Professional Credential (Certified Diabetes Care and Education Specialist (CDCES) or Board Certified, Advanced Diabetes Management (BC-ADM) certified or eligible.</li><li>Maintenance of registration and licensure through clinical education.</li><li>Continuing education on patient education on the technical use of diabetes technology and special considerations related to pump therapy in the marketplace.</li><li>2 years’ experience coordinating and conducting patient education on the technical use of diabetes technology (experience with video remote education preferred).</li><li>Demonstrated ability to effectively communicate as a clinical expert to patients and HCPs</li><li>1 year of related diabetes/endocrinology industry experience preferred.</li><li>Excellent communication skills regarding diabetes self-management skills, proper use of diabetes technology devices and therapies, carbohydrate counting instruction, medication management, chronic complications, emergency management and community resources.</li><li>Ability to relate effectively with patients, referral sources and health care professionals.</li><li>Demonstrated ability to effectively communicate as a clinical expert on diabetes, diabetes technology, Automated Insulin Delivery, and diabetes management software systems to patients and health care providers.</li><li>Demonstrated ability to coach customers on a one on one basis to answer questions and resolve product related issues.</li><li>Demonstrated ability to effectively communicate with customers to resolve issues and answer questions according to company protocols and requirements.</li><li>Skilled at presenting educational material in a clear, concise manner to various audiences.</li><li>Skilled at contributing on a consistent basis to team initiatives in a thorough and timely manner.</li><li>Able to react to changing situations in a timely, calm, and confident manner.</li><li>Ability to work in a fast paced, ever changing market and see change as an opportunity to improve business performance and campaigning for it when necessary.</li><li>Proficient in Microsoft Office Suite and Internet with CRM software familiarity preferred.</li><li>Able to travel in the assigned territory at least 80% of the time and work from a remote home office; must maintain valid driver’s license and required auto insurance as well as good driving record, per company policy.</li><li>Ability to travel by car or airplane independently in the field at least 80% of the time and work after hours if required by travel schedule or business issues. Due to direct patient contact, current negative Tuberculosis Testing and annual Tuberculosis screening with documented proof is required. Due to requirements of some health systems and/or local municipalities, vaccines, including COVID-19 vaccine, may be a requirement of this role. Reasonable accommodations will be considered as requested. <br/><br/></li></ul>WHAT’S IN IT FOR YOU?<br/><br/>In addition to innovative technology, we have a culture that fosters the idea that the happiest people are the most productive people. Not only do we hire forward-thinking achievers to join our workforce; we reward, develop, and retain them too. Just one of the many reasons of how we #StayAwesome! To learn more about our culture and benefits please visit https://www.tandemdiabetes.com/careers.<br/><br/>BE YOU, WITH US!<br/><br/>Tandem is firmly committed to being an equal opportunity employer and maintaining a diverse and inclusive environment. We value and embrace that every single one of us brings value to the table. But sometimes we forget that when we don’t meet 100% of a job description’s criteria – maybe you’re feeling that way right now? We encourage you to apply anyway. Because we want you to be you, with us.<br/><br/>COMPENSATION &amp; BENEFITS: <br/><br/>The starting base pay range for this position is $87,300 - $109,000 annually plus incentive compensation (commission-based compensation is based on the achievement of goals). Base pay will vary based on job-related knowledge, skills, experience and may also fluctuate depending on candidate’s location and the overall job market. In addition to base pay, Tandem offers a competitive compensation package that includes equity, and a robust benefits package. Learn more about Tandem’s benefits here!<br/><br/>YOU SHOULD KNOW: <br/><br/>Potential new employees must successfully complete a drug screen (excludes marijuana) and background check which includes criminal search, education certification and employment verification prior to hire.<br/><br/>Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.<br/><br/>The position will be posted until a final candidate is selected for the requisition or the requisition has a sufficient number of applications.<br/><br/>REFERRALS: <br/><br/>We love a good referral! If you know someone that would be a great fit for this position, please share!<br/><br/>If you are applying for this job and live in California, please read Tandem’s CCPA Notice: </strong>https://www.tandemdiabetes.com/careers/california-consumer-privacy-act-notice-for-job-applicants.<br/><br/>", "responsibilities": "<ul><li>Covers assigned territory in partnership with Territory Manager to ensure the territory meets or exceeds company sales goals as established by Sales Management.</li><li>Develops successful strategies with assigned Territory Manager to address clinical concerns in the sales territory to ensure the sale of Tandem Diabetes products/services and to ensure the retention of existing relationships.</li><li>Efficiently uses available tools and resources to identify sales leads and gather the information required to determine if prospecting criteria have been satisfied.</li><li>Effectively promotes Tandem’s unique market position, approach and value to the prospect (e.g., ability to integrate/coordinate with providers, impact on claims or other outcomes, clinical and technical differentiation from competitors).</li><li>Provides information in a professional manner to various health care professionals (MDs, DOs, NPs, RNs, CDCEs, RPhs, etc.) in order to convince them to recommend/prescribe Tandem products/services when indicated in the course of appropriate therapy.</li><li>Creates value for the health care professionals by differentiating Tandem Diabetes Care products and clinical services.</li><li>Educates prospects/customers regarding industry/healthcare trends, web-based solutions, Tandem products, services and outcomes, and/or other population health management issues.</li><li>Schedules, delivers and coordinates product trainings in the assigned territory for patients, customers, and health care professionals (Certified Diabetes Care and Education Specialists, Endocrinologists) in order to familiarize patients, customers, and health care professionals with the benefits of Tandem Diabetes’ products and related services.</li><li>Completes all product training, documentation and communication with HCPs in a thorough and timely manner per company policy.</li><li>Establishes and maintains excellent professional relationships with health care professionals to support the sale of Tandem Diabetes products /services.</li><li>Responsible for initial and ongoing recertification of contracted and non-contracted Tandem Pump Trainers in the territory.</li><li>Conducts educational classes for patients through direct patient care that support diabetes education in relation to insulin pump therapy and other advanced diabetes management skills in order to gain prospective and retain existing customers.</li><li>Interacts with Regional Clinical Manager for guidance on technical and training issues.</li><li>Promotes sharing of relevant clinical information and trends with regional sales team.</li><li>Collaborates with Customer Technical Support Specialists and Clinical Support Specialist team to identify and address post-sale product issues, and additional patient education training needs.</li><li>Supports strategic business planning (i.e. forecasting and developing short term &amp; long term goals and objectives) for assigned Territory.</li><li>Provides products/services information directly to the consumer/end user via health fairs, conventions or in conjunction with promotions.</li><li>Attends and participates in all corporate sales training, sales meetings, and assigned conventions, trade shows and symposia.</li><li>Keeps records updated in the customer relationship management software (CRM), for all business dealings within assigned territory.</li><li>Maintains all assigned company property, equipment, records, selling aids and samples in a manner consistent with company policies.</li><li>Establishes and maintains a territory call cycle that will minimize administrative time and maximize time and effort spent with sales prospects and customers.</li><li>Prepares weekly and monthly clinical sales reports as requested by Sales Management within required deadlines.</li><li>Maintains expenses within established corporate guidelines and submits expense reports on a timely basis; exhibits personal integrity in dealing with all allowable business expenditures.</li><li>Confirms completion of required training plan before assuming job responsibilities.</li><li>Ensures work is performed in compliance with company policies including Privacy/HIPAA and other regulatory, legal, and safety requirements.<br/><br/></li></ul>", "qualifications": {"required": "RN, RD or RPh or equivalent combination of education and applicable job experience.", "preferred": "Advanced Diabetes Education Professional Credential (Certified Diabetes Care and Education Specialist (CDCES) or Board Certified, Advanced Diabetes Management (BC-ADM) certified or eligible., Maintenance of registration and licensure through clinical education., Continuing education on patient education on the technical use of diabetes technology and special considerations related to pump therapy in the marketplace., 2 years’ experience coordinating and conducting patient education on the technical use of diabetes technology (experience with video remote education preferred)., Demonstrated ability to effectively communicate as a clinical expert to patients and HCPs, 1 year of related diabetes/endocrinology industry experience preferred., Excellent communication skills regarding diabetes self-management skills, proper use of diabetes technology devices and therapies, carbohydrate counting instruction, medication management, chronic complications, emergency management and community resources., Ability to relate effectively with patients, referral sources and health care professionals., Demonstrated ability to effectively communicate as a clinical expert on diabetes, diabetes technology, Automated Insulin Delivery, and diabetes management software systems to patients and health care providers., Demonstrated ability to coach customers on a one on one basis to answer questions and resolve product related issues., Demonstrated ability to effectively communicate with customers to resolve issues and answer questions according to company protocols and requirements., Skilled at presenting educational material in a clear, concise manner to various audiences., Skilled at contributing on a consistent basis to team initiatives in a thorough and timely manner., Able to react to changing situations in a timely, calm, and confident manner., Ability to work in a fast paced, ever changing market and see change as an opportunity to improve business performance and campaigning for it when necessary., Proficient in Microsoft Office Suite and Internet with CRM software familiarity preferred., Able to travel in the assigned territory at least 80% of the time and work from a remote home office; must maintain valid driver’s license and required auto insurance as well as good driving record, per company policy., Ability to travel by car or airplane independently in the field at least 80% of the time and work after hours if required by travel schedule or business issues. Due to direct patient contact, current negative Tuberculosis Testing and annual Tuberculosis screening with documented proof is required. Due to requirements of some health systems and/or local municipalities, vaccines, including COVID-19 vaccine, may be a requirement of this role. Reasonable accommodations will be considered as requested. <br/><br/>"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "The starting base pay range for this position is $87,300 - $109,000 annually plus incentive compensation (commission-based compensation is based on the achievement of goals). Base pay will vary based on job-related knowledge, skills, experience and may also fluctuate depending on candidate’s location and the overall job market. In addition to base pay, Tandem offers a competitive compensation package that includes equity, and a robust benefits package. Learn more about Tandem’s benefits here!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958823455"}