{"jobTitle": "Manager, Influencer", "company": {"name": "United Entertainment Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Public Relations and Information Technology", "industry": "Public Relations and Communications Services and IT Services and IT Consulting", "description": "UEG is an award-winning global agency that specializes in making brands famous. We create breakthrough marketing campaigns by partnering brands with the people, properties, and platforms that shape pop-culture. Our business specializes in the entertainment, sports, and lifestyle space and provides a full suite of services that include celebrity engagements, influencer programming, music-film-tv/digital-sports partnerships, communications, branded content, and experiential.   <br/><br/>The team at UEG is a dynamic group, bringing together best-in-class expertise across entertainment, sports, and lifestyle, paired with a strong understanding of brand building and effective marketing communications. This is a fast-paced high-performance environment where we combine passion for culture with the innate desire to create industry-changing work for our clients.  <br/><br/>We are searching for a dynamic individual who believes in the power of influencer partnerships to create impactful, genuine brand experiences for our clients. We value meaningful collaborations and need someone who can expertly match the right voices with our diverse range of brands. In this fast-paced environment, we seek a proactive professional with a strong perspective on the influencer landscape and a keen eye for emerging trends. The ideal candidate will have experience working with top-tier influencers on a global scale and a deep enthusiasm for blending pop culture with consumer brands. Join us and lead the charge in shaping the future of brand storytelling through the influential voices of today.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Strategically identify influencers for brand campaigns and programs, in a way that helps maximize ROI and will hit brand KPIs.  </li><li>Negotiation with influencers for campaigns and brand programs.  </li><li>Conduct thorough vetting of potential influencers to ensure alignment with client values and mitigate any risks, maintaining a strong emphasis on safeguarding brand reputation and ensuring compliance with all relevant standards. </li><li>Campaign management and execution, which includes ongoing communication between client, brand teams, and influencers, ensuring deadlines are hit, deliverables are completed, etc.   </li><li>Create client-facing case studies and wrap-up reports after completing brand campaigns and activations, which include any relevant metrics. Offer qualitative and quantitative rationale for influencer campaign performance.  </li><li>Manage existing relationships within the digital influencer community (MCN’s, Influencer Agencies, Content Creators, Media Platforms, etc.) Consistently fielding and building pitch decks for potential new business opportunities and existing agency cliental  </li><li>Educates UEG colleagues and sister agencies on the latest news within the digital influencer landscape  </li><li>Assist in the creation of influencer contracts with a strong knowledge in Federal Trade Commission Guidelines (FTC) and standard deal points  </li><li>In conjunction with internal partners and agencies, contribute content ideas that can express appropriate key brand messaging points in ways that can resonate with the targeted consumer and demographic  </li><li>Provides client service administration including preparing client status and activity reports, attending meetings and conference calls and compiling competitor coverage  </li><li>Serves as Project Manager on accounts who will handle financial forecasting, budget parameters, OOP spending, PO submission, SAG-related paperwork, job codes and ensuring all invoices are paid in a timely matter   </li><li>Stays up to date with emerging technologies, trends and influencers <br/><br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>A bachelor’s degree in a relevant field from an accredited college or university  </li><li>At least 3 years’ relevant agency experience  </li><li>Understands key client information including business strategy, industry issues, products and services, key customers and competitors  </li><li>Excellent writing and communications skills with attention to detail  </li><li>Experience identifying and securing influencers for brand campaigns  </li><li>Social Media Maven – You’re on top of trends and plugged into the digital community   </li><li>Exceptional knowledge about not only top tier influencers, but also emerging and YouTube channels on the rise  </li><li>Strong relationships with influencer representatives.   </li><li>Ability to think creatively on your feet and take initiative to improve or create effective processes  </li><li>Solid knowledge of industry-leading digital analytics platforms and can navigate with ease  </li><li>Demonstrates strong work ethic and the ability to provide quality work to clients and teams   </li><li>Strong interpersonal, organizational and written and oral communications skills  </li><li>Thrive in a fast-paced environment <br/><br/><br/></li></ul>$42,000 - $63,000 a year<br/><br/>An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "responsibilities": "Strategically identify influencers for brand campaigns and programs, in a way that helps maximize ROI and will hit brand KPIs.  \nNegotiation with influencers for campaigns and brand programs.  \nConduct thorough vetting of potential influencers to ensure alignment with client values and mitigate any risks, maintaining a strong emphasis on safeguarding brand reputation and ensuring compliance with all relevant standards. \nCampaign management and execution, which includes ongoing communication between client, brand teams, and influencers, ensuring deadlines are hit, deliverables are completed, etc.   \nCreate client-facing case studies and wrap-up reports after completing brand campaigns and activations, which include any relevant metrics. Offer qualitative and quantitative rationale for influencer campaign performance.  \nManage existing relationships within the digital influencer community (MCN’s, Influencer Agencies, Content Creators, Media Platforms, etc.) Consistently fielding and building pitch decks for potential new business opportunities and existing agency cliental  \nEducates UEG colleagues and sister agencies on the latest news within the digital influencer landscape  \nAssist in the creation of influencer contracts with a strong knowledge in Federal Trade Commission Guidelines (FTC) and standard deal points  \nIn conjunction with internal partners and agencies, contribute content ideas that can express appropriate key brand messaging points in ways that can resonate with the targeted consumer and demographic  \nProvides client service administration including preparing client status and activity reports, attending meetings and conference calls and compiling competitor coverage  \nServes as Project Manager on accounts who will handle financial forecasting, budget parameters, OOP spending, PO submission, SAG-related paperwork, job codes and ensuring all invoices are paid in a timely matter   \nStays up to date with emerging technologies, trends and influencers <br/><br/><br/>", "qualifications": {"required": "A bachelor’s degree in a relevant field from an accredited college or university  \nAt least 3 years’ relevant agency experience  \nUnderstands key client information including business strategy, industry issues, products and services, key customers and competitors  \nExcellent writing and communications skills with attention to detail  \nExperience identifying and securing influencers for brand campaigns  \nSocial Media Maven – You’re on top of trends and plugged into the digital community   \nExceptional knowledge about not only top tier influencers, but also emerging and YouTube channels on the rise  \nStrong relationships with influencer representatives.   \nAbility to think creatively on your feet and take initiative to improve or create effective processes  \nSolid knowledge of industry-leading digital analytics platforms and can navigate with ease  \nDemonstrates strong work ethic and the ability to provide quality work to clients and teams   \nStrong interpersonal, organizational and written and oral communications skills  \nThrive in a fast-paced environment <br/><br/><br/>", "preferred": ""}, "skills": ["ROI", "KPI", "FTC", "SAG"], "postedDate": "2 weeks ago", "salary": {"amount": "42,000.00 - 63,000.00", "currency": "USD"}, "benefits": "An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959212556"}