{"jobTitle": "Recycling and Materials Coordinator", "company": {"name": "Caltech", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "66,560 - 80,800", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Research Services", "description": "Caltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.<br/><br/><strong>Job Summary<br/><br/></strong>Caltech Sustainability is looking for a creative and passionate candidate to fill the role of Recycling &amp; Materials Coordinator. The employee will help the Sustainability Program, Campus Buildings and Grounds, Caltech Dining, Procurement, and various other campus departments to reduce waste, identify resource conservation opportunities, and improve overall campus materials efficiency. The ideal candidate will assist with a wide variety of waste and materials efficiency projects in areas including but not limited to food service, campus laboratories, and Institute procurement. Experience working in research environments, good communication skills, creative initiative, and a passion for sustainability are key attributes of a successful Recycling &amp; Materials Coordinator. This position reports directly to the Sustainability Manager.<br/><br/><strong>Essential Job Duties<br/><br/></strong><ul><li> Responsible for following all safety procedures and maintaining a safe and secure work environment. </li><li>Work with principal investigators, post-doctorate researchers, staff, and students on implementing waste reduction and materials efficiency initiatives.</li><li>Facilitate monthly waste billing payments and chargebacks to appropriate entities on campus.</li><li>Analyze campus waste trends and develop programs and procedures that maximize diversion and value to Caltech.</li><li>Consult with laboratory leadership, Buildings and Grounds, Dining, Procurement, Facilities, EH&amp;S, and other relevant Caltech departments on supportive measures for various sustainability initiatives.</li><li>Identify upstream waste reduction opportunities in coordination with Caltech Procurement and other departments.</li><li>Provide value to Facilities Operations through effective waste management and materials procurement strategies.</li><li>Post promotional materials for sustainability initiatives in approved areas with consent from appropriate stakeholders.</li><li>Ensure consistent implementation across the entire Caltech campus.</li><li>Demonstrate creative initiative in devising sustainability programs that support Caltech’s sustainability goals.</li><li>Facilitate outreach to all stakeholders to ensure knowledge of and agreement on waste reduction and materials efficiency projects.</li><li>Assist Caltech in participating in waste certifications, competitions, or other similar programs.</li><li>Create and support programs for sustainable behaviors that benefit Caltech’s bottom line.</li><li>Quantify impact of all sustainability efforts in various environmental, fiscal, and social categories.</li><li>Analyze data as needed to support various sustainability reporting requirements.</li><li>Report to Sustainability Manager on project progress.</li><li>Assist in other planning and sustainability efforts, as necessary.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s degree (preferred Master’s) in sustainability or related field.</li><li>1-3 years of work experience in sustainability or related field.</li><li>Experience working in research environments.</li><li>Demonstrated passion for reducing waste and improving organizational efficiency.</li><li>Good networking skills.</li><li>Leadership experience and attitude.</li><li>Ability to work independently and take initiative on increasingly complex and technical projects.</li><li>Ability to manage multiple projects at once and deliver results on time.</li><li>Data analytics skills including basic ROI calculations.</li><li>Wear PPE as required while working in lab settings.</li><li>Microsoft Office experience.<br/><br/></li></ul><strong>Required Documents<br/><br/></strong><ul><li>Resume.<br/><br/></li></ul><strong> Hiring Range <br/><br/></strong>$66,560 - $80,800 Per Year<br/><br/>The salary of the finalist(s) selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training.<br/><br/>As one of the largest employers in Pasadena, CA, Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time. Learn more about our<br/><br/><strong> EEO Statement <br/><br/></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, or national origin, disability status, protected veteran status, or any other characteristic protected by law.<br/><br/>Caltech is a VEVRAA Federal Contractor.<br/><br/>To read more Equal Employment Opportunity (EEO) go to eeoc_self_print_poster.pdf.<br/><br/><strong> Disability Accommodations <br/><br/></strong>If you would like to request an accommodation in completing this application, interviewing, or otherwise participating in the employee selection process, please direct your inquiries to Caltech Recruiting at", "responsibilities": "Responsible for following all safety procedures and maintaining a safe and secure work environment. Work with principal investigators, post-doctorate researchers, staff, and students on implementing waste reduction and materials efficiency initiatives. Facilitate monthly waste billing payments and chargebacks to appropriate entities on campus. Analyze campus waste trends and develop programs and procedures that maximize diversion and value to Caltech. Consult with laboratory leadership, Buildings and Grounds, Dining, Procurement, Facilities, EH&amp;S, and other relevant Caltech departments on supportive measures for various sustainability initiatives. Identify upstream waste reduction opportunities in coordination with Caltech Procurement and other departments. Provide value to Facilities Operations through effective waste management and materials procurement strategies. Post promotional materials for sustainability initiatives in approved areas with consent from appropriate stakeholders. Ensure consistent implementation across the entire Caltech campus. Demonstrate creative initiative in devising sustainability programs that support Caltech’s sustainability goals. Facilitate outreach to all stakeholders to ensure knowledge of and agreement on waste reduction and materials efficiency projects. Assist Caltech in participating in waste certifications, competitions, or other similar programs. Create and support programs for sustainable behaviors that benefit Caltech’s bottom line. Quantify impact of all sustainability efforts in various environmental, fiscal, and social categories. Analyze data as needed to support various sustainability reporting requirements. Report to Sustainability Manager on project progress. Assist in other planning and sustainability efforts, as necessary. Perform other duties as assigned.", "qualifications": {"required": "Bachelor’s degree (preferred Master’s) in sustainability or related field. 1-3 years of work experience in sustainability or related field. Experience working in research environments. Demonstrated passion for reducing waste and improving organizational efficiency. Good networking skills. Leadership experience and attitude. Ability to work independently and take initiative on increasingly complex and technical projects. Ability to manage multiple projects at once and deliver results on time. Data analytics skills including basic ROI calculations. Wear PPE as required while working in lab settings. Microsoft Office experience.", "preferred": "Master’s degree in sustainability or related field."}, "skills": ["Sustainability", "Waste Reduction", "Materials Management", "Data Analysis", "Project Management", "Communication", "Leadership", "Research", "Microsoft Office"], "postedDate": "1 month ago", "benefits": "Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959824265"}