{"jobTitle": "Senior Buyer, Meat", "company": {"name": "Weee!", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "75,000.00/yr - 105,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Technology, Information and Internet, Food and Beverage Retail, and Food and Beverage Manufacturing", "description": "***Position will required Mon-Fri onsite. Role can be based in La Mirada, CA or Clifton, NJ***<br/>\n\n**About Weee!**<br/>\n\nWeee! is the largest and fastest-growing ethnic e-grocer in the United States, operating in one of the largest underserved categories in retail with affordable access to exciting ethnic food. By partnering with local suppliers, redesigning the value chain and leveraging social buying, Weee! is reshaping the grocery business entirely. You can read more about us on Business Insider, Reuters and TechCrunch.<br/>\n\nWeee! is headquartered in Fremont, CA, and is currently available coast to coast with exceptional growth (5x YoY) across geographies, categories and ethnicities. We have raised $800M+ in funding to date from leading investors including Softbank Vision Funds, DST, Blackstone, Tiger Global, Lightspeed Ventures, Goodwater Capital, XVC and iFly. The opportunity now is to join a rocketship as we prepare for the next stage of growth, and an eventual public listing.<br/>\n\nPosition Overview<br/>\n\nThe Meat Senior Buyer is responsible for sourcing, negotiating, and procuring meat products to\nmeet the company's quality, cost, and inventory objectives. This role requires strong analytical\nskills, supplier management experience, and an in-depth understanding of the meat industry. The\nMeat Senior Buyer will work closely with suppliers, internal stakeholders, and the procurement\nteam to ensure a consistent and high-quality supply of meat products.<br/>\n\n**Key Responsibilities**\n Supplier Sourcing and Management:\no Identify, evaluate, and select suppliers to ensure the best quality, price, and\nservice.\no Build and maintain strong relationships with key suppliers to secure reliable\nsupply chains.\no Conduct regular supplier performance reviews and audits to ensure compliance\nwith company standards.<br/>\n\n **Negotiation and Contract Management:**\no Negotiate prices, terms, and contracts with suppliers to achieve the best value for\nthe company.\no Develop and manage supplier agreements, including terms of delivery, quality\nstandards, and payment terms.\no Ensure contracts are compliant with legal and regulatory requirements.<br/>\n\n **Market Analysis and Strategy:**\no Analyze market trends, pricing, and supply chain dynamics to make informed\npurchasing decisions.\no Develop and implement procurement strategies to optimize cost, quality, and\navailability of meat products.\no Monitor industry developments and emerging trends to stay ahead of market\nchanges.<br/>\n\n** Inventory and Supply Chain Management:**\no Collaborate with the inventory management team to maintain optimal stock\nlevels.\no Ensure timely delivery of products to meet production schedules and avoid\nstockouts.\no Implement strategies to minimize waste and manage perishable products\neffectively.<br/>\n\n **Quality Assurance:**\no Work with quality assurance teams to ensure that all meat products meet the\ncompany's quality standards.\no Address and resolve any quality issues with suppliers promptly.\no Stay updated on food safety regulations and ensure supplier compliance.<br/>\n\n **Financial Management:**\no Manage the meat procurement budget and track expenses to ensure cost-\neffectiveness.\no Monitor and report on key performance indicators (KPIs) related to procurement\nactivities.\no Identify cost-saving opportunities and implement initiatives to reduce\nprocurement costs.<br/>\n\n **Cross-Functional Collaboration:**\no Work closely with procurement, marketing, Supply Chain, and ethnicity teams to\nensure alignment and effective execution of category plans.\no Provide insights and recommendations based on market and supplier analysis.<br/>\n\n**Qualifications**\n Education and Experience:\no Bachelor’s degree in Supply Chain Management, Business Administration,\nAgriculture, or a related field. A master’s degree is a plus.\no Minimum of 5 years of experience in procurement or buying, preferably in the\nmeat or food industry.\no Proven experience in supplier negotiations and contract management.<br/>\n\n **Skills and Competencies:**\no Strong negotiation and communication skills.\no Excellent analytical and problem-solving abilities.\no Proficiency in procurement software and inventory management systems.\no Knowledge of meat products, market trends, and supply chain best practices.\no Ability to work independently and as part of a team.<br/>\n\n **Personal Attributes:**\no Detail-oriented with strong organizational skills.\no Ability to manage multiple priorities and meet deadlines.\no Proactive and results-driven with a focus on continuous improvement.\no Strong ethical standards and integrity.<br/>\n\n**Working Conditions**\n This position may require occasional travel to supplier locations, industry conferences,\nand company facilities.\n Must be able to work flexible hours, including some evenings and weekends, to meet\nbusiness needs.<br/>\n\n**Benefits**\n<ul><li>Comprehensive health insurance package, including medical, dental, and vision. PPO/HMO packages</li><li>401k, 4% company match</li><li>Equity</li><li>Annual bonus plan</li><li>Vacation and holiday time off</li><li>Monthly mobile stipend</li><li>Monthly Weee! Points credits</li></ul><br/>\n\n**Compensation Range**\n<ul><li>The US base salary range for this full-time position is $75,000-105,000</li><li>This role may be eligible to discretionary bonus, incentives and benefits </li><li>Our salary ranges are determined by role, level, and location</li></ul>\nThe range displayed on each job posting reflects the minimum and maximum base salary for new hires for the position across all US locations. Within the range, individual pay is determined by multiple factors like job-related skills, experience and work locations. Your recruiter can share more about the specific salary range during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include any variable compensation elements.<br/>\n\nFor more jobs and to find out more about Weee!, visit our career page: https://about.sayweee.com/careers\n\nSoftbank Vision Funds", "responsibilities": "The Meat Senior Buyer is responsible for sourcing, negotiating, and procuring meat products to\nmeet the company's quality, cost, and inventory objectives. This role requires strong analytical\nskills, supplier management experience, and an in-depth understanding of the meat industry. The\nMeat Senior Buyer will work closely with suppliers, internal stakeholders, and the procurement\nteam to ensure a consistent and high-quality supply of meat products.", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Business Administration,\nAgriculture, or a related field. A master’s degree is a plus.\nMinimum of 5 years of experience in procurement or buying, preferably in the\nmeat or food industry.\nProven experience in supplier negotiations and contract management.", "preferred": "Strong negotiation and communication skills.\nExcellent analytical and problem-solving abilities.\nProficiency in procurement software and inventory management systems.\nKnowledge of meat products, market trends, and supply chain best practices.\nAbility to work independently and as part of a team."}, "skills": ["Supplier Management", "Procurement", "Negotiation", "Supply Chain Management", "Market Analysis", "Inventory Management", "Quality Assurance", "Financial Management", "Cross-Functional Collaboration"], "postedDate": "1 day ago", "benefits": "Comprehensive health insurance package, including medical, dental, and vision. PPO/HMO packages\n401k, 4% company match\nEquity\nAnnual bonus plan\nVacation and holiday time off\nMonthly mobile stipend\nMonthly Weee! Points credits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959510633"}