{"jobTitle": "Demand Planning Analyst", "company": {"name": "ChromaDex", "location": "Tustin, CA"}, "location": "Tustin, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "60,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wellness and Fitness Services", "description": "Join our TRU Crew!<br/><br/>ChromaDex Corp. (NASDAQ:CDXC) is a global bioscience company dedicated to healthy aging. Our scientists’ partner with leading universities and research institutions worldwide to discover, develop, and create solutions to positively impact human health. Our flagship ingredient, NIAGEN® nicotinamide riboside, is backed by clinical and scientific research. Our consumer product is TRU NIAGEN® which safely and effectively increases NAD levels, a vital cellular resource, that supports healthy living and improving the way we age.<br/><br/>We need smart, collaborative people to help us build the next frontier bioscience company dedicated to enabling wellness and well-being for every demographic. Our culture encourages and supports continuous learning and improvement while helping individuals and teams achieve their full potential. We embrace diversity and inclusivity while promoting equality and fairness in the workplace.<br/><br/>We are a flexible hybrid work environment with offices in Westwood CA, Tustin CA, and Longmont CO. We are dog friendly and people friendly, too!<br/><br/>Who are you?<br/><br/><ul><li> Whip smart - we’re looking for candidates with a keen intellect who quickly learn what they don’t know</li><li> Adaptable – Able to apply yourself on a wide variety of tasks on a daily basis</li><li> Analytical - Can assess and leverage systems and processes to figure out more effective ways to get things done</li><li> Hustle - Someone with a sense of urgency who does what it takes to get the best results</li><li> Passionate – Yes! About collaborating, about problem-solving, and about making a difference</li><li> You’re an ACE! – Great Attitude, Commitment to success, and Ethics in how you work and how you think<br/><br/><br/></li></ul>What’s the Role:<br/><br/>We’re looking for a Supply Chain Demand Forecast Analyst. This role requires the ability to analyze historical data, market trends, and other relevant factors to develop accurate demand forecasts for products or services. Your insights will play a crucial role in optimizing inventory levels, reducing costs, and ensuring that the organization meets customer demands efficiently. This role requires a combination of analytical skills, industry knowledge, and effective communication to collaborate with various stakeholders within the organization.<br/><br/>What you’ll do:<br/><br/><ul><li> Analyze historical sales data, market trends, and customer demand patterns</li><li> Utilize statistical models and forecasting techniques to predict future demand</li><li> Develop and maintain accurate demand forecasts for different products</li><li> Collaborate with cross-functional teams to gather relevant information for forecasting adjustments</li><li> Work closely with sales, marketing, and production teams to gather insights and align forecast with business goals</li><li> Identify opportunities to improve supply chain efficiency and reduce carrying costs</li><li> Track forecast accuracy and make continuous improvements based on performance metrics</li><li> Provide regular reports and updates on forecast accuracy, variances, and other relevant KPIs</li><li> Utilize forecasting software and tools to enhance accuracy and efficiency</li><li> Stay updated on advancements in demand planning and forecasting technologies</li><li> Stay informed about industry trends, competitor activities, and market changes that may impact demand</li><li> Incorporate market intelligence into forecasting models</li><li> Generate regular reports for management, highlighting key insights and recommendations<br/><br/><br/></li></ul>What we need from you:<br/><br/><ul><li> Bachelor’s degree in Supply Chain Management, Logistics, Business, or a related field recommended</li><li> 3+ years in demand planning / forecasting with a proven track record of achieving forecast accuracy</li><li> Excellent communication, writing, and interpersonal skills</li><li> Proficiency in statistical analysis and forecasting tools</li><li> Proficient with MS Office, and advanced Excel skills</li><li> Strong analytical and problem-solving skills</li><li> Ability to work collaboratively in a cross-functional team environment</li><li> Knowledge of newest industry trends, emerging technologies, and best practices in demand planning</li><li> Utilize good judgment with the ability to learn on the fly, can be nimble, and able to work independently<br/><br/><br/></li></ul>The salary range for this position is $60,000-$75,000. We offer health benefits, a matching 401(k), paid holidays, flexible time off (FTO) and more.<br/><br/>This is a hybrid role in our beautiful Tustin office. We are dog friendly!<br/><br/>Who we are:<br/><br/>We are an equal opportunity employer that operates with an emphasis that People Matter. We respect and will consider every and all kinds of people regardless of race, color, religion, sex, sexual orientation, gender identity, age, natural origin, protected veteran status, disability, or any other factors prohibited by law or humanity.", "responsibilities": "<ul><li> Analyze historical sales data, market trends, and customer demand patterns</li><li> Utilize statistical models and forecasting techniques to predict future demand</li><li> Develop and maintain accurate demand forecasts for different products</li><li> Collaborate with cross-functional teams to gather relevant information for forecasting adjustments</li><li> Work closely with sales, marketing, and production teams to gather insights and align forecast with business goals</li><li> Identify opportunities to improve supply chain efficiency and reduce carrying costs</li><li> Track forecast accuracy and make continuous improvements based on performance metrics</li><li> Provide regular reports and updates on forecast accuracy, variances, and other relevant KPIs</li><li> Utilize forecasting software and tools to enhance accuracy and efficiency</li><li> Stay updated on advancements in demand planning and forecasting technologies</li><li> Stay informed about industry trends, competitor activities, and market changes that may impact demand</li><li> Incorporate market intelligence into forecasting models</li><li> Generate regular reports for management, highlighting key insights and recommendations<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li> Bachelor’s degree in Supply Chain Management, Logistics, Business, or a related field recommended</li><li> 3+ years in demand planning / forecasting with a proven track record of achieving forecast accuracy</li><li> Excellent communication, writing, and interpersonal skills</li><li> Proficiency in statistical analysis and forecasting tools</li><li> Proficient with MS Office, and advanced Excel skills</li><li> Strong analytical and problem-solving skills</li><li> Ability to work collaboratively in a cross-functional team environment</li><li> Knowledge of newest industry trends, emerging technologies, and best practices in demand planning</li><li> Utilize good judgment with the ability to learn on the fly, can be nimble, and able to work independently<br/><br/><br/></li></ul>"}, "skills": ["Supply Chain Management", "Logistics", "Business", "Demand Planning", "Forecasting", "Statistical Analysis", "MS Office", "Excel", "Analytical Skills", "Problem Solving", "Collaboration", "Communication", "Writing", "Interpersonal Skills"], "postedDate": "1 month ago", "benefits": "We offer health benefits, a matching 401(k), paid holidays, flexible time off (FTO) and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959575879"}