{"jobTitle": "Senior Analyst, Procurement Partnerships", "company": {"name": "Chipotle Mexican Grill", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$84,000.00 - $117,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Restaurants", "description": "<strong>CULTIVATE A BETTER WORLD</strong><br/><br/>Food served fast does not have to be a typical fast-food experience. Chipotle has always done things differently, both in and out of our restaurants. We are changing the face of fast food, starting conversations, and directly supporting efforts to shift the future of farming and food. We hope you will join us as we continue to learn, evolve, and shape what comes next on our mission to make better food accessible to everyone.<br/><br/><strong>THE OPPORTUNITY</strong><br/><br/>As the Senior Analyst, Procurement Partnerships on the New Ventures team at Chipotle, you will have the opportunity to help grow Chipotle's success. Under supervision, your primary responsibilities will consist of communicating needs to existing vendors, working cross-functionally to onboard new vendors, ensure suppliers are consistently meeting Chipotle's standards, and communicate schedules across various departments. You'll have the opportunity to work on a variety of projects of moderate scope and create initial analyses for review by stakeholders or procurement/supply chain leadership.<br/><br/><strong>WHAT YOU’LL DO</strong><br/><br/><ul><li>Interface with cross functional areas, including Food Safety and Quality Assurance, Culinary, and third-party partnership team members to meet program deliverables and cost targets.</li><li>With Manager, develop and implement strategy for effective supplier pool base for international direct and indirect procurement.</li><li>For assigned projects: participate in planning meetings and product evaluations with all stakeholders and recommend potential changes.</li><li>Perform category analysis, assisting in development of strategies, presenting to stakeholders, and implementing to minimize supply chain risk.</li><li>Gain and demonstrate knowledge on underlying supply markets and understand impacts.</li><li>Identify and put in place appropriate SRM (Supplier Relationship Management) interventions including supplier management activities around supplier reviews.</li><li>Keep a watchful eye on the market, environment and the changing needs of the business and identify when action is needed in response to any change in a category.</li><li>Assist in managing stakeholder and 3rd party partnership relationships.</li><li>Assist in forecasting and demand planning for our partnership markets.</li></ul><br/><br/><strong>WHAT YOU’LL BRING TO THE TABLE</strong><br/><br/><ul><li>Bachelor's Degree (BA/BS) from 4-year college or university required. M.B.A. preferred.</li><li>3-5 years of strategic sourcing/procurement experience required.</li><li>Supply chain management related certification: CPIM, CPSM, CSCP, six sigma, etc. (Preferred)</li><li>Assist in developing sourcing hypothesis and strategies to help maximize company objectives.</li><li>Assist in activating and managing cross-functional teams to validate, implement and achieve sourcing goals.</li><li>Measure value captured, monitor and report on supplier performance.</li><li>Work with Legal to develop and review contract terms and conditions for suppliers and advise internal business stakeholders.</li><li>Manage and be a point of contact for supplier relationships focusing on supply risk mitigation, contract compliance, and cost fluctuations.</li><li>Study market trends and conditions, supply markets and changes, and use results to enable Chipotle’s strategic objectives.</li><li>Work with other Supply Chain functions and assist in managing Chipotle DC product cost, inventory, and logistics.</li></ul><br/><br/><strong>WHO WE ARE</strong><br/><br/>Chipotle Mexican Grill, Inc. (NYSE: CMG) is cultivating a better world by serving responsibly sourced, classically cooked, real food with wholesome ingredients without artificial colors, flavors or preservatives. Chipotle had over 3,400 restaurants as of December 31, 2023, in the United States, Canada, the United Kingdom, France and Germany and is the only restaurant company of its size that owns and operates all its restaurants in North America and Europe. Chipotle is ranked on the Fortune 500 and is recognized on Fortune's Most Admired Companies 2024 list and Time Magazine's Most Influential Companies. With over 115,000 employees passionate about providing a great guest experience, Chipotle is a longtime leader and innovator in the food industry. Chipotle is committed to making its food more accessible to everyone while continuing to be a brand with a demonstrated purpose as it leads the way in digital, technology and sustainable business practices. For more information or to place an order online, visit WWW.CHIPOTLE.COM.<br/><br/><strong>PAY TRANSPARENCY</strong><br/><br/><em>A reasonable estimate of the current base salary range for this position is $84,000 - $117,000. You are also eligible for annual cash bonuses and equity awards based upon performance and other factors. Actual compensation offered may vary depending on skill level, experience, and/or education. Chipotle offers a competitive total rewards package, which includes medical, dental, and vision insurance, 401k, sick leave, vacation time, and much more. Visit https://jobs.chipotle.com/benefits</em><br/><br/><em>Chipotle Mexican Grill is an equal opportunity employer that values diversity at all levels. As a people-first company rooted in values, our purpose extends beyond serving nutritious food using real ingredients. It means hiring world-class individuals and fostering a culture that champions diversity, ensures equity, and celebrates inclusion. All qualified applicants, regardless of personal characteristics, are encouraged to apply. </em><br/><br/><em>Qualified applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and/or certain state or local laws. Please contact ADAaccommodations@chipotle.com if you need an accommodation due to a disability to complete an application, job interview, and/or to otherwise participate in the hiring process. </em><strong><em>This email does not respond to non-accommodations related requests.</em></strong></p>", "responsibilities": "<ul><li>Interface with cross functional areas, including Food Safety and Quality Assurance, Culinary, and third-party partnership team members to meet program deliverables and cost targets.</li><li>With Manager, develop and implement strategy for effective supplier pool base for international direct and indirect procurement.</li><li>For assigned projects: participate in planning meetings and product evaluations with all stakeholders and recommend potential changes.</li><li>Perform category analysis, assisting in development of strategies, presenting to stakeholders, and implementing to minimize supply chain risk.</li><li>Gain and demonstrate knowledge on underlying supply markets and understand impacts.</li><li>Identify and put in place appropriate SRM (Supplier Relationship Management) interventions including supplier management activities around supplier reviews.</li><li>Keep a watchful eye on the market, environment and the changing needs of the business and identify when action is needed in response to any change in a category.</li><li>Assist in managing stakeholder and 3rd party partnership relationships.</li><li>Assist in forecasting and demand planning for our partnership markets.</li></ul>", "qualifications": {"required": "Bachelor's Degree (BA/BS) from 4-year college or university required. M.B.A. preferred.\n3-5 years of strategic sourcing/procurement experience required.\nSupply chain management related certification: CPIM, CPSM, CSCP, six sigma, etc. (Preferred)", "preferred": "Assist in developing sourcing hypothesis and strategies to help maximize company objectives.\nAssist in activating and managing cross-functional teams to validate, implement and achieve sourcing goals.\nMeasure value captured, monitor and report on supplier performance.\nWork with Legal to develop and review contract terms and conditions for suppliers and advise internal business stakeholders.\nManage and be a point of contact for supplier relationships focusing on supply risk mitigation, contract compliance, and cost fluctuations.\nStudy market trends and conditions, supply markets and changes, and use results to enable Chipotle’s strategic objectives.\nWork with other Supply Chain functions and assist in managing Chipotle DC product cost, inventory, and logistics."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Chipotle offers a competitive total rewards package, which includes medical, dental, and vision insurance, 401k, sick leave, vacation time, and much more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959515625"}