{"jobTitle": "Manager, Client Experience, California", "company": {"name": "Van Cleef & Arpels", "industry": "Retail Luxury Goods and Jewelry", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Strategy/Planning, and Consulting", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>Are you a good match? <br/><br/></strong>The ideal candidate for this role is required to have a bachelor’s degree in a related field. Minimum 4-5 years of working in management in a luxury, hospitality and/or events environment is preferred. Strong understanding of providing luxury service and exceptional experiences. Excellent organizational, planning and time management skills. Ability to handle multiple projects simultaneously and is comfortable and successful in a fast-paced environment. This candidate is also required to have knowledge of CRM strategy and work closely with client databases. We are also looking for strong computer skills, excellent communication, networking, and interpersonal skills. Ability to travel is a must.<br/><br/><strong>What are we expecting from you? <br/><br/></strong>Reporting to the Senior Manager of Client Experience, you will be responsible for guaranteeing the level of experience offered to clients across touchpoints and deploys the Maison client experience, client treatment and satisfaction strategies at regional level. He/She digests &amp; adapts guidelines to build the regional programming and adhoc propositions for our clients. This role will build strong partnerships and relationships within the region and local communities to best support the client treatment needs of the boutique and to monitor the Client satisfaction locally. The role will focus on creating client treatments for West Region clients both in and out of the boutiques in the Region.<br/><br/><strong>In This Role, You Will<br/><br/></strong><strong>Ensure that boutiques teams have all the tools to nourish the client experience by researching, sourcing and vetting appropriate vendors and/or locations for treatments and hospitality partnership<br/><br/></strong><ul><li></li><ul><li>Share and animate hospitality guidelines (hosting, waiting time management,) to ensure the right level of experience, capitalizing on all boutique spaces</li><li>Ensure with the retail operation team the right usage of tools in boutiques (incl. regular visits / refresh in boutique, training)</li><li>Manage F&amp;B selection in boutiques, in line with Maison guidelines, quality and service</li><li>Coordinate and follow consumption and orders of client experience tools (certificate holder.)</li><li>Support boutiques in their daily challenges regarding client experience<br/></li></ul></ul><strong>Accompany markets in the deployment of the Client Experience and Treatment strategy (in collaboration with CRM, HJ &amp; Comm team)<br/><br/></strong><ul><li></li><ul><li>Define local treatment planning in line with the strategic plan guidelines and local objectives, in collaboration with local counterparts </li><li>Participate in the definition of the client HJ event strategy: invitations, treatment</li><li>For in-boutique animations and ad-hoc treatment, support the boutique in the design and implementation of the activation</li><li>For local event / animation, participate in the preparation of the event with the local event team (incl. building a pool of vendors), incl. the welcome of foreign clients<br/></li></ul></ul><strong>Client Gifting management <br/><br/></strong><ul><li></li><ul><li>Develop guidelines and best practices as it pertains to client experience moments aligned with company objectives including, but not limited to, private appointments, gifting ceremonies and additional needs of the boutiques.</li><li>Deploy gifting guidelines, coordinate orders and local sourcing when necessary</li><li>Coordinate operational deployment of gifting campaigns and analyze the results to improve return on investment<br/></li></ul></ul><strong>Client Satisfaction monitoring<br/><br/></strong><ul><li></li><ul><li>Monitor &amp; follow-up Barometer results by and with boutiques, as well as Mystery Shopping (with Retail Expertise team)</li><li>Coordinate response (close the loop) where necessary, across all channels</li><li>Work with Training to tackle identified pain points<br/></li></ul></ul><strong>Ensure the planning and monitoring of the client Experience activity<br/><br/></strong><ul><li></li><ul><li>Structure and follow-up A&amp;P and S&amp;D budget according to the local plan and in challenging partnership with the region</li><li>Provide consolidated reporting on the local events activity over the year (best practice reports, client satisfaction follow-up, client acquisition.)<br/></li></ul></ul><strong>More than a role…we recruit for a career!<br/><br/></strong>By joining Van Cleef and Arpels, you will be part of a Maison where employee career development is at the heart of our ambition. Upon your arrival, you will be immersed in our enchanting world with trainings on our history, know-how as well as trainings about our creations.<br/><br/><strong>The Recruitment Process<br/><br/></strong>Please submit an application on-line. If your profile matches our search criteria, you will be contacted by the Talent Acquisition team for an interview. The recruitment process will consist of several interviews at various levels of the organization. Applicants must have valid work authorization for employment in the USA. Salary will be negotiated based on skills and prior work experience.<br/><br/>Richemont offers a generous compensation and benefits package for eligible employees.<br/><br/><strong>We Offer<br/><br/></strong>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.<br/><br/>Expected Salary Range- $105k - $115k<br/><br/>This role is eligible for annual bonus<br/><br/>", "responsibilities": "Reporting to the Senior Manager of Client Experience, you will be responsible for guaranteeing the level of experience offered to clients across touchpoints and deploys the Maison client experience, client treatment and satisfaction strategies at regional level. He/She digests &amp; adapts guidelines to build the regional programming and adhoc propositions for our clients. This role will build strong partnerships and relationships within the region and local communities to best support the client treatment needs of the boutique and to monitor the Client satisfaction locally. The role will focus on creating client treatments for West Region clients both in and out of the boutiques in the Region.", "qualifications": {"required": "The ideal candidate for this role is required to have a bachelor’s degree in a related field. Minimum 4-5 years of working in management in a luxury, hospitality and/or events environment is preferred. Strong understanding of providing luxury service and exceptional experiences. Excellent organizational, planning and time management skills. Ability to handle multiple projects simultaneously and is comfortable and successful in a fast-paced environment. This candidate is also required to have knowledge of CRM strategy and work closely with client databases. We are also looking for strong computer skills, excellent communication, networking, and interpersonal skills. Ability to travel is a must."}, "skills": ["CRM", "Hospitality", "Management", "Luxury", "Event Management", "Communication", "Networking", "Interpersonal Skills", "Time Management", "Organization", "Computer Skills", "Travel"], "postedDate": "2 weeks ago", "benefits": "Richemont offers a generous compensation and benefits package for eligible employees.<br/><br/>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.", "salary": {"amount": "105,000.00 - 115,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3959276919"}