{"jobTitle": "Technical Knowledge Manager", "company": {"name": "Crunchyroll", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Entertainment Providers", "description": "<strong>About Crunchyroll<br/><br/></strong>WE HELP EVERYONE BELONG. IT’S OUR PURPOSE.<br/><br/>Founded by fans, Crunchyroll delivers the art and culture of anime to a passionate community. We super-serve over 100 million anime and manga fans across 200+ countries and territories, and help them connect with the stories and characters they crave. Whether that experience is online or in-person, streaming video, theatrical, games, merchandise, events and more, it’s powered by the anime content we all love.<br/><br/>Join our team, and help us shape the future of anime!<br/><br/><strong>About The Role<br/><br/></strong>In the role of a Technical Knowledge Manager, you will report to the Senior Manager of Global Knowledge Management.<br/><br/>We are considering applicants for the location(s) of Dallas, TX or Culver City, LA.<br/><br/>We are looking for an accomplished and experienced Technical Knowledge Manager to join our team. You will manage our knowledge management system within Zendesk, ensuring seamless access to information and optimizing our self-service capabilities. We ask that you understand Zendesk, are proficient in content management, and enjoy enhancing the user experience.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Manage administrative tasks including access management, taxonomy management, context mapping, publication workflows, and knowledge base configuration</li><li>Oversee connected experiences such as chatbots, self-service portals, and webforms</li><li>Implement and maintain custom integrations using APIs/SDKs to facilitate smooth knowledge transfer between systems</li><li>Use HTML, CSS, and JavaScript to enhance the look and feel of the user interface</li><li>Configure and maintain reporting by partners, which may include connecting to data warehouses, BI tools, or using Zendesk’s native dashboards</li><li>Analyze search queries and user interactions to identify content gaps and areas for improvement</li><li>Create content within the Zendesk Knowledge Base.</li><li>Develop and implement strategies to improve self-service capabilities and reduce the number of support tickets</li><li>Develop a system for tracking and monitoring the use of knowledge resources<br/><br/></li></ul><strong>About You<br/><br/></strong>We get excited about candidates, like you, because...<br/><br/><ul><li>You have 5+ years of experience in knowledge management</li><li>You have a deep understanding of knowledge management systems and its capabilities</li><li>You have experience configuring access management, taxonomy management, context mapping, publication workflows and knowledge base configuration.</li><li>You have experience in web development, specifically with HTML, CSS, and JavaScript</li><li>You have a general understanding of how APIs work</li><li>You have experience managing knowledge repositories, training courses, and organizational knowledge processes</li><li>You have experience with BI tools (i.e. Tableau or Mixpanel<br/><br/></li></ul><strong>About The Team<br/><br/></strong>The Crunchyroll Customer Experience (CX) Global Knowledge Management team is a new pillar within the CX organization responsible for the creation, management, and evolution of both internal and external knowledge. Our goal is to provide our agents and customers with information at their fingertips to provide the best in class service and self-service respectively. We are expanding and growing the team with leaders and authors to curate relevant content for all our users promptly. We aim to collaborate with all partners to stay abreast with any new changes within Crunchyroll.<br/><br/>Why you will love working at Crunchyroll<br/><br/>In addition to getting to work with fun, passionate and inspired colleagues, you will also enjoy the following benefits and perks:<br/><br/><ul><li>Receive a great compensation package including salary plus performance bonus earning potential, paid annually.</li><li>Flexible time off policies allowing you to take the time you need to be your whole self.</li><li>Generous medical, dental, vision, STD, LTD, and life insurance</li><li>Health Saving Account HSA program</li><li>Health care and dependent care FSA</li><li>401(k) plan, with employer match</li><li>Employer paid commuter benefit</li><li>Support program for new parents</li><li>Pet insurance and some of our offices are pet friendly!<br/><br/><br/><br/></li></ul>The Pay Range for this position is listed. Actual pay will vary based on factors including, but not limited to location, experience, and performance. The range listed is just one component of Crunchyroll’s Total Rewards offerings for employees. Other rewards may include performance bonuses, employer matched retirement savings, time-off programs, and progressive health benefits and perks.<br/><br/>Pay Transparency - Culver City, CA<br/><br/>$71,060—$88,825 USD<br/><br/><strong>About Our Values<br/><br/></strong>We want to be everything for someone rather than something for everyone and we do this by living and modeling our values in all that we do. We value<br/><br/><ul><li>Courage. We believe that when we overcome fear, we enable our best selves. </li><li>Curiosity. We are curious, which is the gateway to empathy, inclusion, and understanding. </li><li>Service. We serve our community with humility, enabling joy and belonging for others. </li><li>Kaizen. We have a growth mindset committed to constant forward progress. <br/><br/></li></ul>Our commitment to diversity and inclusion<br/><br/>Our mission of helping people belong reflects our commitment to diversity &amp; inclusion. It's just the way we do business.<br/><br/>We are an equal opportunity employer and value diversity at Crunchyroll. Pursuant to applicable law, we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/>Crunchyroll, LLC is an independently operated joint venture between US-based Sony Pictures Entertainment, and Japan's Aniplex, a subsidiary of Sony Music Entertainment (Japan) Inc., both subsidiaries of Tokyo-based Sony Group Corporation.<br/><br/><em>Questions about Crunchyroll’s hiring process? Please check out our Hiring FAQs: </em><em>https://help.crunchyroll.com/hc/en-us/articles/360040471712-Crunchyroll-Hiring-FAQs<br/><br/></em>Please beware of recent scams to online job seekers. Those applying to our job openings will only be contacted directly from @crunchyroll.com email account.<br/><br/>", "responsibilities": "<ul><li>Manage administrative tasks including access management, taxonomy management, context mapping, publication workflows, and knowledge base configuration</li><li>Oversee connected experiences such as chatbots, self-service portals, and webforms</li><li>Implement and maintain custom integrations using APIs/SDKs to facilitate smooth knowledge transfer between systems</li><li>Use HTML, CSS, and JavaScript to enhance the look and feel of the user interface</li><li>Configure and maintain reporting by partners, which may include connecting to data warehouses, BI tools, or using Zendesk’s native dashboards</li><li>Analyze search queries and user interactions to identify content gaps and areas for improvement</li><li>Create content within the Zendesk Knowledge Base.</li><li>Develop and implement strategies to improve self-service capabilities and reduce the number of support tickets</li><li>Develop a system for tracking and monitoring the use of knowledge resources<br/><br/></li></ul>", "qualifications": {"required": "You have 5+ years of experience in knowledge management\nYou have a deep understanding of knowledge management systems and its capabilities\nYou have experience configuring access management, taxonomy management, context mapping, publication workflows and knowledge base configuration.\nYou have experience in web development, specifically with HTML, CSS, and JavaScript\nYou have a general understanding of how APIs work\nYou have experience managing knowledge repositories, training courses, and organizational knowledge processes\nYou have experience with BI tools (i.e. Tableau or Mixpanel<br/><br/>", "preferred": ""}, "skills": ["Zendesk", "Content Management", "HTML", "CSS", "JavaScript", "APIs", "BI Tools", "Tableau", "Mixpanel"], "postedDate": "2 weeks ago", "benefits": "<ul><li>Receive a great compensation package including salary plus performance bonus earning potential, paid annually.</li><li>Flexible time off policies allowing you to take the time you need to be your whole self.</li><li>Generous medical, dental, vision, STD, LTD, and life insurance</li><li>Health Saving Account HSA program</li><li>Health care and dependent care FSA</li><li>401(k) plan, with employer match</li><li>Employer paid commuter benefit</li><li>Support program for new parents</li><li>Pet insurance and some of our offices are pet friendly!<br/><br/><br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959191902"}