{"jobTitle": "HRBP/ HR Manager", "company": {"name": "COL Group Co., Ltd.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources and Administrative", "industry": "Internet Marketplace Platforms, Technology, Information and Media, and Entertainment Providers", "description": "Based in Pasadena (on-stie)\n\nResponsibilities\n\n* Responsible for the human resources work of the US office, including recruitment, employee onboarding and off boarding procedures, job transfers, and related paperwork;\n* Responsible for the atmosphere of the US team, plan and execute various employee care activities according to employee needs and corporate culture;\n* Responsible for the office environment of the US office, ensure timely and effective support and maintenance for daily operations, provide a comfortable working environment for employees;\n* Perform other tasks as assigned by the leadership.\n\nQualifications\n\n* More than 5 years of local human resources and administrative work experience in the United States, familiar with US human resource management and office environment construction-related laws and regulations;\n* Integrity and optimism, good interpersonal communication and coordination ability, can create a positive work atmosphere for the team;\n* Strong stress resistance, can adapt to high-intensity work pressure, and also have outstanding execution ability to ensure efficient work;\n* Fluent in English, good listening, speaking, reading and writing skills, can effectively carry out cross-cultural communication.\n\nIf you are interested in this position and meet the above requirements, we warmly welcome you to join our team. We will provide competitive salary and excellent career development opportunities. We look forward to your application!", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3959329008"}