{"jobTitle": "Senior Manager, Client Development and Experience California", "company": {"name": "Van Cleef & Arpels", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Strategy/Planning, and Consulting", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>Are you a good match? <br/><br/></strong>For this role, we are looking for the ideal candidate to have a bachelor’s degree. Minimum 6 years of related work experience. Events and Client Experience in the luxury retail environment is a plus. The ideal candidate is required to have a strong understanding of providing luxury service and exceptional experience for VCA customers. We are looking for someone who constantly seeks new and creative ways to meet the changing needs of our clients. Excellent organizational, communication, and computer skills, especially in Microsoft Excel are required, as well as solid analytical skills and strong aptitude to work with figures. This candidate is required to have previous experience managing a small team. Excellent interpersonal skills with a service-oriented attitude. Previous knowledge of SAP is a plus.<br/><br/><strong>What are we expecting from you? <br/><br/></strong>Reporting to the Regional Director, you are responsible for the implementation of the Maison Client strategy in its market. Based on a thorough and detailed knowledge of local clients, you are expected to build a dedicated action plan to adapt and deploy the Maison initiatives in client development, experience and satisfaction. You are expected to align with all local teams to guarantee consistency with the Maison strategy and is accountable for creating and implementing a client strategy in the West region’s boutiques, by rolling out the loyalty programs developed by Corporate, installing the Regional Director’s strategies, and supporting the sales team in enhancing their client outreach. This person will be responsible for enhancing a service-oriented boutique environment, rolling out CRM initiatives as well as analyzing their business impact. The Senior Manager relays the Maison’s Client Development vision to their region of responsibility and brings forward the region’s needs and feedback. This position closely collaborates with the Corporate CRM team to understand the Region’s database and identify opportunities.<br/><br/><strong>In This Role, You Will<br/><br/></strong><strong>Develop a detailed knowledge of the local clientele and build dedicated and appropriate action plans to develop client portfolio <br/><br/></strong><ul><li>Based on Maison dashboards, analyze client data and develop a thorough knowledge of the local client portfolio. Monitor the local client portfolio evolution &amp; client performance and identify opportunities for development </li><li>Build qualitative insights and escalade (to the Region) local needs in terms of specific analysis &amp; tools evolutions</li><li>Build the development strategy for each store of the region by setting client KPIs for the year (detail KPIs to the right granularity)and define action plans to achieve them and monitor results</li><li>Ensure and supervise qualitative data collection through all touchpoints for clients &amp; prospects. Assign and reassign clients to ref SA when necessary.</li><li>Animate the local Client community involving boutique staff (inc. daily dialogue with boutique teams, involvement in morning briefs and contribution to newsletter) <br/><br/></li></ul><strong>Deploy client activation and clienteling strategy and adapt when necessary to local needs &amp; context<br/><br/></strong><ul><li>Promote 1-to-many contact plan and escalate local needs / opportunities</li><li>Is responsible for the implementation of all clienteling tools and programs in their area </li><li>Manage all local clienteling opportunities – orchestrate opportunities in line with Maison strategy and upon regional validation </li><li>Define action plan for key priority clients, responsible for the on-going education of the Sales Associates on the evolution of their client base, set objectives for different client segments and assist with opportunities for key moments throughout the year</li><li>Coach &amp; support boutiques and Sales teams in implementing the Clienteling strategy - Roll-out client-related programs, guidelines &amp; tools (inc. Clienteling app and HJ app) </li><li>Give feedback on all Clienteling toolboxes (asset, guidelines, tools…) , escalate needs</li><li>Place order for client gifting in line with client portfolio (relational and seasonal)<br/><br/></li></ul><strong>Be responsible for the Client Experience and roll-out client-related programs, guidelines &amp; tools<br/><br/></strong><ul><li>Manage F&amp;B selection in boutiques, in line with Maison quality and service. Coordinate orders with Retail operations </li><li>Escalate local needs (ex: gift &amp; animation initiatives…) if necessary </li><li>Mange gifting campaigns in line with guidelines </li><li>Coordinate client treatment with teams (incl VIP) <br/><br/></li></ul><strong>Monitor client Satisfaction in market<br/><br/></strong><ul><li>Monitor &amp; follow-up Barometer results with boutiques. Follow Mystery Shopping fieldwork and results with Retail Expertise team</li><li>Coordinate “close the loop”. Work with Training to tackle identified pain points and share best practices.<br/><br/></li></ul>The Client Development Senior Manager will oversee the Client Development Manager and Client Experience Manager for the West Region. The role is responsible for ensuring proper roll out of all Loyalty programs and CRM initiatives in the different boutiques of the region in collaboration with Store Management, Sales Associates, and the Corporate CRM team. Additionally, the role collaborates with management and the corporate office to decide on gifting campaign strategies, liaise with the CRM team to offer feedback, report ROI, and suggest new gifting. The Client Development Senior Manager must comply with confidentiality and security guidelines as well as comply with all template requests from headquarters.<br/><br/><strong>More than a role…we recruit for a career!<br/><br/></strong>By joining Van Cleef and Arpels, you will be part of a Maison where employee career development is at the heart of our ambition. Upon your arrival, you will be immersed in our enchanting world with trainings on our history, know-how as well as trainings about our creations.<br/><br/><strong>The Recruitment Process<br/><br/></strong>Please submit an application on-line. If your profile matches our search criteria, you will be contacted by the Talent Acquisition team for an interview. The recruitment process will consist of several interviews at various levels of the organization. Applicants must have valid work authorization for employment in the USA. Salary will be negotiated based on skills and prior work experience.<br/><br/>Richemont offers a generous compensation and benefits package for eligible employees.<br/><br/><strong>We Offer<br/><br/></strong>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.<br/><br/>Expected Salary Range- $115k-$125k<br/><br/>This role is annual bonus eligible.<br/><br/>", "salary": {"amount": "115,000.00/yr - 125,000.00/yr", "currency": "USD"}, "postedDate": "2 weeks ago", "skills": ["Microsoft Excel", "CRM", "SAP", "Luxury Retail", "Client Development", "Clienteling", "Client Experience", "Loyalty Programs", "CRM Initiatives", "Sales", "Team Management", "Communication", "Organizational Skills", "Analytical Skills", "Interpersonal Skills", "Service-Oriented Attitude"], "benefits": "Richemont offers a generous compensation and benefits package for eligible employees.<br/><br/>We Offer<br/><br/>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959282029"}