{"jobTitle": "Merchandising Intern", "company": {"name": "GOOD AMERICAN", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "description": "Good American is the first fully inclusive fashion brand that celebrates all dimensions of female power. Offering quality, style, and substance in every size — 00-32, we are committed to challenging industry norms by empowering all women to feel sexy and confident no matter their size or shape. The brand was launched in October 2016, by Emma Grede and Khloé Kardashian, to empower all women to celebrate their bodies with confidence by offering high-quality designs in all sizes. What started as the largest denim launch in history, has evolved into an iconic and inclusive fashion line of denim, ready-to-wear, swim, shoes and activewear.<br/><br/>We are seeking a motivated and detail-oriented Merchandising Intern to join our team. This role will provide valuable hands-on experience in the dynamic field of merchandising within the fashion industry. The intern will support various aspects of sample management, administrative tasks, and cross-functional collaboration.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Create and maintain a comprehensive sample log at the beginning of each season. This log will include essential details such as sizes received, discrepancy notes, and sample Estimated Time of Arrivals (ETAs).</li><li>Collaborate closely with the Product Development team to request samples, monitor ETAs, and coordinate sample hand-offs to relevant departments.</li><li>Fulfill sample requests from cross-functional teams promptly and accurately. Track outgoing samples and manage returns efficiently.</li><li>Prepare and tag samples for cross-functional meetings, ensuring all necessary items are organized and ready for use.</li><li>Take responsibility for ordering all samples from the Distribution Center (DC) and ensure timely return of products as per guidelines.</li><li>Support in seasonal research.</li><li>Administrative tasks like, data entry, expenses and outlook calender invites.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Currently enrolled in a degree or program, preferably in Fashion Merchandising, Business Administration, or a related field.</li><li>Strong organizational skills with a keen eye for detail.</li><li>Effective communication skills, both written and verbal.</li><li>Ability to prioritize tasks and manage time effectively in a fast-paced environment.</li><li>Proficiency in Microsoft Office suite (Excel, Word, Outlook).</li><li>Prior experience in a retail or fashion environment is a plus, but not required.<br/><br/></li></ul>Please note that this role requires to be onsite four days a week.<br/><br/>Good American participate in company-wide initiatives to advance social and environmental performance, such as sustainability training, DEI training, volunteering, or participation in internal committees.<br/><br/>WE ARE B CORP CERTIFIED!!!<br/><br/>As our business has grown so has our responsibility to our community, our planet and our business. Being B Corp certified means we will continue to put people and planet up there with profit.", "jobFunction": "Education and Training", "industry": "Retail Apparel and Fashion", "postedDate": "1 week ago", "qualifications": {"required": "Currently enrolled in a degree or program, preferably in Fashion Merchandising, Business Administration, or a related field.\nStrong organizational skills with a keen eye for detail.\nEffective communication skills, both written and verbal.\nAbility to prioritize tasks and manage time effectively in a fast-paced environment.\nProficiency in Microsoft Office suite (Excel, Word, Outlook).\nPrior experience in a retail or fashion environment is a plus, but not required.", "preferred": ""}, "skills": [], "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3959596671"}