{"jobTitle": "Compensation & Benefits Tax Senior Associate - Remote Eligible", "company": {"name": "Eide Bailly LLP", "industry": "Accounting, IT Services and IT Consulting, and Computer and Network Security", "location": "Rancho Cucamonga, CA"}, "location": "Rancho Cucamonga, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$70,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Accounting", "description": "Who We Are<br/><br/>Eide Bailly is one of the top 25 CPA and business advisory firms in the nation. We have over 41 offices in 15 states across the Midwest and western United States, and offer our staff and Partners the opportunity to serve a variety of industries. Founded in 1917, our culture is the foundation of who we are, and we pride ourselves on supporting our employees to help them achieve their goals and pursue their interests both in the office and at home. At Eide Bailly we are passionate about the clients we serve, the work we do, and most importantly, having fun while we do it!<br/><br/><strong><em>Why You'll Love Working Here<br/><br/></em></strong>At Eide Bailly we believe respect is how to treat everyone, not just those you want to impress. Our culture focuses on collaboration to achieve career growth. Innovation is highly encouraged, which is where programs like our EB Xchange originate. This program allows interested tax and audit employees to complete a rotation into a specialty area. We promote happy employees by making work/life balance a priority along with being actively involved in our communities. Our dedication to service can be seen through the Firm's decision to match charitable donations made by employees, as well as providing opportunities to volunteer throughout the year. Most importantly, we like to have fun! We offer a professional and fun work environment with frequent free lunches, snacks, lunch and learns, socials, contests, outings and other events.<br/><br/>Eide Bailly's Compensation and Benefits practice group is looking for a candidate with experience in consulting on retirement plans, welfare plans and executive compensation arrangements.<br/><br/><em><strong>Typical Day in the Life<br/><br/></strong></em>A typical day as a Compensation &amp; Benefits Tax Senior Associate might include the following:<br/><br/><ul><li>Provides consulting services for compensation and benefits taxation and ERISA compliance.</li><li>Assesses tax and ERISA issues regarding the establishment, implementation and ongoing administration of both single and multi-employer retirement and welfare benefit plans.</li><li>Consults on issues related to tax-qualified and non-tax-qualified retirement plans and executive compensation arrangements, such as 401(k) plans, traditional defined benefit plans, insured annuity programs and nonqualified deferred compensation plans, as well as issues related to welfare benefit programs, including insured medical plans, healthcare reimbursement accounts and flexible spending accounts.</li><li>Performs research on technical tax and ERISA issues and prepares written communications summarizing and analyzing the research.</li><li>Monitors and analyzes new legislative, regulatory, and administrative comp and benefits tax and ERISA developments.</li><li>Drafts employee benefit plan participant communications and forms.</li><li>Reviews and negotiates service provider agreements relating to ERISA plan investments, as well as plan administration and consulting services.</li><li>Assists with IRS and DOL compliance filings for benefit plans.</li><li>Analyze prohibited transaction and other benefit plan fiduciary issues.<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>You have a Bachelor’s Degree in Accounting or J.D. required; J.D. with LL.M. in Taxation preferred.</li><li>You have a valid Certified Public Accountant license preferred, but not required if JD.</li><li>You have 2+ years of experience in compensation and benefits tax</li><li>You have knowledge of complex compensation and benefits tax issues.</li><li>You have excellent communication skills.</li><li>You can work on multiple projects and meet deadlines by setting priorities with work projects.</li><li>You can establish and maintain effective working relationships with co-workers and clients.</li><li>You are proficient with computers, Microsoft Office (Word and Excel) and using various software packages.<br/><br/></li></ul><em>Must be authorized to work in the United States now or in the future without visa sponsorship</em><em>.<br/><br/></em><strong>Benefits And Compensation<br/><br/></strong>Our compensation philosophy emphasizes competitive and equitable pay. Eide Bailly complies with all local/state regulations regarding displaying salary ranges. Final compensation decisions are dependent upon factors such as geography, experience, education, skills, and internal equity.<br/><br/>Salary Range: $70,000 - $110,000<br/><br/>Beyond base salary, Eide Bailly provides benefits such as: generous paid time off, comprehensive medical, dental, and vision insurance, 401(k) profit sharing, life and disability insurance, lifestyle spending account, certification incentives, education assistance, and a referral program.<br/><br/><strong>What To Expect Next<br/><br/></strong>We'll be in touch! If you look like the right fit for our position, one of our recruiters will be reaching out to schedule a phone interview with you to learn more about your career interests and goals. In the meantime, we encourage you to check us out on Facebook, Twitter, Instagram, LinkedIn or our About Us page.<br/><br/><em>Eide Bailly LLP is proud to be an affirmative action/equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, or any other status protected under local, state or federal laws.<br/><br/></em>", "responsibilities": "Provides consulting services for compensation and benefits taxation and ERISA compliance. Assesses tax and ERISA issues regarding the establishment, implementation and ongoing administration of both single and multi-employer retirement and welfare benefit plans. Consults on issues related to tax-qualified and non-tax-qualified retirement plans and executive compensation arrangements, such as 401(k) plans, traditional defined benefit plans, insured annuity programs and nonqualified deferred compensation plans, as well as issues related to welfare benefit programs, including insured medical plans, healthcare reimbursement accounts and flexible spending accounts. Performs research on technical tax and ERISA issues and prepares written communications summarizing and analyzing the research. Monitors and analyzes new legislative, regulatory, and administrative comp and benefits tax and ERISA developments. Drafts employee benefit plan participant communications and forms. Reviews and negotiates service provider agreements relating to ERISA plan investments, as well as plan administration and consulting services. Assists with IRS and DOL compliance filings for benefit plans. Analyze prohibited transaction and other benefit plan fiduciary issues.", "qualifications": {"required": "Bachelor’s Degree in Accounting or J.D. required; J.D. with LL.M. in Taxation preferred. Valid Certified Public Accountant license preferred, but not required if JD. 2+ years of experience in compensation and benefits tax. Knowledge of complex compensation and benefits tax issues. Excellent communication skills. Ability to work on multiple projects and meet deadlines by setting priorities with work projects. Ability to establish and maintain effective working relationships with co-workers and clients. Proficient with computers, Microsoft Office (Word and Excel) and using various software packages. Must be authorized to work in the United States now or in the future without visa sponsorship.", "preferred": ""}, "skills": ["ERISA", "Tax", "Retirement Plans", "Welfare Plans", "Executive Compensation", "Accounting", "Compliance", "Research", "Communication", "Microsoft Office", "Project Management", "Relationship Building"], "postedDate": "2 weeks ago", "benefits": "Our compensation philosophy emphasizes competitive and equitable pay. Eide Bailly complies with all local/state regulations regarding displaying salary ranges. Final compensation decisions are dependent upon factors such as geography, experience, education, skills, and internal equity.<br/><br/>Salary Range: $70,000 - $110,000<br/><br/>Beyond base salary, Eide Bailly provides benefits such as: generous paid time off, comprehensive medical, dental, and vision insurance, 401(k) profit sharing, life and disability insurance, lifestyle spending account, certification incentives, education assistance, and a referral program.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959886812"}