{"jobTitle": "Staff Security Operations Engineer", "company": {"name": "Canonical", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Technology, Information and Internet", "description": "We have opened several senior/staff Security Operations Engineer (SOC) positions, creating a new team reporting to the CISO. We are looking for a range of experience in these positions - at the high end we are looking for deep experience defending highly contested critical assets and high-value cyber targets against advanced persistent threats and state-level actors. We have more junior roles for exceptional individuals with a proven personal interest an engagement in cyber attack and defence, and outstanding academic and career performance even if experience is limited.<br/><br/>Our goal is to build an entirely new level of assurance and observable rigour into the open source supply chain. We have our own estate to monitor, but more broadly our goal is to raise the robustness of the entire global Ubuntu estate through the work of this team.<br/><br/>The Security Operations (SecOps) team is responsible for design, implementation and evolution of Canonical security practices, techniques, tools, systems and policies. The team is the primary owner of strategy and practices that determine how Canonical secures its data, internal infrastructure and build processes. They are responsible for assuring the security and integrity of our own infrastructure and product deployments. They design and implement technical security controls that ensure security threats are automatically identified, contained and remediated. The team will also contribute ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attack.<br/><br/>The SecOps team's mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.<br/><br/><strong>What you will do in this role:<br/><br/></strong><ul><li>Implement and evolve Canonical's SecOps security standards and playbooks</li><li>Analyse and improve Canonical's security architecture</li><li>Evaluate, select and implement new security tools and practices</li><li>Identify, contain and guide the remediation of security threats and cyber attacks</li><li>Grow the presence and thought leadership of Canonical SecOps practice</li><li>Contribute to open source threat intelligence initiatives</li><li>Drive threat modelling, table top exercises and other SecOps practices across Engineering, IS and Canonical</li><li>Develop Canonical SecOps learning and development materials</li><li>Publish blog posts, whitepapers and conference presentations</li><li>Identify, implement and track SecOps KPIs</li><li>Plan and deliver SecOps work in the framework of Canonical's agile engineering practice</li><li>Work with Security leadership to present information and influence change<br/><br/></li></ul><strong>What we are looking for<br/><br/></strong><ul><li>An exceptional academic track record </li><li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li><li>Drive and a track record of going above-and-beyond expectations</li><li>Deep personal motivation to be at the forefront of technology security</li><li>Expertise in threat modelling and risk management frameworks</li><li>Knowledge of security architecture and market-leading security tools</li><li>Experience contributing to, and consuming, threat intelligence feeds</li><li>Experience in security risk management frameworks such as NIST CSF</li><li>Experience with security standards such as ISO 27001<br/><br/></li></ul><strong>Optional things we value<br/><br/></strong><ul><li>Experience in a security operations team or a security operations centre (SOC)</li><li>Experience in offensive or defensive security teams with hands-on ability</li><li>Experience with state-actor and other advanced persistent threats<br/><br/></li></ul><strong>What we offer you<br/><br/></strong>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/><strong>Canonical is an equal opportunity employer<br/><br/></strong>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "responsibilities": "The Security Operations (SecOps) team is responsible for design, implementation and evolution of Canonical security practices, techniques, tools, systems and policies. The team is the primary owner of strategy and practices that determine how Canonical secures its data, internal infrastructure and build processes. They are responsible for assuring the security and integrity of our own infrastructure and product deployments. They design and implement technical security controls that ensure security threats are automatically identified, contained and remediated. The team will also contribute ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attack.<br/><br/>The SecOps team's mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.", "qualifications": {"required": "An exceptional academic track record, Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path, Drive and a track record of going above-and-beyond expectations, Deep personal motivation to be at the forefront of technology security, Expertise in threat modelling and risk management frameworks, Knowledge of security architecture and market-leading security tools, Experience contributing to, and consuming, threat intelligence feeds, Experience in security risk management frameworks such as NIST CSF, Experience with security standards such as ISO 27001", "preferred": "Experience in a security operations team or a security operations centre (SOC), Experience in offensive or defensive security teams with hands-on ability, Experience with state-actor and other advanced persistent threats"}, "skills": ["Security Operations", "Threat Modeling", "Risk Management", "Security Architecture", "Security Tools", "Threat Intelligence", "NIST CSF", "ISO 27001"], "postedDate": "1 month ago", "benefits": "We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959715222"}