{"jobTitle": "Material Coordinator", "company": {"name": "E2 Consulting Engineers, Inc.", "industry": "Engineering Services", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$50,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Engineering Services", "description": "E2 Consulting Engineers, Inc. (E2) is a professional services firm established in 1988 specializing in a full spectrum of engineering services including, project engineering and design, federal base operations and infrastructure support services, gas pipeline construction and inspection services, environmental consulting and remediation, and information technology services. At E2, we value safety, innovation and collaboration, and we are dedicated to excellence.", "responsibilities": "Work with project team and project bill of materials to order material through a procurement system. Help ensure ordered material meets company specifications. Oversee the receipt, storage, and issuance of materials. Proper forms and records will be filed upon materials' receipt to ensure suppliers are providing the ordered materials and to deal with any potential discrepancies. Upon receipt of requisitions, will either retrieve the requested material and deliver the material to the requester or facilitate the logistics of retrieval and delivery. Maintain all information for status of materials. Collaborate with construction team to schedule all deliveries and manage all delays and ensure compliance to all material requests. Prepare required reports for all cost accounts and procurement to ensure compliance to all account payable requirements. Collaborate with various departments to manage efficient flow of all materials. Prepare reports for all materials and may assist with managing transportation of materials.", "qualifications": {"required": "Must have knowledge of piping and/or instrumentation materials. Knowledge of project management principles and practices. Ability to support multiple project managers/project teams. Must be able to prepare written communications on technical and non-technical matters for various levels of management. Must possess the ability to effectively interact with various departments to maintain open lines of communication. Excellent written and verbal communication skills. Experience working with natural gas pipeline projects is preferred. 1-5 years of experience preferred. SAP experience highly desirable. Excellent excel skills required. Driver’s License required. Willing to travel to project sites as needed.", "preferred": ""}, "skills": ["Knowledge of piping and/or instrumentation materials", "Project management principles", "Excellent written and verbal communication skills", "SAP experience", "Excel skills"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "E2 Consulting Engineers, Inc. offers an excellent benefits package including health, dental, vision, and life insurance, 401(k) with employer match, paid time off.", "remoteWork": "Hybrid work environment.", "url": "https://www.linkedin.com/jobs/view/3959566614"}