{"jobTitle": "Vertical Operations Performance Analyst (Remote!)", "company": {"name": "Super.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Financial Services", "description": "About Super.com We started Super.com to help maximize lives–both the lives of our customers and the lives of our employees– so that everyone can experience all that life has to offer. For our employees, our promise is that Super.com is more than just a job; it’s an opportunity to unlock one’s potential, where learning is celebrated and impact is realized. We are more than a fast-paced, high-growth tech company; we care about our people and take career progression seriously. This is your career and our aim is to supercharge it through the people, the work, and the programs that fuel who we are. About this team Our Vertical Operations team is the face of Operations to each vertical of business. They are responsible for end to end vertical results; from establishing OKB policy to verifying performance. The Vertical Ops team defines the service requirements and establishes SLAs for each business. Our data-driven approach continuously improves operations through oversight and optimization. Our team is devoted to upholding service quality while reducing costs and driving innovation. About this role The Vertical Operations Performance Analyst will assist a Vertical Operations Manager to perform detailed performance monitoring; together these pairs are accountable for defining what should happen and validating that it is happening. The Performance Analyst will play a vital role in ensuring our users are receiving an experience that embodies our service level tenets by digging deep into our performance data and customer engagements. Accountable for customer experience KPIs, this role will collaborate closely with the cross-functional operations teams to troubleshoot performance variances and advocate for continuous improvement. We are searching for someone who possesses a perfect blend of investigative prowess, detail orientation , and ownership. Responsibilities<br/><br/><ul><li>Evaluate Vertical operational performance both near and long term against KPIs to assess opportunity for improvement - both in cost efficiency and improved service levels</li><li>Collaborate with the BPO Country Head, Agent Enablement Team and cross-functional stakeholders to ensure alignment and completion against performance expectations</li><li>Data analytics: Use data analytics to identify trends, patterns, and areas for improvement, presenting insights to the team and management</li><li>Strategic Recommendations: Work with management and key stakeholders to share data-driven recommendations, resulting in more informed solution-making</li><li>Dashboard creation and management: Create and maintain dashboards for real-time and historical insights on operational KPIs, providing the team with the necessary information to make data-driven judgements</li><li>Work closely with the Vertical Operations Manager to develop an expertise in the needs of the business and customer<br/><br/><br/></li></ul>Preferred Experience<br/><br/><ul><li>Bachelor's degree in Business, Economics, or related field</li><li>1-3 years of relevant work experience in operations, consulting, or at a startup</li><li>Strong investigative and critical thinking experience</li><li>Experience in data assessment tools such as Excel, SQL, or data visualization tools</li><li>Strong methodical techniques with the experience to proactively identify gaps, inconsistencies, or areas of improvement</li><li>Excellent attention to detail and aptitude to identify process improvement opportunities</li><li>Strong communication and presentation experience</li><li>Propensity to work collaboratively with cross-functional teams</li><li>Aptitude to think strategically and provide data-driven recommendations</li><li>Strong organizational and time management skills<br/><br/><br/></li></ul>Bonus Points<br/><br/><ul><li>Knowledge of customer service practices and protocols, preferably in the Fintech/Travel sector</li><li>Knowledge of industry-specific trends, problems, and regulations<br/><br/><br/></li></ul>We've Got You Covered<br/><br/><ul><li>Competitive salary packages, equity options, great benefits from day one, wellness budgets, as well as personal and team-level development budgets </li><li>We are remote-first – you have the flexibility to work from around the world and the hours that make sense for you– so that you can do your best work while living life on your own terms </li><li>Other perks include unlimited PTO, recharge days, travel discounts on SuperTravel, Weekly UberEats credit, annual company offsite </li><li>We welcome new family additions with generous parental leave and a flexible return-to-work plan</li><li>This is just scratching the surface– see our careers site for a more detailed overview of our perks &amp; benefits<br/><br/><br/></li></ul>We Believe in Equal Opportunity We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Accommodations are available on request for candidates taking part in all aspects of the selection process. If needed, please notify our Talent Acquisition Partner. As part of our compensation philosophy at Super.com we benchmark roles based on geographic location. The base salary range for this position in Los Angeles is $50,000 USD - $80,000 USD", "responsibilities": "Evaluate Vertical operational performance both near and long term against KPIs to assess opportunity for improvement - both in cost efficiency and improved service levelsCollaborate with the BPO Country Head, Agent Enablement Team and cross-functional stakeholders to ensure alignment and completion against performance expectationsData analytics: Use data analytics to identify trends, patterns, and areas for improvement, presenting insights to the team and managementStrategic Recommendations: Work with management and key stakeholders to share data-driven recommendations, resulting in more informed solution-makingDashboard creation and management: Create and maintain dashboards for real-time and historical insights on operational KPIs, providing the team with the necessary information to make data-driven judgementsWork closely with the Vertical Operations Manager to develop an expertise in the needs of the business and customer", "qualifications": {"preferred": "Bachelor's degree in Business, Economics, or related field1-3 years of relevant work experience in operations, consulting, or at a startupStrong investigative and critical thinking experienceExperience in data assessment tools such as Excel, SQL, or data visualization toolsStrong methodical techniques with the experience to proactively identify gaps, inconsistencies, or areas of improvementExcellent attention to detail and aptitude to identify process improvement opportunitiesStrong communication and presentation experiencePropensity to work collaboratively with cross-functional teamsAptitude to think strategically and provide data-driven recommendationsStrong organizational and time management skills", "required": "Knowledge of customer service practices and protocols, preferably in the Fintech/Travel sectorKnowledge of industry-specific trends, problems, and regulations"}, "skills": ["Data Analytics", "Excel", "SQL", "Data Visualization", "Customer Service", "Fintech", "Travel", "Operations", "Consulting", "Startup", "Communication", "Presentation", "Collaboration", "Strategic Thinking", "Problem Solving", "Process Improvement", "Time Management", "Organization"], "postedDate": "1 month ago", "benefits": "Competitive salary packages, equity options, great benefits from day one, wellness budgets, as well as personal and team-level development budgets We are remote-first – you have the flexibility to work from around the world and the hours that make sense for you– so that you can do your best work while living life on your own terms Other perks include unlimited PTO, recharge days, travel discounts on SuperTravel, Weekly UberEats credit, annual company offsite We welcome new family additions with generous parental leave and a flexible return-to-work planThis is just scratching the surface– see our careers site for a more detailed overview of our perks &amp; benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959573449"}