{"jobTitle": "Assistant Vice President, Commercial Surety", "company": {"name": "Ascot Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "145,000.00 - 190,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "This is an opportunity to join Ascot Group - one of the world’s preeminent specialty risk underwriting organizations.<br/><br/>Designed as a modern-era company operating through an ecosystem of interconnected global operating platforms, we’re bound by a common mission and purpose: One Ascot. Our greatest strength is a talented team who flourish in a collaborative, inclusive, and entrepreneurial culture, steeped in underwriting excellence, integrity, and a passion to find a better way, The Ascot Way.<br/><br/>The Ascot Way guides our people and our organization. Our underwriting platforms collaborate to find creative ways to deploy our capital in a true cross-product and cross-platform approach. These platforms work as one, deploying our capital creatively through our unique Fusion Model: Client Centric, Risk Centric, Technology Centric.<br/><br/>Built to be resilient, Ascot maximizes client financial security while delivering bespoke products and world-class service — both pre-and post-claims. Ascot exists to solve for our clients’ brightest tomorrow, through agility, collaboration, resilience, and discipline.<br/><br/><strong>Position Overview<br/><br/></strong>Ascot Surety &amp; Casualty Company is a US Treasury-listed surety carrier. Ascot benefits from a Financial Strength Rating of A issued by A.M. Best.<br/><br/>To support Ascot’s entrance into the Surety market we currently have an opportunity as Assistant Vice President, Commercial Surety. As the Assistant Vice President, Commercial Surety you will be responsible for supporting underwriting and marketing strategy in an assigned region. The successful candidate will be responsible for regional production targets, disciplined underwriting, and the development of productive distribution partner relationships<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Responsible for meaningful contribution to production, disciplined regional underwriting, and distribution strategy </li><li>Within authority limit, approve, decline, and price of risks</li><li>Assists with the development and execution of segment strategies to contribute to budgeted results</li><li>Accountable for accurate underwriting information and adherence to documentation standards</li><li>Develop and leverage productive distribution partner relationships<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Finance, Accounting, or equivalent</li><li>5-10 years of experience underwriting, analyzing, and servicing complex commercial surety accounts</li><li>Proven track record of establishing and developing distribution partner relationships</li><li>Excellent communication and organizational skills</li><li>Ability to work independently and efficiently</li><li>Consistently embraces and promotes a culture of collaboration and the ability to effectively manage change</li><li>Demonstrates a strong work ethic, solid business judgment, and a passion for providing outstanding solutions to our business partners</li><li>This position may be filled at a different level, depending on experience***<br/><br/></li></ul><strong>Compensation<br/><br/></strong><em>Actual base pay could vary and may be above or below the listed range based on factors including but not limited to experience, subject matter expertise, and skills. The base pay is just one component of Ascot’s total compensation package for employees. Other rewards may include an annual cash bonus, and other forms of discretionary compensation awarded by the Company. The annualized base pay range for this role is: $145,000 - $190,000.<br/><br/></em><strong>Company Benefits<br/><br/></strong><em>The Company provides a competitive benefits package that includes the following (eligibility requirements apply):<br/><br/></em><em>Health and Welfare Benefits: Medical (including prescription coverage), Dental, Vision, Health Savings Account, Commuter Account, Health Care and Dependent Care Flexible Spending Accounts, Life Insurance, AD&amp;D, Work/Life Resources (including Employee Assistance Program), and more<br/><br/></em><em>Leave Benefits: Paid holidays, annual Paid Time Off (includes paid state /local paid leave where required), Short-term Disability, Long-term Disability, Other leaves (e.g., Bereavement, FMLA, Adoption, Maternity, Military, Primary &amp; Non-Primary Caregiver)<br/><br/></em><em>Retirement Benefits: Contributory Savings Plan (401k)<br/><br/></em>", "responsibilities": "Responsible for meaningful contribution to production, disciplined regional underwriting, and distribution strategy \nWithin authority limit, approve, decline, and price of risks\nAssists with the development and execution of segment strategies to contribute to budgeted results\nAccountable for accurate underwriting information and adherence to documentation standards\nDevelop and leverage productive distribution partner relationships", "qualifications": {"required": "Bachelor’s degree in Finance, Accounting, or equivalent\n5-10 years of experience underwriting, analyzing, and servicing complex commercial surety accounts\nProven track record of establishing and developing distribution partner relationships\nExcellent communication and organizational skills\nAbility to work independently and efficiently\nConsistently embraces and promotes a culture of collaboration and the ability to effectively manage change\nDemonstrates a strong work ethic, solid business judgment, and a passion for providing outstanding solutions to our business partners\nThis position may be filled at a different level, depending on experience", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The Company provides a competitive benefits package that includes the following (eligibility requirements apply):\n\nHealth and Welfare Benefits: Medical (including prescription coverage), Dental, Vision, Health Savings Account, Commuter Account, Health Care and Dependent Care Flexible Spending Accounts, Life Insurance, AD&D, Work/Life Resources (including Employee Assistance Program), and more\n\nLeave Benefits: Paid holidays, annual Paid Time Off (includes paid state /local paid leave where required), Short-term Disability, Long-term Disability, Other leaves (e.g., Bereavement, FMLA, Adoption, Maternity, Military, Primary &amp; Non-Primary Caregiver)\n\nRetirement Benefits: Contributory Savings Plan (401k)", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3959887987"}