{"jobTitle": "JD Logistics - Dispatcher", "company": {"name": "JD.COM", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time/Part-Time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "<strong>Location:</strong> City of Industry, CA<br/><br/><strong>Job Type:</strong> Full-time/Part-Time<br/><br/><strong><strong>We are seeking a Full-Time Dispatcher - DSP Operation Specialist with previous delivery experiences preferred, who has worked with a DSP (Delivery Service Partner) and has the ability to assist the Delivery associates with any difficulties delivering to the customers. This is not a remote job. If you are a serious individual with an excellent work ethic, come join us! <br/><br/></strong></strong><strong>Position Summary:<br/><br/></strong>You must be able to resolve any drivers' difficulties, from loadout to rescues, keep track of daily reports, open our delivery station before drivers' arrival, and close at the end of the day. The ideal candidate must be primarily an excellent communicator and able to remain calm and composed, especially in emergency situations. You must be able to multi-task as well as take the appropriate action with little supervision.<br/><br/><strong>Essential Duties and Responsibilities:<br/><br/></strong><ul><li>Must always represent the Company in a professional manner.</li><li>Receiving emergency and non-emergency calls and recording significant information.</li><li>Addressing problems and requests by transmitting information or providing solutions.</li><li>Receiving and dispatching routes.</li><li>Prioritize calls according to urgency and importance</li><li>Use radio, phone, or computer to send crews, vehicles, or other field units to appropriate locations</li><li>Monitor the route and status of field units to coordinate and prioritize their schedule</li><li>Provide field units with information about orders, traffic, obstacles, and requirements</li><li>Enter data in the computer system and maintain logs and records of calls, activities, and other information</li><li>Follows and enforces all safety rules and company policies and procedures.</li><li>Back office maintenance, including inventory, attendance, etc.<br/><br/></li></ul><strong>Required Skills and Experience:<br/><br/></strong><ul><li>Customer Service – is professional at all times with anyone at the customer location. Represents the company in a service-oriented and courteous manner at all times. Is respectful and represents the company brand positively.</li><li>Driving and Delivery Experience – previous driving and delivery experience preferred.</li><li>Technology Oriented – must be comfortable using mobile technology in an efficient and accurate way, be able to use Microsoft Suite. </li><li>Safety and Security – Adheres to all safety and security procedures. Determines appropriate action beyond guidelines as required. Reports potentially unsafe conditions immediately. Uses vehicle and all provided work materials, appropriately.</li><li>Attendance/Punctuality and Timeliness – Is consistently at work at required shift and is on time or early. Completes work in a timely manner and within the standards outlined by the company.</li><li>Dependability – Follows and enforces instructions, responds to management direction. Takes responsibility for own actions. Keeps commitments. Completes tasks on time or notifies supervisor in advance, if a commitment is at risk.</li><li>Quality – meets productivity and service standards consistently.<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Must be at least 21 years old.</li><li>Must have a valid driver's license within the state of employment.</li><li>Must be able to move boxes up to 50 lbs., with or without reasonable accommodation.</li><li>Must have a positive attitude and leadership skills.</li><li>Must understand the importance of safety.</li><li>Must be able to pass a background check, driving record check, and drug test.<br/><br/></li></ul><strong>Supervises:<br/><br/></strong>This Role will be supervising all delivery drivers and driver leads.<br/><br/><strong>Physical Demands and Work Environment: </strong>The physical demands and work environment characteristics described here are representative of those that must be met by an employee to successfully perform the essential job function of this job. These include:<br/><br/><ul><li>Physical Demands: Employee is required to stand, walk, sit and drive a company- provided vehicle. Employee is required to reach and lift with both hands and both arms. Employee is required to crouch, stoop and bend with both legs. Employee is required to talk and hear without assistance. Employee must be able to lift and move up to 50 pounds in a single package. Good manual dexterity skills are required as well as good eye-hand coordination. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.</li><li>Work Environment: Employee is driving a vehicle in urban, suburban and rural settings. Must be comfortable working alone and communicating with home office and supervisor.<br/><br/></li></ul><strong>Required Licenses:<br/><br/></strong>Valid State Driver's License is required.<br/><br/><strong>Work Authorization Requirements:<br/><br/></strong>United States Work Authorization is Required.<br/><br/><strong>Benefits and Perks:<br/><br/></strong><ul><li>Free comprehensive health insurance package, including medical, dental, and vision.</li><li>Free meals or equivalent meal allowance.</li><li>Free office snacks and beverages.</li><li>401k.</li><li>Paid time off, including paid holidays, vacation time and sick time.</li><li>Performance based year-end bonus.</li><li>Telecommunication allowance, applied to certain business lines.</li><li>Monthly team building events. <br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology. For more information, visit https://corporate.jd.com/home<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots. For more information, visit https://www.jdworldwide.com/jdl<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "responsibilities": "You must be able to resolve any drivers' difficulties, from loadout to rescues, keep track of daily reports, open our delivery station before drivers' arrival, and close at the end of the day. The ideal candidate must be primarily an excellent communicator and able to remain calm and composed, especially in emergency situations. You must be able to multi-task as well as take the appropriate action with little supervision.", "qualifications": {"required": "Must be at least 21 years old.\nMust have a valid driver's license within the state of employment.\nMust be able to move boxes up to 50 lbs., with or without reasonable accommodation.\nMust have a positive attitude and leadership skills.\nMust understand the importance of safety.\nMust be able to pass a background check, driving record check, and drug test.", "preferred": "previous driving and delivery experience"}, "skills": ["Customer Service", "Driving", "Delivery", "Technology", "Microsoft Suite", "Safety", "Security", "Attendance", "Punctuality", "Timeliness", "Dependability", "Quality"], "postedDate": "1 month ago", "benefits": "Free comprehensive health insurance package, including medical, dental, and vision.\nFree meals or equivalent meal allowance.\nFree office snacks and beverages.\n401k.\nPaid time off, including paid holidays, vacation time and sick time.\nPerformance based year-end bonus.\nTelecommunication allowance, applied to certain business lines.\nMonthly team building events.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3960939141"}