{"jobTitle": "JD Logistics - Warehouse Supervisor", "company": {"name": "JD.COM", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Location:</strong> City of Industry, CA/Fontana, CA<br/><br/><strong>Job Type:</strong> Full-time<br/><br/><strong>Job Description<br/><br/></strong><strong>Responsibilities:<br/><br/></strong><ul><li>Manage a group of full time direct reports with responsibilities including but not limited to staffing, training, development, motivation, retention, and disciplinary management up to and including termination.</li><li>Drive workforce excellence by initiating positive methods in performance management and productivity management. Give consistent and fair feedback on performance and provide coaching and counseling when needed.</li><li>Manage the production activities within the warehouse operations. Communicates through operational meetings, making sure work instructions, workflow activities and safety rules are conformed. Ensure correct implementation of work schedule and quality completion of assigned tasks.</li><li>Manage the schedule of direct reports' time-off, minimizing its impact on business operation.</li><li>Prepare and distribute various reports needed for day to day operations.</li><li>Provide high quality customer service to internal and external customers.</li><li>Assure the security of the facility and the integrity of the inventory.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's Degree or above;</li><li>More than 3 years experience in logistics or warehouse management;</li><li>Experience in warehouse planning;</li><li>Deep understanding of the industry and have resources of logistics service providers;</li><li>Excellent leadership, influencing, organization, communication, interpersonal and teamwork skills;</li><li>Fluent in English and Mandarin is preferred.<br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology.<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots. http://www.jdworldwide.com/<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3960939139"}