{"jobTitle": "Hiring Now! Assistant Project Coordinator", "company": {"name": "Arellano Associates", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.00 - 28.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Public Relations and Communications Services", "description": "<strong>Department: </strong>Projects Team<br/><br/><strong>Location: </strong>Southern California<br/><br/><strong>Compensation: </strong>$22.00 - $28.00 / hour<br/><br/><strong>Description<br/><br/></strong>Arellano Associates (AA) is a specialized public outreach and communications consulting firm focusing on public infrastructure, transportation, and community planning programs throughout Southern California and beyond.<br/><br/>The Assistant Project Coordinator (APC) is a full-time position, which performs a variety of tasks for public outreach and stakeholder engagement programs as a member of a project team and under the guidance of a project manager. This is an entry-level position with opportunities for ongoing growth within the company.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Content Creation: Draft written text for various collateral materials, including fact sheets, brochures, newsletters, posters, e-communications, and social media content.</li><li> Event Coordination: Complete tasks needed for in-person public engagement events, such as public meetings, pop-up events, and special events, including meeting logistics, supplies, and event staffing.</li><li> Tech Tools Application: Assist in applying the latest tech tools to communicate project information and receive public input, utilizing platforms like ArcGIS, SurveyMonkey, MetroQuest, Poll Everywhere, TypeForm, Google Forms, Salesforce, WordPress, dashboards, interactive maps, etc.</li><li> Adobe Creative Suite: Use Adobe Creative Suite programs for basic file creation and editing, including InDesign, Illustrator, PhotoShop, and/or PremierePro.</li><li> Vendor Coordination: Coordinate vendor services, including printing, catering services, translation and interpretation services, toll-free phone lines, etc.</li><li> Database and Website Management: Update stakeholder databases, project websites, and social media content regularly.</li><li> Project Management: Perform project tasks within allotted timeframes and budget parameters, ensuring timely and cost-effective completion.</li><li> Issue Communication: Communicate issues and challenges to management promptly.<br/><br/></li></ul><strong>Skills, Knowledge And Expertise<br/><br/></strong><ul><li> Communication Skills: Possess excellent written and verbal communication skills.</li><li> Attention to Detail: Be detail-oriented, flexible, and able to multitask in a dynamic environment.</li><li> Public Interaction: Be comfortable interacting with the public both virtually and in-person.</li><li> Availability: Be available to attend public meetings and in-person events during workday, evening, and weekend hours.</li><li> Software Proficiency: Be proficient in Microsoft Office, OneDrive/SharePoint, Google Maps, Google Drive, Constant Contact, and social media platforms (Facebook, Twitter, Instagram, LinkedIn).</li><li> Digital Engagement Tools: Be familiar with digital engagement tools, including electronic mapping, online survey tools, and other public engagement software, such as Adobe Creative Suite, ArcGIS, SurveyMonkey, MetroQuest, Poll Everywhere, TypeForm, WordPress, and Geosocial interactive mapping.</li><li> Adobe Knowledge: Possess basic knowledge of Adobe Creative Suite programs, including InDesign, Illustrator, Photoshop, and/or PremierePro.<br/><br/></li></ul><strong>Minimum Requirements<br/><br/></strong>Beyond having an interest in making an impact on local communities, we look for the following in all candidates:<br/><br/><ul><li> Positive Attitude: A great attitude and enthusiasm for community engagement!</li><li> Experience: 0-3 years of experience in public outreach, marketing, communications, public relations, government relations, planning, public policy, and/or a related discipline.</li><li> Education: Bachelor's Degree (highly preferred).</li></ul>", "responsibilities": "The Assistant Project Coordinator (APC) is a full-time position, which performs a variety of tasks for public outreach and stakeholder engagement programs as a member of a project team and under the guidance of a project manager. This is an entry-level position with opportunities for ongoing growth within the company.", "qualifications": {"required": "Beyond having an interest in making an impact on local communities, we look for the following in all candidates:<br/><br/><ul><li> Positive Attitude: A great attitude and enthusiasm for community engagement!</li><li> Experience: 0-3 years of experience in public outreach, marketing, communications, public relations, government relations, planning, public policy, and/or a related discipline.</li><li> Education: Bachelor's Degree (highly preferred).</li></ul>", "preferred": "Bachelor's Degree (highly preferred)"}, "skills": ["Communication", "Public Interaction", "Microsoft Office", "Google Maps", "Google Drive", "Constant Contact", "Social Media", "Adobe Creative Suite", "ArcGIS", "SurveyMonkey", "MetroQuest", "Poll Everywhere", "TypeForm", "WordPress", "Geosocial interactive mapping"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3960290396"}