{"jobTitle": "Data Analyst, Institutional Data and Analytics", "company": {"name": "Coinbase", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "131,325.00/yr - 154,500.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Technology, Information and Internet", "description": "At Coinbase, our mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web3 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.<br/><br/>There are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.<br/><br/><strong>Who You Are<br/><br/></strong><ul><li>You’ve got positive energy. You’re optimistic about the future and determined to get there. </li><li>You’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0. </li><li>You appreciate direct communication. You’re both an active communicator and an eager listener - because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.</li><li>You can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.</li><li>You have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.</li><li>You want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone. <br/><br/></li></ul>Institutional Operations Solutions are responsible for the day to day operations and support of Coinbase’s suite of Institutional Products and Services. We are focused on managing risk and building scale in operations processes as well as providing exceptional customer service to our Institutional clients. As a Data Analyst on our team, you will help drive business impact through data. You will have the opportunity to transform data into valuable business insights and help shape our strategy by establishing critical metrics, building visualizations, and automating reporting.<br/><br/><strong>What You’ll Be Doing (ie. Job Duties)<br/><br/></strong><ul><li>Improve operational efficiency and risk management by developing metrics, self-service tools, and deep analyses that drive actionable insights.</li><li>Proactively identify opportunity areas for improvement including reporting automation, deep dive investigations, and new analytical partnerships.</li><li>Collaborate in a tight-knit team environment to foster efficient execution, innovation, and continuous improvement.</li><li>Develop and support the analytical technologies that empower our team to have timely, flexible, and structured access to our data.</li><li>Collaborate with multiple operations teams to manage an analytic roadmap.</li><li>Drive the vision, building, and adoption of self-service analytic capabilities; develop these capabilities at scale.</li><li>Understand data resources and know when, how, and which best to use for each project.</li><li>Work cross-functionally with other data owners to to maximize consistency and establish best practices.</li><li>Frame and break down complex business problems into key components and recommend practical solutions.</li><li>Monitor key performance metrics and use data to identify actionable opportunities to minimize risk and increase efficiency.<br/><br/></li></ul><strong>What We Look For In You (ie. Job Requirements)<br/><br/></strong><ul><li>3+ years of experience working with data in a relevant function (e.g. operations, finance, business analytics, etc.).</li><li>Advanced SQL and data modeling skills, Python experience a plus.</li><li>Motivated by Coinbase’s mission, crypto and delivering an exceptional Institutional product to our customers.</li><li>Proficient using at least one data visualization product (Looker, Tableau, QuickSight, SuperSet, etc.)</li><li>Excellent written and verbal communication skills are required, including experience meeting with and communicating information to senior leadership.</li><li>Highly collaborative, with an ability to gather and balance inputs from many cross-functional partner teams.</li><li>Ability to think strategically, formulate appropriate analytical solutions, and execute in order to solve business needs.</li><li>Highly flexible and adaptable to meet the evolving needs of a high-growth, fast paced organization.<br/><br/></li></ul><strong>Nice To Haves<br/><br/></strong><ul><li>Report automation experience (e.g. using Apache Airflow, Python, etc.).</li><li>Deep subject matter expertise and experience in crypto and financial services, including risk management.</li><li>Experience with financial industry regulations.</li><li>Experience with descriptive and inferential statistics.</li><li>Experience with customer support metrics/data.<br/><br/></li></ul>Job #: P57441<br/><br/><strong>Pay Transparency Notice:</strong> Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).<br/><br/><strong>Pay Range<br/><br/></strong>$131,325—$154,500 USD<br/><br/>Commitment to Equal Opportunity<br/><br/>Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Know Your Rights notice here. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law.<br/><br/>Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).<br/><br/>Global Data Privacy Notice for Job Candidates and Applicants<br/><br/>Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here.", "responsibilities": "Improve operational efficiency and risk management by developing metrics, self-service tools, and deep analyses that drive actionable insights.\nProactively identify opportunity areas for improvement including reporting automation, deep dive investigations, and new analytical partnerships.\nCollaborate in a tight-knit team environment to foster efficient execution, innovation, and continuous improvement.\nDevelop and support the analytical technologies that empower our team to have timely, flexible, and structured access to our data.\nCollaborate with multiple operations teams to manage an analytic roadmap.\nDrive the vision, building, and adoption of self-service analytic capabilities; develop these capabilities at scale.\nUnderstand data resources and know when, how, and which best to use for each project.\nWork cross-functionally with other data owners to to maximize consistency and establish best practices.\nFrame and break down complex business problems into key components and recommend practical solutions.\nMonitor key performance metrics and use data to identify actionable opportunities to minimize risk and increase efficiency.", "qualifications": {"required": "3+ years of experience working with data in a relevant function (e.g. operations, finance, business analytics, etc.).\nAdvanced SQL and data modeling skills, Python experience a plus.\nMotivated by Coinbase’s mission, crypto and delivering an exceptional Institutional product to our customers.\nProficient using at least one data visualization product (Looker, Tableau, QuickSight, SuperSet, etc.)\nExcellent written and verbal communication skills are required, including experience meeting with and communicating information to senior leadership.\nHighly collaborative, with an ability to gather and balance inputs from many cross-functional partner teams.\nAbility to think strategically, formulate appropriate analytical solutions, and execute in order to solve business needs.\nHighly flexible and adaptable to meet the evolving needs of a high-growth, fast paced organization.", "preferred": "Report automation experience (e.g. using Apache Airflow, Python, etc.).\nDeep subject matter expertise and experience in crypto and financial services, including risk management.\nExperience with financial industry regulations.\nExperience with descriptive and inferential statistics.\nExperience with customer support metrics/data."}, "skills": ["SQL", "Data Modeling", "Python", "Data Visualization", "Looker", "Tableau", "QuickSight", "SuperSet", "Communication", "Collaboration", "Strategic Thinking", "Problem Solving", "Adaptability"], "postedDate": "1 week ago", "benefits": "Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3960556123"}