{"jobTitle": "Production Planner", "company": {"name": "Huntsman Corporation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$78,200-$90,000 per year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Plastics Manufacturing, Oil and Gas, and Chemical Manufacturing", "description": "Huntsman Corporation is a publicly traded global manufacturer and marketer of differentiated and specialty chemicals. Our chemical products number in the thousands and are sold worldwide to manufacturers serving a broad and diverse range of consumer and industrial end markets. We operate more than 70 manufacturing, R&D and operations facilities in approximately 30 countries and employ approximately 9,000 associates within our four distinct business divisions. Huntsman offers unsurpassed opportunities to build a successful future. Our diverse portfolio creates a range of career fields including manufacturing, research and development, technical services, sales and marketing, customer service – and the list goes on.<br/><br/>Here, you can make an impact and make a difference. <strong>Come join us</strong>.<br/><br/>Huntsman is seeking a highly organized and detail-oriented <strong>Production Planner</strong> to join our team for our chemical manufacturing site in <strong>Los Angeles, CA. </strong>This position will report to the <strong>Los Angeles Supply Chain Manager.<br/><br/></strong><strong>Job Scope<br/><br/></strong>The Supply Chain Planner will play a crucial role in ensuring the efficient flow of materials and products through our production process, optimizing inventory levels, and supporting our commitment to on-time delivery and customer satisfaction.<br/><br/><strong>As The Production Planner You Will<br/><br/></strong><ul><li>Interpret and seek input across functional groups to build raw material plan and production plan that will drive operational activity in line with business objectives including balance of production and supply chain cost.</li><li>Manage inventory level within targeted range with aim to have adequate material to maintain supply without increasing working capital. Optimize inventory and minimize excess.</li><li>Maintain and understand short- and long-term production capacities and material constraints.</li><li>Respond to change in the plan in a timely manner with the ability to quantify the impact of these changes to the Key stakeholders.</li><li>Support the needs of other supply chain operations within the organization to ensure coordination and alignment of planning activities with regional supply planners, operations, and logistics. </li><li>Own and report on key KPIs, to include OTIF (On Time Delivery), DIO (Days Inventory Outstanding), SLOB (Slow Moving Inventory), etc.</li><li>Maintain appropriate master data in SAP and other systems.</li><li>Support launch of New Products.</li><li>Provide input to IBP process in developing inventory strategies on existing and new products.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong>You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates.<br/><br/><strong>The candidate must have an unrestricted right to work for Huntsman in the United States.<br/><br/></strong><ul><li>BS Supply Chain, Business Administration or related field is preferred or equivalent work experience.</li><li>A minimum of 4 years of Experience as a Planner or in Supply Chain.</li><li>Knowledge of SAP or related ERP planning systems.</li><li>Knowledgeable in inventory management</li><li>Strong interpersonal and critical thinking skills</li><li>Must be proficient in MS Office software specifically Excel</li><li>High analytical skills based on data</li><li>Excellent proactive communicator<br/><br/></li></ul><strong>Skills And Experiences Preferred<br/><br/></strong><ul><li>Experience as a Planner or in Supply Chain in Aerospace Preferred</li><li>Strong Math Skills</li><li>Knowledge in SIOP and IBP processes<br/><br/></li></ul><strong>What can we offer you?<br/><br/></strong><ul><li>Salary range $78,200-$90,000 per year.<br/><br/></li></ul>The compensation range reflects the Company’s reasonable expectation at the time of posting. We consider a number of business-related factors when making individual compensation decisions including, but not limited to, education, experience and training.<br/><br/><strong>Huntsman Offers Outstanding Benefits Which Start From Day One<br/><br/></strong><ul><li>Competitive healthcare, dental, and vision.</li><li>One additional week of paid time off - on top of vacation.</li><li>401k – Huntsman automatically contributes 6% of eligible pay, regardless of employee contribution. In addition to the 6% non-discretionary contribution, Huntsman will match $1 for every $1 you contribute up to a maximum match of 4% of eligible pay.<br/><br/></li></ul>Huntsman is proud to be an equal opportunity workplace and is an affirmative action employer. We provide <strong>equal employment opportunities (EEO)</strong> to all qualified applicants for employment, without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identification, sexual orientation and/or expression or any other characteristic protected by law in every location in which we have facilities national or local.<br/><br/>Please refer to https://www.huntsman.com/privacy/online-privacy-notice for Company’s <strong>Data Privacy and Protection information. <br/><br/></strong><strong>All unsolicited resumes presented by recruitment agencies are treated as pro bono information or service. <br/><br/></strong>Huntsman is aware of a <strong>scam involving fraudulent job offers</strong>. Huntsman does not make job offers until after a candidate has submitted a job application and has participated in a face-to-face interview. Please be advised that emails from Huntsman always end in “@huntsman.com” and that any job offer that requires payment or requires you to deposit a check is likely a scam. If you have questions about any open positions at Huntsman, please visit our Careers website at http://www.huntsman.com/corporate/a/Careers", "responsibilities": "The Supply Chain Planner will play a crucial role in ensuring the efficient flow of materials and products through our production process, optimizing inventory levels, and supporting our commitment to on-time delivery and customer satisfaction.", "qualifications": {"required": "BS Supply Chain, Business Administration or related field is preferred or equivalent work experience.\nA minimum of 4 years of Experience as a Planner or in Supply Chain.\nKnowledge of SAP or related ERP planning systems.\nKnowledgeable in inventory management\nStrong interpersonal and critical thinking skills\nMust be proficient in MS Office software specifically Excel\nHigh analytical skills based on data\nExcellent proactive communicator", "preferred": "Experience as a Planner or in Supply Chain in Aerospace Preferred\nStrong Math Skills\nKnowledge in SIOP and IBP processes"}, "skills": ["Supply Chain", "SAP", "Inventory Management", "MS Office", "Excel", "Analytical Skills", "Communication"], "postedDate": "1 week ago", "benefits": "Competitive healthcare, dental, and vision.\nOne additional week of paid time off - on top of vacation.\n401k – Huntsman automatically contributes 6% of eligible pay, regardless of employee contribution. In addition to the 6% non-discretionary contribution, Huntsman will match $1 for every $1 you contribute up to a maximum match of 4% of eligible pay.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3960660370"}