{"jobTitle": "Product Manager (Leadership)", "company": {"name": "Meta", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "249,000.00/yr - 323,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet", "description": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary product teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe.Meta Product Management Leaders work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for extremely entrepreneurial Product Management Leaders to help innovate and execute product initiatives across the company and value moving quickly. This job description represents different full-time roles across our product suite.<br/><br/>Product Manager (Leadership) Responsibilities:<br/><br/><ul><li>Lead a team through the ideation, technical development, and launch of innovative products</li><li>Drive product development with a team of world-class engineers and designers</li><li>Attract, build, manage, and develop a talented, diverse, equitable and inclusive team of product managers and product leaders</li><li>Establish shared vision across the company by building consensus on priorities leading to product execution</li><li>Integrate usability studies, research and market analysis into product requirements to enhance user satisfaction</li><li>Define and analyze metrics that inform the success of products</li><li>Understand Facebook’s strategic and competitive position and deliver products that are recognized best in the industry</li><li>Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm</li><li>Manage multiple products and priorities, scale teams, and ensure org is effective, healthy and set up for success by establishing clear and measurable goals</li><li>Identify and initiate opportunities for new projects or focus areas and builds teams necessary to execute<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>12+ years of experience in Product Management and/or Product Design</li><li>12+ years of experience working collaboratively with engineering, design and user research teams</li><li>8+ years of experience hiring, managing, and developing both individual contributors and senior leaders</li><li>Critical thinking/analytical leadership experience</li><li>Experience presenting to senior executive audiences</li><li>BA/BS in Computer Science or related field<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience in a consumer focused technology company</li><li>Experience building 0-1 products, platform/ecosystem products, or marketplaces<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$249,000/year to $323,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3960015017"}