{"jobTitle": "JD Logistics - Recruiter", "company": {"name": "JD.COM", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Part-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Technology, Information and Internet", "description": "<strong>Job Location:</strong> Fontana, CA<br/><br/><strong>Job Type: </strong>Part-time (Up to 30 hours a week)<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Responsible for generation of active and passive candidates from job portals, networking sites, contact lists and internal databases through research.</li><li>Review requisitions, understand hiring needs and position specifications and conduct research to identify suitable candidates.</li><li>Partner with HRBP to create innovative sourcing strategies.</li><li>Responsible for candidate management that includes validation of interest, availability, work authorization, compensation, technical fit and qualifications.</li><li>Conduct interviews and be responsible for arranging &amp; coordinating interviews.</li><li>Negotiate offers and close cases with proper handover to the onboarding team.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor's Degree. Working experience in either recruiting firm or internal sourcing team handling logistics/warehouse positions.</li><li>Proven record of generating a high volume and high quality pipeline of candidates.</li><li>Excellent written and verbal communications skills in both English and Mandarin.</li><li>Thrive in a fast-pace environment.<br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology.<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots.<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3960937742"}