{"jobTitle": "Content Creator", "company": {"name": "High Scale", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Advertising Services", "description": "High Scale is a leading creative agency dedicated to delivering impactful solutions for our clients. Our team is composed of diverse and talented individuals who are passionate about pushing the boundaries of creative expression. As a Content Creator at HighScale, you will be an integral part of our creative team, shaping narratives that captivate and inspire. Collaborating with cross-functional teams, you will leverage your creativity to produce compelling content, with a keen focus on video creation. Your ability to stay on top of industry trends and effectively optimize content for platforms like TikTok and Instagram will be crucial in driving our client's success.", "responsibilities": "Conceptualize and create engaging content that aligns with client objectives and campaign goals. Lead video creation initiatives, bringing concepts to life through visually stunning and compelling storytelling. Stay abreast of industry trends, emerging content formats, and platform-specific best practices. Optimize content for social media platforms, particularly TikTok and Instagram, to maximize audience engagement. Collaborate with Art Directors, Copywriters, and other team members to ensure cohesive and impactful content creation.", "qualifications": {"required": "Bachelor's degree in Film, Media, Communications, or a related field. Proven experience as a Content Creator, with a strong portfolio showcasing video creation expertise. In-depth knowledge of social media platforms, especially TikTok and Instagram. Proficiency in video editing software and content creation tools. Strong creative and storytelling skills with an eye for visual aesthetics.", "preferred": "Not specified"}, "skills": ["Video Creation", "Content Optimization", "Social Media Management", "Creative Storytelling", "Video Editing"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "High Scale Creative is an equal-opportunity employer. We encourage applications from candidates of all backgrounds and experiences.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3960005967"}