{"jobTitle": "Maintenance Manager - Koreatown", "company": {"name": "Tripalink", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$70,000.00/yr - $85,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Who We Are: Tripalink is a leading co-living and apartment rental platform that aims to redefine urban living. With a strong presence in major cities across the United States, we offer modern apartments designed to create a sense of community among residents. As a fast-growing startup, we are committed to building a community that supports personal growth, celebrates diversity, and encourages excellence. Our team is dedicated to providing exceptional living experiences through cutting-edge technology and unparalleled customer service. If you're passionate about making a difference and eager to be part of a team that values creativity and teamwork, we invite you to explore our career opportunities and join us on our journey.", "responsibilities": "Maintenance Oversight: Supervise and coordinate all maintenance activities for the properties under management. Collaborate with external vendors and contractors to ensure timely and cost-effective repairs and upgrades. Conduct regular inspections to identify and address potential issues before they escalate. Safety and Compliance: Implement and enforce safety protocols and standards across all properties. Stay informed about relevant regulations and ensure compliance with building codes and safety guidelines. Conduct regular training sessions for staff on safety procedures and emergency protocols. Budget Management: Develop and manage the facilities budget, ensuring cost-effectiveness and adherence to financial goals. Identify opportunities for cost savings without compromising the quality of services. Tenant Relations: Act as a point of contact for tenant inquiries related to facilities and maintenance issues. Foster positive relationships with tenants, addressing concerns promptly and professionally. Operational Efficiency: Streamline operational processes to enhance efficiency and effectiveness. Implement technology solutions for better facilities management and reporting.", "qualifications": {"required": "Not specified", "preferred": "Not specified"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Excellent Working Environment: Energetic, Ambitious, Passionate - Great Team Experience - Regular Team Building Activities - Free Community Event Entrance - Leadership Cultivation & Individual Development - Networking & Resources from External Partners - Opportunities of Rotation Among Departments & Locations", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3960261424"}