{"jobTitle": "Supply Chain Operations Specialist, B2B/Freight Forwarding", "company": {"name": "JD.COM", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Location:</strong> City of Industry, CA/Fontana, CA<br/><br/><strong>Job Type:</strong> Full-time (Contract to Hire)<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Responsible for cross-border air and ocean shipping and delivery of orders in the United States, including international freight arrangements, production of customs declaration documents, customs clearance coordination;</li><li>Communicate with overseas sales, operations and other functional departments to grasp the delivery situation as a whole, deal with various problems in the transportation process, deal with abnormal shipments, and update the shipping status in a timely manner;</li><li>Responsible for selecting logistics service providers and provide optimal logistics service solutions for business departments according to customers' business models;</li><li>Establish, maintain, and deepen the cooperative relations with the shipping and forwarding companies;</li><li>Responsible for integrating and optimizing cross-border air and ocean shipping and delivery resources, continuously reducing costs, optimizing operational efficiency, and improving profitability;</li><li>Organize the internal operation process, manage and coordinate cross-border related to supply chain solution, operation, and service modules.<br/><br/></li></ul><strong>Qualifications</strong><strong>：<br/><br/></strong><ul><li>Bachelor's Degree in supply chain, logistics or other related major;</li><li>More than 2 year of cross-border operations or freight forwarding experience (American line operations is preferred);</li><li>Proficient in Microsoft Excel, data-sensitive, good data analysis skill;</li><li>Excellent organization, collaboration and communication skills, service and teamwork oriented, strong sense of responsibility;</li><li>Ability to work in a fast-paced environment with multiple priorities and tight deadlines;</li><li>Bilingual proficiency in Chinese Mandarin and English.<br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology. For more information, visit https://corporate.jd.com/home<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots. For more information, visit https://www.jdl.cn/<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "postedDate": "1 month ago", "skills": ["Microsoft Excel", "Data Analysis", "Supply Chain", "Logistics", "Freight Forwarding", "Cross-border Operations", "Chinese Mandarin", "English"], "url": "https://www.linkedin.com/jobs/view/3960937743"}