{"jobTitle": "Office Manager", "company": {"name": "Shinkei", "industry": "Fisheries", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Administrative", "industry": "Fisheries", "description": "What You Get To Do\n\nOrder Management: Oversee the ordering, tracking, and inventory of office and project supplies, including parts crucial for robotics development. Facility Management: Manage utilities, ensure the office is clean, organized, and functional. Coordinate with cleaning staff and oversee the maintenance and repair of office equipment and facilities. Utility Management: Implement efficient power, water and trash systems, ensuring compliance with environmental standards. Administrative Support: Perform traditional office tasks including but not limited to answering phones, mail distribution, managing office schedules, and assisting with meeting preparations. Vendor Relations: Establish and maintain relationships with vendors, service providers, and landlords. Negotiate contracts to ensure cost-efficiency and reliability of services. Team Support: Assist in onboarding new employees, organizing team events, and maintaining a positive and productive office environment.", "responsibilities": "Order Management, Facility Management, Utility Management, Administrative Support, Vendor Relations, Team Support", "qualifications": {"required": "Proven experience as an Office Manager, Front Office Manager, or Administrative Assistant. Familiarity with office management procedures and basic accounting principles. Excellent knowledge of MS Office, particularly Excel. Strong organizational and planning skills in a fast-paced environment. A creative mind with an ability to suggest improvements. High school diploma; additional qualification as an administrative assistant or secretary will be a plus. Ability to work onsite 5 days per week in El Segundo office in Los Angeles.", "preferred": "Not specified"}, "skills": ["Office Management", "MS Office", "Organizational Skills", "Planning Skills", "Administrative Support"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3960452476"}