{"jobTitle": "Content Creator Intern", "company": {"name": "High Scale", "location": "Los Angeles, CA", "industry": "Advertising Services"}, "location": "Los Angeles, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Advertising Services", "description": "HighScale Ai, a trailblazing creative advertising agency, is actively seeking a talented Content Creator Intern who possesses a keen eye for visual storytelling and a passion for crafting compelling narratives across various platforms. If you're someone who thrives on creativity, this internship provides a unique opportunity to contribute to cutting-edge campaigns and enhance your skills in a dynamic and innovative environment.<br/><br/>Position: Content Creator Intern<br/><br/>Location: Downtown Los Angeles, CA (On-Site)<br/><br/><strong>About HighScale Ai:<br/><br/></strong>HighScale Ai is reshaping the advertising landscape through creative and technology-driven solutions. As a Content Creator Intern, you'll play a pivotal role in crafting engaging content for digital platforms while bringing your expertise in writing SMS and email promotional copy to the forefront.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li> Content Production: Develop creative and engaging content for various digital platforms, including social media, websites, and promotional materials.</li><li> Visual Storytelling: Bring ideas to life through visual storytelling, leveraging graphic design, photography, and video creation.</li><li> Copywriting Excellence: Utilize your experience in writing SMS and email promotional copy to enhance the impact of our campaigns.</li><li> Collaborative Ideation: Work closely with cross-functional teams to contribute innovative ideas for content strategies and campaigns.</li><li> Brand Consistency: Ensure consistency in brand messaging and visuals across all content platforms.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li> Pursuing a degree in Communications, Marketing, Media Studies, or a related field.</li><li> Strong creative portfolio showcasing content creation skills (graphic design, photography, video editing, etc.).</li><li> Proficiency in creative tools such as Adobe Creative Suite, Canva, Capcut, TikTok, Instagram, and Facebook.</li><li> Experience in writing SMS and email promotional copy.</li><li> Excellent written and verbal communication skills.</li><li> Passion for staying updated on industry trends and emerging content formats.<br/><br/></li></ul><strong>What We Offer:<br/><br/></strong><ul><li> Hands-on experience in a creative and collaborative environment.</li><li> Mentorship from experienced content creators and marketers.</li><li> Opportunities for professional development and growth.</li><li> Competitive compensation and potential for future full-time opportunities.<br/><br/></li></ul>HighScale Ai is committed to fostering an inclusive and diverse workplace. We encourage individuals from all backgrounds to apply.", "postedDate": "1 month ago", "skills": ["Adobe Creative Suite", "Canva", "Capcut", "TikTok", "Instagram", "Facebook", "SMS", "Email", "Content Creation", "Visual Storytelling", "Copywriting", "Graphic Design", "Photography", "Video Editing"], "url": "https://www.linkedin.com/jobs/view/3960005785"}