{"jobTitle": "Planning Technician/assistant Planner/associate Planner", "company": {"name": "City of Newport Beach", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Strategy/Planning", "industry": "Architecture and Planning", "description": "<strong>Definition<br/><br/></strong><strong>Come join the City of Newport Beach Community Development Department! Check out this </strong> <strong> video </strong> <strong>to see what working for the City of Newport Beach is like.<br/><br/></strong><strong> Currently, the Community Development Department has one flexibly staffed vacancy at either the Planning Technician, Assistant Planner, or Associate Planner level depending on the applicant's qualifications. <br/><br/></strong><strong>Selection Components<br/><br/></strong><ul><li> Application Evaluation: Applications will be accepted on a continuous basis with the first review date of July 8, 2024 . In order for the application package to be considered complete, candidates are required to attach their resume to the online application. The most qualified candidates will be invited to a virtual interview.</li><li> Virtual Interview: Those candidates deemed most qualified as reflected in their online application will be invited to a virtual interview tentatively scheduled for July 24, 2024 . Passing applicants will be placed on an eligibility list that may be used to fill future vacancies.<br/><br/></li></ul><strong>Salary<br/><br/></strong>Planning Technician: $5,498 - $8,125 Monthly<br/><br/>Assistant Planner: $6,045 - $ 8,940 Monthly<br/><br/>Associate Planner: $ 6,664 - $ 9,844 Monthly<br/><br/><strong>Career Path<br/><br/></strong>This position is part of the Planner Series beginning with Planning Technician, Assistant Planner, Associate Planner, Senior Planner, Principal Planner, and Planning Manager.<br/><br/><strong>Schedule<br/><br/></strong>This position has the potential to work a flexible schedule (e.g. 5/40, 9/80, or 4/10).<br/><br/><strong>CalPERS<br/><br/></strong>T he City offers an excellent benefit package and membership in the California Public Employees' Retirement System (CalPERS). The retirement formula is based on appointment date and membership status with CalPERS and the employee is required to contribute 11.5% of pay towards the retirement benefit.<br/><br/><strong>Essential Duties<br/><br/></strong>Please review the job specification for a more detailed description of essential duties:<br/><br/><ul><li> Planning Technician </li><li> Assistant Planner </li><li> Associate Planner <br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Please review the job specification for a more detailed description of specific qualifications:<br/><br/><ul><li> Planning Technician </li><li> Assistant Planner </li><li> Associate Planner <br/><br/></li></ul><strong>Experience &amp; Education And License/Certificate<br/><br/></strong>A combination of experience and education that would likely provide the required knowledge and abilities may be qualifying. A typical way to obtain the knowledge and abilities would be:<br/><br/><strong>Planning Technician<br/><br/></strong>Experience: Six months related work experience in urban planning is highly desirable. Experience in working with the public will also be considered.<br/><br/>Education: Graduation from an accredited college or university with a bachelor's degree in urban planning, environmental planning, geography, landscape architecture, or a related field.<br/><br/>License/Certificate: Due to the performance of some field duties which require the operation of a personal or City vehicle, a valid and appropriate California driver's license and an acceptable driving record are required.<br/><br/><strong>Assistant Planner<br/><br/></strong>Experience: One year of full-time professional planning experience.<br/><br/>Education: Graduation from an accredited college or university with a bachelor's degree in urban planning, environmental planning, geography, landscape architecture, or a closely related field.<br/><br/>License / Certificate: Due to the performance of some field duties which require the operation of a personal or City vehicle, a valid and appropriate California driver's license and an acceptable driving record are required.<br/><br/><strong>Associate Planner<br/><br/></strong>Experience: Two years of responsible and professional urban planning.<br/><br/>Education: Equivalent to a bachelor's degree from an accredited college or university with major coursework in planning, business or public administration, or a related field.<br/><br/>License(s): Due to the performance of some field duties, which require the operation of a personal or City vehicle, a valid and appropriate California driver’s license and an acceptable driving record is required.<br/><br/><strong>Please Note: </strong>Candidates deemed most qualified, as reflected in their application materials, will be invited to continue in the recruitment process. The prospective candidate must successfully complete a thorough background review, including being fingerprinted by the Newport Beach Police Department. The resulting report of your conviction history, (if any), will be evaluated along with the other information received in connection with your application. Except as otherwise required by law, a criminal conviction will not necessarily disqualify you from the position. The nature, date, surrounding circumstances, and the relevance of the offense to the position applied for may, however, be considered.<br/><br/><strong>Disaster Service Worker:</strong> In accordance with Government Code Section 3100, City of Newport Beach Employees, in the event of a disaster, are considered disaster service workers and may be asked to respond accordingly.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3960106916"}