{"jobTitle": "IRA Assistant", "company": {"name": "Birch Gold Group", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "20.00 - 25.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>Department: </strong>IRA<br/><br/><strong>Location: </strong>Remote<br/><br/><strong>Compensation: </strong>$20.00 - $25.00 / hour<br/><br/><strong>Description<br/><br/></strong>IRA Assistant develops IRA rate sheets and prepares transfers, distributions, rollovers, conversions, death claims, and closures in accordance with government regulations and bank policies. Maintains retirement records and is responsible for current and proper financial statements and reports.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Receive and process IRA work received through various channels including US mail, Fax, in support of the Brokers</li><li>Perform follow-up actions on transactions submitted through the Brokers with the objective of completing the appropriate transactions and ensuring the proper paperwork is received/executed as per IRS regulations and department policies and procedures</li><li>Properly document actions taken on requests and if necessary communicate any issues to the Broker following department guidelines</li><li>Communicate with customers via phone and or email if required to verify instructions or confirm transactions</li><li>Review all work items for accuracy and compliance with department guidelines and IRS rules and regulations</li><li>Demonstrate understanding of the systems and training documentation supporting IRA transactions<br/><br/></li></ul><strong>Transactions<br/><br/></strong><ul><li>Process IRA account changes received through all channe</li><li>Review and process requests for IRA Beneficiary Changes received through all channels</li><li>Complete Transaction Logs as per department guidelines<br/><br/></li></ul><strong>Documents<br/><br/></strong><ul><li>Receive and prepare IRA documents received through the IRA Service Center and from Call Center Representatives for mailing to customers complete document Logs as per department guidelines</li><li>Receive, audit or distribute IRA documents and signature cards returned through the US mail and interoffice</li><li>May be asked to follow up on outstanding requests</li><li>May be asked to order duplicate 1099R's and 5498 reports for customers<br/><br/></li></ul><strong>Skills Knowledge And Expertise<br/><br/></strong><strong>Communications - </strong>Exhibit good listening and comprehension. Express ideas and thoughts in written form. Express ideas and thoughts verbally. Keep others adequately informed. Select and use appropriate communication methods.<br/><br/><strong>Dependability </strong>- Commit to doing the best job possible. Follow instruction. Keep commitments. Meet attendance and punctuality guidelines. Respond to requests for service and assistance. Take responsibility for own actions.<br/><br/><strong>Planning &amp; Organization - </strong>Integrate changes smoothly. Plan for additional resources. Prioritize and plan work activities. Set goals and objectives. Use time efficiently. Work in an organized manner.<br/><br/><strong>Quality - </strong>Foster quality focus in others. Improve processes. Measure key outcomes. Set clear quality requirements. Solicit and apply customer feedback.<br/><br/><strong>Use of Technology - </strong>Adapt to new technologies. Demonstrate required skills. Keep technical skills up to date. Troubleshoot technological problems. Use technology to increase productivity.<br/><br/><strong>Work Environment</strong> - The working conditions of this position include working in a remote fashion and autonomous environment. The environment must be free of distractions and provide a space to conduct business in a confidential manner. Able to work autonomously as well as collaboratively with team in a remote environment.<br/><br/><strong>Initiative - </strong>Asks for help when needed. Looks for and takes advantage of opportunities. Seeks increased responsibilities. Takes independent actions and calculated risks. Undertakes self-development activities. Volunteers readily<br/><br/><strong>Benefits<br/><br/></strong>Medical, Dental, Vision, 401k<br/><br/>Vacation: 2 weeks, up to 3<br/><br/>Paid Holidays<br/><br/>Opportunity for Commission<br/><br/>Work From Home", "responsibilities": "IRA Assistant develops IRA rate sheets and prepares transfers, distributions, rollovers, conversions, death claims, and closures in accordance with government regulations and bank policies. Maintains retirement records and is responsible for current and proper financial statements and reports.", "qualifications": {"required": "Exhibit good listening and comprehension. Express ideas and thoughts in written form. Express ideas and thoughts verbally. Keep others adequately informed. Select and use appropriate communication methods.<br/><br/>Commit to doing the best job possible. Follow instruction. Keep commitments. Meet attendance and punctuality guidelines. Respond to requests for service and assistance. Take responsibility for own actions.<br/><br/>Integrate changes smoothly. Plan for additional resources. Prioritize and plan work activities. Set goals and objectives. Use time efficiently. Work in an organized manner.<br/><br/>Foster quality focus in others. Improve processes. Measure key outcomes. Set clear quality requirements. Solicit and apply customer feedback.<br/><br/>Adapt to new technologies. Demonstrate required skills. Keep technical skills up to date. Troubleshoot technological problems. Use technology to increase productivity.<br/><br/>Able to work autonomously as well as collaboratively with team in a remote environment.<br/><br/>Asks for help when needed. Looks for and takes advantage of opportunities. Seeks increased responsibilities. Takes independent actions and calculated risks. Undertakes self-development activities. Volunteers readily"}, "skills": ["IRA", "IRS", "Government Regulations", "Financial Statements", "Retirement Records", "Customer Service", "Communication", "Dependability", "Planning & Organization", "Quality", "Use of Technology", "Initiative"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision, 401k<br/><br/>Vacation: 2 weeks, up to 3<br/><br/>Paid Holidays<br/><br/>Opportunity for Commission<br/><br/>Work From Home", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3960292157"}