{"jobTitle": "Associate Merchandise Planner", "company": {"name": "Alo Yoga", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "80,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "<strong>WHY JOIN ALO?<br/><br/></strong>Mindful movement. It’s at the core of why we do what we do at Alo—it’s our calling. Because mindful movement in the studio leads to better living. It changes who yogis are off the mat, making their lives and their communities better. That’s the real meaning of studio-to-street: taking the consciousness from practice on the mat and putting it into practice in life.<br/><br/><strong>OVERVIEW<br/><br/></strong>Being a part of the Alo team as an Associate Planner comes with great responsibilities. It’s more than just planning inventory and sales for Retail Stores and Ecommerce. It’s about being a part of Alo’s mission and vision of studio to street and elevating the experience each store offers. It’s about getting product to our Guest seamlessly. As our Associate Planner, your responsibilities will include, but not limited to:<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Execute and communicate strategic merchandise financial plans and strategies that support merchandising, marketing, and financial objectives for Retail Stores and Ecommerce.</li><li>Create pre-season sales, gross margin and inventory plans by division/category that support the Buying and Merchandising product strategies. Collaborate with Buying counterpart to align on both tops down and bottoms up division plans. </li><li>Drive the OTB process for owned categories, analyzing historical data and current trends to identify risks and opportunities by channel.</li><li>Recap and analyze actual sales results to plan and forecast in-season sales and inventory on a weekly, monthly and quarterly basis.</li><li>Create and manage sales and inventory plans for all core replenishment styles to meet department financial goals.</li><li>Analyze sales trends and inventory levels as they relate to static and dynamic levels in the replenishment system. Ensure appropriate inventory to meet in-stock targets.</li><li>Create and publish various weekly Merchandise Planning reports.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor's Degree</li><li>2 - 3 years in merchandise planning or inventory management. Allocation experience a plus.</li><li>Able to organize and prioritize workload to meet demands with a sense of urgency.</li><li>Strong aptitude for numbers, retail math skills, and understanding of forecasting methodologies.</li><li>Utilizes analytical and problem-solving skills to achieve company and division KPIs.</li><li>Display strong listening, written, and oral communication skills.</li><li>Ability to positively influence others by fostering a motivating work outlook with emphasis on team collaboration.</li><li>Advanced Excel skills required.</li><li>Anaplan and Tableau experience a plus.<br/><br/></li></ul>The base salary range for this position is $80,000-$90,000 per year which represents the current range for the base salary for this exempt position. Please note that actual salaries will vary based on factors including but not limited to location, experience, and performance. As such, on occasion and when applicable, there is the possibility that the final, agreed-upon base salary may be outside of the upper end of the range. Please also note the range listed is just one component of the company’s total rewards package for exempt employees. Other rewards may include performance bonuses, long term incentives, a PTO policy, and many other progressive benefits.<br/><br/>Please review our company California Job Applicant Privacy Policy HERE.<br/><br/>", "responsibilities": "Execute and communicate strategic merchandise financial plans and strategies that support merchandising, marketing, and financial objectives for Retail Stores and Ecommerce. Create pre-season sales, gross margin and inventory plans by division/category that support the Buying and Merchandising product strategies. Collaborate with Buying counterpart to align on both tops down and bottoms up division plans. Drive the OTB process for owned categories, analyzing historical data and current trends to identify risks and opportunities by channel. Recap and analyze actual sales results to plan and forecast in-season sales and inventory on a weekly, monthly and quarterly basis. Create and manage sales and inventory plans for all core replenishment styles to meet department financial goals. Analyze sales trends and inventory levels as they relate to static and dynamic levels in the replenishment system. Ensure appropriate inventory to meet in-stock targets. Create and publish various weekly Merchandise Planning reports.", "qualifications": {"required": "Bachelor's Degree, 2 - 3 years in merchandise planning or inventory management. Allocation experience a plus. Able to organize and prioritize workload to meet demands with a sense of urgency. Strong aptitude for numbers, retail math skills, and understanding of forecasting methodologies. Utilizes analytical and problem-solving skills to achieve company and division KPIs. Display strong listening, written, and oral communication skills. Ability to positively influence others by fostering a motivating work outlook with emphasis on team collaboration. Advanced Excel skills required.", "preferred": "Anaplan and Tableau experience a plus."}, "skills": ["Merchandise Planning", "Inventory Management", "Retail Math", "Forecasting", "Analytical Skills", "Problem Solving", "Communication", "Team Collaboration", "Excel", "Anaplan", "Tableau"], "postedDate": "1 week ago", "benefits": "The base salary range for this position is $80,000-$90,000 per year which represents the current range for the base salary for this exempt position. Please note that actual salaries will vary based on factors including but not limited to location, experience, and performance. As such, on occasion and when applicable, there is the possibility that the final, agreed-upon base salary may be outside of the upper end of the range. Please also note the range listed is just one component of the company’s total rewards package for exempt employees. Other rewards may include performance bonuses, long term incentives, a PTO policy, and many other progressive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3960526384"}