{"jobTitle": "Mid Level Emergency Management Planner", "company": {"name": "Tetra Tech", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000 - 85,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Civil Engineering", "description": "Discover your full potential. At Tetra Tech, we are collaborating with industry-leading experts for a sustainable future for our world. We combine consulting and engineering with advanced analytics and technology to solve the world’s most complex challenges. Our innovation hubs across the globe will enable you to share ideas and best practices while growing your professional network. Wherever you are in your career journey, you will benefit from working with world-class engineers, scientists, and technical specialists.<br/><br/>Tetra Tech is seeking an experienced <strong>Mid-Level Emergency Management Planner</strong> in <strong>California</strong> in a <strong>Remote</strong> capacity. This position provides emergency management planning, response and recovery services to local, district and state governments, private businesses, universities and other institutions in a regionally-defined area. The selected candidate will be responsible for effectively and efficiently supporting multiple simultaneous projects. Responsibilities for this position involve designing, developing, and delivering emergency management consulting services that could include, but are not limited to: strategic planning, meeting coordination and facilitation, risk assessment, emergency operations planning, gap analysis, continuity of operations (COOP) and business continuity planning (BCP), policy and regulatory analysis, evacuation planning, recovery planning, multi-jurisdictional coordination, communication planning, after-action assessments, as well as evaluation, training and exercise programs.<br/><br/><strong>Salary Range</strong>: $65,000 - $85,000 (based on experience)<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Five (5) years of emergency management experience. City, County, District or State-level emergency management experience preferred.</li><li>Understanding of the FEMA six-step planning process, emergency management exercise programs, and principles.</li><li>Successful completion of Incident Command System (ICS) and National Incident Management System (NIMS) courses (such as through FEMA’s Emergency Management Institute classroom and/or on-line training programs) and recognized training and/or education in emergency management, public health, continuity, and/or strategic planning.</li><li>Successful completion of the Homeland Security Exercise and Evaluation Program (HSEEP) training.</li><li>Familiarity with FEMA Homeland Security grant programs, a plus.</li><li>Understanding of basic project management concepts including client management and performing to the project scope and timeline under the guidance of the project manager.</li><li>Must be able to work independently and effectively coordinate projects at the ground level on a daily basis on behalf of the project manager.<br/><br/></li></ul>Desired Skills in the ideal candidate include but are not limited to:<br/><br/><ul><li>Demonstrated ability to establish priorities to complete work in a timely manner, despite changes in workload or assignment, pressure of deadlines, or competing priorities.</li><li>Demonstrated ability to work independently and follow through on assignments with minimal direction.</li><li>Proficiency with Microsoft Office applications (Word, Excel, Access, and PowerPoint).</li><li>Strong written and verbal communications skills.</li><li>Works well within a team structure.</li><li>Experience reaching consensus with multiple stakeholders that have different goals and opinions.</li><li>Excellent time management, problem solving, and organizational skills. <br/><br/></li></ul><strong>Education And Certifications<br/><br/></strong>Bachelor's degree from an accredited college in emergency management or related field is preferred.<br/><br/><strong>Preferred Certifications Include<br/><br/></strong><ul><li>Certified Emergency Manager (CEM) or Associate Emergency Manger (AEM) from IAEM</li><li>Certified Continuity Planner from either DRII or FEMA</li><li>Master Exercise Practitioner (MEP)</li><li>Assessor for the Emergency Management Accreditation Program (EMAP)<br/><br/></li></ul><strong>Work Environment<br/><br/></strong>Generally, the consultant will work in an office environment and use computer and telephone to conduct business. This position requires travel which will be intermittent and scheduled based on client needs, but may last for up to a week at a time. During travel periods, the work environment will vary between an office setting and a field setting for client meetings or drills/exercises. Drills/exercises may take place in austere conditions or inclement weather<br/><br/><strong>About Tetra Tech<br/><br/></strong>Tetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in more than 450 locations around the world. Our reputation rests on the technical expertise and dedication of our employees—21,000 associates working together to provide smart, scalable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development.<br/><br/>Explore our open positions at https://www.tetratech.com/careers. Follow us on social media to learn more about our people, culture, and opportunities:<br/><br/>LinkedIn: @TetraTechCareers<br/><br/>Twitter: @TetraTechJobs<br/><br/>Facebook: @TetraTechCareers<br/><br/><strong>Tetra Tech</strong> is proud to be an Equal Opportunity Employer. Diversity, inclusion, and equity are among Tetra Tech’s core values. Throughout our history, the company has prioritized equitable inclusion of all people. All qualified candidates will be considered without regard to race, color, religion, national origin, military or veteran status, gender, age, disabilities, sexual orientation, gender identity, pregnancy and pregnancy-related conditions, genetic information and any other characteristics protected by the law. We invite resumes from all interested parties. Please visit our website at www.tetratech.com to see the array of diverse services and exciting projects we are currently working on.<br/><br/>Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions.<br/><br/>We thank all applicants for their interest, however, only those candidates selected for interviews will be contacted.<br/><br/><strong>Please no phone calls or agencies.<br/><br/></strong>Additional Information<br/><br/><ul><li> Organization: 105 TDR</li></ul>", "responsibilities": "This position provides emergency management planning, response and recovery services to local, district and state governments, private businesses, universities and other institutions in a regionally-defined area. The selected candidate will be responsible for effectively and efficiently supporting multiple simultaneous projects. Responsibilities for this position involve designing, developing, and delivering emergency management consulting services that could include, but are not limited to: strategic planning, meeting coordination and facilitation, risk assessment, emergency operations planning, gap analysis, continuity of operations (COOP) and business continuity planning (BCP), policy and regulatory analysis, evacuation planning, recovery planning, multi-jurisdictional coordination, communication planning, after-action assessments, as well as evaluation, training and exercise programs.", "qualifications": {"required": "Five (5) years of emergency management experience. City, County, District or State-level emergency management experience preferred.\nUnderstanding of the FEMA six-step planning process, emergency management exercise programs, and principles.\nSuccessful completion of Incident Command System (ICS) and National Incident Management System (NIMS) courses (such as through FEMA’s Emergency Management Institute classroom and/or on-line training programs) and recognized training and/or education in emergency management, public health, continuity, and/or strategic planning.\nSuccessful completion of the Homeland Security Exercise and Evaluation Program (HSEEP) training.\nFamiliarity with FEMA Homeland Security grant programs, a plus.\nUnderstanding of basic project management concepts including client management and performing to the project scope and timeline under the guidance of the project manager.\nMust be able to work independently and effectively coordinate projects at the ground level on a daily basis on behalf of the project manager.", "preferred": "Bachelor's degree from an accredited college in emergency management or related field is preferred.\nCertified Emergency Manager (CEM) or Associate Emergency Manger (AEM) from IAEM\nCertified Continuity Planner from either DRII or FEMA\nMaster Exercise Practitioner (MEP)\nAssessor for the Emergency Management Accreditation Program (EMAP)"}, "skills": ["Emergency Management", "FEMA", "Incident Command System", "National Incident Management System", "Homeland Security Exercise and Evaluation Program", "Project Management", "Microsoft Office", "Communication", "Teamwork", "Stakeholder Management", "Time Management", "Problem Solving", "Organizational Skills"], "postedDate": "2 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3960647345"}