{"jobTitle": "Financial Quantitative Analyst", "company": {"name": "Tripalink", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$95,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "About Us: Founded in 2016, Tripalink Corp. is a technology-driven residential brand specializing in co-living and standard apartments tailored for students and working professionals. It delivers a high-quality, economical, and engaging living experience through attentive services and an all-in-one technology platform that centers around the customer. As an important component of improving renters’ journey, Tripalink Corp. launched an App that allows renters to search for apartments, e-sign the lease agreement, manage their home including paying rent, requesting maintenance and cleaning, call community shuttles, use community perks, and sign up for various events etc. With ever-evolving physical living products and technology-empowered operations, Tripalink Corp. can provide the best living experience for its target renters. The company currently manages about 6,000 bed spaces in Los Angeles, Irvine, Seattle, Philadelphia, Pittsburgh, Tucson, Austin, Chicago, San Francisco, and Berkeley.", "responsibilities": "Perform in-depth financial quantitative analyses of new housing acquisition and development opportunities and access the viability of each proposed investment. Perform project cost and budget analysis, return on investment (ROI) analysis, and cash flow projection to predict the profitability and access the risks by applying financial, mathematical, and statistical techniques. Develop a statistical pricing model that is based on machine learning techniques and trained with historical user data, to automate the pricing procedure for each leasing unit and boost the working efficiency of the sales team. Prepare weekly and monthly financial analysis reports of existing investment and development projects. Support all aspects of the fundraising cycle including fundraising campaign concept generation, deck preparation, campaign launching, limited partner due diligence on venture capital and private equity funds, and closing of investors’ capital commitment.", "qualifications": {"required": "U.S. Master's Degree in Applied Finance, Financial Engineering, or related", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3960265020"}