{"jobTitle": "Executive Director, Social Marketing - TV", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA", "industry": "Entertainment Providers"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "150K to $180K", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "The Sony Pictures Television Studios Brand team positions, launches, sustains and builds brands across all traditional and emerging platforms. Brand building and consumer activation is key to driving business results throughout the multi-windowed lifespan of a series.<br/><br/>Reporting to VP, Brand Marketing the Executive Director Social Marketing will be responsible for assisting in the development of Social Strategies and content-based marketing initiatives for Sony Pictures Television (SPT) properties and the brand. The Executive Director will support the Vice President in the creation and execution of these initiatives in an effort to increase Sony Pictures Television (SPT) series awareness, tune-in, and brand awareness.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Execute a cohesive social media content strategy that aligns with the brand's voice, goals, and key performance indicators (KPIs).</li><li>Strategize in partnership with the Brand Marketing team to drive and elevate Brand and social marketing of SPT series throughout all windows of distribution.</li><li>Craft and curate platform-specific content from concept, script, to finalized piece across all social media platforms, including but not limited to Instagram, TikTok, Facebook, X, and YouTube, that captivates our audience, solidifies our brand's presence, drives engagement, increases followers, and encourages brand interaction.</li><li>Create ongoing, multi-title promotional series rooted in audience behavior, motivations, and content thematic.</li><li>Oversee the social media content calendar, ensuring a consistent and strategic posting schedule.</li><li>Develop and create internal strategy documents for social media campaigns/initiatives.</li><li>Create benchmarks for Sony Pictures Television by analyzing industry standards, competitor performance, and internal historical data to set measurable goals and track the effectiveness of social media strategies.</li><li>Analyze social media performance data to understand the effectiveness of different content types and strategies, adjusting plans accordingly for optimal reach and engagement.</li><li>Develop, evaluate, and execute paid brand media campaigns for SPT properties.</li><li>Manage all third-party relationships and yearly renewals.</li><li>Be comfortable working with talent (celebrities) and management teams to get social media requests fulfilled.</li><li>Maintain a roster of relationships across the Brand landscape (Facebook, Twitter, Google, YouTube, Snapchat, etc.) with an immediate ability to execute both short and long-term marketing goals of all SPT teams – keep a keen eye on new product releases for all social networks.</li><li>Monitor trends in social media tools, applications, channels, design, and strategy.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>A minimum of 7 to 9 years of experience working in social media marketing, entertainment preferred. </li><li>Avid user of social networking sites including Twitter, Facebook, Snapchat, Instagram, Pinterest, reddit and Tumblr with solid understanding of the current feature set of each platform</li><li>Digital content producer experience</li><li>Ability to analyze and learn from reporting data and insights</li><li>Creative mindset with ability to layer on strategy</li><li>Skill with Photoshop, Illustrator, video editing software and other creative tools a plus</li><li>Deep understanding and passion for the entertainment, television, and Brand industries</li><li>Excellent communication and interpersonal skills to develop strong relationships internally and externally</li><li>Knowledge of web production processes and tools<br/><br/></li></ul><strong>About Sony Pictures Television Studio<br/><br/></strong>Sony Pictures Television Studios (SPTS) is one of the industry’s leading content providers, producing programming worldwide across genres and platforms. As the largest independent TV studio in the industry, SPTS produces 50+ shows each year including THE BOYS, COBRA KAI, THE GOOD DOCTOR, OUTLANDER, and PLATONIC. SPTS is part of the larger Sony Pictures Television (SPT) division. SPT is a Sony Pictures Entertainment Company, a subsidiary of Tokyo-based Sony Group Corporation. <br/><br/>The anticipated base salary for this position is $150K to $180K. This role may also qualify for annual incentive and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.<br/><br/>To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "responsibilities": "Execute a cohesive social media content strategy that aligns with the brand's voice, goals, and key performance indicators (KPIs).<br/>Strategize in partnership with the Brand Marketing team to drive and elevate Brand and social marketing of SPT series throughout all windows of distribution.<br/>Craft and curate platform-specific content from concept, script, to finalized piece across all social media platforms, including but not limited to Instagram, TikTok, Facebook, X, and YouTube, that captivates our audience, solidifies our brand's presence, drives engagement, increases followers, and encourages brand interaction.<br/>Create ongoing, multi-title promotional series rooted in audience behavior, motivations, and content thematic.<br/>Oversee the social media content calendar, ensuring a consistent and strategic posting schedule.<br/>Develop and create internal strategy documents for social media campaigns/initiatives.<br/>Create benchmarks for Sony Pictures Television by analyzing industry standards, competitor performance, and internal historical data to set measurable goals and track the effectiveness of social media strategies.<br/>Analyze social media performance data to understand the effectiveness of different content types and strategies, adjusting plans accordingly for optimal reach and engagement.<br/>Develop, evaluate, and execute paid brand media campaigns for SPT properties.<br/>Manage all third-party relationships and yearly renewals.<br/>Be comfortable working with talent (celebrities) and management teams to get social media requests fulfilled.<br/>Maintain a roster of relationships across the Brand landscape (Facebook, Twitter, Google, YouTube, Snapchat, etc.) with an immediate ability to execute both short and long-term marketing goals of all SPT teams – keep a keen eye on new product releases for all social networks.<br/>Monitor trends in social media tools, applications, channels, design, and strategy.", "qualifications": {"required": "A minimum of 7 to 9 years of experience working in social media marketing, entertainment preferred. <br/>Avid user of social networking sites including Twitter, Facebook, Snapchat, Instagram, Pinterest, reddit and Tumblr with solid understanding of the current feature set of each platform<br/>Digital content producer experience<br/>Ability to analyze and learn from reporting data and insights<br/>Creative mindset with ability to layer on strategy<br/>Skill with Photoshop, Illustrator, video editing software and other creative tools a plus<br/>Deep understanding and passion for the entertainment, television, and Brand industries<br/>Excellent communication and interpersonal skills to develop strong relationships internally and externally<br/>Knowledge of web production processes and tools", "preferred": ""}, "skills": ["Social Media Marketing", "Social Media Strategy", "Content Marketing", "Social Media Management", "Social Media Analytics", "Digital Marketing", "Brand Marketing", "Marketing Strategy", "Content Creation", "Social Media Advertising", "Paid Media", "Digital Content Production", "Photoshop", "Illustrator", "Video Editing", "Entertainment Industry", "Television Industry", "Brand Management", "Communication", "Interpersonal Skills", "Web Production"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3960653621"}