{"jobTitle": "Director of Communications", "company": {"name": "Catalina Island Conservancy", "location": "Long Beach, CA", "industry": "Non-profit Organizations"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "125,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Non-profit Organizations", "description": "WORLD LEADER IN CONSERVATION:\nThe Catalina Island Conservancy is a non-profit organization whose mission is to be an exemplary steward of island resources through a balance of conservation, education, and recreation. We preserve and restore the environment on Catalina, promoting and modeling ecologically sustainable communities to create a healthier future for this Island and our Earth.\n<br/>\nPOSITION SUMMARY:\nReporting to the Chief of External Affairs, the Director of Communications is responsible for leading the day- to- day management of the Communications program at Catalina Island Conservancy. The position will be working in partnership with the Chief of External Affairs and the Leadership Team and managing a small team of employees and consultants responsible for communications, marketing, digital branding, and external communications.\nThe ideal candidate will be a strong leader with a proven track record of setting strategy, establishing priorities, and ensuring follow-through to achieve organizational goals. This role requires a visionary thinker who can translate complex ideas into actionable plans, inspire and lead a diverse team, and drive performance to deliver exceptional results.\n<br/>\nThe position ensures that the Catalina Island Conservancy editorial strategies, messaging, and branding are understood and adhered to in all work produced by the organization. The successful candidate will possess excellent persuasive writing and communication skills, superior project management acumen, and be a proactive builder of relationships.\n<br/>\nThis role is considered hybrid remote; based out of the Long Beach office, with two days expected in office weekly and frequent boat travel to Catalina Island.\n<br/>\nBACKGROUND:\nFounded in 1972, the Catalina Island Conservancy, one of California’s oldest and largest private land trusts, opens its wildlands for the public to enjoy in many ways. Just off the densely populated Southern California coast, Catalina Island is home to approximately 4,000 year-round residents and more than 60 endemic species of plants and animals found nowhere else on Earth. The Catalina Island Conservancy protects 88 percent of Catalina Island’s approximately 48,000 acres. Conservancy staff guide Island ecosystem recovery with the goal of generating a resilient, self-sustaining ecosystem with no endangered forms of life. The Conservancy offers recreational experiences and educational programs for not only the 300,000 annual visitors who choose to spend time in the Island’s wildlands, but also inspires nearly 1.4 million visitors to other parts of the Island. The Conservancy\nprovides access to Catalina Island’s wildlands with nearly 165 miles of recreational roads and trails, and 62 miles of unspoiled beaches and coves for camping, biking, hiking, touring, and more.\n<br/>\nA TIMELESS PLACE, AN ENDLESS PURPOSE: TURNING VISION INTO ACTION:\nThe Conservancy’s five-year strategic plan, A Timeless Place, an Endless Purpose: Turning Vision into Action, details the visions, actions, and indicators of success that will fulfill its mission to be an exemplary steward of Island resources through a balance of conservation, education, and recreation. It focuses on realizing five major visions, the first of which is completion of the Catalina Island Restoration Project, which involves the removal of non-native mule deer and the restoration of native flora and fauna at the landscape level.\n<br/>\nCAMPAIGN:\nThe Conservancy is planning and preparing for the implementation of a major, multiyear comprehensive fundraising campaign, anchored in the Island Restoration Project to include strategic priorities in education, conservation, and recreation. The Conservancy is currently engaging consultants and partners in developing a brand identity for the campaign, which seeks to increase overall giving and grow membership substantially.\n<br/>\nEDUCATION/EXPERIENCE:\nThis position must have a superb ability to develop and implement consistent content and editorial strategies that meet and exceed objectives across the organization, and has a passion for the mission of conservation, education, and recreation. It requires proven experience in a leadership role, with a track record of setting and achieving strategic goals. The Director regularly reports on progress toward set goals, along with analysis and results of projects based in the program. The Director must be a brilliant strategist and creative communications professional with at least 7-10 years of experience in internal and external communications. Believing that brand is embedded in people and the work they do together and the organizations that advance missions, the Director will be a results-oriented change maker, integrated marketing, public relations, and communications leader, focused on internal brand messaging, including executive messaging, and an agile problem solver.\nA successful candidate will possess experience with Crisis Communications, experience with environmental, conservation, climate, outdoor and recreation, travel journalism, and/or experiential learning. Preference for candidates with national and international experience in pitching stories and developing content. Experience in coaching and prepping staff for media interviews and on-camera appearances. Experience overseeing social media strategy and content creation is essential.\nThis position partners closely with the Chief of External Affairs and the President & CEO of the organization. The successful candidate will be a proven manager of broad-based and personalized communications in multiple platforms, including print, digital, and video. In leading the Communications and Marketing team, this role will inspire and guide the team to develop, execute, and measure successful communications program plans. The role also includes the management and development of senior staff and team members. Working closely with the Chief of External Affairs, the Communications Director monitors budgets, implements systems, procedures, and practices for the communications department. The Director of Communications supports fundraising success by crafting persuasive and accurate communications. The role provides leadership for the team and the organization overall, with communications aimed at a broad external audience base.\nThe Director of Communications also supports and executes the vision of the President & CEO by supporting the articulation of thought and position papers, speeches, and articles, along with executing against branding, marketing, and media platform objectives.\n<br/>\nESSENTIAL DUTIES, RESPONSIBILITIES & CAPABILITIES:\n• Develop and implement a strategic communications plan.\n• Excellent communication and interpersonal skills, with the ability to inspire and influence others.\n• Develop, implement, and ensure adherence to vision for organization-wide communications.\n• Demonstrated ability to manage multiple priorities and deliver results in a fast-paced environment.\n• Serve as project manager (traffic control) responsible for coordinating and managing the development of all communications pieces in print or digital.\n• Develop custom gift proposals, templates, and the suite of collateral materials for major gift and campaign program.\n• Maintain close effective relationships with all departments, working across program, conservation, education, recreation, and operational staff, to ensure that the Conservancy’s mission is clearly articulated.\n• Assist in and help to oversee all content for website and assist in the design, development and dissemination of print and web materials.\n• Work with Communications and Development teams to develop donor impact stories for reports, publications, websites, and videos.\n• Provide a rigorous, systematic review of and analysis of all communications activities to find ways to do things more efficiently and effectively.\n• Oversee all brand development and management; marketing and media, and copywriting, editing, content creation.\n<br/>\nREQUIRED QUALIFICATIONS:\nKNOWLEDGE/SKILLS:\n• Strategic communications\n• Brand development\n• Internal and executive communications\n• Public communications\n• Public relations and positioning\n• Media relations\n• Brand management and awareness\n• Crisis communications\n• Marketing\n• Copywriting\n• Content creation\n• Publications and collateral development\n• Audience research\n• Website management\n• Campaign development\n<br/>\nDEMANDS:\n• The work locations have moderate noise levels and is a non-smoking environment.\n• The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job: the authority of the job duties are performed in an office environment; the employee must occasionally lift and/or move up to 25 pounds.\n<br/>\nCOMPENSATION & BENEFITS:\nThe upper portion of the salary range is typically reserved for existing employees who demonstrate strong performance over time. Starting salary will vary by qualifications, and prior experience. We pay competitively in the nonprofit space and offer a robust benefits package.\n<br/>\nCatalina Island Conservancy provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "responsibilities": "• Develop and implement a strategic communications plan.\n• Excellent communication and interpersonal skills, with the ability to inspire and influence others.\n• Develop, implement, and ensure adherence to vision for organization-wide communications.\n• Demonstrated ability to manage multiple priorities and deliver results in a fast-paced environment.\n• Serve as project manager (traffic control) responsible for coordinating and managing the development of all communications pieces in print or digital.\n• Develop custom gift proposals, templates, and the suite of collateral materials for major gift and campaign program.\n• Maintain close effective relationships with all departments, working across program, conservation, education, recreation, and operational staff, to ensure that the Conservancy’s mission is clearly articulated.\n• Assist in and help to oversee all content for website and assist in the design, development and dissemination of print and web materials.\n• Work with Communications and Development teams to develop donor impact stories for reports, publications, websites, and videos.\n• Provide a rigorous, systematic review of and analysis of all communications activities to find ways to do things more efficiently and effectively.\n• Oversee all brand development and management; marketing and media, and copywriting, editing, content creation.", "qualifications": {"required": "• Strategic communications\n• Brand development\n• Internal and executive communications\n• Public communications\n• Public relations and positioning\n• Media relations\n• Brand management and awareness\n• Crisis communications\n• Marketing\n• Copywriting\n• Content creation\n• Publications and collateral development\n• Audience research\n• Website management\n• Campaign development"}, "skills": ["Strategic Communications", "Brand Development", "Internal Communications", "Executive Communications", "Public Communications", "Public Relations", "Media Relations", "Brand Management", "Crisis Communications", "Marketing", "Copywriting", "Content Creation", "Publications", "Collateral Development", "Audience Research", "Website Management", "Campaign Development"], "postedDate": "1 month ago", "benefits": "We pay competitively in the nonprofit space and offer a robust benefits package.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3960268813"}