{"jobTitle": "Director, Healthcare Human Capital and Workforce Management", "company": {"name": "Alvarez & Marsal", "location": "Los Angeles, CA", "industry": "Business Consulting and Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$160,000.00/yr - $180,000.00/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Business Consulting and Services", "description": "<strong>Description<br/><br/></strong>Alvarez &amp; Marsal (A&amp;M) is a premier independent global professional services firm specializing in providing turnaround management, restructuring, performance improvement and corporate advisory services.<br/><br/>The Healthcare Industry Group (HIG), a subsidiary of A&amp;M, is an established leader known for delivering tangible results for healthcare c-suite executives, boards, private equity firms, investors, law firms and government agencies that are facing complex challenges. We are at the forefront of delivering transformational change to the healthcare industry. Our professionals advise our clients on strategic, financial, operational, and market performance by assessing all aspects of their operations and providing comprehensive services, including analyzing revenue and financial information, conducting process reviews, identifying key business drivers, and managing risk and compliance issues.<br/><br/><strong>About The Healthcare Human Capital And Workforce Management Practice<br/><br/></strong>A practice within the Healthcare Industry Group (HIG), the Human Capital and Workforce Management practice is comprised of knowledgeable workforce management and human resources professionals experienced in the healthcare space. This team leads transformational work to meet client goals in a rapidly evolving and dynamic labor market that includes post-transaction integration, organizational design, alignment of staffing to business strategy and demand, change management, workforce cost takeout, and development of talent acquisition, employee engagement and management strategies.<br/><br/>As part of the Human Capital and Workforce Management team, you will have the opportunity to work with clients in a variety of sectors including: health systems and providers, physician groups, ancillary providers, medical schools, vision, laboratory, dental and behavioral health, managed care and health plans, government plans and programs, healthcare investors and lenders, medical devices, healthcare suppliers and infrastructure, life sciences, pharma, and biotech.<br/><br/><strong><em>What are we looking for? <br/><br/></em></strong>We are seeking someone to join our team with an entrepreneurial and collaborative mindset who will manage ambiguity and thrive in a fast-paced environment. As a Director you will have the opportunity to develop a team environment where you and your team members embrace a commitment to quality work and continuous improvement. You will use your judgment to assign and delegate project responsibilities while balancing the need for efficiency and providing on the job training opportunities to further develop staff skillsets.<br/><br/><ul><li>High energy individuals and leaders with a passion for healthcare and solving complex issues</li><li>A minimum of ten (10) years of prior work experience in Human Resources or Workforce Management in a healthcare setting. Prior consulting experience is required.</li><li>BA/BS degree and/or MBA/MS in Human Resources, Organizational Development, Business, or a similar field of study.</li><li>Working knowledge of the healthcare industry, including a fundamental understanding of healthcare finance, operations, valuation and various laws and regulations</li><li>Expertise in a given human capital or workforce management area including HR M&amp;A, organizational design, and human resources leadership</li><li>Depth of experience with private equity clients will be heavily considered</li><li>Excellent verbal and written skills, with the ability to communicate with and present information to all levels of client personnel</li><li>Advanced Microsoft PowerPoint and Word skills</li><li>Willingness and ability to travel as required<br/><br/><br/></li></ul><strong><em>What will you be doing?<br/><br/></em></strong>As a Director you will be leading a team and acting as the main conduit between Healthcare clients and our team on a range of complex assignments. You will manage projects by overseeing interview activities, gathering of relevant data, developing goals and deadlines, reviewing work product of junior staff, serving as a subject matter expert, and communicating with senior executive level clients directly. Depending on the client project the responsibilities of a Director may typically include:<br/><br/><ul><li>Effectively designing, managing, and leading practice organizational transformation plans and teams while meeting deadlines and managing on-time deliverables</li><li>Knowledge of engagement economics and overall product delivery, budgeting, and timely billing &amp; collections including managing the implementation risk and profitability for smaller scale projects</li><li>Communicating and engaging with clients to instill confidence and foster positive relationships; providing high quality written and verbal deliverables</li><li>Providing strategic and thoughtful guidance to manage clients through a crisis and/or quick solutions and time frames</li><li>Managing performance of project teams. Including: assigning and delegating project responsibilities and providing on-the-job coaching and constructive feedback</li><li>Improving client tracking tools and developing KPIs and metrics to identify, quantify, and monitor workforce management performance improvement opportunities</li><li>Swiftly identifying and resolving root causes of client workforce issues while understanding the importance of urgency in developing and implementing leading practice solutions to achieve client goals</li><li>Serving as a thought leader, developing collateral, and engaging in c-suite and board level conversations regarding the labor market, human capital challenges, and innovative workforce solutions for client-specific issues</li><li>Telling a story through actionable data to facilitate rapid change</li><li>Utilizing your experience and expertise to effectively function in interim roles (e.g., CHRO)</li><li>Acting as integral member of the Human Capital and Workforce Management sales team developing significant portions of proposal and pitch documents that articulate approach and proven solutions across healthcare venues (i.e. Health Plans, Clinics, Homecare, Hospitals, Retail)</li><li>Building relationships with clients and seeking opportunities to expand the scope of business while generating leads</li><li>Managing and mentoring junior staff including training and development</li><li>Creating a team environment that is engaged, thoughtful, respectful, and fun</li><li>Advocating for Diversity, Equity, and Inclusion within the practice and as success lever to enable client goal achievement<br/><br/><br/></li></ul><strong><em>Who will you be working with?<br/><br/></em></strong>We are not your typical consulting firm. We are a group of entrepreneurial, action oriented and results oriented professionals who take a hands-on approach to solving our clients’ problems and helping them reach their full potential. We are nimble, resourceful, and proactive but will adapt quickly when changes are needed. Together, we are known for developing implementation plans that drive real results.<br/><br/>You will be part of a team that is passionate about and known for delivering transformational change to the healthcare continuum through our consulting, advisory and interim management services in financial and operational performance improvement, strategy, merger &amp; acquisition, and turnaround.<br/><br/><strong><em>How will you grow and be supported?<br/><br/></em></strong>As a Director within the Healthcare Group, you will have the opportunity to take your career to the next level by gaining invaluable industry experience while enhancing and expanding your skillsets. As a leader within our team, you will collaborate with many experienced professionals and will provide developmental feedback and growth opportunities.<br/><br/>We work with each of our employees to develop a customized career development plan to ensure you are matched with professional development opportunities that meet your unique needs and accelerate your development. We offer a variety of live and virtual training programs, access to best-in-class on-demand training, ongoing on-the-job coaching, a transitional coach to help you acclimate to the practice, and partnership with a mentor who will guide you through your career.<br/><br/>Our Healthcare team prides itself on sustaining a culture that reflects our core values. We value integrity, quality and objectivity in our work. We like what we do and with whom we do it. We embrace diversity, foster inclusiveness and reward merit. We encourage and support our employees and communities through ongoing investments from leadership, social and networking events, peer-to-peer networks, Employee Resource Groups, volunteer opportunities and pro-bono work. We are committed to promoting an inclusive environment in which all can develop, grow and be supported.<br/><br/>Alvarez &amp; Marsal offers competitive benefits and opportunities to support your personal and professional development. Click to learn about our commitment to your well-being. A&amp;M recognizes that our people drive our growth, and you will be provided with the best available training and development resources through formalized training and on the job training. Learn more about why A&amp;M is a great place to work.<br/><br/><strong>Compensation Statement:<br/><br/></strong><em>The annual base salary range is $160 – $180k commensurate with experience. In addition, A&amp;M offers a discretionary bonus program which is based on a number of factors, including individual and firm performance. Please ask your recruiter for details<br/><br/><br/><br/></em><strong>Benefit Summary<br/><br/></strong>Regular employees working 30 or more hours per week are also entitled to participate in Alvarez &amp; Marsal Holdings’ fringe benefits consisting of healthcare plans, flexible spending and savings accounts, life, AD&amp;D, and disability coverages at rates determined from time to time as well as a 401(k) retirement plan. Provided the eligibility requirements are met, employees will also receive a discretionary contribution to their 401(k) from Alvarez &amp; Marsal. Click here for more information regarding A&amp;M’s benefits programs.<br/><br/>Alvarez &amp; Marsal recruits on an ongoing basis. Candidates are considered as they apply, until the opportunity is filled. Candidates are encouraged to apply expeditiously to any role(s) that they are qualified for and that are of interest to them.<br/><br/>#HBCU<br/><br/>Diversity &amp; Inclusion<br/><br/>A&amp;M’s entrepreneurial culture celebrates independent thinkers and doers who can positively impact our clients and shape our industry. The collaborative environment and engaging work—guided by A&amp;M’s core values of Integrity, Quality, Objectivity, Fun, Personal Reward, and Inclusive Diversity—are the main reasons our people love working at A&amp;M. Inclusive Diversity means we embrace diversity, and we foster inclusiveness, encouraging everyone to bring their whole self to work each day. It runs through how we recruit, develop employees, conduct business, support clients, and partner with vendors. It is the A&amp;M way.<br/><br/>Equal Opportunity Employer<br/><br/>It is Alvarez &amp; Marsal’s practice to provide and promote equal opportunity in employment, compensation, and other terms and conditions of employment without discrimination because of race, color, creed, religion, national origin, ancestry, citizenship status, sex or gender, gender identity or gender expression (including transgender status), sexual orientation, marital status, military service and veteran status, physical or mental disability, family medical history, genetic information or other protected medical condition, political affiliation, or any other characteristic protected by and in accordance with applicable laws. Employees and Applicants can find A&amp;M policy statements and additional information by region here.<br/><br/>Unsolicited Resumes from Third-Party Recruiters<br/><br/>Please note that as per A&amp;M policy, we do not accept unsolicited resumes from third-party recruiters unless such recruiters are engaged to provide candidates for a specified opening and in alignment with our Inclusive Diversity values. Any employment agency, person or entity that submits an unsolicited resume does so with the understanding that A&amp;M will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity.", "responsibilities": "As a Director you will be leading a team and acting as the main conduit between Healthcare clients and our team on a range of complex assignments. You will manage projects by overseeing interview activities, gathering of relevant data, developing goals and deadlines, reviewing work product of junior staff, serving as a subject matter expert, and communicating with senior executive level clients directly. Depending on the client project the responsibilities of a Director may typically include:<br/><br/><ul><li>Effectively designing, managing, and leading practice organizational transformation plans and teams while meeting deadlines and managing on-time deliverables</li><li>Knowledge of engagement economics and overall product delivery, budgeting, and timely billing &amp; collections including managing the implementation risk and profitability for smaller scale projects</li><li>Communicating and engaging with clients to instill confidence and foster positive relationships; providing high quality written and verbal deliverables</li><li>Providing strategic and thoughtful guidance to manage clients through a crisis and/or quick solutions and time frames</li><li>Managing performance of project teams. Including: assigning and delegating project responsibilities and providing on-the-job coaching and constructive feedback</li><li>Improving client tracking tools and developing KPIs and metrics to identify, quantify, and monitor workforce management performance improvement opportunities</li><li>Swiftly identifying and resolving root causes of client workforce issues while understanding the importance of urgency in developing and implementing leading practice solutions to achieve client goals</li><li>Serving as a thought leader, developing collateral, and engaging in c-suite and board level conversations regarding the labor market, human capital challenges, and innovative workforce solutions for client-specific issues</li><li>Telling a story through actionable data to facilitate rapid change</li><li>Utilizing your experience and expertise to effectively function in interim roles (e.g., CHRO)</li><li>Acting as integral member of the Human Capital and Workforce Management sales team developing significant portions of proposal and pitch documents that articulate approach and proven solutions across healthcare venues (i.e. Health Plans, Clinics, Homecare, Hospitals, Retail)</li><li>Building relationships with clients and seeking opportunities to expand the scope of business while generating leads</li><li>Managing and mentoring junior staff including training and development</li><li>Creating a team environment that is engaged, thoughtful, respectful, and fun</li><li>Advocating for Diversity, Equity, and Inclusion within the practice and as success lever to enable client goal achievement<br/><br/><br/></li></ul>", "qualifications": {"required": "High energy individuals and leaders with a passion for healthcare and solving complex issues, A minimum of ten (10) years of prior work experience in Human Resources or Workforce Management in a healthcare setting. Prior consulting experience is required., BA/BS degree and/or MBA/MS in Human Resources, Organizational Development, Business, or a similar field of study., Working knowledge of the healthcare industry, including a fundamental understanding of healthcare finance, operations, valuation and various laws and regulations, Expertise in a given human capital or workforce management area including HR M&amp;A, organizational design, and human resources leadership, Depth of experience with private equity clients will be heavily considered, Excellent verbal and written skills, with the ability to communicate with and present information to all levels of client personnel, Advanced Microsoft PowerPoint and Word skills, Willingness and ability to travel as required", "preferred": ""}, "skills": ["Healthcare", "Human Resources", "Workforce Management", "Consulting", "Healthcare Finance", "Operations", "Valuation", "HR M&A", "Organizational Design", "Human Resources Leadership", "Private Equity", "Communication", "PowerPoint", "Word", "Travel"], "postedDate": "2 weeks ago", "benefits": "Alvarez &amp; Marsal offers competitive benefits and opportunities to support your personal and professional development. Click to learn about our commitment to your well-being. A&amp;M recognizes that our people drive our growth, and you will be provided with the best available training and development resources through formalized training and on the job training. Learn more about why A&amp;M is a great place to work.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3961325701"}