{"jobTitle": "Executive Assistant, Amazon Ads", "company": {"name": "Amazon", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Administrative", "industry": "Software Development", "description": "Do you believe that details matter and want to be part of a growing, global team?<br/><br/>If you enjoy working in an environment that fosters career development, ownership, with opportunity to optimize processes this is the role for you. We are looking for a bright, well organized and self-motivated Executive Assistant to support 2-3 Directors in the Ads Finance team. The team is looking for a driven individual with a history of high performance to support this growing organization.<br/><br/>Key job responsibilities<br/><br/><ul><li> Management of complex calendar and scheduling to support the Directors.</li><li> Manage both domestic and international travel and process expense reports.</li><li> Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events).</li><li> Assist the EA team to foster a cohesive and effective work environment.</li><li> Work closely with the leadership team and other Executive Assistants across the organization to provide support to the organization.<br/><br/></li></ul>A day in the life<br/><br/><ul><li> Proactively manage complex calendars to ensure deliverables are met.</li><li> Coordinate calendars across multiple teams to proactively plan for key business cycles.</li><li> Effectively and proactively supporting Directors and other team members.</li><li> Act as a gatekeeper by balancing customer obsession and backbone.</li><li> Ensure timely action by organizing, prioritizing, and addressing sensitive, confidential information and requests.</li><li> Submit expense reports.</li><li> Coordinate global schedules, travel arrangements, and seamless meeting logistics in a cost-effective manner.</li><li> Coordinate closely with Recruiting teams, Facilities team, HR team, and other Executive Assistants within the Finance Operations and the larger Amazon community.</li><li> Drive completion of key deliverables and outstanding items.</li><li> Assist with event coordination (including team meetings and morale events).</li><li> Creatively solve complex problems while building sustainable, scalable mechanisms.<br/><br/></li></ul><strong>About The Team<br/><br/></strong>*Team Culture*<br/><br/>Here at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.<br/><br/>*Work/Life Balance*<br/><br/>Our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren’t focused on how many hours you spend at work or online. Instead, we’re happy to offer a flexible schedule so you can have a more productive and well-balanced life—both in and outside of work.<br/><br/>*Mentorship and Career Growth*<br/><br/>Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional and enable them to take on more complex tasks in the future.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of senior level leadership support, or 1+ years of Amazon experience</li><li> High school or equivalent diploma</li><li> Experience with Microsoft Office products and applications</li><li> Experience with executive level calendar management<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Bachelor's degree</li><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2685848", "postedDate": "1 week ago", "qualifications": {"required": "3+ years of senior level leadership support, or 1+ years of Amazon experience\nHigh school or equivalent diploma\nExperience with Microsoft Office products and applications\nExperience with executive level calendar management", "preferred": "Bachelor's degree\nExperience in a fast-paced, high-tech company\nExperience managing multiple calendars"}, "skills": ["Microsoft Office", "Calendar Management", "Travel Management", "Expense Reports", "Event Coordination", "Team Management", "Leadership Support", "Communication", "Organization", "Problem Solving", "Time Management", "Prioritization", "Customer Service", "Collaboration", "Teamwork", "Global Coordination", "Recruiting", "Facilities Management", "HR", "Executive Assistants", "Finance Operations", "Amazon", "Diversity and Inclusion", "Work-Life Balance", "Mentorship", "Career Growth", "Knowledge Sharing", "Project Management", "Professional Development", "Compensation", "Equity", "Sign-on Payments", "Benefits", "Medical", "Financial", "Total Compensation", "Internal and External Career Site"], "url": "https://www.linkedin.com/jobs/view/3961730723"}