{"jobTitle": "RN, Nurse Lead, Medical Surgical, Full-Time, Night Shift, AHWM Montebello Site", "company": {"name": "Adventist Health", "location": "Montebello, CA"}, "location": "Montebello, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Centered in the heart of Montebello, Adventist Health White Memorial Montebello has a 70-year history of providing quality healthcare to the community. We are comprised of a 192-bed hospital, wound care medical office and surgical and laboratory services. The greater Los Angeles area is known for its art, rich culture, numerous sports teams and world-renowned dining. There is something for everyone in this culturally diverse community.<br/><br/><strong>Job Summary<br/><br/></strong>Provides unit-based leadership working collaboratively with the Nurse Manager, Director, Physicians, and staff. Supervises and directs the activities of various levels of assigned nursing and ancillary personnel using both professional and supervisory discretion and independent judgment. Ensures that all patients on the unit receive cost effective, professional care that results in positive outcomes and high patient satisfaction while maintaining the highest level of patient safety. Assesses and takes steps to improve quality of patient experience.<br/><br/><strong>Job Requirements<br/><br/></strong>Education and Work Experience:<br/><br/><ul><li> Bachelor’s Degree in nursing or equivalent combination of education/related experience: Required </li><li> Master's Degree: Preferred </li><li> Five years' technical experience: Preferred </li><li> Supervisory experience or demonstrated supervisory skills: Required <br/><br/></li></ul><strong>Licenses/Certifications<br/><br/></strong><ul><li> Registered Nurse (RN) licensure in the state of practice: Required </li><li> Cardiopulmonary Resuscitation (CPR) or Basic Life Support (BLS OR HS-BLS OR RQIBLS) certification: Preferred </li><li> Clinical specialty and/or nursing administration certification: Preferred <br/><br/></li></ul><strong>Facility Specific License/Certifications<br/><br/></strong><ul><li> Basic Life Support (BLS OR HS-BLS OR RQI BLS) certification: Required <br/><br/></li></ul><strong>Essential Functions<br/><br/></strong><ul><li> Provides unit-based leadership in the development and provision of clinical services. Supervises and directs unit personnel. Initiates and coordinates individual and team conferences with health team members, patients, and/or families to initiate and revise care plans for optimal, individualized patient care. Directs and monitors personnel in the performance of patient care activities to ensure adequate patient care and quality of work. Participates in patient care as needed. </li><li> Fosters an environment of patient and family centered care with special attention to cultural diversity and personal needs. Makes rounds to have an overview of patient care needs and to introduce self to patient and families. Solicits feedback on quality of nursing services and any other concerns. Provides interventions and/or develops systems to address the care of patients throughout the continuum of care. Develops strategies with Nurse Manager/Director to improve customer satisfaction for patients, families, and physicians. Investigates and resolves patient care and operational issues as needed. Recommends policy/procedure changes based upon the standards, in collaboration with the Nurse Manager/Director. </li><li> Ensures compliance with Patient Safety Goals as identified by The Joint Commission, hospital policy, Quality Measures, and Patient Safety initiatives through unit management and participation in hospital Performance Improvement (PI) Teams. Works closely with the clinical team members to implement systems/programs or staff development activities to facilitate staff members’ ability to meet patient/family/physician needs. Provides ongoing assessment of department operations and patient care processes for opportunities to improve. Facilitates data collection by staff members and participates in unit quality activities to improve care. </li><li> Assesses the staffing requirements of the unit on an ongoing basis. Manages the number of assigned personnel based on determination of patient acuity and needs, and available skills. Assigns staff to particular patients and patient care activities according to independent professional and supervisory analysis/assessment of the most effective utilization of skills and abilities, patient needs, and to equalize work loads of assigned personnel. Arranges for staff relief for meals and breaks. Reviews and takes action on requests to adjust schedules, including requests to come in late, leave early, or utilize sick time. Plays a significant role in evaluation of performance of unit employees. Coaches and disciplines personnel, when deems appropriate, including oral and written warnings, and suspension. Directly involved in decisions to hire and terminate unit personnel. Instructs new professional and ancillary personnel on job duties and assignments. </li><li> Works with facility services to assure that the department and equipment is maintained in a safe and operational state. Facilitates the repair of any broken or malfunctioning equipment. Ensures the cleanliness of the department. Keeps the Director informed of the unit’s activities, incidents, and special needs in a timely manner, documenting pertinent information. Keeping staffing costs within targeted budget, minimizing use of overtime. </li><li> Performs other job-related duties as assigned. <br/><br/></li></ul><strong>Organizational Requirements<br/><br/></strong>Adventist Health is committed to the safety and wellbeing of our associates and patients. Therefore, we require that all associates receive all required vaccinations, including, but not limited to, measles, mumps, flu (based on the seasonal availability of the flu vaccine typically during October-March each year), COVID-19 vaccine (required in CA, HI and OR) etc., as a condition of employment, and annually thereafter. Medical and religious exemptions may apply.<br/><br/><strong>About Us<br/><br/></strong>Adventist Health is a faith-based, nonprofit, integrated health system serving more than 90 communities on the West Coast and Hawaii with over 400 sites of care, including 26 acute care facilities, clinics, home care, and hospice agencies in both rural and urban communities. Our compassionate and talented team of 37,000 includes employees, physicians and volunteers driven in pursuit of one mission: living God's love by inspiring health, wholeness and hope.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3961217839"}