{"jobTitle": "Growth Manager (Paid Social Media Buyer)", "company": {"name": "TubeScience", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00 - $500,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "As a Growth Manager (Paid Social Media Buyer) at TubeScience, you'll have the autonomy to decide how to use TubeScience resources in order to maximize return on investment, for both the company and clients alike! You'll work with clients ranging from late-stage startups to publicly traded companies representing a wide variety of industry verticals who rely on performance marketing for their success. You 'll work with cross-functional team members to efficiently grow clients' businesses by optimizing campaigns across media platforms and resolving blockers to achieve shared goals.", "responsibilities": "Media Buying Strategy: Autonomously develop, implement, and manage media buying strategies for TS Paid Social Media campaigns for current clients with focus on Meta. Build Paid Social Campaigns for client execution: Create and implement Paid Social campaigns, focusing on Meta; Utilize your expertise in Paid Social to create and execute strategic campaigns including but not limited to Facebook Ads, Instagram Ads. This includes bid management, and ongoing optimization to maximize campaign performance and ROI. Bid Management: Strategically manage bids to ensure competitive ad placements and cost-effectiveness. Campaign Optimization: Continuously monitor and analyze campaign performance metrics to identify areas for improvement and optimization for clients to execute on. Make data-driven decisions to enhance click-through rates (CTR), conversion rates, and overall return on ad spend (ROAS) while reducing customer acquisition cost (CAC). Budget Management: Efficiently allocate budgets across campaigns and ad groups to maximize ROI and achieve clients' desired outcomes. Oversee the media strategy for a portfolio of major advertisers reaching $1M+/month in revenue. Reporting and Analytics: Generate regular reports on campaign performance, providing actionable insights and recommendations to clients and internal stakeholders. Client Management: Leading Biweekly Client Calls, Running Internal Team Bi-weekly Client Strategy Calls, Reporting back on creative direct response ad tests, insights and analytics to inform the creative team for new ad creative. Additionally providing frequent and timely client updates to Internal Teams (TS Pods/ Client Groups). Media Buying Expertise: Able to serve as the subject matter expert on social media buying (emphasis on Meta) to advise and enhance clients revenue portfolio to expand clients growth potential. Operational Skills: Strong organizational skills and the ability to juggle multiple priorities and deadlines. A strategic and analytical thinker who follows through to execution with unyielding attention to details. Data-driven and results-oriented. KPI Management: Able to hit the internal revenue targets across client accounts (varying percentages across client platforms). Able to hit client revenue targets across client accounts (varying depending on client goals / products / strategy).", "qualifications": {"required": "3+ years of digital advertising experience (inclusive of experience in direct response marketing). Strong quantitative reasoning and data analysis capabilities with a proficiency in excel. Expert knowledge of Meta Ads Manager. Experience leading the strategy and day-to-day management of Facebook Ad programs spending over $500k /month. Strong attention to detail and project organizational skills. Strong communication with internal and external stakeholders. Inclusive client and management skills.", "preferred": "Experience querying FB's ads API. Experience with SQL and BI tools. Experience driving ad strategy and execution on Snap, TikTok, Google, and Pinterest. Experience working on a collaborative team with creatives. Experience creating videos for social media."}, "skills": ["Media Buying", "Campaign Optimization", "Budget Management", "Reporting and Analytics", "Client Management", "Data Analysis", "Social Media Advertising"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "100% Employee Covered Medical, Dental Insurance, Unlimited PTO, Paid Sick Leave, 401k + Matching, $500/yr for Education and Trainings, Remote Flexibility (Monthly Remote Work Stipend), 100% Paid Parental Leave up to 12 weeks for new parents, Creative Working Environment, Personal Coaching", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3961282006"}