{"jobTitle": "Front Office Supervisor", "company": {"name": "Highgate", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Hospitality", "description": "<strong>Compensation Type<br/><br/></strong>Hourly<br/><br/><strong> Highgate Hotels <br/><br/></strong>Highgate is a premier real estate investment and hospitality management company widely recognized as an innovator in the industry. Highgate is the dominant player in U.S. gateway markets including New York, Boston, Miami, San Francisco and Honolulu, with a rapidly expanding presence in Europe, Latin America, and the Caribbean. Highgate’s portfolio of global properties represents an aggregate asset value exceeding $20B and generates over $5B in cumulative revenues. The company provides expert guidance through all stages of the hospitality property cycle, from planning and development through recapitalization or disposition. Highgate also has the creativity and bandwidth to develop bespoke hotel brands and utilizes industry-leading proprietary revenue management tools that identify and predict evolving market dynamics to drive out performance and maximize asset value. With an executive team consisting of some of the industry’s most experienced hotel management leaders, the company is a trusted partner for top ownership groups and major hotel brands. Highgate maintains corporate offices in London, New York, Dallas, and Seattle.<br/><br/><strong> Location <br/><br/></strong>Hyatt House El Segundo<br/><br/>810 S. Douglas<br/><br/>El Segundo , CA 90245<br/><br/><strong>Overview<br/><br/></strong>The Front Office Supervisor is responsible for providing attentive, courteous and efficient service to all guests during check-in, throughout their stay, and at checkout, while maximizing room revenue and occupancy.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Greet and welcome all guests approaching the Front Desk in accordance with Highgate Hotel standards. </li><li> Maintain proper operation of the PBX console and ensure that all hotel standards are met (if applicable). </li><li> Answer guest inquires about hotel services, facilities and hours of operation in a timely manner. </li><li> Ensure logging and delivery of packages, mail and messages to guests and meeting rooms. </li><li> Review Front Office log and Trace File daily. </li><li> Answer inquires from guests regarding restaurants, transportation, entertainment, etc. </li><li> Follow all cash handling and credit policies. </li><li> Be aware of all rates, packages and special promotions as listed in the Red Book. </li><li> Be familiar with all in-house groups. </li><li> Be aware of closed out and restricted dates. </li><li> Obtain all necessary information when taking room reservations and follow the rate-quoting scenario. </li><li> Be familiar with hospitality terminology. </li><li> Have knowledge of emergency procedures and assist as needed. </li><li> Handle check-ins and checkouts in a friendly, efficient and courteous manner. Use proper two-way radio etiquette at all times when communicating with other employees. </li><li> Fully comprehend and be able to operate all relevant aspects of the Front Desk computer system. </li><li> Be able to perform and complete all tasks and duties on the shift checklist in a timely and efficient manner. </li><li> Be able to complete a bucket check, room rate verification report, and housekeeping report. </li><li> Balance and prepare individual paperwork for closing of shift according to hotel standards. </li><li> Maintain and market promotions and guest programs. </li><li> Maintain a clean work area. </li><li> Assist guests with safe deposit boxes. <br/><br/></li></ul>SalaryRange ($17.50-$18.00)<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> College course work in related field helpful. </li><li> Experience in a hotel or a related field preferred. </li><li> High School diploma or equivalent required. </li><li> Computer experience required. </li><li> Customer Services experience preferred. </li><li> Flexible and long hours sometimes required. </li><li> Light work - Exerting up to 20 pounds of force occasionally, and/or up to 10 pounds of force frequently or constantly to lift, carry, push, pull or otherwise move objects. </li><li> Ability to stand during entire shift. </li><li> Maintain a warm and friendly demeanor at all times. Supervise all team members in their respective roles at the Front Office. </li><li> Must be able to effectively communicate both verbally and written, with all level of employees and guests in an attentive, friendly, courteous and service oriented manner. </li><li> Must be effective at listening to, understanding, and clarifying concerns raised by employees and guests. </li><li> Must be able to multitask and prioritize departmental functions to meet deadlines. </li><li> Approach all encounters with guests and employees in an attentive, friendly, courteous and service-oriented manner. </li><li> Attend all hotel required meetings and trainings. </li><li> Maintain regular attendance in compliance with Highgate Hotel Standards, as required by scheduling, which will vary according to the needs of the hotel. </li><li> Maintain high standards of personal appearance and grooming, which includes wearing the proper uniform and nametag. </li><li> Comply with Highgate Hotel Standards and regulations to encourage safe and efficient hotel operations. </li><li> Maximize efforts towards productivity, identify problem areas and assist in implementing solutions. </li><li> Must be effective in handling problems, including anticipating, preventing, identifying and solving problems as necessary. </li><li> Must be able to understand and apply complex information, data, etc. from various sources to meet appropriate objectives. </li><li> Must be able to cross-train in other hotel related areas. </li><li> Must be able to maintain confidentiality of information. </li><li> Must be able to show initiative, including anticipating guest or operational needs. </li><li> Perform other duties as requested by management. <br/><br/></li></ul>SalaryRange ($17.50-$18.00)", "responsibilities": "The Front Office Supervisor is responsible for providing attentive, courteous and efficient service to all guests during check-in, throughout their stay, and at checkout, while maximizing room revenue and occupancy.", "qualifications": {"required": "High School diploma or equivalent required. Computer experience required.", "preferred": "College course work in related field helpful. Experience in a hotel or a related field preferred. Customer Services experience preferred. Flexible and long hours sometimes required. Light work - Exerting up to 20 pounds of force occasionally, and/or up to 10 pounds of force frequently or constantly to lift, carry, push, pull or otherwise move objects. Ability to stand during entire shift. Maintain a warm and friendly demeanor at all times. Supervise all team members in their respective roles at the Front Office. Must be able to effectively communicate both verbally and written, with all level of employees and guests in an attentive, friendly, courteous and service oriented manner. Must be effective at listening to, understanding, and clarifying concerns raised by employees and guests. Must be able to multitask and prioritize departmental functions to meet deadlines. Approach all encounters with guests and employees in an attentive, friendly, courteous and service-oriented manner. Attend all hotel required meetings and trainings. Maintain regular attendance in compliance with Highgate Hotel Standards, as required by scheduling, which will vary according to the needs of the hotel. Maintain high standards of personal appearance and grooming, which includes wearing the proper uniform and nametag. Comply with Highgate Hotel Standards and regulations to encourage safe and efficient hotel operations. Maximize efforts towards productivity, identify problem areas and assist in implementing solutions. Must be effective in handling problems, including anticipating, preventing, identifying and solving problems as necessary. Must be able to understand and apply complex information, data, etc. from various sources to meet appropriate objectives. Must be able to cross-train in other hotel related areas. Must be able to maintain confidentiality of information. Must be able to show initiative, including anticipating guest or operational needs. Perform other duties as requested by management."}, "skills": [], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3961310588"}