{"jobTitle": "Industrialization/Manufacturing Engineering Manager", "company": {"name": "Safran", "industry": "Aviation and Aerospace Component Manufacturing", "size": "Large", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$111,000.00 - $135,000.00", "currency": "USD"}, "jobFunction": "Engineering, Manufacturing, and Production", "industry": "Aviation and Aerospace Component Manufacturing", "description": "POWERED BY TEAMWORK. Are you ready to be part of a team that drives big ideas and even bigger wins? At Safran, we believe in the power of both collaboration and individual contributions. We understand that it takes diverse perspectives, problem-solving skills, dependability, and trust to push each other forward and achieve great success. For us, working here is more than just a job; it’s a passion. There’s the unique opportunity to lead the way in aerospace and defense and contribute to creating a safer and more sustainable world.\n\nWe trust our employees to bring bold ideas to build the future of aerospace together, contributing to our ranking by TIME as the leading Aerospace & Defense company on the 2023 World’s Best Companies list (#59 on the full list). Join our team and become part of the group that’s making amazing things happen on the ground and in the skies. Together, we’ll proudly step back and say, “We did that”.", "responsibilities": "Manage Industrial Engineers that are responsible for Industrialization deliverables on all new programs as part of integrated program teams. Manage Manufacturing Engineers that are responsible for sustaining manufacturing engineering in production. Accountable for effective industrialization of new programs. Provides Industrial Engineering support and coordination during the development of Water & Waste Systems and Components. Accountable for determining cost effective methods to create products. Focal for industrialization at WWS including Transfer of Work projects and product flow optimization.", "qualifications": {"required": "BS in Industrial, Aeronautical, Mechanical, Electrical or Manufacturing Engineering, 10+ years of experience in industrialization and/or manufacturing engineering, leadership experience in Aerospace with direct reports.", "preferred": "Experience with Transfer of Work projects, knowledge of mechanical and electrical assembly, knowledge of composite manufacturing processes and tooling."}, "skills": ["Collaboration", "Communication", "Project management", "Attention to detail", "Leadership", "Problem solving"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Pension plan, Tuition assistance, Paid maternity leave, Paid paternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3961829627"}