{"jobTitle": "Supply Chain Specialist", "company": {"name": "Trinity Packaging Supply", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "65,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Packaging and Containers Manufacturing", "description": "<strong>THE COMPANY</strong>\nTrinity Packaging Supply is the first company to leverage proprietary software to connect over 300 distribution and manufacturing centers across North America to provide businesses with packaging’s largest catalog (over 80,000 custom and stock packaging supplies) — offered at low prices with next-day delivery.\n\nSince 2010, Trinity has been the wholesale source of pallets and packaging supplies for manufacturers, retailers, and logistics companies across North America. We have a mindset of innovation, harnessing the power of state-of-the-art technology and our growing network of manufacturing and distribution partnerships to change how businesses think about packaging supplies.\n\nAfter sustained hyper-growth, doubling revenue every two years, we are scaling our team and applying our dropship expertise to a new e-commerce platform. Similar to how Airbnb changed hospitality and Uber changed transportation, this will change the packaging industry forever.\n\n<br/>\n\n<strong>THE CULTURE</strong>\nAt Trinity Packaging Supply, everyone is driven to win and do whatever is necessary to help push the company to new heights. The culture is about rising the tide that will lift all boats and growing the company into something greater. We believe each team member delivers unique value, and together we are a force for positive change in the world. Not only do we save our customers money, but we also have a lot of fun doing it. We walk the talk and have the awards to prove it.\n\n<br/>\n\n<strong>PACKAGING’S LARGEST CATALOG</strong> A First-of-its-kind, Tech-forward Approach\n“We have a fully online e-commerce packaging supply solution for businesses that will involve mastering the dropship platform and automating the brokerage model in a way that will empower clients with the best pricing, instant access to information, next-day shipping, and more.” - Anthony Magaraci, Founder/CEO\n\n<br/>\n\n<strong>THE OPPORTUNITY</strong>\nThis is a once-in-a-lifetime opportunity to work for a company that is disrupting an entire industry and play a key role in that success. As a bonus, Trinity is also one of Inc. Magazine's Best Workplaces in America (four-time winner!). The culture at Trinity Packaging Supply puts the team first which has directly contributed to the company’s growth.\n\n<br/>\n\nThe Supply Chain Specialist is responsible for managing and optimizing the sourcing and procurement process to ensure timely and cost-effective acquisition of goods and services. This role involves evaluating suppliers, negotiating contracts, and collaborating with internal teams to support the company’s operational and strategic goals. The ideal candidate will have strong analytical skills, experience in supplier management, and a deep understanding of market trends, along with proficiency in RFQ (Request for Quotation), RFP (Request for Proposal), and RFI (Request for Information) processes. Experience in the packaging industry is essential.\n\n<br/>\n\n<strong>RESPONSIBILITIES</strong>\nSupplier Management:\n<ul>\n<li>Evaluate and select suppliers based on quality, cost, and reliability criteria.</li>\n<li>Perform Quarterly Business Reviews with suppliers to review performance, gather feedback, and discuss upcoming developments.</li>\n<li>Directly negotiate with suppliers to secure preferred pricing and terms.</li>\n<li>Develop and manage contracts with suppliers to ensure compliance with company policies and legal requirements.</li>\n</ul>\nSourcing and Procurement:\n<ul>\n<li>Manage and execute RFQ, RFP, and RFI processes to identify and select optimal suppliers.</li>\n<li>Analyze customer spend files, including order history and spend amount, to source products and work with vendors to provide the best price and product to customers.</li>\n<li>Perform savings analysis, format the quote sheet, and present findings to stakeholders.</li>\n<li>Ensure effective and efficient sourcing and procurement practices are followed to achieve cost savings and maintain high-quality standards.</li>\n</ul>\nSupply Chain and Data Analytics:\n<ul>\n<li>Analyze market trends, supplier performance, and cost structures to inform sourcing and procurement strategies.</li>\n<li>Monitor and evaluate freight, warehousing, and shipping costs to ensure the most competitive rates.</li>\n<li>Perform and present weekly analysis based on procurement activities to identify areas for cost savings and process improvements.</li>\n<li>Provide and summarize monthly analysis highlighting areas for improvement based on supplier performance and market conditions.</li>\n</ul>\nCollaboration and Communication:\n<ul>\n<li>Collaborate with cross-functional teams, including Sales, Marketing, and Operations, to align procurement activities with business objectives.</li>\n<li>Communicate effectively with internal stakeholders to ensure procurement processes support operational needs and strategic goals.</li>\n<li>Assist with ad hoc and operational requests as needed.</li>\n<li>Responsibilities and tasks outlined in this document are not exhaustive and may change as determined by the needs of the company.</li>\n</ul>\n\n<br/>\n\n<br/>\n\n<strong>QUALIFICATIONS &amp; REQUIREMENTS</strong>\n<ul>\n<li>Bachelor’s degree in Business, Supply Chain Management, or a related field.</li>\n<li>Minimum of 3 years of relevant experience in Sourcing or Procurement.</li>\n<li>Proven experience in managing RFQ, RFP, and RFI processes.</li>\n<li>Strong understanding of procurement processes, supplier evaluation, and contract management.</li>\n<li>Proficiency in MS Office and Excel (Vlookup, Pivot, etc.)</li>\n<li>Excellent negotiation, communication, and analytical skills.</li>\n<li>Experience in the packaging industry is preferred.</li>\n</ul>\n\n<br/>\n\n<strong>BENEFITS &amp; PERKS</strong>\nTrinity Packaging Supply is a four-time winner of Inc. Best Workplaces because we put our team first. It's a “work hard, play hard” type of environment. A few of the employee perks that make us award-winning include:\n<ul>\n<li>Medical, Dental, and Vision Insurance</li>\n<li>Vacation, Sick &amp; Holidays</li>\n<li>401k with employer 3% contribution</li>\n<li>Group term life insurance</li>\n<li>Voluntary life insurance and voluntary Short-Term Disability plan</li>\n<li>Office game areas</li>\n<li>Free snacks and drinks</li>\n<li>Gym membership</li>\n</ul>\n\n<br/>\n\nCompensation Range\nA base salary of $65,000 - $80,000. The compensation reflects the Company’s reasonable expectation at the time of posting. We consider a number of factors when making individual compensation decisions including, but not limited to, skill sets, experience and training, and other business needs.", "responsibilities": "Supplier Management:\n\n* Evaluate and select suppliers based on quality, cost, and reliability criteria.\n* Perform Quarterly Business Reviews with suppliers to review performance, gather feedback, and discuss upcoming developments.\n* Directly negotiate with suppliers to secure preferred pricing and terms.\n* Develop and manage contracts with suppliers to ensure compliance with company policies and legal requirements.\n\nSourcing and Procurement:\n\n* Manage and execute RFQ, RFP, and RFI processes to identify and select optimal suppliers.\n* Analyze customer spend files, including order history and spend amount, to source products and work with vendors to provide the best price and product to customers.\n* Perform savings analysis, format the quote sheet, and present findings to stakeholders.\n* Ensure effective and efficient sourcing and procurement practices are followed to achieve cost savings and maintain high-quality standards.\n\nSupply Chain and Data Analytics:\n\n* Analyze market trends, supplier performance, and cost structures to inform sourcing and procurement strategies.\n* Monitor and evaluate freight, warehousing, and shipping costs to ensure the most competitive rates.\n* Perform and present weekly analysis based on procurement activities to identify areas for cost savings and process improvements.\n* Provide and summarize monthly analysis highlighting areas for improvement based on supplier performance and market conditions.\n\nCollaboration and Communication:\n\n* Collaborate with cross-functional teams, including Sales, Marketing, and Operations, to align procurement activities with business objectives.\n* Communicate effectively with internal stakeholders to ensure procurement processes support operational needs and strategic goals.\n* Assist with ad hoc and operational requests as needed.\n* Responsibilities and tasks outlined in this document are not exhaustive and may change as determined by the needs of the company.", "qualifications": {"required": "Bachelor’s degree in Business, Supply Chain Management, or a related field.\nMinimum of 3 years of relevant experience in Sourcing or Procurement.\nProven experience in managing RFQ, RFP, and RFI processes.\nStrong understanding of procurement processes, supplier evaluation, and contract management.\nProficiency in MS Office and Excel (Vlookup, Pivot, etc.)\nExcellent negotiation, communication, and analytical skills.", "preferred": "Experience in the packaging industry is preferred."}, "skills": ["Supplier Management", "Sourcing", "Procurement", "Supply Chain", "Data Analytics", "Negotiation", "Communication", "Analytical Skills", "MS Office", "Excel", "RFQ", "RFP", "RFI"], "postedDate": "3 weeks ago", "benefits": "Medical, Dental, and Vision Insurance\nVacation, Sick & Holidays\n401k with employer 3% contribution\nGroup term life insurance\nVoluntary life insurance and voluntary Short-Term Disability plan\nOffice game areas\nFree snacks and drinks\nGym membership", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3961917055"}