{"jobTitle": "Rental Fleet Specialist/Tourism (Full Time)", "company": {"name": "roadsurfer", "industry": "Travel Arrangements", "size": "51-200 employees", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full Time", "employmentType": "Hourly", "experienceLevel": "Entry level", "salary": {"amount": "$20.00 to $25.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Travel Arrangements", "description": "Why roadsurfer?\n\nTEAMSPIRIT & TEAMEVENTS: Look forward to a collegial atmosphere with flat hierarchies, lots of fun and great team spirit as well as regular team events such as joint barbecues or simply an after-work drink at your station.\nCAMPER BUDGET: You get a free rental for our campers so you can experience the #happyroadsurfing lifestyle for yourself.\nDISCOUNTS: Take advantage of our corporate benefits platform and Family & Friends discounts.\n\nThe role - your passion\nYour responsibilities include but are not limited to the following:\nYou lend a hand and take over the exterior and interior cleaning of our campers.\nYou explain and hand over our campers to the customers.\nYou put a smile on our customers' faces when they pick up and return their camper and make their roadsurfer journey unforgettable.\nYou manage the payment processes and check in rental payments and collect security deposits.\nYou support our station team with all daily tasks and make sure that our #happyroadsurfers leave the yard happy.\n\nWhat You Need To Surf The Wave With Us\nYou are absolutely hands-on and lend a hand at all times.\nExperience in dealing with customers.\nClass B driving license.\nMust be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future.\n\nWORK CONDITIONS\nStation Hours: Monday through Sunday 9am – 6pm, availability on weekends mandatory.\nJob Type: Hourly, Full Time-Pay Range: $20.00 to $25.00 (internal Title - Station Service Specialist).\nWorking mostly outdoors.\nZip Code: 13600 S Inglewood Ave, Hawthorne CA 90250, USA.\n\nroadsurfer is an equal opportunity employer. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, genetic information, marital status, military status, protected veteran status or any other category protected by law.\n\nReady to surf?\nAre you made for the job? Then we look forward to receiving your application! If you have any questions, please feel free to contact us at team@roadsurfer.com and we will get back to you as soon as possible.", "responsibilities": "You lend a hand and take over the exterior and interior cleaning of our campers. You explain and hand over our campers to the customers. You put a smile on our customers' faces when they pick up and return their camper and make their roadsurfer journey unforgettable. You manage the payment processes and check in rental payments and collect security deposits. You support our station team with all daily tasks and make sure that our #happyroadsurfers leave the yard happy.", "qualifications": {"required": "Class B driving license, Must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Free rental for campers, corporate benefits platform, Family & Friends discounts.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3961089985"}