{"jobTitle": "Senior Business Intelligence Data Analyst", "company": {"name": "True Classic", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$115,000 - $130,000", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Retail Apparel and Fashion", "description": "<strong>Position Overview<br/><br/></strong><strong>Classification</strong>: full time, non-exempt<br/><br/><strong>Location</strong>: Remote<br/><br/><strong>Department</strong>: Business Intelligence<br/><br/><strong>Reports to</strong>: Director of Business Intelligence<br/><br/>We are seeking an exceptional Senior Business Intelligence Data Analyst leader to oversee business insights, enhancing operational efficiencies, optimizing the customer experience, and driving business growth. The role offers unparalleled exposure to senior leadership, including direct interaction with the president and co founders.<br/><br/>All of True Classic's roles are global and omni-channel, leading designated areas of accountability across all product categories, countries, and different sales &amp; marketing channels. This means you will have the opportunity to impact our operations worldwide, ensuring a cohesive strategy that aligns with our overall business objectives and drives success across various markets and platforms.<br/><br/><strong>Key Areas of Accountability<br/><br/></strong><ul><li>Leadership in BI Projects: Lead end-to-end BI projects from data sourcing and modeling to delivering intuitive Tableau/Looker dashboard and ad hoc analysis.</li><li>Dashboard and Report Management: Build and maintain dashboards and reports that visualize data insights and performance metrics from executive leadership. </li><li>Growth and Efficiency Optimization: Identify opportunities for growth and efficiency improvements through data insights.</li><li>Data Governance and Quality Key Responsibilities: Establish and manage data catalogs and documentation to build trust in business data. Uphold data governance and documentation practices to ensure high data quality and reliability. </li><li>Service Delivery and Platform Improvement: Provide day-to-day service delivery for the BI platform, leading initiatives to enhance long-term performance, stability, scalability, and resilience of services. </li><li>Executive Communication: Develop compelling presentations tailored to executive audiences, highlighting strategic insights and actionable recommendations. <br/><br/></li></ul><strong>Cross-Functional Collaboration<br/><br/></strong><ul><li>Finance: Partner to drive and develop divisional scorecards and provide ad hoc reporting. </li><li>Merchandising: Work together to identify opportunities for efficiency improvements and growth. </li><li>Operations &amp; Supply Chain: Collaborate on data insights to enhance operational efficiencies. </li><li>Marketing &amp; CRM: Optimize customer experience through data-driven recommendations. </li><li>Site Merchandising: Utilize data to optimize site performance and customer engagement. <br/><br/></li></ul><strong>Qualification Requirements<br/><br/></strong><ul><li>5+ years of experience in data analytics with a focus on building and managing data models, creating visualizations, and providing data-driven recommendations to the business. <br/><br/></li></ul><strong>Technical Skills<br/><br/></strong><ul><li>Mastery of SQL and experience working with large data sets across various database technologies. </li><li>Proficiency with BI tools such as Tableau and Looker. </li><li>Strong understanding of data visualization best practices. <br/><br/></li></ul><strong>Soft Skills<br/><br/></strong><ul><li>Strategic thinker with a proven track record of impacting business strategies and outcomes through data insights. </li><li>Excellent communication skills, capable of data storytelling skills and translating complex findings into actionable insights. </li><li>Leadership skills with a passion for managing and developing high-performing analytics products. </li><li>Ability to influence key business decisions through data. <br/><br/></li></ul><strong>Preferences<br/><br/></strong><ul><li>Experience in a fast-paced and global organization culture</li><li>Deep knowledge of analytics approaches, both quantitative and qualitative, and their application in driving business strategies. <br/><br/></li></ul><strong>Company Overview<br/><br/></strong>True Classic launched in late 2019 and has grown to become one of the hottest direct-to-consumer men's apparel brands, continuing to experience rapid growth despite changes to digital advertising and the macroeconomic environment. We are on a mission to empower over 100M people worldwide to look good and feel good by the end of 2034 and are guided by six core values to chart our path to success:<br/><br/><ul><li>Move the Needle </li><ul><li>We are obsessed with driving tangible business results.</li><li>We constantly refocus our efforts and eliminate busy work to drive measurable impact.</li><li>We embrace simplicity, automation, and technology to amplify our force.</li></ul><li>Harness Grit </li><ul><li>We are ambitious and persevere through challenges with a relentless spirit.</li><li>We're optimistic about the future and our glass is half full.</li><li>We are self-motivated, resourceful, and determined to make a difference.</li></ul><li>Go Fast ⚡</li><ul><li>We are nimble, open-minded, and seek the fastest path to success.</li><li>We remove barriers, eliminate friction, and move at the speed of light.</li><li>We believe that “done is better than perfect” and fail forward to make progress.</li></ul><li>Execute as a Pro </li><ul><li>We are curious and leverage data &amp; insights to move in the right direction. </li><li>We are doers, embody an owner's mentality, and strive to get 1% better every day.</li><li>We work systematically to produce consistent results &amp; get our projects done right.</li></ul><li>Be Creative </li><ul><li>We are first-principles thinkers and develop bold ideas to challenge the status quo.</li><li>We are innovators at heart &amp; believe that ingenuity is often the solution.</li><li>We solve problems resourcefully and think outside the box.</li></ul><li>Lead with Empathy </li><ul><li>We obsess over our customers to consistently over-deliver.</li><li>We are inclusive, appreciative, and supportive of our employees &amp; partners.</li><li>We put ourselves in others' shoes and seek to deeply understand their perspective.<br/></li></ul></ul><strong>Work Environment<br/><br/></strong>This is a remote position, allowing you to work from the comfort of your home or any location with reliable internet access within the United States. You will spend extended periods at a computer, so a comfortable and ergonomic workspace is essential. We provide the necessary tools and support to ensure a productive and collaborative virtual work experience. Additionally, the company holds quarterly all-hands meetings in California, which you would be expected to travel to and attend in person.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>$115,000 - $130,000</li><li>Unlimited Sick Days &amp; PTO</li><li>Company paid medical, dental, and vision PPO insurance (Anthem Gold PPO)</li><li>401k plan with 3% company match</li><li>Monthly $200 stipend for home office expenses</li><li>Free $1,000 worth of True Classic merchandise every year</li><li>Free Employee Assistance Program<br/><br/></li></ul>Our mission is to empower everyone to show up as their best self. We are dedicated to creating a community where creativity, curiosity, and innovation thrive; and that starts with welcoming diverse voices to our team. We believe that everyone should feel confident being exactly who they are, which is why we're committed to being an equal opportunity employer. We celebrate and support differences in race, religion, color, national origin, gender, sexual orientation, gender identity, age, veteran status, and abilities. If you need assistance or an accommodation due to a disability, please reach out to Human Resources.<br/><br/><em>Please note that the duties and responsibilities outlined in this job description are intended to describe the general nature and level of work performed by employees assigned to this position. It is not an exhaustive list of all responsibilities, duties, and skills required for the role. Additional tasks and responsibilities may be assigned as needed to meet business needs.</em>", "responsibilities": "Lead end-to-end BI projects from data sourcing and modeling to delivering intuitive Tableau/Looker dashboard and ad hoc analysis. Build and maintain dashboards and reports that visualize data insights and performance metrics from executive leadership. Identify opportunities for growth and efficiency improvements through data insights. Establish and manage data catalogs and documentation to build trust in business data. Uphold data governance and documentation practices to ensure high data quality and reliability. Provide day-to-day service delivery for the BI platform, leading initiatives to enhance long-term performance, stability, scalability, and resilience of services. Develop compelling presentations tailored to executive audiences, highlighting strategic insights and actionable recommendations. Partner to drive and develop divisional scorecards and provide ad hoc reporting. Work together to identify opportunities for efficiency improvements and growth. Collaborate on data insights to enhance operational efficiencies. Optimize customer experience through data-driven recommendations. Utilize data to optimize site performance and customer engagement.", "qualifications": {"required": "5+ years of experience in data analytics with a focus on building and managing data models, creating visualizations, and providing data-driven recommendations to the business.", "preferred": "Experience in a fast-paced and global organization culture Deep knowledge of analytics approaches, both quantitative and qualitative, and their application in driving business strategies."}, "skills": ["SQL", "Tableau", "Looker", "Data Visualization", "Data Storytelling", "Data Governance", "Data Quality", "Business Intelligence", "Analytics", "Strategic Thinking", "Communication", "Leadership"], "postedDate": "1 month ago", "benefits": "$115,000 - $130,000 Unlimited Sick Days &amp; PTO Company paid medical, dental, and vision PPO insurance (Anthem Gold PPO) 401k plan with 3% company match Monthly $200 stipend for home office expenses Free $1,000 worth of True Classic merchandise every year Free Employee Assistance Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3961055554"}