{"jobTitle": "Content Creator", "company": {"name": "Feel Goods", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Health, Wellness & Fitness", "description": "<strong>About the role</strong>\n<p>Ever wish you could quit your boring old job and deal drugs? Well, now you can (the legal kind at least). We are on the hunt for a Content Creator, a natural hustler, who can convince others that our blends are better than the rest.</p><p><br/></p><p>Think of yourself as the Pablo Escobar of wellness; you'll oversee shipments of antioxidants, supervising drops of superfoods, and create Instagrammable stand-offs against unhealthy options. Our brand is all about \"slinging\" wellness powders like our lives depends on it. We aren't the bad guys though. We're just making the world healthier, one gram at a time.</p><p><br/></p><p><strong>Ideal candidate:</strong></p><ul><li>We’re looking for someone to help conceptualize, script, and shoot engaging short-form content for TikTok and IG.</li><li>Expert storytelling skills while being able to build and cultivate community.</li><li>Comfortable being on camera in-office and in public to film a variety of content.</li><li>Experience working in a small, startup environment. We're a small team, which means your ideas and direction will almost always be reflected in the content we produce.</li></ul><p><br/></p><p><strong>Job requirements</strong></p><ul><li>Local to LA and can come into our office in West Hollywood to be hands-on with us throughout the creative process (e.g. ideate, film, and edit, analyzing, etc.)</li><li>Content Creation (TikTok, Youtube, etc.) - 3+ years</li><li>Videography + video editing - 2+ years</li><li>Bonus if you already have a social presence and have grown either your personal or a brand's page.</li></ul><p><br/></p><p><strong>Brand Overview:</strong></p><p>Feel Goods is an entertainment-driven wellness brand on a mission to make health more approachable &amp; fun.</p><p>We put your feel-good fix, in a drink mix.</p><p><br/></p><p><strong>You can find us on:</strong></p><p>TikTok: https://www.tiktok.com/feelgoods.co</p><p>IG: www.instagram.com/feelgoods.co</p>", "postedDate": "1 month ago", "skills": ["TikTok", "Instagram", "Content Creation", "Storytelling", "Community Building", "Videography", "Video Editing"], "url": "https://www.linkedin.com/jobs/view/3961937846"}