{"jobTitle": "Financial Analyst II", "company": {"name": "Canonical", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Finance and Sales", "industry": "Technology, Information and Internet", "description": "<strong>The role of a Financial Analyst II at Canonical<br/><br/></strong>As a Financial Analyst II, you'll be a core member of the FP&amp;A Team and wider finance team. You will play a key part in our monthly business reviews, quarterly forecasting, annual planning, and continuously drive cross-functional business alignment. Our ideal candidate is a highly analytical independent thinker, who has a desire to learn how to leverage business judgment, driven by data, to advise on critical financial, commercial and strategic decisions.<br/><br/><strong>Location:</strong> This is a remote role in EMEA or Americas time zones.<br/><br/><strong>What your day will look like<br/><br/></strong><ul><li>Generate insights into business operations by analyzing unit economics, drivers of variance, and other KPIs</li><li>Support quarterly and annual financial planning, forecasting, reporting, and monthly budget reviews</li><li>Provide analysis of commercial initiatives that have a strategic or financial impact on the business</li><li>Create objective analyses and processes for a fast-growing tech company to scale efficiently and make data-driven decisions</li><li>Support multi-functional change projects designed to enhance systems, processes, and data accuracy</li><li>Partner with and communicate business progress to key stakeholders against financial and strategic targets <br/><br/></li></ul><strong>What we are looking for in you<br/><br/></strong><ul><li>An exceptional academic track record from both high school and university</li><li>Drive and a track record of going above-and-beyond expectations</li><li>Strong problem-solving and analytical abilities</li><li>Excellent presentation and communication skills</li><li>Curiosity and willingness to work on a wide range of projects</li><li>Proficiency in spreadsheets and financial modeling</li><li>Understanding of core accounting principles </li><li>Professional written and spoken English </li><li>Excellent interpersonal skills, curiosity, flexibility, and accountability </li><li>Passion, thoughtfulness, and self-motivation </li><li>Excellent communication and presentation skills </li><li>Result-oriented, with a personal drive to meet commitments </li><li>Ability to travel twice a year, for company events up to two weeks long</li><li>Previous experience in an analytically focused finance or business role<br/><br/></li></ul><strong>Additional skills that you might also bring<br/><br/></strong><ul><li>Bachelor's degree in finance, business, or related field</li><li>Experience with Business Intelligence reporting, CRM and ERP systems</li><li>Experience in implementation of Budgeting and Planning Software<br/><br/></li></ul><strong>What we offer you<br/><br/></strong>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/><strong>Canonical is an equal opportunity employer<br/><br/></strong>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "postedDate": "1 month ago", "skills": ["Financial Modeling", "Business Intelligence", "Financial Analysis", "Financial Planning", "Budgeting", "Spreadsheets", "Accounting", "Business Judgment", "Data Analysis", "Communication", "Presentation Skills", "Problem Solving", "CRM", "ERP", "Business Intelligence Reporting", "Budgeting and Planning Software"], "url": "https://www.linkedin.com/jobs/view/3961212038"}