{"jobTitle": "Operations Associate", "company": {"name": "Thuma", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "67,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "The Thuma team is looking for an Operations Associate to join our effective, lean, quickly growing team. We hire for integrity, initiative, collaborative spirit, open mindedness, and willingness to learn. Reporting to the Director of Logistics you’ll use your scrappy, problem solving abilities to support key daily operational activities that drive the Thuma business. You’ll make an impact across the entire Logistics operation: inbound logistics, storage and fulfillment, product importing, outbound logistics, reverse logistics and have an opportunity to help improve the performance of Thuma’s operations. You will be an important part of Thuma’s distributed Logistics team by providing on-the-ground support for a range of projects and initiatives. This role is based in Carson, CA; you’ll work out of our Carson, CA distribution center 3 days per week while having the flexibility to work from home 2 days per week. What you’ll do:<br/><br/><ul><li>Act as Thuma’s in-warehouse advocate and liaison between the Thuma remote team</li><li>Support daily order fulfillment operations, troubleshoot exception orders, serve as a key liaison between Operations and CX </li><li>Support seamless receiving and inventory control operations </li><li>Support new product launches</li><li>Work cross functionally to fulfill marketing requests and other high touch orders</li><li>Assist with reverse logistics program management </li><li>Drive the implementation of new processes, technology and initiatives</li><li>Support outbound logistics including parcel and white-glove deliveries<br/><br/><br/></li></ul>This might describe you (role specific):<br/><br/><ul><li>1-3 years work experience in operations, logistics, ecommerce, or cx </li><li>Excited about a role that gives you exposure to all aspects of Thuma operations</li><li>Willing to provide constructive feedback to warehouse management and floor-level employees on quality and process deviations</li><li>Comfortable with systems or quick study (WMS, ERP, software platforms) </li><li>Competent with Excel, G-suite, and light data analysis</li><li>Strong communication skills, ability to be concise and clear with both internal teams and third party partners </li><li>Action bias and solutions-oriented mindset<br/><br/><br/></li></ul>This might describe you:<br/><br/><ul><li>You are comfortable with ambiguity and autonomy</li><li>You have a high bar for quality and believe in continuous improvement</li><li>You’re able to manage your time and add value that the broader team can feel without being told what to do</li><li>You’re comfortable receiving and providing feedback</li><li>You’re a team player and come to each new project with enthusiasm and a willingness to learn </li><li>You have the ability to quickly adapt in a high-paced environment</li><li>You’re looking for a healthy work life balance <br/><br/><br/></li></ul>Why Join Us: Equity/401k: Participation in employee stock option plan and our 401k program where we will match up to 6% of your contributions Benefits: Comprehensive medical, dental + vision coverage options with generous employer contributions Extras: 12 weeks of paid parental leave and company sponsored membership at One Medical Dream Setup: MacBook Air, Airpod Pros, Magic Mouse, Magic Keyboard, Display Screen, White board Flex Time: Run errands as needed, just get your stuff done Flexible PTO: We believe healthy, happy, relaxed people do better work Hybrid: Flexibility to work between your home and our distribution center with everything you need to be successful in both Employee Discount: We provide an employee discount of 40% off all Thuma products Cell Phone Stipend: $100 per month to recognize that you will use your cell phone for work related things Room Upgrade: A complimentary product credit when you start, worth up to $2,000 Who We Are: Thuma is a bedroom lifestyle brand, offering customers Bed Time essentials and amenities designed to celebrate life’s simple pleasures through thoughtful elevated design, quality craftsmanship, and modern convenience. We recognize that people come with a wealth of knowledge and are talented beyond the scope of a functional role. If this sounds like you, we encourage you to apply even if your experience doesn’t precisely match our job description. We hire for integrity, initiative, collaborative spirit, open mindedness, and willingness to learn. Thuma is dedicated to going above and beyond to bring people with diverse perspectives and unique experiences together to do great work. We strive to create a sense of belonging by creating an inclusive culture where everyone can be their authentic self and by treating each and every team member with kindness, equity, and respect, always. Thuma provides an estimate of the compensation for roles that may be hired as required by state regulations. Compensation may vary based on (a) location, as Thuma factors in specific location when benchmarking compensation for most roles; (b) individual candidate skills and qualifications; and (c) individual candidate experience. Additionally, Thuma leverages current market data to determine compensation, so posted compensation figures are subject to change as new market data becomes available. The salary, other compensation, and benefits information is accurate as of the date of this posting. Thuma reserves the right to modify this information at any time, subject to applicable law.", "responsibilities": "The Thuma team is looking for an Operations Associate to join our effective, lean, quickly growing team. We hire for integrity, initiative, collaborative spirit, open mindedness, and willingness to learn. Reporting to the Director of Logistics you’ll use your scrappy, problem solving abilities to support key daily operational activities that drive the Thuma business. You’ll make an impact across the entire Logistics operation: inbound logistics, storage and fulfillment, product importing, outbound logistics, reverse logistics and have an opportunity to help improve the performance of Thuma’s operations. You will be an important part of Thuma’s distributed Logistics team by providing on-the-ground support for a range of projects and initiatives. This role is based in Carson, CA; you’ll work out of our Carson, CA distribution center 3 days per week while having the flexibility to work from home 2 days per week. What you’ll do:<br/><br/><ul><li>Act as Thuma’s in-warehouse advocate and liaison between the Thuma remote team</li><li>Support daily order fulfillment operations, troubleshoot exception orders, serve as a key liaison between Operations and CX </li><li>Support seamless receiving and inventory control operations </li><li>Support new product launches</li><li>Work cross functionally to fulfill marketing requests and other high touch orders</li><li>Assist with reverse logistics program management </li><li>Drive the implementation of new processes, technology and initiatives</li><li>Support outbound logistics including parcel and white-glove deliveries<br/><br/><br/></li></ul>", "qualifications": {"required": "1-3 years work experience in operations, logistics, ecommerce, or cx, Excited about a role that gives you exposure to all aspects of Thuma operations, Willing to provide constructive feedback to warehouse management and floor-level employees on quality and process deviations, Comfortable with systems or quick study (WMS, ERP, software platforms), Competent with Excel, G-suite, and light data analysis, Strong communication skills, ability to be concise and clear with both internal teams and third party partners, Action bias and solutions-oriented mindset", "preferred": "You are comfortable with ambiguity and autonomy, You have a high bar for quality and believe in continuous improvement, You’re able to manage your time and add value that the broader team can feel without being told what to do, You’re comfortable receiving and providing feedback, You’re a team player and come to each new project with enthusiasm and a willingness to learn, You have the ability to quickly adapt in a high-paced environment, You’re looking for a healthy work life balance"}, "skills": ["Operations", "Logistics", "Ecommerce", "CX", "WMS", "ERP", "Software Platforms", "Excel", "G-suite", "Data Analysis", "Communication", "Action Bias", "Solutions-Oriented Mindset"], "postedDate": "1 month ago", "benefits": "Equity/401k: Participation in employee stock option plan and our 401k program where we will match up to 6% of your contributions Benefits: Comprehensive medical, dental + vision coverage options with generous employer contributions Extras: 12 weeks of paid parental leave and company sponsored membership at One Medical Dream Setup: MacBook Air, Airpod Pros, Magic Mouse, Magic Keyboard, Display Screen, White board Flex Time: Run errands as needed, just get your stuff done Flexible PTO: We believe healthy, happy, relaxed people do better work Hybrid: Flexibility to work between your home and our distribution center with everything you need to be successful in both Employee Discount: We provide an employee discount of 40% off all Thuma products Cell Phone Stipend: $100 per month to recognize that you will use your cell phone for work related things Room Upgrade: A complimentary product credit when you start, worth up to $2,000", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3962967699"}