{"jobTitle": "Tax Team Manager, CPA/EA (Seasonal)", "company": {"name": "JDA TSG", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Outsourcing and Offshoring Consulting", "description": "Remote U.S. | Full Time | starting at $38/hour + Incentives/Bonuses | 401K + Match <br/><br/><strong>You must be a current Enrolled Agent (EA), CPA, or practicing attorney to be considered for these positions!<br/><br/></strong><strong>Opportunity Highlights<br/><br/></strong><ul><li>Flexibility! Wide range of shifts, including evenings and weekends. </li><li>100% Remote work in the U.S. </li><li>Growth potential </li><li>Starting at $38/hour + incentives </li><li>Work from early November 2024 through April 30, 2025 averaging 40+ hours per week. <br/><br/></li></ul>JDA TSG's Tax Services Group is hiring Seasonal Team Managers for the upcoming tax season. If you are looking for seasonal work, and have Remote Management experience, we would love to speak with you about joining our team!<br/><br/><strong>On a Typical Day, You Will<br/><br/></strong><ul><li>Provide strong and effective leadership via video, phone, and chat, and inspire and motivate your team to achieve program goals. </li><li>Monitor and evaluate team to identify and provide mentoring and coaching. </li><li>Implement policy updates through training and change control processes. </li><li>Identify areas for process improvement at the individual and team level. </li><li>Analyze daily/weekly/monthly team performance data, deliver performance feedback. </li><li>Review and manage tax accuracy. </li><li>Assess, adopt, and update strategies to empower team to meet SLAs and KPIs, including timecard management, shift adherence, proper use of tools and resources, Net Promoter Scores, Quality of Service, case documentation, average handle time, connectivity requirements and troubleshooting. </li><li>Identify and address issues and challenges within the leadership channels, customer-facing issues, and customer escalations, ensuring resolution in a friendly and prompt manner. </li><li>Execute customer callbacks as requested. </li><li>Carefully document and keep accurate records of team-related activities . </li><li>Ensure team members meet milestones during onboarding and training. <br/><br/></li></ul><strong>What You Bring To The Role<br/><br/></strong><ul><li>2+ years in a remote, supervisory role, leading teams of 15+ customer support professionals. </li><li>Strong technical skills and ability to navigate computer systems and software including professional tax software, Microsoft 365 (Outlook, Teams, Word, Excel), Slack, Timekeeping solutions, etc. </li><li>A dedicated workspace with a hard-wired Ethernet connection and personal computer for administrative responsibilities. (No Satellite or Wi-Fi providers.) <br/><br/></li></ul><strong>What We Provide<br/><br/></strong><ul><li>Seasonal/flexible morning through evening hours. We staff Mornings, Midday, and Evenings, 7 days per week, from the comfort of your home office. </li><li>W2 position starting at $38 per hour, 401k with match, benefits, perks, and other incentives. </li><li>Work from early November through the end of April 2025, averaging 40+ hours a week. </li><li>Comprehensive training and support from our management team, who are committed to helping you excel in this role. </li><li>Equipment including laptop for the duration of employment. (You must also have access to a personal computer for your use.) </li><li>The opportunity for employment growth within JDA TSG. <br/><br/></li></ul><em>We need folks who can work the entire season, though April, 2025. Can you commit?<br/><br/></em><strong>APPLY NOW! <br/><br/></strong><strong>AboutJDA TSG<br/><br/></strong>Since 2011, our mission has remained the same: to partner with clients helping to solve the toughest problems facing their businesses. We have been successful by applying a dynamic and forward-facing approach to business process improvement, outsourced managed services, best leveraging of technologies and talent solutions.<br/><br/>JDA TSG is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. We are interested in every qualified candidate who is eligible to work in the United States.", "responsibilities": "Provide strong and effective leadership via video, phone, and chat, and inspire and motivate your team to achieve program goals. Monitor and evaluate team to identify and provide mentoring and coaching. Implement policy updates through training and change control processes. Identify areas for process improvement at the individual and team level. Analyze daily/weekly/monthly team performance data, deliver performance feedback. Review and manage tax accuracy. Assess, adopt, and update strategies to empower team to meet SLAs and KPIs, including timecard management, shift adherence, proper use of tools and resources, Net Promoter Scores, Quality of Service, case documentation, average handle time, connectivity requirements and troubleshooting. Identify and address issues and challenges within the leadership channels, customer-facing issues, and customer escalations, ensuring resolution in a friendly and prompt manner. Execute customer callbacks as requested. Carefully document and keep accurate records of team-related activities . Ensure team members meet milestones during onboarding and training.", "qualifications": {"required": "2+ years in a remote, supervisory role, leading teams of 15+ customer support professionals. Strong technical skills and ability to navigate computer systems and software including professional tax software, Microsoft 365 (Outlook, Teams, Word, Excel), Slack, Timekeeping solutions, etc. A dedicated workspace with a hard-wired Ethernet connection and personal computer for administrative responsibilities. (No Satellite or Wi-Fi providers.)"}, "skills": ["Remote Management", "Customer Support", "Tax", "Leadership", "Team Management", "Training", "Process Improvement", "Performance Management", "Tax Software", "Microsoft 365", "Slack", "Timekeeping"], "postedDate": "1 month ago", "benefits": "Seasonal/flexible morning through evening hours. We staff Mornings, Midday, and Evenings, 7 days per week, from the comfort of your home office. W2 position starting at $38 per hour, 401k with match, benefits, perks, and other incentives. Work from early November through the end of April 2025, averaging 40+ hours a week. Comprehensive training and support from our management team, who are committed to helping you excel in this role. Equipment including laptop for the duration of employment. (You must also have access to a personal computer for your use.) The opportunity for employment growth within JDA TSG.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3962173297"}