{"jobTitle": "Development Manager, Los Angeles", "company": {"name": "Reading Partners", "industry": "Education Administration Programs", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,786.00 - $79,748.00", "currency": "USD"}, "jobFunction": "Development/Fundraising", "industry": "Education Administration Programs", "description": "Reading Partners is changing the education landscape. We are a leader in working to solve the literacy crisis in our country by leveraging community volunteers in under-resourced schools. Our diverse and expansive volunteer base provides one-on-one tutoring to students twice weekly, and our program is proven to help children master the reading fundamentals they need to unlock their potential as successful, happy and confident readers in school and in life. Our people are our heartbeat and our greatest resource; we are all passionately rallied around our mission to help children become lifelong learners by empowering communities to provide individualized instruction that works. Join our stellar team leading the charge to deepen our impact and expand our service.", "responsibilities": "Drive regional development operations and provide administrative support. Managing and leveraging Salesforce donor database to record and track deadlines, meeting notes, and funder information. Producing reports and data that are used by the development team and Executive Director to drive streamlined communication internally and with the board. Write newsletter and drive annual marketing plan. Support all external revenue activities to meet or exceed ambitious fundraising goal of $2.9M, leveraging revenue streams including: foundations, individuals, corporations, events and local government. Lead on all writing for fundraising and external relations activities for the region including grants and grant reports, meeting briefs, letters, follow-up correspondence, updates, acknowledgments, newsletters, and more. Conduct a high volume of prospect research to identify and qualify foundation, corporate, and major gift prospects. Support all shared development team responsibilities including board and committee meetings, annual mailings, site visits, etc.", "qualifications": {"required": "2-4 years of increasing responsibility as a development generalist, grant writer, or experience in development operations. Have successfully managed development deliverable deadlines. Experience working with 20+ grants annually of varying award amounts of at least $25,000. Have experience in prospect research, fundraising events, board operations and campaign fundraising. Proven fundraising campaign development and implementation. Are an exceptional, persuasive, and persistent communicator verbally and in writing. Are achievement-oriented and have a high level of attention to detail. Have a high degree of comfort with Salesforce or other fundraising databases. Demonstrate a deep belief in our mission, and commitment to race, equity, diversity, and inclusion (REDI), and root your work in our. Ability to prove eligibility to work legally in the U.S.", "preferred": "Bonus Points If You: Have experience working in the launch phase of projects or programs. Are an AmeriCorps, Peace Corps, or other national service alum/alumna."}, "skills": ["Fundraising", "Grant Writing", "Salesforce", "Prospect Research", "Communication", "Project Management"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Comprehensive benefits package, including medical, dental, vision, disability, life insurance, flex spending accounts, generous paid time off, commuter benefits, an Employee Assistance Program (EAP), and currently a 403(b) match option. Professional development reimbursement fund up to $1,000 per year. Unlimited Paid Time Off (PTO) benefits for regular employees scheduled to work 30 hours or more per week. Exciting and dynamic culture, and commitment to investing in and supporting our amazing people to grow their careers with us.", "remoteWork": "Hybrid remote and in person, with requirements to be at our Los Angeles office twice a week and on-site as needed.", "url": "https://www.linkedin.com/jobs/view/3962442780"}