{"jobTitle": "Senior Data Analyst, People Analytics", "company": {"name": "Anduril Industries", "location": "Costa Mesa, CA", "industry": "Defense and Space Manufacturing"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "114,000—171,000 USD", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.<br/><br/>As a People Data Analyst, you will leverage data to derive insights that will inform people-related strategies and drive process improvement. You will apply technical expertise to build, maintain, and analyze complex data sets, make recommendations, and implement solutions that increase the efficiency and effectiveness of the people analytics function. You will partner with Operations, Recruiting, and the rest of the business to fill gaps and create scalable processes that support organizational growth and success.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>You’ll both lead and help on critical People projects across the company, requiring you to quickly iterate on project plans and goals.</li><li>You’ll partner with leadership to understand the needs of the business and create easily digestible reporting (ex. recruiting analytics and headcount tracking)</li><li>You will identify opportunities for process improvement and automation, and work with relevant stakeholders to implement solutions that increase efficiency and accuracy in people analytics processes.</li><li>You will ensure data integrity and precision while helping facilitate data migration to cloud-based storage.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>You have an incredibly high execution bar and will see projects through to completion which will include conception, gathering customer input, implementation, and iteration.</li><li>Proficiency in SQL, with the ability to write complex and nuanced queries against new or unfamiliar data sets (and if you’re not proficient, you have the aptitude and ambition to become fluent!)</li><li>Experience working with data visualization tools (e.g. Tableau, Power BI)</li><li>You're user-centric, and know how the outputs of your work - data, process, or tooling - will impact those who touch it.</li><li>High ownership and low ego, approaching everything with clear outcome orientation and a high degree of humility<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>1+ years of experience in a data analytics role, preferably with a focus on people analytics</li><li>Familiarity with HRIS or ATS systems, and experience working with data in these systems</li><li>Experience with scripting languages such as Python or R</li><li>Knowledge of data warehousing concepts and experience building data pipelines<br/><br/></li></ul>US Salary Range<br/><br/>$114,000—$171,000 USD<br/><br/><strong>Benefits<br/><br/></strong>The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.<br/><br/>Anduril is an equal-opportunity employer committed to creating a diverse and inclusive workplace. The Anduril team is made up of incredibly talented and unique individuals, who together are disrupting industry norms by creating new paths towards the future of defense technology. All qualified applicants will be treated with respect and receive equal consideration for employment without regard to race, color, creed, religion, sex, gender identity, sexual orientation, national origin, disability, uniform service, Veteran status, age, or any other protected characteristic per federal, state, or local law, including those with a criminal history, in a manner consistent with the requirements of applicable state and local laws, including the CA Fair Chance Initiative for Hiring Ordinance. We actively encourage members of recognized minorities, women, Veterans, and those with disabilities to apply, and we work to create a welcoming and supportive environment for all applicants throughout the interview process. If you are someone passionate about working on problems that have a real-world impact, we'd love to hear from you!<br/><br/>To view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/.", "responsibilities": "You’ll both lead and help on critical People projects across the company, requiring you to quickly iterate on project plans and goals.\nYou’ll partner with leadership to understand the needs of the business and create easily digestible reporting (ex. recruiting analytics and headcount tracking)\nYou will identify opportunities for process improvement and automation, and work with relevant stakeholders to implement solutions that increase efficiency and accuracy in people analytics processes.\nYou will ensure data integrity and precision while helping facilitate data migration to cloud-based storage.", "qualifications": {"required": "You have an incredibly high execution bar and will see projects through to completion which will include conception, gathering customer input, implementation, and iteration.\nProficiency in SQL, with the ability to write complex and nuanced queries against new or unfamiliar data sets (and if you’re not proficient, you have the aptitude and ambition to become fluent!)\nExperience working with data visualization tools (e.g. Tableau, Power BI)\nYou're user-centric, and know how the outputs of your work - data, process, or tooling - will impact those who touch it.\nHigh ownership and low ego, approaching everything with clear outcome orientation and a high degree of humility", "preferred": "1+ years of experience in a data analytics role, preferably with a focus on people analytics\nFamiliarity with HRIS or ATS systems, and experience working with data in these systems\nExperience with scripting languages such as Python or R\nKnowledge of data warehousing concepts and experience building data pipelines"}, "skills": ["SQL", "Tableau", "Power BI", "Python", "R", "data warehousing", "data pipelines"], "postedDate": "2 weeks ago", "benefits": "The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3962262872"}