{"jobTitle": "Corporate Development and Ventures Manager", "company": {"name": "Circle", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "145,000.00/yr - 192,500.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Financial Services", "description": "Circle is a financial technology company at the epicenter of the emerging internet of money, where value can finally travel like other digital data — globally, nearly instantly and less expensively than legacy settlement systems. This ground-breaking new internet layer opens up previously unimaginable possibilities for payments, commerce and markets that can help raise global economic prosperity and enhance inclusion. Our infrastructure – including USDC, a blockchain-based dollar – helps businesses, institutions and developers harness these breakthroughs and capitalize on this major turning point in the evolution of money and technology.<br/><br/><strong>What you’ll be part of:<br/><br/></strong>Circle is committed to visibility and stability in everything we do. As we grow as an organization, we're expanding into some of the world's strongest jurisdictions. Speed and efficiency are motivators for our success and our employees live by our company values: Multistakeholder, Mindfulness, Driven by Excellence and High Integrity. Circlers are consistently evolving in a remote world where strength in numbers fuels team success. We have built a flexible and diverse work environment where new ideas are encouraged and everyone is a stakeholder.<br/><br/><strong>What you’ll be responsible for: <br/><br/></strong>As a member of the Corporate Development and Ventures Team, Circle is looking for you to partner with leadership and our product, engineering, and revenue teams to drive strategic partnerships and investments to maximize our enterprise value. Additionally, you will manage relationships with prospective and existing portfolio companies and investors and help build out a startup ecosystem. In this role you will work across many teams internally and externally, and you will be responsible for coordinating with other key stakeholders to drive impact. Our team aspires to:<br/><br/><ul><li>Hunt for the signal amongst the noise to deliver insights, deals, and alignment towards our priorities. In addition to gathering intelligence from internal communities (product, engineering, and business primarily), we are the eyes and ears with the entrepreneurial community (founders/management and investors such as VC/PE/etc) and advisory community (bankers). </li><li>Advise through excellent business judgment to enable leadership to make the best-informed decisions.</li><li>Deliver best-in-class deal execution, due diligence, and integration, aligning the organization towards our objectives. </li><li>Ensure progress and success. We track deals over time (both those done and not) to report on our progress and learn through continuous improvement.<br/><br/></li></ul><strong>What you'll work on: <br/><br/></strong><ul><li>Develop a robust understanding of the landscape, dynamics, and trends in which we operate (financial services/technology and crypto industries). Continuously learn about new themes, trends, and technologies.</li><li>Build an internal and external network of partners, advisors, opportunities, signal, etc.</li><li>Find, identify, prioritize, and evaluate potential partnership and investment opportunities, including managing inbound deal flow</li><li>Lead due diligence activities and deal paperwork, coordinating with internal and external stakeholders and advisors</li><li>Collaborate with and aligning disparate groups of the company to bring our organization to decision points</li><li>Own the full partner and investment cycle from generating ideas, to qualifying partnership structures and opportunities, to negotiating and closing transactions by working closely with a cross-functional team including Legal, Compliance, Risk, and Finance.</li><li>Explore partnerships with Circle Ventures new investments and current portfolio companies, as well as industry leading crypto companies and funds.<br/><br/></li></ul><strong>You will aspire to our four core values:<br/><br/></strong><ul><li>Multistakeholder - you have dedication and commitment to our customers, shareholders, employees and families and local communities.</li><li>Mindful - you seek to be respectful, an active listener and to pay attention to detail. </li><li>Driven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals. </li><li>High Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty and intolerance.<br/><br/></li></ul><strong>What you’ll bring to Circle: <br/><br/></strong><ul><li>7+ years of relevant experience, ideally including experience in corporate development, M&amp;A and venture investing, management consulting, gained in either corporate or investment bank / venture capital environments </li><li>Excellent intrinsic capabilities, including strong quantitative and analytical skills, excellent verbal and written communication skills, strong executive presence, high motivation, low ego, deep intellectual curiosity. </li><li>Ability to build relationships (internally and externally), lead projects/deals, prioritize opportunities in a rapid paced corporate and industry environment</li><li>Experience in assessing industries, trends, futures and the ability to distill and articulate the most important drivers</li><li>Helpful to have experience across the deal pipeline including target identification, financial analysis, due diligence, negotiation, close, and integration/separation activities. </li><li>Experience/familiarity with Slack, Apple MacOS and GSuite.</li><li>Bachelor’s degree required with an Economics, Finance, Business, Technology or related discipline preferred. </li><li>Masters of Business Administration (MBA) or advanced degree is a nice to have.<br/><br/></li></ul><strong>Additional Information:<br/><br/></strong><ul><li>This position is eligible for day-one PERM sponsorship for qualified candidates.<br/><br/></li></ul><em>Circle is on a mission to create an inclusive financial future, with transparency at our core. We consider a wide variety of elements when crafting our compensation ranges and total compensation packages.<br/><br/></em><em>Starting pay is determined by various factors, including but not limited to: relevant experience, skill set, qualifications, and other business and organizational needs. Please note that compensation ranges may differ for candidates in other locations.<br/><br/></em><em>Base Pay Range: $145,000 - $192,500<br/><br/></em><em>Annual Bonus Target: 15%<br/><br/></em><em>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.<br/><br/></em>We are an <strong>equal opportunity employer</strong> and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additionally, Circle participates in the <strong>E-Verify Program</strong> in certain locations, as required by law.<br/><br/>", "responsibilities": "As a member of the Corporate Development and Ventures Team, Circle is looking for you to partner with leadership and our product, engineering, and revenue teams to drive strategic partnerships and investments to maximize our enterprise value. Additionally, you will manage relationships with prospective and existing portfolio companies and investors and help build out a startup ecosystem. In this role you will work across many teams internally and externally, and you will be responsible for coordinating with other key stakeholders to drive impact. Our team aspires to:<br/><br/><ul><li>Hunt for the signal amongst the noise to deliver insights, deals, and alignment towards our priorities. In addition to gathering intelligence from internal communities (product, engineering, and business primarily), we are the eyes and ears with the entrepreneurial community (founders/management and investors such as VC/PE/etc) and advisory community (bankers). </li><li>Advise through excellent business judgment to enable leadership to make the best-informed decisions.</li><li>Deliver best-in-class deal execution, due diligence, and integration, aligning the organization towards our objectives. </li><li>Ensure progress and success. We track deals over time (both those done and not) to report on our progress and learn through continuous improvement.<br/><br/></li></ul>", "qualifications": {"required": "7+ years of relevant experience, ideally including experience in corporate development, M&amp;A and venture investing, management consulting, gained in either corporate or investment bank / venture capital environments <br/>Excellent intrinsic capabilities, including strong quantitative and analytical skills, excellent verbal and written communication skills, strong executive presence, high motivation, low ego, deep intellectual curiosity. <br/>Ability to build relationships (internally and externally), lead projects/deals, prioritize opportunities in a rapid paced corporate and industry environment<br/>Experience in assessing industries, trends, futures and the ability to distill and articulate the most important drivers<br/>Helpful to have experience across the deal pipeline including target identification, financial analysis, due diligence, negotiation, close, and integration/separation activities. <br/>Experience/familiarity with Slack, Apple MacOS and GSuite.<br/>Bachelor’s degree required with an Economics, Finance, Business, Technology or related discipline preferred. ", "preferred": "Masters of Business Administration (MBA) or advanced degree"}, "skills": ["Corporate Development", "M&A", "Venture Investing", "Management Consulting", "Quantitative Analysis", "Analytical Skills", "Communication", "Executive Presence", "Relationship Building", "Project Management", "Deal Execution", "Due Diligence", "Negotiation", "Integration", "Slack", "Apple MacOS", "GSuite"], "postedDate": "2 weeks ago", "benefits": "Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3962220020"}