{"jobTitle": "Director, Executive Office (Executive Assistant)", "company": {"name": "Essential Access Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "100k", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Health, Wellness & Fitness", "description": "The Director, Executive Office (Hybrid/On-Site), is a vital member of the Senior Management Team, responsible for leading effective and efficient operations and administrative functions for the Executive Office. Partnering closely with the Co-CEOs and staff across the organization, the Director, will provide holistic support for the Executive Office and ensure successful implementation and completion of Executive-level initiatives and day-to-day activities, in alignment with Essential Access Health’s (Essential Access) core values and mission. The Director will also provide high-level administrative, planning, and coordination support to the Essential Access Board of Directors.<br/><br/>The salary for this position is $100k. This position is based in the organization's Los Angeles office with a hybrid remote/in-office.<br/><br/>Description of Duties<br/><br/><ul><li>Serve as a strategic advisor to the Executive Office and help ensure Co-CEOs time and resources are effectively utilized. </li><li>Manage special projects and strategic Executive-level initiatives, in partnership with the Co-CEOs that may include providing project coordination, documentation, and support. </li><li>Research, prioritize, and follow up on incoming issues and concerns to be considered and addressed by the Co-CEOs, including those of a sensitive or confidential nature, and make recommendations regarding appropriate course of action, referral, and/or response. </li><li>Lead activities to engage, inform, and provide high-level support for the Essential Access Board of Directors, including but not limited to initiating and scheduling meetings and travel, preparing materials for timely distribution, attending meetings and notetaking, and monitoring Board and Committee related projects. </li><li>Oversee Executive Office operations, including Co-CEO priorities, scheduling, travel, onsite and virtual meetings and events, and expense reports. </li><li>Coordinate, prepare for, and track Executive-level meetings, including agenda planning, action tracking, and facilitating appropriate follow-up. </li><li>Develop and support Executive key messages and support materials, including drafting, finalizing and disseminating documents, reports, emails, and presentations, and supporting Executive speaking engagements at local, regional, and national conferences. </li><li>Develop and support Executive key messages and support materials, including drafting, finalizing and disseminating documents, reports, presentations and emails. </li><li>Perform other duties as assigned. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>The requirements listed below are representative of the experience, knowledge, skill, and/or ability required to perform this job. </li><li>Must support organization’s mission and core values. </li><li>Bachelor's degree in relevant area of study. If degree was earned in other area of study, prior job experience will be considered. </li><li>7-10 years of experience effectively assisting CEO or COO level positions. </li><li>Excellent computer literacy, knowledge and experience of and with office systems, design programs, and contact management databases. </li><li>Ability to maintain a positive attitude in fast-paced office setting. </li><li>Outstanding written and verbal communication skills. </li><li>Ability to work with a variety of people and provide customer-oriented service to interact effectively at all levels and project a positive, warm, and helpful manner. </li><li>Ability to organize workload for effective implementation; advance and work on multiple projects simultaneously. </li><li>Strong attention to detail and proof-reading skills. </li><li>High level project management skills and experience including planning and implementation. </li><li>Flexibility to adapt to shifting priorities, manage day to day tasks, and plan ahead. </li><li>Must be a self-starter with a demonstrated track record of results and initiative. </li><li>Ability and willingness to travel. </li><li>Ability to work independently and in a team setting. </li><li>Ability to develop and maintain effective administrative procedures. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Certificates, Licenses, Registrations:<br/><br/></strong>A current California Driver’s License, current registration and current automobile insurance coverage is required if you drive on company business.<br/><br/><strong>Physical Demands:<br/><br/></strong>While performing the duties of this job, the employee is occasionally required to stand; walk; sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; talk or hear. The employee is occasionally required to lift up to 25 pounds. The vision requirements include: close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.<br/><br/>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Work Environment:<br/><br/></strong>Essential Access Health’s mission is to champion and promote quality sexual + reproductive health care for all. All employees must be supportive of Essential Access Health mission and goals and be able to handle mature subject material about sexual and reproductive health in a confident and professional manner.<br/><br/>Essential Access Health champions and promotes quality sexual + reproductive health care for all. All employees must be supportive of the organization's mission and goals. Essential Access is committed to fostering a work environment and organizational culture where all staff members feel welcomed, safe, respected, and valued. We strive to create a workplace that is free from discrimination and advances equity and inclusion. We commit to a diverse workforce representative of the communities we serve.<br/><br/>We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.<br/><br/>Essential Access offers a competitive salary and benefits. Essential Access is an M/F, Disabled, and Vet EEO/AA Employer.<br/><br/><strong>Note: </strong>The statements herein are intended to describe the general nature and level of work being performed by employees, and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the employer.<br/><br/><strong>Company Description<br/><br/></strong>About Essential Access Health<br/><br/>Mission: Essential Access Health champions and promotes quality sexual + reproductive health care for all<br/><br/>Essential Access Health (Essential Access) achieves its mission and advances health equity through a wide range of programs and services including clinic support initiatives, provider training, advanced clinical research, advocacy, and public awareness campaigns. Essential Access operates the Title X federal family planning program in California and Hawai'i and serves as the lead fiscal and program administrator for state-supported funding streams that support access to abortion and birth control for individuals with low-incomes seeking these essential services in California.<br/><br/>Commitment to Equity, Diversity, Justice + Inclusion<br/><br/>Essential Access was established in 1968, grounded in the belief that everyone has the right to access the health services and information they want – with dignity and respect. Although significant gains have been made in expanding access to essential health services over the past 50 years, true progress cannot be attained without confronting and addressing racism, advocating for equity and justice for all, including the LGBTQ+ community and individuals with disabilities. We are committed to integrating a health equity lens into our policies and broad range of programs and services and taking meaningful action to promote equitable and optimal sexual and reproductive health outcomes for all. Join Us<br/><br/>With offices in Northern and Southern California, our dedicated staff are leading experts in the field of sexual and reproductive health – as researchers, trainers, health care leaders, and more.<br/><br/>About Essential Access Health Mission: Essential Access Health champions and promotes quality sexual + reproductive health care for all Essential Access Health (Essential Access) achieves its mission and advances health equity through a wide range of programs and services including clinic support initiatives, provider training, advanced clinical research, advocacy, and public awareness campaigns. Essential Access operates the Title X federal family planning program in California and Hawai'i and serves as the lead fiscal and program administrator for state-supported funding streams that support access to abortion and birth control for individuals with low-incomes seeking these essential services in California. Commitment to Equity, Diversity, Justice + Inclusion Essential Access was established in 1968, grounded in the belief that everyone has the right to access the health services and information they want – with dignity and respect. Although significant gains have been made in expanding access to essential health services over the past 50 years, true progress cannot be attained without confronting and addressing racism, advocating for equity and justice for all, including the LGBTQ+ community and individuals with disabilities. We are committed to integrating a health equity lens into our policies and broad range of programs and services and taking meaningful action to promote equitable and optimal sexual and reproductive health outcomes for all. Join Us With offices in Northern and Southern California, our dedicated staff are leading experts in the field of sexual and reproductive health – as researchers, trainers, health care leaders, and more.", "responsibilities": "The Director, Executive Office (Hybrid/On-Site), is a vital member of the Senior Management Team, responsible for leading effective and efficient operations and administrative functions for the Executive Office. Partnering closely with the Co-CEOs and staff across the organization, the Director, will provide holistic support for the Executive Office and ensure successful implementation and completion of Executive-level initiatives and day-to-day activities, in alignment with Essential Access Health’s (Essential Access) core values and mission. The Director will also provide high-level administrative, planning, and coordination support to the Essential Access Board of Directors.<br/><br/>The salary for this position is $100k. This position is based in the organization's Los Angeles office with a hybrid remote/in-office.<br/><br/>Description of Duties<br/><br/><ul><li>Serve as a strategic advisor to the Executive Office and help ensure Co-CEOs time and resources are effectively utilized. </li><li>Manage special projects and strategic Executive-level initiatives, in partnership with the Co-CEOs that may include providing project coordination, documentation, and support. </li><li>Research, prioritize, and follow up on incoming issues and concerns to be considered and addressed by the Co-CEOs, including those of a sensitive or confidential nature, and make recommendations regarding appropriate course of action, referral, and/or response. </li><li>Lead activities to engage, inform, and provide high-level support for the Essential Access Board of Directors, including but not limited to initiating and scheduling meetings and travel, preparing materials for timely distribution, attending meetings and notetaking, and monitoring Board and Committee related projects. </li><li>Oversee Executive Office operations, including Co-CEO priorities, scheduling, travel, onsite and virtual meetings and events, and expense reports. </li><li>Coordinate, prepare for, and track Executive-level meetings, including agenda planning, action tracking, and facilitating appropriate follow-up. </li><li>Develop and support Executive key messages and support materials, including drafting, finalizing and disseminating documents, reports, emails, and presentations, and supporting Executive speaking engagements at local, regional, and national conferences. </li><li>Develop and support Executive key messages and support materials, including drafting, finalizing and disseminating documents, reports, presentations and emails. </li><li>Perform other duties as assigned. <br/><br/></li></ul>", "qualifications": {"required": "The requirements listed below are representative of the experience, knowledge, skill, and/or ability required to perform this job. \nMust support organization’s mission and core values. \nBachelor's degree in relevant area of study. If degree was earned in other area of study, prior job experience will be considered. \n7-10 years of experience effectively assisting CEO or COO level positions. \nExcellent computer literacy, knowledge and experience of and with office systems, design programs, and contact management databases. \nAbility to maintain a positive attitude in fast-paced office setting. \nOutstanding written and verbal communication skills. \nAbility to work with a variety of people and provide customer-oriented service to interact effectively at all levels and project a positive, warm, and helpful manner. \nAbility to organize workload for effective implementation; advance and work on multiple projects simultaneously. \nStrong attention to detail and proof-reading skills. \nHigh level project management skills and experience including planning and implementation. \nFlexibility to adapt to shifting priorities, manage day to day tasks, and plan ahead. \nMust be a self-starter with a demonstrated track record of results and initiative. \nAbility and willingness to travel. \nAbility to work independently and in a team setting. \nAbility to develop and maintain effective administrative procedures. <br/><br/>", "preferred": "A current California Driver’s License, current registration and current automobile insurance coverage is required if you drive on company business."}, "skills": ["Computer Literacy", "Office Systems", "Design Programs", "Contact Management Databases", "Project Management", "Communication", "Customer Service"], "postedDate": "1 month ago", "benefits": "Essential Access offers a competitive salary and benefits.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3962682057"}