{"jobTitle": "Logistics Warehouse Supervisor", "company": {"name": "Nippon Express USA", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Nippon Express Company, Ltd. (“NX”) was founded in 1872 in Japan and is headquartered in Tokyo. NX employs approximately 72,000 employees at 733 locations, in 47 countries and 314 cities around the world.<br/><br/>Nippon Express U.S.A., Inc. (“NEU”) was incorporated in New York in 1962 as a fully owned subsidiary of NX. NEU provides logistics solutions and comprehensive transportation services through its international freight forwarding and logistics network, including specialized handling of: air, land, sea and express packages; all types and sizes of cargo; personal effects and household goods; fragile and perishable freight; and livestock. NEU also provides related services, such as warehousing, distribution and customs brokerage and clearance. NEU operates at 55 locations in 27 states within the U.S., with approximately 1300 employees. NEU has enjoyed tremendous growth and success as one of the top five international freight forwarders in the world. We connect people with products throughout the world.<br/><br/>Warehouse Supervisor will manage and oversee all warehouse activities, ensure efficient processes, and maximize warehouse productivity. The Warehouse Supervisor's responsibilities include supervising employees, coordinating logistical processes, ensuring the quality of goods, and preparing relevant documentation. Assigning, directing and monitoring work of the Warehouse staff to ensure effective customer service, quality &amp; compliance, positive employee relations, safety &amp; security.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> Primary Duties: <br/><br/></strong><ul><li> Supervise and direct warehouse staffing in performing work according to Warehouse operating principles and procedures, compliance with applicable government regulations, company policies and procedures </li><li> Monitor performance of staff to ensure timely and proper picks, accurate packaging and paperwork, deliveries, transfers and excellent customer service with zero damages or losses and ensure all associates are trained on processes </li><li> Maintain effective inventory controls and records to ensure inventory accuracy </li><li> Document, record and report all inventory discrepancies to the Warehouse Manager in a timely manner </li><li> Maintains a positive employee relations environment in compliance with Company policies </li><li> Achieve high levels of customer satisfaction through excellence in receiving, identifying, dispatching, assuring quality of goods and problem solving </li><li> Communicate job expectations and coach employees </li><li> Responsible for approval of timesheets and partnership with HR </li><li> Ensuring basic maintenance standards and compliance with health and safety regulations </li><li> Communicate, coordinate, and partner with other departments in warehouse to provide clear communication on order status </li><li> Prepare work instructions </li><li> Salary $66,560.67 - $67,560.67 <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Excellent analytical, interpersonal and organization skills </li><li> Positive attitude, and the ability to multi-task and calmly handle quickly changing priorities under tight deadlines </li><li> Great attention to details </li><li> Minimum 3+ years of warehouse experience with previous experience in a Team Lead or Supervisory position </li><li> Must be flexible with work schedule. </li><li> Strong leadership skills </li><li> Strong customer service skills </li><li> Good verbal and written communication skills </li><li> Great computer skills (Microsoft Word &amp; Excel, Outlook) </li><li> High school diploma or equivalency certificate or significant or relevant or appropriate working experience <br/><br/></li></ul><strong>Organization Relationships<br/><br/></strong>This position will interact with branch colleagues, leadership staff, and office /warehouse personnel. Must be able to work with customers, vendors, and outside organizations.<br/><br/><strong>Work Environment<br/><br/></strong>(With or without accommodations) This position is working in office, using computers, entering data in our Warehouse Management System and being in the warehouse standing for several hours a day.<br/><br/>This job description is not intended to be and should not be construed as an all-inclusive list of all the responsibilities and working conditions of the position. While it is intended to accurately reflect the position activities and requirements, management reserves the right to modify, add or remove duties and assign other duties as necessary.<br/><br/><strong>Benefits<br/><br/></strong><strong> Nippon Express offers a generous Employee Benefits Package including: <br/><br/></strong><ul><li>Medical, Dental, and Vision beginning the 1 st of the month after 30 days.</li><li>401k with a company match</li><li>Flexible Spending Accounts, HSA, Life and Accidental Death &amp; Dismemberment Insurance, Short &amp; Long Term Disability, Auto and Home policies, Commuter Benefits, and much more.</li><li>Generous Vacation and Sick time.<br/><br/></li></ul>Nippon Express USA provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "responsibilities": "Warehouse Supervisor will manage and oversee all warehouse activities, ensure efficient processes, and maximize warehouse productivity. The Warehouse Supervisor's responsibilities include supervising employees, coordinating logistical processes, ensuring the quality of goods, and preparing relevant documentation. Assigning, directing and monitoring work of the Warehouse staff to ensure effective customer service, quality &amp; compliance, positive employee relations, safety &amp; security.", "qualifications": {"required": "Excellent analytical, interpersonal and organization skills, Positive attitude, and the ability to multi-task and calmly handle quickly changing priorities under tight deadlines, Great attention to details, Minimum 3+ years of warehouse experience with previous experience in a Team Lead or Supervisory position, Must be flexible with work schedule., Strong leadership skills, Strong customer service skills, Good verbal and written communication skills, Great computer skills (Microsoft Word &amp; Excel, Outlook), High school diploma or equivalency certificate or significant or relevant or appropriate working experience"}, "skills": ["Microsoft Word", "Microsoft Excel", "Outlook"], "postedDate": "1 month ago", "benefits": "Nippon Express offers a generous Employee Benefits Package including: <br/><br/>\n<ul><li>Medical, Dental, and Vision beginning the 1 st of the month after 30 days.</li><li>401k with a company match</li><li>Flexible Spending Accounts, HSA, Life and Accidental Death &amp; Dismemberment Insurance, Short &amp; Long Term Disability, Auto and Home policies, Commuter Benefits, and much more.</li><li>Generous Vacation and Sick time.<br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "66,560.67 - 67,560.67", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3962952169"}