{"jobTitle": "Director, Global Supply Chain", "company": {"name": "Howmet Aerospace", "industry": "Aviation and Aerospace Component Manufacturing", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "description": "<strong>Responsibilities<br/><br/></strong><strong>Essential Functions<br/><br/></strong>The Director of Global Supply Chain (GSC) will lead analysis, forecasting, and manufacturing order placement to manage min/max contractual performance. Own data, analysis, processes &amp; systems to enable accurate forecasting and fulfillment.<br/><br/><strong>Specific Responsibilities:<br/><br/></strong><ul><li> Implement future state GSC model (central intelligence &amp; ship from sites common across all manufacturing locations) and organization changes. </li><li> Improve GSC data models, forecast accuracy, linkage to plant financials, execution, and customer management. </li><li> Effectively manage customer engagement, MEDs, escalations, and potential penalties. </li><li> Create and begin implementation of future state SIOP model, process, and tools for HFS. </li><li> Manage min/max customer supply chain engagement/escalations. </li><li> Ensure expected customer performance levels are met – avoid penalties to HFS. </li><li> Effectively manage capacity allocation, lead times, NWC. </li><li> Serve as functional lead to develop and deploy effective SIOP processes and systems across HFS. </li><li> Develop and implement strategic plans to optimize supply chain efficiency and reduce costs. </li><li> Collaborate with cross-functional teams to align operational strategies with overall business objectives. </li><li> Lead continuous improvement initiatives to enhance operational processes and systems. </li><li> Monitor and analyze key performance indicators (KPIs) to ensure operational targets are met or exceeded. </li><li> Oversee inventory management to ensure optimal stock levels and minimize excess. </li><li> Ensure compliance with industry regulations and standards across all operations. </li><li> Mentor and develop operations staff to build a high-performing team. </li><li> Manage supplier relationships to ensure quality, cost-effectiveness, and reliability. </li><li> Develop risk management strategies to mitigate potential disruptions in the supply chain. </li><li> Coordinate with the finance team to align budget planning and financial forecasting with operational needs. <br/><br/></li></ul><strong>Skills:<br/><br/></strong><ul><li> Knowledge and experience with lean manufacturing. Proven leadership and management skills. Thorough knowledge of complex electronic business enterprise systems required. </li><li> Ability to work effectively with employees, peers, senior-level leaders, customers and vendor representatives. </li><li> Excellent communication, presentation, and persuasion skills. Ability to work independently, prioritizing and completing multiple work assignments in diverse fields with minimal direction. Strong critical thinking and problem-solving skills is required. <br/><br/></li></ul>The above statements are intended to describe the general nature of work being performed. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of incumbents in this job classification.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Qualifications:<br/><br/></strong><ul><li>A Bachelor’s degree in Engineering, Business, or Operations required. MBA preferred. </li><li>Ten years of experience in a manufacturing environment, with 7 years of progressive leadership experience.</li><li>P&amp;L responsibility.</li><li>Ability to effectively communicate and influence large groups of employees. </li><li>Prioritize and complete multiple and diverse work assignments with minimal direction and supervision.</li><li>Must have good computer skills using Microsoft applications or equivalent<br/><br/></li></ul><strong>About Us<br/><br/></strong><strong>About Howmet Aerospace<br/><br/></strong>Howmet Aerospace Inc. (NYSE: HWM), headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. Our primary businesses focus on jet engine components, aerospace fastening systems, titanium structural parts and forged wheels. With $6.6 billion in revenue in 2023, our products play a crucial role in enabling fuel efficiency and lightweighting, contributing to our customers’ success and making a positive impact on the world. To learn more about the way Howmet Aerospace Inc. is advancing the sustainability of our customers, markets, and communities where we operate, review the 2023 Environmental Social and Governance report at www.howmet.com/esg-report .<br/><br/>Follow: LinkedIn , Twitter , Instagram , Facebook , and YouTube .<br/><br/><em>Howmet is proud to be an Equal Employment Opportunity and Affirmative Action employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/></em><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or other applicable legally protected characteristics.<br/><br/></em><em>If you need assistance to complete your application due to a disability, please email TalentAcquisitionCoE_Howmet@howmet.com<br/><br/></em><strong>About The Team<br/><br/></strong>Howmet fastening systems are the premier aerospace and industrial fasteners, latches, bearings, fluid fittings and installation tools. Our products are used nose to tail on commercial and military defense aircraft, as well as on jet engines, automobiles, commercial transportation vehicles, wind turbines, solar power systems, and construction and industrial equipment.", "postedDate": "1 week ago", "skills": ["Lean Manufacturing", "Leadership", "Management", "Enterprise Systems", "Communication", "Presentation", "Persuasion", "Problem Solving", "Microsoft Applications"], "url": "https://www.linkedin.com/jobs/view/3962408979"}