{"jobTitle": "Business Systems Analyst (Supply Chain)", "company": {"name": "Oakley", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Foothill Ranch, CA"}, "location": "Foothill Ranch, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$79,577.70 - $112,432.05", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Retail Apparel and Fashion", "description": "Oakley, Inc. is a sport and lifestyle brand, driven to ignite the imagination through the fusion of art and science. Building on its legacy of innovative, market-leading optical technology, the company manufactures and distributes high performance sunglasses, prescription lenses and frames, goggles, apparel, footwear, and accessories. The essence of the brand is communicated through hundreds of professional and amateur athletes who depend on Oakley products to provide them with the very best while they redefine what is physically possible. Oakley is part of Luxottica, a global leader in the design, manufacture and distribution of fashion, luxury and sports eyewear. Our wholesale network covers more than 150 countries and our retail presence consists of over 9,100 retail stores across the globe.", "responsibilities": "The Supply Chain Business System Analyst performs statistical and analytical studies; fulfillment improvement tools, business cases, and presentations/publications according to prescribed guidelines, solves organizational information problems and requirements by analyzing data, designing and automating reports. Manages business process changes and configuration, and provides business consultancy, change management and system support.", "qualifications": {"required": "Bachelor’s Degree in Business or related, 3+ years of Operations or Supply Chain, Knowledge of generally accepted financial/business analytic principles and procedures; financial/business case preparation, statistical methods and technical writing, Able to interpret and explain complex data/analytics, Able to work independently and as part of a team with minimal supervision, Factual and data driven decision maker with strong written and oral communication skills, Knowledge and ability to promote Process Improvement, Advanced proficiency in Microsoft Office Software applications", "preferred": "Master’s Degree in Supply Chain, Operations, Engineering or related, SAP highly desired, Planning and inventory management"}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Employee pay is determined by multiple factors, including geography, experience, qualifications, skills and local minimum wage requirements. In addition, you may also be offered a competitive bonus and/or commission plan, which complements a first-class total rewards package. Benefits may include health care, retirement savings, paid time off/vacation, and various employee discounts.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3962469489"}