{"jobTitle": "Courtesy Clerk/Grocery Bagger", "company": {"name": "Kroger", "industry": "Retail", "size": "Large", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail", "description": "Create an outstanding customer experience through exceptional service. Establish and maintain a safe and clean environment that encourages our customers to return. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion, and safety of others.", "responsibilities": "Courtesy Clerk/Grocery Bagger is responsible for bagging groceries at check out for customers. Associate will strive for at least five items in the bag while ensuring that contents or items are not damaged. Courtesy Clerk/Grocery Bagger follows best practices for bagging items in various types of bags (reusable/plastic/paper). Associate will assist in removing customer's merchandise from bottom of bascart for checkout. Courtesy Clerk/Grocery Bagger will offer to help customers with loading bags into their car. Perform basic shelf conditioning. Inform customers of grocery specials. Return merchandise to store shelves. Gather bascarts and return them to designated areas. Clean spills, collect and pick up trash inside store and parking lot. Clean all areas inside and outside of store. Handle and assemble seasonal merchandise. Understand the store's layout, locate products, and conduct price checks for cashiers. Reinforce safety programs by complying with safety procedures and identify unsafe conditions, accidents, or issues and notify store management. Adhere to all food safety regulations and guidelines. Practice preventive maintenance by properly inspecting equipment and notify appropriate department or store manager of any items in need of repair. Create an environment that enables customers to feel welcome, important and appreciated by answering questions regarding products sold within the department and throughout the store. Report all safety risks or issues, and illegal activity, including: robbery, theft or fraud. Adhere to all local, state and federal laws, and company guidelines. Must be able to perform the essential functions of this position with or without reasonable accommodation.", "qualifications": {"required": "Customer Service skills, Effective communication skills, Ability to handle stressful situations", "preferred": "Retail Experience is preferred but not necessary"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3962947551"}