{"jobTitle": "Admin / Assistant Buyer", "company": {"name": "Reflex Sales Group", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$25.00/hr - $31.00/hr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Wholesale", "description": "Reflex helps brands move their overstocked &amp; excess inventory to retailers globally.  We are seeking a passionate, organized, and diligent person to join our team as an Admin / Operations Assistant. You will pay a crucial role in supporting our 4 Category Managers and running our operations.  In this role, you will be responsible for sourcing great brands, preparing deal presentations, routing &amp; logistics, data organization and general office management.  This is a full-time position with opportunities for growth and development.", "responsibilities": "Source new trending brands, Submit Routing and manage Logistics of shipments., Assist team with preparing new inventory submissions., Manage basic Bookkeeping through Quickbooks, Coordinate shipment of samples, General Office Management, Provide excellent customer service and resolve any client issues in a timely manner", "qualifications": {"required": "Communication skills: Strong verbal and written communication skills are essential. Must be able to communicate effectively with our team and clients., Organizational skills: Must be incredibly organized and a mastered mulit-tasker. Will have to juggle multiple tasks and deadlines, Attention to detail: Oriented and radically accurate in their work., Computer skills: Extremely proficient in using computers and software applications including Google Docs &amp; Sheets, Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and Quickbooks.  Hubspot is a plus.  Must be a very fast typer and tech savvy., Positive attitude and strong work ethic", "preferred": null}, "skills": ["Communication", "Organization", "Microsoft Office", "Google Docs", "Quickbooks", "Hubspot"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3963988717"}