{"jobTitle": "Project Manager - Water Business - Ports, Los Angeles, CA", "company": {"name": "Black & Veatch", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Engineering Services", "description": "Together, we own our company, our future, and our shared success.<br/><br/>As an employee-owned company, our people are Black & Veatch. We put them at the center of everything we do and empower them to grow, explore new possibilities and use their diverse talents and perspectives to solve humanity's biggest challenges in an ever-evolving world. With over 100 years of innovation in sustainable infrastructure and our expertise in engineering, procurement, consulting and construction, together we are building a world of difference.<br/><br/>Company :  Black & Veatch Corporation<br/><br/>Req Id :  104319<br/><br/>Opportunity Type : Staff<br/><br/>Relocation eligible : Yes<br/><br/>Full time/Part time : Full-Time<br/><br/>Project Only Hire :  No<br/><br/>Visa Sponsorship Available: No<br/><br/>Why Black and Veatch <br/>Recognized by Glassdoor as a 2023 Top 100 place to work , Black & Veatch allows you to lend your talent and perspective to humanity’s biggest challenges in a flexible environment where you are empowered to grow and explore new possibilities. We offer competitive compensation; 401K match and benefits that start day 1. Our hybrid environment allows you to balance your work and personal life.<br/><br/>At Black & Veatch, you own your career with purpose and meaning. You are empowered to grow and explore new possibilities at every step of your career journey. Bring your big ideas knowing you are safe to be who you are and speak up with concerns or questions and put your diverse talents and perspectives to use.<br/><br/>The Opportunity <br/>As the Project Manager - Ports, you will have the opportunity to operate as an energetic seller-doer with a broad range of experience to create, lead and manage high-performing teams to successful delivery of projects for our clients. The position is best suited for someone with high leadership capabilities and the ability to understand client needs and develop business growth prospects. The candidate will work closely with senior leadership developing a broader coastal and ports practice for the West Coast. This position will focus primarily on growing our footprint by providing services for Ports and Waterfront Public Works entities. Desired experience includes all facets related to the design and permitting of waterfront developments including piers, terminals and marinas.<br/><br/>The Team <br/>BV’s Governments & Environment business works to provide innovative solutions and integrated planning, design and construction support for mission-critical facilities, as well as threat reduction and environmental services support worldwide. By joining our business, you will be able to provide infrastructure for community benefit through regulated utilities and government agencies.<br/><br/>Key Responsibilities<br/><ul><li>Develop a client base for providing high-level marine, port, and coastal engineering services including identifying additional business development opportunities.</li><li>Participate in in business development activities, manage client relationships, write proposals and prepare/present selection, technical and conference presentations.</li><li>Works collaboratively to grow the Ports Infrastructure Planning and Asset Management Practice.</li><li>Maintain relationships with key clients, decision makers, regulators, stakeholders and Agency staff and converts these relationships into new opportunities that grow and foster a sustainable business. </li><li>Supports oversight on local projects to make sure budget and schedule metrics are achieved.</li><li>Responsible for setting hiring priorities, identifying candidates, and development of local staff.</li><li>Supervises technical staff for yearly performance. Mentors staff on longer-term career growth.</li><li>Performs technical work on strategic projects and oversee all aspects for the design and permitting of waterfront developments including piers, marinas, bulkheads, breakwaters, fendering, or boat launch ramps. <br/><br/></li></ul>Management Responsibilities<br/>Acts as a project manager. Among responsibilities is management of a project team. The individual comprising this team may vary by project.<br/><br/>Preferred Qualifications<br/><br/><ul><li>Highly proficient with marine, port and coastal engineering principles, practices, process, design/build and the application to work-related issues</li><li>10+ years of Client development and project execution experience with proven portfolio of serving both state and federal agencies.</li><li>Experience in a client-facing/business development role</li><li>Bachelor's degree in Civil or Structural Engineering</li><li>Engineer license (multi-state preferred)</li><li>Must be able to obtain a Transportation Worker Identification Credential (TWIC) card which requires a TSA background check. <br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li>Bachelor’s degree or equivalent experience.</li><li>All applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal/civil background check, drug screen, and motor vehicle records search, in compliance with any applicable laws and regulations.<br/><br/></li></ul>Work Environment/Physical Demands<br/><br/><ul><li>Hybrid work schedule: 3 days in office and 2 days remote</li><li>Typical office environment, typical construction environment, extreme weather conditions, high noise level, safety hazards (electric currents, working on scaffolding and high places, exposure to chemicals), atmospheric conditions (fumes, odors, dusts, mists, gases, poor ventilation). Sitting, walking, talking, hearing, reading, writing, keyboarding, driving, filing, reaching, stooping, crouching, bending, standing for extended periods of time, lifting or carrying up to 40 pounds.<br/><br/></li></ul>Salary Plan<br/>PMT: Project Management<br/><br/>Job Grade<br/>002<br/><br/>Black & Veatch endeavors to make www.bv.com/careers accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process because of a disability, please contact the Employee Relations Department at +1-913-359-1622 or via our accommodations request form . This contact information is for disability accommodation requests only; you may not use this contact information to inquire about the status of applications. General inquiries about the status of applications will not be returned. This job posting will remain open until a suitable candidate(s) has been identified.<br/><br/>Black & Veatch is committed to being an employer of choice by creating a valuable work experience that keeps our people engaged, productive, safe and healthy.<br/><br/>Our comprehensive benefits portfolio is a key component of this commitment and offers and array of health care benefits including but not limited to medical, dental and vision insurances along with disability and a robust wellness program.<br/><br/>To support a healthy work-life balance, we offer flexible work schedules, paid vacation and holiday time, sick time and dependent sick time.<br/><br/>A variety of additional benefits are available to our professionals, including a company matched 401k plan, adoption reimbursement, vendor discounts, an employment referral program, AD&D insurance, pre-taxed accounts, voluntary legal plan and the B&V Credit Union. Professionals may also be eligible for a performance-based bonus program.<br/><br/>We are proud to be a 100 percent ESOP-owned company. As employee-owners, our professionals are empowered to drive not only their personal growth, but the company's long-term achievements - and they share in the financial rewards of that success through stock ownership.<br/><br/>By valuing diverse voices and perspectives, we cultivate an authentically inclusive environment for professionals and are able to provide innovative and effective solutions for clients.<br/><br/>Black & Veatch Holding Company, its subsidiaries and its affiliated companies, complies with all Equal Employment Opportunity (EEO) affirmative action laws and regulations. Black & Veatch does not discriminate on the basis of age, race, religion, color, sex, national origin, marital status, genetic information, sexual orientation, gender Identity and expression, disability, veteran status, pregnancy status or other status protected by law.<br/><br/>For our EEO Policy Statement, please click here . If you’d like more information on your EEO rights under the law, please click here and here .<br/><br/>Notice to External Search Firms: Black & Veatch does not accept unsolicited resumes and will not be obligated to pay a placement fee for unsolicited resumes. Black & Veatch Talent Acquisition engages with search firms directly for hiring needs.<br/><br/>In accordance with local law, the following Annual compensation range is applicable for the job and location associated with this requisition: $114,906.00 - $247,613.00<br/><br/>", "responsibilities": "<ul><li>Develop a client base for providing high-level marine, port, and coastal engineering services including identifying additional business development opportunities.</li><li>Participate in in business development activities, manage client relationships, write proposals and prepare/present selection, technical and conference presentations.</li><li>Works collaboratively to grow the Ports Infrastructure Planning and Asset Management Practice.</li><li>Maintain relationships with key clients, decision makers, regulators, stakeholders and Agency staff and converts these relationships into new opportunities that grow and foster a sustainable business. </li><li>Supports oversight on local projects to make sure budget and schedule metrics are achieved.</li><li>Responsible for setting hiring priorities, identifying candidates, and development of local staff.</li><li>Supervises technical staff for yearly performance. Mentors staff on longer-term career growth.</li><li>Performs technical work on strategic projects and oversee all aspects for the design and permitting of waterfront developments including piers, marinas, bulkheads, breakwaters, fendering, or boat launch ramps. <br/><br/></li></ul>", "qualifications": {"preferred": "<ul><li>Highly proficient with marine, port and coastal engineering principles, practices, process, design/build and the application to work-related issues</li><li>10+ years of Client development and project execution experience with proven portfolio of serving both state and federal agencies.</li><li>Experience in a client-facing/business development role</li><li>Bachelor's degree in Civil or Structural Engineering</li><li>Engineer license (multi-state preferred)</li><li>Must be able to obtain a Transportation Worker Identification Credential (TWIC) card which requires a TSA background check. <br/><br/></li></ul>", "required": "<ul><li>Bachelor’s degree or equivalent experience.</li><li>All applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal/civil background check, drug screen, and motor vehicle records search, in compliance with any applicable laws and regulations.<br/><br/></li></ul>"}, "skills": ["marine", "port", "coastal", "engineering", "client development", "project execution", "business development", "civil", "structural", "engineering", "TSA background check"], "postedDate": "1 week ago", "benefits": "Recognized by Glassdoor as a 2023 Top 100 place to work , Black & Veatch allows you to lend your talent and perspective to humanity’s biggest challenges in a flexible environment where you are empowered to grow and explore new possibilities. We offer competitive compensation; 401K match and benefits that start day 1. Our hybrid environment allows you to balance your work and personal life.<br/><br/>At Black & Veatch, you own your career with purpose and meaning. You are empowered to grow and explore new possibilities at every step of your career journey. Bring your big ideas knowing you are safe to be who you are and speak up with concerns or questions and put your diverse talents and perspectives to use.<br/><br/>Our comprehensive benefits portfolio is a key component of this commitment and offers and array of health care benefits including but not limited to medical, dental and vision insurances along with disability and a robust wellness program.<br/><br/>To support a healthy work-life balance, we offer flexible work schedules, paid vacation and holiday time, sick time and dependent sick time.<br/><br/>A variety of additional benefits are available to our professionals, including a company matched 401k plan, adoption reimbursement, vendor discounts, an employment referral program, AD&D insurance, pre-taxed accounts, voluntary legal plan and the B&V Credit Union. Professionals may also be eligible for a performance-based bonus program.<br/><br/>We are proud to be a 100 percent ESOP-owned company. As employee-owners, our professionals are empowered to drive not only their personal growth, but the company's long-term achievements - and they share in the financial rewards of that success through stock ownership.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3963404567"}