{"jobTitle": "Air Import Specialist", "company": {"name": "Savino Del Bene", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Savino Del Bene is a Global Freight Forwarding Company headquartered in Florence, Italy. With a network of more than 295 offices and over 5,500 employees across five continents, Savino Del Bene is one of the leading logistics company that offers import, export, customs brokerage services and warehousing third party solutions servicing several Vertical Markets.\n\nWe are currently looking for an experienced Air Import Specialist to join our growing team. We are looking for an individual with a passion for the freight forwarding industry and a motivated candidate to become part of our dynamic, high-paced, professional Import team.\n\n. \n\n*Essential Duties and Responsibiliti*es\n* Receive, review, and process export documentation for accounts.\n* Must have a better than average understanding of the Import Regulations or other government agency regulations that govern exports.\n* Must have a better than average understanding of TSA regulations.\n* Ensure documentation is accurately processed, distributed and released to carrier, customers and agents in a timely manner.\n* Obtain and create quotes for shipments and source best method of transportation.\n* Communicate with overseas agents to ensure proper pre-alerts and documentation.\n* Continue to explore different options to reduce cost, and increase revenues.\n* Track and trace shipment and provide updates to clients and sale\n* Uphold a strong and professional relationship with airlines, transportation agencies and sales.\n* Demonstrate an emphasis on customer satisfaction per company policy.\n* Maintain shipment files and ensure billing is completed within a timely fashion.\n* Assist as backup for alternate accounts.\n* Perform other duties as assigned.\n* Must be able to perform essential job functions with or without reasonable accommodations*. \n\n*Preferred Qualifications*\n* High School Diploma or GED required\n* 1-3 years experience with freight forwarder or export agency\n* Knowledge on incoterms.\n* IATA hazmat preferred, but not required.\n* Demonstrates excellent written and verbal communication skills; along with math skills for dimension conversions.\n* Intermediate to Advanced PC skills - MS Office.\n* Highly organized.\n* Professional and courteous demeanor.\n* Displays a flexible and open minded willingness to adapt to new environments and be a team player.\n* Must have good ethical standards.", "postedDate": "1 week ago", "skills": ["Import Regulations", "TSA regulations", "Freight Forwarding", "Export Documentation", "Incoterms", "IATA hazmat", "MS Office"], "url": "https://www.linkedin.com/jobs/view/3963026676"}