{"jobTitle": "Operations Supervisor - Long Beach", "company": {"name": "Veo", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "This is a W2 full-time position<br/><br/>Range: $25<br/><br/><strong>Company Overview:<br/><br/></strong>At Veo, we are on a mission to end car dependency by making clean transportation accessible to all and advancing the next generation of fully electric micromobility systems. Our fleets are constantly evolving and feature a range of vehicles - from pedal and electric bicycles, to standing and seated e-scooters, e-cargo bikes, and ADA accessible devices. We design and build our own vehicles, hardware, and software systems in house and run all our local operations to provide safe, efficient, and responsive mobility services that make communities more sustainable and livable. We are looking for exceptionally talented individuals who are ready to develop and implement new solutions to these exciting challenges. We are headquartered in Santa Monica, CA, but are hiring across the U.S. Join us!<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Support the Operations Manager with the day-to-day responsibilities in the market </li><li>60-80% of your time will be hands-on, manual work to include:</li><ul><li>Direct labor and warehouse organization </li><li>Hand-count assets and compliance audits </li><li>Perform routine inspection and maintenance of vehicles</li><li>Respond to on-demand and in the field customer service requests</li><li>Redistribute scooters around Veo's service areas</li><li>Identify, document and recover scooters requiring in-shop repair</li><li>Ad-hoc field tasks and other tasks as required</li></ul><li>20-40% of your time will consist of a variety of administrative work to include:</li><ul><li>Support Operations Manager with hiring, training, scheduling staff </li><li>Employee productivity tracking</li><li>SOP follow-up</li><li>Assist Operations Manager with other projects as needed</li></ul></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3963183310"}