{"jobTitle": "Part Time Sales Associate - Shops at Mission Viejo", "company": {"name": "Build-A-Bear Workshop", "location": "Mission Viejo, CA"}, "location": "Mission Viejo, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong>Part time sales associates are fun, genuine, and team-oriented individuals who contribute to store sales and Guest satisfaction goals by providing individual and groups of Guests a unique and memorable \"WOW\" experience. Providing this experience includes, but is not limited to, assisting with choosing, stuffing, dressing, naming, and purchasing their new furry friends, while maintaining store visual and housekeeping standards.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Knowledge in current store sales, contributing metrics and conversion goals with ownership of individual contribution.</li><li>Make a connection with Guests by providing a personalized approach – welcoming and greeting all Guests with a smile, while being genuine and sincere.</li><li>Engaging Guests in conversation by using open-ended questions to assess reason for visit and to make experience personal.</li><li>Use information gained from engaging with guest to convert Guests and drive sales. This should include inviting Guests to come in and learn about our store.</li><li>Knowledge of current promotions and newest products in order to assists Guests.</li><li>Follow our “Experience First” approach to assist Guest through the entire BABW experience.</li><li>Suggestive sell in order to maximize store results and enhance the Guest’s experience.</li><li>Support our company party commitments by suggesting parties to all guests and by delivering a great party experience.</li><li>Maintain visual and housekeeping standards to create the brand experience unique to BABW.</li><li>Follow all company policies and procedures including by not limited to Cash Management, Attendance, and Security.</li><li>Complete all other tasks as may be assigned by store management.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Out-going, ambitious and success oriented</li><li>Exceptional communication and selling skills</li><li>Models personal and professional integrity</li><li>Flexible and adaptable in a fast-paced work environment</li><li>Enjoys a high energy environment and demonstrates an appreciation for children of all ages</li><li>Represents a neat and clean appearance</li><li>Must be at least 18 years of age in North America<br/><br/></li></ul>Job descriptions are used for informational purposes only and are not to be considered all-inclusive of responsibilities within a position, and my change periodically with or without notice. We reserve the right to add, delete, change duties, formally or informally, verbally or in writing, at any time.<br/><br/>Pay range: $16.80-$17.00/Hour.", "responsibilities": "Knowledge in current store sales, contributing metrics and conversion goals with ownership of individual contribution. Make a connection with Guests by providing a personalized approach – welcoming and greeting all Guests with a smile, while being genuine and sincere. Engaging Guests in conversation by using open-ended questions to assess reason for visit and to make experience personal. Use information gained from engaging with guest to convert Guests and drive sales. This should include inviting Guests to come in and learn about our store. Knowledge of current promotions and newest products in order to assists Guests. Follow our “Experience First” approach to assist Guest through the entire BABW experience. Suggestive sell in order to maximize store results and enhance the Guest’s experience. Support our company party commitments by suggesting parties to all guests and by delivering a great party experience. Maintain visual and housekeeping standards to create the brand experience unique to BABW. Follow all company policies and procedures including by not limited to Cash Management, Attendance, and Security. Complete all other tasks as may be assigned by store management.", "qualifications": {"required": "Out-going, ambitious and success oriented, Exceptional communication and selling skills, Models personal and professional integrity, Flexible and adaptable in a fast-paced work environment, Enjoys a high energy environment and demonstrates an appreciation for children of all ages, Represents a neat and clean appearance, Must be at least 18 years of age in North America"}, "skills": [], "postedDate": "1 month ago", "salary": {"amount": "16.80-17.00/Hour"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3963507030"}