{"jobTitle": "Buyer Entertainment Costume", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "66,500.00- $70,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Each day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Summary<br/><br/></strong><strong>Job Description<br/><br/></strong>The Buyer for Entertainment Costume Fabrication is responsible for the sourcing, purchasing and procurement of all costume related items in accordance with the assigned budgets, projects, operational needs, company policies and procedures. The Costume Buyer will source several options and purchase materials including fabric, notions, and accessories for the construction of original costumes as approved by the managers, senior manager, or costume designer. The Buyer also sources and purchases ready-made garments, shoes, and operational supplies for productions and operations as requested by management.<br/><br/><strong>Job Duties<br/><br/></strong><ul><li>Makes purchases as assigned by Management for all projects, and events.</li><li>Sources fabrics, materials and supplies in relation to creative/design concepts for all shows, projects, venues, in partnership with Designers, Costumers, or Management</li><li>Reconcile credit card receipts/statements and monitor production spending accounts.</li><li>Administers all on-line shopping and returns as needed.</li><li>Returns unused garments, supplies, and accessories in a professional and timely manner.</li><li>Processes invoices and returns, monitor expenditures and budget in relation to project, show or operational budget actuals.</li><li>Maintains accounting records for all credit card purchases, purchase orders and payments processed.</li><li>Maintains a current list of vendors, suppliers, and freelance personnel to support costume production.</li><li>Establishes and maintains good relationships with vendors.</li><li>Coordinates receiving of all purchased goods and ensure delivery to all users.</li><li>Oversees the ordering and organization of all shop supplies/inventories as necessary.</li><li>Creates and maintains fabrics, notions, purchasing source books and library.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>USH Entertainment Department is committed to promoting a collaborative, productive, and engaging workplace for all employees. We require Managers and Supervisors to lead by example in promoting a professional, inspiring, fun, and teamwork-oriented work culture.<br/><br/><ul><li>Valid Driver’s license required for this position. Mileage accrued during work hours, paid.</li><li>The buyer should have at least 3 years costume shop/wardrobe buying experience with a keen understanding of costume construction and a thorough knowledge of fabrics, textiles, materials, and wardrobe supplies. The buyer role requires exceptional attention to detail, the ability to maintain costume budgets, and strong organizational and communication skills and work well under pressure.</li><li>Knowledge of immediate Los Angeles and surrounding area for costume production and product vendors and resources. Experience with ordering in high volume for theme park operations is highly desired.</li><li>Quality and partner focus: Continuously look for ways to refine and improve work processes to achieve better results. Follow through on commitments made to internal and external partners.</li><li>Maximizing resources: Work collaboratively with all employees in the organization and support others when requested. Seek expertise, advice, and perspectives from a variety of sources both within and outside the organization to ensure a high work standard and an engaging culture for employees. Maintain a productive balance between the concern for people and concern for work results.</li><li>Learning and adapting: Remain productive during periods of ambiguity, uncertainty, and change.</li><li>Demonstrate a willingness to take on new challenges, responsibilities, and assignments. Proactively utilize slower periods to improve work and or work environment, equipment maintenance, archiving, general organization, etc.<br/><br/></li></ul>Key Competencies<br/><br/><strong>USH Entertainment Department </strong>is committed to promoting a collaborative, productive, and engaging workplace for all employees. We require members of management to lead by example promoting a professional, inspiring, fun, and teamwork-oriented work culture.<br/><br/><strong>General Knowledge and Skills Required: Buyer</strong><strong>, Entertainment Costume Fabrication </strong>shall have the ability to read, interpret and follow documents such as safety rules, operating and maintenance instructions and procedure manuals. The Buyer shall be able to write reports, business correspondence and procedure manuals. Buyer will be able to effectively communicate, present information, and answer questions in one-on-one and group settings.<br/><br/><strong>Communicating and influencing: </strong>Buyers are required to communicate effectively with people at all levels in the organization, including providing specific, timely feedback to managers and others to work together more effectively.<br/><br/><strong>Quality and partner focus: </strong>Continuously look for ways to refine and improve work processes to achieve better results. Follow through on commitments made to internal and external partners.<br/><br/><strong>Qualifications &amp; Key Competencies<br/><br/></strong><strong>Maximizing resources: </strong>Work collaboratively with all employees in the organization and support others when requested. Seek expertise, advice, and perspectives from a variety of sources both within and outside the organization to ensure a high work standard and an engaging culture for employees. Maintain a productive balance between the concern for people and concern for work results.<br/><br/><strong>Project Management:</strong> Develop plans for accomplishing objectives, monitoring status, and providing regular status updates. Provide relevant information to others in a timely manner and follow through with commitments made to others. Recognize the broader implications of a project; doing all that should be done, not just as directed.<br/><br/><strong>Learning and adapting:</strong> Remain productive during periods of ambiguity, uncertainty, and change.<br/><br/>Demonstrate a willingness to take on new challenges, responsibilities, and assignments. Proactively utilize slower periods to improve work and or work environment, equipment maintenance, archiving, general organization, etc.<br/><br/><ul><li>Required On-Site: This position is required to be performed full-time from an NBCUniversal-designated worksite.<br/><br/></li></ul>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $66,500.00- $70,000.00<br/><br/><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Buyer for Entertainment Costume Fabrication is responsible for the sourcing, purchasing and procurement of all costume related items in accordance with the assigned budgets, projects, operational needs, company policies and procedures. The Costume Buyer will source several options and purchase materials including fabric, notions, and accessories for the construction of original costumes as approved by the managers, senior manager, or costume designer. The Buyer also sources and purchases ready-made garments, shoes, and operational supplies for productions and operations as requested by management.", "qualifications": {"required": "Valid Driver’s license required for this position. Mileage accrued during work hours, paid. The buyer should have at least 3 years costume shop/wardrobe buying experience with a keen understanding of costume construction and a thorough knowledge of fabrics, textiles, materials, and wardrobe supplies. The buyer role requires exceptional attention to detail, the ability to maintain costume budgets, and strong organizational and communication skills and work well under pressure. Knowledge of immediate Los Angeles and surrounding area for costume production and product vendors and resources. Experience with ordering in high volume for theme park operations is highly desired.", "preferred": "Quality and partner focus: Continuously look for ways to refine and improve work processes to achieve better results. Follow through on commitments made to internal and external partners. Maximizing resources: Work collaboratively with all employees in the organization and support others when requested. Seek expertise, advice, and perspectives from a variety of sources both within and outside the organization to ensure a high work standard and an engaging culture for employees. Maintain a productive balance between the concern for people and concern for work results. Learning and adapting: Remain productive during periods of ambiguity, uncertainty, and change. Demonstrate a willingness to take on new challenges, responsibilities, and assignments. Proactively utilize slower periods to improve work and or work environment, equipment maintenance, archiving, general organization, etc."}, "skills": [], "postedDate": "1 month ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3963246880"}