{"jobTitle": "Store Manager", "company": {"name": "Mother's Market & Kitchen", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "<strong>Salary Range:</strong> $75k-$110k<br/><br/>The Store Manager acts as a role model and exemplifies Mother’s mission to be of service to health and wellness. Ultimately, they’re responsible for ensuring individual departments, segments, or stores are effective in achieving their goals.<br/><br/><strong>Objectives of this Role<br/><br/></strong><ul><li> To lead with professionalism, authority, expertise, and creativity. </li><li> Drive sales, standards, and growth within the store. </li><li> Achieving all KPI’s and targets as directed. </li><li> Manage store financials and demonstrate full comprehension of the Profit &amp; Loss (P&amp;L) Statement. </li><li> Review daily reports and use them in the daily operation of the business. </li><li> Review and improve organizational effectiveness by developing processes, overseeing employees, establishing a highly motivated work environment, and creating innovative approaches for improvement. </li><li> Work with the Merchandising Team on the merchandising of all products. </li><li> Communicate and coordinate with Corporate regarding employee relations, reviews, corrective actions, engagement, training, and overall success of the employee life cycle. </li><li> Sustain a high level of product knowledge and product preparation. </li><li> Maintain store sanitation and cleanliness per local laws and best practices and delegate responsibilities to department managers &amp; supervisors. </li><li> Work with home office team on ideas to grow sales. </li><li> Uphold standards of excellence and soaring quality. <br/><br/></li></ul><strong>Tasks &amp; Responsibilities<br/><br/></strong><ul><li> Manage daily operations of grocery store to meet store goals. </li><li> Review sales on a daily basis by department to identify areas of opportunity</li><li> Provide direction and guidance to grocery staffs in their assigned job duties. </li><li> Follow and enforce store policies, security measures and customer service standards. </li><li> Provide excellent customer services for sales growth. </li><li> Develop positive shopping experience and ensure customer satisfaction. </li><li> Evaluate performance of each staff and provide appropriate feedback. </li><li> Perform inventory control to avoid over stock and low stock and shrink. </li><li> Manage product storage and rotation activities to reduce shrink. </li><li> Oversees loss prevention and stores appearance/conditions. </li><li> Ensure that grocery shelves are maintained clean and organized. </li><li> Ensure that shelves are loaded with fresh products all the times. </li><li> Ensure that all products are properly tagged and labeled. </li><li> Assist in recruiting and training staffs on assigned responsibilities. </li><li> Assign daily workload and schedules to staffs. </li><li> Setup product displays according to merchandising standards. </li><li> Maintain the store clean, safe and appealing. </li><li> Develop process improvements to maximize sales and profitability. </li><li> Educate staff about safety and sanitation procedures. </li><li> Review monthly P&amp;L. </li><li> Review Perishable Inventory Counts for reasonability and correct procedures</li><li> Ensures monthly inventory count deadlines are achieved, and the store is inventory ready. </li><li> Review Non Perishable Inventory Counts done by the outside inventory counting company for reasonability. </li><li> Recruit, onboard, and train high-performing employees to achieve sales, profitability, market share, and business plan objectives</li><li> Plan for weekly labor, execute to budget. </li><li> Initiate communications with the corporate support team (Buyers, AP, HR &amp; Executive Leadership) to ensure exchange of business information such as vendor, product issues, operational or process concerns. </li><li> Approve all store expenses before they occur. </li><li> Monitors and addresses; customer issues, personnel situations, rewards, recognition, and policy violations. </li><li> Maintain project timelines to ensure tasks are accomplished on time</li><li> Delegates responsibilities to Supervisors to enforce all policies, procedures, standards, specifications, guidelines, training, and cultural values. </li><li> Resolve internal staff conflicts efficiently and to the mutual benefit of those involved</li><li> Walk departments regularly to ensure an organized, sanitary, and overall clean appearance at all times. <br/><br/></li></ul><strong>Skills, Knowledge &amp; Experience<br/><br/></strong><ul><li> Bachelor’s degree preferred, but not required</li><li> 2+ years of management experience in a medium/large retail/grocery business </li><li> Excellent understanding of retail, margin and inventory. </li><li> Strong decision-making capabilities</li><li> Above-average communication, collaboration, and delegation skills</li><li> Proven ability to develop and maintain financial plans</li><li> Ability to motivate and lead people, and hold employees accountable</li><li> Strong working knowledge of operational procedures</li><li> A customer orientated individual with a genuine passion for driving sales and standards</li><li> Excellent communication and leadership skills</li><li> Strong problem-solving abilities</li><li> Ability to work well in a team-oriented environment. </li><li> Verbal Proficiency of the English Language, able to read and write at an advanced level</li><li> Proficient in using Word, Excel, Outlook, etc<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li> Vision is required for reading instructions, billing, cash counting, and help with display setup</li><li> Must be able to lift any and all items, usually over 100 times per day from 6” to 60”, to include bags, boxes and loose product</li><li> Must be available to work at all store locations as needed, all shifts<br/><br/></li></ul><em>This job description is intended to describe the general requirements for the performance of this job. It is not a complete statement of duties, responsibilities or requirements. Other duties not listed here may be assigned by leadership.</em>", "postedDate": "1 month ago", "skills": ["Retail", "Inventory Management", "Sales", "Customer Service", "Leadership", "Teamwork", "Communication", "Problem Solving", "Financial Planning", "Microsoft Excel", "Microsoft Word", "Microsoft Outlook"], "url": "https://www.linkedin.com/jobs/view/3963056807"}