{"jobTitle": "Director of Operations (RN)- $10,000 Sign On Bonus", "company": {"name": "Agape Care Group", "industry": "Hospitals and Health Care", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Overview<br/><br/></strong><strong>Join Our Team as a Director of Operations (RN)<br/><br/></strong>Are you a leader committed to creating meaningful patient experiences? Do you believe in the importance of providing top-quality hospice and palliative care to those who need it?<br/><br/>We are looking for a director of operations (RN) who is ready to lead and serve. As a director of operations, you will plan, direct, coordinate, and evaluate the daily operations to ensure adherence to federal and state regulations, organizational policies and procedures, and established goals/budgets. Additionally, you’ll be responsible for your assigned branch’s financial success and serve as a driving force for growth by active involvement in sales and marketing activities.<br/><br/>And just like all of our team members, as director of operations, you will have access to our supportive leadership team and professional development opportunities with plenty of room for advancement.<br/><br/><strong> We’re Offering Even More Great Benefits When You Join Our Team! <br/><br/></strong><ul><li> Tuition Reimbursement </li><li> Immediate Access to Paid Time Off </li><li> Employee Referral Program Bonus Eligibility </li><li> Matching 401K </li><li> Annual Merit Increases </li><li> Years of Service Award Bonuses </li><li> Pet Insurance </li><li> Financial and Legal Assistance Program </li><li> Mental Health and Counseling Programs </li><li> Dental and Orthodontic Coverage </li><li> Vision Insurance </li><li> Health Care with Low Premiums </li><li> $500 Matching Health Savings Account </li><li> Short-term and Long-term Disability </li><li> Virgin Pulse Wellness Program </li><li> Fertility Assistance Program <br/><br/><br/></li></ul><strong>Our Company Mission<br/><br/></strong>Our mission is to serve with love, providing comfort and support through compassionate care and meaningful experiences. For our team members, these aren’t empty words. In every interaction, no matter how big or small, we’re dedicated to providing a superior experience for patients facing life-limiting illnesses and their families.<br/><br/><strong>About Agape Care Group<br/><br/></strong>A leading hospice, palliative, and pediatric comfort care provider, Agape Care Group is dedicated to serving patients and families with love and delivering the highest quality care. The Agape Care Group family of brands spans seven states - Alabama, Georgia, Louisiana, North Carolina, Oklahoma, South Carolina, and Virginia. At any location within our company, you'll find a career that means something. You'll not only have the opportunity to use your skills to make a real difference, but you'll also be part of an inclusive, respectful work environment filled with peers who have answered the call to care for others.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> A heart to serve patients and families and a passion for providing the best possible care </li><li> Education: Graduate of an accredited nursing school (BSN preferred). Current state license as a registered nurse </li><li> Experience: Minimum 3 years of healthcare management and supervisory experience as a registered nurse in an appropriate clinical care setting, home health, or hospice environment (preferred). 2 years of hospice experience required. </li><li> Required: Reliable transportation. Ability to sit, stand, bend, move intermittently and lift at least 25 lbs and bear the weight of an average adult effectively. <br/><br/><br/></li></ul>We’ve worked hard to build a caring culture of integrity, communication, diversity and positive experiences, and we’d love for you to join our team.<br/><br/><ul><li>Pay is determined by years of experience and location.</li></ul>", "responsibilities": "As a director of operations, you will plan, direct, coordinate, and evaluate the daily operations to ensure adherence to federal and state regulations, organizational policies and procedures, and established goals/budgets. Additionally, you’ll be responsible for your assigned branch’s financial success and serve as a driving force for growth by active involvement in sales and marketing activities.", "qualifications": {"required": "A heart to serve patients and families and a passion for providing the best possible care, Education: Graduate of an accredited nursing school (BSN preferred). Current state license as a registered nurse, Experience: Minimum 3 years of healthcare management and supervisory experience as a registered nurse in an appropriate clinical care setting, home health, or hospice environment (preferred). 2 years of hospice experience required., Required: Reliable transportation. Ability to sit, stand, bend, move intermittently and lift at least 25 lbs and bear the weight of an average adult effectively.", "preferred": "BSN"}, "skills": [], "postedDate": "1 month ago", "benefits": "Tuition Reimbursement, Immediate Access to Paid Time Off, Employee Referral Program Bonus Eligibility, Matching 401K, Annual Merit Increases, Years of Service Award Bonuses, Pet Insurance, Financial and Legal Assistance Program, Mental Health and Counseling Programs, Dental and Orthodontic Coverage, Vision Insurance, Health Care with Low Premiums, $500 Matching Health Savings Account, Short-term and Long-term Disability, Virgin Pulse Wellness Program, Fertility Assistance Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3963045396"}