{"jobTitle": "Supply Chain Manager, Amazon Grocery Logistics", "company": {"name": "Amazon", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Distribution, Supply Chain, and Engineering", "industry": "Software Development", "description": "The Amazon Grocery Logistics (AGL) Supply Chain organization is responsible for building the next generation supply chain for Amazon’s physical grocery stores and online grocery fulfillment. Come be a part of a 100+ Distribution Center and Fulfillment Center network across North America and Europe – serving customers in as fast as 60 minutes!\n\nAs part of the AGL Supply Chain organization, the Grocery Distribution Center (DC) supply chain team is looking for an experienced Supply Chain Manager to continue growing and improving our grocery DC supply chain.\n\nAmazon's grocery offerings are designed to get customers what they want as quickly as possible – whether customers are shopping in our grocery stores or ordering online to their doorstep. With ultra-fast delivery becoming increasingly important for customers, DCs represent a critical link in the supply chain to enable low-cost sourcing, storage and replenishment of merchandise to our fulfillment center and physical stores network. Our mission is to support the scalable growth of ultra-fast delivery to our customers while meeting instock, quality and selection availability goals. If this mission and the challenge of building a new supply chain in an innovative, fun and high-growth environment is exciting to you, then we would love to talk to you!\n\nThe Supply Chain Manager will own regional execution of inbound deliveries into grocery DCs and be responsible for critical metrics including DC instock, inbound SLA compliance, quality, and DC capacity utilization. You will partner closely with other Amazon teams such as Amazon Grocery Retail, DC Operations, technology partners and Finance in order to delight customers and meet our goals. We will also look to you for evaluation and implementation of new processes and execution technology products that will improve our supply chain and scale our operation for future growth.\n\nThis role can be located in the corporate offices in either Seattle, WA, or New York City, NY.\n\nKey job responsibilities\n\n<ul><li> Develop the overall program strategy, tactically driving teams in and outside of your organization to deliver.</li><li> Solve ambiguous problems and proactively identify and mitigate risks (before they become roadblocks).</li><li> Oversee gaps between teams, processes and systems, helping teams reduce exposure to classic failure modes (e.g., requirements not sufficiently understood or documented, ineffective cross-team collaboration, long-term impact(s) from third-party solutions, security not considered, insufficient stakeholder review, etc.).</li><li> Work autonomously in an ambiguous environment, seeking to understand business problems, automation limitations, scaling factors, boundary conditions and reasons behind leadership decisions.</li><li> Develop, implement, and govern KPI reporting for a portfolio of programs, providing visibility to the milestones, and performance across all projects.</li><li> Work with program managers, business leaders and executive teams to communicate and impact critical business initiatives.</li><li> Engage other Amazon business units globally to share best practices and improve end to end outcomes for Amazon customers.<br/><br/></li></ul>A day in the life\n\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\n\n<ul><li> Medical, Dental, and Vision Coverage</li><li> Maternity and Parental Leave Options</li><li> Paid Time Off (PTO)</li><li> 401(k) Plan<br/><br/></li></ul>Learn more about our benefits here: https://www.amazon.jobs/en/internal/benefits/us-benefits-and-stock\n\n<strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of working cross functionally with tech teams experience</li><li> Bachelor's degree</li><li> 3+ years of supply chain experience</li><li> 3+ years of defining and implementing process improvement initiatives using data and metrics experience</li><li> Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL</li><li> Experience defining program requirements and using data and metrics to determine improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 2+ years of supply chain, forecasting, manufacturing, sourcing/procurement, or vendor management experience</li><li> Knowledge of SQL at an intermediate level, including: compile queries, subqueries, aggregation/grouping, data modification, etc.</li><li> Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization</li><li> Experience in driving end to end delivery, and communicating results to senior leadership<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $77,200/year in our lowest geographic market up to $141,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2675527", "responsibilities": "Develop the overall program strategy, tactically driving teams in and outside of your organization to deliver.\nSolve ambiguous problems and proactively identify and mitigate risks (before they become roadblocks).\nOversee gaps between teams, processes and systems, helping teams reduce exposure to classic failure modes (e.g., requirements not sufficiently understood or documented, ineffective cross-team collaboration, long-term impact(s) from third-party solutions, security not considered, insufficient stakeholder review, etc.).\nWork autonomously in an ambiguous environment, seeking to understand business problems, automation limitations, scaling factors, boundary conditions and reasons behind leadership decisions.\nDevelop, implement, and govern KPI reporting for a portfolio of programs, providing visibility to the milestones, and performance across all projects.\nWork with program managers, business leaders and executive teams to communicate and impact critical business initiatives.\nEngage other Amazon business units globally to share best practices and improve end to end outcomes for Amazon customers.", "qualifications": {"required": "3+ years of working cross functionally with tech teams experience\nBachelor's degree\n3+ years of supply chain experience\n3+ years of defining and implementing process improvement initiatives using data and metrics experience\nKnowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\nExperience defining program requirements and using data and metrics to determine improvements", "preferred": "2+ years of supply chain, forecasting, manufacturing, sourcing/procurement, or vendor management experience\nKnowledge of SQL at an intermediate level, including: compile queries, subqueries, aggregation/grouping, data modification, etc.\nExperience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\nExperience in driving end to end delivery, and communicating results to senior leadership"}, "skills": ["Supply Chain", "Process Improvement", "Excel", "SQL", "Stakeholder Management"], "postedDate": "1 week ago", "benefits": "Amazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\n\n<ul><li> Medical, Dental, and Vision Coverage</li><li> Maternity and Parental Leave Options</li><li> Paid Time Off (PTO)</li><li> 401(k) Plan<br/><br/></li></ul>Learn more about our benefits here: https://www.amazon.jobs/en/internal/benefits/us-benefits-and-stock", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3963756654"}