{"jobTitle": "Senior Buyer - Flight Hardware", "company": {"name": "ABL Space Systems", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Defense and Space Manufacturing", "description": "ABL Space Systems is driven by the vision that in ten years, missions to space will launch every day from around the world. We’ve set out to assure global access to space through the development of a low-cost launch vehicle and a modular ground system, RS1 and GS0.<br/><br/>Behind our business model is an exceptional team. Engineers, technicians and operators at ABL thrive on creating simple yet effective systems to tackle the challenge that space launch presents.<br/><br/>Launch is just the beginning. Join ABL in paving the way for the next-generation space platform.<br/><br/>As a Senior Buyer, you will be responsible for interfacing with internal customers and external vendors by performing procurement duties, ensuring timely order fulfillment and managing key strategic vendors. In addition, this role will be responsible for developing sourcing strategies and strategic partnerships with key vendors to aid in reducing overall cost and lead time to help us attain our goal of being the premier rapid deployment small-sat launch service provider. We are looking for self-starters who thrive in an ambiguous environment. This role will have a tangible impact on vehicle deliveries and meeting manifested launch dates.  There is tremendous opportunity for growth with new challenges every day as we scale to meet our increasing launch manifest.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Manage supplier relationships to ensure quality, cost, delivery, and responsiveness targets are achieved eradicating and/or escalating problems efficiently both internally and externally to minimize impact on our business</li><li>Evaluates stability and sets strategy for current and potential suppliers with regard to financial health, staffing, quality, throughput, and technical capability </li><li>Proactively seek new opportunities, ideas, techniques and materials to drive product innovation with both new and existing suppliers</li><li>Issue purchase orders accurately while ensuring timely fulfillment</li><li>Act as the supplier interface for supplier pre-qualifications, bid solicitations, bid analysis, award as recommendations and commitments, including aspects of purchase order administration</li><li>Identify part supply constraints that may impact production schedule, and create mitigation plan</li><li>Understands and executes work in accordance with the sourcing strategy, compliance to the Approved Suppliers List, and project financing considerations</li><li>Accountable for integrity of records management for assigned work and for ensuring supplier master data is accurate</li><li>Proactively investigate new market trends, supplier roadmaps, and collaborate with engineering on best path from a technology, cost, and supply standpoint</li><li>Drive design for manufacturability reviews with support from supplier quality and engineering. Champion value-add and value engineering projects to improve part quality and reduce cost</li><li>Develop and foster cross-functional relationships to ensure all business goals are aligned<br/><br/><br/></li></ul><strong>BASIC QUALIFICATIONS:<br/><br/></strong><ul><li>Bachelor's degree in business, supply chain, engineering or a similar technical discipline or experience working in a fast-moving production environment</li><li>5+ years of demonstrated success in a sourcing role</li><li>Experience with contract structures, contract negotiations, and contract implementation<br/><br/><br/></li></ul><strong>PREFERRED SKILLS AND EXPERIENCE:<br/><br/></strong><ul><li>Prior experience in rapid growth environment</li><li>Excellent negotiation skills</li><li>Strong analytical skills; MS Excel proficient, financial modeling</li><li>Ability to influence actions/decisions of internal stakeholders, as well as suppliers</li><li>Ability to earn trust, maintain positive and professional relationships, and strengthen our culture of inclusion</li><li>Experience with technical procurement, manufacturing, or designing production components</li><li>Strong ability to read drawings and blueprints, with an understanding of manufacturing complexity</li><li>Material Requirement Planning (MRP) and/or Enterprise Resource Planning (ERP) systems</li><li>APICS, CPSM, CSCP certification or equivalent</li><li>Lean Six Sigma certification</li><li>Proficient in SQL <br/><br/><br/></li></ul><strong>ADDITIONAL REQUIREMENTS:<br/><br/></strong><ul><li>Able to travel up to 25% domestically and internationally </li><li>This position is based in El Segundo and requires being onsite - remote work not considered<br/><br/><br/></li></ul>$85,000 - $150,000 a year<br/><br/>This is the lowest to highest compensation range we reasonably and in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the range may be modified in the future. An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, geographic location, performance, and business or organizational needs.<br/><br/>In addition to base pay and equity, we offer:<br/><br/><ul><li> Low-cost medical, dental, and vision insurance plans</li><li> Company paid life insurance and LTD coverage</li><li> 4% 401k match</li><li> Student loan repayment assistance program</li><li> Paid parental leave</li><li> Family planning assistance program</li><li> Company paid financial wellness program</li><li> Paid time off for non-exempt employees and flexible vacation policy for exempt employees (have separate templates for different types of job post)<br/><br/><br/></li></ul>Relocation bonus offered to qualified candidates<br/><br/><strong>ITAR Requirement<br/><br/></strong>This position requires access to information protected under US export control laws, including the International Traffic in Arms Regulations and/or the Export Administration Regulations. As such, US person status (including US citizens, U.S. permanent residents, individuals granted U.S. asylum status, or individuals admitted in U.S. refugee status) is a required qualification for this position.<br/><br/><strong>Equal Opportunity Employer<br/><br/></strong>We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity and/or expression, national origin, protected veteran status, disability, genetics, or citizenship status (when otherwise legally authorized to work and access export-controlled data) and will not be discriminated against on the basis of such characteristics or any other status protected by the laws or regulations in the locations where we operate. We encourage applicants of all ages.", "responsibilities": "Manage supplier relationships to ensure quality, cost, delivery, and responsiveness targets are achieved eradicating and/or escalating problems efficiently both internally and externally to minimize impact on our business\nEvaluates stability and sets strategy for current and potential suppliers with regard to financial health, staffing, quality, throughput, and technical capability \nProactively seek new opportunities, ideas, techniques and materials to drive product innovation with both new and existing suppliers\nIssue purchase orders accurately while ensuring timely fulfillment\nAct as the supplier interface for supplier pre-qualifications, bid solicitations, bid analysis, award as recommendations and commitments, including aspects of purchase order administration\nIdentify part supply constraints that may impact production schedule, and create mitigation plan\nUnderstands and executes work in accordance with the sourcing strategy, compliance to the Approved Suppliers List, and project financing considerations\nAccountable for integrity of records management for assigned work and for ensuring supplier master data is accurate\nProactively investigate new market trends, supplier roadmaps, and collaborate with engineering on best path from a technology, cost, and supply standpoint\nDrive design for manufacturability reviews with support from supplier quality and engineering. Champion value-add and value engineering projects to improve part quality and reduce cost\nDevelop and foster cross-functional relationships to ensure all business goals are aligned", "qualifications": {"required": "Bachelor's degree in business, supply chain, engineering or a similar technical discipline or experience working in a fast-moving production environment\n5+ years of demonstrated success in a sourcing role\nExperience with contract structures, contract negotiations, and contract implementation", "preferred": "Prior experience in rapid growth environment\nExcellent negotiation skills\nStrong analytical skills; MS Excel proficient, financial modeling\nAbility to influence actions/decisions of internal stakeholders, as well as suppliers\nAbility to earn trust, maintain positive and professional relationships, and strengthen our culture of inclusion\nExperience with technical procurement, manufacturing, or designing production components\nStrong ability to read drawings and blueprints, with an understanding of manufacturing complexity\nMaterial Requirement Planning (MRP) and/or Enterprise Resource Planning (ERP) systems\nAPICS, CPSM, CSCP certification or equivalent\nLean Six Sigma certification\nProficient in SQL"}, "skills": ["Sourcing", "Supplier Relationship Management", "Procurement", "Contract Negotiation", "Supply Chain Management", "MS Excel", "Financial Modeling", "Technical Procurement", "Manufacturing", "Design", "Material Requirement Planning (MRP)", "Enterprise Resource Planning (ERP)", "APICS", "CPSM", "CSCP", "Lean Six Sigma", "SQL"], "postedDate": "1 month ago", "benefits": "Low-cost medical, dental, and vision insurance plans\nCompany paid life insurance and LTD coverage\n4% 401k match\nStudent loan repayment assistance program\nPaid parental leave\nFamily planning assistance program\nCompany paid financial wellness program\nPaid time off for non-exempt employees and flexible vacation policy for exempt employees (have separate templates for different types of job post)", "remoteWork": "No", "salary": {"amount": "85,000.00 - 150,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3963449905"}