{"jobTitle": "Account Manager- 100% Remote LATAM", "company": {"name": "SellCord", "industry": "Retail", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contractor", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Retail", "description": "SellCord is a leading agency specializing in the launching and scaling of brands of all sizes, exclusively on Walmart. As Walmart-approved partners, we are dedicated to helping brands thrive and succeed in the Walmart marketplace. With our in-depth expertise and unwavering focus on Walmart, we are recognized as the best in the industry.", "responsibilities": "Managing the account and be the point of contact for clients, providing regular updates such as: replenishment reports, calls recaps, etc. and resolving issues in a timely manner. Work closely with internal departments, including the copywriting and listing creation teams, to ensure successful product launches by proper task delegation. Coordinate with our advertising manager to optimize campaigns and drive sales for clients while maintaining a client success focus. Monitor and analyze sales data to identify trends and make recommendations for improvements. Provide exceptional customer service to clients and build long-lasting relationships.", "qualifications": {"required": "Not specified", "preferred": "Not specified"}, "skills": ["Strong passion for the work you do", "Comfortable with asset management tools such as Slack, ClickUp, GSuite, Excel, Loom, Monitask", "Interest and excitement in e-commerce", "Ability to multitask and prioritize effectively", "Refining communication skills, both written and verbal", "Demonstrate tact and discretion in handling client information", "Natural relationship builder", "Flexibility to adapt to changing business needs", "Reliable computer and internet connection", "Ability to follow instructions with precision"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Work virtually from anywhere, 19 days paid time off per year, high bar for excellence, training provided.", "remoteWork": "100% Remote", "url": "https://www.linkedin.com/jobs/view/3963089696"}