{"jobTitle": "Administrative Assistant III", "company": {"name": "ICONMA", "location": "Duarte, CA"}, "location": "Duarte, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Location: Duarte, CA<br/><br/>Duration: 1 months with possible to extension<br/><br/><strong>Description<br/><br/></strong><strong>Position Summary:<br/><br/></strong><ul><li>With significant independence, provides Senior Administrative Support to Pathology faculty that requires no instructions on routine work and general instructions on new assignments. </li><li>Resolves complex routine inquiries utilizing knowledge of policies and procedures. </li><li>Applies advanced skills to the position. </li><li>Compiles and analyzes basic information for inclusion in reports or presentation materials; prepares charts, graphs, or tables as necessary. </li><li>Routine work may be scanned by others upon completion. </li><li>Prioritizes projects for completion with only limited supervision, typically receiving only general instructions. </li><li>Applies applicable policies, procedures, and practices to resolve a variety of new and routine issues. Relies on experience and judgment with the flexibility to create solutions. <br/><br/></li></ul><strong>Essential Functions<br/><br/></strong>25% Types, using word processing equipment.<br/><br/>20% Compiles information and prepares reports and records.<br/><br/>20% Makes appointments and travel arrangements.<br/><br/>15% Screens visitors and telephone calls.<br/><br/>2% Reads and routes incoming mail.<br/><br/>2% Files correspondence and records.<br/><br/>5% May attend staff meetings and record minutes.<br/><br/>2% May compose and route routine correspondence.<br/><br/>5% Prepares confidential and special reports, including periodic statistical reports.<br/><br/>2% May train and direct clerical staff.<br/><br/>2% Makes decisions on minor administrative matters and completes clerical details as needed<br/><br/><strong>Communication<br/><br/></strong>Expresses ideas clearly and constructively (written and spoken, upward and downward, one-on-one and with groups).<br/><br/><strong>Customer Service<br/><br/></strong>Seeks to understand customer needs and exceed customer expectations (internal and external).<br/><br/><strong>Initiative<br/><br/></strong>Looks for opportunities to improve performance; manages time, work, and relationships effectively and efficiently.<br/><br/><strong>Professionalism<br/><br/></strong>Treats others with respect; abides by the institutional values; displays a positive and cooperative attitude; adheres to the workplace Code of Conduct and compliance policies.<br/><br/><strong>Stewardship<br/><br/></strong>Identifies efficiencies to reduce redundancy and eliminates tasks resulting in savings of cost, resources, and or/time.<br/><br/><strong>Teamwork<br/><br/></strong>Works proactively and collaboratively with others to streamline work and achieve mutual goals.<br/><br/><strong>Position Qualifications<br/><br/></strong>Minimum Education: High school diploma or GED, some vocational/specialized training.<br/><br/><strong>Minimum Experience<br/><br/></strong>Experience may substitute for minimum education requirements<br/><br/>3-5 years responsible secretarial or clerical experience in a professional environment.<br/><br/><strong>Software<br/><br/></strong>Microsoft Windows, required<br/><br/>Microsoft Word, required<br/><br/>Microsoft Excel, preferred<br/><br/>Microsoft PowerPoint, required<br/><br/><em>As an equal opportunity employer, ICONMA provides an employment environment that supports and encourages the abilities of all persons without regard to race, color, religion, gender, sexual orientation, gender identity or express, ethnicity, national origin, age, disability status, political affiliation, genetics, marital status, protected veteran status, or any other characteristic protected by federal, state, or local laws.</em>", "responsibilities": "With significant independence, provides Senior Administrative Support to Pathology faculty that requires no instructions on routine work and general instructions on new assignments. Resolves complex routine inquiries utilizing knowledge of policies and procedures. Applies advanced skills to the position. Compiles and analyzes basic information for inclusion in reports or presentation materials; prepares charts, graphs, or tables as necessary. Routine work may be scanned by others upon completion. Prioritizes projects for completion with only limited supervision, typically receiving only general instructions. Applies applicable policies, procedures, and practices to resolve a variety of new and routine issues. Relies on experience and judgment with the flexibility to create solutions.", "qualifications": {"required": "High school diploma or GED, some vocational/specialized training. 3-5 years responsible secretarial or clerical experience in a professional environment.", "preferred": "Microsoft Excel"}, "skills": ["Microsoft Windows", "Microsoft Word", "Microsoft PowerPoint"], "postedDate": "1 month ago", "salary": {"amount": "14.75/hr - $25.04/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3963390523"}