{"jobTitle": "OFR Customer Service Operations Imports", "company": {"name": "DHL Global Forwarding", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Title</strong>: Ocean Import Agent<br/><br/><strong>Location</strong>: Torrance, CA - LAX<br/><br/><strong>DHL Global Forwarding (DGF)</strong> is the world leader in air freight services and one of the leading providers of ocean freight services. Around 30,000 employees work to ensure we transport our customers of shipments by air or sea. DGF's logistics solutions span the entire supply chain, from the factory to the shop floor. This also includes special transport-related services. Visit our career site on the web at https://www.logistics.dhl/us-en/home/careers.html<br/><br/>We have an exciting opportunity for an <strong><em>OCEAN IMPORT AGENT </em></strong>with excellent communication and customer service skills. Accuracy and timely movement of freight and information is a key component for this position. This position will be based at our <strong><em>Torrance, CA </em></strong>location.<br/><br/><strong>Key Responsibilities</strong><strong>:<br/><br/><br/></strong><ul><li>Coordinate and ensure timely bookings with ocean lines on customer behalf</li><li>Prepares import documentation, including entry into computer operations program, in accordance to country requirements</li><li>Verification of Certificate of Origin, Cargo Manifest, NAFTA Certificate, OWB, ITAR, Hazardous Material, Perishable, and any other documents required by the customer</li><li>Compliant filing of import system with US customs </li><li>Responsible for timely completion of import documents and coordinate with both customer, warehouse, ocean carriers, gateway operations, and dispatch for timely movement of cargo</li><li>Ongoing communication with customer and overseas offices in regards to shipment movement</li><li>Follow-up with ocean carrier to keep track of departure information and updates</li><li>Responsible for file level profitability</li><li>Audit charges for accuracy prior to sending to accounting for payment</li><li>Confirm payment responsibility (depending on terms) and audit credit status if needed</li><li>Ensure customer profiles are accurate and updated</li><li>Other duties as assigned<br/><br/><br/></li></ul><strong>Skills / Requirements:<br/><br/><br/></strong><ul><li>Exceptional customer service skills</li><li>Detail oriented and strong follow-up skills</li><li>Proficient with Microsoft office (Word, Excel, Outlook) preferred</li><li>Minimum of 2 years of Logistics / Freight forwarding industry experience preferred</li><li>Logis Air / Cargo Wise systems knowledge is a plus</li><li>Hazmat certification is a plus<br/><br/><br/></li></ul><strong>Benefits</strong><strong>: (All non-union employees)<br/><br/><br/></strong><ul><li>Total Compensation Package: We offer a competitive base salary.</li><li>401(k) with a match: Pre-tax 401(k) contribution plan comes with a $1 for $1 match up to 4% quarterly, plus a 2% base contribution annually to help you save for retirement.</li><li>Stock Purchase Plan: Eligible employees can purchase Deutsche Post AG shares at a 15% discount and benefit from the Group’s success as shareholders.</li><li>Medical: We offer comprehensive healthcare plans covering preventative care, inpatient and outpatient services, and prescription drugs.</li><li>Vision: Optional coverage for eye exams, frames, and contact lenses.</li><li>Dental: Optional coverage for preventative, major, and basic dental services.</li><li>Holiday / Paid Time Off: The company provides paid time off for 7 major holidays each calendar year (New Year's Day, MLK Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day, and Christmas Day), plus 8 floating holidays, and accrued vacation days.<br/><br/><br/></li></ul><strong>Why join DHL Global Forwarding?<br/><br/></strong>We are part of Deutsche Post DHL, the world’s leading logistics provider with operations in over 220 countries. Visit our career site on the web at https://www.logistics.dhl/us-en/home/careers.html<br/><br/><strong>DHL GLOBAL FORWARDING HAS BEEN RECOGNIZED EXTERNALLY AS TOP EMPLOYER AND<br/><br/></strong><strong> A GREAT PLACE TO WORK !<br/><br/></strong><strong>WHY DOES THIS MATTER TO YOU?<br/><br/><br/></strong><ul><li>It means that when you partner with DHL Global Forwarding you’re working with an ethical and socially responsible company.</li><li>We believe that when people love to come to work, they give more, try harder for their Customers, and are proud of the service they give.</li><li>And that’s why external organizations have granted us different accolades for our people practices<br/><br/><br/></li></ul><strong>Our Vision</strong><strong>: </strong>The Logistics Company for the World<br/><br/><strong>Our Mission: </strong>Excellence. Simply Delivered.<br/><br/><strong>Our Purpose: </strong>We connect people, improving their lives.<br/><br/><strong>Our Values: </strong>Respect &amp; Results<br/><br/><strong>Our Goals: </strong>Employer, Provider, and Investment of Choice, Living Responsibility<br/><br/><strong> <br/><br/></strong><strong><strong>At DHL Global Forwarding we cultivate a culture that values both respect and results, placing a strong emphasis on fostering a diverse and inclusive workforce.<br/><br/></strong></strong><strong>DHL Global Forwarding is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.<br/><br/></strong><strong>Work Authorization:<br/><br/></strong><strong>DHL Global Forwarding will only employ those who are legally authorized to work in the United States. This is not a position for which visa sponsorship will be provided. Individuals who need sponsorship for work authorization, now or in the future, are not eligible for hire for this role.<br/><br/></strong><strong>About DHL Global Forwarding (DGF)</strong><strong>:<br/><br/></strong><strong>DHL Global Forwarding (DGF)</strong> is the world leader in air freight services and one of the leading providers of ocean freight services. Around 30,000 employees work to ensure the transport of all kinds of shipments by air or sea. DGF's logistics solutions span the entire supply chain, from the factory to the shop floor. They also include special transport-related services.<br/><br/>Our business model is very asset-light, as it is based on the brokerage of transport services between customers and freight carriers. We consolidate shipments to achieve higher volumes, purchase cargo space at better conditions and optimize network utilization. Our global presence means we can offer a variety of routing options and meet our customers' increasing demand for multimodal shipments.<br/><br/>Equal Opportunity Employer, Disability/Vets. Click here for EEO Statements and Reasonable Accommodations.<br/><br/>", "responsibilities": "<ul><li>Coordinate and ensure timely bookings with ocean lines on customer behalf</li><li>Prepares import documentation, including entry into computer operations program, in accordance to country requirements</li><li>Verification of Certificate of Origin, Cargo Manifest, NAFTA Certificate, OWB, ITAR, Hazardous Material, Perishable, and any other documents required by the customer</li><li>Compliant filing of import system with US customs </li><li>Responsible for timely completion of import documents and coordinate with both customer, warehouse, ocean carriers, gateway operations, and dispatch for timely movement of cargo</li><li>Ongoing communication with customer and overseas offices in regards to shipment movement</li><li>Follow-up with ocean carrier to keep track of departure information and updates</li><li>Responsible for file level profitability</li><li>Audit charges for accuracy prior to sending to accounting for payment</li><li>Confirm payment responsibility (depending on terms) and audit credit status if needed</li><li>Ensure customer profiles are accurate and updated</li><li>Other duties as assigned<br/><br/><br/></li></ul>", "qualifications": {"required": "Exceptional customer service skills, Detail oriented and strong follow-up skills, Proficient with Microsoft office (Word, Excel, Outlook) preferred, Minimum of 2 years of Logistics / Freight forwarding industry experience preferred, Logis Air / Cargo Wise systems knowledge is a plus, Hazmat certification is a plus", "preferred": ""}, "skills": ["Customer Service", "Microsoft Office", "Logistics", "Freight Forwarding", "Logis Air", "Cargo Wise", "Hazmat"], "postedDate": "1 week ago", "benefits": "<ul><li>Total Compensation Package: We offer a competitive base salary.</li><li>401(k) with a match: Pre-tax 401(k) contribution plan comes with a $1 for $1 match up to 4% quarterly, plus a 2% base contribution annually to help you save for retirement.</li><li>Stock Purchase Plan: Eligible employees can purchase Deutsche Post AG shares at a 15% discount and benefit from the Group’s success as shareholders.</li><li>Medical: We offer comprehensive healthcare plans covering preventative care, inpatient and outpatient services, and prescription drugs.</li><li>Vision: Optional coverage for eye exams, frames, and contact lenses.</li><li>Dental: Optional coverage for preventative, major, and basic dental services.</li><li>Holiday / Paid Time Off: The company provides paid time off for 7 major holidays each calendar year (New Year's Day, MLK Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day, and Christmas Day), plus 8 floating holidays, and accrued vacation days.<br/><br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3963527716"}