{"jobTitle": "Senior Manager, Business Development", "company": {"name": "Circle", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$175,000.00 - $225,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Financial Services", "description": "Circle is a financial technology company at the epicenter of the emerging internet of money, where value can finally travel like other digital data — globally, nearly instantly and less expensively than legacy settlement systems. This ground-breaking new internet layer opens up previously unimaginable possibilities for payments, commerce and markets that can help raise global economic prosperity and enhance inclusion. Our infrastructure – including USDC, a blockchain-based dollar – helps businesses, institutions and developers harness these breakthroughs and capitalize on this major turning point in the evolution of money and technology.<br/><br/><strong>What you’ll be part of:<br/><br/></strong>Circle is committed to visibility and stability in everything we do. As we grow as an organization, we're expanding into some of the world's strongest jurisdictions. Speed and efficiency are motivators for our success and our employees live by our company values: Multistakeholder, Mindfulness, Driven by Excellence and High Integrity. Circlers are consistently evolving in a remote world where strength in numbers fuels team success. We have built a flexible and diverse work environment where new ideas are encouraged and everyone is a stakeholder.<br/><br/><strong>What you’ll be responsible for: <br/><br/></strong><ul><li>Delivering on a set of ambitious company-level business objectives</li><li>Establishing strategic partnerships with organizations across the Web3 space to drive the adoption and growth of USDC</li><li>Executing and providing oversight on the execution of commercial deals with organizations across a variety of Web3 segments for Circle’s suite of products and services</li><li>Creating, operationalizing and owning a robust growth program to maximize ROI across Web3 ecosystem initiatives<br/><br/></li></ul><strong>What you'll work on: <br/><br/></strong><ul><li>Originating and managing a large portfolio of opportunities, driving pipeline momentum, developing &amp; executing comprehensive GTM plans for key initiatives and identifying opportunities to validate beta products</li><li>Cultivating a team culture that is extremely high integrity, collaborative, customer-focused, metrics-driven, fast-paced, and optimistic</li><li>Establishing and maintaining strong executive relationships with key decision makers in a wide range of Web3 organizations, including blockchains and DeFi protocols across the Americas.</li><li>Identifying and coordinating the development of new programs, resources, and capabilities required to close new business opportunities and achieve company-level OKRs in the region.</li><li>Regular reporting and superior communication on the most vital KPIs, metrics, and revenue forecasts for the region. <br/><br/></li></ul><strong>You will aspire to our four core values:<br/><br/></strong><ul><li>Multistakeholder - you have dedication and commitment to our customers, shareholders, employees and families and local communities.</li><li>Mindful - you seek to be respectful, an active listener and to pay attention to detail. </li><li>Driven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals. </li><li>High Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty and intolerance.<br/><br/></li></ul><strong>What you’ll bring to Circle: <br/><br/></strong><ul><li>7+ years of Business Development and Sales experience</li><li>Professional and technical knowledge of blockchain and cryptocurrency technology.</li><li>Demonstrated ability to negotiate and win high-impact strategic deals with a C-level audience.</li><li>Exceptional leadership experience with proven ability to onboard, and consistently train employees.</li><li>Excellent pipeline management and ability to prioritize across an expansive set of initiatives to maximize business growth</li><li>Impeccable written and verbal communication skills in English.</li><li>Finally, you enjoy building at the earliest stages. You care deeply about contributing and improving company processes. And you enjoy moving at a fast pace, building a long-lasting foundation, and helping partners and customers thrive.<br/><br/></li></ul><strong>Additional Information:<br/><br/></strong><ul><li>This position is eligible for day-one PERM sponsorship for qualified candidates.<br/><br/></li></ul><em>Circle is on a mission to create an inclusive financial future, with transparency at our core. We consider a wide variety of elements when crafting our compensation ranges and total compensation packages.<br/><br/></em><em>Starting pay is determined by various factors, including but not limited to: relevant experience, skill set, qualifications, and other business and organizational needs. Please note that compensation ranges may differ for candidates in other locations.<br/><br/></em><em>Base Pay Range: $175,000 - $225,000<br/><br/></em><em>Annual Bonus Target: 17.5%<br/><br/></em><em>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.<br/><br/></em>We are an <strong>equal opportunity employer</strong> and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additionally, Circle participates in the <strong>E-Verify Program</strong> in certain locations, as required by law.<br/><br/>", "responsibilities": "Delivering on a set of ambitious company-level business objectives\nEstablishing strategic partnerships with organizations across the Web3 space to drive the adoption and growth of USDC\nExecuting and providing oversight on the execution of commercial deals with organizations across a variety of Web3 segments for Circle’s suite of products and services\nCreating, operationalizing and owning a robust growth program to maximize ROI across Web3 ecosystem initiatives", "qualifications": {"required": "7+ years of Business Development and Sales experience\nProfessional and technical knowledge of blockchain and cryptocurrency technology.\nDemonstrated ability to negotiate and win high-impact strategic deals with a C-level audience.\nExceptional leadership experience with proven ability to onboard, and consistently train employees.\nExcellent pipeline management and ability to prioritize across an expansive set of initiatives to maximize business growth\nImpeccable written and verbal communication skills in English.\nFinally, you enjoy building at the earliest stages. You care deeply about contributing and improving company processes. And you enjoy moving at a fast pace, building a long-lasting foundation, and helping partners and customers thrive.", "preferred": null}, "skills": ["Business Development", "Sales", "Blockchain", "Cryptocurrency", "Negotiation", "Leadership", "Pipeline Management", "Communication"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3963012263"}