{"jobTitle": "Falcon 2000 Maintenance Supervisor - Ontario, CA", "company": {"name": "Solairus Aviation", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Airlines and Aviation", "description": "<strong>Overview<br/><br/></strong>The Solairus Aviation Maintenance Supervisor will conduct or lead all aspects of maintenance performed on assigned aircraft and ensuring compliance to company policies and procedures regarding airworthiness standards. Specific duties include, but are not limited to, routine maintenance tracking, long term planning, scheduling and completion of maintenance events, and financial responsibility for costs incurred associated with maintenance operations. This position reports to the Director of Maintenance, and/or the Client Aviation Manager (CAM).<br/><br/><strong>Essential Responsibilities/Duties<br/><br/></strong><ul><li>Maintain a valid Airframe and Powerplant Certificate.</li><li>Lead all maintenance activities of assigned aircraft, to include implementing the maintenance standards, methods, and procedures established by Solairus Aviation to ensure compliance with Federal Aviation Regulations, manufacturer’s recommendations and company policies.</li><li>Coordinate maintenance training requirements with the DOM and/or CAM.</li><li>Develop a budget outlining and projecting financial expenses related to aircraft maintenance, parts &amp; labor, tooling, equipment and base facilities.</li><li>Supervise and approve expenditures related to assigned aircraft.</li><li>Participates in the Safety Management Systems; and Assumes any duties delegated by the DOM, Manager of Maintenance Operations, and CAM.</li><li>Supervises aircraft maintenance personnel (both company employees and non-company personnel), including aircraft interior and exterior cleaning, and ensuring the quality and completeness of maintenance performed under the authority of the Director of Maintenance.</li><li>Coordinates with all non-company personnel or Approved Maintenance Organizations (AMOs) performing maintenance on company aircraft with Manager of Maintenance Operation, DOM, and CAM, and conduct vendor evaluations for outside maintenance.</li><li>Ensures that complete records of all inspections, repairs and component changes, airframe flight time, engine times, AD notes, Service letters from the airframe, engine and component manufacturers, and FAA maintenance instructions are accurately maintained.</li><li>Ensures compliance with Airworthiness Directives (ADs) and Service Bulletins affecting company aircraft.</li><li>Removes known unsafe aircraft and those that do not comply with the CFRs from service, and ensures the airworthiness of aircraft returned to service.</li><li>Ensures operational readiness of the aircraft with as little schedule impact as practical.</li><li>Serves as liaison between the company and the FAA regarding all maintenance policies.</li><li>Maintains certification and technical recency requirements per 14 CFR 65.83.</li><li>Performs internal audits of tool calibration and material control and ensure that adequate tools, parts, materials, support equipment, and facilities are available to perform scheduled and unscheduled maintenance<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must hold a valid A&amp;P Certificate.</li><li>Minimum 10 years’ experience in Corporate Aircraft Maintenance Operations.</li><li>Demonstrates knowledge of the CFRs and aircraft maintenance standards.</li><li>Proficient with planning, implementation, and direction of the maintenance programs and control system for the aircraft operated.</li><li>Be a highly motivated individual committed to Safety, Regulatory Compliance, and Operational Excellence!</li><li>Remains fit for duty and abstain from drug and alcohol abuse.<br/><br/></li></ul><strong>Specific Qualifications/Certifications<br/><br/></strong><ul><li>Recent experience in Falcon 2000(6 months within the past 24 mos.).</li><li>Must be located or willing to relocate to within 1 hour of KONT.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>Solairus is a private aviation services company assisting aircraft owners with the safe, reliable, and efficient management and operation of their aircraft. Headquartered in the beautiful California Wine Country, Solairus Aviation is a destination employer offering nationwide operating bases, a stimulating work environment, and an array of modern benefits to employees. From a generous 401K matching structure to employee wellness programs and top-notch health benefits, Solairus firmly believes our team members are our greatest asset and we are committed to providing an exceptional employment experience.<br/><br/>Solairus collects salary range information based on market conditions from multiple industry sources. Solairus crewmembers are paid $50,000 to $500,000 based on geographic area, experience, equipment type/aircraft, job duties, training, and the assigned account.<br/><br/>Solairus Aviation embraces diversity and equal opportunity. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be!", "responsibilities": "The Solairus Aviation Maintenance Supervisor will conduct or lead all aspects of maintenance performed on assigned aircraft and ensuring compliance to company policies and procedures regarding airworthiness standards. Specific duties include, but are not limited to, routine maintenance tracking, long term planning, scheduling and completion of maintenance events, and financial responsibility for costs incurred associated with maintenance operations. This position reports to the Director of Maintenance, and/or the Client Aviation Manager (CAM).", "qualifications": {"required": "Must hold a valid A&P Certificate.\nMinimum 10 years’ experience in Corporate Aircraft Maintenance Operations.\nDemonstrates knowledge of the CFRs and aircraft maintenance standards.\nProficient with planning, implementation, and direction of the maintenance programs and control system for the aircraft operated.\nBe a highly motivated individual committed to Safety, Regulatory Compliance, and Operational Excellence!\nRemains fit for duty and abstain from drug and alcohol abuse.", "preferred": "Recent experience in Falcon 2000(6 months within the past 24 mos.).\nMust be located or willing to relocate to within 1 hour of KONT."}, "skills": ["Airframe and Powerplant Certificate", "Federal Aviation Regulations", "Safety Management Systems", "Airworthiness Directives", "CFRs", "Corporate Aircraft Maintenance Operations", "Falcon 2000"], "postedDate": "1 month ago", "benefits": "Solairus is a private aviation services company assisting aircraft owners with the safe, reliable, and efficient management and operation of their aircraft. Headquartered in the beautiful California Wine Country, Solairus Aviation is a destination employer offering nationwide operating bases, a stimulating work environment, and an array of modern benefits to employees. From a generous 401K matching structure to employee wellness programs and top-notch health benefits, Solairus firmly believes our team members are our greatest asset and we are committed to providing an exceptional employment experience.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3964906033"}