{"jobTitle": "Healthy Living Program Facilitator", "company": {"name": "Glen Park Senior Living", "location": "Glendale, CA", "industry": "Nursing Homes and Residential Care Facilities"}, "location": "Glendale, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Nursing Homes and Residential Care Facilities", "description": "<strong>Glen Park Senior Living</strong> is seeking passionate individuals to join our Healthy Living Program as part-time facilitators. This program is dedicated to enriching the lives of our senior residents through a variety of engaging activities.<br/><br/><strong>Position:</strong> Healthy Living Program Facilitator<br/><br/><strong>Location:</strong> Glen Park Senior Living<br/><br/><strong>Schedule:</strong> Part-time, As-needed basis (Independent Contractor)<br/><br/><strong>Session Length:</strong> Approximately 4 hours<br/><br/><strong>Compensation:</strong> $90 - $150 per session<br/><br/><strong>About the Role:</strong> As a facilitator, you will be responsible for planning and conducting sessions that promote physical, mental, and emotional well-being among our residents. We are looking for creative and energetic people who can offer a range of activities such as:<br/><br/>Entertainment: Music performances, dance workshops, storytelling sessions<br/><br/><strong>Culinary Arts:</strong> Cooking lessons, nutritional workshops, food preparation demonstrations<br/><br/><strong>Creative Arts:</strong> Painting classes, crafting workshops, pottery making<br/><br/><strong>Physical Wellness:</strong> Chair yoga, tai-chi, light stretching exercises<br/><br/><strong>Educational:</strong> Gardening tutorials, computer skills workshops, history lectures<br/><br/><strong>Social Engagement:</strong> Board game nights, movie screenings, discussion groups<br/><br/><strong>Responsibilities<br/><br/></strong>Design and lead sessions that cater to the interests and abilities of our senior residents.<br/><br/>Collaborate with the program coordinator to ensure a diverse and balanced activity schedule.<br/><br/>Provide a safe and supportive environment for all participants.<br/><br/>Adapt activities to meet the varying needs of residents.<br/><br/><strong>Requirements<br/><br/></strong>Experience in conducting group activities, workshops, or classes.<br/><br/>Excellent communication and interpersonal skills.<br/><br/>Ability to work independently and as part of a team.<br/><br/>A passion for working with the elderly and a commitment to their well-being.<br/><br/><strong>How to Apply:</strong> If you are interested in making a positive impact on the lives of our senior residents, please send your resume and a brief cover letter detailing your relevant experience and the type of activities you would like to offer to Jennifer Sayman at:<br/><br/>Join us at Glen Park Senior Living and help us create a vibrant, healthy, and joyful community!<br/><br/>Glen Park Senior Living is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3964866132"}