{"jobTitle": "Director of Customer Experience", "company": {"name": "Thrive Causemetics Inc.", "industry": "Personal Care Product Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$130,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Personal Care Product Manufacturing", "description": "Location: Based On-site 4 days/week in LA HQ\n\nWho We Are:\nThrive Causemetics is Bigger Than Beauty™: We are an independent, female-owned beauty brand that creates high-performance vegan cosmetics and supports a community of giving. All of Thrive Causemetics' products are free of parabens and sulfates, in addition to being 100 percent cruelty-free. Through its Bigger Than Beauty™ program, every product purchased results in a donation to help communities thrive.\n\nThrive Causemetics is dedicated to fostering a collaborative and cross-functional workplace where everyone’s voice matters. We are committed to being pioneers in creating a culture of wellness. Together, we prioritize a strong work ethic while maintaining a positive, exciting environment where people are passionate about what they do.\n\nWho We Are Looking For:\nWe are searching for a dynamic Director of Customer Experience. This pivotal role involves shaping and executing our customer experience strategy, integrating it with our company’s evolving goals, and ensuring exceptional customer interactions across all touchpoints. You'll lead a dedicated team, collaborate with various departments, and manage key vendor relationships. This is an exciting opportunity to lead and shape the customer experience strategy in a rapidly evolving company with a direct influence on customer satisfaction and brand loyalty.", "responsibilities": "Team Leadership: Establish the appropriate organization structure utilizing an in-house team, outsourcing, and the latest technology such as AI. Lead a team of direct reports while overseeing outsourced personnel.\nCross-Functional Collaboration: Partner with Ecommerce, Social Media/Influencer Marketing, Brand Marketing, Leadership, and Operations teams to act as the main point of contact and escalation for the customer experience team.\nPerformance Sharing: Be the voice of the customer and communicate key conversations, metrics, and findings with all teams at TC.\nVendor Management: Oversee relationships with third-party call centers and supporting software to ensuring adherence to SLAs.\nStrategy Alignment: Align customer experience strategies with overall company goals and define future strategies to best support customers as the company evolves.\nReporting: Provide insights on customer experience performance, external metrics, and overall VoC.", "qualifications": {"required": "10+ years of experience in the customer experience function at a high-volume e-commerce company, 5+ years of direct experience as a team leader, Highly interested in the beauty industry, Technical knowledge of tools such as Zendesk, Verint, Siena, Shopify Plus or similar tools, Deeply curious about AI tools and their customer experience business applications, Strong people leadership and empathy, Effective time management and accountability, Collaborative mindset to work with various departments, Ability to manage a remote team while maintaining in-office structure, Strong problem-solving skills and interpersonal communication, Capability to maintain and improve team morale, Effective communication and compassion in customer interactions, Ability to galvanize and drive the team forward.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Thrive Causemetics provides a competitive benefits package, including but not limited to: comprehensive medical, dental and vision plans, a 401(k) plan with employer matching, various paid time off programs, employee discount/perks, life insurance, disability insurance, and employee assistance programs.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3964691517"}