{"jobTitle": "Retail Coordinator", "company": {"name": "GUESS?, Inc.", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$66,560.00 - $68,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>Job Description<br/><br/></strong>POSITION TITLE: Retail Coordinator<br/><br/>POSITION PURPOSE:<br/><br/>Act as a liaison between Guess, Inc. and the account by communicating opportunities for greater profitability and to increase orders while upholding the Guess image as a leader in the fashion industry.<br/><br/>ESSENTIAL FUNCTIONS:<br/><br/>Meet with Area Manager on a weekly basis via conference call to discuss specific issues pertaining to the account. Communicate with business partners on a weekly basis through reports, phone calls and in-person to review the business analysis and store issues. Notify business partners including Buyers, Regional Marketing Managers(RMMs) and Planners regarding outstanding issues that need immediate attention.<br/><br/>Utilize merchandising and visual directives to create uniformity in all Guess? departments. Ensure that all stores have the same basic flow of Guess merchandise. Ensure that all departments have standardized style cards, images and vendor identification. Responsible for submitting reports and pictures of Guess products and enforcing markdown presentation standards by pulling merchandise together and displaying appropriate markdown or price point signage.<br/><br/>Ensure sales associates are educated on all products and trends. Review all GUESS? product information and business with Sales Associates and Specialists during each visit. Educate staff on Guess? merchandise placement with each location. Generate motivation about GUESS? product in stores.<br/><br/>Update account basics and make suggestions as needed. Ensure that fashion on order is in line with brand trends. Obtain visual islands and windows to promote Guess? throughout the entire store. Implement all Point of Sale materials and any branding collateral.<br/><br/>EDUCATION: Associate Degree<br/><br/>YEARS OF EXPERIENCE: 2-4 Years<br/><br/><strong>Location - City, Region or Area<br/><br/></strong>Corporate - Los Angeles, CA<br/><br/><strong>Location<br/><br/></strong>LA – World Headquarters<br/><br/><strong>Fair Chance Initiative for Hiring Ordinance<br/><br/></strong>Click here for more information<br/><br/><strong>Salary Minimum<br/><br/></strong>$66,560.00<br/><br/><strong>Salary Maximum<br/><br/></strong>$68,000.00<br/><br/><ul><li> Base salary will be determined on various factors, including but not limited to, market data, internal equity, relevant background, and experience for the specified role. GUESS? Corporate employees are eligible for benefits such as medical, dental, vision, life, 401k, tuition reimbursement, PTO, on-site gym, employee discounts and more!</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3964872708"}