{"jobTitle": "Account Manager II - DSO", "company": {"name": "Glidewell Dental", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "30.31-$36p/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Medical Equipment Manufacturing", "description": "<strong>Description<br/><br/></strong><em>Position at Glidewell Dental<br/><br/></em><strong>Essential Functions<br/><br/></strong><ul><li>Identifies and facilitates execution of strategic initiatives focused on developing and expanding business with assigned accounts.</li><li>Works with C-Suite in regards to top-down sales.</li><li>Organize and sponsor seminars and continuing education programs by partnering with DSO based on mutual strategic initiatives.</li><li>Provides studies and product information to customer base.</li><li>Provides sales and product training and/or mentors to incoming staff and team members as required.</li><li>Identifies, prioritizes, and targets prospective new business opportunities with Dental Service Organizations (DSOs) and large group practices.</li><li>Develops messaging and marketing strategy for DSO accounts</li><li>Develops and manages relationships with acquired and/or existing customers/executives in order to attain additional business and retain existing revenue.</li><li>Sets strategies and action plans to cross-sell and up-sell accounts to increase overall total customer spend with the Company.</li><li>Determines customer critical business issues and provides clients with a well thought-out customer solution.</li><li>Prepares sales proposals and negotiates contracts with national accounts and customers.</li><li>Collaborates effectively with other internal departments to develop and implement competitive sales strategies.</li><li>Promotes sales of products and services to new and existing accounts to achieve sales objectives and greater market penetration.</li><li>Completes complex sales, such as DSOs and Nationals, and performs subsequent pull through with strategic business plan.</li><li>Identifies and utilizes best practices to achieve sales results.</li><li>Acts as primary liaison between Customers and the Company; maintains positive client relations and ensures Customer needs are met in a manner that is sustainable and beneficial.</li><li>Educates Customers on production information including function, specifications, purpose and developments in product design.</li><li>Creates and confidently delivers sales pitch that highlights the superiority of the Company’s products and builds brand awareness.</li><li>Maintains initiative to discover and attract new Customers in a manner that is professional, efficient and honest.</li><li>Provides insight and contributes creative and strategic ideas about product improvements, marketing campaigns and relationship management.</li><li>Upsells and cross-sells compatible products to Customers and shows them how certain products can enhance the Customer’s current success.</li><li>Contacts potential Customers, negotiates, and obtains contract commitments for the Company’s products and/or services.</li><li>Develops and maintains contacts within industry to provide information and remain abreast of competitors activities.</li><li>Attends trade shows and conventions; represents the Company at trade show booth as well as collects information on competitor products and services.</li><li>Work with internal support system to improve efficiency and quality for our customers and their feedback.</li><li>Performs other related duties and projects as business needs require at the direction of management.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor’s degree or higher in Marketing, Business Administration, or related field of study.</li><li>Minimum five (5) years of experience in sales/marketing; preferably in dental or medical device field.</li><li>Minimum eight (8) years of experience in dental sales.</li><li>Experience performing return-on-investment analysis, risk analysis, and forecasting.</li><li>Experience negotiating international sales and distribution agreements and contracts.<br/><br/></li></ul><strong>Pay Range:</strong> $30.31-$36p/hr<br/><br/><strong><em>Glidewell Laboratories is the industry leader in dental technology due to our agility, speed, and cutting edge technology. We work in a fast-paced and highly sought-after employee-friendly work environment. Behind all of this success is an amazing group of people who are passionate about bringing innovation to the marketplace, while providing quality and affordability to better the lives of people all over the world. If you share in our passion for teamwork and a vision for excellence, let's talk about a rewarding career at Glidewell!<br/><br/></em></strong><strong><em>In addition are the following generous employee benefits: Medical, Dental, Vision, 401K with company match, company-paid life insurance, additional onsite dental services, vacation, holiday, and sick time, employee gym (with fitness classes and meditation room), employee medical/wellness center (with massage therapy and acupuncture), two company subsidized cafes, Internet cafes, employee lounges with big screen TVs, game tables, fun company sponsored events, a diverse work environment with over forty nationalities represented, and much more!<br/><br/></em></strong><strong><em>Glidewell Laboratories is an Equal Opportunity Employer and prohibits any kind of unlawful discrimination and harassment. We are committed to the principle of equal employment opportunity for all employees and to provide employees with a work environment free of discrimination and harassment on the basis of race, color, religion, national origin, sex, age, physical or mental disability, veteran status, sexual orientation, gender identity, genetic information, or any other status protected by the statutes, rules, and regulations in the locations where it operates. If you are an individual with a disability and need a reasonable accommodation to assist with your job search or application for employment, please contact us at [email protected]. Please indicate the specifics of the assistance needed. <br/><br/></em></strong><strong> Note to Current employees: Please apply through Employee Transfer Application to complete the transfer request form.</strong>", "responsibilities": "Identifies and facilitates execution of strategic initiatives focused on developing and expanding business with assigned accounts. Works with C-Suite in regards to top-down sales. Organize and sponsor seminars and continuing education programs by partnering with DSO based on mutual strategic initiatives. Provides studies and product information to customer base. Provides sales and product training and/or mentors to incoming staff and team members as required. Identifies, prioritizes, and targets prospective new business opportunities with Dental Service Organizations (DSOs) and large group practices. Develops messaging and marketing strategy for DSO accounts Develops and manages relationships with acquired and/or existing customers/executives in order to attain additional business and retain existing revenue. Sets strategies and action plans to cross-sell and up-sell accounts to increase overall total customer spend with the Company. Determines customer critical business issues and provides clients with a well thought-out customer solution. Prepares sales proposals and negotiates contracts with national accounts and customers. Collaborates effectively with other internal departments to develop and implement competitive sales strategies. Promotes sales of products and services to new and existing accounts to achieve sales objectives and greater market penetration. Completes complex sales, such as DSOs and Nationals, and performs subsequent pull through with strategic business plan. Identifies and utilizes best practices to achieve sales results. Acts as primary liaison between Customers and the Company; maintains positive client relations and ensures Customer needs are met in a manner that is sustainable and beneficial. Educates Customers on production information including function, specifications, purpose and developments in product design. Creates and confidently delivers sales pitch that highlights the superiority of the Company’s products and builds brand awareness. Maintains initiative to discover and attract new Customers in a manner that is professional, efficient and honest. Provides insight and contributes creative and strategic ideas about product improvements, marketing campaigns and relationship management. Upsells and cross-sells compatible products to Customers and shows them how certain products can enhance the Customer’s current success. Contacts potential Customers, negotiates, and obtains contract commitments for the Company’s products and/or services. Develops and maintains contacts within industry to provide information and remain abreast of competitors activities. Attends trade shows and conventions; represents the Company at trade show booth as well as collects information on competitor products and services. Work with internal support system to improve efficiency and quality for our customers and their feedback. Performs other related duties and projects as business needs require at the direction of management.", "qualifications": {"required": "Bachelor’s degree or higher in Marketing, Business Administration, or related field of study. Minimum five (5) years of experience in sales/marketing; preferably in dental or medical device field. Minimum eight (8) years of experience in dental sales. Experience performing return-on-investment analysis, risk analysis, and forecasting. Experience negotiating international sales and distribution agreements and contracts.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Medical, Dental, Vision, 401K with company match, company-paid life insurance, additional onsite dental services, vacation, holiday, and sick time, employee gym (with fitness classes and meditation room), employee medical/wellness center (with massage therapy and acupuncture), two company subsidized cafes, Internet cafes, employee lounges with big screen TVs, game tables, fun company sponsored events, a diverse work environment with over forty nationalities represented, and much more!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3964416266"}