{"jobTitle": "Financial Data Analyst", "company": {"name": "Augment Jobs", "industry": "Financial Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "Competitive and commensurate with experience", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Financial Services", "description": "We are seeking a detail-oriented and analytical Financial Data Analyst to join our dynamic finance team. The ideal candidate will have a strong background in financial analysis, data manipulation, and reporting. The role involves collecting financial data, analyzing trends, creating financial models, and providing actionable insights to support strategic decision-making within the organization.", "responsibilities": "Collecting, interpreting, and analyzing financial data. Developing and maintaining financial models for forecasting, budgeting, and financial performance analysis. Generating regular and ad-hoc financial reports. Identifying trends, variances, and key drivers of financial performance. Collaborating with various teams to understand data requirements and provide analytical support. Conducting thorough data validation and reconciliation to ensure accuracy and completeness. Presenting findings and recommendations to senior management and stakeholders. Contributing to the improvement of data collection processes and systems. Staying updated with industry trends and best practices in financial analysis and data management.", "qualifications": {"required": "Bachelor’s degree in Finance, Economics, Accounting, or related field (Master’s degree preferred). Proven experience as a Financial Analyst, Data Analyst, or similar role. Advanced proficiency in financial modeling and forecasting techniques. Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Proficiency in data manipulation and extraction using SQL, Excel, or other data management tools. Excellent communication and presentation skills with the ability to translate complex data into actionable insights. Ability to work independently and as part of a team, managing multiple priorities and deadlines effectively. Knowledge of financial software (e.g., SAP, Oracle Financials) and ERP systems is a plus. Professional certifications such as CFA (Chartered Financial Analyst) or CPA (Certified Public Accountant) are advantageous.", "preferred": ""}, "skills": ["Financial analysis", "Data manipulation", "Reporting", "Financial modeling", "SQL", "Excel", "Communication", "Presentation", "Teamwork", "Attention to detail"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Benefits package including health insurance, retirement plans, and other company perks. Opportunities for professional development and career advancement within the organization.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3964333890"}