{"jobTitle": "Business Development Manager", "company": {"name": "Vaco", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "Welcome to Vaco – an uncommon company with an empowered culture. At Vaco, we welcome talented innovators seeking a collaborative environment where creative freedom rings.<br/><br/>Since 2002, we have expanded to more than 40 locations, and we have no plans of slowing down anytime soon. We are seeking big thinkers to lead us into the future and explore the career of a lifetime.<br/><br/><ul><li>Ranked the #1 Best Staffing Firm to Work for in North America by Staffing Industry Analysts (Category: 500+ Employees) </li><li>An Inc. 5000 fastest growing private company in America every year since 2007! <br/><br/></li></ul><strong>Description</strong>:<br/><br/>The Senior Associate is responsible for generating sales, increasing revenue and profitability.  This position establishes and develops client relationships as well as works with one or more recruiters to fulfill open job orders. The position will collaborate with business stakeholders, business leaders and subject matter experts to plan and deliver projects effectively and timely.<br/><br/><strong> <br/><br/></strong><strong>Essential Job Functions:<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential function satisfactorily. The requirements listed below are representative of the knowledge, skills, and abilities required.<br/><br/><strong>Duties and Responsibilities</strong>:<br/><br/><ul><li>Establish and maintain target list developing client relationships.    </li><li>Conduct prospecting activities including phone calls, \"ad calls,\" skills marketing, email, social media, in-person meetings, and other methods.    </li><li>Generate new job orders weekly in line with performance objectives. </li><li>Manage new and open job orders from intake to fulfillment.    </li><li>Utilize Bullhorn to log all activity, notes, and information vital to managing and growing a book of business as well as planning daily activities.    </li><li>Collaborate with teammates to cross-sell and/or fulfill open positions across other lines of business and/or national practices as appropriate.    <br/><br/></li></ul><em>The above statements describe the general nature and level of work only. They are not an exhaustive list of all required responsibilities, duties, and skills. Other duties may be added, or this description amended at any time. </em><em>Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.<br/><br/></em><strong>Desired Competencies:</strong> <br/><br/><ul><li>Customer/Candidate Focus - Builds strong customer relationships and delivers customer-centric solutions. </li><li>Results Oriented - Consistently achieves results, even under tough circumstances. </li><li>Communicates Effectively - Develops and delivers written and verbal communication that conveys clear understanding of different audiences and their levels of comprehension. Active listener to ensure clear understanding. </li><li>Planning Forethought and Alignment - Plans and prioritizes work to meet commitments aligned with organizational goals. </li><li>Interpersonal Intelligence - Understands self and others' emotions and is able to manage self and others' emotions to create a comfortable environment removing internal and external barriers to build rapport with others, including those with diverse opinions and beliefs, by acting with respect, dignity, and integrity. </li><li>Decision Quality -  Makes good and timely decisions that keep the organization moving forward. </li><li>Collaborative - Partners and connects with others to achieve shared goals or objectives, seeking input and inspiring others to value the same, building trust with each collaborative interaction. <br/><br/></li></ul><strong>Education and Experience:</strong> <br/><br/><ul><li>Bachelor's degree required.   </li><li>Minimum 0 to 18 months of experience in audit, tax, and/or public accounting or directly relevant experience highly preferred.  </li><li>CPA, CFA, MBA or other professional designation a plus.   </li><li>Previous experience in recruiting or business development a plus.  <br/><br/></li></ul><strong>Location: In office.<br/><br/></strong>Hybrid/Remote option may be considered with Management approval.<br/><br/><strong>Travel Requirements: <br/><br/></strong>Less than 5% (almost no travel)<br/><br/><strong>Physical Demands: </strong>The physical demands described are representative of those that must be met by an employee to successfully perform the essential functions of this position:<br/><br/>Frequent: Sitting, walking, eye/hand/foot coordination and repetitive motion.<br/><br/>Occasional: Standing and bending.<br/><br/>Infrequent: Lifting up to 10 pounds.<br/><br/>Determining compensation for this role (and others) at Vaco depends upon a wide array of factors including but not limited to the individual's skill sets, experience and training, licensure and certifications, office location and other geographic considerations, as well as other business and organizational needs. With that said, as required by local law, Vaco believes that the following salary range reasonably estimates the base compensation for an individual hired into this position in geographies that require salary range disclosure. An applicant may also be eligible to participate in certain incentive compensation programs based on achieving certain performance targets set forth each year and subject to the incentive compensation plan's terms and conditions. The individual may also be eligible for discretionary bonuses.<br/><br/>Salary Range for this role:<br/><br/>$60,000—$75,000 USD<br/><br/>Vaco, LLC (\"we,\" \"our,\" or \"Vaco\") respects your privacy and is committed to providing a transparent notice of our Notice at Collection and Privacy Policy for California Residents. This Notice and Privacy Policy for California Residents applies solely to those who reside in the State of California (\"consumers\" or \"you\"). For additional details, click here.<br/><br/>California residents may also access Vaco's HR Notice at Collection for California Applicants and Employees.<br/><br/>Vaco is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race (including but not limited to traits historically associated with race such as hair texture and hair style), color, sex (includes pregnancy or related conditions), religion or creed, national origin, citizenship, age, disability, status as a veteran, union membership, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, political affiliation, or any other protected characteristics as required by federal, state or local law.", "responsibilities": "The Senior Associate is responsible for generating sales, increasing revenue and profitability.  This position establishes and develops client relationships as well as works with one or more recruiters to fulfill open job orders. The position will collaborate with business stakeholders, business leaders and subject matter experts to plan and deliver projects effectively and timely.", "qualifications": {"required": "Bachelor's degree required.   Minimum 0 to 18 months of experience in audit, tax, and/or public accounting or directly relevant experience highly preferred.  CPA, CFA, MBA or other professional designation a plus.   Previous experience in recruiting or business development a plus.", "preferred": null}, "skills": ["Customer/Candidate Focus", "Results Oriented", "Communicates Effectively", "Planning Forethought and Alignment", "Interpersonal Intelligence", "Decision Quality", "Collaborative"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3964390569"}