{"jobTitle": "Planning Analyst, Beyond Yoga", "company": {"name": "Beyond Yoga", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "57,800.00 - 85,700.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Retail Apparel and Fashion, Design Services, and Retail", "description": "Female founded and led, Beyond Yoga creates buttery soft activewear and beyond for every size, shape, moment, and movement from our own line of meticulously researched fabrics. Our obsession for softness and fabrics, and a relentless pursuit of quality and fit makes Beyond Yoga a fan favorite at every stage of life. We proudly celebrate diversity and welcome all ethnicities, cultural backgrounds, belief systems, and identities.<br/><br/>We encourage our team to be active members of their local and global communities through opportunities like Social Good Day to participate in a cause of their choosing. Like us, the people we hire are passionate, honest, warm, enthusiastic, and fun!<br/><br/>In September 2021, we joined Levi Strauss &amp; Co., one of the world’s largest brand-name apparel companies and a global leader in jeanswear. Beyond Yoga operates as a standalone brand with the benefit of LS&amp;Co.’s global capabilities to help it achieve its goals of brand-building, store opening, category expansion and distribution.<br/><br/>The Demand Planning Analyst at Beyond Yoga will be instrumental in ensuring that our inventory levels are optimized to meet customer demand. This role involves analyzing sales trends, developing forecast models, and collaborating with the sales, merchandising, and planning teams to align forecasts with business strategies.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Support the development and help maintain accurate demand forecasts for the core, essential, and carryover Beyond Yoga product.</li><li>Analyze historical sales trends, research demand drivers, and prepare forecast data.</li><li>Evaluate forecast results and implement necessary adjustments.</li><li>Work closely with the commercial teams to understand market trends and promotional activities.</li><li>Collaborate with supply chain teams to ensure inventory levels meet demand forecasts.</li><li>Support the order reconciliation process by providing insights on channel constraints to the commercial teams.</li><li>Support the PO creation process and support cross channel reporting needs which include ATS, S&amp;OP and Investment review recaps.<br/><br/></li></ul><strong>Qualifications:</strong>.<br/><br/><ul><li>Minimum of 1-2 years of experience in demand planning or inventory management, preferably in the apparel or fashion industry.</li><li>Strong analytical skills and curiosity to work in a start up environment.</li><li>Proficiency in Excel skills and able to learn new systems quickly.<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Excellent communication and interpersonal skills to work effectively with all levels of the organization.</li><li>Strong organizational skills with the ability to manage multiple priorities in a fast-paced environment.</li><li>Passion for learning and working in a fast paced ambiguous environment.<br/><br/></li></ul>The expected starting salary range for this role is $57,800 - $85,700. We may ultimately pay more or less than the posted range based on the location of the role. The amount a particular employee will earn within the salary range will be based on several factors including, but limited to, relevant education, qualifications, experience, skills, performance and business needs.<br/><br/>Levi Strauss &amp; Co. (LS&amp;Co.) offers a total rewards package that includes competitive pay, incentive plans, and a wide array of benefits designed to help you and your family stay healthy, meet your financial goals, and balance the demands of your work and personal life. Available benefits vary depending upon the specifics of the role; details relating to a specific role will be made available upon request.<br/><br/>Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, benefits or other form of compensation and benefits that are allocable to a particular employee remains in the Company’s sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/>Levi Strauss &amp; Co. is committed to equal employment opportunity, affirmative action, and recruiting and maintaining a workforce that welcomes and respects people from diverse backgrounds while enabling our employees to make an impact. We value the unique combination of talents, experiences, and perspectives of each employee, making our collective success possible.<br/><br/><strong>EOE M/F/Disability/Vets<br/><br/></strong><strong>LOCATION<br/><br/></strong>USA, Culver City, Beyond Yoga HQ<br/><br/><strong>FULL TIME/PART TIME<br/><br/></strong>Full time<br/><br/><strong>Current LS&amp;Co Employees, apply via your Workday account.</strong>", "responsibilities": "The Demand Planning Analyst at Beyond Yoga will be instrumental in ensuring that our inventory levels are optimized to meet customer demand. This role involves analyzing sales trends, developing forecast models, and collaborating with the sales, merchandising, and planning teams to align forecasts with business strategies.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Support the development and help maintain accurate demand forecasts for the core, essential, and carryover Beyond Yoga product.</li><li>Analyze historical sales trends, research demand drivers, and prepare forecast data.</li><li>Evaluate forecast results and implement necessary adjustments.</li><li>Work closely with the commercial teams to understand market trends and promotional activities.</li><li>Collaborate with supply chain teams to ensure inventory levels meet demand forecasts.</li><li>Support the order reconciliation process by providing insights on channel constraints to the commercial teams.</li><li>Support the PO creation process and support cross channel reporting needs which include ATS, S&amp;OP and Investment review recaps.<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 1-2 years of experience in demand planning or inventory management, preferably in the apparel or fashion industry.", "preferred": "Strong analytical skills and curiosity to work in a start up environment.\nProficiency in Excel skills and able to learn new systems quickly."}, "skills": ["Demand Planning", "Inventory Management", "Apparel", "Fashion", "Analytical Skills", "Excel", "Supply Chain"], "postedDate": "1 week ago", "benefits": "Levi Strauss &amp; Co. (LS&amp;Co.) offers a total rewards package that includes competitive pay, incentive plans, and a wide array of benefits designed to help you and your family stay healthy, meet your financial goals, and balance the demands of your work and personal life. Available benefits vary depending upon the specifics of the role; details relating to a specific role will be made available upon request.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3964669435"}