{"jobTitle": "Clinical Laboratory Process Improvement Specialist", "company": {"name": "Beckman Coulter Diagnostics", "industry": "Medical Equipment Manufacturing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$95,300 - $140,000", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Medical Equipment Manufacturing", "description": "Wondering what’s within Beckman Coulter Diagnostics? Take a closer look.<br/><br/>At first glance, you’ll see that for more than 80 years we’ve been dedicated to advancing and optimizing the laboratory to move science and healthcare forward. Join a team where you can be heard, be supported, and always be yourself. We’re building a culture that celebrates backgrounds, experiences, and perspectives of all our associates. Look again and you’ll see we are invested in you, providing the opportunity to build a meaningful career, be creative, and try new things with the support you need to be successful.<br/><br/>Beckman Coulter Diagnostics is proud to work alongside a community of six fellow Diagnostics Companies at Danaher. Together, we’re working at the pace of change to improve patient lives with diagnostic tools that address the world’s biggest health challenges.<br/><br/>The Process Improvement/Project Management Specialist, Remote for Beckman Coulter Diagnostics is responsible optimizing customer organizational performance by leading the implementation of cost savings projects that track directly back to the customers P&amp;L. Also, enhancing the alignment and efficiency of business processes by ensuring continuous, sustained improvement across the enterprise through the implementation of Danaher Business System like tools and methodologies.<br/><br/>This position is part of the Sales and Marketing department headquartered in Brea, CA and will be **FULLY REMOTE** at Beckman Coulter, our vision is to relentlessly reimagine healthcare, one diagnosis at a time.<br/><br/>You will be a part of the Performance Partnership Delivery team and report to the Performance Partnership Delivery Manager responsible for leading project implementation with the customer of large-scale hard cost saving, process improvement and change management projects. If you thrive in a fast paced, innovative role and want to work to build a world-class laboratory consulting organization—read on.<br/><br/>In this role, you will have the opportunity to:<br/><br/><ul><li>Help customers re-engineer new or existing operations to build continuous improvement strategy and implement hard cost savings identified by the Performance Partnership Assessment team.</li><li>Understand the linkages between strategic objectives and process improvements, using both analytical tools and consulting techniques.</li><li>Lead and facilitate the customer through the projects to achieve (sign-off by customer) identified hard cost savings.</li><li>Find additional opportunities at customer site for hard cost savings not previously identified during the assessment phase and lead implementation at customer site.</li><li>Analyze LIS data to confirm customer volumes, test menus and validation of project implementation and cost savings results.</li><li>Identify gaps in current project milestone deliverables and develop / implement innovative methods to close gaps to be able to provide desired results on time. Facilitate course corrections to hit milestones for cost savings sign-off by customer.</li><li>Collect and analyze before and after data points to ensure cost savings goals are met and customer sign-off in a timely manner.<br/><br/></li></ul>The essential requirements of the job include:<br/><br/><ul><li>Bachelor’s degree in field with preference for 9+ years exp. OR Master’s degree in field with preference for 7+ years exp. OR Doctoral degree in field with preference for 4+ years exp AND track record of demonstrated success in achieving customer sign-off on hard cost savings linked back to the P&amp;L along with continuous improvement consulting.</li><li>Lab Operations, process improvement, or project management experience</li><li>Proven ability to lead the management and strategy of cost savings project optimization projects for large complex customers; strong business insights and ability to analyze client commercial capabilities, identify root cause and growth tool opportunities.</li><li>Demonstrated ability to accurately assess key business metrics and situations from a “general manager’s” point of view; effective at structured problem solving and critical thinking.</li><li>Required travel is 75% - mostly overnight travel.<br/><br/></li></ul>It would be a plus if you also possess previous experience in:<br/><br/><ul><li>Clinical Lab Operations and above leadership experience in health care system.</li><li>Commercial Operations; Finance and financial modeling; Supply Chain Management and/or developing lean supply chains.</li><li>Lean Six Sigma Black Belt <br/><br/></li></ul>At Beckman Coulter Diagnostics we believe in designing a better, more sustainable workforce. We recognize the benefits of flexible, remote working arrangements for eligible roles and are committed to providing enriching careers, no matter the work arrangement. This position is eligible for a remote work arrangement in which you can work remotely from your home. Additional information about this remote work arrangement will be provided by your interview team. Explore the flexibility and challenge that working for Beckman Coulter Diagnostics can provide.<br/><br/>The salary range OR the hourly range for this role is $95,300 - $140,000. This is the range that we in good faith believe is the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range. This range may be modified in the future.<br/><br/>This job is also eligible for bonus/incentive pay. We offer comprehensive package of benefits including paid time off, medical/dental/vision insurance and 401(k) to eligible employees.<br/><br/>Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/>#bestteamwins<br/><br/>At Danaher we bring together science, technology and operational capabilities to accelerate the real-life impact of tomorrow’s science and technology. We partner with customers across the globe to help them solve their most complex challenges, architecting solutions that bring the power of science to life. Our global teams are pioneering what’s next across Life Sciences, Diagnostics, Biotechnology and beyond. For more information, visit www.danaher.com.<br/><br/>Danaher Corporation and all Danaher Companies are committed to equal opportunity regardless of race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. We value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve. Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.<br/><br/>The EEO posters are available here.<br/><br/>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us at applyassistance@danaher.com to request accommodation.<br/><br/>", "responsibilities": "The Process Improvement/Project Management Specialist, Remote for Beckman Coulter Diagnostics is responsible optimizing customer organizational performance by leading the implementation of cost savings projects that track directly back to the customers P&amp;L. Also, enhancing the alignment and efficiency of business processes by ensuring continuous, sustained improvement across the enterprise through the implementation of Danaher Business System like tools and methodologies.", "qualifications": {"required": "Bachelor’s degree in field with preference for 9+ years exp. OR Master’s degree in field with preference for 7+ years exp. OR Doctoral degree in field with preference for 4+ years exp AND track record of demonstrated success in achieving customer sign-off on hard cost savings linked back to the P&amp;L along with continuous improvement consulting.\nLab Operations, process improvement, or project management experience\nProven ability to lead the management and strategy of cost savings project optimization projects for large complex customers; strong business insights and ability to analyze client commercial capabilities, identify root cause and growth tool opportunities.\nDemonstrated ability to accurately assess key business metrics and situations from a “general manager’s” point of view; effective at structured problem solving and critical thinking.\nRequired travel is 75% - mostly overnight travel.", "preferred": "Clinical Lab Operations and above leadership experience in health care system.\nCommercial Operations; Finance and financial modeling; Supply Chain Management and/or developing lean supply chains.\nLean Six Sigma Black Belt"}, "skills": ["Project Management", "Process Improvement", "Cost Savings", "Business Analysis", "Customer Relationship Management", "Lean Six Sigma", "Data Analysis", "Strategic Planning", "Change Management", "Leadership", "Communication", "Teamwork", "Problem Solving", "Analytical Skills", "Decision Making", "Time Management", "Organizational Skills", "Presentation Skills", "Negotiation Skills", "Relationship Building", "Customer Service", "Travel"], "postedDate": "1 week ago", "benefits": "We offer comprehensive package of benefits including paid time off, medical/dental/vision insurance and 401(k) to eligible employees.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3964899518"}