{"jobTitle": "Head of Financial Planning and Analysis", "company": {"name": "Jobs via eFinancialCareers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "252,500.00/yr - 332,500.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Staffing and Recruiting", "description": "Circle is a financial technology company at the epicenter of the emerging internet of money, where value can finally travel like other digital data - globally, nearly instantly and less expensively than legacy settlement systems. This ground-breaking new internet layer opens up previously unimaginable possibilities for payments, commerce and markets that can help raise global economic prosperity and enhance inclusion. Our infrastructure - including USDC, a blockchain-based dollar - helps businesses, institutions and developers harness these breakthroughs and capitalize on this major turning point in the evolution of money and technology.<br/><br/><strong>What you'll be part of:<br/><br/></strong>Circle is committed to visibility and stability in everything we do. As we grow as an organization, we're expanding into some of the world's strongest jurisdictions. Speed and efficiency are motivators for our success and our employees live by our company values: Multistakeholder, Mindfulness, Driven by Excellence and High Integrity. Circlers are consistently evolving in a remote world where strength in numbers fuels team success. We have built a flexible and diverse work environment where new ideas are encouraged and everyone is a stakeholder.<br/><br/><strong>What you'll be responsible for: <br/><br/></strong>Circle is looking for an experienced leader to join its growing Finance team as the Head of Financial Planning and Analysis. This role will oversee the corporate and commercial financial planning and analysis functions, and will closely partner with the CFO and senior leadership on core financial budgeting, planning, and forecasting processes as well as other strategic, analytical and reporting initiatives. The Head of Financial Planning and Analysis will be a cross-functional partner, who can synthesize actionable insights and recommendations from data and analysis for leaders throughout the organization.<br/><br/><strong>What you'll work on: <br/><br/></strong><ul><li>Leading core strategic financial and planning processes at the corporate and functional levels, including budgeting, planning, forecasting, reporting, and performance tracking &amp; analysis. </li><li>Ensuring the ongoing delivery of quality analytics and reporting, including headcount, revenue, operating expenses, cash flow, and analysis of actual to expected performance. </li><li>Partnering with product, business, and other departmental leaders to create and manage functional plans and budgets, conduct financial reviews of departments, and provide leaders with business insights to drive growth, efficiency, profitability, and operational improvement.</li><li>Providing financial analysis, decision support, and appropriate challenge to our product and business organizations as we evaluate new products, new markets, and new commercial partnerships, including through our Deal Review Group.</li><li>Supporting the CFO directly in all communications with the board, leadership team, investors, and other stakeholders, preparing materials, conducting analysis, and helping shape our narrative.</li><li>Supporting other functions (including Investor Relations and Corporate Development) with ad-hoc financial modeling and analysis to foster informed, strategic decision-making, including market analysis, business case development, corporate financial analysis, cost analysis.</li><li>Overseeing and ensuring compliance with all FP&amp;A-related SOX controls.</li><li>Attracting, leading, developing, exciting and retaining an engaged, high-performance team.<br/><br/><br/></li></ul><strong>You will aspire to our four core values:<br/><br/></strong><ul><li>Multistakeholder - you have dedication and commitment to our customers, shareholders, employees and families and local communities.</li><li>Mindful - you seek to be respectful, an active listener and to pay attention to detail. </li><li>Driven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals. </li><li>High Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty and intolerance.<br/><br/><br/></li></ul><strong>What you'll bring to Circle: <br/><br/></strong><ul><li>15+ years of demonstrated success leading strategic finance and planning within a dynamic, global financial organization. Prior experience in corporate finance, management consulting, investment banking strongly preferred. Ideal candidates will have a consistent track record of outstanding financial and strategic analysis and delivering meaningful recommendations based on this analysis.</li><li>10+ years of proven leadership and management experience in a fast-paced work environment.</li><li>First-class financial analytical capabilities and problem-solving skills, able to bring structure to ambiguous problems, generate hypotheses, coordinate research and analysis, fluently manipulate data, conduct analysis, and synthesize insight.</li><li>Excellent communication skills, able to use numbers to tell a business story, able to tailor message and content to different audiences, strong writing and presentation skills.</li><li>Ability to structure, manage, and coordinate complex cross-enterprise projects and processes with multiple work streams with multiple stakeholders.</li><li>Broad and deep knowledge and understanding of corporate finance, strategic and business planning, core financial processes, and how they all fit together to drive a business forward.</li><li>A get things done mindset, able to think strategically and take initiative to move forward tactically, continually iterate and improve, while anticipating demands of leadership.</li><li>Deep curiosity about the impact of technology on the global financial system.</li><li>Bachelor's degree required; MBA or Master's degree in related field of study preferred.</li><li>Willingness to travel approximately 10%. </li><li>Experience/familiarity with Slack, Apple MacOS and GSuite.<br/><br/><br/></li></ul><strong>Additional Information:<br/><br/></strong><ul><li>This position is eligible for day-one PERM sponsorship for qualified candidates.<br/><br/><br/></li></ul>Circle is on a mission to create an inclusive financial future, with transparency at our core. We consider a wide variety of elements when crafting our compensation ranges and total compensation packages.<br/><br/>Actual starting pay is determined by various factors, including but not limited to: relevant experience, skill set, qualifications, and other business and organizational needs. Please note that compensation ranges may differ for candidates in other locations.<br/><br/>Base Pay Range: $252,500 - $332,500<br/><br/>Annual Bonus Target: 40%<br/><br/>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.<br/><br/>We are an <strong>equal opportunity employer</strong> and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additionally, Circle participates in the <strong>E-Verify Program</strong> in certain locations, as required by law.<br/><br/>", "responsibilities": "Leading core strategic financial and planning processes at the corporate and functional levels, including budgeting, planning, forecasting, reporting, and performance tracking & analysis. Ensuring the ongoing delivery of quality analytics and reporting, including headcount, revenue, operating expenses, cash flow, and analysis of actual to expected performance. Partnering with product, business, and other departmental leaders to create and manage functional plans and budgets, conduct financial reviews of departments, and provide leaders with business insights to drive growth, efficiency, profitability, and operational improvement. Providing financial analysis, decision support, and appropriate challenge to our product and business organizations as we evaluate new products, new markets, and new commercial partnerships, including through our Deal Review Group. Supporting the CFO directly in all communications with the board, leadership team, investors, and other stakeholders, preparing materials, conducting analysis, and helping shape our narrative. Supporting other functions (including Investor Relations and Corporate Development) with ad-hoc financial modeling and analysis to foster informed, strategic decision-making, including market analysis, business case development, corporate financial analysis, cost analysis. Overseeing and ensuring compliance with all FP&A-related SOX controls. Attracting, leading, developing, exciting and retaining an engaged, high-performance team.", "qualifications": {"required": "15+ years of demonstrated success leading strategic finance and planning within a dynamic, global financial organization. Prior experience in corporate finance, management consulting, investment banking strongly preferred. Ideal candidates will have a consistent track record of outstanding financial and strategic analysis and delivering meaningful recommendations based on this analysis. 10+ years of proven leadership and management experience in a fast-paced work environment. First-class financial analytical capabilities and problem-solving skills, able to bring structure to ambiguous problems, generate hypotheses, coordinate research and analysis, fluently manipulate data, conduct analysis, and synthesize insight. Excellent communication skills, able to use numbers to tell a business story, able to tailor message and content to different audiences, strong writing and presentation skills. Ability to structure, manage, and coordinate complex cross-enterprise projects and processes with multiple work streams with multiple stakeholders. Broad and deep knowledge and understanding of corporate finance, strategic and business planning, core financial processes, and how they all fit together to drive a business forward. A get things done mindset, able to think strategically and take initiative to move forward tactically, continually iterate and improve, while anticipating demands of leadership. Deep curiosity about the impact of technology on the global financial system. Bachelor's degree required; MBA or Master's degree in related field of study preferred. Willingness to travel approximately 10%. Experience/familiarity with Slack, Apple MacOS and GSuite.", "preferred": "MBA or Master's degree in related field of study"}, "skills": ["Financial Planning", "Financial Analysis", "Strategic Planning", "Budgeting", "Forecasting", "Reporting", "Performance Analysis", "Decision Support", "Cross-Functional Collaboration", "Communication", "Presentation Skills", "Project Management", "Corporate Finance", "Business Planning", "Financial Modeling", "SOX Compliance", "Leadership", "Team Management", "Technology", "Slack", "Apple MacOS", "GSuite"], "postedDate": "1 month ago", "benefits": "Base Pay Range: $252,500 - $332,500<br/><br/>Annual Bonus Target: 40%<br/><br/>Also Included: Equity &amp; Benefits (including medical, dental, vision and 401(k)). Circle has a discretionary vacation policy. We also provide 10 days of paid sick leave per year and 11 paid holidays per year in the U.S.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3964158916"}