{"jobTitle": "Project Coordinator", "company": {"name": "Raymond West", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.00 - 29.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Raymond West is looking for a dynamic Project Coordinator to join the Systems team! The Project Coordinator is responsible for providing the sales coordination support to the outside Account Managers, verifying customer credit worthiness with internal credit department, placing sales orders with vendors and/or manufacturers, processing vendor invoicing and producing sales invoices to customers. The Project Coordinator will strive to create and maintain positive Customer, outside Account Manager and vendor/manufacturer relationships.<br/><br/>Raymond West is committed to providing our customers with end-to-end warehouse solutions. We bring you our industry-leading expertise in lift trucks, racking, conveyor, dock and door, rentals, parts, and service. Our customers trust us to provide the right supply chain solutions and services to keep their business up and running.<br/><br/>Duties And Responsibilities<br/><br/>Primary duties and responsibilities will vary with the specific position. Typical responsibilities are listed below. This list is not inclusive.<br/><br/><ul><li>Provide sales coordination support for the Account Managers by placing vendor orders.</li><li>Maintain an accurate financial report of all costs being submitted per every job.</li><li>Coordinate delivery of orders based on customer requirements.</li><li>Follow up for status of all open/undelivered vendor orders.</li><li>Process customer invoicing for sales orders.</li><li>Communicate with Sales rep or Project managers on progression of jobs.</li><li>Process vendor payables.</li><li>Provide coordination support for ship-in sales.</li><li>Create and maintain positive supplier / manufacturer relationships.</li><li>Negotiate pricing and maintain or increase available discounts.</li><li>Process sales orders and purchase orders in a prompt and timely manner.</li><li>Keep neat, accurate records of all documentation in online organized system.</li><li>Generate customer invoices for sales orders in a prompt and timely manner.</li><li>Processing vendor/manufacturer payables in a prompt and timely manner.</li><li>Calculate Account Manager Sales order commissions.</li><li>Monitor and update equipment in accounting system</li><li>Assist in Accounts Receivable collection, as necessary.</li><li>Maintain all reporting up to date in logs.</li><li>Process orders in online system order entry systems.</li><li>Schedule installations, deliveries and all assets for delivery or pick up. <br/><br/></li></ul>Required Skills/Abilities<br/><br/><ul><li>Excellent Management skills</li><li>Excellent Written and verbal communication skills </li><li>Excellent Organizational Time Management skills</li><li>Must be able to perform duties under minimal supervision </li><li>Proficient in Microsoft office Suite and similar software </li><li>Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. </li><li>Ability to speak effectively before groups of customers or employees of an organization.</li><li>Must be able to maintain effective working relationships with employees, Co-workers, and Managers in other departments</li><li>Must be willing to work off-hours as specific needs dictate and willing to assume more responsibility as required. </li><li>Possess organizational skills and ability to process sales orders from inception to completion.</li><li>Possess strong business math skills.</li><li>Willing to comply with the employee handbook. <br/><br/></li></ul>Education/Experience<br/><br/><ul><li>High school diploma or equivalent with related work experience.<br/><br/></li></ul>Physical Requirements<br/><br/>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Position is Sedentary and desk bound</li><li>Prolonged periods of sitting at a desk and working on a computer</li><li>Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus</li><li>Occasionally required to climb or balance and stoop, kneel, crouch, or crawl</li><li>Occasionally required to lift and/or move up to 25 pounds <br/><br/></li></ul>Pay Range<br/><br/><ul><li>The hourly range for this position is $24.00 - $29.00. The specific pay offered to a candidate may be influenced by a variety of factors including but not limited to the candidate’s relevant experience, education, and work location.<br/><br/></li></ul>Qualified candidates must be able to pass a pre-employment physical and drug screen.<br/><br/>Raymond West provides medical, dental, vision, 401k with company match, flexible spending accounts, disability insurance, life insurance, personal time off, holiday pay and a great team to work with!<br/><br/>Check us out at www.raymondwest.com. Raymond West has a great group of loyal and hardworking employees who help us maintain our exemplary level of sales and service.<br/><br/>Apply on-line via the submit resume button provided.  We are an equal opportunity employer and encourage all qualified persons to apply. We encourage qualified military veterans and persons with disabilities to submit their resume online. We are a drug free company. <br/><br/>This contractor and subcontractor shall abide by the requirements of 41 CFR<br/><br/><ul><li></li><li>60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, national origin, protected veteran status or disability.</li></ul>", "responsibilities": "Provide sales coordination support for the Account Managers by placing vendor orders. Maintain an accurate financial report of all costs being submitted per every job. Coordinate delivery of orders based on customer requirements. Follow up for status of all open/undelivered vendor orders. Process customer invoicing for sales orders. Communicate with Sales rep or Project managers on progression of jobs. Process vendor payables. Provide coordination support for ship-in sales. Create and maintain positive supplier / manufacturer relationships. Negotiate pricing and maintain or increase available discounts. Process sales orders and purchase orders in a prompt and timely manner. Keep neat, accurate records of all documentation in online organized system. Generate customer invoices for sales orders in a prompt and timely manner. Processing vendor/manufacturer payables in a prompt and timely manner. Calculate Account Manager Sales order commissions. Monitor and update equipment in accounting system Assist in Accounts Receivable collection, as necessary. Maintain all reporting up to date in logs. Process orders in online system order entry systems. Schedule installations, deliveries and all assets for delivery or pick up.", "qualifications": {"required": "Excellent Management skills Excellent Written and verbal communication skills  Excellent Organizational Time Management skills Must be able to perform duties under minimal supervision  Proficient in Microsoft office Suite and similar software  Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals.  Ability to speak effectively before groups of customers or employees of an organization. Must be able to maintain effective working relationships with employees, Co-workers, and Managers in other departments Must be willing to work off-hours as specific needs dictate and willing to assume more responsibility as required.  Possess organizational skills and ability to process sales orders from inception to completion. Possess strong business math skills. Willing to comply with the employee handbook.", "preferred": "High school diploma or equivalent with related work experience."}, "skills": ["Management", "Communication", "Time Management", "Microsoft Office", "Sales", "Customer Service", "Vendor Management", "Order Processing", "Invoicing", "Accounts Receivable", "Inventory Management", "Logistics", "Supply Chain"], "postedDate": "1 month ago", "benefits": "Raymond West provides medical, dental, vision, 401k with company match, flexible spending accounts, disability insurance, life insurance, personal time off, holiday pay and a great team to work with!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3964816207"}