{"jobTitle": "Dealer Account Manager", "company": {"name": "Westlake Financial", "industry": "Financial Services", "size": "Large", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$160,000.00/yr - $305,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Westlake Financial is the largest privately held auto finance company in the United States with demonstrated growth year over year. We continue to expand our teams and diversify our business model. This leads to cementing us as a leader in the automotive lending industry. Westlake continues to grow its market share within the Auto Industry with assets in excess of 18B. We have business relationships in all 50 states, including Puerto Rico. We are looking to acquire talented individuals as we expand our market share. Westlake Financial believes in PEOPLE with the PURPOSE and PASSION to assist our more than 43,000 dealer partners throughout North America. Our Dealer Account Managers are individuals with the vision and dedication to provide world-class customer service to our dealer partners through training and prospecting for business opportunities. This is a challenging, dynamic field position with high earnings potential and opportunities for career advancement. The Dealer Account Manager position offers a highly incentivized performance-based compensation package. A motivated and driven individual can earn up to and beyond a six-figure income. We invite you to learn more about the position, please visit https://www.westlakefinancial.com/employee-recruitment/", "responsibilities": "Prepare presentations and proposals to communicate company products and services to all levels of management within Independent and Franchise Dealerships. Identify sales prospects and contact these and other accounts assigned to you. Follow-up on new leads and referrals resulting from field activity in both independent and franchise dealers. Develop, maintain and grow current and potential dealer partners within the Independent and Franchise Dealer communities. Constant and effective communication via phone and in-person visits with dealer partners to train on current programs and fast funding requirements. Provide solutions, rehash and restructure vehicle loans for approval in a profitable manner for Westlake and the Dealership Partners. Assist with the preparation of sales contracts by educating the dealer on what is needed for proper verification by Westlake Financial. Develop, maintain and understand sales materials and keep up to date on current financial product knowledge. Participate in marketing events such as seminars, trade shows, and telemarketing events for independent and franchise dealers.", "qualifications": {"required": "Demonstrated experience in Automotive, Finance and Sales (required). 1-2 year’s previous experience in a Sales role with a proven track record of success. College degree (preferred or equivalent work experience). Presentation skills (from initial creation to delivery). Strong Interpersonal and communication skills. Knowledge of advertising and sales promotion techniques. Strong computer skills and adaptability to new technology. Goal oriented with a desire for improvement and advancement. Able to communicate and work amicably with diverse teams. Knowledge/Experience with the use of DealerTrack, Routeone, or CUDL (beneficial). Previous Outside Sales Experience, (preferred). Significant local travel to current and potential clients. This requires the possession of a valid state driver's license.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Full Time Benefits: Medical, Dental, and Vision benefits, Life Insurance and Long-term disability plans, Flexible Spending Account, 401K matching, Employee Stock Ownership Program in a $18.2 Billion Company, plus company matching, Wellness Programs, Metro Tap Card and Metro-link Reimbursement (for Los Angeles, CA employees only), Career Path Opportunities, Discounts on Parks, Museums, Movie Tickets, and Attractions, Annual Flu Shot, Paid Vacations Days, Paid Sick days, Paid holidays, Gym (available in our Los Angeles, CA & Dallas,TX office), Rental Car Discounts, Dell Member Purchase Program, UKG Wallet.", "remoteWork": "Remote - on the road", "url": "https://www.linkedin.com/jobs/view/3964885042"}