{"jobTitle": "Life Insurance Sales Agent", "company": {"name": "Jackson Insurance Solutions", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "10,000.00/yr - 15,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>Compensation:10K-15K Monthly (Commission only, No base/hourly, Uncapped)<br/><br/></strong><strong>Schedule: Employee's choice<br/><br/></strong><strong>Location: REMOTE-Work from Home!!!<br/><br/></strong><strong>Work/Life Balance<br/><br/></strong>How about TODAY being the day you take back your life and secure your future?<br/><br/>The finance industry makes more millionaires than any other industry in the World!<br/><br/>Our team is looking for new INDEPENDENT LIFE INSURANCE AGENTS who are ready to learn the business, work hard, have fun, and finally earn what you’re worth.<br/><br/><strong>Benefits:<br/><br/></strong><ul><li>Remote position. Work from home, the coffee shop, the beach, wherever you choose!</li><li>Fully commission based position with no cap on your earnings!</li><li>True work/life balance</li><li>Top-notch mentorship with some of the best in the business</li><li>Affordable health insurance, dental, and vision benefits for you and your family for full-time employees</li><li>You will have the opportunity to own your own agency (if desired, not required)</li><li>Opportunity to earn frequent bonuses</li><li>Earn free trips to some of the most beautiful places in the world</li><li>NO COLD CALLING! You will be selling life insurance ONLY to people who have already reached out and asked for someone to help them with life insurance</li><li>NO membership fees, dues, franchise fees, etc</li><li>NO sales quotas, no condescending bosses, no sleazy sales tactics, no neckties (unless that's your thing)</li><li>Hands-on training and mentoring from our team of successful agents. You’ll work with your mentor and the rest of our team to learn the business and how to be successful here. Our goal is to set you up for success and then help you achieve it!<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>No experience required</li><li>Not licensed yet? No problem! We can help! </li><li>Willingness to be and remain teachable and coachable</li><li>A cell phone and laptop or computer with internet access<br/><br/></li></ul>We are looking for the right kind of people, the kind of people that align with our core values.<br/><br/>People who understand that relationships matter, people come first. People who are relentless in the pursuit of personal growth and believe in open, honest, and productive communication. People who do the right thing, even when no one is looking.<br/><br/>Here we work as a true team and strive to be a positive influence in the world. We act like owners…because we OWN it!<br/><br/>If you enjoy being of service and doing good in the world and want to have some fun while you get stuff done then you’re in the right place!<br/><br/>If this sounds like you, you might be the perfect fit for our team! Schedule an interview with one of our leaders today! Read a little about each of us, choose who you feel would be the best mentor for you, and schedule directly with them. We’ll see ya soon!<br/><br/><strong> Jessica Jackson:</strong>As a multifaceted leader, mentor, devoted mom of triplets, and supportive wife, I am deeply committed to fostering growth and empowerment in both my personal and professional spheres. As part of the LGBTQ+ community I strive to be an authentic and inclusive role model, driven by passion and empathy. Through my journey, I aspire to inspire others to embrace their true selves, pursue their dreams, and create positive change in the world. Living in Southern California, I enjoy being outdoors, going to the gym, and spending time with my family in my free-time. I'd love to work with you!<br/><br/><strong>Todd Hoiseth:</strong>Agency Owner and National Top Producer, Todd Hoiseth has given his life to helping people. With 12 years of full time ministrybackground, loving people has always been at the core of who Todd is. As a dedicated father of 2 beautiful daughters, the work life balance afforded by this opportunity allows him to build a dynamic business while still being present for his kids. With over $600K in personal sales and an agency of over 100 licensed agents, Todd possesses the necessary skills to help anyone at any level find success. He mentors and guides with heart and conviction that is rooted in relationships and personal growth.<br/><br/><strong>Kelsey Zen:</strong>Kelsey Zen, hailing from Atlanta, Georgia, is a dedicated wife of two decades and a nurturing mother of four. Her journey underscores the profound value of leadership skills. With compassion as her cornerstone in business dealings, she deftly navigates challenges. Her adept communication fosters strong connections, while keen self-awareness guides her decisions. Empathy, a cherished trait, enables her to understand and uplift others. Fueled by courage, she fearlessly forges paths to success. Shemeika's blend of compassion, communication prowess, self-awareness, empathy, and courage not only propels her endeavors but also leaves a lasting, positive impact on those around her.<br/><br/><strong>Raymond Meza:</strong>Raymond Meza is a man of God who has dedicated his life to service and leadership. With years of experience in both the auto and solar industries, Raymond has honed his skills in business and customer service. Currently, as an Insurance Agent, he is passionate about mentoring and training future leaders. His commitment to his faith and professional growth shines through in everything he does.Raymond is committed to making a positive impact on the lives of others. As he transitions into a role focused on mentorship and leadership development, he aims to empower individuals to reach their full potential. By sharing his knowledge, experiences, and faith, Raymond seeks to inspire others to lead with integrity, compassion, and purpose.<br/><br/><strong>Kim Jones:</strong>As a dedicated leader, mentor, devoted mother of two, supportivewife, graphic artist, business owner and christian, I am immenselycommittedin both my personal and professional growth. It is my passion to be a role modelto others to inspirethem to be able to achieve their full potential within themselves. Encouraging them to give themselves more freedom compared to the 9-5 typical job schedule whichin return creates a much more positiveoutlook and change in the world! If you enjoy what you do it'll never feel like working! In my free time I enjoy designing, the gym, church, traveling and most importantlymy family! I'd love to work with you!<br/><br/><strong> Beverly Burns:</strong>With a passion for exceptional customer service and a dedication to meet the diverse needs of my clients, I approach each interaction with tailored solutions and a genuine desire to make a positive impact on clients’ lives. My dedication doesn’t end with client service, though. I am<br/><br/>committed to supporting the development of my team members through mentorship, coaching<br/><br/>and providing opportunities for skill enhancement. In my free time I enjoy traveling and thanks<br/><br/>to this business I can work and vacation from anywhere in the world! I am really looking forward<br/><br/>to working with you.<br/><br/><strong>Katherine Kuzich:</strong>Producer from Chapel Hill, NC. I am a wife, and mother to 3 furrychildren, 2 adult sons, and Nonna to an 8 month old granddaughter. I spent20+ yearsin the mortgage industry,beforedeciding I neededsomething more in life. Something I could build and make my own. I entered the Life Insurance industry as a way to create a new path outside of the typical 9-5 workforce whereI had more control over my schedule and freedom. I am dedicated to helpingothers build their dreams of ownership, and control over their destiny in life. As a mentor and leader it is my passion to help my team develop, grow and become successful. I am a firm believer that when you nurture the growth and success of the people on your team, you then become successful yourself. In my free time I enjoy being outdoors working in my yard, or walkingmy dogs. I spend a lot of time in the kitchen cooking and baking which are both two very big passions of mine. I would love the opportunity to work with you, and to help mentoryou, and watch you blossom into your own successful business, that affords you the income, time, and freedom you need for yourself and your family.<br/><br/>Powered by JazzHR<br/><br/>sQBIF2bcPa", "responsibilities": "How about TODAY being the day you take back your life and secure your future?<br/><br/>The finance industry makes more millionaires than any other industry in the World!<br/><br/>Our team is looking for new INDEPENDENT LIFE INSURANCE AGENTS who are ready to learn the business, work hard, have fun, and finally earn what you’re worth.", "qualifications": {"required": "No experience required\nNot licensed yet? No problem! We can help! \nWillingness to be and remain teachable and coachable\nA cell phone and laptop or computer with internet access", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Remote position. Work from home, the coffee shop, the beach, wherever you choose!\nFully commission based position with no cap on your earnings!\nTrue work/life balance\nTop-notch mentorship with some of the best in the business\nAffordable health insurance, dental, and vision benefits for you and your family for full-time employees\nYou will have the opportunity to own your own agency (if desired, not required)\nOpportunity to earn frequent bonuses\nEarn free trips to some of the most beautiful places in the world\nNO COLD CALLING! You will be selling life insurance ONLY to people who have already reached out and asked for someone to help them with life insurance\nNO membership fees, dues, franchise fees, etc\nNO sales quotas, no condescending bosses, no sleazy sales tactics, no neckties (unless that's your thing)\nHands-on training and mentoring from our team of successful agents. You’ll work with your mentor and the rest of our team to learn the business and how to be successful here. Our goal is to set you up for success and then help you achieve it!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3964100757"}