{"jobTitle": "Postal Mail Processor-No experience required", "company": {"name": "Postal Source", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.63/hr - 39.27/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail Office Equipment", "description": "<strong>POSTAL CLERK<br/><br/></strong><strong>No Experience Required – Paid Training Provided – Job Security<br/><br/></strong>The Postal Service is the largest government related agency in terms of employees. The Postal Service currently employs nearly 1 million people and is hiring nationwide. There is NO experience required, paid training is provided for all job openings. There are MANY different positions available. The job openings range in starting salary from $24.63 to $39.27/hour, $72,400/year average pay with full benefits. Benefits include paid vacation, paid sick leave, paid holidays, health insurance, life insurance and a retirement plan. Postal Service employment also includes career advancement, good working conditions and GREAT job security.<br/><br/>The Postal Service is the largest government related agency in terms of employees, currently employing nearly 1 million people. There are retail locations, mail distribution centers and Postal hubs within the Postal Service's operations. The Postal Service is currently hiring and there are MANY different positions available. The Postal Service has excellent and challenging employment opportunities. Postal Service employment includes great pay, good working conditions, career advancement, and job security that can lead to a lifetime career. To qualify for employment, you must be 18 years of age or older and a U.S. citizen.<br/><br/>The Postal Service currently employs nearly 1 Million people. There are many employment opportunities with the Postal Service from entry level to management. Certain career fields exist in most or all of its departments. These fields are usually administrative, general office and clerical in nature, such as accountant, administrative assistant, auditor, bookkeeper, clerk, office assistant, secretary, staff assistant, typist, etc. To allow a better understanding of the Postal Service Clerk position, the following is a brief description.<br/><br/><ul><li>Clerk – Clerks sell stamps, take incoming mail, sort and distribute the mail in addition to other clerical functions. This position also assists the public with general mailing needs, such as completing a change of address, mail holds, giving out post office box keys, etc.<br/><br/></li></ul>The Postal Service was created over 200 years ago and is the largest agency in terms of employees, currently employing nearly 1 Million people. There are retail locations, mail distribution centers and Postal hubs within the Postal Service's operations. The Postal Service operates over 30,000 post office location. Over 600 million pieces of mail are delivered by the Post Office to as many as 142 million different delivery points. This totals over 170 billion pieces of mail being delivered annually. The Postal Service operates over 200,000 vehicles and has the largest vehicle fleet in the world. Most of the fleet is right hand drive for easier mail delivery. Labor Services is a private employment service that offers assistance in gaining employment and is not affiliated with the USPS. The Postal Service employs nearly 1 million people and is currently hiring nationwide and there are many positions available. There is no experience required. Postal Service employment includes great pay and benefits, good working conditions, career advancement, and great job security that can lead to a lifetime career. The Postal Service is an equal opportunity employer.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3965864344"}