{"jobTitle": "Staff Accountant", "company": {"name": "Los Angeles Football Club (LAFC)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "67,000.00 - 75,000.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Hospitality, Real Estate, and Travel Arrangements", "description": "<strong>OVERVIEW<br/><br/></strong>The Los Angeles Football Club (LAFC) is an MLS soccer club serving the greater Los Angeles area. LAFC is dedicated to building a world-class soccer club that represents the diversity of Los Angeles and is committed to delivering an unrivaled experience for fans. LAFC's ownership group is comprised of local leaders and innovators of industry with intellectual capital, financial prowess, operations expertise, and success in the fields of entertainment, sports, technology, and media. LAFC is invested in the world's game and Los Angeles, constructing, and developing the 22,000 seat BMO Stadium and a top-flight training center on the campus of Cal-State Los Angeles.<br/><br/><strong>POSITION SUMMARY<br/><br/></strong>The Staff Accountant is involved in all aspects of the accounting and general ledger of the organization. This role is responsible for assisting with the month-end, quarter-end and year end-close processes by reconciling and analyzing accounts and booking journal entries, as well as other tasks associated with accounting and compliance.<br/><br/><em>LAFC is currently operating on a hybrid work model with a minimum of 1 – 2 in-office days per week. Please note that this may vary by role, and your scheduled in-office days are up to the discretion of your supervisor. <br/><br/></em><strong>ESSENTIAL FUNCTIONS<br/><br/></strong><ul><li>Analyze and reconcile general ledgers for domestic and international entities. </li><li>Prepare and upload journal entries. </li><li>Maintain and record fixed assets. </li><li>Assist with monthly balance sheet reconciliations. </li><li>Participate in the month-end close process. </li><li>Work with internal customers and stakeholders to analyze expenses and prepare accruals. </li><li>Support the annual budget process by managing related tools and templates. </li><li>Assist in the accounting and reporting of the Club's non-profit, the LAFC Foundation. </li><li>Assist in preparation of MLS related reporting, such as post-game reporting. </li><li>Assist in the preparation of audit requests. </li><li>Prepare tax-related filings. </li><li>Assist with ad-hoc requests. </li><li>Other duties as assigned by Supervisor/Management. <br/><br/></li></ul><strong>QUALIFICATIONS<br/><br/></strong><ul><li>Bachelor's degree from an accredited four-year College or University required, preferably in Accounting or Finance. </li><li>Minimum 2+ years in an accounting related role, public and private accounting experience is a plus. </li><li>Solid understanding of general accepted account principles (GAAP), month-end close process, basic tax compliance, internal controls, and variance analysis. </li><li>Proficiency in Microsoft Office Suite, specifically intermediate knowledge of Excel (pivots, lookups, etc.). </li><li>Strong written and verbal communication with the ability to build positive working relationships, both internally and externally. </li><li>Self-starter, self-motivated, and ability to multi-task in a fast-paced environment. </li><li>Demonstrates decision making and problem-solving skills. </li><li>Experience with enterprise resource planning (ERP) accounting software, Sage Intacct a plus. </li><li>Experience with California tax filings a plus. <br/><br/></li></ul><strong>SALARY RANGE<br/><br/></strong>At LAFC, we carefully consider a wide range of factors to determine a fair and equitable compensation package. The final offer amount will consider a wide range of factors that are considered in making compensation decisions including, but not limited to skill sets; relevant experience and training. Pursuant to state and local pay disclosure guidelines, the overall range for this role is $67,000 - $75,000 per year.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>LAFC strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.<br/><br/>Applicants for employment in the U.S. must possess work authorization, which does not require sponsorship by the employer for a visa.", "responsibilities": "The Staff Accountant is involved in all aspects of the accounting and general ledger of the organization. This role is responsible for assisting with the month-end, quarter-end and year end-close processes by reconciling and analyzing accounts and booking journal entries, as well as other tasks associated with accounting and compliance.", "qualifications": {"required": "Bachelor's degree from an accredited four-year College or University required, preferably in Accounting or Finance. Minimum 2+ years in an accounting related role, public and private accounting experience is a plus. Solid understanding of general accepted account principles (GAAP), month-end close process, basic tax compliance, internal controls, and variance analysis. Proficiency in Microsoft Office Suite, specifically intermediate knowledge of Excel (pivots, lookups, etc.). Strong written and verbal communication with the ability to build positive working relationships, both internally and externally. Self-starter, self-motivated, and ability to multi-task in a fast-paced environment. Demonstrates decision making and problem-solving skills. Experience with enterprise resource planning (ERP) accounting software, Sage Intacct a plus. Experience with California tax filings a plus.", "preferred": null}, "skills": ["Accounting", "GAAP", "Tax Compliance", "Internal Controls", "Variance Analysis", "Microsoft Office", "Excel", "Communication", "Problem Solving", "ERP", "Sage Intacct", "California Tax Filings"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3965544827"}