{"jobTitle": "Technical Program Manager", "company": {"name": "ELITE MENTE LLC", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Staffing and Recruiting", "description": "<strong>Position:</strong> Technical Program Manager<br/><br/><strong>Location:</strong> <strong>Culver City, CA (Onsite; Min 3 days onsite)<br/><br/></strong><strong>Duration:</strong> 3-6+ Months Contract<br/><br/><strong>Interview:</strong> Video<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>You are responsible for managing a small or existing technology program, successfully delivering improvements to a product and/or to meet program goals. </li><li>You work independently, seeking guidance as needed. You may be embedded in a single technology team, partnering with the manager and other engineering teams to deliver difficult, cross-functional projects or you may work with more teams if program goals require it. </li><li>You may work directly with external technology providers, customers, partner teams, or sellers. </li><li>You have a solid understanding of the design approaches and industry technologies utilized in your program area.</li><li>You make connections (to people and/or technologies) and make sure the right people are part of the conversation. </li><li>You prevent or mitigate the consequences of poor technology decisions. </li><li>You recognize when a proposed design is too complex or risky and to mitigate you arrange additional reviews by senior engineers and escalate appropriately. </li><li>As part of your project and program ownership, you know the larger business picture (i.e., customer experience, organization goals, opportunities, and/or problems) and you deeply understand the technical requirements of the solutions being built (i.e., architecture, dependency impacts, efficiency, performance, availability, operability, etc.). </li><li>You also take the time to understand the needs of engineers (who have to build, maintain, and extend features for the life of the system) to make appropriate trade-offs. </li><li>You partner effectively with technical managers to secure resources, scope engineering efforts, set project priorities, milestones, and drive delivery. </li><li>You help teams determine where to iterate to make improvements. </li><li>You determine if success metrics are in place, and if not work to define them. </li><li>You may be responsible for writing PR/FAQs, supporting OP1-2 efforts (including organizing/collecting data), and other strategic program documentation (e.g. Narratives).</li><li>To meet timelines and minimize disruption to builder teams, you manage the overall schedule, proactively mitigate risks, and keep the scope of engineering efforts under control. </li><li>You own program communication. </li><li>You accelerate progress by driving crisp and timely decisions, clearing blockers (e.g., “Path to green”), escalating appropriately. </li><li>You may apply process improvement methodologies (e.g., Agile, Lean, Kaizen analyses or other approach). </li><li>You may oversee the roll-out process, including test, and deployment to Beta/Prod. </li><li>You plan for the unexpected, making sure that systems (upstream and downstream) are not broken by changes related to the efforts you manage. </li><li>You plan effectively to make sure projects deliver without wearing out key individuals and system maintainability (and ability to evolve) is not compromised. </li><li>You may be asked to manage post-launch support plans (e.g., triage, issue/ticket management, COEs), run retrospectives, and/or hold post-mortems. </li><li>You look for opportunities to incorporate needed system quality and operational excellence improvements into project plans.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3965942649"}