{"jobTitle": "Facility Management - Supply - Supervisor", "company": {"name": "FreshRealm", "location": "San Clemente, CA"}, "location": "San Clemente, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Food and Beverage Services", "description": "The Warehouse Supervisor will oversee and coordinate daily warehouse activities such as receiving and storing goods, managing inventory levels, ensuring the efficient delivery of goods, supervising staff, and securing the warehouse. Follows all health and safety standards and enforces the use of PPE’s.<br/><br/><ul><li> Supervising warehouse staff and daily activities. </li><li> Managing, evaluating and reporting on warehouse productivity. </li><li> Tracking and coordinating the receipt, storage, and timely delivery of goods and materials. </li><li> Ordering supplies and maintaining suitable inventory levels. </li><li> Checking orders, bills, items received, inventory, and deliveries for accuracy. </li><li> Maintaining records, reporting relevant information, and preparing any necessary documentation. </li><li> Ensuring basic maintenance standards and compliance with health and safety regulations. </li><li> Performing a daily inspection of the warehouse grounds. </li><li> Coordinating and maintaining fleets and equipment. </li><li> Communicating and coordinating with other departments. </li><li> Executes and Promotes safe work practices at all times </li><li> Conduct Cycle Count inventory processes to ensure accuracy and timely execution </li><li> Oversee and evaluate stock rotation procedures (FIFO) </li><li> Train staff in product dating and create procedures to eliminate loss </li><li> Notify leadership of shortages or other problems that could impact product availability </li><li> Receive inbound product </li><li> Ship outbound product </li><li> Audit inbound &amp; outbound movements for accuracy </li><li> Other duties as assigned </li><li> Basic math skills required (counting, multiplication, conversions, fractions) </li><li> Demonstrated skills with industrial powered equipment required. Certification for equipment as required based on facility needs (for example, forklift, scissor lift, electric pallet jack, reach truck, etc. </li><li> An understanding of basic warehouse operations </li><li> An understanding of perishable food stocking </li><li> An understating Just In Time inventory strategies </li><li> Practical experience with ERP software (SAP experience is a plus) </li><li> Strong computer skills, including Microsoft Excel </li><li> Excellent communication skills </li><li> Excellent organization skills and the ability to multi-task </li><li> Strong problem-solving skills and analytical skills required </li><li> Ability to tolerate short periods of exposure to freezer temperatures </li><li> Excellent organizational, communication, and time-management skills <br/><br/></li></ul>We are an Equal Opportunity Employer.<br/><br/>Apply Now", "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3965980243"}