{"jobTitle": "Category Sourcing Director (42068)", "company": {"name": "Best Formulations", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$124,000.00 - $195,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Manufacturing", "description": "Founded in 1984, Best Formulations LLC, a diversified nutraceutical and personal care company headquartered in City of Industry, California, is a contract manufacturer of thousands of branded SKUs, including high quality nutritional supplements including softgels, tablets, capsules, powders, teas, dietary supplements, and vegetarian softgels.<br/><br/>We are a trusted partner to our customers when it comes to innovation and have one of the strongest R&amp;D, product formulation and technical teams in the industry. We are recognized as the leader in plant-based softgel innovation and our ability to encapsulate difficult formulas. We seek out innovation across our entire business and pass that knowledge and expertise to our customers.<br/><br/>The Category Sourcing Director will be responsible for overseeing and managing all sourcing activities within the organization. This role requires a strategic leader who can drive sourcing initiatives, build strong supplier relationships, and ensure the procurement of high-quality ingredients and materials at competitive prices. The ideal candidate will have extensive experience in the nutraceutical or pharmaceutical industries and a proven track record of success in sourcing and supply chain management.<br/><br/>How Will You Contribute<br/><br/><ul><li> Develop and Implement Sourcing Strategies : Create and execute comprehensive sourcing strategies that align with company goals and ensure a reliable supply of high-quality materials. </li><li> Supplier Management : Identify, evaluate, and establish strong relationships with suppliers to ensure quality, cost-effectiveness, and timely delivery of materials. </li><li> Contract Negotiation : Negotiate contracts and agreements with suppliers to secure the best terms and conditions, including pricing, quality, and delivery schedules. </li><li> Risk Management : Identify and mitigate risks within the supply chain, including supply disruptions, quality issues, and regulatory compliance. </li><li> Market Analysis : Conduct market research and analysis to stay informed about industry trends, pricing, and new sourcing opportunities. </li><li> Cross-Functional Collaboration : Work closely with R&amp;D, Quality Assurance, Production, and other departments to ensure sourcing activities meet company standards and requirements. </li><li> Budget Management : Develop and manage the sourcing budget, ensuring cost-effective procurement practices. </li><li> Performance Metrics : Establish and monitor key performance indicators (KPIs) to measure the effectiveness of sourcing strategies and supplier performance. <br/><br/></li></ul>Qualifications<br/><br/> Minimum Requirements/Qualifications: <br/><br/><ul><li> Bachelor’s degree in Supply Chain Management, Business Administration, or a related field. </li><li> Minimum of 5 years of experience in sourcing or procurement, preferably within the nutraceutical or pharmaceutical industry. </li><li> Strong knowledge of the nutraceutical market and regulatory requirements. </li><li> Excellent negotiation and contract management skills. </li><li> Proven ability to develop and maintain strong supplier relationships. </li><li> Strong analytical and problem-solving abilities. </li><li> Proficiency in procurement software and tools. </li><li> Excellent communication and interpersonal skills. </li><li> Ability to work independently and as part of a team in a fast-paced environment. <br/><br/></li></ul>Work Environment<br/><br/><ul><li> May involve exposure to allergens such as Soy, Wheat, Fish, Shellfish, Milk, Egg, Tree Nuts and Sesame. <br/><br/></li></ul>What Best Formulations Can Offer You<br/><br/><ul><li> 401(k) with company match </li><li> Tuition reimbursement </li><li> Medical/Dental/Vision/Pet Insurance </li><li> Health &amp; Wellness programs </li><li> Generous time off for vacations <br/><br/></li></ul>More About Us<br/><br/>As a valued strategic partner, Best Formulations offers a comprehensive program of services, turnkey solutions, and client support that is unmatched in the industry. Our product development team can provide customized, proprietary formulations designed specifically to meet the needs of our customers and their method of distribution. Our vertically integrated manufacturing and packaging process allows us to schedule flexible production runs to respond quickly to shifting market demands. Every step of the way, we are committed to your growth and success!<br/><br/>\"To develop and strengthen mutually beneficial relationships with our employees, customers, and business partners by providing the highest quality products and the Best customer service. Together We Grow!\"<br/><br/> This position is currently classified as on-site. <br/><br/>Base Salary Range: $124,000 - $155,000 per year, based on candidate professional experience level. Employees are eligible to participate in Medical, Dental, Vision, Life Insurance, 401(k), Holidays, Vacation, Tuition Reimbursement Program.<br/><br/>The final salary offered for this position may take into account a number of factors including, but not limited to, location, skills, education, and experience.<br/><br/>In accordance with the CO Equal Pay Act, Colorado Applicants Are Not Permitted to Apply.<br/><br/>The Company reserves the right to modify, update, change and/or make corrections to this job description, at the sole discretion of senior management, at any time during the employee’s employment term, at the sole discretion of management.<br/><br/> EEO Statement <br/><br/>Best Formulations is an equal opportunity employer committed to employing a diverse workforce and providing accommodations for people with disabilities in all parts of the hiring process as required under its Employment Accommodation Policy. Best Formulations will work with applicants to meet accommodation needs that are made known to Best Formulations in advance.", "responsibilities": "The Category Sourcing Director will be responsible for overseeing and managing all sourcing activities within the organization. This role requires a strategic leader who can drive sourcing initiatives, build strong supplier relationships, and ensure the procurement of high-quality ingredients and materials at competitive prices. The ideal candidate will have extensive experience in the nutraceutical or pharmaceutical industries and a proven track record of success in sourcing and supply chain management.", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Business Administration, or a related field. Minimum of 5 years of experience in sourcing or procurement, preferably within the nutraceutical or pharmaceutical industry. Strong knowledge of the nutraceutical market and regulatory requirements. Excellent negotiation and contract management skills. Proven ability to develop and maintain strong supplier relationships. Strong analytical and problem-solving abilities. Proficiency in procurement software and tools. Excellent communication and interpersonal skills. Ability to work independently and as part of a team in a fast-paced environment.", "preferred": ""}, "skills": ["Supply Chain Management", "Procurement", "Negotiation", "Contract Management", "Supplier Relationship Management", "Market Research", "Procurement Software"], "postedDate": "1 month ago", "benefits": "401(k) with company match Tuition reimbursement Medical/Dental/Vision/Pet Insurance Health &amp; Wellness programs Generous time off for vacations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3965594241"}