{"jobTitle": "Assistant Buyer II", "company": {"name": "Ross Stores, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "74,000.00/yr - 78,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Retail", "description": "<strong>Our values start with our people, join a team that values you!<br/><br/></strong>We are the nation’s largest off-price retailer with over 2,000 stores, and a strong track record of success and growth. Our focus has always been bringing our customers a constant stream of high-quality brands and on-trend merchandise at extraordinary savings. All while providing a fun and exciting treasure hunt experience.<br/><br/><strong>As Part Of Our Team, You Will Experience<br/><br/></strong><ul><li>Success. Our winning team pursues excellence while learning and evolving</li><li>Career growth. We develop industry leading talent because Ross grows when our people grow</li><li>Teamwork. We work together to solve the hard problems and find the right solution</li><li>Our commitment to Diversity, Equity &amp; Inclusion, and our community. We celebrate the backgrounds, identities, and ideas of those who work and shop with us because our differences make us stronger. We strive to be a positive force in our community.<br/><br/></li></ul>Our Corporate headquarters are in Dublin, CA, we have 3 buying offices in key markets in New York City, Los Angeles, and Boston, and 8 distribution centers nationwide. With 2023 revenues of $20.4 billion, we are a Fortune 500 company who is committed to providing an inclusive work environment with continuous learning opportunities and development for our teams.<br/><br/><strong>About This Opportunity...<br/><br/></strong>In the heart of the NY fashion district LA and Boston, our Buying Offices sit at the heart of our business. We are savvy - our merchandising team searches the globe for the best brands, latest styles, and deliver them to our customers at the value they love and expect. This area of our business is ideal for candidates who love the thrill of a great deal and are driven to grow their careers.<br/><br/>The Assistant Buyer II role strengthens your merchandising business acumen to prepare you for future buying positions. We invest in you through structured training and one on one apprenticeship with a skilled Buyer. This position helps the Buyer(s) manage the merchandising systems and takes ownership of key processes. You will gain a deeper understanding of the off-price business, through frequent vendor interactions and analyzing business performance.<br/><br/>The base salary range for this role is $74,000 - $78,000. The base salary range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.<br/><br/><strong>What You Will Do And What You Will Learn...<br/><br/></strong><ul><li> Responsible for establishing and maintaining relationships and credibility with vendors. This includes attending frequent in-person meetings, as well as regular interactions with vendors to problem solve, trouble shoot, and discuss market trends. You will learn how to build rapport with vendors.</li><li> Own and learn our reporting process to make actionable analysis and provide business driving recommendations to the Buyer. Utilize and manage merchandising systems and display understanding of warehouse processes.</li><li> Accurately execute operational functions to support a designated Buyer(s). This includes managing purchase orders and processing markdowns to ensure timely delivery of key shipments.</li><li> Provide timely, accurate and on-going analysis and interpretation of key business issues and make recommendations to the Buyer. This includes utilizing retail math skills to conduct stock and other ad hoc analyses, monitoring regional merchandise reports and Open-to-Buy monitoring.</li><li> Demonstrate product knowledge through sharing information with Buyer(s) because of frequent in-person competitive shopping, shopping Ross Stores, and the market. Take initiative to find new resources and creative methods of sourcing product to impact the assortment.</li><li> You will learn how to understand and apply the concept of speed of spending. This includes the ability to manage the Open-to-Buy, use and knowledge of packaway strategy and learning other key reporting and business metrics.<br/><br/></li></ul><strong>What You Need To Be Successful...<br/><br/></strong><ul><li> Strong communication skills: You can \"read the situation\" you actively listen, ask clarifying questions, and demonstrate the ability to build relationships.</li><li> Flexibility: You can pivot and are adaptable, and receptive to feedback.</li><li> Results Driven: You are tenacious, and achievement focused. You can prioritize your work and deliver it with accuracy.</li><li> Intellectually curious: You can analyze and draw conclusions, are a critical thinker, and see the big picture.</li><li> Resilient: You are persistent and persuasive. You stay focused on your goals and finding creative solutions to problems.</li><li> Enthusiasm for the product and retail business. Product is the center of what we do.... you must have an enthusiasm for the retail business and the product.</li><li> Analytical Mindset: Helping to run a business depends on analysis and retail math.</li><li> Bachelor's Degree required.</li><li> Minimum of two years retail merchandising experience in no less than an Assistant Buyer capacity with extensive vendor contact and interaction.<br/><br/></li></ul><strong>Perks And Benefits Of Joining Our Team...<br/><br/></strong>Our Associates are at the heart of everything we do and we're proud to offer a range of benefits that reflect how much we value their contributions. Here's a peek into what you can expect as an eligible Ross Associate:<br/><br/><ul><li> A broad range of affordable health insurance options*, 401(k) with employer match*, life insurance*</li><li> Ample PTO, paid holidays, and Summer Fridays, as well as the opportunity to purchase additional vacation*</li><li> Employee stock purchase plan*</li><li> Charitable donations matched by Ross Stores Foundation</li><li> Enhanced maternity and bonding leaves with 100% income replacement*</li><li> Parent support programs</li><li> And more....<br/><br/></li></ul>", "responsibilities": "In the heart of the NY fashion district LA and Boston, our Buying Offices sit at the heart of our business. We are savvy - our merchandising team searches the globe for the best brands, latest styles, and deliver them to our customers at the value they love and expect. This area of our business is ideal for candidates who love the thrill of a great deal and are driven to grow their careers.<br/><br/>The Assistant Buyer II role strengthens your merchandising business acumen to prepare you for future buying positions. We invest in you through structured training and one on one apprenticeship with a skilled Buyer. This position helps the Buyer(s) manage the merchandising systems and takes ownership of key processes. You will gain a deeper understanding of the off-price business, through frequent vendor interactions and analyzing business performance.", "qualifications": {"required": "Strong communication skills: You can \"read the situation\" you actively listen, ask clarifying questions, and demonstrate the ability to build relationships.\nFlexibility: You can pivot and are adaptable, and receptive to feedback.\nResults Driven: You are tenacious, and achievement focused. You can prioritize your work and deliver it with accuracy.\nIntellectually curious: You can analyze and draw conclusions, are a critical thinker, and see the big picture.\nResilient: You are persistent and persuasive. You stay focused on your goals and finding creative solutions to problems.\nEnthusiasm for the product and retail business. Product is the center of what we do.... you must have an enthusiasm for the retail business and the product.\nAnalytical Mindset: Helping to run a business depends on analysis and retail math.\nBachelor's Degree required.\nMinimum of two years retail merchandising experience in no less than an Assistant Buyer capacity with extensive vendor contact and interaction."}, "skills": ["Communication", "Flexibility", "Results Driven", "Analytical", "Retail Merchandising"], "postedDate": "1 week ago", "benefits": "A broad range of affordable health insurance options*, 401(k) with employer match*, life insurance*\nAmple PTO, paid holidays, and Summer Fridays, as well as the opportunity to purchase additional vacation*\nEmployee stock purchase plan*\nCharitable donations matched by Ross Stores Foundation\nEnhanced maternity and bonding leaves with 100% income replacement*\nParent support programs\nAnd more....", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3965723050"}