{"jobTitle": "Safety & Security General Manager", "company": {"name": "The Aerospace Corporation", "industry": "Defense and Space Manufacturing", "size": "Not specified", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$260,000 - $300,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing", "description": "The Aerospace Corporation is the trusted partner to the nation’s space programs, solving the hardest problems and providing unmatched technical expertise. As the operator of a federally funded research and development center (FFRDC), we are broadly engaged across all aspects of space— delivering innovative solutions that span satellite, launch, ground, and cyber systems for defense, civil and commercial customers. When you join our team, you’ll be part of a special collection of problem solvers, thought leaders, and innovators. Join us and take your place in space.\n\nAt Aerospace, we are committed to providing an inclusive and diverse workplace for all employees to share in our common passion and aspiration – to carry out a mission much bigger than ourselves.\n\nJob Summary\n\nWe are seeking an experienced senior security professional to lead our Safety and Security organization as the Safety & Security General Manager. In this fast-paced position, the leader will provide senior leadership in the areas of strategic security and safety planning to achieve ever-evolving business goals; coordinate events which align corporate priorities to security; ensure alignment of security and safety systems, strategies, policies, procedures, and what technologies Aerospace must have in place to remain ahead of the threat. This highly visible and dynamic position includes regular engagement with senior Aerospace leaders and their business teams.", "responsibilities": "Provide leadership to 120 Security & Safety employees who work throughout our national company and has responsibility for a budget of $8M and management of contracted security providers. Proven track record of building solutions that support a reliable, scalable, enterprise approach. Lead strategic security, health, safety, classified program security, emergency and crisis management, disaster recovery, and business continuity planning to achieve business goals by prioritizing enterprise and organizational initiatives and coordinating the evaluation, deployment, and management of current and future technologies. Ensure alignment of security, information protection, and safety system strategies, policies, and processes in compliance with government and corporate directives. Accountable for enterprise programs that maintain a safe and healthy work environment and protect staff, information, and corporate laboratories and workplaces nationwide. Plan and coordinate with partner organizations to achieve end-to-end customer service for all operating locations, jointly developing and implementing service level agreements with internal and external customers, including new secure facility implementation. Plan and coordinate with partner organizations to proactively identify, mitigate, and manage security, information protection, and safety risks and collaborate with cross-functional leaders to develop and implement security, information protection, and safety best practices and processes. Establish and/or strengthen working partnerships with law enforcement, government agencies, corporate customers, third-party vendors, industry partners, and professional organizations.", "qualifications": {"required": "Prior experience identifying, analyzing, and justifying present or future enterprise security, safety, information protection, emergency, and crisis management, and business continuity/disaster recovery (BC/DR) programs to senior management along with experience designing, implementing, and operating these programs at an enterprise level. Proven ability to develop and lead implementation and integration of complex, cross-functional initiatives in collaboration with Legal, HR, Facilities, Finance, and IT to achieve security, safety, emergency, and crisis management, and BC/DR program goals. Demonstrated leadership and prior experience in building, managing, mentoring, and inspiring security and safety teams, with a proven track record of delivering projects on schedule and as budgeted. Experience operating DOD SAP programs. Working knowledge of classified program security, enterprise safety programs, export control, ITAR, cybersecurity, and cyber operations, and insider threat programs. Demonstrated change leadership and change management experience, including implementation of service level agreements. Demonstrated ability to transform, enhance, and impact organizational operations, productivity, and efficiency through development and use of digitization, automation, metrics, data/data analytics, and process reengineering to drive continuous improvement. Experience conducting risk and vulnerability assessments and operational security and safety program design/planning. Exceptional interpersonal and communication skills and strong business acumen. Travel to Aerospace and customer locations as needed. This position requires ability to obtain and maintain a Top-Secret security clearance with SCI access, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.", "preferred": "Working knowledge of the National Industrial Security Program Operating Manual (NISPOM), DODM 5205.07 Volumes 1-4, NIST 800-171, and OSHA regulations, including radiation handling. Prior experience leading and overseeing laboratory and industrial safety programs; ability to influence executive and senior leadership to adopt change management processes and strategies to continually enhance and promote Enterprise safety culture. Current Top-Secret Clearance with SCI access."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Comprehensive health care and wellness plans, Paid holidays, sick time, and vacation, Standard and alternate work schedules, including telework options, 401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire, Flexible spending accounts, Variable pay program for exceptional contributions, Relocation assistance, Professional growth and development programs to help advance your career, Education assistance programs, An inclusive work environment built on teamwork, flexibility, and respect.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3965988935"}