{"jobTitle": "Retail Store Associates and Stockers - 4111 - 24009383", "company": {"name": "Big Lots", "location": "Redondo Beach, CA"}, "location": "Redondo Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Ready to join our BIG family? Text \"BIG LOTS\" to 97211 to schedule an interview.\n\nWhen you join our team, you’ll enjoy extra savings with a 20% discount on almost everything in store – even food! And a 30% discount on Indoor and Outdoor furniture. Additional benefits include a same day pay option (hourly associates only), discounts on Apple products, Verizon, AT&T services, and more! For More information about benefits, see https://www.biglots.com/corporate/careers/benefits.\n\nPerforms general store operational duties including cashiering, customer service, truck unloading, stocking, merchandise recovery, and light cleaning or maintenance as assigned.\n\n<ul><li> Greets and assists customers as needed in order to maintain the highest level of customer service.</li><li> Maintains and operates point-of-sale systems efficiently and accurately.</li><li> Drives customer loyalty program participation, including sign ups and rewards processing at check-out.</li><li> Participates in the freight flow process including truck unloading, stocking, merchandise presentation and recovery.</li><li> Participates in furniture department operations including carry-outs and display assembly as needed.</li><li> Maintains appearance of the store’s interior and exterior to company standards including light maintenance duties and cleaning.</li><li> Performs daily front-end maintenance including check stand cleanliness, replenishment of merchandise and supplies and floor safety.</li><li> Performs other tasks as assigned by Store Leadership, such as cart retrieval, shrink control and safety-related tasks.<br/><br/></li></ul><strong>Qualification<br/><br/></strong><ul><li> Must be at least 16 years of age.</li><li> Strong customer service and communication skills required.</li><li> Ability to work a flexible work schedule including nights, weekends and holidays required.</li><li> Prior retail experience preferred.</li><li> Previous experience operating a cash register preferred.</li><li> Ability to lift, carry, push, and pull a minimum of 50 pounds required. Ability to unload freight, to move product on and off of store shelves, to walk, stand, bend, stoop, or kneel for long periods of time, and to move freely throughout store on a continual basis required.</li><li> Basic English literacy and math skills required.<br/><br/></li></ul>We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws.<br/><br/>The actual hourly rate will equal or exceed the required minimum wage applicable to the job location.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3965991100"}