{"jobTitle": "Retail Sales Associate", "company": {"name": "Crossroads Trading", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>Benefits:<br/><br/></strong><ul><li>401(k)</li><li>401(k) matching</li><li>Dental insurance</li><li>Employee discounts</li><li>Flexible schedule</li><li>Health insurance</li><li>Opportunity for advancement</li><li>Training &amp; development</li><li>Vision insurance</li><li>Wellness resources<br/><br/></li></ul><strong>The Resale Revolution Starts With You!<br/><br/></strong>As a Crossroads team member, you will represent our brand’s promise: to offer a fun, fashion-centered, and affordable shopping experience to our communities.<br/><br/><strong>What You’ll Do:<br/><br/></strong>When you join Crossroads, you are joining the sustainable fashion movement and reshaping fashion culture. And you aren’t just impacting the planet’s future- you are impacting your own.<br/><br/><ul><li>We have clear paths for promotion and several routes you can take as you embark on your second-hand retail journey.</li><li>You’ll learn how to run a second-hand business– you’ll embody an entrepreneurial spirit- learning everything from buying, merchandising and inventory practices to gaining and maintaining the trust of a customer base who has been devoted since day one. <br/><br/></li></ul><strong>You are:<br/><br/></strong><ul><li> A Team Player. You are as enthusiastic about the success of others as you are about your own success.</li><li> Authentic. You are your unique self! </li><li> Fashion-focused. You eat, breathe, and sleep style. Fashion is life.</li><li> Adaptable. You feel comfortable adjusting to changing circumstances and encourage your teammates to do the same. We problem-solve together! </li><li> People-first. You are energized by people. You radiate kindness and positivity! You understand your impact and are someone who uplifts others. <br/><br/></li></ul><strong>You will:<br/><br/></strong><ul><li> Engage. You get to meet new people, every day! Greet each customer with a smile and welcome them to our store. Create a welcoming, fun, and inclusive environment to shop and work in. </li><li> Ask and Educate. You will teach our customers how we work and get them excited about selling their clothes to us!</li><li> Have Integrity. You will act with integrity in words and actions- do the right thing and do it right, even when it’s difficult.</li><li> Be Compassionate. You will embody our core values of service, inclusion, and education. It’s important that we connect with all customers and try our best to help them. </li><li> Be Reliable. You will show up to work on time and ready to go! </li><li> Be Flexible. You understand that needs change and evolve throughout the day- you know how to support your team and customer as needed.</li><li> Enjoy Organizing. Cleaning, organizing, and merchandising are all parts of the job and help create the best possible shopping and working environment.<br/><br/></li></ul><strong>Perks: <br/><br/></strong><strong>Health + Wellbeing<br/><br/></strong><strong>We will:<br/><br/></strong><ul><li> Support your wellbeing. We care about our employees holistically and offer sick paid time off. </li><li> Prioritize wellness for all. We offer medical, dental, and vision insurance for ALL employees who work at least 20 hours a week!</li><li> Offer additional support for your life outside work. We have an Employee Assistance Program (EAP) that provides FREE mental health, financial, legal, and other life event advisory services for all employees. <br/><br/></li></ul><strong>Work/Life Harmony<br/><br/></strong><strong>We will: <br/><br/></strong><ul><li> Give you incentives when you work during the holidays. We give you time and a half pay for select holidays throughout the year, and we are closed on Thanksgiving and Christmas.</li><li> Encourage work/life balance. We offer flexible scheduling so that you can meet work &amp; life needs!<br/><br/></li></ul><strong>Financial Health<br/><br/></strong><strong>We will: <br/><br/></strong><ul><li> Contribute to your 401(k). Free money? We’ll match up to 6% of your contribution as soon as you are eligible! We offer both a Roth and traditional 401(k).</li><li> Offer a generous discount on all merchandise including luxury consignment pieces- shop where you work!</li><li> Be Transparent. We have clear pay ranges and always advertise pay for positions. We believe in pay equity.</li><li> Offer Earned Wage Access. Need money before payday? You’ll be able to access pay as you earn it through our partner app ZayZoon.</li><li> Contribute to Commuter Benefits. Take public transit? We’ll contribute and match a portion of your commuter account monthly. <br/><br/></li></ul><strong>Growth + Development<br/><br/></strong><strong>We will: <br/><br/></strong><ul><li> Empower you. Our Employee Resource Group (ERG) gives you a seat (and a voice) at the table. They meet monthly to discuss how we can shape the company through a diverse lens and meet our DEI commitments.</li><li> Let you take the lead. We offer clear paths for growth and ongoing professional development that are straightforward and attainable.</li><li> Celebrate with you. We’ll provide you with many opportunities to bond with your team as you celebrate successes together. </li><li> Equip you with the tools to be successful. As you onboard &amp; throughout your career, our training programs will set you up to win.<br/><br/></li></ul><strong>Minimum Requirements: <br/><br/></strong><ul><li>Must be able to work a minimum of 12 hours per week.</li><li>Have an interest in fashion and current trends.</li><li>Must be authorized to work in the United States.<br/><br/></li></ul><strong>About Crossroads<br/><br/></strong>One of the first companies to pioneer secondhand clothing as an alternative to traditional retail, Crossroads Trading has been buying, selling, and consigning name brand and designer clothing in a friendly, fun, and fashionable atmosphere since 1991.<br/><br/>Since opening the doors of its first location in the heart of San Francisco’s Fillmore District, Crossroads has expanded over time to 39 retail locations spanning Northern and Southern California, Chicago, Seattle, Portland, Denver, New York, Houston, and Dallas. And in recent years, we have added Sell-By-Mail and Concierge programs to provide convenient new ways for fashionable and eco-conscious customers to sell their gently used clothing.<br/><br/>Crossroads has been featured in Harper’s Bazaar, Teen Vogue, and LA Mag, and is widely recognized as an industry leader in the ‘resale revolution.’<br/><br/><strong>If you like sustainability, fashion, and working in a fun, positive environment, you’ll enjoy a career with us!<br/><br/></strong>Compensation: $16.75 - $17.75 per hour<br/><br/>If you don't see a job you are interested in, you can email your resume to resume@crossroadstrading.com<br/><br/>Our Mission &amp; Values<br/><br/>Who We Are<br/><br/>Crossroads Trading has been a leader in the resale fashion industry since 1991. We have brick and mortar locations nationwide where we buy, sell and trade on-trend used clothing to the public.<br/><br/>Our Values<br/><br/>Our goal is make our customers feel great by looking great and keep clothing out of landfills. We also strive to be active, ethical, and responsible members of every community we serve and believe in doing the right thing and doing it right.<br/><br/>Commitment to Diversity &amp; Inclusion<br/><br/>Crossroads is committed to creating a diverse and inclusive culture where team members and customers from all backgrounds can come together to look good and feel great. We celebrate and embrace the differences of all our team members and want you to feel that you belong, starting from day one.<br/><br/>Growth Opportunities<br/><br/>Crossroads takes pride in helping develop and promote team members through our Grow from Within program. We provide clear paths to promotion for all positions and offer valuable training in management, buying, merchandising, customer service, and more!<br/><br/><strong>Pursuant to any “Ban the Box” ordinances, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/></strong>Crossroads’ policy is to fill every position without regard to race, color, religion, creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender (including gender identity and gender expression), marital or partner status, age, national origin, ancestry, physical or mental disability, medical condition, genetic characteristic, military status, or any other consideration made unlawful by federal, state or local laws. CTC is an equal opportunity employer and selects employees on the basis of ability, experience, training, and character. Please contact the president or CEO of Crossroads Trading Co. if you have any questions or complaints regarding this policy.<br/><br/>Crossroads believes that part of being a great place to work means offering a generous benefits package to its team members. Depending on eligibility, Crossroads offers the following benefits to team members:", "responsibilities": "As a Crossroads team member, you will represent our brand’s promise: to offer a fun, fashion-centered, and affordable shopping experience to our communities.", "qualifications": {"required": "Must be able to work a minimum of 12 hours per week.\nHave an interest in fashion and current trends.\nMust be authorized to work in the United States."}, "skills": [], "postedDate": "1 month ago", "benefits": "401(k), 401(k) matching, Dental insurance, Employee discounts, Flexible schedule, Health insurance, Opportunity for advancement, Training & development, Vision insurance, Wellness resources", "remoteWork": "No", "salary": {"amount": "16.75 - 17.75", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3965982037"}