{"jobTitle": "Social Media Manager (Part Time)", "company": {"name": "Arketa", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Wellness and Fitness Services", "description": "The company\n\nArketa is a wellness business platform built for the modern hybrid world.\n\nUnlike other software, Arketa offers clean & easy-to-use software tools for wellness entrepreneurs & studios to easily set their schedules, accept bookings & payments, create on demand video libraries, host retreats, text, do email marketing and grow their businesses in-person and online. Arketa offers branded apps and websites so your customers have a consistent experience across all mediums.\n\nIt's an exciting time for Arketa – there is a big market for modern wellness solutions that Arketa is perfectly positioned to capture. We’ve raised a $6M seed round led by First Round Capital, and we’re growing fast. We’re a remote team, and we’re looking for people who want to inspire and empower a healthier world.\n\n**About The Role**\n\nArketa is seeking a strategic and savvy social media professional with a passion for fitness and content creation to engage and grow Arketa’s community across all social media channels including our Founder’s socials. We’re looking for someone to be the face of our brand on social, support and strengthen our social media strategy, and deliver social campaigns that drive brand awareness, customer acquisition, and retention.\n\nPart-time is ideal. Think 10-20 hrs/wk.\n\nWe think you'll be a fit if you have\n\n<ul><li>Fitness instruction experience (MUST HAVE)</li><li>1-3 years of experience managing social media channels and growing audiences</li><li>Experience in growing a following, content creation, digital marketing, and community engagement</li><li>Familiarity with filming yourself and a comfort level with being the face of a brand</li><li>Some experience with project management platforms (such as Notion) and collaborative product design tools like Canva<br/></li></ul>How to apply\n\n<ul><li>Email marketing @arketa.com with the subject line “Social Media Manager App”</li><li>Describe your experience in both content creation and fitness</li><li>Include a video (either one you’ve previously created, or something net-new) that is related to fitness</li></ul>", "postedDate": "1 month ago", "salary": {"amount": "4,997.00/yr - $40,000.00/yr", "currency": "USD"}, "skills": ["Social Media", "Content Creation", "Digital Marketing", "Community Engagement", "Fitness", "Project Management", "Notion", "Canva"], "url": "https://www.linkedin.com/jobs/view/3965262954"}