{"jobTitle": "Sr. Compensation Partner", "company": {"name": "Alteryx", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Human Resources", "industry": "Software Development", "description": "We’re looking for problem solvers, innovators, and dreamers who are searching for anything but business as usual. Like us, you’re a high performer who’s an expert at your craft, constantly challenging the status quo. You value inclusivity and want to join a culture that empowers you to show up as your authentic self. You know that success hinges on commitment, that our differences make us stronger, and that the finish line is always sweeter when the whole team crosses together.<br/><br/><strong>Overview<br/><br/></strong>Alteryx has an exciting opportunity for an innovative Sr. Global Compensation Partner. As a Sr. Global Compensation Partner, you will be a key part of the Global Compensation team and support our global compensation programs including base pay and incentive programs. The ideal candidate will be analytical, comfortable with ambiguity and look for creative ways to solve problems in fast-paced environment.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Support the design and enhancement of Alteryx’s global compensation program</li><li>Work as a key partner to business leaders, HR Business Partners and Talent Acquisition partners to solve compensation-related business challenges</li><li>Lead multiple major annual programs/projects as assigned (i.e. Annual Compensation Review Process, Survey Submissions and Salary Structures, and Pay Equity Review)</li><li>Review and select benchmark surveys, analyze and interpret relevant market data, and develop recommendations for updates to Alteryx job architecture, salary structures and bonus targets as appropriate</li><li>Assess and make appropriate recommendations for several pay programs, structures and practices.</li><li>Collaborate with the People Systems team on compensation related project/program implementation</li><li>Stay current with market trends and ensure compliance with local, state, and federal regulations as it relates to compensation<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5+ years of compensation experience in a global company, software industry a plus</li><li>5+ years experience administering fundamental salary administration and compensation programs and policies</li><li>Bachelor’s degree or equivalent in Human Resources, Business Administration, or related field</li><li>Excellent analytical and data presentation skills</li><li>Must be well organized, detail oriented, and confident working with individuals at different levels of the organization in a fast-paced environment</li><li>Ability to cultivate strong cross-functional relationships and effectively communicate technical concepts to functional business partners</li><li>Demonstrated ability to maintain the highest degree of security and confidentiality</li><li>Advanced proficiency with Excel, Word and Power Point</li><li>Strong ability to work effectively in a team environment</li><li>Experience using Workday HCM strongly preferred<br/><br/></li></ul><strong>Compensation<br/><br/></strong>Alteryx is committed to fair, equitable, and transparent compensation. Final compensation will be determined by various factors such as your relevant work experience, education, certifications, skills, and geographic location.<br/><br/>The salary range for this role in California, Colorado, Washington, Texas, and Rhode Island is $103,300 - 135,000.<br/><br/>In addition, you may be eligible for other compensation, such as a bonus. Employees may also be eligible for a wide range of other benefits, including medical, retirement, financial, wellness, time off, employee discounts, and others.<br/><br/>Find yourself checking a lot of these boxes but doubting whether you should apply? At Alteryx, we support a growth mindset for our associates through all stages of their careers. If you meet some of the requirements and you share our values, we encourage you to apply. As part of our ongoing commitment to a diverse, equitable, and inclusive workplace, we’re invested in building teams with a wide variety of backgrounds, identities, and experiences.<br/><br/><strong>Benefits &amp; Perks<br/><br/></strong>Alteryx has amazing benefits for all Associates which can be viewed here.<br/><br/>", "responsibilities": "Support the design and enhancement of Alteryx’s global compensation program\nWork as a key partner to business leaders, HR Business Partners and Talent Acquisition partners to solve compensation-related business challenges\nLead multiple major annual programs/projects as assigned (i.e. Annual Compensation Review Process, Survey Submissions and Salary Structures, and Pay Equity Review)\nReview and select benchmark surveys, analyze and interpret relevant market data, and develop recommendations for updates to Alteryx job architecture, salary structures and bonus targets as appropriate\nAssess and make appropriate recommendations for several pay programs, structures and practices.\nCollaborate with the People Systems team on compensation related project/program implementation\nStay current with market trends and ensure compliance with local, state, and federal regulations as it relates to compensation", "qualifications": {"required": "5+ years of compensation experience in a global company, software industry a plus\n5+ years experience administering fundamental salary administration and compensation programs and policies\nBachelor’s degree or equivalent in Human Resources, Business Administration, or related field\nExcellent analytical and data presentation skills\nMust be well organized, detail oriented, and confident working with individuals at different levels of the organization in a fast-paced environment\nAbility to cultivate strong cross-functional relationships and effectively communicate technical concepts to functional business partners\nDemonstrated ability to maintain the highest degree of security and confidentiality\nAdvanced proficiency with Excel, Word and Power Point\nStrong ability to work effectively in a team environment", "preferred": "Experience using Workday HCM strongly preferred"}, "skills": ["Compensation", "HR", "Data Analysis", "Excel", "PowerPoint", "Workday HCM"], "postedDate": "1 week ago", "benefits": "Alteryx has amazing benefits for all Associates which can be viewed here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3965737554"}