{"jobTitle": "Account Executive", "company": {"name": "ECFX", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "ECFX, a dynamic growth stage business, is seeking an Account Executive responsible for the sale of ECFX’s products and services to regional accounts. The Account Executive works to grow new sales revenue by identifying, qualifying, and coordinating meetings for new opportunities, performing product demonstrations, negotiating contracts, and closing prospects. Responsibilities include establishing client relationships for new accounts and growing new accounts annually as well as managing relationships with the existing accounts and growing year-over-year revenue for the existing accounts in the region.<br/><br/>Responsibilities and Duties:<br/><br/><ul><li>Sales quota attainment – Consistently attain sales quota and annual sales growth for new sales. Identify, prioritize and close new account opportunities. </li><li>Sales pipeline management – Build and deliver an accurate account pipeline. Effectively manage the sales pipeline to ensure an adequate number of leads and deals are in the pipeline identified for both short- and long-term success. Accurately forecast sales opportunities and keep internal systems up-to-date with account information, activities and contacts</li><li>Product knowledge and demonstrations – Maintain proficiencies in all ECFX products to deliver effective and convincing demonstrations. Schedule and perform successful demonstrations for targeted accounts</li><li>Local marketing and account development – Develop and implement territory and account plans in accordance with business objectives. Develop sales strategies and key relationships with accounts. Work with marketing to develop target strategies. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s Degree or equivalent work experience required. </li><li>5+ years of successful B2B software sales experience, preferably in legal or professional services. Experience selling to large law firms is a plus</li><li>A comprehensive understanding of the legal and/or professional services marketplace, its business culture, processes, value drivers and business operations either through sales or project management experience</li><li>You are aware of the needs of C-level decision makers and customize your sales communication to their decision making style. </li><li>Strong ability to demonstrate software offerings in person and on Zoom, develop innovative value propositions to maximize sales revenue, and negotiate and close under time and objective pressure</li><li>It is easy for you to build and maintain relationships with influencers and decision-makers</li><li>When experiencing a setback, you show resilience and the ability to learn and adapt. </li><li>You have a high level of organization and preparation that will support effective presentations, sales calls and meetings</li><li>You have an innate capacity to direct your energy to different activities on different days. </li><li>Your ability to think strategically and reason logically is essential to turn any complexity into a strategic advantage. </li><li>You can track goals you set and therefore have an ability to create urgency</li><li>Ability to travel approximately 30% of the time<br/><br/></li></ul><strong>Benefits<br/><br/></strong>At present, we are a fully remote company, and you will be expected to operate in a fast-paced environment that covers all US time zones, including Hawaii. We offer flexible hours and health, dental, vision, and life insurance benefits. We are innovating in a space that is resistant to change and it is more about educating the market than winning against competing options as there is no peer in terms of product features and functionality.", "postedDate": "1 month ago", "skills": ["Sales", "Software Sales", "Legal", "Professional Services", "B2B", "Sales Management", "Product Knowledge", "Marketing", "Account Management", "Sales Strategy", "Relationship Building", "Resilience", "Strategic Thinking", "Logical Reasoning", "Goal Setting", "Time Management", "Presentation Skills", "Communication Skills", "Negotiation Skills", "Closing Skills", "Zoom", "Travel"], "url": "https://www.linkedin.com/jobs/view/3966609065"}