{"jobTitle": "Marketing Assistant", "company": {"name": "Capital - NYC", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$46,000.00 - $65,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Capital NYC is seeking a dedicated and motivated Marketing Assistant to join our dynamic team. The successful candidate will assist in the development and execution of marketing strategies, help manage digital marketing campaigns, and support overall brand promotion. This role requires a proactive individual with a keen eye for detail and a passion for marketing.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Assist in the creation and implementation of marketing strategies and campaigns.</li><li>Support the marketing team with administrative tasks and project management.</li><li>Conduct market research to identify new opportunities and trends.</li><li>Help manage social media accounts, including content creation and scheduling.</li><li>Coordinate events, promotions, and other marketing activities.</li><li>Prepare marketing reports and presentations.</li><li>Collaborate with other departments to ensure cohesive brand messaging.</li><li>Maintain and update the marketing database.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor’s degree in Marketing, Business, or related field.</li><li>Previous experience in a marketing role is preferred.</li><li>Strong written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).</li><li>Familiarity with digital marketing tools and platforms.</li><li>Ability to work independently and as part of a team.</li><li>Excellent organizational and multitasking abilities.</li><li>Creative thinking and problem-solving skills.<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Competitive salary range of $46,000 - $65,000 per year.</li><li>Health, dental, and vision insurance.</li><li>401(k) retirement plan with company match.</li><li>Paid time off and holidays.</li><li>Professional development opportunities.</li><li>Collaborative and supportive work environment.<br/><br/></li></ul><strong>Application Instructions:<br/><br/></strong>To apply for this position, please submit your resume and a cover letter outlining your qualifications and interest in the role. Additionally, while not mandatory, we encourage you to include a short video introduction to help us get to know you better and understand your passion for marketing. This video can give you an extra edge in the selection process.<br/><br/>Capital NYC is an equal opportunity employer and values diversity in the workplace. We look forward to receiving your application and potentially welcoming you to our team!<br/><br/><strong><br/><br/><strong><strong> <br/><br/></strong></strong><strong><strong><strong> 4o<br/><br/></strong></strong></strong></strong>", "responsibilities": "Assist in the creation and implementation of marketing strategies and campaigns. Support the marketing team with administrative tasks and project management. Conduct market research to identify new opportunities and trends. Help manage social media accounts, including content creation and scheduling. Coordinate events, promotions, and other marketing activities. Prepare marketing reports and presentations. Collaborate with other departments to ensure cohesive brand messaging. Maintain and update the marketing database.", "qualifications": {"required": "Bachelor’s degree in Marketing, Business, or related field. Previous experience in a marketing role is preferred. Strong written and verbal communication skills. Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint). Familiarity with digital marketing tools and platforms. Ability to work independently and as part of a team. Excellent organizational and multitasking abilities. Creative thinking and problem-solving skills.", "preferred": ""}, "skills": ["Marketing", "Digital Marketing", "Social Media", "Market Research", "Project Management", "Microsoft Office", "Communication", "Teamwork", "Organization", "Multitasking", "Problem Solving"], "postedDate": "1 month ago", "benefits": "Competitive salary range of $46,000 - $65,000 per year. Health, dental, and vision insurance. 401(k) retirement plan with company match. Paid time off and holidays. Professional development opportunities. Collaborative and supportive work environment.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3966413857"}