{"jobTitle": "Financial Analyst", "company": {"name": "Lincoln Property Company", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$80,000—$80,000", "currency": "USD"}, "jobFunction": "Finance", "industry": "Real Estate", "description": "<strong>Lincoln Property Company does not accept unsolicited resumes from third-party recruiters unless they were contractually engaged by Lincoln Property Company to provide candidates for a specified opening. Any such employment agency, person or entity that submits an unsolicited resume does so with the acknowledgement and agreement that Lincoln Property Company will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity. At this time, we are not working with any agencies.</strong><p><br/></p><p><strong>Lincoln Property Company</strong> is seeking a talented Financial Analyst to join our growing team and support our acquisition and development efforts across the West Coast. This role will be in-office and based out of our Los Angeles Regional office in El Segundo, CA.</p><p>In this critical role, you will play a vital part in identifying, underwriting, and executing on real estate acquisitions and developments across various product types. You will collaborate closely with regional partners and acquisition teams throughout the entire deal lifecycle, from sourcing new opportunities to due diligence, closing, and some asset management.</p><p><br/></p><p><strong>Responsibilities</strong></p><ul><li>Underwrite new acquisition and development opportunities across various product types (office, mixed-use, industrial, retail) and submarkets.</li><li>Assist regional partners and acquisition teams with sourcing new deals, working through Due Diligence/Closing.</li><li>Develop and implement business plans for acquired assets.</li><li>Assist with disposition strategies and activities for assets approaching the end of their investment hold period.</li><li>Conduct market research and analysis to stay current on market trends and economic conditions.</li><li>Prepare financial models, presentations, and reports to support investment decisions.</li></ul><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree in Finance, Real Estate, or related field.</li><li>1-2 years of experience in real estate financial analysis or a similar role (including summer internships).</li><li>Strong analytical skills with proficiency in financial modeling (e.g., Excel, Argus).</li><li>Excellent communication and interpersonal skills.</li><li>Ability to work independently and collaboratively in a fast-paced environment.</li><li>Strong work ethic and a commitment to excellence.</li></ul><p><br/></p><p>Pay Range</p><p>$80,000—$80,000 USD (plus \"Market bonus\")</p><p><br/></p><p><strong>About Lincoln Property Company</strong></p><p>Lincoln Property Company (“Lincoln”) is one of the largest private real estate firms in the United States. Offering a fully integrated platform of real estate services and innovative solutions to owners, investors, lenders and occupiers, Lincoln supports the entire real estate lifecycle across asset types, including office, life science, retail, industrial, data center, production studio, healthcare, government, universities, and mixed-used properties, throughout the United States, United Kingdom, and Europe. Lincoln’s combined management and leasing portfolio on behalf of institutional clients includes more than 510 million square feet of commercial space. In addition to providing third-party real estate services, Lincoln has completed over 150 million square feet of development since its inception in 1965 and has another $20 billion currently under construction or in the pipeline.</p><p><br/></p><p><strong>All job offers are contingent on completion of a background check and proof of eligibility to work in the United States.</strong></p><p><br/></p><p>By submitting your information or resume in response to this opportunity, you acknowledge that your personal information will be handled in accordance with LPC West’s privacy policy.</p>", "responsibilities": "Underwrite new acquisition and development opportunities across various product types (office, mixed-use, industrial, retail) and submarkets. Assist regional partners and acquisition teams with sourcing new deals, working through Due Diligence/Closing. Develop and implement business plans for acquired assets. Assist with disposition strategies and activities for assets approaching the end of their investment hold period. Conduct market research and analysis to stay current on market trends and economic conditions. Prepare financial models, presentations, and reports to support investment decisions.", "qualifications": {"required": "Bachelor's degree in Finance, Real Estate, or related field. 1-2 years of experience in real estate financial analysis or a similar role (including summer internships). Strong analytical skills with proficiency in financial modeling (e.g., Excel, Argus). Excellent communication and interpersonal skills. Ability to work independently and collaboratively in a fast-paced environment. Strong work ethic and a commitment to excellence."}, "skills": ["Financial Modeling", "Excel", "Argus", "Real Estate", "Market Research", "Financial Analysis", "Communication", "Interpersonal Skills"], "postedDate": "2 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3966675086"}