{"jobTitle": "Sales Associate", "company": {"name": "MOCA | The Museum of Contemporary Art", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "18.97", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Museums", "description": "The MOCA Store Sales Associate provides customer service, completes sales transactions, maintains the physical appearances of stores, and completes opening and closing procedures. The Sales staff follows daily performance guidelines provided by management and are expected to work collegially as part of the Retail Operations Department.<br/><br/>This is a part-time position requiring you to work onsite. Weekend work will be required.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Work closely with the Sales Manager, Retail Coordinator, Webstore, Shipping Coordinator, and fellow Sales Associates. </li><li>Use your creative eye to maintain unique shop displays. </li><li>Interact positively with museum staff, donors, and museum visitors. </li><li>Meet and greet customers. </li><li>Guide and assist customers with sales of our unique selection of products and publications. </li><li>Grow knowledge of art books and products. </li><li>Operate Point of Sale cash registers with accuracy and process special orders. </li><li>Complete clear and accurate end of day sales reports. </li><li>Maintain communication with supervisors and colleagues. </li><li>Assist in all aspects of keeping the MOCA Store looking smart, sophisticated, interesting and well organized. </li><li>Promote sales of Museum Memberships through the Store and process appropriate paperwork. Interact with the public and answer or direct questions regarding the Museum. </li><li>Have a neat and professional appearance according to MOCA Store dress code. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Effective customer service-oriented interpersonal skills. </li><li>Promptness and reliability are essential. </li><li>Accuracy in cash handling.</li><li>Prior retail experience is preferred. </li><li>Availability to work Saturdays or Sundays, plus two additional weekdays with the opportunity to work additional hours. </li><li>Ability to work independently. </li><li>Knowledge of, or interest in contemporary art. <br/><br/></li></ul><strong>Hourly Rate: $18.97 per hour<br/><br/></strong>This position is covered by MOCA/AFSCME Collective Bargaining Unit Agreement: <strong>Yes<br/><br/></strong><strong>Physical Demands<br/><br/></strong>While performing the essential functions of this job, the incumbent must be able to do the following: stand for extended periods; bend and reach for filing and other job-related functions; climb up and down stairs; bend, stoop, and lift to move and retrieve materials; pull, push, and lift; reach both above and below shoulder height. Specific visual abilities include close vision, color vision, depth perception, and the ability to adjust focus. Must be able to visually inspect work. Manual dexterity to operate computer and other office equipment required. Heavy usage of computers and phones required.<br/><br/>The physical demands described above are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made.<br/><br/>The Museum of Contemporary Art is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, creed, color, national origin, ancestry, disability, medical condition, genetic information, marital status, sex (including pregnancy, childbirth, breastfeeding, and related medical conditions), gender, gender identity, gender expression, age, sexual orientation, military status, veteran status or any other status protected under applicable federal, state or local laws. Our policy reflects and affirms the Museum of Contemporary Arts commitment to the principles of fair employment and the elimination of all discriminatory practices.<br/><br/>Research shows that women and individuals from underrepresented backgrounds often apply to jobs only if they meet 100% of the qualifications. We recognize that it is highly unlikely that an applicant meets 100% of the qualifications for a given role. Therefore, if much of this job description describes you, then you are highly encouraged to apply for this role.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3966170745"}