{"jobTitle": "Global Account Director", "company": {"name": "Ludeo", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Computer Games", "description": "<strong>About Ludeo<br/><br/></strong>Ludeo is a hyper-growth startup in the gaming industry that is revolutionizing the way players discover and engage with games. Now and for the first time, gamers can share their most thrilling gameplay moments with everyone and everywhere and allow others to PLAY them, not only watch them as video clips.<br/><br/>Ludeo’s vision is to become the world’s first playable social media platform for gamers where they can frictionlessly discover gaming content.<br/><br/><strong>About The Role<br/><br/></strong>We are seeking a Global Account Director with a hands-on approach. This role will focus on building our Customer Success unit from scratch, and up to the best delivery of customer satisfaction, retention, and growth.<br/><br/>In this role, you will report directly to Ludeo CEO, bringing in best practices of customer success that align with our business goals. You will build relationships with Ludeo prospects and deliver a smooth and frictionless experience that allows great collaboration and future growth for publishers, ensuring more games utilize Ludeo experience for gamers.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Build a Customer Success Management strategy from scratch. Bring in methodologies and best practices to achieve customer satisfaction, while dealing with challenges, finding resolutions, and focusing on the future growth of both sides. </li><li>Engage with key client accounts (game studios) through a professional and consultative approach, drawing from an up-to-date knowledge of the studio and their games. Be the first touch for all accounts ensuring their issues and concerns are addressed in a timely and effective manner. </li><li>Identify opportunities for customers to gain more value from Ludeo product, leading to potential upsell.</li><li>Achieve a high level of customer satisfaction with clients in both products and services. Develops effective working relationships with executives, key management, and key decision makers for each assigned game studio account while fostering open and direct two-way communication. </li><li>Ensures key clients have a strong understanding of the product and best practices for utilizing the features of Ludeo and liaise closely with Ludeo marketing team for all best practices for studios using Ludeo activations. </li><li>Monitor and report on game activations with Ludeo, and work closely with the game studio and Ludeo management to best convert results to product enhancement to improve Ludeo product offering. </li><li>Responsible for identifying and engaging the appropriate KPIs including effectively resolving client issues and taking advantage of business opportunities, such as Training, Sales, Customer Support, R&amp;D, and Compliance. <br/><br/></li></ul>Requirements:<br/><br/><ul><li>Extensive proven experience in a customer success leadership role proficient in the game industry. </li><li>At least 5 years of experience in a senior leadership role.</li><li>Proven track record of building Customer Success Strategy, and bringing in methodologies of Customer Success Management. </li><li>Exceptional negotiation, strategic planning, and relationship management skills with a consistent focus on upsell and growth. </li><li>Exceptional leadership skills with a hands-on approach and willingness to work in a high-velocity and high-activity environment.</li><li>Strong analytical skills, with the ability to translate complex data into actionable strategies.</li><li>Proactive problem solver with a customer-centric mindset and a passion for delivering exceptional customer experiences. </li><li>Excellent communication and interpersonal skills, adept at building relationships with a diverse range of stakeholders and delivering amazing results through cross team collaboration.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3966874747"}