{"jobTitle": "Director, Sourcing", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$140,000.00 - $210,000.00", "currency": "USD"}, "jobFunction": "Finance", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Each day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Job Description<br/><br/></strong>This job is a strategic partner with Finance and operating divisions in UPR to obtain optimum operating efficiency and maximum profit contribution in the procurement of goods and services needed at Universal Parks and Resorts. The leader in this role continuously sources out qualified vendors to deliver the best quality products and services within the budget allocated to the procurement. It minimizes the procurement cost metrics. The role will have direct category oversight in various key areas that assist in the operation of Universal Studios Hollywood including OS&amp;E, Technical Services, Service Agreements, Facilities and Construction. This position will also support various needs for Universal’s New Business Ventures including Universal Horror Unleashed in Las Vegas, Nevada and Universal Kids Resort in Frisco, Texas.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Leads UPR sourcing in the areas of facilities, construction, operating suppliers and equipment. Entertainment (Production, equipment and rigging) and sales &amp; marketing services (Print, Digital services). Spend profile +$400MM.</li><li>Sources out vendors to deliver quality items within the planned budget, continually seeks less expensive sources while maintaining product quality. Utilizes partnership with UDX global sourcing teams to further reduce procurement costs. Manages the procurement function to the plan. Implements annual procurement initiatives and ensures buying staff is actively and regularly interacting with appropriate cost controllers.</li><li>Responsible for developing and implementing sourcing plan to achieve savings targets in specified category groups.</li><li>Establishes overall governing process for procedures, systems, quality standards, and best practices to optimize the management of vendor spend and vendor relationships and supplier diversity programs.</li><li>Implements and directs overall sourcing vision, strategies, expected outcomes and objectives for the long range sourcing plan. This include end to end management of procurement systems, metrics and key dashboards.</li><li>Working with key business stakeholders and business peers to innovative solutions to their procurement needs. This will include compiling financial scenario model to develop optimal TCO.</li><li>Oversees the development and tracking of key sourcing projects to ensure sourcing team delivers exception value to key business stakeholders.</li><li>Manage, train and develop the procurement staff.</li><li>Understand and actively participate in Environmental, Health &amp; Safety responsibilities by following established UO policy, procedures, training and team member involvement activities.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>10-15 Years: Purchasing experience; or equivalent combination of education and experience.</li><li>Bachelor’s degree from a four year college or university in Business/Finance. Masters degree required.</li><li>Professional certifications such as Certified Purchasing Management (CPM) or Certification in Production and Inventory Management (CPIM) are preferred.</li><li>Success criteria includes, but is not limited to, spend management / reduction, driving global adoption of tools and process, integration of direct and indirect procurement, advancing our capabilities, growing our team’s talent and building a unified sourcing team for parks.</li><li>Experience managing large-scale projects.</li><li>Exceptional project management/team leadership skills evidenced by a track record of success leading engagements or other problem-solving initiatives</li><li>Experience developing and implementing KPI’s to track goals.</li><li>Strong communication skills within and across teams, up through executive channels and across vendors and third parties.</li><li>Experience in planning, facilitating, and managing change</li><li>Excellent oral/written communication and presentation skills are mandatory. Strong executive presence.</li><li>Proven ability to negotiate and influence decisions at senior and executive management levels and within a matrix organization</li><li>Ability to develop and maintain positive working relationships with internal business partners and external suppliers</li><li>Ability to develop and implement innovative sourcing strategies generating cost savings and process improvements</li><li>Strong written and verbal communication skills and leadership presence</li><li>Business and financial acumen to understand, communicate, and develop complex, integrated, sourcing and business strategies.</li><li>Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/></li></ul>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $140,000 - $210,000<br/><br/><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "<ul><li>Leads UPR sourcing in the areas of facilities, construction, operating suppliers and equipment. Entertainment (Production, equipment and rigging) and sales &amp; marketing services (Print, Digital services). Spend profile +$400MM.</li><li>Sources out vendors to deliver quality items within the planned budget, continually seeks less expensive sources while maintaining product quality. Utilizes partnership with UDX global sourcing teams to further reduce procurement costs. Manages the procurement function to the plan. Implements annual procurement initiatives and ensures buying staff is actively and regularly interacting with appropriate cost controllers.</li><li>Responsible for developing and implementing sourcing plan to achieve savings targets in specified category groups.</li><li>Establishes overall governing process for procedures, systems, quality standards, and best practices to optimize the management of vendor spend and vendor relationships and supplier diversity programs.</li><li>Implements and directs overall sourcing vision, strategies, expected outcomes and objectives for the long range sourcing plan. This include end to end management of procurement systems, metrics and key dashboards.</li><li>Working with key business stakeholders and business peers to innovative solutions to their procurement needs. This will include compiling financial scenario model to develop optimal TCO.</li><li>Oversees the development and tracking of key sourcing projects to ensure sourcing team delivers exception value to key business stakeholders.</li><li>Manage, train and develop the procurement staff.</li><li>Understand and actively participate in Environmental, Health &amp; Safety responsibilities by following established UO policy, procedures, training and team member involvement activities.</li><li>Perform other duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "10-15 Years: Purchasing experience; or equivalent combination of education and experience.\nBachelor’s degree from a four year college or university in Business/Finance. Masters degree required.\nExperience managing large-scale projects.\nExceptional project management/team leadership skills evidenced by a track record of success leading engagements or other problem-solving initiatives\nExperience developing and implementing KPI’s to track goals.\nStrong communication skills within and across teams, up through executive channels and across vendors and third parties.\nExperience in planning, facilitating, and managing change\nExcellent oral/written communication and presentation skills are mandatory. Strong executive presence.\nProven ability to negotiate and influence decisions at senior and executive management levels and within a matrix organization\nAbility to develop and maintain positive working relationships with internal business partners and external suppliers\nAbility to develop and implement innovative sourcing strategies generating cost savings and process improvements\nStrong written and verbal communication skills and leadership presence\nBusiness and financial acumen to understand, communicate, and develop complex, integrated, sourcing and business strategies.\nHybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/>", "preferred": "Professional certifications such as Certified Purchasing Management (CPM) or Certification in Production and Inventory Management (CPIM) are preferred."}, "skills": ["Purchasing", "Procurement", "Sourcing", "Project Management", "Team Leadership", "KPI", "Communication", "Negotiation", "Influence", "Business Acumen", "Financial Acumen", "Strategic Planning", "Change Management"], "postedDate": "1 month ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3966095377"}