{"jobTitle": "Gestionnaire principal, Relations aux employés /Senior Manager, Employee Relations", "company": {"name": "Amazon", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources and Information Technology", "industry": "Software Development", "description": "L'équipe des relations aux employés d'Amazon soutient les employés des opérations d'Amazon Amérique du Nord et les dirigeants sur le terrain, et nous sommes à la recherche d'un directeur des relations aux employés pour rejoindre notre équipe. Le candidat retenu aura démontré sa capacité à i) évaluer rapidement les données, les lieux de travail, les comportements et les relations afin d'identifier les risques et les lacunes dans l'environnement de travail ; ii) développer et exécuter des initiatives, des mécanismes et des programmes durables et évolutifs qui entraînent des changements durables à tous les niveaux ; iii) influencer les dirigeants afin d'obtenir l'alignement, le soutien et les agents de changement ; et iv) diriger et développer une équipe de professionnels des relations avec les employés. Le titulaire du poste possède une grande expertise en matière de relations sociales et d'emploi, un excellent jugement et des compétences analytiques et de communication très développées. Il sera placé sous la responsabilité directe d'un directeur des relations avec les employés et constituera un membre clé de l'équipe de direction des relations avec les employés pour l'Amérique du Nord. Il s'agit d'un poste à temps plein qui peut nécessiter des déplacements importants, jusqu'à 50 % du temps au cours de l'année, sur les différents sites d'Amazon.<br/><br/>Puisque ce rôle nécessite que l’employé interagisse avec d’autres entités d’Amazon à l’échelle mondiale ainsi qu’avec des employés et intervenants dans d’autres provinces canadiennes, la connaissance du français et de l’anglais est exigée pour ce poste.<br/><br/>The Amazon Employee Relations team supports Amazon North America operations employees and field leaders and we are seeking an Employee Relations Principal to join our team. The successful candidate will have a demonstrated ability to i) quickly assess data, workplaces, behaviors, and relationships to identify risks and gaps in the work environment; ii) develop and execute sustainable, scalable initiatives, mechanisms, and programs that affect long-lasting changes at all levels; iii) influence leaders to win alignment, support, and change agents; and iv) lead and develop a team of employee relations professionals. The Principal will possess significant employee and labor relations expertise, excellent judgment, and highly-developed analytical and communication skills. The Principal will report directly to an Employee Relations Director and serve as a key member of the North America Employee Relations leadership team. This is a full-time position that may require significant travel, up to 50% of the time over the course of the year to the various Amazon locations.<br/><br/>Due to the nature of the role that requires interaction with other Amazon entities globally and with Amazon employees and stakeholders in other provinces in Canada, bilingualism French and English is required for this position<br/><br/>Key job responsibilities<br/><br/>Détection et mitigation des risques : Appliquer l'expertise en matière de relations sociales pour identifier avec succès les tendances et les défis, prévoir et atténuer les risques, et élaborer et mettre en œuvre des stratégies et des programmes axés sur les solutions.<br/><br/><ul><li> Gestion des crises : Travailler de manière réactive sur des questions relatives à des partenaires en situation de crise, dans des délais extrêmement courts, tout en faisant preuve d'un excellent jugement et d'un grand sens de l'initiative.</li><li> Gestion de projets : Concevoir, prendre en charge et diriger avec succès des projets à grande échelle et à l'échelle du réseau qui améliorent l'expérience des partenaires de première ligne.</li><li> Analyser et interpréter les données : Faire preuve d'une grande capacité d'analyse en utilisant des données et des anecdotes pour élaborer des récits et des recommandations convaincants ; capacité démontrée à définir et à mesurer le succès des programmes.</li><li> Proposer des solutions innovantes : Remettre en question les pratiques actuelles, le statu quo de l'industrie et générer des mécanismes créatifs qui apportent des solutions à grande échelle.</li><li> Communiquer efficacement : Produire rapidement des communications écrites de haute qualité qui analysent les problèmes de manière concise et font passer les solutions du concept à l'exécution.</li><li> Diriger par l'intermédiaire des autres : Établir des relations constructives avec les parties prenantes et les pairs afin de partager l'information, d'influencer le changement et de tirer parti des ressources pour obtenir des résultats.</li><li> Résoudre les problèmes : Travailler de manière indépendante avec une supervision minimale, dans des situations ambiguës, et persévérer face aux obstacles internes et externes pour trouver des solutions.</li><li> Travailler à l'échelle : Concevoir des solutions pour une personne, une station ou une situation unique, puis traduire, concevoir et lancer des mécanismes durables pour des réseaux entiers.<br/><br/></li></ul>Embaucher et développer les meilleurs : diriger le développement et la croissance de notre équipe de relations avec les employés dans les régions.<br/><br/>Risk Detection and Mitigation: Apply employee and labor relations expertise to successfully identify trends and challenges, predict and mitigate risk, and develop and execute solution-focused strategies and programs<br/><br/><ul><li> Crisis Management: Work reactively on crisis-oriented partner issues under extreme time limitations while exercising excellent judgment and leadership</li><li> Project Management: Independently design, own, and lead successfully large-scale, network-wide projects that improve frontline partner experience</li><li> Analyze and Interpret Data: Exercise strong analytical skills using data and anecdotes to develop persuasive narratives and recommendations; demonstrated ability to define and measure success of programs</li><li> Deliver Innovative Solutions: Challenge current practices, industry status quo, and generate creative mechanisms that bring about large-scale solutions</li><li> Communicate Effectively: Rapidly produce high-quality written communications that concisely analyze problems and move solutions from concept to execution</li><li> Lead Through Others: Build constructive relationships with critical stakeholders and peers to share information, influence change, and leverage resources to deliver results</li><li> Problem Solve: Work independently with minimal supervision, in ambiguous situations, and persevere over internal and external barriers to drive resolutions</li><li> Work at Scale: Design solutions for a single person, station, or situation then translate, design, and launch sustainable mechanisms for entire networks<br/><br/></li></ul>Hire &amp; Develop the Best: Lead the development and growth of our field employee relations team<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Baccalauréat requis</li><li> Plus de 10 ans d'expérience pertinente dans le domaine des relations avec les employés, des relations de travail, du droit du travail et de l'emploi OU plus de 10 ans d'expérience pertinente, dont plus de 1 an d'expérience chez Amazon et une ou plusieurs missions de courte durée dans le domaine des relations avec les employés d'Amazon.</li><li> Expérience avérée de la production de documents écrits à l'intention des cadres et de la présentation d'exposés devant des auditoires de cadres.</li><li> Expérience de l'accompagnement d'un grand nombre d'employés rémunérés à l'heure fortement souhaitée</li><li> Expérience réussie de la création, de l'amélioration et de l'exécution de programmes à grande échelle</li><li> Expérience de l'analyse et de l'utilisation de mesures pour identifier les vulnérabilités et améliorer l'expérience des employés.</li><li> Maîtrise de MS Excel, Word, SharePoint et PowerPoint ; curiosité pour les nouvelles technologies d'apprentissage.</li><li> Bachelor’s degree required</li><li> 10+ years of relevant experience in employee relations, labor relations, labor/employment law OR 10+ years of relevant experience to include 1+ years of Amazon experience and one or more short term assignments within Amazon employee relations</li><li> Demonstrated experience producing executive level written materials and presenting before executive audiences</li><li> Experience supporting large hourly workforces highly desired</li><li> Successful record of creating, improving and executing programs at scale</li><li> Experience analyzing and using metrics to identify vulnerabilities and drive improvements in the employee experience</li><li> Skilled in MS Excel, Word, SharePoint &amp; PowerPoint; curious about new learning technologies<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Diplôme d'études supérieures, juriste ou autre formation spécialisée dans le domaine des relations entre les travailleurs et les employés</li><li> Expérience dans le domaine de l'entreposage, de la distribution ou de la logistique.</li><li> Capacité avérée à faire preuve d'indépendance de jugement et de discrétion dans la gestion de priorités multiples et concurrentes.</li><li> Advanced degree, JD, or other specialized training in labor/employee relations</li><li> Experience in warehousing, distribution, or logistics</li><li> Demonstrated ability to exercise independent judgment and discretion in managing multiple and competing priorities<br/><br/></li></ul>Amazon s’engage à créer un milieu de travail diversifié et inclusif. Amazon est un employeur qui offre à tous les mêmes opportunités et ne fait pas de discrimination fondée sur la race, l’origine nationale, le sexe, l’identité sexuelle, l’orientation sexuelle, le statut d’ancien combattant protégé, le handicap, l’âge ou autres statuts protégés par la loi. Les personnes handicapées qui souhaitent présenter une demande d’accommodement, sont invitées à aviser leur recruteur.<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. If you would like to request an accommodation, please notify your Recruiter.<br/><br/><br/><strong>Company</strong> - Amazon Canada Fulfillment Services, ULC<br/><br/>Job ID: A2690460", "responsibilities": "Risk Detection and Mitigation: Apply employee and labor relations expertise to successfully identify trends and challenges, predict and mitigate risk, and develop and execute solution-focused strategies and programs<br/><br/><ul><li> Crisis Management: Work reactively on crisis-oriented partner issues under extreme time limitations while exercising excellent judgment and leadership</li><li> Project Management: Independently design, own, and lead successfully large-scale, network-wide projects that improve frontline partner experience</li><li> Analyze and Interpret Data: Exercise strong analytical skills using data and anecdotes to develop persuasive narratives and recommendations; demonstrated ability to define and measure success of programs</li><li> Deliver Innovative Solutions: Challenge current practices, industry status quo, and generate creative mechanisms that bring about large-scale solutions</li><li> Communicate Effectively: Rapidly produce high-quality written communications that concisely analyze problems and move solutions from concept to execution</li><li> Lead Through Others: Build constructive relationships with critical stakeholders and peers to share information, influence change, and leverage resources to deliver results</li><li> Problem Solve: Work independently with minimal supervision, in ambiguous situations, and persevere over internal and external barriers to drive resolutions</li><li> Work at Scale: Design solutions for a single person, station, or situation then translate, design, and launch sustainable mechanisms for entire networks<br/><br/></li></ul>Hire &amp; Develop the Best: Lead the development and growth of our field employee relations team", "qualifications": {"required": "Baccalauréat requis\nPlus de 10 ans d'expérience pertinente dans le domaine des relations avec les employés, des relations de travail, du droit du travail et de l'emploi OU plus de 10 ans d'expérience pertinente, dont plus de 1 an d'expérience chez Amazon et une ou plusieurs missions de courte durée dans le domaine des relations avec les employés d'Amazon.\nExpérience avérée de la production de documents écrits à l'intention des cadres et de la présentation d'exposés devant des auditoires de cadres.\nExpérience de l'accompagnement d'un grand nombre d'employés rémunérés à l'heure fortement souhaitée\nExpérience réussie de la création, de l'amélioration et de l'exécution de programmes à grande échelle\nExpérience de l'analyse et de l'utilisation de mesures pour identifier les vulnérabilités et améliorer l'expérience des employés.\nMaîtrise de MS Excel, Word, SharePoint et PowerPoint ; curiosité pour les nouvelles technologies d'apprentissage.\nBachelor’s degree required\n10+ years of relevant experience in employee relations, labor relations, labor/employment law OR 10+ years of relevant experience to include 1+ years of Amazon experience and one or more short term assignments within Amazon employee relations\nDemonstrated experience producing executive level written materials and presenting before executive audiences\nExperience supporting large hourly workforces highly desired\nSuccessful record of creating, improving and executing programs at scale\nExperience analyzing and using metrics to identify vulnerabilities and drive improvements in the employee experience\nSkilled in MS Excel, Word, SharePoint &amp; PowerPoint; curious about new learning technologies", "preferred": "Diplôme d'études supérieures, juriste ou autre formation spécialisée dans le domaine des relations entre les travailleurs et les employés\nExpérience dans le domaine de l'entreposage, de la distribution ou de la logistique.\nCapacité avérée à faire preuve d'indépendance de jugement et de discrétion dans la gestion de priorités multiples et concurrentes.\nAdvanced degree, JD, or other specialized training in labor/employee relations\nExperience in warehousing, distribution, or logistics\nDemonstrated ability to exercise independent judgment and discretion in managing multiple and competing priorities"}, "skills": ["Employee Relations", "Labor Relations", "Labor Law", "Employment Law", "Project Management", "Data Analysis", "Communication", "Problem Solving", "Leadership", "MS Excel", "Word", "SharePoint", "PowerPoint"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/3966549702"}