{"jobTitle": "Senior Financial Analyst, Studio Content", "company": {"name": "FIFTH SEASON", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Accounting/Auditing", "industry": "Entertainment Providers, Broadcast Media Production and Distribution, and Technology, Information and Media", "description": "<em>We are managing recruitment internally for this position, excluding external recruiting agencies. We kindly request that external recruiters refrain from sending unsolicited emails to our employees. Thank you for respecting our process.</em><br/>++<br/><br/>Role: Senior Financial Analyst, Studio Content<br/>Compensation: Base Salary ($85K-$95K) + Target Bonus (10%) <br/>Division: Accounting & Tax <br/>Location: Los Angeles, CA <br/><br/>Role Summary: <br/><br/>At FIFTH SEASON we're on a mission to change the world through groundbreaking entertainment. We're a team of superstars, passionate about creating innovative and compelling content that captivates audiences around the globe. <br/><br/>We are seeking a Senior Financial Analyst who will be integral to our studio content business. The ideal candidate will bring experience in general ledger accounting and analysis within the film and television industry. The candidate will ensure accurate financial reporting, compliance, and drive process improvements. <br/><br/>To excel in this role, the candidate must possess a strong foundation in accounting, preferably with Big 4 or public accounting experience. They will also bring exceptional communication and organizational skills to handle month-end and quarter-end close activities efficiently. The ideal candidate will thrive in a fast-paced environment, exhibit excellent time-management abilities, and approach challenges with a solution-oriented mindset. If you're passionate about the entertainment industry and want to make a significant impact on a global scale, we encourage you to apply. <br/><br/>Role Responsibilities: <br/><br/>Financial Reporting and Compliance <ul><li>Handle day-to-day, month-end & quarter-end close activities for our Television and Film business. Close activities include preparation of journal entries for content assets, accruals, amortization, and other adjustments to ensure compliance with US GAAP. </li><li>Review results and prepare journal entries for the consolidation of our strategic investments, including analysis of statutory to US GAAP and IFRS adjustments. </li><li>Prepare support schedules, month-end account reconciliations, and Korean SOX documentation. </li><li>Complete account research and variance analysis on assigned accounts. </li></ul><br/>Cross-Functional Collaboration <ul><li>Collaborate cross-functionally with Production Finance, FP&A, and legal to ensure completeness and accuracy of information used during the month-end close. </li><li>Assist with requests from Production Finance, FP&A, and external auditors. </li><li>Lead or contribute to ad hoc projects requiring coordination across departments. </li></ul><br/>Analysis and Problem-Solving <ul><li>Conduct account research and variance analysis to identify discrepancies and areas for improvement. </li><li>Proactively identify and address inefficiencies and challenges in the month-end close process. </li></ul><br/>Requirements: <br/><br/><ul><li>Bachelor’s degree in accounting or related field </li><li>Minimum 2-4 years’ experience in entertainment or related field in an accounting role. </li><li>Strong Microsoft Office skills including Excel and Outlook. </li><li>Experience with SAP or other ERP software. </li><li>CPA preferred. </li><li>Big 4 or public accounting experience preferred. </li><li>Ability to manage competing priorities, work independently and with a team. </li></ul><br/>Characteristics & Personality: <br/><br/><ul><li>Proficient in clear oral and written communication, fostering collaboration across organizational levels, global teams, and worldwide time zones. </li><li>Ability to adapt and learn new tasks quickly and thrive in a fast-paced environment </li></ul> <p> </p><p>In addition to the competencies above, the ideal candidate will: </p><ul><li>Embody FIFTH SEASON's commitment to fostering an inclusive, anti-racist, and feminist workplace. All candidates must have a proven track record of promoting and valuing diversity and inclusivity in previous roles, and a commitment to fostering these values in the workplace. </li></ul><br/>About Us:  <p> </p><p>FIFTH SEASON is a leading global independent studio that specializes in the development, financing, production and distribution of feature films, premium television series and documentaries for theatrical distributors, streaming platforms as well as broadcast and cable networks globally. The company is headquartered in Los Angeles, California, and operates major hubs in New York and London as well as additional offices in Europe, Asia and South America. Known for producing and distributing award-winning content that engages audiences and moves culture, the studio’s film titles include the multi-Oscar-nominated The Lost Daughter from Maggie Gyllenhaal, Ambulance directed by Michael Bay, Destin Daniel Cretton’s Just Mercy, the Book Club franchise, the Sundance Film Festival Audience Award winner Cha Cha Real Smooth, and 80 For Brady. The studio produces premium TV series including the 14-time Emmy-nominated Severance, See, and Truth Be Told for Apple TV+, Wolf Like Me for Peacock, Life & Beth, Nine Perfect Strangers, and McCartney 3, 2, 1 for Hulu, and Tokyo Vice for HBO Max. FIFTH SEASON also handles global distribution for dozens of hit series in addition to its own studio productions, including Killing Eve, The Morning Show, Normal People, and The Night Manager. </p><p> </p><p>Our Culture:  </p><p> </p><p>A studio with a soul, FIFTH SEASON is proud to be an anti-racist and feminist company, focused on leaving the entertainment business better than we found it. We empower freedom and ownership, delivering the expertise of a big studio with the entrepreneurial spirit and creativity of a start-up. </p><br/>We offer competitive compensation, benefits, and opportunities for professional growth in a dynamic and exciting industry. The ideal candidate is driven and hungry to learn and wants to be in the trenches of the entertainment industry. If you meet the above requirements and are excited about this opportunity, we invite you to apply.", "responsibilities": "Financial Reporting and Compliance \n* Handle day-to-day, month-end & quarter-end close activities for our Television and Film business. Close activities include preparation of journal entries for content assets, accruals, amortization, and other adjustments to ensure compliance with US GAAP. \n* Review results and prepare journal entries for the consolidation of our strategic investments, including analysis of statutory to US GAAP and IFRS adjustments. \n* Prepare support schedules, month-end account reconciliations, and Korean SOX documentation. \n* Complete account research and variance analysis on assigned accounts. \n\nCross-Functional Collaboration \n* Collaborate cross-functionally with Production Finance, FP&A, and legal to ensure completeness and accuracy of information used during the month-end close. \n* Assist with requests from Production Finance, FP&A, and external auditors. \n* Lead or contribute to ad hoc projects requiring coordination across departments. \n\nAnalysis and Problem-Solving \n* Conduct account research and variance analysis to identify discrepancies and areas for improvement. \n* Proactively identify and address inefficiencies and challenges in the month-end close process.", "qualifications": {"required": "Bachelor’s degree in accounting or related field \nMinimum 2-4 years’ experience in entertainment or related field in an accounting role. \nStrong Microsoft Office skills including Excel and Outlook. \nExperience with SAP or other ERP software. \nAbility to manage competing priorities, work independently and with a team.", "preferred": "CPA \nBig 4 or public accounting experience"}, "skills": ["Accounting", "Financial Analysis", "US GAAP", "IFRS", "SAP", "ERP", "Microsoft Excel", "Microsoft Outlook", "Production Finance", "Financial Reporting", "Compliance", "Variance Analysis", "Problem Solving", "Time Management", "Communication", "Teamwork", "Collaboration", "Diversity and Inclusion"], "postedDate": "2 days ago", "benefits": "Competitive compensation, benefits, and opportunities for professional growth in a dynamic and exciting industry.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3966058742"}