{"jobTitle": "Lead Auditor - IT Operational (Remote)", "company": {"name": "Mattel, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "118,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Manufacturing, Design Services, and Entertainment Providers", "description": "CREATIVITY IS OUR SUPERPOWER. It’s our heritage and it’s also our future. Because we don’t just make toys. We create innovative products and experiences that inspire, entertain and develop children through play. Mattel is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.<br/><br/><strong>The Team:<br/></strong>Mattel Finance hires leaders. Every one of our finance professionals works in a global finance organization interacting with senior leadership and with the accountability and responsibility to grow a career. We are a strong and nimble finance department focused on driving business results in the most cost-effective manner. We pride ourselves on consistent processes, fast decisions and increased accountability.<br/><br/><strong>The Opportunity:<br/></strong><strong>Open to remote but 20% travel including International is required.:<br/></strong>The Associate Manager Internal Audit will conduct the Company's IT and operational audits. Reporting to the Manager, Information Technology Audit, you will have broad exposure to the operations of the Company and will interact with personnel across IT, Finance, Legal, HR, Operations, Sales, Marketing, Brands, and Manufacturing, as well as engagement with the Company's external auditors and business advisors.<br/><br/>The Associate Manager Internal Audit will conduct integrated audits of the Company's IT operations and infrastructure globally aligned with the on-going Enterprise Risk Assessment and risk-based internal audit plan and will be responsible for executing IT and operational audits and special reviews requested by management. The incumbent will work with the Sr Manager, Information Technology Audit to execute risk-based audit plan projects and is focused on providing IT and the business with process / functional control consultation and risk management advisory leveraging IT, information security, business acumen and grounded in operational feasibility. (Remote candidates will also be considered).<br/><br/><strong>What Your Impact Will Be<br/><br/></strong><ul><li>Maintain high professional and ethical standards as set forth in Mattel's internal audit charter and the Institute of Internal Auditor's (IIA) International Professional Practice Framework (IPPF).</li><li>Demonstrate a clear understanding of IT and Operational audit domains and their application to Mattel's business landscape and enterprise IT Infrastructure.</li><li>Execute annual IT internal audit plan projects / initiatives and deliverables for review and approval by Audit Management to identify external cybersecurity and internal infrastructure/application vulnerabilities leveraging industry recognized NIST, COBIT, and COSO frameworks and awareness of emerging global IT risk trends / developments in accordance with the Department's Quality Assurance and Improvement Program (QAIP) and review and approval by Audit Management.</li><li>Draft audit and assessment findings and recommended action plans to address areas of risk exposure for communication with auditees and IT management.</li><li>Maintain and cultivate relationships with appropriate personnel from across IT, business units, and operating functions, developing an understanding of key factors and risk drivers impacting the IT environment.</li><li>Proven expertise in pre-implementation assessments of new or upgraded ERP systems to ensure internal controls have been properly designed and adequate validation to support delivery of business objectives.</li><li>Assist Audit Management with developing and delivering value-enhancing data analytics through deployment and maintenance of associated infrastructure and applications.</li><li>Support Financial and Operational auditors with delivering and leveraging technology and digital capabilities for the development and maintenance of continuous monitoring and risk management.</li><li>Support special audits and investigations assigned by Management.</li><li>Execute IT audit activity in coordination with external auditors to maximize audit efficiency and risk coverage.</li><li>Keep abreast of new auditing, IT, regulatory or other developments as well as IT risks including cybersecurity that may impact the organization and audit area considerations.</li><li>Assist with any IT SOX testing, as required.<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Bachelor's degree in MIS, IT, Information Security, or other related IT field required.</li><li>Active CISA required. </li><li>CISSP, CIA or CPA active certifications will also be considered. </li><li>5+ years of experience with Big 4, internal audit or audit-related field strongly preferred.</li><li>Prior execution of operational IT and operational business process audits strongly preferred </li><li>Strong collaboration and team engagement to deliver set objectives and value-added results.</li><li>Proven ability to work with and communicate effectively across all levels of the organization.</li><li>Solid verbal and written communication skills.</li><li>Exposure with evaluating controls and control gaps associated with complex business processes and developing practical and cost-effective business solutions.</li><li>Experience conducting end-to-end audit engagements (i.e., planning, coordination, execution, socialization, workpaper finalization, report preparation / finalization / distribution.</li><li>Developed analytical, organizational and presentation skills.</li><li>Ability to travel domestically and internationally up to 20%.<br/><br/></li></ul>The annual base salary range for this position is between 118,000 and 140,000. <strong>**This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience</strong>.<br/><br/>Don’t meet every single requirement? At Mattel we are dedicated to building a diverse and inclusive workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>What It’s Like To Work Here<br/><br/></strong>We are a purpose driven company aiming to empower the next generation to explore the wonder of childhood and reach their full potential. We live up to our purpose employing the following behaviors<br/><br/><ul><li>We collaborate Being a part of Mattel means being part of one team with shared values and common goals. Every person counts and working closely together always brings better results. Partnership is our process and our collective capabilities is our superpower.</li><li>We innovate At Mattel we always aim to find new and better ways to create innovative products and experiences. No matter where you work in the organization, you can always make a difference and have real impact. We welcome new ideas and value new initiatives that challenge conventional thinking.</li><li>We execute We are a performance driven company. We strive for excellence and are focused on pursuing best in class outcomes. We believe in accountability and ownership and know that our people are at their best when they are empowered to create and deliver results.<br/><br/></li></ul><strong>Our Approach to Hybrid Work<br/><br/></strong>We embrace a hybrid work model to empower a culture of growth, optimism, and wellbeing, where everyone can deliver on our shared purpose and realize their full potential. Combining purposeful in-person collaboration with tech-enabled hybrid work, our focus is to provide flexibility while enabling collaboration for moments that matter.<br/><br/><strong>Who We Are<br/><br/></strong>Mattel is a leading global toy company and owner of one of the strongest catalogs of children’s and family entertainment franchises in the world. We create innovative products and experiences that inspire, entertain and develop children through play. We engage consumers through our portfolio of iconic brands, including Barbie, Hot Wheels, Fisher-Price, American Girl, Thomas &amp; Friends, UNO and MEGA, as well as other popular intellectual properties that we own or license in partnership with global entertainment companies. Our offerings include film and television content, gaming, music and live events. We operate in 35 locations and our products are available in more than 150 countries in collaboration with the world’s leading retail and ecommerce companies. Since its founding in 1945, Mattel is proud to be a trusted partner in empowering children to explore the wonder of childhood and reach their full potential.<br/><br/>Mattel is recognized for the second year in a row as a Great Place to Work™ and as one of Fast Company’s Best Workplaces for Innovators in 2022.<br/><br/>Visit us at https //jobs.mattel.com/ and www.instagram.com/MattelCareers .<br/><br/>Mattel is an Affirmative Action/Equal Opportunity Employer where we want you to bring your authentic self to work every day. We welcome all job seekers including minorities, females, veterans, individuals with disabilities, and those of all sexual orientations and gender identities.", "responsibilities": "The Associate Manager Internal Audit will conduct the Company's IT and operational audits. Reporting to the Manager, Information Technology Audit, you will have broad exposure to the operations of the Company and will interact with personnel across IT, Finance, Legal, HR, Operations, Sales, Marketing, Brands, and Manufacturing, as well as engagement with the Company's external auditors and business advisors.<br/><br/>The Associate Manager Internal Audit will conduct integrated audits of the Company's IT operations and infrastructure globally aligned with the on-going Enterprise Risk Assessment and risk-based internal audit plan and will be responsible for executing IT and operational audits and special reviews requested by management. The incumbent will work with the Sr Manager, Information Technology Audit to execute risk-based audit plan projects and is focused on providing IT and the business with process / functional control consultation and risk management advisory leveraging IT, information security, business acumen and grounded in operational feasibility. (Remote candidates will also be considered).", "qualifications": {"required": "Bachelor's degree in MIS, IT, Information Security, or other related IT field required.\nActive CISA required. \n5+ years of experience with Big 4, internal audit or audit-related field strongly preferred.\nPrior execution of operational IT and operational business process audits strongly preferred \nStrong collaboration and team engagement to deliver set objectives and value-added results.\nProven ability to work with and communicate effectively across all levels of the organization.\nSolid verbal and written communication skills.\nExposure with evaluating controls and control gaps associated with complex business processes and developing practical and cost-effective business solutions.\nExperience conducting end-to-end audit engagements (i.e., planning, coordination, execution, socialization, workpaper finalization, report preparation / finalization / distribution.\nDeveloped analytical, organizational and presentation skills.\nAbility to travel domestically and internationally up to 20%.", "preferred": "CISSP, CIA or CPA active certifications will also be considered."}, "skills": ["IT", "Information Security", "Internal Audit", "Cybersecurity", "Risk Management", "Data Analytics", "SOX", "Collaboration", "Communication", "Presentation Skills"], "postedDate": "1 week ago", "benefits": "The annual base salary range for this position is between 118,000 and 140,000. **This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience**.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3966776030"}