{"jobTitle": "Maintenance Supervisor (On-site)", "company": {"name": "Lief Labs", "industry": "Wellness and Fitness Services", "size": "Not specified", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$77,000.00 - $84,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wellness and Fitness Services", "description": "Lief Labs is a premier formulation and product development innovator and manufacturer of dietary supplements. Our in-house Product Development and R&D team create the best-tasting and most cutting-edge formulations of supplements. Lief also houses a state-of-the-art, full-service Current Good Manufacturing Practice (cGMP) manufacturing facility, which offers custom solutions for a multitude of supplement categories. Lief collaborates with entrepreneurial firms to help them build premier brands. Our turnkey solutions allow us to engage in seamless partnerships that help brands with scalability and sustainable growth. Lief Labs is located in the Santa Clarita Valley (Valencia, CA). All roles are on-site Monday – Friday.", "responsibilities": "Leads safety process and drives safety throughout the maintenance department and the organization. Executes Maintenance plan while aligning teams’ goals and KPIs to meet this plan. Develop and mentor associates to ensure the team’s KPIs are met in safety, quality, productivity, and cost. Lead cross training plan that builds flexibility and the skills necessary to achieve department goals and KPIs. Leads and participates in root cause problem solving activities when KPIs are not met to drive sustained improvement. Conducts robust quality CAPA investigations when quality standards and expectations are not met. Coaches and develops team on continuous improvement, kaizen, and autonomous maintenance projects. Proactively works cross functionally with other departments when issues arise that prevent the department from achieving goals. Supports change management communication plans in for major organizational and process changes. Performs additional duties as assigned.", "qualifications": {"required": "Bachelor’s Degree preferred. A minimum of 2-3 years’ experience in maintenance management. Lean Six Sigma or Continuous improvement certification and or experience preferred. cGMPS in a regulated environment. OSHA and EPA regulations. Proficiency in ERP systems, SAP preferred. Proficiency in CMMS and inventory management. Proficiency in MS Excel, Work and PowerPoint. Strong knowledge of mechanical/electrical troubleshooting with the ability to mentor and develop team members.", "preferred": "Bilingual in English and Spanish preferred. Strong organizational skills with the ability to manage multiple priorities in a fast-paced environment. Experience in driving sustained improvements through establishing a culture of accountability. Experience in developing and building high performing teams through employee engagement and cross training. Strong analytical and root cause problem solving skills. Strong communication and change management skills. Ability to coach, develop and mentor team. Strong employee relations skills. Verbal Communication. Written Communication. Relationship Management. Quality Orientation. Ability to interact at all levels. Flexibility/ adaptability/ multi-tasking."}, "skills": ["Problem Solving", "Bilingual in English and Spanish", "Strong organizational skills", "Experience in driving sustained improvements", "Experience in developing and building high performing teams", "Strong analytical and root cause problem solving skills", "Strong communication and change management skills", "Ability to coach, develop and mentor team", "Strong employee relations skills", "Verbal Communication", "Written Communication", "Relationship Management", "Quality Orientation", "Ability to interact at all levels", "Flexibility/ adaptability/ multi-tasking"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, wellness benefits, education reimbursement program, and PTO. This position is bonus eligible.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3966058157"}