{"jobTitle": "Sales Associate / Design Consultant - Full Time", "company": {"name": "Arhaus", "industry": "Retail"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22,000.00/yr - 350,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong>Arhaus was founded in 1986 on a simple idea: Furniture and décor should be sustainably sourced, lovingly made, and built to last. Today, we partner with artisans around the world who share our vision, creating beautiful, heirloom-quality pieces that can be used—and loved—for generations.<br/><br/>The Design Consultant maximizes sales and consistently delivers an exceptional guest experience. This individual is an enthusiastic representative of the Arhaus brand. Design Consultants utilize our selling model to close transactions and are responsible for conducting business according to all company standards, policies and procedures. The Design Consultant supports an exceptional guest experience at all times. If this sounds like the type of environment that you would thrive in, we invite you to apply for our open position at<strong> Thousand Oaks! <br/><br/></strong>As a Design Consultant, you will be providing customer service and space planning assistance, as well as maintaining a sales driven focus.<br/><br/>If this sounds like the type of environment that you would thrive in, we invite you to apply for our open Full-Time position in STORE LOCATION!<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Meets required monthly sales and productivity standards</li><li> Continually develops enhanced selling behaviors according to our selling model</li><li> Demonstrates strong product knowledge</li><li> Maintains a guest book to organize, generate and cultivate business</li><li> Performs proactive and consistent follow-up with all guests before and after the sale and at delivery</li><li> Works to improve performance based on feedback provided by store management</li><li> Promptly solves guest concerns</li><li> Performs all opening and closing duties as directed</li><li> Accurately performs all systems functions and maintain operational standards</li><li> Responsible for recording all hours worked</li><li> Reviews and acts upon all email and company communications</li><li> Participates in weekly one on ones and team meetings</li><li> Works in collaboration with all team members<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Driven to achieve sales goals</li><li> Demonstrates knowledge and passion for company products and services</li><li> Strong organizational, time management, technological and communication skills</li><li> Works well independently and collaboratively</li><li> Ability to deliver high-quality guest relations</li><li> Sales skills, sense of design or related experience preferred</li><li> Professional appearance and demeanor</li><li> Flexible schedule that meets the needs of the business (including evenings, weekends, and holidays)<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li> $22,000 (lowest hourly base) - $350,000 annual</li><li> Includes minimum hourly base plus commission and (if achieved) Monthly Sales Incentives and Quarterly Bonuses</li><li> Commission (plan is tiered and UNLIMITED) is paid on net WRITTEN sales for the calendar month and is based on several factors including, but not limited to, experience, store volume, and location<br/><br/></li></ul><strong>Employee Benefits<br/><br/></strong><ul><li> Exceptional advancement opportunities</li><li> Competitive earnings, bonus opportunities, and generous employee discount</li><li> Medical, dental, and life insurance benefits (offerings differ between full-time and part-time status)</li><li> Flex spending plan</li><li> 401K retirement program and 529 college savings plan</li><li> Paid vacations and holidays (Full-time employees only)<br/><br/></li></ul>Arhaus is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind. Arhaus is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Arhaus are based on business needs, job requirements, and individual qualifications, without regard to race, color, sex, sexual orientation, gender identity, religion or belief, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Arhaus will not tolerate discrimination or harassment based on any of these characteristics. Arhaus encourages applicants of all ages.<br/><br/>", "responsibilities": "Meets required monthly sales and productivity standards\nContinually develops enhanced selling behaviors according to our selling model\nDemonstrates strong product knowledge\nMaintains a guest book to organize, generate and cultivate business\nPerforms proactive and consistent follow-up with all guests before and after the sale and at delivery\nWorks to improve performance based on feedback provided by store management\nPromptly solves guest concerns\nPerforms all opening and closing duties as directed\nAccurately performs all systems functions and maintain operational standards\nResponsible for recording all hours worked\nReviews and acts upon all email and company communications\nParticipates in weekly one on ones and team meetings\nWorks in collaboration with all team members", "qualifications": {"required": "Driven to achieve sales goals\nDemonstrates knowledge and passion for company products and services\nStrong organizational, time management, technological and communication skills\nWorks well independently and collaboratively\nAbility to deliver high-quality guest relations\nSales skills, sense of design or related experience preferred\nProfessional appearance and demeanor\nFlexible schedule that meets the needs of the business (including evenings, weekends, and holidays)", "preferred": "Sales skills, sense of design or related experience preferred"}, "skills": [], "postedDate": "1 month ago", "benefits": "Exceptional advancement opportunities\nCompetitive earnings, bonus opportunities, and generous employee discount\nMedical, dental, and life insurance benefits (offerings differ between full-time and part-time status)\nFlex spending plan\n401K retirement program and 529 college savings plan\nPaid vacations and holidays (Full-time employees only)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3966687636"}