{"jobTitle": "Business Development Manager (Remote)", "company": {"name": "ATTOM", "industry": "Internet Publishing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $90,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "As the leading authority in comprehensive real estate data, ATTOM Data Solutions provides customers a one-stop destination to make better-informed real estate and economical decisions. Recognized nationwide as a trusted industry partner, ATTOM delivers various data products that ensure the accuracy, support, and flexibility required to get the information businesses and individuals need to achieve maximum results. ATTOM is a fully remote company, with employees located throughout the United States. Currently, we can only accept applicants located in the following states: Arizona, California, Colorado, Connecticut, Florida, Georgia, Idaho, Illinois, Kansas, Kentucky, Nevada, New York, North Carolina, Ohio, Tennessee, Texas, Virginia, and Washington.", "responsibilities": "Prospect and identify prospective customers and ensure applicability of products and services in meeting their needs. Promote product awareness, enhance sales skills, and identify competitive products, potential customers, and product enhancement. Effectively manage a sales pipeline and be able to bring to a close complex enterprise data solution while obtaining assigned quota. Daily prospecting leads to set up and complete data demonstration sales. Demonstrate products and solutions in both a web-based and in-office environment. Effectively connect solutions to solving prospective customer’s business challenges. Respond to questions and overcome objections appropriately. Develop sales proposals and related follow up documentation for potential customers. Follow up with call and/or visits to potential customers to ensure a high level of satisfaction. Attend and participate in trade shows, conferences, and seminars. Work in a collaborative manner within sales organization, completing own assignments accurately and within established time frames and achieving departmental goals and objectives. Actively participate in special projects as assigned; assume responsibility for continuous learning along with quality productivity improvement.", "qualifications": {"required": "5+ years consultative sales experience preferred. Demonstrated track record of selling new business. Experience in B2B Information data sales. Experience with Salesforce preferred.", "preferred": "An undergraduate degree is preferred."}, "skills": ["Sales", "Business Development", "Customer Relationship Management", "Data Solutions", "Salesforce"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Pay range 70-90k (Final salary offered may vary depending on your location, job-related skills, knowledge, and experience) plus sales commission. Flexible work schedule. Flexible time off policy. Medical, dental, and vision insurance. Life and disability insurance. Employer-paid benefits. Employer-sponsored EAP (Employee Assistance Program). Traditional 401(k) and Roth retirement plans. Pet insurance. Employee referral bonus. Co-working/office membership through Regus.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3966744492"}