{"jobTitle": "Engineering Manager - Snap Store & Charmhub", "company": {"name": "Canonical", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet", "description": "This is a technical management role to lead a team that develops Python and Golang micro-services that power our global software distribution engine. The world sees it as the Snap Store and Charmhub.io marketplaces, behind the scenes it is a unified system that understands key concepts in software distribution - architectures, releases, betas, release candidates, stable releases, branches and more. We are on a journey to transform the experience that people all over the world have with their open source software by significantly expanding the range of software we can deliver through this system. If you have a passion for clean APIs, believe that great engineers ship software calmly and regularly against an agile plan, and know that tests are the key to higher velocity and reliability, you'll fit right in.<br/><br/>This is a great opportunity to take part in engineering a highly scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.<br/><br/>As an Engineering Manager at Canonical, you must be technically strong, but your main responsibility is to run an effective team and develop the colleagues you manage. You will develop and review code as a leader, but know that the best way to improve the product is to ensure that the whole team is focused, productive and unblocked. You are expected to help them grow as engineers, do meaningful work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and the community. You will also be expected to be a positive influence on culture, facilitate technical delivery, and regularly reflect with your team on strategy and execution. You will collaborate closely with other Engineering Managers, product managers, and architects, producing an engineering roadmap with ambitious and achievable goals.<br/><br/>We expect Engineering Managers to be fluent in the programming language, architecture, and components that their team uses. Code reviews and architectural leadership are part of the job. The commitment to healthy engineering practices, documentation, quality and performance optimisation is as important, as is the requirement for fair and clear management, and the obligation to ensure a high-performing team.<br/><br/>This is a great opportunity to really learn how to do engineering of a highly-scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.<br/><br/><strong>Location</strong>: This role may be based remotely in the Americas, Europe, Middle East or Africa time zones.<br/><br/>What your day will look like<br/><br/><ul><li>Lead a remote team of engineers in your time zone</li><li>Develop talent through coaching, mentoring, feedback, and hands-on career development</li><li>Set and manage expectations with other engineering teams, management, and external stakeholders</li><li>Be an active part of the leadership team and collaborate with other leaders in the organisation</li><li>With your team, build clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang).</li><li>Engage with many other teams at Canonical, as well as the open-source community and commercial partners<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>Good experience in leading modern, agile software development practices</li><li>Experience in forming a healthy, collaborative engineering culture in line with the company values</li><li>Demonstrative experience of being a role model for sound engineering principles and directly contributing toward your team's goals</li><li>Willingness to travel up to 4 times a year for internal events</li><li>You love to mentor, develop and grow people, and have a track record of doing it</li><li>You are knowledgeable and passionate about software development</li><li>You are focused on success and the timely delivery of high-quality software</li><li>You value and nurture great team culture and spirit</li><li>You have experience and commitment to agile development methodologies</li><li>Software development experience in Python (experience in Golang in addition to that would be a big plus)</li><li>Effective written and verbal communication skills</li><li>Practical experience with Linux system administration<br/><br/></li></ul>What we offer you<br/><br/>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br/><br/>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br/><br/><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br/><br/>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br/><br/>Canonical is an equal opportunity employer<br/><br/>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "responsibilities": "This is a technical management role to lead a team that develops Python and Golang micro-services that power our global software distribution engine. The world sees it as the Snap Store and Charmhub.io marketplaces, behind the scenes it is a unified system that understands key concepts in software distribution - architectures, releases, betas, release candidates, stable releases, branches and more. We are on a journey to transform the experience that people all over the world have with their open source software by significantly expanding the range of software we can deliver through this system. If you have a passion for clean APIs, believe that great engineers ship software calmly and regularly against an agile plan, and know that tests are the key to higher velocity and reliability, you'll fit right in.<br/><br/>This is a great opportunity to take part in engineering a highly scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.<br/><br/>As an Engineering Manager at Canonical, you must be technically strong, but your main responsibility is to run an effective team and develop the colleagues you manage. You will develop and review code as a leader, but know that the best way to improve the product is to ensure that the whole team is focused, productive and unblocked. You are expected to help them grow as engineers, do meaningful work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and the community. You will also be expected to be a positive influence on culture, facilitate technical delivery, and regularly reflect with your team on strategy and execution. You will collaborate closely with other Engineering Managers, product managers, and architects, producing an engineering roadmap with ambitious and achievable goals.<br/><br/>We expect Engineering Managers to be fluent in the programming language, architecture, and components that their team uses. Code reviews and architectural leadership are part of the job. The commitment to healthy engineering practices, documentation, quality and performance optimisation is as important, as is the requirement for fair and clear management, and the obligation to ensure a high-performing team.<br/><br/>This is a great opportunity to really learn how to do engineering of a highly-scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.<br/><br/><strong>Location</strong>: This role may be based remotely in the Americas, Europe, Middle East or Africa time zones.<br/><br/>What your day will look like<br/><br/><ul><li>Lead a remote team of engineers in your time zone</li><li>Develop talent through coaching, mentoring, feedback, and hands-on career development</li><li>Set and manage expectations with other engineering teams, management, and external stakeholders</li><li>Be an active part of the leadership team and collaborate with other leaders in the organisation</li><li>With your team, build clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang).</li><li>Engage with many other teams at Canonical, as well as the open-source community and commercial partners<br/><br/></li></ul>", "qualifications": {"required": "Good experience in leading modern, agile software development practices, Experience in forming a healthy, collaborative engineering culture in line with the company values, Demonstrative experience of being a role model for sound engineering principles and directly contributing toward your team's goals, Willingness to travel up to 4 times a year for internal events, You love to mentor, develop and grow people, and have a track record of doing it, You are knowledgeable and passionate about software development, You are focused on success and the timely delivery of high-quality software, You value and nurture great team culture and spirit, You have experience and commitment to agile development methodologies, Software development experience in Python (experience in Golang in addition to that would be a big plus), Effective written and verbal communication skills, Practical experience with Linux system administration", "preferred": ""}, "skills": ["Python", "Golang", "Agile", "Linux", "API", "SaaS", "Software Development", "Engineering Management", "Team Leadership", "Mentoring", "Coaching", "Communication"], "postedDate": "1 month ago", "benefits": "Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br/><br/>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br/><br/><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3966915173"}