{"jobTitle": "Manager for Budget and Financial Analysis", "company": {"name": "The Huntington", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "110,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Museums, Historical Sites, and Zoos", "description": "<strong>About Us<br/><br/></strong>At The Huntington, we believe that having a team of diverse backgrounds and voices working together will enable us to support and promote the appreciation of the humanities, the arts, and botanical science. The Huntington is proud to be an equal opportunity employer and is committed to providing employment opportunities regardless of race, religious creed, color, national origin, disability, sex, gender, gender identity, sexual orientation or any other characteristic protected by local, state or federal law.<br/><br/><strong>The Huntington<br/><br/></strong>Founded in 1919, The Huntington Library, Art Museum, and Botanical Gardens is a collections-based research and educational institution open to the public, housing world-class library, art, and botanical collections. Its mission is to support research and promote education in the arts, humanities, and botanical science and to display and interpret its extraordinary resources for diverse audiences.<br/><br/><strong>The Culture<br/><br/></strong>Here we are committed to the highest of standards in all that we do – from preserving and protecting the collections, to exhibitions, educational and scholarly programming, visitor and reader services, and beyond. Achieving excellence across these pursuits requires a diversity of perspectives, expertise, experience, and methodologies. We are better together. We believe an explicit commitment to diversity, equity, and inclusion directly impacts and improves staff and audience engagement and experience.<br/><br/><strong>Job Description<br/><br/></strong><strong>About the Role<br/><br/></strong>The Finance Division supports both management and end-users, including division and departmental staff in administering and understanding budget, financial reports, and accounting procedures. Manager for Budget and Financial Analysis provides support to the AVP for Financial Planning and Analysis.<br/><br/>The candidate should perform a broad range of highly skilled financial planning, reporting, and budgeting functions for a non-profit with an $85 million operating budget and over 500 employees.<br/><br/>This position will provide budget oversight for all aspects of day-to-day budget and financial analysis reporting operations. Other responsibilities include maintaining and managing the Adaptive Planning budget system, Office Connect reporting, preparing complex budget and financial analyses, multi-year forecasting, and monitoring monthly budget variances/trends and identify root causes. Position will also oversee sponsored program activity ensuring grant spending and reporting is timely and compliant. The position will supervise one budget analyst staff position.<br/><br/><strong>Essential Duties<br/><br/></strong><ul><li>Manage the internal work required of the Budget and Financial Analysis staff to execute budget and analysis operations and ensure deadlines are met and information is available as needed.</li><li>Prepare accurate financial analyses, annual budget plans, current year projections and multi-year forecasting</li><li>Oversee the Adaptive Planning budget system for submitting annual budget and managing budget transactions throughout the year. Power user of Workday and reporting needs in the system.</li><li>Manage position budgeting, payroll reconciliation, payroll costing allocations, and fringe benefit pool</li><li>Review and approve financial transactions to ensure proper account classifications and available budgets</li><li>Provide monthly reports of actuals vs budget for various analysis at different levels of detail</li><li>Meet with department financial liaisons and divisions heads to review financial statements and discuss variances</li><li>Train new staff on reporting functions in Workday and act as a budget business partner for questions regarding financial procedures, reporting and budget</li><li>Oversee grant administration for post award activity including invoicing, accounting, reporting and other administrative functions to ensure successful execution of grant process.</li><li>Prepare and oversee financial analysis around special projects reporting</li><li>Create financial reports and dashboards in Workday, Adaptive Planning and Office Connect.</li><li>Formulate and produce current and historical studies to support financial assessments and recommendations</li><li>Prepare quarterly narrative financial reports for executive leadership and committees, in addition to Power Point presentations with financial graphs and charts related to budget performance.</li><li>Design and develop visualizations, dashboards, and reports to communicate complex data insights to stakeholders<br/><br/></li></ul>Perform other related duties incidental to the work described herein. The above statements describe the general nature and level of work being performed by individuals assigned to this classification. This is not intended to be an exhaustive list of all responsibilities and duties required of personnel so classified.<br/><br/><strong>Candidate Qualifications And Experience<br/><br/></strong><ul><li>Bachelor’s Degree (Business or related field)</li><li>10 years minimum experience in budget management and financial analysis</li><li>Success in this role will rely heavily on proficient knowledge of accounting, budget and planning methodologies for non-profits and grants management.</li><li>Understand fundamentals of non-profit accounting including fund accounting, endowments, restricted gifts and financial statements</li><li>Experience leading and supervising team members</li><li>Position control management and fringe benefit analysis</li><li>Outstanding oral, written and interpersonal communication skills</li><li>Demonstrated ability to analyze financial data in Microsoft Excel utilizing advanced functionality</li><li>Excellent data visualization and data storytelling skills for narratives and presentations</li><li>Facile with preparing Power Point presentations, including graphs and charts.</li><li>Exceptional time management, organization, prioritization skills</li><li>Superior customer service and adaptability to changing requirements</li><li>Outstanding conflict resolution and ability to effectively work in a team environment</li><li>Strong relationship building and collegial approach to working with constituents</li><li>Exceptional analytical and problem-solving skills</li><li>Proficient in Microsoft Office suite products with advanced Excel and Power Point</li><li>Experience using Workday and/or Adaptive Planning preferred.<br/><br/></li></ul><strong>Working Conditions<br/><br/></strong><ul><li>Normal busy, pressured business office environment; much work performed on personal computer.</li><li>Extra hours are typical when the workload is heavy, especially during critical peak financial periods including budget season, fiscal year end close, and audit.<br/><br/></li></ul><strong>Compensation &amp; Benefits<br/><br/></strong>We provide competitive compensation, generous benefits and perks for all eligible employees including:<br/><br/><ul><li>Pay Rate/ Range: $110,000-$120,000. Commensurate on experience. </li><li>Medical, Dental, Vision </li><li>403(b) retirement plan and matching retirement plan with an outstanding employer match </li><li>Hybrid remote work schedule available for applicable positions </li><li>Considerable paid time off, including annual leave, sick leave, and holidays </li><li>Discounts for staff in The Huntington Store and restaurants </li><li>Free admission to various museums and cultural institutions </li><li>Free passes each month to welcome family and friends to visit the grounds <br/><br/></li></ul> <br/><br/><strong>The Application Process<br/><br/></strong>Please submit a cover letter and CV/resume as a single PDF attachment. <br/><br/>You will have the opportunity to submit additional documents on the “My Experience” section of the application.<br/><br/>EEO IS THE LAW<br/><br/>EEO IS THE LAW - SPANISH", "responsibilities": "<ul><li>Manage the internal work required of the Budget and Financial Analysis staff to execute budget and analysis operations and ensure deadlines are met and information is available as needed.</li><li>Prepare accurate financial analyses, annual budget plans, current year projections and multi-year forecasting</li><li>Oversee the Adaptive Planning budget system for submitting annual budget and managing budget transactions throughout the year. Power user of Workday and reporting needs in the system.</li><li>Manage position budgeting, payroll reconciliation, payroll costing allocations, and fringe benefit pool</li><li>Review and approve financial transactions to ensure proper account classifications and available budgets</li><li>Provide monthly reports of actuals vs budget for various analysis at different levels of detail</li><li>Meet with department financial liaisons and divisions heads to review financial statements and discuss variances</li><li>Train new staff on reporting functions in Workday and act as a budget business partner for questions regarding financial procedures, reporting and budget</li><li>Oversee grant administration for post award activity including invoicing, accounting, reporting and other administrative functions to ensure successful execution of grant process.</li><li>Prepare and oversee financial analysis around special projects reporting</li><li>Create financial reports and dashboards in Workday, Adaptive Planning and Office Connect.</li><li>Formulate and produce current and historical studies to support financial assessments and recommendations</li><li>Prepare quarterly narrative financial reports for executive leadership and committees, in addition to Power Point presentations with financial graphs and charts related to budget performance.</li><li>Design and develop visualizations, dashboards, and reports to communicate complex data insights to stakeholders<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree (Business or related field), 10 years minimum experience in budget management and financial analysis, Success in this role will rely heavily on proficient knowledge of accounting, budget and planning methodologies for non-profits and grants management., Understand fundamentals of non-profit accounting including fund accounting, endowments, restricted gifts and financial statements, Experience leading and supervising team members, Position control management and fringe benefit analysis, Outstanding oral, written and interpersonal communication skills, Demonstrated ability to analyze financial data in Microsoft Excel utilizing advanced functionality, Excellent data visualization and data storytelling skills for narratives and presentations, Facile with preparing Power Point presentations, including graphs and charts., Exceptional time management, organization, prioritization skills, Superior customer service and adaptability to changing requirements, Outstanding conflict resolution and ability to effectively work in a team environment, Strong relationship building and collegial approach to working with constituents, Exceptional analytical and problem-solving skills, Proficient in Microsoft Office suite products with advanced Excel and Power Point", "preferred": "Experience using Workday and/or Adaptive Planning"}, "skills": ["Microsoft Excel", "PowerPoint", "Workday", "Adaptive Planning", "Grant Management", "Financial Analysis", "Budgeting", "Non-Profit Accounting", "Supervising", "Communication", "Customer Service", "Problem Solving"], "postedDate": "1 day ago", "benefits": "We provide competitive compensation, generous benefits and perks for all eligible employees including:<br/><br/><ul><li>Pay Rate/ Range: $110,000-$120,000. Commensurate on experience. </li><li>Medical, Dental, Vision </li><li>403(b) retirement plan and matching retirement plan with an outstanding employer match </li><li>Hybrid remote work schedule available for applicable positions </li><li>Considerable paid time off, including annual leave, sick leave, and holidays </li><li>Discounts for staff in The Huntington Store and restaurants </li><li>Free admission to various museums and cultural institutions </li><li>Free passes each month to welcome family and friends to visit the grounds <br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3966733992"}