{"jobTitle": "Logistics Operations Manager", "company": {"name": "LX Pantos America, Inc", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Regular", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Management, Distribution, and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "LX Pantos America, Inc. endeavors to create customer value in various logistics areas, such as project cargo, breakbulk, general cargo, consolidation, door-to-door service, container freight, bonded transportation, customs clearance, delivery, storage, and consulting, through its global networks that aim to reduce customers' logistics cost and provide top-notch services as well as its network systems that connect major ports and airports worldwide.\nAt LX Pantos America, Inc. we look for employees who like a challenge and can leverage your skills and years of experience to drive positive results while ensuring a bright future for yourself and LX Pantos America. If you’re looking for a growth opportunity, join us at LX Pantos America.\nWe are currently searching for a highly motivated <u>Logistics Operations Manager. </u>\n<br/>\n<strong>CORE ROLES & RESPONSIBILITIES</strong>\n<br/>\n<ul><li>Manage E-commerce accounts including field operation WH and transportation and manage P&L.</li><li>Communicate between any customer and vendor for order and sales fulfillment</li><li>Vendor management including Staffing company</li><li>Enter and process into system any invoices issued to customers</li><li>Verify and record any invoices received from vendors</li><li>Monitor and manage customer queries and issues; report to sales management for prompt solution findings as needed</li><li>Facilitate customer service requests and inquiries with UPS, Fedex, USPS etc (Claims, Tracking, etc.)</li><li>Analyze sales and operation KPIs (timely order fulfillment, customer satisfaction, etc.)</li><li>Support the sales management with administrative tasks (sales quotes, proposals, contracts, agreements, etc.)</li><li>Keep track and respond to any other ad hoc requests and tasks as assigned</li></ul>\n<br/>\n<strong>REQUIREMENTS</strong>\n<br/>\n<ul><li>Bachelors Degree in Business Management, Business Administration, or related (Preferred)</li><li>Bilingual in Korean and English is required</li><li>Minimum 6 years of experience in Logistics Operation or CS Operations</li><li>Strong interpersonal and communication (verbal and written) skills</li><li>Ability to work in a fast-paced environment within a team setting</li><li>Professional Working or Bi-lingual in English and Korean (Preferred)</li><li>Proficient in Microsoft Office (Outlook, Excel, PowerPoint, etc.)</li></ul>\n<br/>\n<br/>\n<strong>Job Type</strong>: Regular, Full time\n<strong>Benefits</strong>: Medical, Dental, Vision, Life, STD, LTD, AD&D, 401K, and generous PTOs/paid holidays\n<strong>Job Location</strong>: 100% on-site in Long Beach, CA\n<strong>Business Hours</strong>: Monday to Friday / 08:30 AM to 5:30 PM\n", "responsibilities": "Manage E-commerce accounts including field operation WH and transportation and manage P&L. Communicate between any customer and vendor for order and sales fulfillment Vendor management including Staffing company Enter and process into system any invoices issued to customers Verify and record any invoices received from vendors Monitor and manage customer queries and issues; report to sales management for prompt solution findings as needed Facilitate customer service requests and inquiries with UPS, Fedex, USPS etc (Claims, Tracking, etc.) Analyze sales and operation KPIs (timely order fulfillment, customer satisfaction, etc.) Support the sales management with administrative tasks (sales quotes, proposals, contracts, agreements, etc.) Keep track and respond to any other ad hoc requests and tasks as assigned", "qualifications": {"required": "Minimum 6 years of experience in Logistics Operation or CS Operations Strong interpersonal and communication (verbal and written) skills Ability to work in a fast-paced environment within a team setting Proficient in Microsoft Office (Outlook, Excel, PowerPoint, etc.)", "preferred": "Bachelors Degree in Business Management, Business Administration, or related Bilingual in Korean and English Professional Working or Bi-lingual in English and Korean"}, "skills": ["Logistics", "Customer Service", "Vendor Management", "Sales", "Microsoft Office", "Korean", "English"], "postedDate": "1 month ago", "benefits": "Medical, Dental, Vision, Life, STD, LTD, AD&D, 401K, and generous PTOs/paid holidays", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3967143721"}