{"jobTitle": "Investment Operations Associate", "company": {"name": "Augment Jobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Management and Manufacturing", "industry": "Financial Services", "description": "<strong>Job Title: Investment Operations Associate<br/><br/></strong><strong>Job Summary:</strong> We are looking for a motivated Investment Operations Associate to join our dynamic team. As an Investment Operations Associate, you will play a crucial role in supporting the day-to-day operations of our investment management processes. Your responsibilities will include trade processing, reconciliation, reporting, and ensuring compliance with regulatory requirements. You will work closely with portfolio managers, traders, and other internal teams to optimize operational workflows and deliver exceptional service to our clients.<br/><br/><strong>Roles And Responsibilities<br/><br/></strong><ul><li>Execute and monitor investment trades, ensuring accuracy and timely processing in accordance with established procedures.</li><li>Reconcile trade transactions, positions, and cash balances to maintain accurate records and resolve discrepancies promptly.</li><li>Assist in the maintenance of investment data, including portfolio holdings, performance metrics, and client accounts.</li><li>Collaborate with portfolio managers and traders to support investment strategies and portfolio management activities.</li><li>Generate and distribute investment reports, performance updates, and other operational analyses for internal stakeholders and clients.</li><li>Monitor market events and regulatory changes that may impact investment operations, reporting findings and recommendations to management.</li><li>Support projects and initiatives aimed at enhancing operational efficiency, system enhancements, and process improvements.</li><li>Ensure compliance with regulatory requirements, internal policies, and industry standards in investment operations.<br/><br/></li></ul><strong>Skills Required<br/><br/></strong><ul><li>Strong attention to detail and accuracy in financial transactions and data analysis.</li><li>Proficiency in using investment management systems and financial software (e.g., Bloomberg, FactSet, Excel).</li><li>Excellent organizational and time management skills with the ability to prioritize tasks effectively.</li><li>Strong analytical skills with the ability to interpret data and identify trends or issues.</li><li>Effective communication skills, both written and verbal, for interacting with internal teams and external stakeholders.</li><li>Ability to work independently and collaboratively in a fast-paced, team-oriented environment.</li><li>Commitment to maintaining confidentiality and handling sensitive information with discretion.<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Competitive salary based on experience and qualifications.</li><li>Performance-based bonuses and incentives tied to operational efficiency and client satisfaction.</li><li>Comprehensive benefits package including health insurance, retirement plans, and professional development opportunities.</li></ul>", "postedDate": "1 month ago", "skills": ["Bloomberg", "FactSet", "Excel", "Financial Transactions", "Data Analysis", "Organizational Skills", "Time Management", "Analytical Skills", "Communication Skills", "Teamwork", "Confidentiality"], "url": "https://www.linkedin.com/jobs/view/3967945991"}