{"jobTitle": "Creator Product Marketing Manager", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "83,600.00/yr - $192,533.00/yr", "currency": "USD"}, "jobFunction": "Art/Creative and Customer Service", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>The Creator Engagement &amp; Community team within the Central Creator Team is responsible for:<br/>- Developing creator programs based on content ecosystem and product needs/opportunities <br/>- Developing frameworks for community building through DE&amp;I initiatives, GR social impact needs and creator recognition programs). Standardize how we drive creator advocacy.<br/>- Building creator campaigns around scaled programs, scaled education, DE&amp;I, and creator recognition that target TikTok creators and non-TikTok creators and are aimed at changing perception and driving creator engagement.<br/>- Unify our approach to key creator events and key creator industry events<br/>- For all of the above, responsible for scaling these efforts to local/regional teams ensure constant dialogue and value-add as well as responsible for executing in North America.<br/><br/>Responsibilities:<br/>This role reports into the Creator Campaigns Lead on the Creator Engagement &amp; Community Team<br/>- Develop a variety of creator campaigns in North America targeting TikTok creators and non-TikTok creators to shift product perception, drive product adoption, build creator trust and amplify key creator narratives<br/>- Build and execute GTM plans in close collaboration with Scaled Creator Programs, Community team and Creator Growth &amp; Development teams as well as Marketing COEs (PMM, B&amp;C, Media, Research) to bring creator marketing campaigns to life in-app and/or off-platform, from brief, creative development, media plan, campaign execution and to post-campaign measurement and insights<br/>- Develop playbooks for creator campaigns to share with local/regional teams to guide the execution of campaigns in their markets<br/>- Be a consultative voice for creator marketing campaigns in cross-functional teams and local/regional creator teams. <br/><br/>Qualifications<br/><br/>Minimum Qualifications:<br/>- BA/BS degree or equivalent practical experience <br/>- Event experience in the creator ecosystem <br/>- 3-5+ years of working experience in a creator marketing or community role <br/>- Experience delivering engaging, impactful marketing campaigns, especially in the creator space <br/>- Strong cross-functional skills, with experience collaborating and driving consensus among teams across different workstreams, priorities, and regio<br/><br/>Preferred Qualifications:<br/>- Strong organization skills; proven project management, budget management, and overall campaign management experience<br/>- Detail-oriented; elevating our creator narratives and business priorities through best in class campaigns<br/>- Results-driven; able to create thoughtful campaign strategy that drives towards business goals, and has experience measuring and recapping success from these activations<br/>- Creative; delivers unique campaigns that are reflective of and authentic to TikTok's creator community<br/>- Inclusive thinker who promotes diversity; thinks about and engages with global markets to create the best regional activity aligned with our diverse platform<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $83600 - $192533 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "The Creator Engagement & Community team within the Central Creator Team is responsible for:\n- Developing creator programs based on content ecosystem and product needs/opportunities \n- Developing frameworks for community building through DE&I initiatives, GR social impact needs and creator recognition programs). Standardize how we drive creator advocacy.\n- Building creator campaigns around scaled programs, scaled education, DE&I, and creator recognition that target TikTok creators and non-TikTok creators and are aimed at changing perception and driving creator engagement.\n- Unify our approach to key creator events and key creator industry events\n- For all of the above, responsible for scaling these efforts to local/regional teams ensure constant dialogue and value-add as well as responsible for executing in North America.\n\nResponsibilities:\nThis role reports into the Creator Campaigns Lead on the Creator Engagement & Community Team\n- Develop a variety of creator campaigns in North America targeting TikTok creators and non-TikTok creators to shift product perception, drive product adoption, build creator trust and amplify key creator narratives\n- Build and execute GTM plans in close collaboration with Scaled Creator Programs, Community team and Creator Growth & Development teams as well as Marketing COEs (PMM, B&C, Media, Research) to bring creator marketing campaigns to life in-app and/or off-platform, from brief, creative development, media plan, campaign execution and to post-campaign measurement and insights\n- Develop playbooks for creator campaigns to share with local/regional teams to guide the execution of campaigns in their markets\n- Be a consultative voice for creator marketing campaigns in cross-functional teams and local/regional creator teams.", "qualifications": {"required": "BA/BS degree or equivalent practical experience \nEvent experience in the creator ecosystem \n3-5+ years of working experience in a creator marketing or community role \nExperience delivering engaging, impactful marketing campaigns, especially in the creator space \nStrong cross-functional skills, with experience collaborating and driving consensus among teams across different workstreams, priorities, and regio", "preferred": "Strong organization skills; proven project management, budget management, and overall campaign management experience\nDetail-oriented; elevating our creator narratives and business priorities through best in class campaigns\nResults-driven; able to create thoughtful campaign strategy that drives towards business goals, and has experience measuring and recapping success from these activations\nCreative; delivers unique campaigns that are reflective of and authentic to TikTok's creator community\nInclusive thinker who promotes diversity; thinks about and engages with global markets to create the best regional activity aligned with our diverse platform"}, "skills": [], "postedDate": "5 days ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \n\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \n\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3967880250"}