{"jobTitle": "Head of Operations/GM-Fashion company-LA", "company": {"name": "24 Seven Talent", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$150,000.00/yr - $170,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing and Management", "industry": "Retail Apparel and Fashion", "description": "Our client is a growing fashion company in LA. They are committed to delivering high-quality products and exceptional customer service. Currently looking for a strong Head of Ops/GM.", "responsibilities": "1. Operational Management: - Oversee daily operations across all departments (production, marketing, sales, finance, HR). - Ensure all SOPs are followed and updated as needed. - Monitor and improve internal systems and processes. - Implement and manage ERP and CRM systems to enhance operational efficiency. 2. Team Leadership: - Lead, mentor, and motivate department heads and team members. - Conduct regular meetings with team leads to address issues and ensure alignment with company goals. - Foster a positive and productive work environment. 3. Compliance and Legal: - Ensure the company complies with all legal and regulatory requirements. - Manage annual filings, permits, and other legal obligations. - Coordinate with legal advisors as needed. 4. Financial Oversight: - Work with the finance team to monitor budgets, cash flow, and financial performance. - Ensure accurate and timely financial reporting. - Assist in strategic financial planning and analysis. 5. Sales Oversight: - Monitor sales performance to ensure targets and KPIs are met. - Collaborate with the sales team to develop and implement sales strategies. - Analyze sales data to identify trends and opportunities for improvement. 6. KPI Management: - Set KPIs with each department to measure performance and drive results. - Regularly review and adjust KPIs as needed. - Ensure all departments are aligned with company objectives and goals. 7. Customer and Supplier Relations: - Maintain strong relationships with key customers and suppliers. - Address and resolve any escalated customer service issues. - Negotiate contracts and agreements as needed. 8. Strategic Planning: - Assist in developing and implementing the company’s strategic goals. - Identify opportunities for growth and improvement. - Drive initiatives to enhance operational efficiency and profitability. 9. Reporting and Communication: - Provide regular reports on operational and sales performance to the owner and stakeholders. - Communicate company goals, performance, and updates to all employees. - Develop a reporting system for ownership that includes weekly updates on KPIs, operational status, and strategic plans. 10. Weekly Strategy Meetings: - Lead Monday meetings with department heads to review past performance, set strategies for the week, and address any issues. - Ensure each department has a clear action plan and targets for the week. - Monitor progress throughout the week and provide support as needed. 11. Human Resources Management: - Oversee HR functions including recruitment, onboarding, training, performance evaluations, and employee relations. - Address and resolve HR issues, conflicts, and grievances. - Ensure compliance with labor laws and regulations. - Develop and implement HR policies and procedures. 12. Office Management: - Manage office operations, including facilities management, office supplies, and equipment. - Ensure a safe, clean, and efficient working environment. - Oversee administrative functions and support services.", "qualifications": {"required": "- Bachelor’s degree in Business Administration, Operations Management, Human Resources, or a related field (Master’s preferred). - Minimum of 7-9 years of experience in operations management or a similar role. - Proven leadership and team management skills. - Strong understanding of business functions such as HR, finance, marketing, production, and sales. - Experience with ERP and CRM systems. - Excellent organizational and problem-solving skills. - Strong analytical and decision-making abilities. - Exceptional communication and interpersonal skills. - Knowledge of legal and regulatory requirements in the industry.", "preferred": "- Experience in the fashion industry is a MUST. - Proficiency in project management tools. - Ability to adapt to a fast-paced and dynamic work environment."}, "skills": ["Leadership", "Operations Management", "Strategic Planning", "Financial Oversight", "Sales Performance", "Team Management", "Compliance", "Customer Relations", "Problem Solving", "Communication"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3967190117"}