{"jobTitle": "Manager, Import Drayage", "company": {"name": "Ross Stores, Inc.", "location": "Perris, CA"}, "location": "Perris, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Distribution, and Supply Chain", "industry": "Retail and Transportation, Logistics, Supply Chain and Storage", "description": "<strong><u>GENERAL PURPOSE: </u></strong>\n<p>To lead, direct, develop and coordinate the inbound flow of international merchandise from the port to the DC (Import Drayage). This role will have responsibilities for multiple ports and multiple DC’s. Work with contracted dray carriers and 3rd parties to ensure the inbound flow of merchandise to support monthly goals and on time DC arrivals. Responsible to support the distribution centers with appropriate safety stock and metered flow of product to support production requirements, reduce trailer dwell time and support controlled in transit inventory levels. This high level of service must be supported with aggressive cost reduction consideration for demurrage, detention, chassis and the like, while maintaining and improving existing service levels. Implement and execute process and procedures to ensure Ross/dd’s Discounts operations execution meets standards established by Ross. Manage a staff of 2-6 exempt and non-exempt associates managing the inbound supply chain activity to include collaboration with DC’s, merchants, vendors, carriers, routing, inbound flow, performance metrics, carrier compliance, capacity constraints and network optimization for inbound transportation expenses annually.</p>\n<p><br/></p>\n<p>The base salary range for this role is $81,200 – $122,000. The base salary range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.</p>\n<p><br/></p>\n<p><strong><u>ESSENTIAL FUNCTIONS:</u></strong></p>\n<p>• Develop and execute strategy to support international inbound supply chain integration for Ross/dd’s including leading the activities of international transportation and consolidation activities to meet performance and service level expectations while maintaining or improving costs</p>\n<p>• Review international dray provider performance scorecards and daily in transit reports to hold carriers and staff accountable while consistently improving service levels of providers</p>\n<p>• In collaboration with the procurement group, evaluate rate/service proposals to ensure capacity commitments; transit times and rates support performance objectives.</p>\n<p>• Responsible for maintaining required levels of safety stock at all DC’s by product type</p>\n<p>• Perform all projects requested by the Import Leadership Team, and support collaborative projects as required</p>\n<p>• Interactive ability to generate strong relationships and client confidence</p>\n<p><br/></p>\n<p><strong>COMPETENCIES:</strong></p>\n<p>• Drives Results </p>\n<p>• Influence</p>\n<p>• Managing and Measuring Work </p>\n<p>• Initiating Change </p>\n<p>• Business Acumen </p>\n<p>• Leadership</p>\n<p>• Integrity</p>\n<p><br/></p>\n<p><strong><u>QUALIFICATIONS AND SPECIAL SKILLS REQUIRED:</u></strong></p>\n<p>• Bachelor or MBA degree in Transportation, Logistics or Business related</p>\n<p>• 5 – 8 years prior transportation management experience to include import transportation, customs and quota management</p>\n<p>• 2 – 5 years manager level expertise in international transportation with experience in drayage and port activities</p>\n<p>• Must possess excellent written and oral communication skills and be able to communicate with all levels and departments both within and outside the company</p>\n<p>• Must have experience with current Transportation Management System</p>\n<p>• Knowledge of current regulatory and DOT rules and regulations</p>\n<p>• Logistics background within retail industry</p>\n<p>• Experience with hands on utilization of current supply chain software applications and systems</p>\n<p>• Working knowledge of MS Windows, Word, Excel and Access</p>\n<p>• International Travel up to 25%</p>\n<p><br/></p>\n<p><strong><u>PHYSICAL REQUIREMENTS/ADA:</u></strong></p>\n<p>Job requires ability to work in a warehouse environment. No unusual physical requirements. Requires no heavy lifting, and nearly all work is performed in a comfortable indoor facility.</p>\n<p>Consistent timeliness and regular attendance are necessary. </p>\n<p>Job occasionally requires standing, walking, reaching, talking, hearing, and lifting up to 10 pounds.</p>\n<p>Vision requirements: Ability to see information in print and/or electronically.</p>\n<p>Routine deadlines; usually sufficient lead time; variance in work volume seasonal and predictable; priorities can be anticipated; some interruptions are present; travel or other inconveniences have advance notice; involves occasional exposure to demands and pressures from persons other than immediate supervisor.</p>\n<p><br/></p>\n<p><strong><u>SUPERVISORY RESPONSIBILITIES:</u></strong></p>\n<p>Coordinator, Inbound Transportation. Planner, Transportation</p>\n<p><br/></p>\n<p><strong>DISCLAIMER</strong></p>\n<p>This job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management’s discretion.</p>\n<p>Ross is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company’s overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.</p>\n<p></p>", "responsibilities": "To lead, direct, develop and coordinate the inbound flow of international merchandise from the port to the DC (Import Drayage). This role will have responsibilities for multiple ports and multiple DC’s. Work with contracted dray carriers and 3rd parties to ensure the inbound flow of merchandise to support monthly goals and on time DC arrivals. Responsible to support the distribution centers with appropriate safety stock and metered flow of product to support production requirements, reduce trailer dwell time and support controlled in transit inventory levels. This high level of service must be supported with aggressive cost reduction consideration for demurrage, detention, chassis and the like, while maintaining and improving existing service levels. Implement and execute process and procedures to ensure Ross/dd’s Discounts operations execution meets standards established by Ross. Manage a staff of 2-6 exempt and non-exempt associates managing the inbound supply chain activity to include collaboration with DC’s, merchants, vendors, carriers, routing, inbound flow, performance metrics, carrier compliance, capacity constraints and network optimization for inbound transportation expenses annually.", "qualifications": {"required": "Bachelor or MBA degree in Transportation, Logistics or Business related\n• 5 – 8 years prior transportation management experience to include import transportation, customs and quota management\n• 2 – 5 years manager level expertise in international transportation with experience in drayage and port activities\n• Must possess excellent written and oral communication skills and be able to communicate with all levels and departments both within and outside the company\n• Must have experience with current Transportation Management System\n• Knowledge of current regulatory and DOT rules and regulations\n• Logistics background within retail industry\n• Experience with hands on utilization of current supply chain software applications and systems\n• Working knowledge of MS Windows, Word, Excel and Access\n• International Travel up to 25%", "preferred": ""}, "skills": ["Transportation", "Logistics", "Business", "Import Transportation", "Customs", "Quota Management", "International Transportation", "Drayage", "Port Activities", "Communication", "Transportation Management System", "Regulatory", "DOT", "Retail", "Supply Chain Software", "MS Windows", "Word", "Excel", "Access"], "postedDate": "2 weeks ago", "benefits": "The base salary range for this role is $81,200 – $122,000. The base salary range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.", "remoteWork": "No", "salary": {"amount": "81,200.00 – 122,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3967199277"}