{"jobTitle": "Manager Contract Administration 1- El Segundo CA (Top Secret Cle with Security Clearance", "company": {"name": "ClearanceJobs", "industry": "Defense and Space Manufacturing", "size": "Not specified", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$104,600.00/yr - $156,800.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Defense and Space Manufacturing", "description": "Requisition ID: R10163565 *\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history. Embark on a career putting innovative, reliable, and agile products and ideas into orbit, and beyond. Northrop Grumman has opportunities waiting for you that play a vital role in human space exploration, national defense, and scientific discovery, supporting multiple programs across the universe. With us, you'll discover a culture of curiosity and collaboration that will have you Defining Possible from the day you start. Northrop Grumman Space Systems is seeking a Manager Contract Administration 1 to join its team of qualified and diverse individuals supporting the Tactical Space Systems Contracts team. This is a unique opportunity to build experience, mentoring relationships, and career growth by contributing to the Contracts role. This position is on-site in El Segundo, CA. The Manager Contract Administration 1 will produce high quality Contract Management related products supporting the NGSP Tactical Space Systems Division (TSSD) Mission Integration (MI) programs. This position requires a deep understanding of Government contracting, excellent communication skills, strong technology acumen in M365, customer intimacy, as well as interpersonal and organizational skills. The ideal candidate is a team player; but also, a strong independent contributor with strong leadership skills, demonstrated problem-solving skills, and a proactive, detail-oriented approach. The Manager Contract Administration 1 will be required to deal effectively with competing priorities and deadlines and handle multiple tasks. The Manager Contract Administration 1 must possess the ability to work well with others in high-stress high-volume situations, effectively interface with internal functional and program organizations, and meet the goals/objectives of the IM operating unit.", "responsibilities": "Administers, extends, negotiates and terminates standard and nonstandard contracts. Conducts proposal preparation, contract negotiation, contract administration, and customer contact activities to provide for proper contract acquisition and fulfillment in accordance with company policies, legal requirements, and customer specifications. Examines estimates of material, equipment services, production costs, performance requirements, and delivery schedules to ensure accuracy and completeness. Prepares bids; processes specifications, progress, and other reports; advises management of contractual rights and obligations; compiles and analyzes data; and maintains historical information.", "qualifications": {"required": "Bachelor's Degree from an accredited institution with at least 6+ years of relevant Contracts, Subcontracts, Procurement Administration, or directly related experience; or Master's Degree with 4+ years of relevant Contracts, Subcontracts, Procurement Administration, or directly related experience. An additional four years' experience accepted in lieu of a degree. Strong technical acumen in M365. An in-depth knowledge of FAR, DFAR and experience with different contract types. Strong problem solving and analytical skills; ability to make recommendations and effectively bring projects to completion. Active Top-Secret clearance with the ability to obtain SCI. US Citizenship is a prerequisite.", "preferred": "Active DoD TS/SCI security clearance required to start. Experience supporting ECPs and REAs. Experience with managing and administrator OCIs. Extensive Proposal Support. Change Management. NCMA Certification (CPCM, CFCM and/or CCCM)."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental & Vision coverage, 401k, Educational Assistance, Life Insurance, Employee Assistance Programs & Work/Life Solutions, Paid Time Off, Health & Wellness Resources, Employee Discounts. This position's standard work schedule is a 9/80. The 9/80 schedule allows employees who work a nine-hour day Monday through Thursday to take every other Friday off.", "remoteWork": "No- Teleworking not available for this position", "url": "https://www.linkedin.com/jobs/view/3967330645"}