{"jobTitle": "Regional Manager", "company": {"name": "Prime Residential", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management, Sales, and Project Management", "industry": "Real Estate", "description": "<strong>About Prime:</strong> Prime Residential is an established owner and operator of more than 19,000 multifamily apartments and townhomes, providing appealing amenities and superior customer service in some of the most sought-after locations along the West Coast. We are committed to maintaining a richly diverse and inclusive company culture where all people feel welcomed and valued.", "responsibilities": "Prime Residential’s Regional Managers are responsible for maximizing the long-term operating performance of multiple properties. They drive talent management, excellence in resident and prospect experience, and manage financials to maximize asset performance. This role ensures operational excellence across all aspects of property management, including people, product, promotion, and price. Regional Managers make sound business decisions in a dynamic environment and uphold consistent operating procedures. They proactively ensure financial success and develop a talented team to maintain the high standards expected in our communities.", "qualifications": {"required": "5+ years of multi-site managerial experience in residential property management, Knowledge of federal, state, and local laws related to employment, fair housing, and landlord/tenant laws, as well as company policies and procedures, Proven experience in managing, building, and influencing teams, Demonstrated leadership and strategic thinking skills, Confidence in dealing with financial statements and financial analysis.", "preferred": "Bachelor's degree"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Generous Benefits: Comprehensive medical, dental, vision, and RX plans. PTO: Standard PTO plus 11 company holidays, 2 floating holidays, 1 birthday day-off, and 1 volunteer day-off. Retirement: 401k match up to 4%. Career Growth: Prime Academy provides various development opportunities by position including foundational skills, technical skills, leadership essentials, and more. Education: Tuition reimbursement for continuous learning. Employee Housing Discount: Housing discount offered at Prime Residential properties.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3967271031"}