{"jobTitle": "Contact Center Representative", "company": {"name": "SAG-AFTRA", "industry": "Entertainment Providers", "size": "160,000 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$24.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "SAG-AFTRA is the iconic American labor union that represents approximately 160,000 media professionals. SAG-AFTRA employees support our members and thrive on securing the strongest protections by negotiating the best wages, working conditions, health and pension benefits. We preserve and expand members’ work opportunities, vigorously enforce our contracts and protect our members against unauthorized use of their work.", "responsibilities": "The Contact Center Representative will provide excellent member service through responding to telephone calls, emails, web chat and other interaction channels. This position acts as the most common touch point for SAG-AFTRA and is expected to have broad knowledge of the processes, policies and operations of the entire organization. Cashiering, Contracts, Membership, and Residuals Processing are key subject areas. First level contract assessment and support; advocate for members working under a SAG-AFTRA collective bargaining agreement by answering questions for members, producers, studio executives, labor attorneys, casting agents and other industry professionals.", "qualifications": {"required": "2 years of customer service experience (including heavy contact with the public) required. 3+ years strongly preferred. Bachelor’s Degree preferred, but not required. Entertainment industry experience preferred, but not required.", "preferred": "Able to interact with tact and diplomacy with both external and internal customers. Able to sign on to a queue and handle phone calls for the entire workday, if required. Able to write clearly and succinctly. Excellent listening skills. Problem analysis and problem solving skills. Stress tolerance. Passion for customer service; must enjoy interacting with people and maintain a positive attitude under pressure. Independent problem solving and analytical skills. Must be proficient in Microsoft Office; familiarity with Oracle systems is a plus. Able to communicate effectively in English; both verbal and written. Able to use PC Applications. Able to adhere and maintain productivity and quality standards. Superlative interpersonal skills: high degree of patience and tact. Must be able to cultivate respectful, strategic and collaborative relationships with people from diverse backgrounds both internally and externally. Have an understanding and awareness of worker rights impacting SAG-AFTRA members. Detail oriented. Able to organize and coordinate multiple tasks under daily deadlines. Able to prioritize tasks and work under pressure. Capable of taking direction from more than one supervisor. Must be able to work in a very challenging environment where constructive feedback from others is encouraged. Must maintain regular and acceptable attendance at such level as is determined at SAG-AFTRA’s sole discretion. Must be available and willing to work extended hours per day or per week, including weekends as SAG-AFTRA determines is necessary to meet its business needs."}, "skills": ["Customer Service", "Communication", "Problem Solving", "Microsoft Office", "Oracle Systems"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "The salary for this position is $24.00 per hour along with excellent employee benefits and perks such as a 35-hour work week. Colleagues that are passionate about what we do and how they contribute to our mission. Balance between work and home life responsibilities. Affordable and comprehensive medical and dental plans. Generous pension plan. Employee discounts and perks.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3967781900"}