{"jobTitle": "Senior Healthcare Data Analyst / Consultant IV, Quality and Safety Improvement", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>Facilitates a broad range of administrative, facilitation, and technical support functions in the area of Quality and Safety Improvement to support Quality and Safety programs and initiatives. Develops, implements, monitors, and continuously improves Quality and Safety programs and initiatives. Develops and monitors performance indicators and metrics, collaborates with appropriate departments to collect, analyze, and trend data from multiple reporting systems and sources to identify opportunities to improve quality and safety, decrease risk, and maintain the KP safety culture. Develops and coordinates across workgroups to address priority issues and acts as a resource for issues related to quality and safety. Supports multiple committees that are coordinated or chaired by the department. Contributes to the organizations compliance with professional standards, laws and regulations, and internal requirements related to quality and safety.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Promotes learning in others by proactively providing and/or developing information, resources, advice, and expertise with coworkers and members; builds relationships with cross-functional/external stakeholders and customers. Listens to, seeks, and addresses performance feedback; proactively provides actionable feedback to others and to managers. Pursues self-development; creates and executes plans to capitalize on strengths and develop weaknesses; leads by influencing others through technical explanations and examples and provides options and recommendations. Adopts new responsibilities; adapts to and learns from change, challenges, and feedback; demonstrates flexibility in approaches to work; champions change and helps others adapt to new tasks and processes. Facilitates team collaboration to support a business outcome. </li><li>Completes work assignments autonomously and supports business-specific projects by applying expertise in subject area and business knowledge to generate creative solutions; encourages team members to adapt to and follow all procedures and policies. Collaborates cross-functionally and/or externally to achieve effective business decisions; provides recommendations and solves complex problems; escalates high-priority issues or risks, as appropriate; monitors progress and results. Supports the development of work plans to meet business priorities and deadlines; identifies resources to accomplish priorities and deadlines. Identifies, speaks up, and capitalizes on improvement opportunities across teams; uses influence to guide others and engages stakeholders to achieve appropriate solutions. </li><li>Conducts data extraction, analyses, and presentations to support quality improvement efforts by: conducting statistical analysis to determine the reliability and confidence intervals for quality improvement evaluations and special projects; creating charts, graphs, and narrative summaries of improvements utilizing multiple data reporting systems; presenting quality improvement metric reports at the individual and team level to demonstrate improvements and effectiveness of quality improvement programs into specified formats; and documenting and analyzing trends, potential errors, and other analysis and reporting finds to the supervisors. </li><li>Facilitates quality improvement and improvement risk management efforts by: assisting with the development of corrective action plan for areas of improvement identified through utilization review, clinical records audit, claim denials, member satisfaction surveys, and auditing surveys; ensuring process improvements are compliant with established internal and external regulation requirements at the local level; conducting root cause analysis, failure mode and effect analysis, and other assessments in response to significant events, near misses, and good catches in order to identify areas of improvement; and exercising independent judgment to escalate high-risk issues and trends to appropriate entity for resolutions. </li><li>Develops and utilizes quality improvement performance metrics by: developing performance metrics, standards, and methods to establish improvement success; collaborating with multiple stakeholders, often with competing/conflicting objectives, to ensure development of cohesive and reachable metrics are practical and approved for assigned departments; and facilitating the collection of metric data from workflows and projects by utilizing sound methodology. </li><li>Facilitates the development of quality improvement initiatives by: implementing methods and tools to develop stakeholders capabilities for process improvements; integrating the use of data-driven improvement principles, tools, and problem-solving methods, including Lean/Six-Sigma concepts and techniques using quality improvement metrics; and developing and updating milestones, detailed workplans, and documentation practices in order to create a clear, logical, and realistic plan. </li><li>Serves as the subject matter expert for quality improvement processes and regulations within assigned departments by: learning current internal policies and external regulations; participating on committees, projects to propose a course of action on the enforcement, development of policies or procedures of regulations and auditing processes; fostering collaborative, results oriented partnerships to ensure compliance with regulations and improve patient safety, maintain the KP safety culture, reporting accuracy, and health outcomes; delivering educational programs to raise awareness for regulation requirement, internal concerns, and system/database usage; and anticipating issues, weigh practical considerations in addressing issues and seek input from engagement manager/sponsor to resolve. </li><li>Delivers stakeholder development and quality performance review efforts by: conducting utilization and performance reviews utilizing multidisciplinary criteria and guidelines, and takes a systematic approach to quality improvement; identifying performance areas of improvement for stakeholders and provides feedback and coaching as needed; and delivering and assisting in the development training and educational programs related to process improvement for quality improvement programs for stakeholders at the team level. </li><li>Minimum Qualifications:</li><li>Minimum one (1) year of experience in a leadership role with or without direct reports. </li><li>Minimum two (2) years of experience with databases and spreadsheets or continuous quality improvement (CQI) tools. </li><li>Minimum three (3) years of experience in a clinical setting, health care administration, or a directly related field. </li><li>Bachelors degree in Business Administration, Health Care Administration, Nursing, Public Health, or related field AND Minimum four (4) years of experience in quality, performance improvement, customer service, or a directly related field OR Minimum seven (7) years of experience in heath care quality assurance/improvement or a directly related field. <br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Knowledge, Skills, and Abilities (KSAs): Negotiation; Risk Management; Compliance Management; Health Care Compliance; Applied Data Analysis; Health Care Quality Standards; Quality Improvement; Development Planning; Agile Methodologies; Process Mapping; Project Management; Risk Assessment</li></ul>", "postedDate": "1 month ago", "skills": ["Negotiation", "Risk Management", "Compliance Management", "Health Care Compliance", "Applied Data Analysis", "Health Care Quality Standards", "Quality Improvement", "Development Planning", "Agile Methodologies", "Process Mapping", "Project Management", "Risk Assessment"], "url": "https://www.linkedin.com/jobs/view/3967382408"}