{"jobTitle": "Machine Learning Engineer", "company": {"name": "Tripalink", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "100,000.00/yr - 180,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet", "description": "Location: Hybrid/Remote. Preferred: LA, SF Bay Area, Austin. Job Type: Full-Time Tripalink is a well-funded growth-stage Proptech startup headquartered in Los Angeles backed by prominent technology investors in Silicon Valley and others deeply rooted in the real estate space. We’re dedicated to building the next-gen real estate solutions powered by AI, with a current focus on delivering a frictionless experience end to end for renters and compelling economics for property owners. We have strong and accelerating momentum, having grown 7x in the last 3 years despite the tough environment for startups and the aggressive interest rate hikes negatively impacting the real estate market. We are seeking ML engineers passionate about building products powered by AI that delight users and are scalable and secure. The ideal candidates will be self-driven and have a solid foundation in ML (including GenAI/LLM) and a proven track record of shipping products powered by AI. Main Responsibilities:<br/><br/><ul><li>Collaborate with cross-functional teams to understand business and user needs and design AI-powered solutions</li><li>Develop, evaluate/test, fine tune, and deploy various AI applications</li><li>Produce high-quality code and documentation for machine learning processes and architectures</li><li>Stay abreast of emerging technologies, especially new developments in GenAI/LLM areas, and leverage latest technologies and methodologies to improve our solutions<br/><br/><br/></li></ul>Requirements:<br/><br/><ul><li>1-3 years of experience as a ML engineer. Experience in shipping SaaS products or Internet services powered by LLMs is highly desirable</li><li>Bachelor’s or Master’s degree or PhD in Computer Science, ML, or a related field</li><li>Proficiency in programming in Python and Java</li><li>Experience in NLP, AWS and relational databases such as MySQL, PostgreSQL, etc. is highly desirable</li><li>Strong problem-solving skills with the ability to work independently and manage multiple tasks under pressure</li><li>Ability to communicate effectively and work well as part of a distributed team in a fast-paced environment that optimizes for quick iterations. <br/><br/><br/></li></ul>The estimated annual base salary for this role is $100,000 - $180,000.", "postedDate": "1 month ago", "skills": ["AI", "GenAI", "LLM", "NLP", "AWS", "MySQL", "PostgreSQL", "Python", "Java", "SaaS", "Machine Learning", "Software Engineering"], "url": "https://www.linkedin.com/jobs/view/3967142850"}