{"jobTitle": "Staff Accountant", "company": {"name": "Create Music Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Entertainment Providers", "description": "Create Music Group is a data-driven music and technology company focused on empowering artists and labels. We provide you with the resources of a major label with flexibility of being independent. Trusted by the world's largest artists, labels, and brands - we’re revolutionizing the music industry and how the world hears their favorite songs by maximizing opportunities to monetize content across all platforms. Clients include Gashi, DeeBaby, Troyboi, Teo, and more.<br/><br/><strong>SUMMARY:<br/><br/></strong>The Staff Accountant will be responsible for supporting monthly financial close process by reconciling and analyzing accounts, managing billing and collection process, and resolving any discrepancies in financial records as needed.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Support monthly financial close process by reconciling and analyzing accounts including but not limited to cash, A/R, prepaids, fixed assets, intangibles, loans, accruals, payables, credit cards, debt, payroll and leases for domestic and international subsidiaries</li><li>Manage the billing &amp; collection process, including the creation and management of invoices, tracking collections, and maintaining accurate records of receivables</li><li>Investigate and resolve discrepancies in financial records, including reconciling differences and preparing journal entries entries as needed</li><li>Assist with ad hoc requests including but not limited to providing documentation for internal and external audits</li><li>Liaise with other departments, gather relevant accounting information and recommend process improvements<br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>High School Diploma or Bachelor’s Degree in Accounting, Finance, or a related field</li><li>1+ year of relevant work experience in Accounting or Finance at public accounting firm</li><li>Strong previous experience in Accounting software and Microsoft Excel</li><li>Knowledge of generally accepted accounting principles (GAAP) and financial regulations</li><li>Strong analytical and problem-solving skills</li><li>Ability to handle multiple tasks and prioritize effectively</li><li>Strong Attention to detail and accuracy in financial data management</li><li>Excellent communication and interpersonal skills</li><li>Ability to work independently and as part of a team</li><li>Willingness to learn and adapt to new environments</li><li>Previous experience in Netsuite, FloQast and Tipalti preferred<br/><br/></li></ul><strong>PAY SCALE:<br/><br/></strong><ul><li>$65,000 - $70,000/annually</li></ul>", "responsibilities": "The Staff Accountant will be responsible for supporting monthly financial close process by reconciling and analyzing accounts, managing billing and collection process, and resolving any discrepancies in financial records as needed.", "qualifications": {"required": "High School Diploma or Bachelor’s Degree in Accounting, Finance, or a related field, 1+ year of relevant work experience in Accounting or Finance at public accounting firm, Strong previous experience in Accounting software and Microsoft Excel, Knowledge of generally accepted accounting principles (GAAP) and financial regulations, Strong analytical and problem-solving skills, Ability to handle multiple tasks and prioritize effectively, Strong Attention to detail and accuracy in financial data management, Excellent communication and interpersonal skills, Ability to work independently and as part of a team, Willingness to learn and adapt to new environments", "preferred": "Previous experience in Netsuite, FloQast and Tipalti"}, "skills": ["Accounting", "Finance", "Microsoft Excel", "GAAP", "Analytical Skills", "Problem Solving", "Communication", "Interpersonal Skills", "Netsuite", "FloQast", "Tipalti"], "postedDate": "1 month ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3967968267"}