{"jobTitle": "Senior Human Resources Manager", "company": {"name": "Pressed Juicery", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $145,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Food and Beverage Services", "description": "<strong><u>About Pressed Juicery</u></strong><p>Pressed Juicery is at the forefront of the wellness movement and is dedicated to making healthy living as convenient and delicious as possible. Pressed operates over 100 retail stores, is available in nearly 3,000 supermarkets, and can be delivered to any US location through the Pressed Juicery website or app.</p><p><br/></p><p><strong><u>Our Mission</u></strong></p><p>Pressed Juicery’s mission is to empower your wellness journey.</p><p><br/></p><p><strong><u>Our Workplace Culture</u></strong></p><ul><li>We embrace diversity, equity, inclusion, and belongingness!</li><li>We speak up with radically candid communication.</li><li>We wholeheartedly support personal and professional growth.</li><li>We believe mistakes can be valuable and lead to continuous improvement.</li><li>Lastly, we value excellence and strive to achieve greatness in all we do!</li></ul><p><br/></p><p><strong><u>Our Values</u></strong></p><ul><li>Community - as leaders, we celebrate differences, champion strengths, and compassionately aspire to be our most vibrant selves.</li><li>Passion - curious and humble, we inspire people to make healthy choices.</li><li>Growth - pursuing wellness with intention, we create and embrace good energy.</li></ul><p><br/></p><p><strong><u>Our Benefits</u></strong></p><ul><li>401k match</li><li>13 paid holidays</li><li>8 paid Pressed Days (additional days off)</li><li>Medical, dental, and vision insurance</li><li>Vacation time</li><li>Flexible Spending Account</li><li>Paid parental leave</li><li>Employee Referral Program</li></ul><p><br/></p><p><strong><u>Job Purpose</u></strong></p><p>The Sr. Human Resources Manager will engage and build relationships with team members &amp; thrive to make impactful experiences throughout an employees’ life cycle. The Sr. Human Resources Manager will support the execution of all HR functions and is primarily responsible for employee experience, changes, recordkeeping, and HRIS administration. The Sr. Human Resource Manager will work closely with the HR team, and Operations to ensure accuracy and compliance in all routine operations.</p><p><br/></p><p>For Los Angeles-based employees, this position is a hybrid role, a minimum of 2 days in our Culver City, CA Support Center. This position may be remote, provided employee resides where other Pressed retail stores are located - San Francisco/Bay Area/Oakland, Orange County, and Fresno. Occasional required travel to retail/manufacturing locations (Orange County, Los Angeles, Bay Area, Fresno/Dinuba, CA).</p><p><br/></p><p><strong><u>Key Responsibilities</u></strong></p><ul><li>Help to transform the employee experience, including onboarding, orientations, safety regulations, employee challenges, and offboarding.</li><li>Supervise the day-to-day HR operations, including but not limited to employee onboarding, offboarding, record keeping, and employee relations.</li><li>Conduct workplace investigations serving as the note taker and interviewer.</li><li>Develop and implement initiatives to enhance employee engagement, satisfaction, and retention, fostering a positive and inclusive work environment.</li><li>Maintain employee files in compliance with applicable legal requirements.</li><li>Ensure compliance with labor laws, regulations, and company policies, and actively contribute to the development and implementation of HR policies and procedures.</li><li>Provides current and prospective employees with information about policies, job duties, working conditions, wages, and employee benefits.</li><li>Process employee data changes including new hire, terminations, promotions, supervisor changes, transfers, and other transactions as needed</li><li>Ability to conduct audits using Microsoft Excel and other Office programs</li><li>Ensures employee documents are completed and filed in our HRIS</li><li>Assist the HR Team in drafting and presenting performance evaluations, performance improvement plans, etc.</li></ul><p><br/></p><p><strong><u>Requirements</u></strong></p><ul><li>7+ years of Human Resources experience</li><li>Master's Degree (MBA or in HR) highly preferred</li><li>Bilingual (Spanish/English) is a plus!</li><li>Employee Relations experience a must.</li><li>Retail or Hospitality experience nice to have.</li><li>Experience working under a general counsel or legal counsel experience is desired.</li><li>Experience using Ceridian/Dayforce (preferred) or a similar enterprise grade system such as SAP SuccessFactors or Workday.</li><li>AWI certified (preferred); must have some Investigations experience.</li><li>Proficient in Microsoft Office (including PPT, XLS, and DOC)</li><li>Familiarity with Worker’s Compensation, OSHA guidelines, FMLA, LOA &amp; ADA (Disability)</li><li>Excellent communication skills, both oral and written</li><li>Self-starter, self-motivated, doer and executor with limited supervision</li></ul>", "responsibilities": "Help to transform the employee experience, including onboarding, orientations, safety regulations, employee challenges, and offboarding. Supervise the day-to-day HR operations, including but not limited to employee onboarding, offboarding, record keeping, and employee relations. Conduct workplace investigations serving as the note taker and interviewer. Develop and implement initiatives to enhance employee engagement, satisfaction, and retention, fostering a positive and inclusive work environment. Maintain employee files in compliance with applicable legal requirements. Ensure compliance with labor laws, regulations, and company policies, and actively contribute to the development and implementation of HR policies and procedures. Provides current and prospective employees with information about policies, job duties, working conditions, wages, and employee benefits. Process employee data changes including new hire, terminations, promotions, supervisor changes, transfers, and other transactions as needed Ability to conduct audits using Microsoft Excel and other Office programs Ensures employee documents are completed and filed in our HRIS Assist the HR Team in drafting and presenting performance evaluations, performance improvement plans, etc.", "qualifications": {"required": "7+ years of Human Resources experience, Master's Degree (MBA or in HR) highly preferred, Bilingual (Spanish/English) is a plus!, Employee Relations experience a must., Retail or Hospitality experience nice to have., Experience working under a general counsel or legal counsel experience is desired., Experience using Ceridian/Dayforce (preferred) or a similar enterprise grade system such as SAP SuccessFactors or Workday., AWI certified (preferred); must have some Investigations experience., Proficient in Microsoft Office (including PPT, XLS, and DOC), Familiarity with Worker’s Compensation, OSHA guidelines, FMLA, LOA &amp; ADA (Disability), Excellent communication skills, both oral and written, Self-starter, self-motivated, doer and executor with limited supervision"}, "skills": ["Human Resources", "Employee Relations", "Ceridian", "Dayforce", "SAP SuccessFactors", "Workday", "AWI", "Microsoft Office", "PPT", "XLS", "DOC", "Worker's Compensation", "OSHA", "FMLA", "LOA", "ADA", "Communication"], "postedDate": "3 weeks ago", "benefits": "401k match, 13 paid holidays, 8 paid Pressed Days (additional days off), Medical, dental, and vision insurance, Vacation time, Flexible Spending Account, Paid parental leave, Employee Referral Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3967173260"}