{"jobTitle": "Creative Strategist, Global Clients", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "133,000.00/yr - 190,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Creative Shop is a team of entrepreneurs, strategists, designers, gamers, writers, data + technology tinkerers and creatives who are hungry for new ideas. We believe that creativity is what drives innovation in every aspect of the modern world, disrupts industries, improves the status quo, and helps bring the world closer together.We are looking for someone with a creative or marketing background, who has worked in a rapidly changing creative industry with focus on CPG Food & Beverage and/or Beauty companies and an entrepreneurial mindset, and has a drive for creative experimentation and learning. A design thinker, able to operate in the intersection of creativity and strategy to influence ideas that start from culture, or sometimes, create culture itself. Capable of visualizing strategies in a compelling way and present to C-level stakeholders internally and externally.You belong in our team: If you are love to move fast, learn more, never be complacent; If you stand at the intersection of creativity and technology; If you believe data, tech and product innovation are fundamental to the creative process; If you aren’t afraid to take what we have and make it 10x better; If constant change doesn’t bother you but excites you; If you want to work with a diverse bunch of creative minds to tell stories that you weren’t able to tell before; If you want to humbly lead the industry to create the best work of your (and their) life.<br/><br/>Creative Strategist, Global Clients Responsibilities:<br/><br/><ul><li>Continually inspire our clients and creative industries with a vision for their business that translates into campaigns on our platforms.</li><li>Work with diverse, cross-functional teams to refine and scale your creative approaches for maximum impact across Meta’s Platforms.</li><li>Continually work to invent new ways to harness creativity for business growth whilst driving value for people and communities.</li><li>Work hands-on to bring ideas to life. This is a position for builders/creators able to scale your team’s ideas across the globe.</li><li>Collaborate with cross-functional teams internally and externally to drive efficiency on the creative process and the impact it has to our clients business.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>6+ years’ experience gained from working at startups, creative agencies, in-house creative teams, independent business or non-traditional content creators with focus on:</li><li>Conceptual thinking and problem solving - Experience to visualize ideas and influence stakeholders to execute creative strategies to its full potential across platforms.</li><li>Data fluency – you are happy getting your hands dirty with data, measurement and you are willing to learn new tools and distill data into unique insights.</li><li>Entrepreneurial. We’re still only 1% done – this team is inventing everyday and it takes tenacity, bravery and the experience to see the big opportunities to thrive here</li><li>Latest work samples required.<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Continually explore Meta products - be a maker yourself and know the tools well from a consumer standpoint to build the best brand experiences for broad audiences.</li><li>Curious and experience to use the latest tools to prototype work - from using AI to mockup story boards to coding basic messaging experiences and/or AR filters.<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$133,000/year to $190,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "postedDate": "5 days ago", "skills": ["CPG Food & Beverage", "Beauty", "Design Thinking", "Creative Strategy", "Data Fluency", "Entrepreneurial", "Meta Products", "AI", "AR Filters"], "url": "https://www.linkedin.com/jobs/view/3967893583"}