{"jobTitle": "Sanitation Supervisor", "company": {"name": "Hearthside Food Solutions", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "Founded in 2009 and headquartered in Downers Grove, IL we are a world-class contract manufacturer producing wholesome baked goods, snacks and packaged foods for many of the world’s leading food companies. As one of the largest and fastest growing food co-manufacturing companies in the US, we are the proud owner and operator of over 35 facilities globally. Our nearly 10,000 employee-strong organization is leading the way and setting new standards for quality, safety, flexibility and efficiency while feeding families around the globe.<br/><br/>Hearthside’s exceptional growth stems from its ability to address real-world problems for customers of all shapes and sizes, and by our resolute commitment to our belief that there are no great companies without great culture. Our culture of personal empowerment enables growth, learning, and continuous improvement every day!<br/><br/>We are steadfast in our ambition to be the indispensable and most trusted partner to our customers and need your help to do it! Join Hearthside and enjoy a competitive package, outstanding benefits and a diverse work environment.<br/><br/><strong>Job Summary:<br/><br/></strong>The Plant Sanitation supervisor is responsible for sustaining the Sanitation program, and for insuring that all current Food Safety Standards are being met throughout the site. The Sanitation supervisor will train and develop all sanitation employees to be able to identify and control GMP issues and to enforce all current food safety standards. The Sanitation Supervisor will be responsible for communicating in a clear manner any Sanitation issues with the Quality Manager, Plant Manager, and/or all the Production and Sanitation Staff.<br/><br/><strong>Job Duties</strong><strong>:<br/><br/></strong><strong>Duties may include, but are not limited to the following:<br/><br/></strong><ul><li> Assist in the development of and maintenance of Sanitation program (HACCP, Allergen, etc.) for a variety of products in compliance with customer and government regulations. </li><li> Assists with consumer complaint issues and leading plant teams in the direction necessary to minimize complaints. </li><li> Assists with the development of Sanitation procedures and paperwork. </li><li> Must have a strong working relationship with Plant Manager and Quality/Sanitation Manager </li><li> Work with the Sanitation Team in identifying sanitation or regulation issues at assigned facility. </li><li> Ensure that the facility is ready for Third Party or Customer inspections. </li><li> Assists with policy, procedures and paperwork to ensure that all Company and Customer standards are achieved in assigned plant. </li><li> Provides an atmosphere that allows for the development of supervisors and managers. </li><li> Assists with the management of the Master Sanitation Schedule. </li><li> Leads Continuous Improvement of facility sanitation. </li><li> Assists with the control and maintenance of the Sanitation budget. </li><li> Supervises Sanitation chemical suppliers. </li><li> Manages Sanitation staff. </li><li> Works with the Product Safety Auditor to identify and correct sanitation or environmental issues at assigned facility. </li><li> Ensures that all chemicals used in the plant are approved for such use and that all chemicals have current MSDS information on site. </li><li> Responsible for the dilution testing of all chemicals needing diluted. </li><li> Develop and train all steps of each plant clean-up. </li><li> Responsible for the pest control program. </li><li> Other duties as identified or assigned by Sanitation Manager. </li><li> Fill in for Sanitation Manger during his/her absence. <br/><br/></li></ul><strong>Required Competencies &amp; Knowledge</strong><strong>:<br/><br/></strong><strong>Knowledge of:<br/><br/></strong><ul><li> Master Sanitation Plan and other legal requirements for the food industry, including GMP’s. </li><li> Must be knowledgeable regarding requirements of FDA and MDA. </li><li> Must be knowledgeable in GMP’s, HACCP, Allergens and BRC. </li><li> Must understand the 10 principles of sanitary equipment design. </li><li> Good understanding of commercial bakeries and bakery equipment, as well as the functionality of ingredients in the bakery process and how it relates to possible insect development. <br/><br/></li></ul><strong>Skill in: <br/><br/></strong><ul><li> Demonstrated good record in developing and maintaining programs and handling conflicts with positive and practical attitude. </li><li> Excellent verbal and written communication skills, computer literate, self-motivated and able to make sound business decisions. </li><li> Excellent motivational and people skills. <br/><br/></li></ul><strong>Ability to:<br/><br/></strong><ul><li> Strong written and verbal communication skills, analytical ability, leadership strength and ability to work effectively with all levels of the organization. </li><li> Work in a fast-paced environment </li><li> Make sound business decisions. <br/><br/></li></ul><strong>Proficiency in</strong><strong>:</strong> MS Office Suite<br/><br/><strong>Minimum Qualifications</strong>:<br/><br/><ul><li> Undergraduate degree in Sanitation or combination of education and experience. </li><li> 5 plus years experience in food industry with at least 3 years as Sanitation Supervisor. </li><li> Spanish Bilingual is a plus <br/><br/></li></ul>Hearthside is an Equal Opportunity Employer.<br/><br/>Apply Now<br/><br/>", "responsibilities": "The Plant Sanitation supervisor is responsible for sustaining the Sanitation program, and for insuring that all current Food Safety Standards are being met throughout the site. The Sanitation supervisor will train and develop all sanitation employees to be able to identify and control GMP issues and to enforce all current food safety standards. The Sanitation Supervisor will be responsible for communicating in a clear manner any Sanitation issues with the Quality Manager, Plant Manager, and/or all the Production and Sanitation Staff.", "qualifications": {"required": "Undergraduate degree in Sanitation or combination of education and experience. 5 plus years experience in food industry with at least 3 years as Sanitation Supervisor. Spanish Bilingual is a plus ", "preferred": null}, "skills": ["HACCP", "GMP", "BRC", "FDA", "MDA", "Allergens", "MS Office Suite"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Hearthside is an Equal Opportunity Employer.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3967961442"}