{"jobTitle": "Legal Secretary", "company": {"name": "Vizelia", "industry": "Environmental Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Legal", "industry": "Environmental Services", "description": "As a Litigation Legal Secretary, you will provide a variety of secretarial and administrative duties for assigned attorneys. You will be responsible for interacting with colleagues in a team setting and upholding the image of the Firm by maintaining positive contact with clients, attorneys and staff, and observing confidentiality of client matters. The Day-to-day On any given day, you will be working with firm leadership, partners, and business colleagues on a variety of requests and projects. You will: Input, revise, and finalize correspondence, memoranda and other legal documents. Draft routine correspondence, memoranda and other documents. File legal documents in federal and state courts, including e-filing in all courts and agencies; prepare documents for service of process; prepare case shell documents for use by attorneys. Verify all attachments, exhibits and enclosures are included with transmittal letters/memos. Proofread documents and check for appropriate formatting, spelling and grammar. Maintain good public relations with clients. Review all incoming mail, distribute to teams as needed and upload to the DMS. Prepare documents and packages for mail, messenger and overnight delivery. Prepare expense reports, manage vendor invoices, mailings, and request checks as needed. Enter attorney time. Send time entry reminders. Process client billing. Assist with review and edit of bills as necessary. Schedule appointment and make arrangements for meetings, conferences and travel. Complete client/matter intake forms. Request conflicts of interest checks. Open new files. Prepare files to be closed. Coordinate and follow through on requests and projects with other support departments (e.g. receptionists, file/document clerks, office services). Provide overflow and absence coverage assistance as well as secretarial support for Secretarial Team Members attorneys. Other duties and projects as assigned.", "responsibilities": "Input, revise, and finalize correspondence, memoranda and other legal documents. Draft routine correspondence, memoranda and other documents. File legal documents in federal and state courts, including e-filing in all courts and agencies; prepare documents for service of process; prepare case shell documents for use by attorneys. Verify all attachments, exhibits and enclosures are included with transmittal letters/memos. Proofread documents and check for appropriate formatting, spelling and grammar. Maintain good public relations with clients. Review all incoming mail, distribute to teams as needed and upload to the DMS. Prepare documents and packages for mail, messenger and overnight delivery. Prepare expense reports, manage vendor invoices, mailings, and request checks as needed. Enter attorney time. Send time entry reminders. Process client billing. Assist with review and edit of bills as necessary. Schedule appointment and make arrangements for meetings, conferences and travel. Complete client/matter intake forms. Request conflicts of interest checks. Open new files. Prepare files to be closed. Coordinate and follow through on requests and projects with other support departments (e.g. receptionists, file/document clerks, office services). Provide overflow and absence coverage assistance as well as secretarial support for Secretarial Team Members attorneys. Other duties and projects as assigned.", "qualifications": {"required": "A minimum of 5 years of litigation secretarial experience. (Entertainment Litigation experience is a plus). Strong proofreading skills, attention to detail and solid grammar/spelling skills. High degree of proficiency with Microsoft programs (Word, Outlook, Excel). Legal citation and legal terminology expertise. Familiarity with iManage, Compulaw or similar technology. The ability to organize, prioritize and meet the demands off multiple attorney assignments. Flexibility to work overtime occasionally. Good attendance and punctuality.", "preferred": "Not specified"}, "skills": ["Litigation secretarial experience", "Proofreading skills", "Attention to detail", "Microsoft Office proficiency", "Legal citation expertise", "Organizational skills", "Ability to prioritize tasks", "Flexibility to work overtime"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3967269394"}