{"jobTitle": "Seasonal Sales Associate", "company": {"name": "Hot Topic", "industry": "Retail", "size": "51-200 employees", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Seasonal", "employmentType": "Temporary", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Join the loudest store in the mall! We're looking for music and pop culture fanatics to help create the best experience for our customers. As a Hot Topic Seasonal Sales Associate, you'll be a huge part of our success by providing the best customer service, ensuring that fellow fans can get their hands on the merch they love. You'll share your fandom knowledge, stock and replenish products, and help merchandise the store in a visually appealing way, all while being hyper-focused on the in-store experience.", "responsibilities": "Provide an amazing shopping experience that will encourage customers to return. They'll be impressed by your product knowledge, customer experience skills, and use of the Force. Cover the sales floor zone and ensure that assigned areas are up to visual standards. Work the register - you'll use your fandom knowledge to process sales transactions and drive add-on sales using additional benefits such as BOPIS and curbside pickup. Assist with planogram changes including store map, wall, fixture, & merchandising mix. Communicate fashion & music trend information to management and respective HQ partners. Work with Store Management to ensure there's no misuse of spells and wizardry around theft. Support the maintenance of the mother ship; you'll help keep the stock room organized and the store tidy. Communicate and work as a team to get the job done. Any other activities as assigned by your Store Leader.", "qualifications": {"required": "Previous experience working in a retail environment. If you love music and pop culture, you're in the right place! Superpowers in providing customer service and selling. You'll have to be at least 16 years of age to join the fandom force. Avenger-like collaboration and communication skills. The usual retail stuff (with or without reasonable accommodation): able to navigate your way around the store, merchandise product utilizing approved store equipment, and pack and unpack boxes of awesome merch that may weigh up to 50 pounds.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3968644163"}