{"jobTitle": "Marketing Project Manager", "company": {"name": "PIONEER INDUSTRIES", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Industrial Machinery Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Job Title:</strong> Marketing &amp; Project Manager<br/><br/>Ready to come to work for a small, agile, well-established faucet manufacturing company that's growing rapidly? At Pioneer Industries, we are seeking a highly organized and creative Marketing &amp; Project Manager to join our team. The ideal candidate will be responsible for overseeing marketing initiatives and managing projects from conception to completion. This role requires a combination of marketing expertise, project management skills, and the ability to collaborate with cross-functional teams to achieve business objectives. Additionally, the role involves communicating project status updates, milestones, and issues to the manager regularly, as well as conducting post-project evaluations to identify areas for improvement and lessons learned. This role reports directly to the VP of Marketing.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li> Assist in the develop and implementation of strategic marketing plans to drive brand awareness and customer engagement. </li><li> Participate in the planning and project management of content creation for marketing materials, including website copy, blog posts, and promotional materials. </li><li> Coordinate with graphic designers, content creators, and external agencies to produce high-quality marketing assets. </li><li> Monitor and analyze the performance of marketing campaigns using analytics tools and adjust strategies as needed. </li><li> Oversee the creation, production, and distribution of video content to support marketing campaigns and brand initiatives. </li><li> Manage merchandising projects, ensuring alignment with marketing strategies and brand guidelines. </li><li> Collaborate with sales teams to develop marketing collateral and support lead generation efforts. </li><li> Interface with project teams to ensure projects are delivered on time, and within project scope. </li><li> Communicate project status updates, milestones, and issues to manager regularly. </li><li> Conduct post-project evaluations to identify areas for improvement and lessons learned. </li><li> Stay up-to-date with industry trends and best practices in marketing and project management. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li> Bachelor’s degree in Marketing, or equivalent work experience. </li><li> 4-5 years of proven experience in marketing and project management roles. </li><li> Strong understanding of digital marketing strategies and tools. </li><li> Excellent communication, presentation, and interpersonal skills. </li><li> Ability to work effectively in a fast-paced environment and manage multiple priorities. </li><li> Proficiency in Microsoft Office Suite and Google Workspace. </li><li> Experience with Adobe Creative Suite, Hubspot, Salesforce, SAP B1 and Plytix a plus. </li><li> Certification in project management (e.g., PMP, CAPM) a plus. <br/><br/></li></ul><strong>Summary:<br/><br/></strong>This Marketing &amp; Project Manager position offers an exciting opportunity to lead innovative marketing initiatives and drive project success in a dynamic and collaborative environment. If you are passionate about marketing, have strong project management skills, and thrive in a results-driven team, we would love to hear from you. Apply now to join our team and make an impact!<br/><br/><strong>Benefits<br/><br/></strong>Company Description<br/><br/>About Pioneer Industries: The Pioneer family of brands has provided top-quality faucets and fixtures to builders, contractors and plumbers for more than three decades. Pioneer’s company culture is one of exceptional team work and a unified desire for growth. Pioneer offers a generous benefit package with vacation, health, dental &amp; vision insurance, 401K with up to 4% company match, and life insurance.<br/><br/>Benefits About Pioneer Industries: The Pioneer family of brands has provided top-quality faucets and fixtures to builders, contractors and plumbers for more than three decades. Pioneer’s company culture is one of exceptional team work and a unified desire for growth. Pioneer offers a generous benefit package with vacation, health, dental &amp; vision insurance, 401K with up to 4% company match, and life insurance.", "responsibilities": "Assist in the develop and implementation of strategic marketing plans to drive brand awareness and customer engagement.  Participate in the planning and project management of content creation for marketing materials, including website copy, blog posts, and promotional materials.  Coordinate with graphic designers, content creators, and external agencies to produce high-quality marketing assets.  Monitor and analyze the performance of marketing campaigns using analytics tools and adjust strategies as needed.  Oversee the creation, production, and distribution of video content to support marketing campaigns and brand initiatives.  Manage merchandising projects, ensuring alignment with marketing strategies and brand guidelines.  Collaborate with sales teams to develop marketing collateral and support lead generation efforts.  Interface with project teams to ensure projects are delivered on time, and within project scope.  Communicate project status updates, milestones, and issues to manager regularly.  Conduct post-project evaluations to identify areas for improvement and lessons learned.  Stay up-to-date with industry trends and best practices in marketing and project management.", "qualifications": {"required": "Bachelor’s degree in Marketing, or equivalent work experience.  4-5 years of proven experience in marketing and project management roles.  Strong understanding of digital marketing strategies and tools.  Excellent communication, presentation, and interpersonal skills.  Ability to work effectively in a fast-paced environment and manage multiple priorities.  Proficiency in Microsoft Office Suite and Google Workspace.", "preferred": "Experience with Adobe Creative Suite, Hubspot, Salesforce, SAP B1 and Plytix a plus.  Certification in project management (e.g., PMP, CAPM) a plus."}, "skills": ["Marketing", "Project Management", "Digital Marketing", "Communication", "Presentation", "Interpersonal Skills", "Microsoft Office Suite", "Google Workspace", "Adobe Creative Suite", "Hubspot", "Salesforce", "SAP B1", "Plytix", "PMP", "CAPM"], "postedDate": "1 month ago", "benefits": "Company Description<br/><br/>About Pioneer Industries: The Pioneer family of brands has provided top-quality faucets and fixtures to builders, contractors and plumbers for more than three decades. Pioneer’s company culture is one of exceptional team work and a unified desire for growth. Pioneer offers a generous benefit package with vacation, health, dental &amp; vision insurance, 401K with up to 4% company match, and life insurance.<br/><br/>Benefits About Pioneer Industries: The Pioneer family of brands has provided top-quality faucets and fixtures to builders, contractors and plumbers for more than three decades. Pioneer’s company culture is one of exceptional team work and a unified desire for growth. Pioneer offers a generous benefit package with vacation, health, dental &amp; vision insurance, 401K with up to 4% company match, and life insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3968937842"}