{"jobTitle": "High Desert Medical Assistant*", "company": {"name": "San Bernardino County", "location": "Hesperia, CA"}, "location": "Hesperia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Government Administration", "description": "The Department of Behavioral Health (DBH) and Public Health (DPH) are seeking Medical Assistants* for their High Desert Outpatient Mental Health Clinics and Federally Qualified Health Centers (FQHC)to assist healthcare providers and professional staff with the care of patients utilizing the population health management model in a public health care setting. This includes performing a variety of activities within the scope of a Medical Assistant Certificate. This position will utilize an Electronic Health Record (EHR) system to document collected data, perform patient intake and obtain information relating to examinations and tests; update records and actively conduct outreach to patients; provide education and information to facilitate patient compliance with appointments, tests, treatment plans and goals to support patients with self-management of disease and behavior modification; care coordination referral management and tracking; monitor established treatment plan, assist with medication management, tests and examinations; advise healthcare professionals of status and participate in the adjustment of patient-centered self-management goals as needed and will utilize chronic disease registry reports to identify disease trends and desired outcomes while understanding the Chronic Care Model. Performs front and back office duties as assigned.<br/><br/>This recruitment will be used to fill current and future vacancies within the High Desert (Hesperia, Victorville, Barstow) locations only.  Applicants will be asked to indicate their availability and preference for referral to departments and locations on the supplemental questionnaire.<br/><br/>For more detailed information, refer to the Care Assistant job description.<br/><br/><ul><li>Official Job Title: Care Assistant<br/><br/></li></ul>DEPARMENT OF PUBLIC HEALTH - FQHC<br/><br/>Our Federally Qualified Health Centers provide a wide range of low-cost, confidential health services. Our mission is to protect health, prevent disease, and promote health and well-being. We are here to give San Bernardino County residents health care in a friendly atmosphere. To learn more, click here .<br/><br/>CONDITIONS OF EMPLOYMENT<br/><br/>Assignment Location:  Incumbents hired for these positions will be assigned to work in the High Desert (Hesperia, Victorville, Barstow). Applicants who do not indicate a willingness to work in the High Desert will be disqualified.<br/><br/>Certification:  Must possess a Healthcare Provider level Basic Life Support (BLS) certification upon hire and maintain the certification throughout employment.<br/><br/>Work Conditions:  Working conditions may involve exposure to infectious materials.<br/><br/>Pre-employment Process:  Applicants must successfully pass a background check and a job-related physical exam, including a drug test, prior to employment.<br/><br/>Sponsorship: Please note San Bernardino County is not able to consider candidates who will require visa sponsorship at the time of application or in the future.<br/><br/>Minimum Requirements<br/><br/>Must possess all the following:<br/><br/>Certification<br/><br/>Must possess and maintain Provider level Basic Life Support (BLS) certification. Only American Heart Association BLS certifications will be accepted.<br/><br/>Education Successful completion of a Medical Assistant program.<br/><br/>Note: Required proof of a Medical Assistant program such as certificate or transcript is required and MUST be submitted with the application by the filing deadline. You may attach an electronic copy to your online application -OR- email an electronic copy to employment@hr.sbcounty.gov .<br/><br/>Experience<br/><br/>Six (6) months of full-time work experience, within the past two (2) years, assisting medical professionals with dressings, biopsies, treatments, procedures and performing screening tests in a medical environment.<br/><br/>Desired Qualifications<br/><br/>If you possess the following skills we encourage you to apply! <br/><br/><ul><li>Clerical experience to include performing a variety of office clerical tasks such as public contact, computer usage, data entry and answering the telephone. </li><li>Applicants fluent in American Sign Language, Arabic, Korean, Mandarin, Spanish and/or Vietnamese are strongly encouraged to apply. <br/><br/></li></ul>Bilingual Compensation:  Additional compensation is associated with positions requiring the use of bilingual skills. Testing of bilingual skills may be required to receive additional compensation.<br/><br/>Selection Process<br/><br/>Applications will be accepted continuously and reviewed on a regular basis. Interested applicants are encouraged to apply as soon as possible as this recruitment may close at any time. Resumes will not be accepted in lieu of the application and/or supplemental questionnaire.<br/><br/>Examination: There will be a competitive evaluation based on a review of the Application and Supplemental Questionnaire. It is to your advantage to include as much relevant and detailed work experience as possible.<br/><br/>All communications regarding the remainder of the selection process will be via email. Please be sure the email provided on this application is always current; it is your responsibility to update your personal information. Update your Spam, Junk, Bulk, and Firewall settings as needed to ensure that you receive all information pertaining to this recruitment.<br/><br/>To ensure timely and successful submission of your online application, please allow ample time to complete and submit your application before the posted filing deadline. Applicants will be automatically logged-out if they have not submitted the application and all required materials prior to the posted deadline. Once your application has been successfully submitted you will receive an onscreen confirmation and an email. We recommend that you save and/or print these for your records. Please note, if you do not receive an onscreen confirmation and an email acknowledging our receipt of your application we have not received your application.<br/><br/>If you require technical assistance, please click HERE to review the Government Jobs online application guide , or contact their Toll-Free Applicant Support line at (855) 524-5627. Please note that Human Resources is not responsible for any issues or delays caused by the internet connection, computer or browser used to submit the application.<br/><br/>EEO/ADA:  San Bernardino County is an Equal Employment Opportunity (EEO) and Americans with Disabilities Act (ADA) compliant employer, committed to providing equal employment opportunity to all employees and applicants.<br/><br/>ADA Accommodation: If you have a disability and require accommodations in the testing process, submit the  Special Testing Accommodations Request Form within one week of a recruitment filing deadline.<br/><br/>Veterans’ Preference: Eligible veterans and their spouse or widow(er) who are not current County employees may be awarded additional Veterans’ Preference points. Click here for information and instructions to request Veteran's Preference points.<br/><br/> Please click HERE for important Applicant Information and the County Employment Process  .", "responsibilities": "The Department of Behavioral Health (DBH) and Public Health (DPH) are seeking Medical Assistants* for their High Desert Outpatient Mental Health Clinics and Federally Qualified Health Centers (FQHC)to assist healthcare providers and professional staff with the care of patients utilizing the population health management model in a public health care setting. This includes performing a variety of activities within the scope of a Medical Assistant Certificate. This position will utilize an Electronic Health Record (EHR) system to document collected data, perform patient intake and obtain information relating to examinations and tests; update records and actively conduct outreach to patients; provide education and information to facilitate patient compliance with appointments, tests, treatment plans and goals to support patients with self-management of disease and behavior modification; care coordination referral management and tracking; monitor established treatment plan, assist with medication management, tests and examinations; advise healthcare professionals of status and participate in the adjustment of patient-centered self-management goals as needed and will utilize chronic disease registry reports to identify disease trends and desired outcomes while understanding the Chronic Care Model. Performs front and back office duties as assigned.", "qualifications": {"required": "Must possess and maintain Provider level Basic Life Support (BLS) certification. Only American Heart Association BLS certifications will be accepted.<br/><br/>Successful completion of a Medical Assistant program.<br/><br/>Note: Required proof of a Medical Assistant program such as certificate or transcript is required and MUST be submitted with the application by the filing deadline. You may attach an electronic copy to your online application -OR- email an electronic copy to employment@hr.sbcounty.gov .<br/><br/>Six (6) months of full-time work experience, within the past two (2) years, assisting medical professionals with dressings, biopsies, treatments, procedures and performing screening tests in a medical environment.", "preferred": "Clerical experience to include performing a variety of office clerical tasks such as public contact, computer usage, data entry and answering the telephone. \nApplicants fluent in American Sign Language, Arabic, Korean, Mandarin, Spanish and/or Vietnamese are strongly encouraged to apply."}, "skills": ["Basic Life Support", "Medical Assistant", "Clerical", "American Sign Language", "Arabic", "Korean", "Mandarin", "Spanish", "Vietnamese"], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3968687863"}