{"jobTitle": "STORE MANAGER", "company": {"name": "Dollar Tree Stores", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Store Dollar Tree<br/><br/>Work where you love to shop! Dollar Tree is hiring in your neighborhood. Avoid long commutes and set your own course to success by applying today.<br/><br/>We offer generous benefits, flexible work schedules and the ability to work today and get paid tomorrow.<br/><br/><strong>Store Managers </strong>at Dollar Tree are responsible for the following:<br/><br/><ul><li>Managing the profitable operation of a retail store with emphasis on recruiting, hiring, training and developing store associates in both operations and merchandising</li><li>Performing all opening and closing procedures</li><li>Implementing all operational and merchandising direction that is communicated from the Store Support Center</li><li>Maintaining a high standard of merchandising, placement, store signage, and proper display techniques to create an inviting atmosphere for customers</li><li>Assisting in the realization of your store's maximum profit contribution</li><li>Protecting all company assets</li><li>Maintaining a high level of good customer service</li><li>Creative problem solving in the areas of:</li><ul><li>Associate Development</li><li>Maximizing Sales Potential</li><li>Controlling Expense and Shrink</li><li>Merchandise Display</li><li>Store Signage Placement<br/><br/><br/></li></ul></ul><strong>What we need from you:<br/><br/></strong><ul><li>Must possess minimum 3 years prior retail management experience</li><li>Background in dealing with hardlines or variety merchandise, BIG BOX experience a plus</li><li>Strong productivity management ability in freight processing</li><li>Strong communication, interpersonal and written skills</li><li>Ability to work in a high-energy team environment<br/><br/><br/></li></ul>Dollar Tree proudly offers our full-time store management Associates with an opportunity to earn a bonus each month if key performance goals are achieved.<br/><br/>We value our Associates' contributions to our success, which drives us to invest in the most important element of our organization: our people.<br/><br/>As we work towards a healthier future, we provide eligible associates with the following:<br/><br/>Health and welfare programs including medical, pharmacy, dental, and vision<br/><br/>Employee Assistance Program<br/><br/>Paid Time Off<br/><br/>Retirement Plans<br/><br/>Employee Stock Purchase Program<br/><br/><em>NOTE: There are differences in job duties for our store types that may vary from this job posting. Review our job descriptions posted on our Career Center.<br/><br/></em>Dollar Tree is an equal opportunity employer.", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3968635300"}