{"jobTitle": "Solar Sales Representative _ Entry Level", "company": {"name": "VITL Power", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Solar Electric Power Generation", "description": "Job Description<br/><br/><strong>Position: Solar Sales <br/><br/></strong><strong>Location: San Fernando, CA <br/><br/></strong><strong>Pay:</strong> This position is full commission. Learn more about our commission structure here:<br/><br/>https://vitlpaycalculator.com/ password: vitlrep<br/><br/><strong>Why Us<br/><br/></strong><ul><li>Very competitive uncapped commission structure!</li><li>Company events and contests for healthy competition and team fun!</li><li>Prizes, bonuses, company trips other incentives often!</li><li>We strive to institute a culture that makes you want to stay</li><li>At VITL, good energy is the culture of our business. We empower our energy consultants so they can bring clean energy to the consumer. </li><li>Our partnership with the largest solar installer in the country, Freedom Forever, allows us to sell in 35 states nationwide and sell at a lower cost than all of our competitors. </li><li>4.6 out of 5* rating on google reviews. </li><li>Become the most uncommon and best version of yourself; mentally, emotionally, spiritually, and financially. </li><li>Transparency is our policy. No gimmicks, just straightforward, honest service. <br/><br/></li></ul><strong>Overview:<br/><br/></strong>VITL Energy is the largest residential solar sales organization in the United States (1,800+ active representatives). Our Freedom Forever and Sunrun partnerships mean we have the fastest installation timelines and the most competitive prices in the industry. Our proprietary CRM, LMS, and our experienced sales leadership provides training and advancement opportunities few companies can match.<br/><br/>VITL is hiring for solar sales for our expanding San Fernando region! We strongly encourage candidates of all different backgrounds and identities to apply. Each new hire is an opportunity for us to bring in a different perspective, and we are always eager to diversify our company further. VITL s committed to building an inclusive, supportive place for you to do the best and most rewarding work of your career.<br/><br/>Everyone starts somewhere, but the best make it to VITL!<br/><br/><strong>INDUSTRY<br/><br/></strong>The solar industry worldwide is expected to grow by 4x from $52B in 2018 to $223B in 2026 (alliedmarketresearch.com 1/2021). With incentives increasing and the cost of Solar power decreasing, the Solar Power industry is growing rapidly. Keeping up with demand is exciting and provides immense opportunity. We are in need of good people to help identify the homes that may be a good fit for Solar power. As Marketing Consultants, we introduce the idea and set up times for the design team to educate them on their options for moving to clean renewable energy.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Prospecting (canvassing) defined residential neighborhoods. </li><li>Collecting energy usage rates from homeowners to evaluate solar viability. </li><li>Setting solar home design appointments. </li><li>Building and presenting proposals. <br/><br/></li></ul><strong>About You<br/><br/></strong>We’re looking for someone with strong communication skills and attention to detail. You should either have experience in the service industry or sales and be willing to learn more about the solar industry.<br/><br/><strong>Company Description<br/><br/></strong>Imagine a world where solar isn’t a niche. It’s an enhancement to your every day life both at your home and in your wallet.<br/><br/>Uncommon Energy: We're not just slapping panels on roofs; improve the earth by positively impacting families and friends every day right at their home, with solar.<br/><br/>Transparency is our policy. No gimmicks, just straightforward, honest service.<br/><br/>We partnered with Freedom Forever to gain access to top-notch solar technology, nationwide installation, and industry expertise.<br/><br/>Imagine a world where solar isn’t a niche. It’s an enhancement to your every day life both at your home and in your wallet. Uncommon Energy: We're not just slapping panels on roofs; improve the earth by positively impacting families and friends every day right at their home, with solar. Transparency is our policy. No gimmicks, just straightforward, honest service. We partnered with Freedom Forever to gain access to top-notch solar technology, nationwide installation, and industry expertise.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3968921408"}