{"jobTitle": "Regional Sales Manager", "company": {"name": "Globe Life", "industry": "Internet Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Globe Life is looking for a Sales Manager to join our team as part of the AO agency. The Sales Manager is responsible for increasing performance within their agency, understanding the importance of building and maintaining relationships, communicating effectively with clients, motivating the team, and projecting an environment of continuous learning. The ideal candidate will provide coaching and leadership to those on the sales team, while working to build their own team. This role will motivate and guide the team towards reaching all sales goals. This person will be a leader within the agency, and will have strong customer service and proven negotiating skills. This is a remote role, all applicants need a computer and strong WIFI connection. Requirements: Sales experience preferred, but not required. Must be allowed to work in the United States. Must be able to pass a background check. About Globe Life: Globe Life: AIL is a longstanding insurance organization dedicated to servicing working families. AIL is the exclusive subsidiary of Globe Life that has partnered up with thousands of union associations and veteran groups throughout the United States, and has provided the permanent insurance benefits for their members since 1951. Our employees enjoy a work culture that promotes growth and learning throughout your career, with top producers assisting in training on a regular basis. Our company goes above and beyond to make sure that all agents have the tools they need to be successful in a sales role. Globe Life offers health benefits to full time employees, and gives you the opportunity to build residual income that will last a lifetime. You'll also be fully trained by a team of our top producers, regardless of past sales/insurance experience. Employees can also take advantage of a casual dress code, and a completely work-from-home career!", "responsibilities": "Not specified", "qualifications": {"required": "Sales experience preferred, but not required. Must be allowed to work in the United States. Must be able to pass a background check.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Health benefits to full time employees, opportunity to build residual income, fully trained by top producers, casual dress code, work-from-home career.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3968914120"}