{"jobTitle": "Director, Digital Marketing", "company": {"name": "Murad", "industry": "Personal Care Product Manufacturing", "size": "51-200 employees", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00 - $180,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "Murad Skincare has a 30-year legacy of developing clinically proven products that are backed by science and cruelty-free. Founded by dermatologist Dr. Howard Murad, we follow four pillars of wellness to create products and experiences for happier lives: Eat your water, be kind to your mind, nourish your skin, and awaken your body. We’re proud to be part of the Unilever prestige family that works every day towards enhancing sustainability and inclusivity. We stand against discrimination and hate, and actively advocate for inclusion: so much so that one of our core values is respect, connect, and appreciate. Our team members are as diverse as they are talented—each bringing a unique perspective to an environment that encourages coloring outside of the lines, speaking up, and collaboration—and we’re ready for you to join our team!", "responsibilities": "Own departmental P/L and develop forecasts and budgets monthly, quarterly, annual, and as needed. Provide leadership and strategy for North America online marketing including overseeing murad.com and muradskincare.ca. Drive quality customers to dotcom through multiple online channels and, using attribution models, determine the optimal mix across channels (SEM/SEO, display, email, affiliates, and paid social). Lead CRM and loyalty initiatives through partnerships with analytics, IT and product management. Manage a team of 3 direct reports and various agency relationships. Must be able to provide leadership guide direct reports and encourage growth. Manage resources and project management to ensure all programs are executed seamlessly, efficiently, on time and within budget. Responsible for analyzing direct response marketing, including segmentation, list and vendor management, and reporting. Drive consumer research and analysis to increase sales and improve customer experience. Oversee the building and maintaining of relationships with online partners and vendors, including online retailers. Crafting and negotiating vendor contracts. Keep current with the latest e-commerce trends and technology to keep Murad.com competitive in the online arena. Identify areas of new opportunities within the online space and make ROI-based recommendations. Work with Global Marketing and Creative to generate high-performing creative for all online marketing channels. Act as the primary liaison between online marketing and several other internal departments including Global Marketing, creative, IT, accounting/finance, project & product management and customer service.", "qualifications": {"required": "Experience 10+ Years of online marketing experience with 3-4 years in a senior manager or director role. Experience in online retail and/or beauty preferred. Candidate should have successful and well-rounded experience with e-commerce and web production. Must have excellent oral and written communication skills and be comfortable presenting complex models and marketing results to senior executives. Candidate must possess strong strategic and tactical skills, as well as technical skills. Candidate must have an intimate understanding of the creative process and have experience working with and evaluating creative work products.", "preferred": "The ideal candidate is a strong self-starter with experience in managing marketing projects, direct marketing projects, technology-based solutions, and implementing global, e-commerce marketing strategies. Candidate must also have strong organizational skills, an entrepreneurial attitude, and a proactive business style. Experience managing multiple vendors, 3rd party systems, processes, and projects is required. Exceptional business case analysis, planning, project management, and presentation skills."}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Unlimited Paid Time Off, Medical, Dental, Vision Insurance, FSA/HSA, Life/Accident Insurance, Employee Assistance Program (EAP), Professional Development Resources, 401(k) Employer Match Program.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3969676872"}