{"jobTitle": "Head of Business Development", "company": {"name": "Robert Walters", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "Our esteemed client is a pioneering liquidity fund and enterprise that has crafted the forthcoming generation of liquidity instruments for shareholders of advanced-stage, venture-supported private corporations. With an impressive $2b AUM and three fund vintages, their mission is to offer liquidity resolutions to some of the most dynamic businesses globally. They are in search of a highly driven and meticulous Director of Business Expansion.<br/><br/>As Head of Business Development, you will play a crucial role in shaping our client's global reach.<br/><br/>You will establish team priorities, manage significant relationships, close deals, cultivate networks amongst C-level executives at target corporations, assist in shaping the team's focus, execute established prospecting strategies, think like an investor bringing new opportunities to the IC team, educate clients on presenting structured liquidity solutions, manage partnerships across various financial institutions providing deal flow to us, generate proposals reflecting client's holdings for each sales opportunity and be responsible for the closing process.<br/><br/><strong>What You Bring<br/><br/></strong><ul><li>The ideal Director of Business Expansion will bring a wealth of experience and knowledge to the role.</li><li>BA/BS degree and 5-7 years of experience in investing or business expansion from a top quartile financial institution or asset manager within the VC or technology space</li><li>Acomprehensive understanding of high-level selling techniques.</li><li>Exceptional written and verbal communication skills will enable you to simplify complex subjects effectively.</li><li>Strong executive presence will allow you to interface effectively with C-level managers, while your exceptional levels of empathy, integrity, and interpersonal skills will ensure successful relationships with clients and team members alike.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3969232498"}