{"jobTitle": "Lead Program Manager, Business Operations (GM) - USDS", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "104,711.00/yr - 192,533.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/> About TikTok U.S. Data Security<br/>TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. U.S. Data Security (“USDS”) is a subsidiary of TikTok in the U.S. This new, security-first division was created to bring heightened focus and governance to our data protection policies and content assurance protocols to keep U.S. users safe. Our focus is on providing oversight and protection of the TikTok platform and U.S. user data, so millions of Americans can continue turning to TikTok to learn something new, earn a living, express themselves creatively, or be entertained. The teams within USDS that deliver on this commitment daily span across Trust &amp; Safety, Security &amp; Privacy, Engineering, User &amp; Product Ops, Corporate Functions and more.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>Team Intro<br/>The Lead Program Manager, Business Operations (GM) will report to the Chief of Staff, General Manager in USDS and will be a core member of the team that connects cross-functional business initiatives. The teams primary goals are to actualize the GM's strategic vision by enabling business strategy with low operational risks, costs, and within the parameters of U.S. compliance mandates. <br/><br/>The Lead Program Manager, Business Operations (GM) will focus on meeting and exceeding business and service expectations through continuous improvement of USDS operational processes. The Lead Program Manager, Business Operations (GM) will also be responsible for working with TikTok's product and user facing teams around the world to identify and remediate gaps to align on roles and responsibilities and improve service level agreements, efficiencies. The Lead Program Manager, Business Operations (GM) will have an opportunity to develop a deep understanding of the USDS and global TikTok organization, build and lead essential cross-functional programs across the global organization, and think both strategically and tactically to break down problems into actionable solutions. The ideal candidate has an enthusiasm for high-level strategic thinking, cross-functional partnership and collaboration, and on-the-ground execution.<br/><br/>Responsibilities<br/>- Collaborate with GM and senior leadership team to drive USDS' change management efforts by identifying areas for strategic changes, leading large-scale transformation programs, defining the overall transformation journey, setting milestones, and determining success metrics.<br/>- Understand the TikTok business by developing strong, trusting relationships with XFN partners to identify operational gaps and provide relevant data that can drive strategic solutions. <br/>- Analyze and anticipate needs from compliance and operational stand points, internal capabilities, and potential opportunities to provide data-backed insights that influence USDS' strategic direction. <br/>- Develop and maintain key performance metrics, including organizational OKRs, to track the success of our strategic and operational efforts. Regularly report progress to the GM and other senior leaders, using data-driven insights to inform decisions and drive accountability. <br/><br/>Qualifications<br/><br/> Minimum Qualifications<br/>- Bachelor's degree and 5+ years of experience in strategy, mergers &amp; acquisitions, strategy. Consulting experience is highly desired in addition to working within a high-growth technology company. <br/>- Experience in building a project from kick-off to close, specifically, planning and leading initiatives with a strong ability to align stakeholders<br/>- Demonstrated ability and comfort with data analysis for the purpose of storytelling and consensus-building<br/>- Strong problem-solving skills along with excellent writing and editing skills, with experience writing for different audiences<br/>- Ability to effectively interface with stakeholders and internally across cross-functional teams across the globe and influence decisions. <br/><br/>Preferred Qualifications<br/>- Extremely versatile, dedicated to efficiency, optimization, and streamlining process and work<br/>- Experience working in a fast-paced environment with little room for error, highly organized, detail-oriented, ability to work with little oversight, and take initiative<br/>- Ability to rapidly shift priorities based on evolving priorities and challenges<br/>- Comfortable presenting and communicating across all levels of leadership <br/><br/>D&amp;I Statement<br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>Accommodation Statement<br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/ktJP6<br/><br/>Data Security Statement<br/>This role requires the ability to work with and support systems designed to protect sensitive data and information. As such, this role will be subject to strict national security-related screening. <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $104711 - $192533 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Collaborate with GM and senior leadership team to drive USDS' change management efforts by identifying areas for strategic changes, leading large-scale transformation programs, defining the overall transformation journey, setting milestones, and determining success metrics.\n- Understand the TikTok business by developing strong, trusting relationships with XFN partners to identify operational gaps and provide relevant data that can drive strategic solutions. \n- Analyze and anticipate needs from compliance and operational stand points, internal capabilities, and potential opportunities to provide data-backed insights that influence USDS' strategic direction. \n- Develop and maintain key performance metrics, including organizational OKRs, to track the success of our strategic and operational efforts. Regularly report progress to the GM and other senior leaders, using data-driven insights to inform decisions and drive accountability. ", "qualifications": {"required": "- Bachelor's degree and 5+ years of experience in strategy, mergers &amp; acquisitions, strategy. Consulting experience is highly desired in addition to working within a high-growth technology company. \n- Experience in building a project from kick-off to close, specifically, planning and leading initiatives with a strong ability to align stakeholders\n- Demonstrated ability and comfort with data analysis for the purpose of storytelling and consensus-building\n- Strong problem-solving skills along with excellent writing and editing skills, with experience writing for different audiences\n- Ability to effectively interface with stakeholders and internally across cross-functional teams across the globe and influence decisions. ", "preferred": "- Extremely versatile, dedicated to efficiency, optimization, and streamlining process and work\n- Experience working in a fast-paced environment with little room for error, highly organized, detail-oriented, ability to work with little oversight, and take initiative\n- Ability to rapidly shift priorities based on evolving priorities and challenges\n- Comfortable presenting and communicating across all levels of leadership "}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3969861240"}