{"jobTitle": "Design Associate", "company": {"name": "Floor Coverings International", "location": "Hermosa Beach, CA"}, "location": "Hermosa Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "49,000.00 - 70,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Retail", "description": "Our unique shop-at-home model allows customers to get perfect new floors without leaving their home and our 350,000+ customers give us an average of 4.7 star rating. That's a big reason why we are growing six times faster than our competitors and why we have an immediate need hire Sales / Design Associates across the nation. We are looking for hard-working, service-minded individuals who love to have fun.<br/><br/>To thrive in this role, you’ll need to be self-motivated, an independent worker, a great communicator, highly organized, and enjoy a team atmosphere. We are looking for an individual who isn’t afraid to work hard, including some evenings and weekends. The right individual will play a key part in the expansion of this company and will have the opportunity to grow as the company grows.<br/><br/><strong>Design Associate Job Details &amp; Perks<br/><br/></strong><ul><li>No experience required</li><li>Paid training provided</li><li>Full-time</li><li>Annual company convention in Cabo, Mexico</li><li>Company car for work appointments (insurance and gas covered by company)<br/><br/></li></ul><strong>Design Associate Key Responsibilities<br/><br/></strong><ul><li>Go out to client’s homes and meet with them regarding their flooring project</li><li>Follow our Sales System using our tablet, laptop, and software (non-negotiable)</li><li>Act as the single point of contact to the customer for all types of flooring service requests</li><li>Coordinate installation time and communication schedule with Office Manager</li><li>Communicate customer needs/expectations to Install Manager to make jobs go smoothly</li><li>Ability to maintain customer relationships and develop key referral sources to generate ongoing business </li><li>Engage in on-going training/educational requirements (may involve travel at company expense)<br/><br/></li></ul><strong>Pay:</strong> Potential earnings are $60,000 for the average Design Associate. Above-average Design Associates earn $80,000 to $100,000+.<br/><br/>Flexible work from home options available.<br/><br/>Compensation: $49,000.00 - $70,000.00 per year<br/><br/>Floor Coverings International is the #1 mobile flooring franchise in North America. Our unique shop-at-home model allows customers to get perfect new floors without ever leaving their home. Our 400,000+ customers give us an average 4.8 star rating. That's a big reason why we're growing six times faster than our competitors. This rapid growth has increased our immediate need to keep up with demand by increasing the size of our teams. If you are a service-minded individual who loves to have fun – we are the company for you!<br/><br/><em> This franchise is independently owned and operated by a franchisee. Your application will go directly to the franchisee, and all hiring decisions will be made by the management of this franchisee. All inquiries about employment at this franchisee should be made directly to the franchise location, and not to Floor Coverings International Corporate.</em>", "responsibilities": "<ul><li>Go out to client’s homes and meet with them regarding their flooring project</li><li>Follow our Sales System using our tablet, laptop, and software (non-negotiable)</li><li>Act as the single point of contact to the customer for all types of flooring service requests</li><li>Coordinate installation time and communication schedule with Office Manager</li><li>Communicate customer needs/expectations to Install Manager to make jobs go smoothly</li><li>Ability to maintain customer relationships and develop key referral sources to generate ongoing business </li><li>Engage in on-going training/educational requirements (may involve travel at company expense)<br/><br/></li></ul>", "postedDate": "2 months ago", "benefits": "Paid training provided, Annual company convention in Cabo, Mexico, Company car for work appointments (insurance and gas covered by company)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3969149355"}