{"jobTitle": "Director Ambulatory Clinical Practice", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>The Director Ambulatory Practice supports the Medical Group Administrative Team as the recognized leader in understanding and interpreting standards for ambulatory clinical practice, as well as applying, evaluating and improving those standards to ensure ambulatory clinical practices meet all regulatory requirements and organizational policies and procedures, concurrently supporting the quality, service and financial goals and objectives of Kaiser Permanente. For the Medical Office Buildings and other ambulatory hospital-based settings associated with the Medical Center, the Director Ambulatory Practice is accountable for designing , implementing, evaluating and improving systems, methods and strategies to maintain and improve the compliance of ambulatory care service delivery, clinical quality, clinical processes/systems, performance, patient satisfaction / safety, practice standards and the effectiveness of patient care with regulatory and organizational / institutional requirements and / or standards. The Directors responsibility may include for providing operations management for multiple ambulatory care/outpatient departments and managing non-physician clinical, technical and support staff as assigned by the Chief Administrative Officer and Medical Director.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Contributes to the overall development of programs and services in order to provide for the needs of members, managers, physicians and staff Acts as consultant to the Medical Group Administrative Team regarding high quality, cost-effective ambulatory practice issues and efficient management of staff in accordance with goals and objectives - clinical, regulatory, scope of practice, workplace processes, and clinical competencies for ambulatory disciplines. </li><li>Directs the coordination/integration of outpatient services between departments and across the continuum of care and directs the continuous improvement of all clinical practices, services and operations by design and implementation of systems, processes and methods to evaluate and improve patient care. </li><li>Acts as consultant to the Medical Group Administrative Team regarding high quality, cost-effective ambulatory practice issues and efficient management of staff in accordance with goals and objectives - clinical, regulatory, scope of practice, workplace processes, and clinical competencies for ambulatory disciplines. </li><li>Participates as part of management team in formulating, implementing and evaluating business plans/strategies for ambulatory care services and responsible for achieving both short and long term strategic, business and financial goals/objectives. </li><li>Maintains and applies knowledge of scope of practice, best practices, standardized procedures, workflow processes and state and federal and regulatory agencies pertaining to ambulatory care. </li><li>Develops effective and accurate communication strategies related to ambulatory care issues for: Chief Administrative Officer, Assistant Medical Group Administrators, Department Administrators, Nurse Executive, Compliance Officer, Risk Manager, Accreditation, Regulations and Licensing Department, Education Department for members, staff and physicians, Performance Improvement Department, Human Resources, Medical Staff Office, Ombudsman, Leadership Team (MCOT/MCAT), Finance, Medical Group physicians/Chiefs of Service, Ancillary Staff, Allied Health Professionals, Public Affairs Department, Organizational Effectiveness, Inpatient Departments, Continuing Care Departments, and Ancillary Departments - laboratory and radiology. </li><li>Serves as a highly visible expert consultant and advisor to senior SCPMG and KFH/HP leadership, Chief Nursing Officer, Licensed Allied Health Professionals, Advance Practice Providers, physicians and staff to assure appropriate scope of practice, competent clinical care, and professional staff performance. </li><li>Serves an expert authority / resource for ambulatory care nursing. </li><li>Builds effective relationships and collaborates with physicians in establishing, implementing, maintaining and evaluating/improving patient care and quality service standards to meet members and internal clients expectations. </li><li>Participates in community relations activities to enhance the image and reputation of the organization</li><li>May represent the organization in activities involving leaders in business, government, labor, the community at large, health plan members and health care providers in the MSA. </li><li>Leads implementation of Regional or local special initiatives such as but not limited to : HealthConnect deployment, processes and scope of practice issues, Care Management Models, NP role in primary care, UPIN projects, SOSA, CRNA site survey, MA medication dose verification audit, Medi- Cal/Medicare audits. </li><li>Provides leadership regarding compliance with the establishment of targets, implementation of special initiatives and compliance monitoring. </li><li>Participates on assigned committees at Regional and Medical Center levels. Regional: Ambulatory Clinical Practice Committee Medical Center: Ambulatory Clinical Practice Committee, HealthConnect Steering Committee, Ambulatory Policy and Procedure Committee, Infection Control, Safety, Outpatient Medical Records Committee, Leadership Team, Interdisciplinary Practice Committee, Labor Management Partnership Steering Committee, Advance Practice Committee. </li><li>Demonstrate professional demeanor to physicians, staff and administrative team. </li><li>Has ability to collaborate and lead through influence to implement initiatives. </li><li>Act as a resource for the development and review of ambulatory clinical department policies and procedures. </li><li>Identifies clinical practice educational needs for staff, managers and self, and is active in professional organizations as appropriate. </li><li>Clinical Operations Management Role:</li><li>For assigned departments / staff, responsible for the day to day operations by directing the nursing and patient care staff to develop, implement, monitor and evaluate/improve nursing standards of practice, service priorities and performance/outcome measures, as well as with strategic, business and organizational goals/objectives. </li><li>Evaluates and continuously improves clinical/department processes / systems and performance by providing direction to non-physician staff in order to achieve effective and efficient operations, operational and clinical goals/objectives, as well as planning, promoting and implementing best practice models. </li><li>In collaboration with the CAO and the Medical Director, directly and/or through subordinates plans, organize, directs and controls the operations of assigned departments within the Medical Group. Directly and with subordinate managers, establishes and maintains operational, clinical and performance standards. </li><li>Develops and manages budgets and resource allocation. Monitors financial performances and identifies and implements strategies to reduce costs and improve quality of care and service. </li><li>Manages human resources functions for assigned non- physician staff. </li><li>Implements and maintains clinical and patient care practice standards, budgets, and staff development. <br/><br/></li></ul><strong>Experience<br/><br/></strong><strong>Basic Qualifications:<br/><br/></strong><ul><li>Minimum five (5) years of experience in management of ambulatory care or other related clinical area. <br/><br/></li></ul>Education<br/><br/><ul><li>Bachelors Degree in Nursing<br/><br/></li></ul>License, Certification, Registration<br/><br/><ul><li>Registered Nurse License (California)<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Demonstrated ability to utilize interpersonal skills, communication, leadership, planning, presentation, analytical and problem solving skills. </li><li>Demonstrated ability to work effectively and collaboratively in a Labor-Management Partnership environment. </li><li>Ability to demonstrate knowledge of applicable federal, state laws and regulations related to health care (California Board of Registered Nursing, California Board of Licensed Vocational Nursing, California Department of Consumer Affairs-Business and Professions Code, California Board of Medicine, and Regulatory Agencies including TJC, NCQA, Title 22, CMS, DHS, Medi-Cal) regarding ambulatory clinical practice issues, scope of practice for ambulatory disciplines, workplace processes and clinical competencies. </li><li>Demonstrated interpersonal and communication skills. </li><li>Knowledge of ambulatory care practices, operations and local, state and federal regulatory standards. </li><li>Ability to conduct business and financial planning. </li><li>Must be able to work in a Labor/Management Partnership environment. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Labor Management experience</li><li>ANCC Certification Ambulatory Care Nurse</li><li>Masters degree in health services administration, nursing, management, business administration degree OR two (2) years of experience in patient care/clinical services.</li></ul>", "postedDate": "1 month ago", "qualifications": {"required": "Minimum five (5) years of experience in management of ambulatory care or other related clinical area. <br/><br/>Bachelors Degree in Nursing<br/><br/>Registered Nurse License (California)<br/><br/>Demonstrated ability to utilize interpersonal skills, communication, leadership, planning, presentation, analytical and problem solving skills. \nDemonstrated ability to work effectively and collaboratively in a Labor-Management Partnership environment. \nAbility to demonstrate knowledge of applicable federal, state laws and regulations related to health care (California Board of Registered Nursing, California Board of Licensed Vocational Nursing, California Department of Consumer Affairs-Business and Professions Code, California Board of Medicine, and Regulatory Agencies including TJC, NCQA, Title 22, CMS, DHS, Medi-Cal) regarding ambulatory clinical practice issues, scope of practice for ambulatory disciplines, workplace processes and clinical competencies. \nDemonstrated interpersonal and communication skills. \nKnowledge of ambulatory care practices, operations and local, state and federal regulatory standards. \nAbility to conduct business and financial planning. \nMust be able to work in a Labor/Management Partnership environment. <br/><br/>", "preferred": "Labor Management experience\nANCC Certification Ambulatory Care Nurse\nMasters degree in health services administration, nursing, management, business administration degree OR two (2) years of experience in patient care/clinical services."}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3969515925"}