{"jobTitle": "Head of Events", "company": {"name": "UnitedMasters", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "170,000.00 - 200,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Musicians", "description": "Who We Are<br/><br/>UnitedMasters is building a marketplace that connects artists, brands and fans - empowering artists to earn and grow. UnitedMasters has taken the bold step of building a music distribution service that, radically, puts artists first - disrupting the legacy music business by letting up-and-coming artists distribute their music directly to fans through streaming services while maintaining ownership of their master recording rights and up to 100% of royalties. Through the combination of UnitedMasters’ music distribution platform and its deep ties to brands, UnitedMasters enables independent artists and change-makers to grow and earn unlike any other platform.<br/><br/>The UnitedMasters team is made up of musicians, marketers, engineers, and storytellers with backgrounds from YouTube, SoundCloud, Pandora, Facebook, Uber, Dropbox, Complex, VICE, and more. We work hand in hand with the award-winning creative teams that forge those innovative partnerships at Translation (our in-house creative advertising agency).<br/><br/>We are looking for a Head of Events to join UnitedMasters! *Please note that this role is a Hybrid role based in New York City: three days in office and two days remote. <br/><br/>What You'll Do<br/><br/>Lead the events practice at UnitedMasters, responsible for the management and oversight of multiple functions and stakeholders for the planning and execution of high-profile, revenue-generating events that celebrate, engage and grow our community of independent artists (e.g. SelectCon, Grammys Weekend, SXSW and Art Basel). You will:<br/><br/><ul><li>With input from internal stakeholders, define the event roadmap for UnitedMasters, balancing the needs of Marketing and Sales/Client sponsors. </li><li>For each event on the roadmap, review a brief that communicates the vision of the project and recommend the experience (format, venue, run of show, etc.) that best meets Marketing and Sponsor KPIs with consideration for both the strategic narrative as well as brand and budget parameters. </li><li>Program &amp; Event Management: You will holistically manage and be accountable for each event end-to-end, with inputs from internal/external stakeholders inclusive of Marketing, Talent, PR/Comms, Production, Project Management, Vendors, Sales and client sponsors; you will drive effective and efficient collaboration by leading internal project kick-offs and regular cross-functional meetings (with support from project manager) and retrospective debriefs. </li><li>Budget &amp; Financial Management: Forecast budget, manage and optimize spend across the annual event portfolio and individual projects. Make day-to-day decisions about project spend to most effectively and impact-fully achieve project KPIs. </li><li>Build, manage and develop a high-performing Events team inclusive of event production,, talent, and project management. </li><li>Manage vendors and internal collaborators as day-to-day lead inclusive of Production (experiential and digital), Marketing, Talent management, Publicist, Social, Sales, Branded Content </li><li>Provide experiential expertise and input to creative look and feel, marketing, talent casting, FOH (invite/ticketing) strategy</li><li>Oversee the execution of creative direction across all event assets (from stage design to printed signage and more) with input and approvals from Marketing and Sponsors (via Sales/Client Services teams) as needed</li><li>Map out guest experience for each group - from invite to thank you email </li><li>Proactively identify sponsorship opportunities and concept meaningful ways for brands to integrate into events and partner with sales to concept, sell &amp; execute custom integrations </li><li>Collaborate with Group Executive Producer to recruit and contract top tier producers and external vendors </li><li>Create documentation, systems, tools and processes to continuously evolve the blueprint for events</li><li>Ensure every event &amp; experience UMT creates is inclusive &amp; accessible<br/><br/></li></ul>Knowledge, Skills And Abilities<br/><br/><ul><li>Strategic Planning: Ability to develop and implement event strategies aligned with UnitedMasters' goals and KPIs, including selecting culturally relevant moments to participate in and defining clear project objectives. </li><li>Communication and Leadership: Excellent communication skills to articulate the vision and strategy of each project, lead interdepartmental efforts, and effectively collaborate with various teams and stakeholders. You possess the gravitas and interpersonal skills to confidently engage senior leadership, influential executives, celebrity talent and project teams from top to bottom. </li><li>Program Management: You have a proven ability to manage a portfolio of events simultaneously that balance Marketing and Sponsor KPIs at budget and on time. </li><li>Operational Excellence: You possess strong organizational skills with proven ability to create and manage an annual event calendar and master interdepartmental work plans. You have a track record of ensuring cross-functional teams work effectively to meet key milestones across events. </li><li>System and Process Development: You think in playbooks and plan for repetition/scale. You have the ability to create and implement systems, tools, and streamlined processes that strengthen the events department and enable it to operate effectively. </li><li>Team Management: You have strong leadership and people management skills to oversee both freelance and full-time events teams, providing guidance, direction, accountability and day-to-day management. </li><li>Budgeting &amp; Financial Management: Ability to forecast budget, monitor spend, weigh tradeoffs and optimize spend across a portfolio of events and individual projects</li><li>Entrepreneurial builder: You are scrappy and resourceful, take on new challenges with energy and enthusiasm, and are confident navigating ambiguity and building as we fly. You are cool under pressure and comfortable operating on tight deadlines. <br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li>8+ years experiential production experience encompassing planning, organizing, and executing a portfolio of successful events of various scales, with a strong understanding of event logistics, production, and cross-functional coordination. </li><li>Experience Design: Skill in designing and curating meaningful guest experiences, from invitations to post-event follow-ups, with a focus on inclusivity and accessibility. </li><li>Passion for Music and Artists: An understanding of the music industry and a genuine passion for supporting artists and creating events that resonate with music lovers. <br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Experiential marketing, promotion and/or experiential agency experience</li><li>Sponsorship Integration: Ability to identify sponsorship opportunities and develop meaningful ways for sponsors to integrate into events (given space, time and budget parameters) while providing value for artists and aligning with the event's goals. </li><li>Creative Direction: Experience working with marketing and creative teams to define the event's look and feel, aligning with existing brand guidelines and overseeing the execution of creative assets. <br/><br/></li></ul>About UnitedMasters, Inc.<br/><br/>UnitedMasters Inc. represents the creative solutions company, Translation, and the leading software and services platform for independent creators, UnitedMasters. UnitedMasters enables ownership, exposure, and new paths for financial return for independent creators, while Translation helps brands leverage the power of contemporary culture to achieve transformational growth. Combined, UnitedMasters, Inc. is the world’s leading marketplace for cultural capital, connecting independent artists and brands to realize a future in which all creators own their future. Backed by Alphabet, Andreessen Horowitz, and Apple, UnitedMasters, Inc. is reimagining how brands and artists come together to tell their stories, build profitable growth, and push culture forward.<br/><br/>Salary Hiring Range: $170,000 - $200,000<br/><br/>*Our salary ranges are based on paying competitively for our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide (e.g. bonus, stock options, 401(k) match, etc.)<br/><br/>*Individual pay rate decisions are based on a number of factors, including qualifications for the role, experience level, skillset, and balancing internal equity relative to peers at the company. We expect the majority of the candidates who are offered roles at our company to fall healthily throughout the range based on these factors. <br/><br/>*The range above is for the expectations as laid out in the job description, however we are often open to a wide variety of profiles, and recognize that the person we hire may be less experienced (or more senior) than this job description as posted. If that ends up being the case, the updated salary range will be communicated with you as a candidate.<br/><br/>*The salary range above is for the NY/CA. As a company, we have a location based strategy, which means the salary range could be lower or higher than this if the role is hired in another location.<br/><br/>", "responsibilities": "Lead the events practice at UnitedMasters, responsible for the management and oversight of multiple functions and stakeholders for the planning and execution of high-profile, revenue-generating events that celebrate, engage and grow our community of independent artists (e.g. SelectCon, Grammys Weekend, SXSW and Art Basel). You will:<br/><br/><ul><li>With input from internal stakeholders, define the event roadmap for UnitedMasters, balancing the needs of Marketing and Sales/Client sponsors. </li><li>For each event on the roadmap, review a brief that communicates the vision of the project and recommend the experience (format, venue, run of show, etc.) that best meets Marketing and Sponsor KPIs with consideration for both the strategic narrative as well as brand and budget parameters. </li><li>Program &amp; Event Management: You will holistically manage and be accountable for each event end-to-end, with inputs from internal/external stakeholders inclusive of Marketing, Talent, PR/Comms, Production, Project Management, Vendors, Sales and client sponsors; you will drive effective and efficient collaboration by leading internal project kick-offs and regular cross-functional meetings (with support from project manager) and retrospective debriefs. </li><li>Budget &amp; Financial Management: Forecast budget, manage and optimize spend across the annual event portfolio and individual projects. Make day-to-day decisions about project spend to most effectively and impact-fully achieve project KPIs. </li><li>Build, manage and develop a high-performing Events team inclusive of event production,, talent, and project management. </li><li>Manage vendors and internal collaborators as day-to-day lead inclusive of Production (experiential and digital), Marketing, Talent management, Publicist, Social, Sales, Branded Content </li><li>Provide experiential expertise and input to creative look and feel, marketing, talent casting, FOH (invite/ticketing) strategy</li><li>Oversee the execution of creative direction across all event assets (from stage design to printed signage and more) with input and approvals from Marketing and Sponsors (via Sales/Client Services teams) as needed</li><li>Map out guest experience for each group - from invite to thank you email </li><li>Proactively identify sponsorship opportunities and concept meaningful ways for brands to integrate into events and partner with sales to concept, sell &amp; execute custom integrations </li><li>Collaborate with Group Executive Producer to recruit and contract top tier producers and external vendors </li><li>Create documentation, systems, tools and processes to continuously evolve the blueprint for events</li><li>Ensure every event &amp; experience UMT creates is inclusive &amp; accessible<br/><br/></li></ul>", "qualifications": {"required": "8+ years experiential production experience encompassing planning, organizing, and executing a portfolio of successful events of various scales, with a strong understanding of event logistics, production, and cross-functional coordination. \nExperience Design: Skill in designing and curating meaningful guest experiences, from invitations to post-event follow-ups, with a focus on inclusivity and accessibility. \nPassion for Music and Artists: An understanding of the music industry and a genuine passion for supporting artists and creating events that resonate with music lovers. <br/><br/>", "preferred": "Experiential marketing, promotion and/or experiential agency experience\nSponsorship Integration: Ability to identify sponsorship opportunities and develop meaningful ways for sponsors to integrate into events (given space, time and budget parameters) while providing value for artists and aligning with the event's goals. \nCreative Direction: Experience working with marketing and creative teams to define the event's look and feel, aligning with existing brand guidelines and overseeing the execution of creative assets. <br/><br/>"}, "skills": [], "postedDate": "2 days ago", "benefits": "bonus, stock options, 401(k) match", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3969329080"}