{"jobTitle": "Manager, Visual Merchandising", "company": {"name": "Mejuri", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Luxury Goods and Jewelry", "description": "Mejuri is the category-defining fine jewelry brand redefining luxury, your way. Feeling disconnected from an industry that typically markets to men, co-founder and CEO Noura Sakkijha leveraged her learnings as a third-generation jeweler to rethink the way women purchase jewelry—for themselves. In only seven years, and with a team of over 75% women, Mejuri has shipped over one million orders and opened retail stores across the globe, all while introducing new products weekly.<br/><br/>As part of Noura’s original vision to empower women to invest in themselves, the brand launched the Empowerment Fund to support underrepresented women and non-binary individuals with the tools to empower themselves. Mejuri continues to reach new customers through exciting community initiatives and expansion into international markets, such as the UK, Australia and Germany.<br/><br/>We are a team of retailers, creatives, technologists and strategists, and we are looking for someone special to join our team.<br/><br/>As our Manager of Visual Merchandising, reporting to the Director of Visual Merchandising, you will play a key role in executing Mejuri’s vision within our stores. Collaborating closely with cross-functional teams, including Brand, Growth, Merchandising, Store Design, Inventory Management, and Retail Operations, you will ensure consistent and compelling visual merchandising experiences across all locations. You will focus on implementing visual merchandising strategies, ensuring that each store reflects the brand’s unique identity while maintaining consistency.<br/><br/>With Mejuri’s ambitious growth plans, expanding to 40 stores by the end of the year, you will be responsible for translating the brand direction into tangible in-store experiences. This involves traveling to stores, building strong partnerships with retail leadership, and helping train the field teams on visual merchandising standards. You will be instrumental in creating captivating displays, optimizing fixture placement, and enhancing the overall shopping journey for Mejuri’s customers.<br/><br/><strong>What you'll do:<br/><br/></strong>Visual Merchandising Execution<br/><br/><ul><li>Adapt brand directives for in-store implementation.</li><li>Use business acumen to layout stores and optimize fixture productivity, collaborating with stores/merchants to drive sales.</li><li>Develop tools for scalable execution.</li><li>Execute standards for visual merchandising, including marketing, product placement, visual display standards, and lighting.</li><li>Teach merchandising fundamentals to stores virtually, through workshops and store visits.</li><li>Inspect weekly execution of store visual merchandising standards, facilities, and other fundamentals.<br/><br/></li></ul>Weekly Business Actions<br/><br/><ul><li>Analyze category performance.</li><li>Collaborate with merchandising and marketing teams weekly.</li><li>Work with Field Teams on a weekly basis.</li><li>Perform regular store visits to understand unit performance.</li><li>Take action on visual merchandising for slow-moving products and communicate fast-turning product themes to Inventory Management.</li><li>Proactively plan for seasonality and holidays.<br/><br/></li></ul>Store Visual Presentation Mapping<br/><br/><ul><li>Develop merchandising maps detailing styles by fixture type.</li><li>Manage variability by store.<br/><br/></li></ul><strong>Subject Matter Expert Partnership<br/><br/></strong><ul><li>Assist in-store campaign development.</li><li>Participate in store and fixture design, and NSO sign-off.</li><li>Conduct store visits for training, teaching, and execution inspections.</li><li>Develop team business acumen based on product placement through workshops.<br/><br/></li></ul>Campaign Execution<br/><br/><ul><li>Serve as the Retail Representative for builds.</li><li>Adapt creative concepts to store type and needs.</li><li>Collaborate with vendors to order and ship assets.</li><li>Execute store execution playbooks.<br/><br/></li></ul>Experience Design<br/><br/><ul><li>Contribute to fixture and prop design.<br/><br/></li></ul><strong>What you bring to the table:<br/><br/></strong><ul><li>5+ years of proven experience in Retail Visual Merchandising with detailed knowledge of fashion &amp; retail.</li><li>Excellent communication &amp; presentation skills with a passion for innovation, creativity, and the ability to deliver with a standard of excellence.</li><li>A hands-on problem solver with a willingness to work in the details and find opportunities to change processes to drive efficiencies.</li><li>Ability to work effectively in a fast-paced environment and quickly adapt to change and new processes.</li><li>Ability to manage large-scale projects across numerous locations simultaneously.</li><li>Collaborative skills to work effectively across varied cross-functional teams.</li><li>Proven track record in building best-in-class teams &amp; processes in a high-growth environment.</li><li>Willingness to travel frequently, including internationally.</li><li>A resourceful self-starter with a “can-do” attitude and a “building” mindset.</li><li>Collaborative, emotionally intelligent, and positive.<br/><br/></li></ul><strong>Benefits at Mejuri:<br/><br/></strong><ul><li>A minimum of three weeks vacation, plus personal days and three religious observance days.</li><li>A hybrid work model for all corporate roles.</li><li>‘Mejuri Passport’ which allows employees who meet specific criteria to work in other locations for one month per year.</li><li>Comprehensive medical and dental benefits, including mental health coverage, and generous personal and sick days for our full-time employees. We also offer bereavement leave, including miscarriage and stillbirth support.</li><li>Parental leave salary top-up of up to 80%, as well as a personalized return-to-work transition and accommodation plan for full-time employees.</li><li>Semi-annual performance reviews.</li><li>A generous product discount!<br/><br/></li></ul>Please note that these benefits apply to full-time employees.<br/><br/><strong>Salary:<br/><br/></strong>Looking for the perfect next opportunity is a big decision. Mejuri recognizes the importance of pay transparency when it comes to salary ranges as it empowers individuals through the hiring process and supports them in making an informed decision. This role currently has a base pay range of $90,000-$110,000 per year based on a candidate’s experience and qualifications.<br/><br/><strong>Location:<br/><br/></strong>At Mejuri we embrace a hybrid working environment and support our corporate employees to be successful whether they are at home or in the office. The primary purpose of our offices is to drive collaboration and deepen relationships with one another.<br/><br/><strong>Accommodation / Accessibility:<br/><br/></strong>Mejuri does not discriminate in hiring or terms and conditions of employment because of an individual’s race, ancestry, colour, place of origin, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, family status or marital status, or any other protected category recognized by provincial or federal laws.<br/><br/>Should you require any accommodation, please inform us and we will work with you to meet your accessibility needs. For any accessibility-related assistance, requests for information in accessible alternative formats or to report any accessibility problems, please share in your application.<br/><br/>Along with our central mission and vision, we have guiding values that set the tone for where we’re heading and how we work together. These values are behaviors that form our shared beliefs and approach to how we wish to work together at Mejuri, regardless of role, level, and work location. Our 8 core values help drive our decision making when we are cross collaborating, redefining luxury, and creating a sense of commitment and inclusion to help shape our company culture.<br/><br/>Our values are:<br/><br/><strong>FIND A WAY</strong> | We break down problems into manageable steps, explore creative solutions daily, learn from failure, and adapt quickly<br/><br/><strong>RAISE THE BAR </strong>| We share constructive feedback openly, continuously improve personal and team performance, collaborate and challenge for better outcomes<br/><br/><strong>CUSTOMER OBSESSED</strong> | We actively listen to customer feedback, make decisions that impact customers positively, continuously refine product, service, or customer interactions<br/><br/><strong>EMPOWERED OWNERS |</strong> We proactively address cross team challenges, willingly tackle any task big or small, take initiative, and lead by example<br/><br/><strong>JUST DO IT</strong> | We make informed decision quickly, encourage experimentation and learning, encourage thoughtful risk taking, embrace change, and stay adaptable<br/><br/><strong>HUMILITY</strong> | We acknowledge team contributions before self, acknowledge and learn from mistakes, maintain an open and receptive mindset, and promote a respectful work environment<br/><br/><strong>CURIOSITY </strong>| We seek out new challenges daily, ask questions to understand deeply, reimagine and innovate to drive progress<br/><br/><strong>DRIVE RESULTS</strong> | set clear goals and prioritize tasks, focus on high impact activities daily, monitor progress through clear metrics, stay persistent and solution orientated<br/><br/><strong>Accommodation / Accessibility:<br/><br/></strong>Mejuri does not discriminate in hiring or terms and conditions of employment because of an individual’s race, ancestry, colour, place of origin, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, family status or marital status, or any other protected category recognized by provincial or federal laws.<br/><br/>Should you require any accommodation, please inform us and we will work with you to meet your accessibility needs. For any accessibility-related assistance, requests for information in accessible alternative formats or to report any accessibility problems, please share in your application.<br/><br/>", "responsibilities": "Visual Merchandising Execution\n\n<ul><li>Adapt brand directives for in-store implementation.</li><li>Use business acumen to layout stores and optimize fixture productivity, collaborating with stores/merchants to drive sales.</li><li>Develop tools for scalable execution.</li><li>Execute standards for visual merchandising, including marketing, product placement, visual display standards, and lighting.</li><li>Teach merchandising fundamentals to stores virtually, through workshops and store visits.</li><li>Inspect weekly execution of store visual merchandising standards, facilities, and other fundamentals.<br/><br/></li></ul>Weekly Business Actions\n\n<ul><li>Analyze category performance.</li><li>Collaborate with merchandising and marketing teams weekly.</li><li>Work with Field Teams on a weekly basis.</li><li>Perform regular store visits to understand unit performance.</li><li>Take action on visual merchandising for slow-moving products and communicate fast-turning product themes to Inventory Management.</li><li>Proactively plan for seasonality and holidays.<br/><br/></li></ul>Store Visual Presentation Mapping\n\n<ul><li>Develop merchandising maps detailing styles by fixture type.</li><li>Manage variability by store.<br/><br/></li></ul>Subject Matter Expert Partnership\n\n<ul><li>Assist in-store campaign development.</li><li>Participate in store and fixture design, and NSO sign-off.</li><li>Conduct store visits for training, teaching, and execution inspections.</li><li>Develop team business acumen based on product placement through workshops.<br/><br/></li></ul>Campaign Execution\n\n<ul><li>Serve as the Retail Representative for builds.</li><li>Adapt creative concepts to store type and needs.</li><li>Collaborate with vendors to order and ship assets.</li><li>Execute store execution playbooks.<br/><br/></li></ul>Experience Design\n\n<ul><li>Contribute to fixture and prop design.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of proven experience in Retail Visual Merchandising with detailed knowledge of fashion & retail.\nExcellent communication & presentation skills with a passion for innovation, creativity, and the ability to deliver with a standard of excellence.\nA hands-on problem solver with a willingness to work in the details and find opportunities to change processes to drive efficiencies.\nAbility to work effectively in a fast-paced environment and quickly adapt to change and new processes.\nAbility to manage large-scale projects across numerous locations simultaneously.\nCollaborative skills to work effectively across varied cross-functional teams.\nProven track record in building best-in-class teams & processes in a high-growth environment.\nWillingness to travel frequently, including internationally.\nA resourceful self-starter with a “can-do” attitude and a “building” mindset.\nCollaborative, emotionally intelligent, and positive.", "preferred": ""}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "A minimum of three weeks vacation, plus personal days and three religious observance days.\nA hybrid work model for all corporate roles.\n‘Mejuri Passport’ which allows employees who meet specific criteria to work in other locations for one month per year.\nComprehensive medical and dental benefits, including mental health coverage, and generous personal and sick days for our full-time employees. We also offer bereavement leave, including miscarriage and stillbirth support.\nParental leave salary top-up of up to 80%, as well as a personalized return-to-work transition and accommodation plan for full-time employees.\nSemi-annual performance reviews.\nA generous product discount!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3969266549"}