{"jobTitle": "Logistics Billing & Settlements Specialist - USDS", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "<strong>Responsibilities<br/><br/></strong> About TikTok U.S. Data Security<br/>TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. U.S. Data Security (“USDS”) is a subsidiary of TikTok in the U.S. This new, security-first division was created to bring heightened focus and governance to our data protection policies and content assurance protocols to keep U.S. users safe. Our focus is on providing oversight and protection of the TikTok platform and U.S. user data, so millions of Americans can continue turning to TikTok to learn something new, earn a living, express themselves creatively, or be entertained. The teams within USDS that deliver on this commitment daily span across Trust &amp; Safety, Security &amp; Privacy, Engineering, User &amp; Product Ops, Corporate Functions and more.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>About the Team:<br/>Supply Chain and Logistics organization aims to provide better products and experience, better delivery costs, strengthen industrial supply chain capabilities, and enhance platform reputation and long-term value. We are looking for a talented &amp; experienced specialist to join the USDS Logistics Operations team as a Billing &amp; Settlements Specialist, Cross Border. The ideal candidate is passionate about analyzing data to make decisions and thrives in a fast-paced start-up environment. They have a background in eCommerce logistics vendor billing (preferably cross-border shipping, global mile, customs, &amp; last-mile delivery), experience working with global cross-functional teams, &amp; have excellent written &amp; communication skills.<br/><br/>In order to enhance collaboration and cross-functional partnerships, among other things, at this time, our organization follows a hybrid work schedule that requires employees to work in the office 3 days a week, or as directed by their manager/department. We regularly review our hybrid work model, and the specific requirements may change at any time.<br/><br/>Responsibilities:<br/>- Collaborating with customers, third party institutions and other team members to resolve billing inconsistencies and errors<br/>- Work with the settlement team in reviewing and processing of vendor invoices, auditing and investigating potential errors, processing the invoices in system for payment in a timely manner, and generating and analyzing reports<br/>- Process customer billing accurately on or before deadlines as per requirements and according to company policy for each division, searching each financial statement for any payment inconsistencies or errors<br/>- Improve the settlement processes by developing automated processes to reduce manual processing<br/>- Validate billing inputs from other team members for accurate billing<br/>- Proactively identify solutions, workflow, and processes for improved departmental performance<br/>- Performs other activities and responsibilities as assigned <br/><br/><strong>Qualifications<br/><br/></strong> Minimum Qualifications:<br/>- Bachelor’s degree in Finance, Accounting or related professional experience<br/>- 1-3 years of billing and settlement related experience in logistics related industry<br/>- Proficient with the Microsoft Office Suite with Intermediate Excel skills (Pivot Tables, Index Match, Sum If, etc.<br/>- Clear and concise verbal/written communication and data presentation skills, including ability to effectively communicate with both business and technical teams, <br/>- Excellent interpersonal skills with a passion for collaboration<br/>- Able to take direction well and act within context of his/her own function.<br/>- Demonstrated ability to analyze and solve ambiguous and complex problems, thrive with partial information, manage multiple, competing priorities simultaneously<br/><br/>Preferred Qualifications: <br/> - eCommerce &amp; crossborder billing, operations, or related experience is a plus<br/>- Strong analytical skills are a plus. Experience with SQL, Tableau, Power BI or similar tools<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/ktJP6<br/><br/>Data Security Statement<br/>This role requires the ability to work with and support systems designed to protect sensitive data and information. As such, this role will be subject to strict national security-related screening. <br/><br/><strong>Job Information:<br/><br/></strong>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $90000 - $130000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Collaborating with customers, third party institutions and other team members to resolve billing inconsistencies and errors\n- Work with the settlement team in reviewing and processing of vendor invoices, auditing and investigating potential errors, processing the invoices in system for payment in a timely manner, and generating and analyzing reports\n- Process customer billing accurately on or before deadlines as per requirements and according to company policy for each division, searching each financial statement for any payment inconsistencies or errors\n- Improve the settlement processes by developing automated processes to reduce manual processing\n- Validate billing inputs from other team members for accurate billing\n- Proactively identify solutions, workflow, and processes for improved departmental performance\n- Performs other activities and responsibilities as assigned ", "qualifications": {"required": "- Bachelor’s degree in Finance, Accounting or related professional experience\n- 1-3 years of billing and settlement related experience in logistics related industry\n- Proficient with the Microsoft Office Suite with Intermediate Excel skills (Pivot Tables, Index Match, Sum If, etc.\n- Clear and concise verbal/written communication and data presentation skills, including ability to effectively communicate with both business and technical teams, \n- Excellent interpersonal skills with a passion for collaboration\n- Able to take direction well and act within context of his/her own function.\n- Demonstrated ability to analyze and solve ambiguous and complex problems, thrive with partial information, manage multiple, competing priorities simultaneously", "preferred": "- eCommerce &amp; crossborder billing, operations, or related experience is a plus\n- Strong analytical skills are a plus. Experience with SQL, Tableau, Power BI or similar tools"}, "skills": ["Excel", "Communication", "Data Analysis", "SQL", "Tableau", "Power BI"], "postedDate": "4 days ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \n\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \n\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3969855528"}