{"jobTitle": "AV Producer, Prime Video, Creative Marketing", "company": {"name": "Prime Video & Amazon MGM Studios", "industry": "Entertainment Providers", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$70,600.00/yr - $151,000.00/yr", "currency": "USD"}, "jobFunction": "Public Relations and Marketing", "industry": "Entertainment Providers", "description": "Prime Video (PV) brings together the world’s best creators with the most passionate communities in a way that no other entertainment brand can. Not only are we a one-stop hub for distinctive, critically-acclaimed and award-winning original programming including TV series such as The Boys, The Marvelous Mrs. Maisel and Jack Ryan and movies like Air, Saltburn, The Idea of You, and Road House, but we offer a multi-dimensional experience that allows subscribers to fully immerse themselves in their fandom: to read the book, to listen to the soundtrack, to buy the costume, to replay live sports in real time, and more. And that breadth and connection to the Amazon family of brands, along with the support of a passionate and diverse global team, makes Prime Video a company where creators and makers of all kinds can build their future.\n\nPrime Video is searching for a talented & experienced AV Producer to manage all video deliverables that are part of the overall marketing campaign for our streaming service in the US. As our AV Producer, you will manage the creation and execution of Multi Title Sizzles, TV Spots, Audio Assets, In Cinema Assets, Promos, Motion Graphic tool-kits, etc. You will ensure that each element of a video project is completed on time and on budget in the most effective and efficient manner possible.", "responsibilities": "Manage all operational aspects of video projects (trailers, tv spots, promos, sizzles, etc.) from inception to completion. This role will work very closely with the Senior AV Producer, Creative Director and Campaign Manager to ensure that the video deliverables are falling within the overall campaign timelines and budgets. Create schedules, determine resources, estimate time, track costs and project completion requirements. Work closely with Studios Post Production team to determine footage availability in order to manage stakeholder expectations. Obtain necessary approvals and communicate plans to relevant stakeholders. Ensure team establishes and maintains appropriate processes, procedures, forms and job tracking to keep video deliverables on time and on budget. Anticipate and effectively mitigate problems and consistently communicate to stakeholders about updates on progress, relevant delays or issues and budget implications. Generate, track and follow up with all correspondence regarding clearance permission requests. Manage footage to be trafficked to external post vendors, dubbing studios and agencies. Work closely with the cross functional marketing department to verify that marketing assets comply with legal and contractual requirements. Determine scope of work and obtain estimates from external agency partners. Communicate creative feedback to agencies throughout the life of a project. QC video files before releasing final files to the end user(s). Deliver final files to internal and external partners as necessary. Manage localization of assets for multiple territories for Day & Date global marketing release, including graphics, subbing & dubbing as needed. Work collaboratively and proactively with internal teams and external agencies to assess project requirements and ensure efficient development and delivery of video assets. Provide regular feedback to the marketing and creative teams to establish project priorities and communicate milestones and deadlines. Experience managing and delivering large volume of video assets to external partners a must. Establish and actively participate in optimizing department SOP’s.", "qualifications": {"required": "3+ years of entertainment, brand or production entity experience. Experience and understanding of the workflow within a marketing, production, or creative department or company. Experience trafficking and delivering video and image files via digital supply chain.", "preferred": "Experience with asset management, design workflows, or partnering with creative teams. Experience managing multiple projects and meeting quick deadlines."}, "skills": ["Video Production", "Project Management", "Marketing Campaigns", "Creative Direction", "Post Production", "Audio Mixing", "Visual Effects", "Motion Graphics", "Localization", "Animation"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $70,600/year in our lowest geographic market up to $151,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3969275664"}