{"jobTitle": "Specialty Pharmacy Services Regional Sales Manager", "company": {"name": "Omnicell", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>Note: For travel and territory coverage purposes, all applicants interested in the Regional Sales Manager must live in the CST, MST, or PST time zone.<br/><br/></strong><strong>Be the Solution. Imagine the Impact.<br/><br/></strong>Omnicell Specialty Pharmacy Services (OSPS) is a leader in pharmacy and specialty pharmacy management solutions for health systems, federally qualified health centers, Ryan White HIV/AIDS programs, and large physician provider groups. We have developed a proprietary and turnkey implementation and management platform, leveraging industry best practices to help pharmacies achieve their full potential.<br/><br/>OSPS leads its customers through the entire pharmacy lifecycle, from store buildout to licensing to supporting ongoing operations to ensure future success. As a respected partner in the industry focused on quality patient care, we help our clients tackle the barriers associated with specialty medications, increasing patient access, improving patient adherence, and driving better outcomes for patients and prescribers.<br/><br/><strong>Position Summary:<br/><br/></strong>Responsible for prospecting and marketing to Health Systems in a defined region to provide pharmacy management services to hospitals/clinics interested in owning an in-house pharmacy. This position is responsible for owning and cultivating strong client relationships with prospective and existing customers to drive customer satisfaction, value, retention and penetration. He/she will help ensure that the customer/client is receiving considerable value from our services. The position requires an individual who has in-depth knowledge of specialty pharmacy and 340 B pricing and services coupled with a strong understanding of the business environment, strategy and needs of the client to provide solutions by leveraging Omnicell Specialty Pharmacy Management Services.<br/><br/><strong>Responsibilities:<br/><br/></strong><strong>Collaborate</strong>:<br/><br/><ul><li>Perform market research and analysis, creating profiles of targeted accounts to understand organizational structures, decision-makers, and opportunities for pharmacy management services.</li><li>Establish strong relationships with decision-makers and key stakeholders within client organizations to foster collaboration and future business opportunities.<br/><br/><br/></li></ul><strong>Inspire</strong>:<br/><br/><ul><li>Develop and execute sales strategies for targeted accounts, making sales calls to promote pharmacy management service capabilities.</li><li>Participate in conferences and exhibitions to actively promote OSPS and inspire potential clients.<br/><br/><br/></li></ul><strong>Develop</strong>:<br/><br/><ul><li>Provide best practices, coaching, and training to clients to ensure smooth onboarding and adoption of our solutions.</li><li>Establish plans to convert customers to references for Omnicell Specialty Pharmacy Services, highlighting their success stories to inspire others.<br/><br/><br/></li></ul><strong>Execute</strong>:<br/><br/><ul><li>Own and cultivate strong client relationships with prospective and existing customers to drive satisfaction, value, retention, and penetration.</li><li>Follow up on activities to drive customer satisfaction through solution development with appropriate internal OSPS resources.</li><li>Work with the operations team on pull-through sales opportunities or marketing needs.<br/><br/><br/></li></ul><strong>Impact</strong>:<br/><br/><ul><li>Ensure customers receive considerable value from our services, driving better outcomes for patients and prescribers.</li><li>Use your in-depth knowledge of specialty pharmacy and 340 B pricing and services to provide tailored solutions that address the strategic and tactical needs of clients.<br/><br/><br/></li></ul><strong>Required Knowledge and Skills:<br/><br/></strong><ul><li>Demonstrated advanced knowledge and experience with hospitals and health systems.</li><li>Proven ability to develop and execute account-level strategic and tactical plans with measurable metrics.</li><li>High financial acumen and negotiation skills, particularly in complex hospital contracts.</li><li>Leadership ability with a focus on influence, impact, and leading without formal authority.</li><li>Ability to work independently in a fast-paced environment, multi-task, and self-prioritize workload.</li><li>Proficiency with CRM Salesforce.<br/><br/><br/></li></ul><strong>Basic Qualifications:<br/><br/></strong><ul><li>Bachelor’s Degree and 3+ years of healthcare sales experience, OR</li><li>High School Diploma and 5+ years of healthcare sales experience.<br/><br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Experience selling Specialty Pharmacy Management Services.</li><li>Bachelor’s Degree strongly preferred.</li><li>Knowledge of specialty pharmacy and/or 340 B drug pricing and services.</li><li>Expertise in complex sales processes.</li><li>Strong negotiation, conflict management, and customer service experience.</li><li>Business acumen and communication skills suitable for C-suite audiences.<br/><br/><br/></li></ul><strong>Work Conditions:<br/><br/></strong><ul><li>Home Office.</li><li>Travel required: up to 60%.</li><li>Physical Requirements: Sitting, standing, walking, and using a keyboard. May also be required to lift demo equipment as needed during trade show events.<br/><br/><br/></li></ul><strong>Note:</strong> To protect our employees, partners, and customers, this position may require most U.S. employees to either be fully vaccinated for COVID-19 or obtain approval from Omnicell for an exemption and accommodation for a medical condition or a sincerely-held religious belief or practice.<br/><br/>Be the solution. Imagine the impact. Join us at OSPS, where we collaborate, inspire, develop, execute, and make a meaningful impact every day.<br/><br/><strong>Compensation Information:<br/><br/></strong>Base Salary is 150K + Comp plan.<br/><br/><strong>About Us<br/><br/></strong>Since 1992, Omnicell has been committed to <strong>transforming pharmacy care</strong> through <strong>outcomes-centric innovation</strong> designed to optimize clinical and business outcomes across all settings of care. We strive to be the healthcare provider’s most trusted partner by our guiding promise of “Outcomes. Defined and Delivered.”  <br/><br/>Our comprehensive portfolio of <strong>robotics, smart devices, intelligent software, and expert services</strong> is helping healthcare facilities worldwide <strong>to improve business and clinical outcomes</strong> as they move closer to the industry vision of the Autonomous Pharmacy. <br/><br/>Our guiding principles inform everything we do: <br/><br/><ul><li>As Passionate Transformers, we find a better way to innovate relentlessly. </li><li>Being Mission Driven, we consistently deliver on our promises. </li><li>Our Entrepreneurial spirit makes the most of EVERY opportunity for innovation. </li><li>Understanding that Relationships Matter creates synergies that yield the greatest benefits for all.</li><li>In Doing the Right Thing, we lead by example in ALL we do. <br/><br/><br/></li></ul>We value creating an inclusive culture and a healthier world through ESG initiatives, Employee Impact Groups, learning, well-being programs, and more. Join us in transforming the pharmacy care delivery model, making patient care safer and smarter for all.<br/><br/><strong>About The Team<br/><br/></strong>Omnicell is dedicated to fostering a diverse and inclusive workplace. We welcome applications from all individuals, valuing a wide range of perspectives and backgrounds. As an equal opportunity employer, we do not discriminate based on race, gender, religion, sexual orientation, gender identity, national origin, veteran status, or disability. We are committed to making our recruitment process accessible to everyone. We offer support and reasonable adjustments for individuals with disabilities during our hiring process. If you need assistance, please contact us at Recruiting@omnicell.com .<br/><br/>At Omnicell, respect for privacy and confidentiality is paramount. We adhere to strict policies to prevent discrimination or retaliation against those who engage in open conversations about compensation. However, employees privy to compensation information as part of their job role are expected to maintain confidentiality, except in specific circumstances outlined by law, such as during formal complaints, investigations, or as required by legal obligations.<br/><br/>Please note that Omnicell reserves the right to modify job roles and responsibilities as needed to meet our organization's evolving needs and drive our mission forward.", "responsibilities": "<strong>Collaborate</strong>:<br/><br/><ul><li>Perform market research and analysis, creating profiles of targeted accounts to understand organizational structures, decision-makers, and opportunities for pharmacy management services.</li><li>Establish strong relationships with decision-makers and key stakeholders within client organizations to foster collaboration and future business opportunities.<br/><br/><br/></li></ul><strong>Inspire</strong>:<br/><br/><ul><li>Develop and execute sales strategies for targeted accounts, making sales calls to promote pharmacy management service capabilities.</li><li>Participate in conferences and exhibitions to actively promote OSPS and inspire potential clients.<br/><br/><br/></li></ul><strong>Develop</strong>:<br/><br/><ul><li>Provide best practices, coaching, and training to clients to ensure smooth onboarding and adoption of our solutions.</li><li>Establish plans to convert customers to references for Omnicell Specialty Pharmacy Services, highlighting their success stories to inspire others.<br/><br/><br/></li></ul><strong>Execute</strong>:<br/><br/><ul><li>Own and cultivate strong client relationships with prospective and existing customers to drive satisfaction, value, retention, and penetration.</li><li>Follow up on activities to drive customer satisfaction through solution development with appropriate internal OSPS resources.</li><li>Work with the operations team on pull-through sales opportunities or marketing needs.<br/><br/><br/></li></ul><strong>Impact</strong>:<br/><br/><ul><li>Ensure customers receive considerable value from our services, driving better outcomes for patients and prescribers.</li><li>Use your in-depth knowledge of specialty pharmacy and 340 B pricing and services to provide tailored solutions that address the strategic and tactical needs of clients.<br/><br/><br/></li></ul>", "qualifications": {"required": "Demonstrated advanced knowledge and experience with hospitals and health systems. Proven ability to develop and execute account-level strategic and tactical plans with measurable metrics. High financial acumen and negotiation skills, particularly in complex hospital contracts. Leadership ability with a focus on influence, impact, and leading without formal authority. Ability to work independently in a fast-paced environment, multi-task, and self-prioritize workload. Proficiency with CRM Salesforce.", "preferred": "Experience selling Specialty Pharmacy Management Services. Bachelor’s Degree strongly preferred. Knowledge of specialty pharmacy and/or 340 B drug pricing and services. Expertise in complex sales processes. Strong negotiation, conflict management, and customer service experience. Business acumen and communication skills suitable for C-suite audiences."}, "skills": ["Sales", "Healthcare", "Hospitals", "Health Systems", "CRM", "Salesforce", "Negotiation", "Customer Service", "Business Acumen", "Communication"], "postedDate": "3 days ago", "benefits": "Base Salary is 150K + Comp plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3969277615"}