{"jobTitle": "Associate Vice President, Philanthropy Operations - Remote", "company": {"name": "City of Hope", "industry": "Hospitals and Health Care, Non-profit Organizations, and Research Services", "location": "Irwindale, CA"}, "location": "Irwindale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "79.00/hr - 132.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitals and Health Care, Non-profit Organizations, and Research Services", "description": "Focused on eliminating cancer, diabetes and other life-threatening illnesses, City of Hope has established itself as a world-class leader in transforming the future of health. Raising the philanthropic resources to fuel its leading-edge research, its exceptional and compassionate clinical care, and its advancement of biomedical education and training, is a vital component of City of Hope’s model of success.<br/><br/>hilanthropy is at the heart of City of Hope’s mission in turning “hope into reality.” We offer an extraordinary donor and volunteer experience, one that invites, delights, and deepens relationships over time. City of Hope Philanthropy is one of a handful of premiere, exceptionally regarded, and top- producing programs in the country.<br/><br/>Recruiting and developing exceptionally talented team members are hallmarks of the Office of Philanthropy. We demonstrate our commitment to our people through continuous learning and development opportunities and aim to foster an environment where each individual can thrive, personally and professionally. We increase the effectiveness of our team through transparency and accountability, building trust within teams; celebrating diversity and inclusion; enhancing team communications and removing roadblocks to maximize activation.<br/><br/>Reporting to the Vice President of Philanthropy Strategy &amp; Campaign Management (VP-PS), the Senior Director of Philanthropy Operations serves as a key member of the senior management team and is responsible for overseeing: 1) Philanthropy systems and operations, 2) philanthropy data governance and 3) philanthropy gift management. As an integral member of the VP-PS’s senior leadership team, the SD-PO works closely with the Office of Philanthropy Vice Presidents (SSLT) and members of the Philanthropy Leadership Team to identify, quantify and understand City of Hope’s philanthropic priorities and to develop and integrate the necessary tools to support data-driven strategies necessary to inform business decisions to help support a national philanthropy growth plan including a multi-billion dollar comprehensive campaign. This is a highly collaborative, service-oriented position working with senior leaders in, and with, colleagues across OOP.<br/><br/>The SD-PO will lead philanthropy efforts to enhance operational efficiencies, productivity, and scalability in support of a national fundraising effort. The SD-PO will be the subject matter expert lending technical expertise and knowledge to successfully implement a state-of-the-art CRM to help optimize donor portfolios and pipeline development strategies, develop and implement data governance vision and strategies integral to OOP and will lead the three major areas of operations, responsible for the maintenance and integrity of high-volume data input, output, and analysis, including gift processing and gift records administration, biographic and demographic data acquisition and maintenance of event, corporate/industry, volunteer, and other engagement and donor/prospect data, business intelligence, and overall data policy. The SD-PO will also be responsible for all CRM-related tools and will liaise with System IT partners, ensuring strong collaboration between teams and smooth and accurate data migration and system implementation for all philanthropy platforms. The SD-PO will oversee all OOP’s activities related to collecting, storing, and leveraging volunteer and donor data to enhance the donor experience, increase fundraising performance, and improve donor acquisition and retention. In addition, the SD-PO will endeavor to achieve efficiencies through improvements in data organization, data quality, and business processes. In pursuit of the above objectives, the SD-PO will collaborate with partners across the Office of Philanthropy as well as Finance, and System IT and Corporate Compliance on issues of data privacy, data security, and HIPAA compliance.<br/><br/><strong>As a successful candidate, you will:<br/><br/></strong><ul><li>Responsible for the vision and strategic direction, the Office of Philanthropy data-handling staff and exhibiting a firm and visible commitment to Diversity, Equity, and Inclusion.</li><li>Oversee and develop high-performing teams through rigorous goal setting, process innovation and efficiency, quality control, and performance management, including coaching and career guidance as appropriate. Specific teams under supervision of the SD-PO include Philanthropy systems, data governance and gift management.</li><li>Oversee the process improvement and activities of the timely secure, and accurate handling, recording, depositing, accounting, and reporting of all gifts and pledges in support of City of Hope, including maintenance of gift payment flows and gift/financial data sharing between OOP’s Finance &amp; Resource Management department and System Finance. Work closely with institutional partners in System Finance to implement regular, accurate, and professional audit and reconciliation practices.</li><li>Design and manage processes and frameworks to ensure high levels of data quality and accuracy across all data-handling functions and departments. Ensure OOP and partners have access to actionable insights through sophisticated data analysis, supporting data modeling, and data mapping capabilities by defining standards and best practices for data analysis, modeling, and queries.</li><li>Responsible for the OOP data governance committee and liaise with System IT to ensure policies and solutions adhere to the organization's data principles and guidelines.<br/><br/></li></ul><strong>Your qualifications should include: <br/><br/></strong><ul><li> Master’s degree in operations management, information management, data science or similar field</li><li> 10+ years of progressive experience in the field of philanthropy operations, data governance, business analysis, or related areas in Development. Advanced knowledge and understanding of principles of fundraising, pipeline development, systems and platform integration, business analysis and gift management and creating and mentoring a donor-centric culture. Experience and expertise in directing comprehensive operational builds.<br/><br/></li></ul><strong>City of Hope is an equal opportunity employer. To learn more about our commitment to diversity, equity and inclusion, please </strong><strong>click here</strong><strong>.</strong>", "responsibilities": "Responsible for the vision and strategic direction, the Office of Philanthropy data-handling staff and exhibiting a firm and visible commitment to Diversity, Equity, and Inclusion.\nOversee and develop high-performing teams through rigorous goal setting, process innovation and efficiency, quality control, and performance management, including coaching and career guidance as appropriate. Specific teams under supervision of the SD-PO include Philanthropy systems, data governance and gift management.\nOversee the process improvement and activities of the timely secure, and accurate handling, recording, depositing, accounting, and reporting of all gifts and pledges in support of City of Hope, including maintenance of gift payment flows and gift/financial data sharing between OOP’s Finance &amp; Resource Management department and System Finance. Work closely with institutional partners in System Finance to implement regular, accurate, and professional audit and reconciliation practices.\nDesign and manage processes and frameworks to ensure high levels of data quality and accuracy across all data-handling functions and departments. Ensure OOP and partners have access to actionable insights through sophisticated data analysis, supporting data modeling, and data mapping capabilities by defining standards and best practices for data analysis, modeling, and queries.\nResponsible for the OOP data governance committee and liaise with System IT to ensure policies and solutions adhere to the organization's data principles and guidelines.", "qualifications": {"required": "Master’s degree in operations management, information management, data science or similar field\n10+ years of progressive experience in the field of philanthropy operations, data governance, business analysis, or related areas in Development. Advanced knowledge and understanding of principles of fundraising, pipeline development, systems and platform integration, business analysis and gift management and creating and mentoring a donor-centric culture. Experience and expertise in directing comprehensive operational builds."}, "skills": [], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3969553749"}