{"jobTitle": "Fleet Maintenance Manager", "company": {"name": "MV Transportation", "location": "Pomona, CA"}, "location": "Pomona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "99,000.00/yr - 122,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Ground Passenger Transportation", "description": "If you reside in California, please see our California Applicant Privacy Policy for more information about our data handling practices and your data rights.<br/><br/><strong>Responsibilities<br/><br/></strong>MV Transportation is seeking a  Fleet Maintenance Manager  who will be a dynamic, multi-task oriented senior professional to manage all day-to-day maintenance as pects of this fixed route bus operation. The Fleet Maintenance Manager will ensure that all contractual requirements are achieved, and duties included will consist of daily, weekly, monthly and annual reports. The Fleet Maintenance Manager must be able to properly manage a budget for maintenance program.<br/><br/><strong>Qualifications<br/><br/></strong><strong> Talent Requirements: <br/><br/></strong><ul><li> Must have at least three (3) or more years of recent (within the last five (5) years) and relevant experience managing the maintenance functions of a transit bus maintenance shop similar in scope, size, and complexity and with same or similar type of transit vehicles/equipment. </li><li> Must have experience managing/ directing 10 plus employees (fleet Technicians/Service Workers/Cleaners). </li><li> Experience working with 50 + buses within the last year. </li><li> Previous passenger transportation in current project or similar environment preferred. </li><li> Must be able to manage and interface with client. </li><li> Must have the ability to track and control parts inventories, vendors and suppliers. </li><li> Must be able to properly prioritize, implement and manage work schedules, projects and assignments. </li><li> Must be able to manage the financial/accounting aspects of a fleet maintenance operation. </li><li> Must be able to communicate effectively with all levels of staff in written and oral formats. </li><li> Must have computer skills including word processing, spreadsheets and Microsoft outlook. </li><li> Must have technical competence with light/medium/heavy duty vehicle repair and preventive maintenance. </li><li> Must display initiative, professionalism, candor and tact at all times . </li><li> ASE or manufacture’s certifications a plus. </li><li> Technical experience with fixed route transit bus maintenance. </li><li> Solid knowledge of managing audits, PM schedules. </li><li> Experience with Diesel, CNG, and Alternative fuels a plus. </li><li> Must have a CDL class B with passenger and airbrake endorsement. <br/><br/></li></ul>Starting salary range: $99,000 - $122,000<br/><br/>MV Transportation is committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin or ancestry, sex, physical or mental disability, veteran or military status, genetic information or any other legally recognized protected basis under federal, state or local laws, regulations or ordinances. The information collected by this application is solely to determine suitability for employment, verify identity and maintain employment statistics on applicants.<br/><br/>Where permissible under applicable state and local law, applicants may be subject to a pre-employment drug test and background check after receiving a conditional offer of employment.<br/><br/>#appcast", "postedDate": "1 month ago", "skills": ["Management", "Maintenance", "Transportation", "Transit", "Budgeting", "Reporting", "Inventory Management", "Vendor Management", "Scheduling", "Financial Management", "Communication", "Computer Skills", "Microsoft Outlook", "Vehicle Repair", "Preventive Maintenance", "Diesel", "CNG", "Alternative Fuels", "CDL Class B", "Passenger Endorsement", "Airbrake Endorsement"], "url": "https://www.linkedin.com/jobs/view/3969543881"}