{"jobTitle": "Senior Associate Attorney", "company": {"name": "Vizelia", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Environmental Services", "description": "ASSOCIATE ATTORNEY<br/><br/><strong>Summary<br/><br/></strong>We are in search of a committed Attorney with 3-5 years of experience to be an integral part of our prestigious law firm. The ideal candidate will have a passion for upholding justice, a proven track record in public interest advocacy, and a dedication to excellence. Our firm values diligence, meticulousness in discovery, and proactive communication, ensuring we consistently offer top-tier legal services.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Conduct thorough legal research to uncover pivotal litigation points, ensuring our cases are built on a solid foundation.</li><li>Draft, review, and refine legal documents, including motions, briefs, and contracts.</li><li>Represent clients in preliminary hearings and depositions, with guidance from senior attorneys.</li><li>Engage in client consultations to gather information, provide legal advice, and establish trust.</li><li>Collaborate with senior attorneys to develop case strategies and prepare for trials.</li><li>Attend legal workshops, seminars, and court proceedings to stay updated with current laws and legal trends.</li><li>Participate in settlement negotiations, striving for the best outcomes for our clients.</li><li>Assist in the preparation of legal arguments, applications, declarations, and motions.</li><li>Maintain strict confidentiality of client information and firm internal communications.</li><li>Collaborate closely with colleagues to continuously refine our case management processes.</li><li>Address and resolve case-related issues promptly, ensuring client satisfaction.</li><li>Ensure timely and accurate reporting on case developments and outcomes.</li><li>Undertake additional tasks and responsibilities as directed by the Managing Partner, including legal administrative duties.<br/><br/><br/></li></ul><strong>Qualifications And Skills<br/><br/></strong><ul><li>J.D. degree from an accredited law school.</li><li>Active membership in the California Bar with 3-5 years of experience as an Associate Attorney.</li><li>Proficient understanding of client communication protocols, from initial intake to case conclusion.</li><li>Bilingual proficiency in Spanish is highly desirable.</li><li>Expertise in MS Office and legal databases.</li><li>Exceptional written and verbal communication skills.</li><li>Proven decision-making and problem-solving abilities.</li><li>Strong organizational and leadership capabilities.</li><li>Familiarity with standard office equipment.</li><li>Physical ability to lift and/or move up to 20 pounds.</li><li>Reasonable accommodations will be provided to enable individuals with disabilities to perform essential functions.<br/></li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3969582607"}