{"jobTitle": "Shipping/Receiving Clerk", "company": {"name": "IST Management", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00 - 19.00/hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Outsourcing and Offshoring Consulting", "description": "Overview<br/><br/>IST Management is seeking a Shipping/Receiving Clerk to join our team at IST Management Services in Calabasas, CA! The Shipping/Receiving Clerk will be responsible for processing and receiving packages, handling incoming and outgoing mail, assisting with on-site events and other tasks as assigned. Ideal candidates will have prior related experience, are willing to train, possess a level of professionalism and are ready to grow in their office services career!<br/><br/>Benefits:  Medical, Dental, Vision, STD, LTD, Life, 401K, Paid Time Off, and Bonus Incentives!<br/><br/>Hourly Compensation: $18.00 - $19.00/hour<br/><br/>Schedule: Monday-Friday, 8:00 AM – 5:00 PM<br/><br/>Who We Are<br/><br/>In business since 1997 with over 1,800 employees, IST Management is a business process outsourcing company with operations in over 38 cities across the U.S. We provide a range of services geared toward litigation and corporate office support including e-Discovery services such as processing, hosting, court reporting, collections/forensics, managed review, and managed services. IST Management is a Relativity Certified Provider. We also provide a full range of facilities management and office services.<br/><br/>We’ve been recognized as one of the fastest-growing companies in the U.S. as a winner of the Nation’s Best &amp; Brightest Companies to Work For, as well as the HR Professional Excellence Award from the Society for Human Resource Management. We are proud to belong to the Military Spouse Employment Partnership through our nation’s Department of Defense and have committed to Hiring Our Heroes’ mission to hire 100,000 active and former service members in 2021. IST Management has also been included in the INC 5000 list!<br/><br/>You can check out istmanagement.com for more info on us!<br/><br/>Responsibilities<br/><br/> We are seeking a Shipping/Receiving Clerk to join our team at IST Management Services to handle inbound and outbound mail/shipments. <br/><br/><ul><li> Shipping/Receiving Services – Receive and send overnight packages, utilization of forklift and Pallet Jack as needed </li><li> Mail Operations - Sort incoming mail and handle according to established procedures </li><li> Customer Service - Demonstrate flexibility in satisfying customer demands in a high volume, production environment </li><li> Palletise product for shipping; Dismantle pallets and prepare for distribution </li><li> Stage product for distribution and shipping; Adhere to all safety procedures </li><li> Knowledge of international shipping and customs requirement </li><li> Participate in cross-training ; Perform other tasks as assigned to uphold client and site needs </li><li> Ability to lift, push &amp; carry up-to 50 lb. <br/><br/></li></ul>Qualifications<br/><br/>Ideal candidates will have relevant experience in mail operations, customer service and a desire to grow their professional career.<br/><br/><ul><li> High school diploma or equivalent (GED) - College Degree is a plus </li><li> Prior forklift experience is a plus </li><li> Professional appearance and demeanor </li><li> Keyboarding and windows environment PC skills </li><li> Excellent communication skills both verbal and written </li><li> A valid driver’s license/access to reliable transportation to and from work </li><li> Lifting up to 55 pounds <br/><br/></li></ul>IST Management provides reasonable accommodations to individuals with a disability in accordance with applicable law in both the application and employment stages. If you require any accommodation in completing your application for employment, please let us know by informing our Talent Acquisition team. Contact information here: https://www.istmanagement.com/talent-acquisition-team<br/><br/>Please respect individuals reaching out for accommodations by utilizing the contact information only for this purpose. You will receive correspondence directly from your local IST Management hiring team regarding your application submission and status after submission.<br/><br/>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "responsibilities": "We are seeking a Shipping/Receiving Clerk to join our team at IST Management Services to handle inbound and outbound mail/shipments. <br/><br/><ul><li> Shipping/Receiving Services – Receive and send overnight packages, utilization of forklift and Pallet Jack as needed </li><li> Mail Operations - Sort incoming mail and handle according to established procedures </li><li> Customer Service - Demonstrate flexibility in satisfying customer demands in a high volume, production environment </li><li> Palletise product for shipping; Dismantle pallets and prepare for distribution </li><li> Stage product for distribution and shipping; Adhere to all safety procedures </li><li> Knowledge of international shipping and customs requirement </li><li> Participate in cross-training ; Perform other tasks as assigned to uphold client and site needs </li><li> Ability to lift, push &amp; carry up-to 50 lb. <br/><br/></li></ul>", "qualifications": {"required": "High school diploma or equivalent (GED) - College Degree is a plus, Prior forklift experience is a plus, Professional appearance and demeanor, Keyboarding and windows environment PC skills, Excellent communication skills both verbal and written, A valid driver’s license/access to reliable transportation to and from work, Lifting up to 55 pounds <br/><br/>", "preferred": ""}, "skills": ["Forklift", "Customer Service", "Shipping", "Receiving", "Mail", "Pallet Jack", "International Shipping", "Customs"], "postedDate": "18 hours ago", "benefits": "Medical, Dental, Vision, STD, LTD, Life, 401K, Paid Time Off, and Bonus Incentives!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3969554712"}