{"jobTitle": "Human Resources Manager, Environmental, Health & Safety Sr. Manager", "company": {"name": "Dr. Squatch", "industry": "Personal Care Product Manufacturing", "size": "51-200 employees", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Personal Care Product Manufacturing", "description": "At Dr. Squatch (www.drsquatch.com), we’re raising the bar on men’s personal care with our line of natural, high-performance products. We’re on a high-growth, fast-moving ride, continually introducing new product categories, launching into retailers nationwide, and growing internationally. We have been recognized and certified by Great Place to Work® multiple times, and we achieved status as a certified B Corp in 2023. We are looking for passionate, talented people who want to join us in our mission to inspire and educate men to be happier and healthier!", "responsibilities": "Labor Compliance Oversight: Ensure that all HR practices, policies, and procedures comply with local, state, and federal labor laws and regulations. Policy Development and Implementation: Collaborate with the People & Culture leadership and Legal teams to develop and implement HR policies and procedures related to labor compliance. Training and Education: Conduct training sessions for P&C associates and other relevant staff on labor laws, regulations, and company policies. Audit and Monitoring: Regularly audit HR practices and processes to ensure compliance with labor laws and regulations. Risk Management: Identify potential areas of risk related to labor compliance and work with the Director of People, Culture & Risk to develop strategies to mitigate these risks. Supervision of P&C Associates: Provide guidance, support, and supervision to the P&C associates in their day-to-day tasks, ensuring alignment with company policies and goals. Collaboration: Collaborate with other departments, such as Risk Management and Legal, to ensure a comprehensive approach to labor compliance. Workers’ Compensation: Serve as the primary contact with workers’ compensation partner regarding claims activities. Employee Relations: Serve as the primary escalation point for employee relations inquiries for the HR team and conduct investigations as necessary. Change Management: Provide change management support when rolling out new People & Culture processes and initiatives.", "qualifications": {"required": "Bachelor’s degree in Business Administration, Human Resources, Environmental Safety and Health, engineering or a related field is required. At least 6+ years of experience in a manufacturing, fulfillment or warehouse and Human Resources, Risk Management, or related field. HR certification is required, with preference given to those holding a senior-level certification (e.g. SHRM-CP, SHRM-SCP, PHR, SPHR). Excellent analytical skills with the ability to interpret data and metrics. Prior experience supervising/managing a team is preferred. Proven experience in project management, including ideation, planning, delegation, monitoring and follow-up to ensure successful completion and desired results. Experience performing HR audits is required. Experience in risk management and workers’ compensation initiatives is preferred, as this role includes tasks related to safety and risk mitigation. Prior experience supporting the implementation of an HRIS preferred. Prior experience with ADP Workforce Now or similar platform is preferred. Excellent communication and interpersonal skills, comfortable working and engaging with all levels of an organization as needed. Critical thinking skills with the ability to work independently, solving problems. High attention to detail, while maintain confidentiality of employee data and information. Excellent communication skills. Interest in health and wellness, personal care, and/or eCommerce industries. Experience working in the consumer products industry is highly preferred. Someone who gets things done without perfect resources is innovative and works with a sense of urgency. Someone who has high standards takes ownership and is invested in the outcome. Someone who proactively helps others stays positive and has a good sense of humor.", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "We offer a competitive salary in a growth-focused & collaborative team environment. Benefits include medical, dental, vision, 401k with Squatch match, and PTO. We also have great perks like healthy snacks, frequent company events, and of course, free products!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3969577001"}