{"jobTitle": "Manufacturing Supervisor I (Titan)", "company": {"name": "Aesculap (US)", "industry": "Medical Equipment Manufacturing", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Medical Equipment Manufacturing", "description": "You’re an important part of our future. Hopefully, we're also a part of your future! At B. Braun, we protect and improve the health of people worldwide. You support this vision, bringing expertise and sharing innovation, efficiency and sustainability as values. That’s why we would like to keep developing our company with you. Keeping your future in mind, we’re making a joint contribution to health care worldwide, with trust, transparency and appreciation. That's Sharing Expertise.<br/><br/><strong>About B. Braun<br/><br/></strong>B. Braun Medical Inc., a leader in infusion therapy and pain management, develops, manufactures, and markets innovative medical products and services to the healthcare industry. Other key product areas include nutrition, pharmacy admixture and compounding, ostomy and wound care, and dialysis. The company is committed to eliminating preventable treatment errors and enhancing patient, clinician and environmental safety. B. Braun Medical is headquartered in Bethlehem, Pa., and is part of the B. Braun Group of Companies in the U.S., which includes B. Braun Interventional Systems, Aesculap ® and CAPS ® .<br/><br/>Globally, the B. Braun Group of Companies employs more than 64,000 employees in 64 countries. Guided by its Sharing Expertise ® philosophy, B. Braun continuously exchanges knowledge with customers, partners and clinicians to address the critical issues of improving care and lowering costs. To learn more about B. Braun Medical, visit www.BBraunUSA.com .<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Position Summary:</li><li>Together with the QC Process Control, Technical Services and Quality Engineering teams, the incumbent of this position will be accountable for the performance of their assigned operational area against shared business objectives such as safety, quality, compliance, and production costs/output. The incumbent will collaborate with peers to manage performance of equipment, systems, and processes; and will work to improve the output, efficiency or quality of the associated manufactured products.</li><li>Responsibilities: Essential Duties</li><li>Coordinates the day-to-day activities of a team of production workers to ensure that manufacturing operations run according to established production specifications and schedules, volume, cost and wastage targets or quality standards.</li><li>Monitors the volume and quality of output and adjust tasks, timing, equipment set-up or inputs so that production specifications are met and resources are used efficiently.</li><li>Supervises staff to ensure that all production tasks are performed and all machines and equipment operated safely.</li><li>Trains new workers in the organization’s operating procedures and standards.</li><li>Responsible for department safety and training.</li><li>Prepares production reports so that performance problems can be identified and resolved.</li><li>The job function listed is not exhaustive and shall also include any responsibilities as assigned by the Supervisor from time to time.</li><li>Expertise: Knowledge &amp; Skills</li><li>Requires basic knowledge of relevant business practices and procedures in professional field. Uses standard theories, principles and concepts and integrates them to propose a course of action.</li><li>Provides direct or supervision to a group of employees, assigning tasks and checking work at frequent intervals. Accountabilities include work and people scheduling, performance management and recommendations for hiring decisions.</li><li>Judgement is required in resolving complex problems based on experience.</li><li>Contacts are primarily with direct supervisor, peers and subordinates.</li><li>The targeted range for this role takes into account a range of factors that are considered when making compensation and hiring decisions; included but not limited to: skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. Compensation decisions are dependent on the facts and circumstances of each case. The range provided is a reasonable estimate.</li><li>#ID</li><li></li><li>#MSL <br/><br/></li></ul><strong> Professional competencies <br/><br/></strong><ul><li>Expertise: Qualifications - Experience/Training/Education/Etc</li><li>Required:</li><li>Bachelor's degree required or equivalent combination of education and experience</li><li>02-04 years related experience required.</li><li>Ability to work non-stand schedule as needed</li><li>Desired:</li><li>N/A</li><li>While performing the duties of this job, the employee is regularly required to sit and talk or hear. The employee frequently is required to use hands to handle or feel and reach with hands and arms. The employee is occasionally required to stand and walk. The employee must occasionally lift and/or move up to 20 pounds.</li><li>To learn more about B. Braun and our safety healthcare products or view a listing of our employment opportunities, please visit us on the internet at www.bbraunusa.com</li><li>. <br/><br/></li></ul><strong>What We Offer<br/><br/></strong>B. Braun offers an excellent benefits package, which includes healthcare, a 401(k) plan, and tuition reimbursement. To learn more about B. Braun and our safety healthcare products or view a listing of our employment opportunities, please visit us on the internet at www.bbraunusa.com.<br/><br/>Through its “Sharing Expertise®” initiative, B. Braun promotes best practices for continuous improvement of healthcare products and services.<br/><br/>Contact : B. Braun Medical Inc. | |", "responsibilities": "Coordinates the day-to-day activities of a team of production workers to ensure that manufacturing operations run according to established production specifications and schedules, volume, cost and wastage targets or quality standards.\nMonitors the volume and quality of output and adjust tasks, timing, equipment set-up or inputs so that production specifications are met and resources are used efficiently.\nSupervises staff to ensure that all production tasks are performed and all machines and equipment operated safely.\nTrains new workers in the organization’s operating procedures and standards.\nResponsible for department safety and training.\nPrepares production reports so that performance problems can be identified and resolved.\nThe job function listed is not exhaustive and shall also include any responsibilities as assigned by the Supervisor from time to time.", "qualifications": {"required": "Bachelor's degree required or equivalent combination of education and experience\n02-04 years related experience required.\nAbility to work non-stand schedule as needed", "preferred": "N/A"}, "skills": [], "postedDate": "1 month ago", "benefits": "B. Braun offers an excellent benefits package, which includes healthcare, a 401(k) plan, and tuition reimbursement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970608453"}