{"jobTitle": "Crew Member", "company": {"name": "Jersey Mike's Subs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Restaurants", "description": "Jersey Mike's Subs has been making amazing subs since 1956 in Point Pleasant New Jersey!<br/><br/>The Jersey Mikes tradition was founded on a strong sense of community and commitment to the personal and professional development of our people. Our goal is to serve the highest quality sub sandwich to our customer in a manner that projects a thankful and caring mentality to every person that comes through our door. Our culture is a culture of \"giving\" and supporting our local communities so that all can be lifted together.<br/><br/>\"Jersey Mike's \"A Sub Above\"<br/><br/>Jersey Mike's Subs is looking for Crew Members.<br/><br/>Become part of Jersey Mike's vibrant organization! Grab hold of our powerful positive energy with a Jersey Mikes ready-to-take-off career that is fun, fulfilling and rewarding!<br/><br/>If you like to have fun, banter with people and enjoy sharing your life then working at Jersey Mike's may be for you. Besides learning our business and pleasing people with our great authentic sub sandwiches, you'll learn a whole new level of social decorum to take through life.<br/><br/>So become part of our tradition! Jersey Mike's was built on a strong sense of community and an outstanding commitment to the personal growth of our people. If you enjoy being part of something special in a strong cultural and spirited environment then bring your energy and come grow with us!<br/><br/>The primary requirement of a Jersey Mike's employee is commitment to company goals:<br/><br/><ul><li>Create food consistent with Jersey Mike's high quality standards</li><li>Maintain restaurant that is noticeably cleaner than others</li><li>Work in a fast paced team driven atmosphere</li><li>Ability to multitask and work with a sense of urgency</li><li>Interface with customers and provide an exceptional experience</li><li>Full understanding of the terms accountability and information<br/><br/></li></ul><strong>Qualifications For The Job<br/><br/></strong><ul><li>Education: High school degree or equivalent</li><li>1 Year QSR experience preferred</li><li>Other: Must be 18 years or older to operate the slicer</li><li>Serve Safe Certification - Food Handler</li><li>Must have reliable transportation<br/><br/></li></ul>Key Competencies<br/><br/><ul><li>Excellent Menu and product knowledge awesome personality</li><li>Must be able to thrive in a fast pace environment</li><li>Desire to improve self and skill sets</li><li>Able to communicate effectively with guests. Awesome personality</li><li>Participate in all Jersey Mike's training programs</li><li>Ability to meet schedule requirements and is a reliable performer<br/><br/></li></ul>This website is not operated by Jersey Mike's Franchise Systems. Jersey Mike's restaurants are independently owned and operated franchise locations. Franchisees are independent business owners who set their own wage and benefit programs, which can vary between franchisees. Your application will go directly to the franchisee, and all hiring decisions will be made by the franchisee.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3970127715"}