{"jobTitle": "Brand Marketing Manager, Creators", "company": {"name": "Instagram", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "122,000.00/yr - 176,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "At Instagram, our mission is to inspire creativity that brings people together. We are looking for an Brand Marketing Manager who shares this vision and can bring it to creators. We want to continue to inspire creators in their journey to share their creativity with the world and form meaningful connections with their community to drive their success. As a part of the Brand and Integrated Creator Marketing team you will play a key role in amplifying our brand vision - and collaborate with a passionate, creator-centric team dedicated to breaking traditional marketing molds. Together you’ll conceptualize engaging campaigns, programs and activations that keep our brand exciting and tapped into youth culture, plus loved by our audience - inspiring massive earned media and creator action.The ideal candidate will have experience in: Strategic, cultural consumer marketing that is rooted in deep consumer insight, understanding of the consumer, cultural, market dynamics and the right mix of brand and product knowledge to deliver effective marketing plans that move the needle. Experience in executing brand campaigns, brand partnerships / collaborations, and creator amplification strategies and tactics in consumer brands or creative agencies is a strong preference.<br/><br/>Brand Marketing Manager, Creators Responsibilities:<br/><br/><ul><li>Define and lead end-to-end development of marketing programs and go-to-market strategy for creator marketing programs - that meet our short and long-term business goals</li><li>Keep the pulse on creator, industry and cultural evolutions to identify opportunities for the brand to create resonant brand work and build relationships with our audience</li><li>Develop strategic creative briefs that align to the business objectives, brand strategy and goals</li><li>Manage and brief agency partners and enable them to execute their very best work</li><li>Drive alignment and partner closely with cross-functional teams (media, comms, creative, product marketing, consumer marketing, partnerships) to identify opportunities and deliver integrated programs</li><li>Develop and share channel marketing best practices, plus bring continuous innovation to creator touchpoints</li><li>Develop measurable KPIs and track performance of campaigns to provide data-backed insights to optimize campaigns and find new opportunity areas<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>7+ years of experience in managing and executing creator or consumer-facing integrated campaigns and long-term brand building through a diverse media mix</li><li>Experience in leading and working in matrixed teams and organizations</li><li>Experience leading and working with a roster of high-performing creative and media agencies</li><li>Proven track record of influencing effectively cross-functionally across all levels of management</li><li>Knowledge of creators or youth audiences, with a demonstrated experience utilizing audience research and data to drive actionable insights that inform marketing strategy and improve the audience experience<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience in at building brands that a role in youth or creator culture or that involved creators and public figures</li><li>Experience working in a fast paced, scrappy environment, thriving amidst ambiguity while ensuring executional excellence<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$122,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.<br/><br/>", "postedDate": "6 hours ago", "skills": ["Marketing", "Brand Management", "Consumer Marketing", "Campaign Management", "Social Media Marketing", "Creator Marketing", "Integrated Marketing", "Media Planning", "Agency Management", "Cross-Functional Collaboration", "Data Analysis", "Performance Marketing", "Youth Culture", "Brand Strategy", "Marketing Strategy", "Go-to-Market Strategy", "Audience Research", "Cultural Insights", "Strategic Planning", "Creative Briefs", "KPI Tracking", "Campaign Optimization", "Influencer Marketing", "Brand Building", "Media Mix", "Team Leadership", "Matrixed Organizations", "Influencing", "Audience Experience", "Youth Audience", "Brand Development", "Fast-Paced Environment", "Ambiguity Tolerance", "Executional Excellence"], "url": "https://www.linkedin.com/jobs/view/3970887773"}