{"jobTitle": "Senior Manager of Operations, Wholesale", "company": {"name": "AllSaints", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Director", "salary": {"amount": "125,000/yr - 140,000/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Apparel & Fashion", "description": "THE ALLSAINTS TEAM<br/><br/>At AllSaints we are in the business of feelings - making our customers feel cool and confident. If, like us, you believe in the power of a great outfit, we'd love to talk to you.<br/><br/>We're a global brand made up of a very diverse mix of talented people in a huge variety of roles. Our products are designed in house and made by a small number of suppliers and artisans around the world to sustainable standards.<br/><br/>We are a brand embarking on a very exciting plan and we are seeking new members of the team who want to contribute to this.<br/><br/>Our head of wholesale operations owns all aspects of the pre and post-sales wholesale process including liaison between sales, planning, production logistics and technology to help our sales teams to grow our business by ensuring our service delivery to our wholesale partners is seamless and exemplary. You will work with our customers, partners and internal teams to ensure our sales’ teams order books are converted to shipments and invoicing at a maximum “on time, in full” level.<br/><br/>Must be able to work a flexible schedule according to the needs of the business including, and not limited to, some travel to our Illinois warehouse and occasional travel to the UK.<br/><br/>WHAT WILL I BE DOING?<br/><br/><ul><li>Drive business results by supporting our sales teams to ensure we can fulfill all wholesale orders promptly and effectively</li><li>Act as a subject matter expert for the wholesale team across logistics and technology representing the wholesale team to ensure effective implementation of key projects and initiatives such as systems implementations of Netsuite and Product Inventory Management, as well as logistics of dropship, cross-docking and RFID</li><li>Partner with technology and logistics teams to ensure changes are effectively managed and introduced, advocating for improvements and helping our wholesale team to understand the benefits of change adoption</li><li>Reduce and challenge wholesale chargebacks and returns, analyzing chargeback reason codes, passing back key feedback to product teams, working with our distribution teams to understand and overcome compliance challenges, review ticketing needs by business partner</li><li>Help lead a successful implementation of our Netsuite, end to end, system by helping to lead U.A.T. testing and understanding how to help deliver a project that is fit for purpose.</li><li>Provides consistent feedback that motivates our team and fosters a team environment by using effective communication skills.</li><li>Ensuring the order book is converted as accurately and completely as possible, working with product and logistics teams to ensure stock availability and address any issues promptly</li><li>Set and communicate customer service priorities with partners</li><li>Creates and reinforces a proactive customer centric environment, working with persistence and accuracy to ensure high quality customer outcomes</li><li>Manage and oversee drop-shipping SLAs, ensuring reporting, tracking and communication of dropship performance and metrics</li><li>Ensure adherence to partner Supplier Manuals and ownership of new account set-up process to ensure compliance</li><li>Utilizing EDI to streamline operations, enhance data accuracy and security, and gain real-time insights into supply chain process</li><li>Liaison with our legal, finance and logistics teams to facilitate agreement of new supplier contracts for new business as required</li><li>Understands and adheres to all company policies and procedures</li><li>Creates a fun and aspirational team atmosphere that encourages customers and partners to engage with AllSaints<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>5+ years of wholesale operations managerial experience</li><li>Understanding of Nordstrom, Amazon would be advantageous</li><li>Strong verbal and written communication skills</li><li>Commercial project management ability</li><li>Proven ability to build strong cross-functional working relationships<br/><br/></li></ul>Pay Range in West Hollywood, CA:<br/><br/>Exact compensation may vary based on skills, experience, and location.<br/><br/>Base Salary:<br/><br/>$125,000/yr - $140,000/yr<br/><br/>ABOUT THE LOCATION<br/><br/>Our North America region is made up of 76 retail locations across the US and Canada with our flagship store in SoHo, New York City. We are primarily based out of our Los Angeles studios, bringing our brand infamous aesthetic to the West Hollywood hills.<br/><br/><strong>What We Stand For<br/><br/></strong><strong>The Customer is the Boss</strong> We work as one proud team to get the best for our customers<br/><br/><strong>One Team</strong> We are joined up and encourage others to share their ideas<br/><br/><strong>We Do What We Say We Will</strong> We know our goals, and we work with clear outcomes in mind<br/><br/><strong>We Are Responsible</strong> We are self aware, understand the impact we have on others and are positive about the future", "responsibilities": "<ul><li>Drive business results by supporting our sales teams to ensure we can fulfill all wholesale orders promptly and effectively</li><li>Act as a subject matter expert for the wholesale team across logistics and technology representing the wholesale team to ensure effective implementation of key projects and initiatives such as systems implementations of Netsuite and Product Inventory Management, as well as logistics of dropship, cross-docking and RFID</li><li>Partner with technology and logistics teams to ensure changes are effectively managed and introduced, advocating for improvements and helping our wholesale team to understand the benefits of change adoption</li><li>Reduce and challenge wholesale chargebacks and returns, analyzing chargeback reason codes, passing back key feedback to product teams, working with our distribution teams to understand and overcome compliance challenges, review ticketing needs by business partner</li><li>Help lead a successful implementation of our Netsuite, end to end, system by helping to lead U.A.T. testing and understanding how to help deliver a project that is fit for purpose.</li><li>Provides consistent feedback that motivates our team and fosters a team environment by using effective communication skills.</li><li>Ensuring the order book is converted as accurately and completely as possible, working with product and logistics teams to ensure stock availability and address any issues promptly</li><li>Set and communicate customer service priorities with partners</li><li>Creates and reinforces a proactive customer centric environment, working with persistence and accuracy to ensure high quality customer outcomes</li><li>Manage and oversee drop-shipping SLAs, ensuring reporting, tracking and communication of dropship performance and metrics</li><li>Ensure adherence to partner Supplier Manuals and ownership of new account set-up process to ensure compliance</li><li>Utilizing EDI to streamline operations, enhance data accuracy and security, and gain real-time insights into supply chain process</li><li>Liaison with our legal, finance and logistics teams to facilitate agreement of new supplier contracts for new business as required</li><li>Understands and adheres to all company policies and procedures</li><li>Creates a fun and aspirational team atmosphere that encourages customers and partners to engage with AllSaints<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>5+ years of wholesale operations managerial experience</li><li>Understanding of Nordstrom, Amazon would be advantageous</li><li>Strong verbal and written communication skills</li><li>Commercial project management ability</li><li>Proven ability to build strong cross-functional working relationships<br/><br/></li></ul>"}, "skills": [], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970284481"}