{"jobTitle": "Business Development Manager", "company": {"name": "Transvirtual ", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "<strong>The role:<br/><br/></strong>In this newly created role, you will spearhead and lead our acquisition focus in the North America market for our industry leading Transport Management System (TMS).<br/><br/>Established over 18 years ago in the Australian market, TransVirtual is a fully integrated platform connecting agents, carriers, and logistic businesses all over the globe. Its strength is in its simplicity and scalability, as well its ability to integrate multiple carriers for a full 360-degree view of your logistics business.<br/><br/>This role is of strategic importance to open pathways to introduce our technology with transport and logistics companies all over North America. You will have a background in sourcing new business opportunities be it over the phone and face to face; and have extensive experience with negotiating high level deals that may be complex in structure.<br/><br/>Having knowledge of the logistics industry will be a huge benefit, but most importantly your ability to understand quicky the relationships and connections to unlock deals will be paramount. Because of the nature of these partnership opportunities, networking, connecting with key decision makers and having a presence online and in person at key events will play an important role in your success.<br/><br/>In support, we have a resourceful and dedicated team with decades of experience in the logistics space. As we are making in-roads into this market, this role represents a unique opportunity to make your mark and help grow this exciting technology abroad.<br/><br/>Your key stakeholders will be our Head of Sales and General Manager.<br/><br/><strong>Why you will love this role:<br/><br/></strong><ul><li> Become a sales leader in a brand-new market: We have a robust plan to expand further in the US market, to connect our platform to businesses in the North America market. Get in the door early to grow within the ranks of a fast paced and growing organization. </li><li> Join a dedicated and experienced team: you’ll work alongside a dedicated and experienced team who have carved out a solid reputation for operational experience. </li><li> Drive your initiatives to success: a large part of this role will you bringing your own ideas and experiences to meet the needs of our acquisition targets. As a business we thrive on everyone’s initiative to grow the business. </li><li> The team is built on accountability and trust: we have built our foundations on a Charter of Culture to support the team to meet milestones, drive to better performance and have open and honest communication…. always</li><li> Friendly, remote team: we are a fun team, largely based in Australia, but also Philippines, India, USA, and Pakistan. You’ll get the chance to collaborate with multiple teams who are all inclusive and open<br/><br/></li></ul><strong>Essential Skills / qualifications:<br/><br/></strong><ul><li>4+ years’ experience in a business development role. </li><li>Adept at sourcing and following up opportunities to meet sales targets</li><li>Excellent communication and negotiation skills</li><li>Experience in managing a contact pipeline – CRM updates (we use HubSpot)</li><li>Networking experience to connect with business owners and managers. </li><li>A proven talent for opening doors and negotiating strategic deals</li><li>Ability to think and act fast as directions change to meet sales quota <br/><br/></li></ul><strong>Desired Skills:<br/><br/></strong><ul><li>Marketing university degree or equivalent – maturity in your thinking is what we are after</li><li>Understanding/experience of the logistics sector / SaaS businesses</li><li>Excellent communication and negotiation skills – find and close deals</li><li>Ability to connect with a range of customers and finding key buying habits of prospects</li><li>Great team player who understands the importance of working together to meet a common goal<br/><br/></li></ul><strong>About TransVirtual:<br/><br/></strong>TransVirtual is a modern SaaS business, delivering industry-leading logistics solutions.<br/><br/>Inspired by his family’s involvement in the transport industry, our founder set out to build a truly configurable Transport Management System (TMS) that could adapt to the diverse needs of this sector. We’ve built on our unique selling point of configurability by developing a deep network which allows transport businesses to process more data, more effectively, through extensive integrations.<br/><br/>Today we have evolved our product set beyond TMS and offer a complete logistics solution, expanding beyond Australia into New Zealand, USA and Canada.<br/><br/>Our culture is constantly evolving, and we ensure strategic alignment through clear goals set using OKRs. We thrive on positive, consistent, and collaborative communication, necessary for a remote first business. We support that through fortnightly all hands meetings and Quarterly Workshops including Retros.<br/><br/>We’re always looking for outstanding candidates to join us as Technology, Logistics and Growth experts. So, if you’re excited by this opportunity, we’d love to hear from you!", "postedDate": "1 month ago", "skills": ["CRM", "HubSpot", "Sales", "Business Development", "Negotiation", "Logistics", "SaaS", "Marketing", "Networking"], "url": "https://www.linkedin.com/jobs/view/3970592180"}