{"jobTitle": "Merchandise Planner, Wholesale, Beyond Yoga", "company": {"name": "Beyond Yoga", "industry": "Retail Apparel and Fashion, Design Services, and Retail", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$66,500.00 - $97,800.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion, Design Services, and Retail", "description": "Female founded and led, Beyond Yoga creates buttery soft activewear and beyond for every size, shape, moment, and movement from our own line of meticulously researched fabrics. Our obsession for softness and fabrics, and a relentless pursuit of quality and fit makes Beyond Yoga a fan favorite at every stage of life. We proudly celebrate diversity and welcome all ethnicities, cultural backgrounds, belief systems, and identities.\n\nWe encourage our team to be active members of their local and global communities through opportunities like Social Good Day to participate in a cause of their choosing. Like us, the people we hire are passionate, honest, warm, enthusiastic, and fun!\n\nIn September 2021, we joined Levi Strauss & Co., one of the world’s largest brand-name apparel companies and a global leader in jeanswear. Beyond Yoga operates as a standalone brand with the benefit of LS&Co.’s global capabilities to help it achieve its goals of brand-building, store opening, category expansion and distribution.", "responsibilities": "Responsible for supporting the Sr. Manager of Wholesale Planning by providing the tools and data needed to properly review the wholesale business, execute channel and account-specific strategies, manage inventory levels, and communicate results to cross-functional partners and Executive team. Primary responsibility will be to produce and distribute scheduled reporting, ensuring that the information communicated is clear and accurate. This position will also coordinate the collection of information from internal and external sources to support in all the wholesale budgeting, forecasting, and planning activities.", "qualifications": {"required": "Not specified", "preferred": "Ability to read, interpret, and analyze raw data to draw actionable conclusions. Strong analytical, mathematical, & statistical skills. Must know retail math. Can communicate clearly and concisely verbally and in writing. Ability to build and maintain complex excel spreadsheets with advanced formula knowledge. Comfortable with working in excel daily and data mining to support broader team’s goals."}, "skills": ["Analytical skills", "Mathematical skills", "Statistical skills", "Retail math", "Excel proficiency"], "postedDate": "16 hours ago", "applicationDeadline": "Not specified", "benefits": "Levi Strauss & Co. (LS&Co.) offers a total rewards package that includes competitive pay, incentive plans, and a wide array of benefits designed to help you and your family stay healthy, meet your financial goals, and balance the demands of your work and personal life. Available benefits vary depending upon the specifics of the role; details relating to a specific role will be made available upon request.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3970460868"}