{"jobTitle": "Head of Operations, Fulfillment & Last Mile", "company": {"name": "Gently", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "description": "Gently is an innovation-driven, same-day fulfillment and delivery provider enabling e-commerce and retail brands to offer lightning-fast, cost-efficient and sustainable same-day delivery and returns. Since launch in April 2023, the company secured significant early stage funding, grew with over 50% M-o-M and closed partnerships with leading brands and retailers. As Gently enters its next phase of growth, we are looking to add a Head of Operations to our leadership team who can support the successful operational management of our rapid expansion while ensuring excellence in the execution of Gently’s ambitious vision.<br/><br/>We are looking for a highly motivated and experienced Head of Operations, Fulfillment & Last Mile to join our team. The individual will be responsible for leading data-driven operational excellence, overseeing systems and processes, and evolving our logistics infrastructure, which serves both enterprise retailers and DTC eCommerce customers. This role would be based in Los Angeles, CA and report directly to the company founders.<br/><br/>Tasks<br/><br/><ul><li>Develop and implement a scalable logistics infrastructure to support rapid growth across fleet management, middle mile transportation, sortation, warehouse management, fulfillment, and last mile delivery.</li><li>Lead and implement data-driven procedures and systems across the company to ensure operational efficiency, customer satisfaction and effectiveness. </li><li>Develop and implement robust supply chain metrics, cost models and KPIs to measure performance and track progress against goals. </li><li>Oversee day-to-day logistics operations and workforce, ensuring timely and cost-effective fulfillment and delivery.</li><li>Manage relationships with third-party logistics providers and negotiate contracts to optimize costs and service levels.</li><li>Provides leadership for continuous improvement in current logistic setup (e.g. processes, technology/tools, physical infrastructure, vendor partnerships, etc.). </li><li>Directly responsible for P&L, compliance and workforce (e.g., hiring, training, and developing logistics staff)</li><li>Proactively communicate supply chain issues, risks, and opportunities to senior management and drive collaborative solutions. </li><li>Work with Sales and Marketing to forecast and plan for changes in demand and make necessary adjustments to optimize assets and resources<br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>10-15 years’ experience in logistics, supply chain, 3PL, last-mile, operations or related field, especially in an entrepreneurial environment</li><li>Substantial experience in developing logistics/last-mile operations for both retail and DTC eCommerce business </li><li>Proven track record of scaling operations from a pre-seed / seed company to series B or later in a senior leadership role, with direct responsibility of P&L</li><li>Proven track record of adopting technology and analytical solutions to optimize logistical processes and achieve business objectives</li><li>Strong understanding of supply chain best practices, industry trends, and emerging technologies. </li><li>Entrepreneurial, growth mindset, scrappy, roll-up-the-sleeves attitude<br/><br/><br/></li></ul>Benefits<br/><br/><ul><li>Total compensation 150K-180K (including bonus) plus competitive stock option package as a key early stage leader<br/></li></ul>", "jobFunction": "General Business", "industry": "Transportation, Logistics, Supply Chain and Storage", "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970258588"}