{"jobTitle": "Chief of Staff", "company": {"name": "JustFab", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "125,600.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail Apparel and Fashion", "description": "Job Description<br/><br/>JustFab is looking for a Chief of Staff.<br/><br/>How do you fit In?<br/><br/>This position will report directly to the Co-CEOs, JustFab.<br/><br/>What You Will Do<br/><br/><ul><li>Ad hoc projects – drive cross-functional, company-wide projects by providing analytical rigor to projects, facilitating collaboration with multiple brand and business units, and strategically managing project scope and implementation</li><li>Deck creation + ideation – develop materials for company board meetings, all-company town halls, strategic off-sites, and external conferences</li><li>Internal communications – drive internal and external communications, including investor updates, strategic industry updates, and comp any-wide communications</li><li>Support executive team – meetings, admin, offsite – facilitate weekly executive meetings and quarterly strategy off-sites, ensuring accountability and helping drive implementation of initiatives</li><li>Strategic thought partner – act as thought partner and ear to the ground for President, Global Fashion Brands; surface issues, roadblocks, and concerns from the org and drive alignment and buy-in for executive projects and priorities</li><li>Cross-functional liaison – serve as a liaison to cross-functional groups across the entire company with a focus on analytics, process improvements, and problem solving <br/><br/></li></ul>What You Can Bring<br/><br/><ul><li>4-6 years prior experience as a management consultant; pre-MBA candidates preferred</li><li>Self-starter – demonstrated ability to get things done from ideation to implementation with little input needed</li><li>Entrepreneurial – resourceful and innovative – you’re always questioning if there is a better, simpler way to do something</li><li>Quick learner – able to dive into any of the area business and get up to speed rapidly; strong intellectual curiosity</li><li>Strong communicator – able to influence people who you don't manage and be persuasive and effective while still remaining pleasant and professional</li><li>Analytical – highly analytical mindset with experience in data analytics and financial statements / financial planning</li><li>Problem solver – you come with solutions, not problems, and are always looking for a new challenge</li><li>Organized – strong attention to detail and ability to multi-task and prioritize in the face of many competing priorities</li><li>Trustworthy – used to handling confidential information with a high degree of integrity</li><li>Strategic – able to think big-picture and long-term</li><li>Storyteller – able to story-line at a high level and drive deck creation and ideation<br/><br/></li></ul>Where we are: Candidates must come to the El Segundo office 2-3 days a week.<br/><br/>Compensation &amp; Total Rewards<br/><br/>At JustFab, we believe work and life should fit together! We continue to build a culture of flexibility, to empower you to do your best and put yourself first. Our Total Rewards program rewards employees for their hard work, supporting their health, well-being, families, and ultimately their life journey. Total Rewards at JustFab includes: <br/><br/>  <br/><br/><ul><li>Hybrid Work Schedule*  </li><li>Discretionary Paid Time Off*  </li><li>Summer Fridays*  </li><li>Healthcare Plans  </li><li>Employee Discounts  </li><li>401k  </li><li>Annual Bonus Program  </li><li>Equity Program*  </li><li>And More  <br/><br/></li></ul>  <br/><br/><ul><li>Varied for retail and fulfillment roles <br/><br/></li></ul>  <br/><br/>The annual base salary range for this position is from $125,600-$150,000. The range provided includes the base salary that JustFab expects to pay for the role. Offered base salary will be dependent on factors including the scope and complexity of the role, candidate’s related work experience, subject matter expertise and work location. <br/><br/>About TechStyleOS<br/><br/>TechStyleOS is the globally integrated Operations and Services provider behind some of the fastest growing online fashion brands in history, including Fabletics, Savage X Fenty, JustFab, ShoeDazzle, and FabKids. With capabilities spanning technology, data science, supply chain management, fulfillment, customer service, and more, we help brands launch, scale and grow—across product categories and geographically. From predictive analytics to data-driven marketing and attribution, our unique approach is powered by our proprietary, end-to-end tech platform that enables the brands we serve to deliver a level of personalization, value, and satisfaction that are unrivaled in the fashion industry.<br/><br/>JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids) is an equal opportunity employer. We recruit, employ, compensate, develop, and promote regardless of race, national origin, religion, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, and other protected status as required by applicable. At JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids), we champion a vibrant workplace culture that thrives on diversity law and do not tolerate discrimination or harassment. We are one team from many backgrounds, innovating through diversity of individuals, who are driven by passion for creating an inclusive space for all. JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids) will continue to champion a workplace culture that prizes diversity and inclusivity.<br/><br/>We encourage you to apply regardless of meeting all qualifications and/or requirements.", "responsibilities": "<ul><li>Ad hoc projects – drive cross-functional, company-wide projects by providing analytical rigor to projects, facilitating collaboration with multiple brand and business units, and strategically managing project scope and implementation</li><li>Deck creation + ideation – develop materials for company board meetings, all-company town halls, strategic off-sites, and external conferences</li><li>Internal communications – drive internal and external communications, including investor updates, strategic industry updates, and comp any-wide communications</li><li>Support executive team – meetings, admin, offsite – facilitate weekly executive meetings and quarterly strategy off-sites, ensuring accountability and helping drive implementation of initiatives</li><li>Strategic thought partner – act as thought partner and ear to the ground for President, Global Fashion Brands; surface issues, roadblocks, and concerns from the org and drive alignment and buy-in for executive projects and priorities</li><li>Cross-functional liaison – serve as a liaison to cross-functional groups across the entire company with a focus on analytics, process improvements, and problem solving <br/><br/></li></ul>", "qualifications": {"required": "4-6 years prior experience as a management consultant; pre-MBA candidates preferred, Self-starter – demonstrated ability to get things done from ideation to implementation with little input needed, Entrepreneurial – resourceful and innovative – you’re always questioning if there is a better, simpler way to do something, Quick learner – able to dive into any of the area business and get up to speed rapidly; strong intellectual curiosity, Strong communicator – able to influence people who you don't manage and be persuasive and effective while still remaining pleasant and professional, Analytical – highly analytical mindset with experience in data analytics and financial statements / financial planning, Problem solver – you come with solutions, not problems, and are always looking for a new challenge, Organized – strong attention to detail and ability to multi-task and prioritize in the face of many competing priorities, Trustworthy – used to handling confidential information with a high degree of integrity, Strategic – able to think big-picture and long-term, Storyteller – able to story-line at a high level and drive deck creation and ideation<br/><br/>", "preferred": ""}, "skills": ["Management Consulting", "Data Analytics", "Financial Planning", "Communication", "Problem Solving", "Strategic Thinking", "Storytelling"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Hybrid Work Schedule, Discretionary Paid Time Off, Summer Fridays, Healthcare Plans, Employee Discounts, 401k, Annual Bonus Program, Equity Program, And More", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970265412"}