{"jobTitle": "Sales Associate", "company": {"name": "GUESS?, Inc.", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>Job Description<br/><br/></strong>Reports to: Store Management<br/><br/>Position Overview<br/><br/>The sales associate is responsible for maintaining store standards and delivering a positive customer experience. The sales associate will also be responsible for a variety of operational duties as assigned by the store management team (i.e. housekeeping duties, visual presentation standards, etc.).<br/><br/>Customer Experience<br/><br/><ul><li> Greets customers immediately upon entering the store with a smile and sincere non-business like greeting</li><li> Creates a positive first impression for the customer through an energetic attitude and adhering to dress code</li><li> Creates a sparkling clean and organized environment by maintaining store standards and cleanliness</li><li> Provides customers with current relevant information about the product</li><li> Provides quality service in the fitting rooms, follows up with customers in a timely manner and maintains cash wrap cleanliness</li><li> Provides efficient service at the cash wrap, offers Gift Cards, maintains cash wrap cleanliness and captures customer information in the database</li><li> Sincerely thanks all customers for shopping as they exit the store<br/><br/></li></ul>Cooperation &amp; Dependability<br/><br/><ul><li> Satisfactorily completes all duties as assigned by management</li><li> Is punctual and adheres to designated work schedule</li><li> Is flexible and works well with peers and management to accomplish duties</li><li> Demonstrates a sense of urgency to maintain visual standards within their assigned zone</li><li> Follows GUESS Policies and Procedures 100%</li><li> Performs housekeeping duties as required<br/><br/></li></ul>Miscellaneous Responsibilities<br/><br/><ul><li> Participates in and attends all store meetings and other related functions</li><li> Represents a positive attitude toward the merchandise and the company</li><li> Participates in all inventories</li><li> Assumes and completes other duties as assigned by store management</li><li> Some heavy lifting in excess of 30 pounds</li><li> Scheduled shifts may require standing for a minimum of eight hours<br/><br/></li></ul><strong>Brand<br/><br/></strong>GUESS Factory<br/><br/><strong>Store<br/><br/></strong>3210<br/><br/><strong>Store Address<br/><br/></strong>100 Citadel Drive, Suite 501 - Commerce, CA 90040<br/><br/><strong>Salary Minimum<br/><br/></strong>$16.00<br/><br/><strong>Salary Maximum<br/><br/></strong>$16.00", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3970360671"}