{"jobTitle": "Executive Creative Director", "company": {"name": "Bose Corporation", "industry": "Computers and Electronics Manufacturing, Motor Vehicle Manufacturing", "size": "Large", "location": "Framingham, MA"}, "location": "Framingham, MA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Not disclosed", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Computers and Electronics Manufacturing, Motor Vehicle Manufacturing", "description": "You know the moment. It’s the first notes of that song you love, the intro to your favorite movie, or simply the sound of someone you love saying “hello.” It’s in these moments that sound matters most.\n\nAt Bose, we believe sound is the most powerful force on earth. We’ve dedicated ourselves to improving it for nearly 60 years. And we’re passionate down to our bones about making whatever you’re listening to a little more magical.\n\nThe Marketing team at Bose consists of passionate, bold, and music-loving storytellers. We tap into the magic of what makes Bose, BOSE, and through our marketing efforts, connect that magic with people who relate to our belief that sound is the most powerful force on earth.\n\nThe Executive Creative Director provides the passion, vision and leadership behind our storytelling. This person is responsible for elevating our communications and severing as a creative beacon for acquiring talent. They will work with partners to determine how Bose should be represented through design, content, advertising and experiences. They are responsible overseeing the creative department, including the creative, production and studio teams, and managing outside creative agencies as well pushing the development of compelling storytelling, distinctive communications & digital content experiences; continuing the transition to a brand that acts as a more evergreen content publisher.", "responsibilities": "Invent and inspire creative outputs that are tied to an overall strategic framework. Partner with Marketing Strategy, Media, Ecommerce, Resellers to develop effective creative across all channels – online and offline. Ensure consistency in our brand identity, editorial voice, visual expressions. Present creative concepts in persuasive, articulate and compelling ways. Embrace and apply consumer insights to communications and be able to clearly articulate creative rationale. Overseeing the product imagery and content for site, apps and partners. Providing creative direction to partners, sponsors, and influencers on content creation. Elevate the standards, workflows, processes and skillsets to optimize the creative team’s outputs. Manage resource planning, budget and allocation. Review and interpret creative briefs and guide the creative work product. Understand goals, business requirements, constraints, and be able to work within project parameters. Ensure a consistent and cohesive approach across online and offline creative. Establish a strong creative environment and culture that allows you to Recruit exceptional creative talent. Manage the career development of creative resources and be a motivating and inspiring force in the company that gets the best performance out of people. Be the voice of the customer and a champion for world-class creative experiences. Managing external agents like photographers, printers, freelancers, web developers, etc., and coordinating them according to the work of art directors, copywriters, and other post production workers.", "qualifications": {"required": "15+ years Creative, People Manager, Diversity mindset, Global Experience", "preferred": ""}, "skills": ["Creative strategy", "Creative Direction", "Agency Relationships", "Concept Development", "Leadership skills", "Understanding of customer experience", "Staying current on trends and culture"], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3970415732"}