{"jobTitle": "Luxury Store Manager", "company": {"name": "Orlebar Brown", "industry": "Apparel & Fashion and Retail Luxury Goods and Jewelry", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000.00 - 75,000.00", "currency": "USD"}, "jobFunction": "Sales", "industry": "Apparel & Fashion and Retail Luxury Goods and Jewelry", "description": "COMPANY PROFILE\n\nOrlebar Brown (Chanel group) launched in March 2007 as a more tailored approach to men’s beach and swim shorts. Based on the traditional pattern of a tailored pair of trousers for men, and with their distinctive side fasteners, they are not just a swim short; they are the original and best shorts you can swim in.\n\nToday, our collections are built into broader lifestyles imagined around Beach, Resort, Coast and Sport. We have multiple product releases, including capsules, new categories and services, over the calendar year to maintain excitement, and interest for our customers.\n\nSince 2007, we have built the brand to achieve our stated purpose which is - to encourage, excite and inspire everyone to ‘Holiday Better’. This is our purpose and why we get out of bed every morning.\n\nThe brand has rapidly gained global recognition and is sold through online, more than 30 O .B stores, and the best retailers and hoteliers in the world. Our customer is truly international, so whether they are in St Barth’s for Christmas with family, Miami for a wild Spring break, a conference in Dubai with a few days off, tacking a boat off the coast of St Tropez, volunteering to replant mangrove plantations in Puerto Rico, walking along a cliff top in Cornwall, or diving off one into a beautiful blue ocean then O .B should be there to help you do it better.\n\nOur business is built on relationships with those customers, and we strive to maintain our relationship with them, wherever they might be, and provide world class service, when and where they want. It is also built on finding new customers to the brand by welcoming them to join the ever-growing O .B community.\n\nTHE POSITION\n\nAs a Store Manager, you will be an ambassador for the brand and a senior member of the retail team. Reporting directly to the Senior Retail Market Manager, your position will be ensuring the delivery of agreed sales strategy, retail profitability and KPI goals, and brand vision objectives within our retail stores. You will be responsible for the performance of the store and ongoing staff development.\n\nWe are looking for another strong team player to join us on our journey in establishing Orlebar Brown as the luxury choice lifestyle brand for holiday clothes to wear every day. This role has the potential to evolve quickly as we open more stores in the US.\n\nKEY ROLES AND RESPONSIBILITES\n\n* Hire, train & retain a sales team and assistant manager in partnership with the management team\n* Drive sales through a brand led and focused KPI culture\n* Partner with the management team to build and maintain a highly effective sales team\n* Monitor team performance, providing feedback to Senior Retail Market Manager and HQ team on a weekly basis\n* Building a client base and ensuring high sign up rate. Ensure relationships with customers are developed at all points of sale e.g. keeping them informed of new product, collections and launches\n* Operational competency, including store banking, cycle counts, scheduling, processing of shipments\n* Ensure all aspects loss prevention are considered and observed across the teams. Maintain security of shop premises, stock and all shop monies\n* Execute VM according to company guidelines, implement window sets\n* Communicate product needs and report on performance. Monitoring, maintaining and recording stock levels in the shop to ensure adequate stock levels in order to drive sales\n* Ensuring the team and store is looking its best at all times\n\nCANDIDATE PROFILE\n\n* Proven experience building, coaching and developing a team\n* Excellent communication skills, both verbal and written. Internal & external customer service are vital to your success in this role\n* Experience in high-end retail. Familiarity with the menswear market and luxury goods\n* The ability to create and drive sales/footfall during quieter periods\n* Experience in building client bases and client books\n* Computer skills, the ability to report across excel, word, comfortable with register and back office systems\n* Natural planning skills\n* A real attention to detail\n* Enthusiastic and enjoy your work\n* A practical multi-tasker, who can focus on the detail whilst never losing sight of the bigger picture\n\nPosition Logistics\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions.\n\n* Minimum 3 years of related experience\n* Ability to move heavy items - may include overhead lifting, pulling, and pushing of items up to 15 lbs-25 lbs.\n* Ability to stand for extended periods of time\n\nWHAT WE OFFER\n\nJoin a diverse working environment of people whom we learn from every day.\n\n* The chance to train and develop your skills in a fun and fast working environment.\n* Health insurance for full-time employment\n* Dental and Vision for full-time employment\n* Life insurance for full-time employment\n* 401K after 1 year employment\n* Beneficial company commission plan\n* Paid vacation and sick time\n\nIt’s never just a job at Orlebar Brown. It’s a way of life. We live and breathe our brand values – Tailored, Vibrant and Brave. Our team define who we are and how we get the job done. To apply, please contact jobs@orlebarbrown.comwith copy of your CV and a friendly introduction. Unfortunately, due to the number of applications, only those that are successful will be contacted.\n\nDirect applicants online. Recruitment agencies – thanks for reading, but we've got this one covered!\n\nJob Type: Full-time\n\nBase Pay: $65,000.00 - $75,000.00 per year + Bonus Eligibility\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Employee discount\n* Health insurance\n* Paid time off\n* Parental leave\n* Vision insurance\n\nExperience level:\n\n* 3 years\n\nShift:\n\n* 8 hour shift\n* Day shift\n\nWeekly day range:\n\n* Monday to Friday\n* Weekends as needed\n\nExperience:\n\n* Customer service: 3 years (Required)", "responsibilities": "* Hire, train & retain a sales team and assistant manager in partnership with the management team\n* Drive sales through a brand led and focused KPI culture\n* Partner with the management team to build and maintain a highly effective sales team\n* Monitor team performance, providing feedback to Senior Retail Market Manager and HQ team on a weekly basis\n* Building a client base and ensuring high sign up rate. Ensure relationships with customers are developed at all points of sale e.g. keeping them informed of new product, collections and launches\n* Operational competency, including store banking, cycle counts, scheduling, processing of shipments\n* Ensure all aspects loss prevention are considered and observed across the teams. Maintain security of shop premises, stock and all shop monies\n* Execute VM according to company guidelines, implement window sets\n* Communicate product needs and report on performance. Monitoring, maintaining and recording stock levels in the shop to ensure adequate stock levels in order to drive sales\n* Ensuring the team and store is looking its best at all times", "qualifications": {"required": "Proven experience building, coaching and developing a team, Excellent communication skills, both verbal and written. Internal & external customer service are vital to your success in this role, Experience in high-end retail. Familiarity with the menswear market and luxury goods, The ability to create and drive sales/footfall during quieter periods, Experience in building client bases and client books, Computer skills, the ability to report across excel, word, comfortable with register and back office systems, Natural planning skills, A real attention to detail, Enthusiastic and enjoy your work, A practical multi-tasker, who can focus on the detail whilst never losing sight of the bigger picture, Minimum 3 years of related experience, Ability to move heavy items - may include overhead lifting, pulling, and pushing of items up to 15 lbs-25 lbs., Ability to stand for extended periods of time", "preferred": ""}, "skills": ["Customer service", "Sales", "Retail", "Management", "Team building", "Training", "Communication", "Leadership", "KPI", "Loss prevention", "Visual merchandising", "Stock management", "Excel", "Word", "Planning", "Detail oriented", "Multitasking"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Health insurance for full-time employment, Dental and Vision for full-time employment, Life insurance for full-time employment, 401K after 1 year employment, Beneficial company commission plan, Paid vacation and sick time", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970842824"}