{"jobTitle": "Executive Assistant", "company": {"name": "Haus Labs By Lady Gaga", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Internet Publishing", "description": "Job Title: Executive Assistant<br/><br/>Department: People &amp; Culture<br/><br/>Manager: People &amp; Culture Manager<br/><br/><strong>Who We Are<br/><br/></strong>Launched by Lady Gaga, Haus Labs is a vegan and cruelty-free cosmetics brand with a mission of spreading kindness, bravery, and creativity. Filled with versatile products that encourage self-expression, this collection boasts high-impact eye makeup, lipsticks, highlighters, and more. Regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics, we want everyone to feel welcome. We are committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/><strong>Overview<br/><br/></strong>The C-Suite Executive Assistant will support our 10 C-Suite and lead executives. Day to day EA responsibilities would include managing the C-Suite calendars, booking travel and accommodations, completing expense reports, setting up and breaking down conference rooms for C-Suite meetings, picking up lunch orders, and attending C-suite meetings to take notes (as needed). This person will also liaise between our executive team and Haus of Gaga, as well as book company related travel for HoG team members when needed. . This person will be the first point of contact for visitors of the executive team entering the office and will be responsible for providing quality meeting accommodations to visitors as requested by the executive. This role requires a dependable, proactive person who also exhibits the utmost professionalism, communicates effectively, and knows when/how to exercise discretion. Being solution-oriented and flexible will be crucial for this role. You will be required to work onsite five days a week (Monday – Friday).<br/><br/><strong>What You'll Do<br/><br/></strong>Executive Assistant Responsibilities<br/><br/><ul><li>Manages executives' calendars, scheduling meetings, and sending reminders</li><ul><li>Learn each executive’s scheduling process preferences</li><li>Setting concise agendas for Leads Meetings (critical weekly executive team call)</li><li>Set quarterly IRL executive meeting weeks</li><li>Having foresight on all travel and PTO for the leads and sharing reminders<br/><br/></li></ul></ul><ul><li>Make travel and accommodation arrangements for executives</li><ul><li>Book flights and hotels that fall within company budget guidelines</li><li>Calendar all travel - sharing reminders as needed</li><li>Generate travel itineraries for leads or HoG when requested</li></ul><li>Attend executive meetings as needed and take detailed notes</li><ul><li>Gathering key notes and action items from meetings</li><ul><li>Ensuring follow-up on these items happens</li></ul><li>Sharinging out meeting minutes to appropriate groups</li><li>Maintaining objectivity, professionalism, and confidentiality</li></ul><li>Format information for internal and external communication- memos, e-mails, presentations, and reports as needed</li><ul><li>Ensure brand-standard formats are used in documentation and communication</li><li>Printing and binding presentation decks for meetings</li><li>Upholding kindness and professionalism in all communications</li></ul><li>Order and retrieve lunch and coffee orders for meetings</li><ul><li>Track costs to be sure we remain within budget</li></ul><li>Expensify and budget tracking support for executives</li><ul><li>Verify purchases on reports are coded properly under the correct department</li><li>Set reminders and partner with executives to ensure monthly reports are submitted on time<br/></li></ul></ul><strong>What We Are Looking For<br/><br/></strong><ul><li>Minimum of 4 years of experience in a Executive Assistant and/or Office Management role</li><li>Experience supporting multiple Executives at a time</li><li>Excellent verbal and written communication skills</li><li>Excellent interpersonal and customer service skills</li><li>Excellent organizational skills and attention to detail</li><li>Ability to be adept at multitasking and prioritizing</li><li>Applies judgment with a full understanding of the urgency and priorities of the business</li><li>Proficient with GSuite and Microsoft Office Suite or related software</li><li>Ability to handle confidential materials and issues in a professional manner</li><li>Familiarity with office equipment and applications (e.g. calendars and copy machines)</li><li>Ability to anticipate needs, problem solve, and identify solutions; remains flexible, being timely with follow-ups; uses discretion between conflicting priorities</li><li>Positive go-getter attitude who can thrive in a growing office environment<br/><br/></li></ul><strong>What We Expect<br/><br/></strong><ul><li>At Haus Labs, how you communicate is as important as what you communicate. We are seeking driven team players with strong communication skills and enthusiasm for collaboration</li><li>You’re a self-starter who possesses an entrepreneurial spirit</li><li>You thrive in a fast-paced, agile environment</li><li>You are a team player who approaches solutions from a place of curiosity and positivity</li><li>We are seeking HAUSmates who welcome constructive criticism and have an impeccable attention to detail<br/><br/></li></ul><strong>Our Pillars<br/><br/></strong>ART: We are a creative collective that believes art has the power to shape the future.<br/><br/>SCIENCE: We unlock innovation using science and artistry.<br/><br/>KINDNESS: We are a collective community: universal, inclusive and non-binary.<br/><br/><strong>What We Offer<br/><br/></strong><ul><li>Medical, Dental, &amp; Vision Insurance</li><li>Paid, Equal Parental Leave for Birth, Non-Birth and Adoptive Parents</li><li>Flexible time-off policies</li><li>Cell phone stipend</li><li>401(k)</li><li>Equity</li><li>Life Insurance</li><li>FunHaus Event<br/><br/></li></ul><strong>Everyone is welcome in our HAUS<br/><br/></strong>“Baby, you were born this way.” Regardless of age, education, ethnicity, gender, sexual<br/><br/>orientation, or any personal characteristics, we want everyone to feel welcome. We are<br/><br/>committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/>Powered by JazzHR<br/><br/>ndGVNcA2Wt", "responsibilities": "Executive Assistant Responsibilities<br/><br/><ul><li>Manages executives' calendars, scheduling meetings, and sending reminders</li><ul><li>Learn each executive’s scheduling process preferences</li><li>Setting concise agendas for Leads Meetings (critical weekly executive team call)</li><li>Set quarterly IRL executive meeting weeks</li><li>Having foresight on all travel and PTO for the leads and sharing reminders<br/><br/></li></ul></ul><ul><li>Make travel and accommodation arrangements for executives</li><ul><li>Book flights and hotels that fall within company budget guidelines</li><li>Calendar all travel - sharing reminders as needed</li><li>Generate travel itineraries for leads or HoG when requested</li></ul><li>Attend executive meetings as needed and take detailed notes</li><ul><li>Gathering key notes and action items from meetings</li><ul><li>Ensuring follow-up on these items happens</li></ul><li>Sharinging out meeting minutes to appropriate groups</li><li>Maintaining objectivity, professionalism, and confidentiality</li></ul><li>Format information for internal and external communication- memos, e-mails, presentations, and reports as needed</li><ul><li>Ensure brand-standard formats are used in documentation and communication</li><li>Printing and binding presentation decks for meetings</li><li>Upholding kindness and professionalism in all communications</li></ul><li>Order and retrieve lunch and coffee orders for meetings</li><ul><li>Track costs to be sure we remain within budget</li></ul><li>Expensify and budget tracking support for executives</li><ul><li>Verify purchases on reports are coded properly under the correct department</li><li>Set reminders and partner with executives to ensure monthly reports are submitted on time<br/></li></ul></ul>", "qualifications": {"required": "Minimum of 4 years of experience in a Executive Assistant and/or Office Management role, Experience supporting multiple Executives at a time, Excellent verbal and written communication skills, Excellent interpersonal and customer service skills, Excellent organizational skills and attention to detail, Ability to be adept at multitasking and prioritizing, Applies judgment with a full understanding of the urgency and priorities of the business, Proficient with GSuite and Microsoft Office Suite or related software, Ability to handle confidential materials and issues in a professional manner, Familiarity with office equipment and applications (e.g. calendars and copy machines), Ability to anticipate needs, problem solve, and identify solutions; remains flexible, being timely with follow-ups; uses discretion between conflicting priorities, Positive go-getter attitude who can thrive in a growing office environment"}, "skills": ["Communication", "Customer Service", "Organization", "Multitasking", "Prioritization", "GSuite", "Microsoft Office"], "postedDate": "1 month ago", "benefits": "Medical, Dental, &amp; Vision Insurance, Paid, Equal Parental Leave for Birth, Non-Birth and Adoptive Parents, Flexible time-off policies, Cell phone stipend, 401(k), Equity, Life Insurance, FunHaus Event", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970591122"}