{"jobTitle": "Floor Supervisor Full Time - TOMMY HILFIGER", "company": {"name": "PVH Corp.", "industry": "Retail Apparel and Fashion", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$18.25 - $23.25", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>Design Your Future at PVH<br/><br/></strong>Floor Supervisor Full Time - TOMMY HILFIGER<br/><br/><strong>FLOOR SUPERVISOR<br/><br/></strong><strong>REPORTS TO: </strong>Store Manager<br/><br/><strong>SUMMARY: </strong>The Floor Supervisor’s primary function is to assist and support the Store and Assistant Manager in all aspects of the store, including all personnel, product, merchandising, and visual functions, business processes and results for the store. Assist management with recruiting, training and development of associates.<br/><br/><strong>Overall Responsibilities<br/><br/></strong><ul><li>Direct and motivates the store team to provide service in accordance with the TH Customer Service program, generate sales and profit, minimize losses and while ensure the store is visually distinctive and impeccably maintained.</li><li>Maximize Associate productivity, ensure compliance and consistent execution of company standards and Policy &amp; Procedures as well as create an environment which is results driven.</li><li>Assist in the development of associates through feedback, coaching and training.</li><li>Demonstrate effective written and verbal communication skills.</li><li>Develop proficiency in all operational policies and procedures.</li><li>Manage time and prioritize tasks.<br/><br/></li></ul><strong>Managerial Responsibilities<br/><br/></strong><ul><li>Maximize sales by ensuring TH Customer Service program is being executed to standard as well as ensuring merchandise styles and sizes are well represented on the sales floor.</li><li>Assist with training, developing and executing S.G.M. and TH Customer Service.</li><li>Communicate statistical results and identify business needs.</li><li>Communicate with team at Take 5 meetings, regarding individual sales performance, and other key performance indicators such as UPT, conversion, store results, product sales and other information to help them provide great service and achieve goals.</li><li>Assist with training, monitoring and executing Direct Replenishment and Recovery process.</li><li>Recognize problems, analyze causes, and generate alternatives and solutions.</li><li>Represent the TH image through personal and professional appearance.<br/><br/></li></ul><strong>Operational Responsibilities<br/><br/></strong><ul><li>Understand and comply with all company policy, procedures and operations.</li><li>Receiving and processing shipments and transfers.</li><li>Follow Inventory Shrinkage Improvement Program.</li><li>Assist to ensure store has all necessary tools (i.e. supplies, resources, binders, posters, etc.) and knowledge of how to use them adequately.</li><li>Maintain the highest level of security and safety awareness within the store</li><li>Store opening and closing.</li><li>Able to lift a minimum of 40 pounds and able to stand for long periods of time.<br/><br/></li></ul><strong>Leadership Responsibilities<br/><br/></strong><ul><li>Work with store management to source the best talent through networking and recruitment, interviewing, hiring and orientation process. Identify new hires who possess skills representative of the TH Brand and image.</li><li>Assist in the development of all associates to be knowledgeable in areas of product and sales by communicating openly, honestly, and constructively.</li><li>Create energy, excitement and recognition around team and individual accomplishment and successes.</li><li>Participate and assists the Store Manager in weekly management meetings and quarterly staff meetings.</li><li>Change schedules, adapt to the needs of the position, undertaking night shifts, weekends and holidays.</li><li>Demonstrate teamwork and lead by example within store.<br/><br/></li></ul><strong>Merchandising &amp; Visual Responsibilities<br/><br/></strong><ul><li>Assists in making business decisions based on current sell-through strategies.</li><li>Maintains elevated store presentation by training and overseeing standards as defined by brand standards and company directives with an eye for detail.</li><li>Keep management informed of all merchandise and visual related issues.</li><li>Execute markdowns and re-merchandise, as needed.</li><li>Maintain store organization fixtures/hardware/general cleanliness.<br/><br/></li></ul>Pay Range:$18.25 - $23.25<br/><br/>PVH currently provides base salary ranges for all positions-on job advertisements-in the United States based on local requirements. These ranges are based on what PVH reasonably believes that it will pay an associate for their base salary for said position at the time of the posting. Individual compensation will ultimately be determined based on a variety of relevant factors including but-not limited to qualifications, geographic location and other relevant skills. PVH is committed to providing a market-competitive total rewards package to eligible associates, which includes diverse and robust health and insurance benefits to meet the varied needs of our associates and an above-market 401(k) contribution to help our associates save for retirement. We also offer career growth opportunities, empowering our associates to design their future at PVH.<br/><br/>PVH Corp. or its subsidiary (“PVH”) is an equal opportunity employer and considers all applicants for employment on the basis of their individual capabilities and qualifications, consistent with applicable law and without regard to race, color, sex, gender identity or expression, age, religion, creed, national origin, citizenship status, sexual orientation, genetic information, physical or mental disability, military status or any other characteristic protected under federal, state or local law. In addition to complying with all applicable laws, PVH also has a strong corporate commitment to inclusion, diversity and to ensuring that all current and future PVH associates are compensated solely on job-related factors such as skill, ability, educational background, work quality, experience and potential. To achieve these goals, across the United States and its territories, PVH prohibits any PVH employee, agent or representative from requesting or otherwise considering any job applicant’s current or prior wages, salary or other compensation information in connection with the hiring process. Accordingly, applicants are asked not to disclose this salary history information to PVH", "responsibilities": "The Floor Supervisor’s primary function is to assist and support the Store and Assistant Manager in all aspects of the store, including all personnel, product, merchandising, and visual functions, business processes and results for the store. Assist management with recruiting, training and development of associates.", "qualifications": {"required": "Demonstrate effective written and verbal communication skills. Develop proficiency in all operational policies and procedures. Manage time and prioritize tasks."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "PVH is committed to providing a market-competitive total rewards package to eligible associates, which includes diverse and robust health and insurance benefits to meet the varied needs of our associates and an above-market 401(k) contribution to help our associates save for retirement. We also offer career growth opportunities, empowering our associates to design their future at PVH.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970544964"}