{"jobTitle": "Director of Sales Operations", "company": {"name": "Keurig Dr Pepper Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$146,700.00/yr - $210,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Food and Beverage Services", "description": "<strong>Job Overview<br/><br/></strong>A successful candidate is results-oriented, strategic thinker, able to develop and deliver their agenda. This leader must have a diverse background in Operations, Warehouse Management, Logistics and Supply Chain and have excellent relationship management skills with a proven track record of results in Operational Excellence. Broad understanding of the various Direct-Store-Delivery routes to market and/or a B2C environment is critical to support the development of the KDP portfolio of brands with a laser-like focus on growth of our brands, business, and our people.<br/><br/>The Regional Operations Leader drives strategic analysis, execution, and organizational development to achieve financial and non-financial goals in addition to creating a lean mindset throughout the assigned region to improve safety, productivity and performance through standardization and process discipline. This leader must excel in strategic planning and execution on a regional level while achieving Business Unit goals as well as broader KDP priorities. This individual sets direction for the team and creates proactive solutions to achieve these goals. This role will lead the creation and delivery of the business unit's long-term agenda and short-term activity plan while minimizing costs through an effective operating strategy.<br/><br/>This individual consistently demonstrates KDP values and competencies, builds a high-trust and high-performing culture. Critical also to the success of this role is the partnership they must create with the broader organization. This role will work closely and cross-functionally with the Sales leadership team. The ability to influence senior leaders and cross-functional partners, such as Sales, Sales Effectiveness, Supply Chain, National Sales Teams, Finance, Marketing, and HR, is critical as this role will be driving both strategic and executional direction for the Region and Business Unit while being mindful of KDP wide enterprise priorities and goals.<br/><br/><strong>Territory:<br/><br/></strong><ul><li>Vernon, CA (Base Location)<br/><br/><br/></li></ul><strong>Accountabilities:<br/><br/></strong><strong>Lead, coach and develop a team to deliver top-notch execution and achieve operational excellence<br/><br/></strong><ul><li>Lead teams in annual planning process in partnership and alignment with national Direct Store Delivery Sales and Operations leadership team, including development of SMART objectives, strategies, and sales plans. </li><li>Drive decision-making that will lead to enhancements and process improvements</li><li>Leverage consumer insights to develop programs that will increase conversion at the point of purchase and measure the effectiveness of account-specific programs.</li><li>Build a high-performing team and build bench strength for future leadership roles - ability to identify top talent, provide ongoing coaching/feedback, manage dynamic change, identify training needs to enhance skill sets, and conduct career path discussions and progression planning. </li><li>Identify and reinforce positive leadership behaviors to drive change and raise the bar on performance<br/><br/><br/></li></ul><strong>Grow Employee Engagement &amp; Inclusion<br/><br/></strong><ul><li>Work with location leadership teams to ensure proactive, consistent approach to driving engagement and inclusion to </li><li>Strategically partner with leadership team and recruiting to ensure the workforce represents our local communities</li><li>Encourage and support employees to engage in Employee Resource Groups<br/><br/><br/></li></ul><strong>Set the strategic direction and vision for the regional operational excellence<br/><br/></strong><ul><li>Identify and drive cross-functional alignment between sales, operations, and supply chain</li><li>Provide leadership and management of AOP development and the planning process.</li><li>Partner with Network Optimization teams to ensure operational effectiveness for both warehouse operations and distribution routes. </li><li>Support all new business and acquisition efforts</li><li>Drive reduction in waste by ensuring assigned region meets or exceeds break/shrink/obsolescence goals on a cost per case basis.</li><li>Ensure labor costs in the warehouse and delivery operations of assigned region meet or beat plan on a cost per case basis by driving home Warehouse University principles, including the deployment of the Warehouse Self-Assessment tool.<br/><br/><br/></li></ul><strong>Collaboration/Alignment with Key Stakeholders<br/><br/></strong><ul><li>Work in close partnership with region sales leader to design and execute on strategic plans, customer service and delivery optimization</li><li>Partner and effectively build relationships with Sales and Marketing leadership including Fountain Foodservice Sales, Warehouse Direct, Packaged Beverages Immediate Consumption, Cola/ISO Systems, Managed Services, Convenience, Brand Marketing, Category Management, Market Research and Finance. </li><li>Work closely with cross functional partners to identify potential business risks </li><li>Identify and drive cross-functional alignment behind priority channels and customers, including supply chain and demand planning<br/><br/><br/></li></ul><strong>Continuous improvement, operational efficiencies, and effectiveness<br/><br/></strong><ul><li>Lead the Operations teams to ensure consistency of constant continuous improvement culture</li><li>Partner with Network Optimization teams to delivery continuous improvements</li><li>Lead and coach leaders and the frontline to increase productivity and efficiencies in day-to-day operations</li><li>Drive increase in First Pass Yield (FPY) and On Time and Accurate (OTA) score by addressing routing and delivery issues as well as ensuring pick accuracy exceeds 99.8% through full execution of Voice Pick standards and compliance to daily checklist and reduction of haulbacks<br/><br/><br/></li></ul><strong>Keep our employees safe and healthy<br/><br/></strong><ul><li>Lead DOT compliance efforts for delivery organization</li><li>Partner with Employee Health &amp; Safety teams to drive a culture focused on safety first both in our locations and when employees in the trade and on the road</li><li>Drive accident and injury reduction and vehicle accident reduction targets in assigned region.</li><li>Provide case management and follow up on all SAFE system cases and ensure that proper accident investigations, classifications, follow-ups and Root Cause Counter Measures are determined.</li><li>Lead and ensure regulatory compliance by conducting OSHA style audits and ensuring closure of any regulatory gaps to achieve 100% regulatory compliance.<br/><br/><br/></li></ul>The ideal candidate will possess a proven track record of improving safety results, successful continuous improvement initiatives and superior cost and management results. This candidate will have strong leadership and communication skills; excellent verbal and written skills along with experience presenting to regional leadership teams, local leadership teams, and front-line employees. Possess a background in the management of Warehouse, Inventory and Delivery. They will have knowledge of Department of Transportation (DOT), Federal, State and Environmental Health &amp; Safety (EHS) compliance. The candidate will have experience working with MHE, (material handling equipment) understand warehouse capacity requirements, building, loading, and delivery principals, FIFO and logistics principals.<br/><br/><strong>Total Rewards<br/><br/></strong><ul><li>Salary Range: $146,700 -$210,000</li><li>Actual placement within the compensation range may vary depending on experience, skills, and other factors </li><li>Benefits, subject to election and eligibility: Medical, Dental, Vision, Disability, Paid Time Off (including paid parental leave, vacation, and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement</li><li>Annual bonus based on performance and eligibility<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelors Degree preferred</li><li>10+ years of leadership experience in positions of increasing responsibility</li><li>Successful experience in working in Warehouse, Distribution, Supply Chain and/or Delivery Operations</li><li>Consumer Packaged Goods (CPG), B2C, Retail and Distribution experience a plus</li><li>Strong understanding of Department of Transportation (DOT), Federal, State and Environmental Health &amp; Safety (EHS) and OSHA compliance</li><li>Experience with a frontline workforce in both union and non-union environments </li><li>Data Analytics &amp; Strategic Insights</li><ul><li>Leverages data, has a deep understanding of the customer/consumer and good judgment to develop a clear and coherent data driven strategy and insights</li><li>Leverage relevant external insights (industry, competitors, category, brand, channel, consumer, and account) to develop a strategic agenda that drives focus and results behind the KDP portfolio strategy</li></ul><li>Project Management - executing a project from start to finish ability to communicate long-term vision and shorter-term opportunities through clear &amp; simple messages</li><li>Judgment - Ability to proactively identify business opportunities and deliver innovative solutions to address business needs. Strong analytical rigor that drives results-orientation </li><li>Influence - ability to leverage internal and external relationships to drive strategic agenda, alignment, and capabilities development for team.<br/><br/><br/></li></ul><strong>Company Overview<br/><br/></strong>Keurig Dr Pepper (NASDAQ: KDP) is a modern beverage company with a bold vision built to deliver growth and opportunity. We operate with a differentiated business model and world-class brand portfolio, powered by a talented and engaged team that is anchored in our values. We work with big, exciting beverage brands and the #1 single-serve coffee brewing system in North America at KDP, and we have fun doing it!<br/><br/>Together, we have built a leading beverage company in North America offering hot and cold beverages together at scale. Whatever your area of expertise, at KDP you can be a part of a team that’s proud of its brands, partnerships, innovation, and growth. Will you join us?<br/><br/>We strive to be an employer of choice, providing a culture and opportunities that empower our team of ~28,000 employees to grow and develop. We offer robust benefits to support your health and wellness as well as your personal and financial well-being. We also provide employee programs designed to enhance your professional growth and development, while ensuring you feel valued, inspired and appreciated at work.<br/><br/>Keurig Dr Pepper is an equal opportunity employer and affirmatively seeks diversity in its workforce. Keurig Dr Pepper recruits qualified applicants and advances in employment its employees without regard to race, color, religion, gender, sexual orientation, gender identity, gender expression, age, disability or association with a person with a disability, medical condition, genetic information, ethnic or national origin, marital status, veteran status, or any other status protected by law.", "responsibilities": "A successful candidate is results-oriented, strategic thinker, able to develop and deliver their agenda. This leader must have a diverse background in Operations, Warehouse Management, Logistics and Supply Chain and have excellent relationship management skills with a proven track record of results in Operational Excellence. Broad understanding of the various Direct-Store-Delivery routes to market and/or a B2C environment is critical to support the development of the KDP portfolio of brands with a laser-like focus on growth of our brands, business, and our people.<br/><br/>The Regional Operations Leader drives strategic analysis, execution, and organizational development to achieve financial and non-financial goals in addition to creating a lean mindset throughout the assigned region to improve safety, productivity and performance through standardization and process discipline. This leader must excel in strategic planning and execution on a regional level while achieving Business Unit goals as well as broader KDP priorities. This individual sets direction for the team and creates proactive solutions to achieve these goals. This role will lead the creation and delivery of the business unit's long-term agenda and short-term activity plan while minimizing costs through an effective operating strategy.<br/><br/>This individual consistently demonstrates KDP values and competencies, builds a high-trust and high-performing culture. Critical also to the success of this role is the partnership they must create with the broader organization. This role will work closely and cross-functionally with the Sales leadership team. The ability to influence senior leaders and cross-functional partners, such as Sales, Sales Effectiveness, Supply Chain, National Sales Teams, Finance, Marketing, and HR, is critical as this role will be driving both strategic and executional direction for the Region and Business Unit while being mindful of KDP wide enterprise priorities and goals.", "qualifications": {"required": "The ideal candidate will possess a proven track record of improving safety results, successful continuous improvement initiatives and superior cost and management results. This candidate will have strong leadership and communication skills; excellent verbal and written skills along with experience presenting to regional leadership teams, local leadership teams, and front-line employees. Possess a background in the management of Warehouse, Inventory and Delivery. They will have knowledge of Department of Transportation (DOT), Federal, State and Environmental Health &amp; Safety (EHS) compliance. The candidate will have experience working with MHE, (material handling equipment) understand warehouse capacity requirements, building, loading, and delivery principals, FIFO and logistics principals.", "preferred": "Bachelors Degree preferred"}, "skills": ["Operations", "Warehouse Management", "Logistics", "Supply Chain", "Relationship Management", "Operational Excellence", "Direct-Store-Delivery", "B2C", "Strategic Analysis", "Execution", "Organizational Development", "Strategic Planning", "Leadership", "Communication", "Data Analytics", "Strategic Insights", "Project Management", "Judgment", "Influence", "Consumer Packaged Goods", "Retail", "Distribution", "Department of Transportation", "Federal", "State", "Environmental Health &amp; Safety", "OSHA", "MHE", "FIFO", "Logistics"], "postedDate": "1 month ago", "benefits": "Benefits, subject to election and eligibility: Medical, Dental, Vision, Disability, Paid Time Off (including paid parental leave, vacation, and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970519652"}