{"jobTitle": "Sales Professional", "company": {"name": "Toyota Of Glendale", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Motor Vehicles", "description": "If you are an enthusiastic self-starter with a passion for customer service, product knowledge, selling and you enjoy working with people, then we want you to be part of our team as a Sales Professional for our Toyota of Glendale store. The Sales Professional is extremely knowledgeable about our vehicles and services, the industry, and our market, including vehicle selection, performance, accessories, efficiencies, safety features and functions, and financing options for both new and used vehicle inventories. He or she presents new and pre-owned vehicles to customers in an attractive and highly informative fashion that promotes a prompt sale and maintains an ongoing relationship with customers to encourage networking and repeat business.<br/><br/>The ideal candidate has a high school diploma or GED, previous sales experience (in any industry), excellent customer service skills, a confident and outgoing personality, a professional appearance, and great communication skills. He or she must be self-motivated with a willingness to continuously prospect to sell a minimum quota (or more!) on an ongoing basis.<br/><br/>In addition to competitive pay, we offer our employees Health, Dental, Vision, Life, 401K, Health &amp;Wellness Program, community involvement and company paid vacation and holidays.<br/><br/><strong>Demonstrates automobiles by explaining characteristics, capabilities, and features; taking test drives; comparing and contrasting competitive models; and explaining warranties and services.</strong><ul><li>Helps customer with vehicle selection and promotes model options and features, value-add products and services, and purchase and finance options following dealership policies.</li><li>Conducts vehicle test drives and ensures all speed limits all other rules of the road are followed</li><li>Continuously learns about product updates, features, accessories, and inventory and their benefits to the customer.</li><li>Helps facilitate delivery by providing a clear explanation of vehicle and features operation, warranty, and servicing requirements.</li><li>Learns to overcome objections, ask for the sale, negotiate price, complete sales or purchase agreement, and explain and offer warranties service and finance.</li><li>Maintains accurate sales documentation.</li><li>Maintains high CSI (Customer Satisfaction Index) a MUST!!</li><li>Maintains an owner follow up system that encourages repeat and referral business and contributes to customer satisfaction.</li><li>Maintains up-to-date knowledge of all vehicles, accessories, financing options, and promotions.</li><li>Negotiates sale closure in a clear, concise, and highly ethical fashion.</li><li>Prospects daily for potential customers and maintains consistent rapport with previously sold customers.</li><li>Provides sales management information by completing required reports.</li><li>Attends sales meetings and training sessions as required.</li><li>Demonstrate behaviors consistent with the Company's Values in all interactions with customers, co-workers and vendors.</li><li>Follow all company policies and procedures.</li><li>Attend sales meetings and training sessions as required.</li><li>Realize that business is built on customer satisfaction and be devoted to guaranteeing satisfaction to our customers.</li><li>Establish personal goals that are consistent with the dealerships standards of productivity, and devise a strategy to meet those goals.<br/><br/><br/></li></ul><strong>Qualifications</strong><ul><li>1 + years' experience automotive sales experience preferred but willing to train.</li><li>Previous sales or customer service experience (any industry) a plus.</li><li>Able to achieve goals with limited direct supervision.</li><li>Able to multi-task.</li><li>Excellent communication, customer service, and problem solving skills, including the ability to maintain composure under stress.</li><li>Excellent telephone and customer service skills, including the ability to smile.</li><li>Must be able to develop relationships with vendors.</li><li>Must be able to work well in a process driven environment.</li><li>Must conduct oneself in a professional manner at all times.</li><li>Must have confidence in your ability to be successful.</li><li>Must strive to respect and facilitate teamwork within all departments.</li><li>Professional appearance and work ethic.</li><li>Self-starter and self-motivator.</li><li>Bilingual a PLUS!</li><li>Toyota experience a PLUS!</li></ul>", "responsibilities": "Demonstrates automobiles by explaining characteristics, capabilities, and features; taking test drives; comparing and contrasting competitive models; and explaining warranties and services.<ul><li>Helps customer with vehicle selection and promotes model options and features, value-add products and services, and purchase and finance options following dealership policies.</li><li>Conducts vehicle test drives and ensures all speed limits all other rules of the road are followed</li><li>Continuously learns about product updates, features, accessories, and inventory and their benefits to the customer.</li><li>Helps facilitate delivery by providing a clear explanation of vehicle and features operation, warranty, and servicing requirements.</li><li>Learns to overcome objections, ask for the sale, negotiate price, complete sales or purchase agreement, and explain and offer warranties service and finance.</li><li>Maintains accurate sales documentation.</li><li>Maintains high CSI (Customer Satisfaction Index) a MUST!!</li><li>Maintains an owner follow up system that encourages repeat and referral business and contributes to customer satisfaction.</li><li>Maintains up-to-date knowledge of all vehicles, accessories, financing options, and promotions.</li><li>Negotiates sale closure in a clear, concise, and highly ethical fashion.</li><li>Prospects daily for potential customers and maintains consistent rapport with previously sold customers.</li><li>Provides sales management information by completing required reports.</li><li>Attends sales meetings and training sessions as required.</li><li>Demonstrate behaviors consistent with the Company's Values in all interactions with customers, co-workers and vendors.</li><li>Follow all company policies and procedures.</li><li>Attend sales meetings and training sessions as required.</li><li>Realize that business is built on customer satisfaction and be devoted to guaranteeing satisfaction to our customers.</li><li>Establish personal goals that are consistent with the dealerships standards of productivity, and devise a strategy to meet those goals.<br/><br/><br/></li></ul>", "qualifications": {"required": "1 + years' experience automotive sales experience preferred but willing to train.", "preferred": "Previous sales or customer service experience (any industry) a plus., Able to achieve goals with limited direct supervision., Able to multi-task., Excellent communication, customer service, and problem solving skills, including the ability to maintain composure under stress., Excellent telephone and customer service skills, including the ability to smile., Must be able to develop relationships with vendors., Must be able to work well in a process driven environment., Must conduct oneself in a professional manner at all times., Must have confidence in your ability to be successful., Must strive to respect and facilitate teamwork within all departments., Professional appearance and work ethic., Self-starter and self-motivator., Bilingual a PLUS!, Toyota experience a PLUS!"}, "skills": [], "postedDate": "1 month ago", "benefits": "In addition to competitive pay, we offer our employees Health, Dental, Vision, Life, 401K, Health &amp;Wellness Program, community involvement and company paid vacation and holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970942252"}