{"jobTitle": "Domain & Consulting Head - Utilities (Hybrid)", "company": {"name": "Wipro", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Consulting, Information Technology, and Sales", "industry": "IT Services and IT Consulting", "description": "Why work at Wipro?<br/><br/>We pride ourselves on creating an inclusive workplace that provides equal opportunities to all persons regardless of their age, cultural background, sexual orientation, gender identity and expression, disability, veteran status, or anything else. If you only meet some of the requirements for this role, that's okay! We value a diverse range of backgrounds & ideas and believe this is fundamental for our future success. So, if you have the curiosity to learn and the willingness to teach what you know, we'd love to hear from you.<br/><br/>Wipro is globally recognized for our commitment to sustainability, inclusion, and diversity. Social good is in our DNA, we believe in sustainability for the health of our planet, its inhabitants, and our business. For over 75 years we have operated as a purpose-driven company with an unwavering commitment to our customers and our communities. Energized by what we call the Spirit of Wipro, we commit ourselves to being a catalyst for change - working to build a more just, equitable and sustainable society. Around 66% of Wipro’s economic ownership is pledged towards philanthropic purposes.<br/><br/>Overview & Responsibilities<br/><br/>Wipro empowers companies to transform their business and deliver superior experiences for their customers, partners and employees. Our Domain and Consulting (D&C) team is at the heart of this. With an entrepreneurial mindset and a sense of fun, we thoughtfully evaluate clients’ problems; craft innovative solutions that leverage cutting-edge technologies; and work side-by-side with clients to drive business outcomes. Wipro D&C is a proactive force of change, a true partner in our clients’ transformation, and a uniquely powerful group that combines strategic counsel with technical excellence. Our people are the tip-of-the-spear driving change, come join us!<br/><br/>The opportunity is with Domain & Consultings Utilities consulting practice. This is a regional position that will lead the Utilities consulting business to build on existing capabilities to deliver significant regional à global growth and scale. The primary expectation is to grow the practices portfolio of services, strategic accounts and C-level relationship whilst leveraging our wider Wipro services. Additionally you will be a key partner in driving the business strategy of the Utilities business, with other leaders across the practices globally.<br/><br/>Core responsibilities will include:<br/><br/><li>Grow and deliver:</li><ul><li>Defining a sound business growth strategy. Focus on growing the consulting business contribution to 15%+ of Utilities strength . </li><li>Ensure the consulting business opens new business opportunities and expands Wipro’s client positioning. </li><li>Big picture orientation, conceiving effective strategies to drive growth for the vertical</li><li>Delivery and program expertise with experience in handling multi shore consulting projects with distributed teams</li><li>Ability to drive & lead the strategic execution, manage change, build relationships with clients, partners, motivate teams & achieve results</li></ul><li>Transform and innovate</li><ul><li>Significant transformation proposition definition and engagement shaping using core and disruptive business strategies and technologies to solve business problems with clear business benefits</li><li>Proven track record in growing as well as sustaining and growing client account revenues through existing and new consulting engagements</li><li>Deep understanding of innovative customer models, products, services and business re-platforming strategies</li></ul><li>Practice Leadership</li><ul><li>Manage a diverse team of geographically distributed consulting professionals across different experience levels, including their goals & objectives, mentoring, career planning etc. </li><li>Defining & supporting a strong competency/capability-building strategy </li></ul><li>Thought Leadership</li><ul><li>Ability to converse with industry leaders, analysts and formulate POV on trends and proactively propose solutions, investment decisions along with published artifacts, industry speakerships, analyst interactions etc. </li><li>Creating a strong Wipro Market Positioning - increasing Wipro’s mindshare in the Utilities industries ecosystem (product companies, analysts and influencers)</li></ul><li>Solutions: </li><ul><li>Identifying & defining differentiated services and solutions for various process areas within the Utilities sector</li></ul><li>Partnerships:</li><ul><li>Nurture key ecosystem partnerships in key focus areas based on product evaluation/due diligence with the objective of building knowledge and networks. </li><li>12 + years experience leading, growing and delivering in a global, fast growing consulting business in Utilities domains. </li><li>Deep expertise in Transmission & Distribution including; Grid Operations, IT- OT integration and Grid modernization you will work as a thought leader shaping the opportunities across existing clients as well as new prospects to help them transform their business processes. </li><li>Significant demonstrable experience solving business problems through transformation shaping using core and disruptive technologies including: Smart metering, AMI 2.0, Grid Operations - EMS. SCADA, ADMS, DMS, OMS, Field Area Network solutions, IT-OT Integration Deep functional experience with Itron / LNG systems. </li><li>Good understanding of the regulations and know-how of US Utilities. </li><li>Entrepreneurial drive with a can-do attitude, a strong desire to learn and shape one’s own career path. Ownership in Solution incubation and IP-creation</li><li>Good knowledge of the international market and demand including multiple engagements across geographies. </li><li>Experience in consultative selling and creating client business case for value-based pitches. </li><li>Outstanding leadership, communication, relationship building and networking skills across clients, partners and your internal organisation. </li><li>Ability to develop and build a public profile with the media and press in addition to speaking at external seminars. Creative and motivating consulting leader that can gel diverse teams to common outcomes. </li><li>Gravitas to engage and grow relationships with senior business and clients. </li><li>Exemplary professional and corporate image. </li><li>Highly adaptable in dynamic environments. </li><li>Integrates effectively into a global matrix environment.</li></ul>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3970470647"}