{"jobTitle": "Executive Assistant to CFO - Onsite", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "35.25/hr - 54.64/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "<strong>Job Description<br/><br/></strong><strong>Grow your career at Cedars-Sinai!<br/><br/></strong>Are you passionate about providing outstanding administrative support to Executives? We embrace a culture of passion and dedication at Cedars Sinai, and it’s part of the reason we’ve been named one of the top ten hospitals in America’s Best Hospitals by U.S. News &amp; World Report. Now we invite you to join us! From working with a team of outstanding healthcare professionals to using state-of-the-art facilities, you’ll have everything you need to do something incredible—for yourself, and for others.<br/><br/><strong>Why work here?<br/><br/></strong>Beyond outstanding benefits and competitive salaries, we take pride in hiring the best and most hardworking employees. Our talented members reflect the culturally and ethnically diverse community we serve. They are proof of our commitment to creating an inclusive environment that fuels innovation and the gold standard of patient care we strive for.<br/><br/><strong>What will you be doing in this role:<br/><br/></strong>The Executive Assistant (EA) will be responsible for performing a wide range of complex and confidential administrative duties supporting the Chief Financial Officer (CFO). Demonstrates initiative, resourcefulness, and problem-solving skills in applying a detailed knowledge of the responsibilities, functions, and underlying management structure of the department and of the larger Health System in organizing and prioritizing work, establishing procedures and systems and ensuring the orderly and timely flow of business through the office. Maintains supervisor's calendar, screen’s calls, schedules meetings, takes minutes at meetings, schedules travel reservations, types correspondence and reports; and performs related duties as required. Coordinates/ administers human resource, payroll functions and participates in maintaining departmental budgetary considerations.<br/><br/><ul><li>Responsible for balancing multiple, concurrent, high-level projects, priorities and tasks in a fast-paced, complex environment and accommodating unstructured situations and changing priorities. </li><li>Collaborates with department leadership to develop accountability systems; develops policies and procedures; monitors efficiency and effectiveness of various CFO initiatives; fosters continuous improvement of systems and processes.</li><li>Responsible for BOD Committee preparation including creating agenda, assisting with presentations, on-site technology lead, and BOD member engagement.</li><li>Organizes and delivers on special projects for the CFO, establishes and enables team success by organizing teams, conducting research of issues, coordinating with internal and external resources. Prioritizes workflow to ensure timely delivery. Ensure adequate follow up, completion, and communication. Ensures all changes are maintained by establishing follow up testing.</li><li>Partner with internal and external stakeholders to ensure initiative success for material preparation, delivery, and evaluation. Ensures follow up is accomplished.</li><li>Coordinates delivery of projects throughout Finance, Revenue Cycle, Cedars Sinai International, CS Intellectual Properties, Risk Management, Compliance, and Managed Care.</li><li>Responsible for Finance organization communications, employee notifications, etc.</li><li>Maintains essential relations with external partners including Board of Director (BOD) level relationships for ensuring attendance at finance related BOD meetings (Finance Committee, Investment Committee, Corporate Integrity Committee), ratings agencies, financial institutions, business partners, investment and venture funds, professional organizations, and our own spin off companies.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Experience Requirements:<br/><br/></strong>Three (3) plus years of previous planning, finance, and/or business development experience in a healthcare organization or consulting organization providing services to the healthcare industry.<br/><br/><strong>Educational Requirements:<br/><br/></strong>Bachelor’s degree in Finance, Administrative, Business Development, or related field.<br/><br/>#Jobs-Indeed<br/><br/><strong>Req ID</strong> : 3690<br/><br/><strong>Working Title</strong> : Executive Assistant to CFO - Onsite<br/><br/><strong>Department</strong> : SVP for Finance<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Administrative<br/><br/><strong>Job Specialty</strong> : Administrative<br/><br/><strong>Overtime Status</strong> : NONEXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $35.25 - $54.64<br/><br/>", "responsibilities": "The Executive Assistant (EA) will be responsible for performing a wide range of complex and confidential administrative duties supporting the Chief Financial Officer (CFO). Demonstrates initiative, resourcefulness, and problem-solving skills in applying a detailed knowledge of the responsibilities, functions, and underlying management structure of the department and of the larger Health System in organizing and prioritizing work, establishing procedures and systems and ensuring the orderly and timely flow of business through the office. Maintains supervisor's calendar, screen’s calls, schedules meetings, takes minutes at meetings, schedules travel reservations, types correspondence and reports; and performs related duties as required. Coordinates/ administers human resource, payroll functions and participates in maintaining departmental budgetary considerations.", "qualifications": {"required": "Three (3) plus years of previous planning, finance, and/or business development experience in a healthcare organization or consulting organization providing services to the healthcare industry.", "preferred": "Bachelor’s degree in Finance, Administrative, Business Development, or related field."}, "skills": [], "postedDate": "8 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3970874222"}