{"jobTitle": "Business Valuation Analyst", "company": {"name": "Augment Jobs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Finance and Sales", "industry": "Financial Services", "description": "As a Business Valuation Analyst, you will play a crucial role in conducting valuations of businesses across various industries. You will work closely with senior team members to analyze financial data, perform industry research, and apply valuation methodologies to determine the value of businesses and intangible assets. Your insights and analyses will be used to support client transactions, financial reporting, tax planning, and strategic decision-making.<br/><br/>Roles And Responsibilities<br/><br/><ul><li>Conduct detailed financial statement analysis and cash flow modeling to assess the financial health and performance of businesses.</li><li>Perform in-depth industry and market research to understand the competitive landscape and economic conditions impacting businesses.</li><li>Utilize valuation techniques such as discounted cash flow (DCF), comparable company analysis, precedent transactions, and option pricing models to estimate the value of businesses and assets.</li><li>Prepare comprehensive valuation reports and presentations summarizing methodologies, assumptions, and findings for clients and stakeholders.</li><li>Collaborate with cross-functional teams including legal, finance, and operations to gather necessary information and insights for valuations.</li><li>Stay updated on industry standards, regulations, and best practices related to business valuation.</li><li>Assist in developing financial models and tools to streamline valuation processes and enhance accuracy.</li><li>Support senior team members in client meetings, presentations, and discussions regarding valuation methodologies and findings.<br/><br/></li></ul>Skills Required<br/><br/><ul><li>Bachelor’s degree in Finance, Accounting, Economics, or a related field. Master’s degree or professional certification (CFA, ASA, ABV) preferred.</li><li>Strong analytical skills with proficiency in financial modeling and valuation techniques.</li><li>Solid understanding of accounting principles, financial statements, and financial analysis.</li><li>Excellent research skills with the ability to gather, analyze, and synthesize complex data.</li><li>Proficiency in using financial databases and software (e.g., Bloomberg, Capital IQ, Excel, VBA).</li><li>Effective communication skills with the ability to present complex information clearly and concisely.</li><li>Detail-oriented mindset with a commitment to accuracy and quality in work.</li><li>Ability to work both independently and collaboratively in a fast-paced, deadline-driven environment.<br/><br/></li></ul>Compensation: The compensation package for this position includes a competitive salary commensurate with experience, performance-based bonuses, comprehensive benefits (healthcare, retirement, etc.), and opportunities for professional development and career advancement within our organization.", "postedDate": "1 month ago", "skills": ["Financial Modeling", "Valuation", "Financial Analysis", "Research", "Bloomberg", "Capital IQ", "Excel", "VBA", "Communication"], "url": "https://www.linkedin.com/jobs/view/3970161052"}