{"jobTitle": "Director of Sales (Western US)", "company": {"name": "Brunel", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales", "industry": "Food and Beverage Services and Food and Beverage Manufacturing", "description": "<strong>Director of Sales (Western US)</strong><p><strong>Compton, CA</strong></p><p><br/></p><p><strong><span class=\"ql-cursor\"> </span>Description</strong></p><p>On behalf of our client, Brunel is searching for a Director of Sales (Western US), this role is for a global protein company, selling g premium imported products. Reporting directly to the CEO, the Director of Sales assumes a crucial role in overseeing the sales, sales promotion, market development, and customer service activities of our client. This position holds responsibility for providing strong leadership, formulating and executing sales strategies, as well as monitoring, analyzing, and attaining sales targets in alignment with the agreed plan. The primary objective is to achieve and optimize short and long-term profitability, volume, and market share goals for the Company's diverse product lines, with particular emphasis on case-ready and value-added offerings.</p><p><br/></p><p>The Director of Sales plays a vital role in safeguarding the interests of shareholders, ensuring that their expectations regarding value and returns are met. Additionally, this role actively contributes to maintaining a reliable supply of The Lamb Company's products to all customers within the region. To achieve these objectives, effective collaboration and coordination with various departments are imperative. This includes close alignment with Procurement, Inventory Control, Logistics, Production, Quality Assurance, and Finance functions to enhance overall operational efficiency and drive success.</p><p><br/></p><p><strong>Responsibilities</strong></p><ol><li><strong>Sales Strategy:</strong> Collaborate with the CEO, sales team, and Marketing &amp; Social Media Manager to research and develop annual and long-term strategies that capitalize on opportunities to better serve existing customers and fulfill new customer needs in the region.</li><li><strong>Sales, Marketing &amp; Procurement Plans: </strong>Partner with the CEO and Marketing &amp; Social Media Manager to develop annual sales plans and long-term marketing plans. Lead the preparation of comprehensive sales operational plans, including sales business plans and budgets, ensuring alignment with organizational objectives and adherence to statutory requirements. Coordinate the creation and delivery of promotional and sales communication materials for the region, respecting local language and messaging requirements.</li><li><strong>Leadership: </strong>Lead and manage a highly effective sales team focused on meeting or exceeding individual and organizational performance targets. Ensure the sales organization is appropriately staffed, trained, and aligned with business goals and direction. Establish and implement Key Performance Indicators (KPIs) for direct reports, monitor and manage their performance and overall regional performance, and collaborate with them to achieve departmental and individual KPIs. Maintain robust reporting systems and keep the CEO informed of key sales performance metrics.</li><li><strong>Customer &amp; Distribution Relationship Management:</strong> Cultivate and strengthen profitable and enduring client relationships through effective communication, distribution strategies, and strategic supply contracts with major retail and food service users. Identify prospective customers and distribution channels aligned with the organization's strategic objectives and actively develop relationships to convert them into sustainable business. Directly manage major client accounts and coordinate the management of other accounts. Maintain regular contact with clients at both the buying and senior management levels, as well as industry counterparts and peers.</li><li><strong>Product Availability &amp; Distributor Relations: </strong>Collaborate with the Procurement team and liaise with product suppliers' marketing personnel and regional cold store personnel. Provide guidance to the Supply Chain Program Director on planned promotions and demand forecasting. Oversee and coordinate distribution channels in the region, working with Transportation and Logistics personnel to ensure timely and reliable customer order deliveries. Monitor regional storage center stocks, maintaining appropriate inventory levels within corporate guidelines and ensuring proper product rotation.</li><li><strong>Performance Effectiveness:</strong> Drive the achievement of financial, customer, product, and business goals on a quarterly and annual basis. Review and monitor accounts receivables in the region, ensuring prompt payments to minimize bad debts and improve cash flow. Keep the CEO informed of developments, risks, opportunities, and relevant information. Collaborate with the CEO to facilitate professional development opportunities for the sales staff.</li><li><strong>Business Development:</strong> Identify and assess opportunities for business growth and development. Collaborate with the team to identify and pursue new product opportunities. Maintain a network of influencers, stakeholders, and industry contacts to identify, analyze, validate, and convert potential business opportunities. Stay informed about competitive activities, customer developments, and market trends to protect the company's financial and market position.</li></ol><p><br/></p><p><br/></p><p><strong>Qualifications</strong></p><ul><li>15+ years of experience as a senior sales leader in the North American or Global Food Services Industry Manufacturer and Distributor, with expertise in international supply and distribution.</li><li>Strong understanding of retail and foodservice protein sectors, including case-ready and value-added marketplace knowledge.</li><li>Skilled in strategic planning and execution, demonstrating strong commercial acumen to analyze key drivers, opportunities, and competitive advantages for developing and implementing successful strategies.</li><li>Proven track record of converting strategic business relationships into valuable partnerships, with expertise in contract negotiation, sales quota management, and revenue goal setting.</li><li>Well-connected with appropriate relationships for securing supply and meeting customer needs.</li><li>Experienced in planning marketing strategies and executing promotional and advertising campaigns across various media platforms.</li><li>Leads by example, exhibiting professionalism, credibility, and trustworthiness throughout the organization, gaining respect and loyalty from stakeholders.</li><li>Provides clear expectations and direction, aligning team and personal goals with company objectives.</li><li>Willingness to take on additional responsibilities assigned by the CEO to support annual and strategic business goals.</li><li>Capable of effectively handling high stress, time demands, and travel requirements as Director of Sales for the Lamb Company's operations in Western U.S.</li></ul><p><br/></p><p><br/></p><p><br/></p><p><strong>What We Offer</strong></p><p>Why work with Brunel? We are proud to offer exciting career opportunities from over 100 offices globally in 42 countries. Advancing your career takes time and effort – let us match you to your ideal position.</p><p><br/></p><p><br/></p><p><strong>About Us</strong></p><p>Brunel has a reputation for working with some of the best in the business. That’s what we continually strive for. Brunel provides the global recruitment and workforce services you need to lead your industry. With 45 years of market experience in Renewable Energy, Automotive, Oil &amp; Gas, Life Sciences, Mining and Infrastructure, we help you finish major projects safely, compliantly, on-time, within budget and at the highest quality, so you can keep growing – anywhere in the world.</p>", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3970413293"}