{"jobTitle": "Director of Equipment Operations", "company": {"name": "University of California, Riverside", "location": "Riverside County, CA"}, "location": "Riverside County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "<strong>Position Information<br/><br/></strong>The Director of Equipment Operations is responsible for the day-to-day management of the Athletics equipment room operations and locker room, as well as related duties associated with the support of daily practice and home competitions. Assists in game management duties and facility maintenance/repair as needed. Responsible for receiving, securing, and managing the inventory of all Athletics equipment and uniforms. Acts as department Equipment custodian. Has campus purchasing duties related to Athletics Equipment. Manages relationships with apparel vendors to ensure good budget stewardship and proper ordering of items. This position will operate within an atmosphere of compliance, integrity, and the scope and intent of NCAA, conference, and University regulations and policies. This position will develop and maintain a comprehensive inventory of Athletics Equipment, review for accuracy, and provide reports as necessary. This role will work with the intercollegiate compliance department on compliance-related matters and paperwork within areas of responsibility. This position will be working nights, weekends, and holidays. The salary range for the Director of Equipment Operations is $61,000 - $106,800 annually. However, the expected pay scale for this position is up to $70,000 annually. We base salary offers on a variety of considerations, such as education, licensure and certifications, experience, and other business and organizational needs. Applicants must have current work authorization when accepting a UCR staff position. Currently, we are unable to sponsor or take over sponsorship of an employment Visa for staff. As a University employee, you will be required to comply with all applicable University policies and/or collective bargaining agreements, as may be amended from time to time. Federal, state, or local government directives may impose additional requirements.<br/><br/><strong>Requirements<br/><br/></strong><strong>Educational Requirements<br/><br/></strong><strong>Degree<br/><br/></strong>Bachelor's degree in related area and/or equivalent experience/training.<br/><br/><strong>Requirement<br/><br/></strong><strong>Required<br/><br/></strong><strong>Experience Requirements<br/><br/></strong><strong>Experience<br/><br/></strong>4 - 7 years of related experience.<br/><br/><strong>Requirement<br/><br/></strong><strong>Minimum Requirements<br/><br/></strong><ul><li>Thorough knowledge of program activity and best practices.</li><li>Problem-solving skills; multi-task, work with frequent interruptions, and effective listener.</li><li>Highly effective verbal and written communication skills in the English language.</li><li>Proficiency in the use of basic computer applications relevant to job duties.</li><li>Excellent organizational skills with the ability to handle multiple work priorities and to plan and manage large projects and events.</li><li>Knowledge of equipment operations issues and practices.</li><li>Excellent interpersonal skills, including collaboration, relationship building, and ability to respond positively and flexibly when working with all levels in the organization and with outside parties (i.e. customers, vendors, etc.).</li><li>Skills and experience supervising staff and student employees.</li><li>Strong work ethic and attention to detail. Proven ability to perform physically demanding work, moving materials weighing up to 70 pounds to and from pickup trucks, carts, and loading docks using hand trucks, dollies, or other moving devices.</li><li>Ability to utilize basic maintenance tools and field maintenance equipment.</li><li>Strong working knowledge of day-to-day store operations.</li><li>Ability to utilize equipment for athletics apparel (i.e. Washers, dryers, etc.).<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>General knowledge of all UCR-sponsored intercollegiate sports and their apparel requirements including uniforms, practice gear, weather-related gear, and day-to-day branded items.</li><li>Ability to utilize appropriate staff scheduling, equipment room management, and inventory software and applications.</li><li>Equipment certifications, such as from the Athletic Equipment Managers Association (AEMA).</li><li>Understanding of NCAA and Big West conference rules and regulations.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>In the Heart of Inland Southern California, UC Riverside is located on nearly 1,200 acres near Box Springs Mountain in Southern California; the park-like campus provides convenient access to the vibrant and growing Inland region. The campus is a living laboratory for the exploration of issues critical to growing communities' air, water, energy, transportation, politics, the arts, history, and culture. UCR gives every student, faculty and staff member the resources to explore, engage, imagine and excel. UC Riverside is recognized as one of the most ethnically diverse research universities in the country boasting several key rankings of which we are extremely proud.<br/><br/><ul><li>UC Riverside is proud to be ranked No. 12 among all U.S. universities, according to Money Magazine's 2020 rankings, and among the top 1 percent of universities worldwide, according to the 2019-20 Center for World University rankings. </li><li>UC Riverside is the top university in the United States for social mobility. - U.S. News 2020 </li><li>UCR is a member of the University Innovation Alliance, the leading national coalition of public research universities committed to improving student success for low-income, first-generation, and students of color. </li><li>Among top-tier universities, UC Riverside ranks No. 2 in financial aid. - Business Insider 2019 </li><li>Ranked No. 2 in the world for research, UCR's Department of Entomology maintains one of the largest collections of insect specimens the nation. - Center for World University Rankings </li><li>UCR's distinguished faculty boasts 2 Nobel Laureates, and 13 members of the National Academies of Science and Medicine. <br/><br/></li></ul>The University of California is an Equal Opportunity/Affirmative Action Employer with a strong institutional commitment to the achievement of excellence and diversity among its faculty and staff. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or any other characteristic protected by law. For information about our generous employee benefits package, visit: Employee Benefits Overview<br/><br/><strong>Job Description Details<br/><br/></strong><strong>Generic Scope<br/><br/></strong>Experienced professional who knows how to apply theory and put it into practice with in-depth understanding of the professional field; independently performs the full range of responsibilities within the function; possesses broad job knowledge; analyzes problems/issues of diverse scope and determines solutions.<br/><br/><strong>Custom Scope<br/><br/></strong>Uses skills as a seasoned, experienced intercollegiate athletics professional with a full understanding of industry practices and campus policies and procedures to plan, administer and coordinate the daily operations of a complex program and/or activity. Resolves a wide range of issues of diverse scope and complexity. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. May lead or serve as a resource for other staff or students.<br/><br/><strong>Department Custom Scope<br/><br/></strong>The Director of Equipment Operations is responsible for the day-to-day direction of the Athletics equipment room operations and locker room, as well as related duties associated with the support of daily practice and home competitions. Oversee and implement equipment policies and procedures, including but not limited to ordering, receiving, issuance, inventory control, access and usage, laundry services, maintenance, and security. This position will develop and maintain a comprehensive inventory of Athletics equipment, review for accuracy, and provide reports as necessary. Has campus purchasing duties related to Athletics Equipment. Develops and manages relationships with apparel vendors to ensure good budget stewardship and proper ordering of items. This position will operate within an atmosphere of compliance, integrity, the scope and intent of the NCAA conference, and University regulations and policies.", "responsibilities": "The Director of Equipment Operations is responsible for the day-to-day management of the Athletics equipment room operations and locker room, as well as related duties associated with the support of daily practice and home competitions. Assists in game management duties and facility maintenance/repair as needed. Responsible for receiving, securing, and managing the inventory of all Athletics equipment and uniforms. Acts as department Equipment custodian. Has campus purchasing duties related to Athletics Equipment. Manages relationships with apparel vendors to ensure good budget stewardship and proper ordering of items. This position will operate within an atmosphere of compliance, integrity, and the scope and intent of NCAA, conference, and University regulations and policies. This position will develop and maintain a comprehensive inventory of Athletics Equipment, review for accuracy, and provide reports as necessary. This role will work with the intercollegiate compliance department on compliance-related matters and paperwork within areas of responsibility. This position will be working nights, weekends, and holidays.", "qualifications": {"required": "Bachelor's degree in related area and/or equivalent experience/training.<br/><br/>4 - 7 years of related experience.<br/><br/>Thorough knowledge of program activity and best practices. Problem-solving skills; multi-task, work with frequent interruptions, and effective listener. Highly effective verbal and written communication skills in the English language. Proficiency in the use of basic computer applications relevant to job duties. Excellent organizational skills with the ability to handle multiple work priorities and to plan and manage large projects and events. Knowledge of equipment operations issues and practices. Excellent interpersonal skills, including collaboration, relationship building, and ability to respond positively and flexibly when working with all levels in the organization and with outside parties (i.e. customers, vendors, etc.). Skills and experience supervising staff and student employees. Strong work ethic and attention to detail. Proven ability to perform physically demanding work, moving materials weighing up to 70 pounds to and from pickup trucks, carts, and loading docks using hand trucks, dollies, or other moving devices. Ability to utilize basic maintenance tools and field maintenance equipment. Strong working knowledge of day-to-day store operations. Ability to utilize equipment for athletics apparel (i.e. Washers, dryers, etc.).", "preferred": "General knowledge of all UCR-sponsored intercollegiate sports and their apparel requirements including uniforms, practice gear, weather-related gear, and day-to-day branded items. Ability to utilize appropriate staff scheduling, equipment room management, and inventory software and applications. Equipment certifications, such as from the Athletic Equipment Managers Association (AEMA). Understanding of NCAA and Big West conference rules and regulations."}, "skills": ["Problem Solving", "Communication", "Inventory Management", "Equipment Management", "Supervising"], "postedDate": "1 month ago", "url": "https://www.linkedin.com/jobs/view/3970480988"}