{"jobTitle": "Maintenance Supervisor", "company": {"name": "McKenna Labs, Inc.", "industry": "Personal Care Product Manufacturing", "size": "Not specified", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Personal Care Product Manufacturing", "description": "McKenna Labs is a full-service contract manufacturing company that specializes in hair, skin and body care products. We've been in the personal care development and manufacturing industry since 1998. We are in search of a dynamic leader to take charge of our mechanical team. The Maintenance Supervisor is responsible for coordinating and supervising maintenance activities to ensure manufacturing equipment is functional and optimized, while limiting operational delays and associated costs. This role combines mechanical knowledge with strong leadership to ensure the smooth and efficient operation of our manufacturing operations. The Maintenance Supervisor plays a crucial role in optimizing production processes, implementing cost-effective solutions, and driving asset reliability and continuous improvement initiatives.", "responsibilities": "Leadership and Team Management: Provide strong leadership to mechanical team members, fostering a culture of continuous improvement that is collaborative, empowering and motivating. Mentor team members to build technical competencies in equipment set up, preventative maintenance, troubleshooting and repairs, and career growth. Set clear goals and performance targets, monitor progress, and provide constructive feedback to team members. Provide necessary guidance, technical support, and training to ensure that employees work safely and comply with established Standard Operating Procedures (SOP’s) and processes. Provide after-hours maintenance resources by calling in appropriate maintenance staff; responds personally in critical or complicated situations. Responsible for supervisory activities including, but not limited to, new hire onboarding and training, scheduling, performance evaluations, discipline, coaching, safety training and employee development, along with recommendations for hiring and terminations. Collaborate closely with the Scheduling and Production teams to match resources to needs in order to minimize downtime and maximize throughput. Communicate changes and proposed solutions. Equipment Maintenance and Management: Prioritize maintenance needs and allocate resources effectively. Direct tasks with an understanding of the importance of increasing accuracy and efficiency and decreasing waste and operational costs. Identify bottlenecks and offer suggestions on how to resolve them, including stepping in to perform any task in support of company goals. Direct activities in support of a comprehensive maintenance and reliability strategy ensuring minimal downtime, optimal equipment performance, timely repairs, reduced operational risk, and optimized asset life of production systems and equipment. Coordinate with cross-functional teams to schedule maintenance activities with minimal disruption to production schedules and ensuring compliance with safety and quality standards. Ensure equipment and machinery modifications/repairs align with engineering, maintenance, and reliability standards. Production Process Optimization: Continually assess maintenance effectiveness and work with production team to identify opportunities for improvement, production optimization and maintenance planning. Collaborate with internal and external groups to analyze production processes, identify opportunities for improvement in efficiency and productivity, and provide insights for the development of new processes. Work closely with production and operations teams to streamline workflows and eliminate bottlenecks.", "qualifications": {"required": "2+ years of proven experience in a maintenance supervisor, lead, or scheduling role. Experience in the personal care products manufacturing industry is ideal, but not a requirement. Strong leadership/team management skills with ability to motivate and manage a diverse team. Excellent organizational skills with the ability to respond quickly and direct activities in an environment with constantly changing priorities. Good understanding of manufacturing processes, equipment maintenance, reliability practices, and troubleshooting techniques for equipment and systems. Familiarity with safety regulations and environmental compliance standards. Strong communication and interpersonal skills to collaborate across departments and communicate effectively with team members. Analytical mindset with the ability to identify trends, analyze data, and make informed decisions. Fluency in English. Bilingual in technical Spanish is a strong differentiator. Must be able to work in person onsite.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Our current benefits package, which is available to all full-time team members, includes medical, dental, vision insurance, 401k retirement plan, flexible spending accounts, life and disability coverage, and other voluntary benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3970917415"}