{"jobTitle": "YMCA Expanded Learning Site Manager - ASES", "company": {"name": "YMCA of Greater Long Beach", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Non-profit Organization Management", "description": "As a Site Manager you will be responsible for the day-to-day operations of the expanded learning program. Daily program components include: academic tutoring, mentoring, healthy lifestyles education, and other academic enrichment curricula and activities. In addition, you will be developing staff through observations and coaching. A strong emphasis on safety, meeting and maintaining program requirements, building relationships with various stakeholder and program quality is demanded of this position. <strong>Program hours are between 12:00 p.m.<strong> - 6:30 p.m., Monday through Friday (Everyday)</strong>. Actual schedule varies by site (Flexible Hours).<br/><br/></strong><strong>Essential Functions<br/><br/></strong><ul><li>Responsible for program development, planning and supervision in accordance with ASES requirements, partner agencies and YMCA standards.</li><li>Responsible for supervision of staff and children in the program, curriculum planning and implementation and public relations.</li><li>Responsible for accurate counts on all children that attend.</li><li>Conduct a range of activities that promote family involvement, membership by design, and relationship by design.</li><li>Ensure the program has necessary supplies and equipment; report any issues to their direct supervisor.</li><li>Prepare and develop lesson plans that are age appropriate and consistent with the mission of the YMCA.</li><li>Follow site and Association policies and procedures for health, safety, and nutrition.</li><li>Attend all staff meetings, trainings and other YMCA functions as required by Supervisor.</li><li>Maintain open lines of communication with staff, parents, and supervisor.</li><li>Responsible for supervising part time employees and volunteers.</li><li>Assist with hiring, training and scheduling program staff and volunteers.</li><li>Conduct and facilitate regular staff meetings.</li><li>Ensure that administrative requirements are met.</li><li>Perform other duties as assigned<br/><br/></li></ul>We are looking for Site Managers who demonstrates a desire to serve others and fulfill community needs. If this sounds like a job for you please apply for this position!", "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3970536086"}