{"jobTitle": "General Manager | Sales / Operations Manager", "company": {"name": "Elements Massage®", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Wellness and Fitness Services", "description": "Looking for a management position with growth opportunities in the Wellness industry? Elements Massage® is looking for a sales manager / operations manager to oversee sales and operations for a Massage Therapy wellness studio. Contact us today!<br/><br/><strong>Elements Massage</strong>®<strong> Studio Manager Benefits<br/><br/></strong><ul><li>Competitive pay and bonus structure</li><li>Medical Insurance</li><li>Paid Time Off (PTO)</li><li>401K with matching</li><li>Free massage therapy services<br/><br/><br/></li></ul><strong>Manager Qualifications - A great manager believes in the therapeutic benefits of Massage Therapy, and has the following<br/><br/></strong><ul><li>Experience in management including but not limited to experience as a sales manager, operations manager, and/or general manager.</li><li>Has excellent leadership skills; ability to lead a team in an organized and efficient way ensuring operations runs smoothly.</li><li>Implement structure, policies, and procedures.</li><li>Customer Service oriented</li><li>Ability to identify and problem solve, set expectation, goals, and delegate</li><li>Strong verbal and written communications skills</li><li>Possess strong interpersonal skills to communicate with confidence</li><li>Must be an excellent organizer and problem solver with strong project management skills</li><li>Must be able to work flexible days and hours; including nights, weekends, and holidays</li><li>Competent trainer and motivator</li><li>MindBody Software experience a plus<br/><br/><br/></li></ul>Each Elements Massage® studio is independently owned and operated. Franchise owners (or their designated hiring managers) are solely responsible for all employment and personnel decisions and matters regarding their independently owned and operated studios, including hiring, direction, training, supervision, discipline, discharge, compensation (e.g., wage practices and tax withholding and reporting requirements), and termination of employment. Elements Therapeutic Massage, LLC (ETM) is not involved in, and is not responsible for, employment and personnel matters and decisions made by any franchise owner. All individuals hired by franchise owners’ studios are their employees, not those of ETM. Benefits vary by independently owned and operated Elements Massage® studios. Elements Massage® and Elements Massage + design are registered trademarks owned by ETM.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3970347962"}