{"jobTitle": "Director of Operations", "company": {"name": "Bottega Louie Restaurant, Gourmet Market & Patisserie", "industry": "Hospitality", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "ABOUT BOTTEGA LOUIE\nFounded in Los Angeles in 2007, Bottega Louie develops premier landmark Restaurants, Patisseries & Cafés. Our objective is to deeply connect with the communities we serve by creating premium Fine Dining, Patisserie, Bakery and Café experiences thoughtfully designed and accessible to everyone.\n\nWe are committed to serving the finest quality classic American, Italian & French café and bistro recipes paired with first class exceptional service. We operate with the management systems and tools required to consistently produce thousands of premium Guest Experiences daily. We provide valuable opportunities for each Botttega Louie Team Member to pursue professional progress and satisfaction in their work. We believe life is richer and we are most effective when we truly connect to the people around us and work together cooperatively as a Team and respect each other’s contribution and importance.\n\nOur greatest strength, and the largest contributing factor to our success, is our Team. As a Bottega Louie Team Member, you are essential to satisfying our discerning Guests and contributing to the Company’s continued success.", "responsibilities": "The primary responsibility of this role is to drive and oversee profitable strategies for central office and business units. Close and continuous collaboration with central office and restaurant leadership to ensure the operations are aligned to the company strategy and vision. Collaborate with across all departments to guide strategy, solutions and opportunities regarding the operating units. Act as a conduit between business units and ownership. Manage relationships with across all company stakeholders. Ensure compliance with quality and operational standards. Provides direction in the development of annual business plans and capital expenditure plans for assigned areas of responsibility. Monitors the implementation of approved plans through correspondence and frequent in-person support to maximize operating profits, quality, and service. Reviews draft annual budgets and business plans prior to ownership submission. Provides assistance and direction in diagnosing, addressing and resolving restaurant problems; and in analyzing local market activities to determine what competitive actions, if any, should be taken. Provides expert assistance and direction to restaurant leaders, in diagnosing key financial and guest satisfaction metrics. Monitors the financial performance and operational plans of the restaurants to support the agreed overall objectives. Ensures Procurement Function is well established to source, negotiate, and receive goods and services. Directs the development of strategies to increase brand awareness by focusing on points of difference, implementation of standards, and ensuring that standards are guest driven while providing ownership value. Ensures that product standards are met in all areas of the operations as pertains to physical appearance, maintenance, and cleanliness. Ensure all strategic and ongoing plans are executed and reported on in a timely manner. Ensures that restaurants operate within the approved budgets. Guide strategy for Sale & Marketing. Support facilities and IT team in preventive and situational maintenance. Support Human Resources in team engagement, recruitment, and legal matters. “Brand Ambassador” at all times and ensures brand integrity and clarity are always maintained. Ensure that all leaders embrace the culture, and drive all associates to be brand ambassadors. Develop and implement strategy to execute the brand personality at operational level to directly impact guest experience.", "qualifications": {"required": "You have at least ten (5) years of experience in a similar position, ideally in a high volume restaurant with relative experience in fiscal and operational performance in a preferred high volume, upscale to fine dining restaurant group. You are an expert in Microsoft Office and technology. You are able to work independently and as part of a team, and are able to effectively manage your time. You exhibit a helpful, supportive communication style, and are collaborative within a structured job environment. The Director of Operations is a salaried, full time, exempt position with a varied schedule with business operations that can include early mornings, nights, weekends, holidays, and on-call at times. You must be able to lift up to 50 lbs., be able to sit at a computer or desk, and stand on your feet for extended period of time. Must be able to easily sit, stand, stoop, reach, and walk. Manager Certification in Sanitation and Food Handling is required.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3970529025"}