{"jobTitle": "Claims Auditor", "company": {"name": "Prospect Medical Systems", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "size": "Not specified", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Finance and Accounting/Auditing", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "description": "The Claims Auditor performs analysis and monitors trends identified through the audit process. This individual will take the lead to ensure accurate and timely adjudication of claims, as well as identifying potential issues and recommending strategies for resolution. Apply claim and/or inquiry processing experience to audit and analyze simple to advanced-level claims processing procedures and workflows.", "responsibilities": "Apply claim processing experience to audit and analyze all levels of claims processing procedures and workflows. Requires the ability to audit claims accurately. Independently run reports on errors identified for potential error trends and report the results to Claims Management and Claims Trainer. Additionally assist in the processing of PDRs, Health Plan Cap Deducts, and claims processing. Handle special projects from external provider and internal departments. Must have the ability to accurately make the necessary adjustments for underpayments and review overpayment requests for Claims Recovery Specialist. Independently audit and analyze high dollar claims and checks prior to the issuance of funds. Must possess the ability to analyze Claims EOB and balance check amounts according to Claims processing guidelines. Analyze and prepare Health plan claims selections for Annual health plan audit. Review samples provider by clerical staff and ensure claims payments are accurate and all documentations required by the health plan auditor is present at the time of audit. Assist the Recovery Specialist in corresponding with external providers regarding Claims Overpayment requests. Requires the ability to communicate and analyze Claims processing methodologies according to CMS and DMHC guidelines.", "qualifications": {"required": "High School Diploma or Equivalent. BS/BA preferred.", "preferred": "Two to three (2-3) years previous experience as medical claims Auditor or 3-5 years previous experience examining medical Claims preferred. Preferably in an IPA, MSO, or Medical Group setting."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3970465497"}