{"jobTitle": "TikTok Shop-Site Operations Manager", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "111,000.00/yr - $208,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>Why TikTok Shop<br/><br/>The e-commerce industry has seen tremendous growth in recent years and has become a hotly contested space amongst leading Internet companies, and its future growth cannot be underestimated. With millions of loyal users globally, we believe TikTok is an ideal platform to deliver a brand new and better e-commerce experience to our users.<br/><br/>TikTok Shop's Supply Chain &amp; Logistics is looking for an experienced Site Operations Manager to oversee various aspects of building operations, maintenance, and compliance to create a safe, productive, and comfortable work environment for our employees. <br/><br/>Responsibilities:<br/>- Manage end to end e-commerce fulfillment operations including inbounding goods, pick, pack and outbound operations.<br/>- Owns and delivers operational KPIs and cost targets for the regional areas of responsibility, including safety, productivity and financial goals.<br/>- Responsible for providing strategic  and long-term planning inputs including peak season planning.<br/>- Drives continuous improvement to optimize operations and improve productivity.<br/>- Champion strategic projects that have network-wide impact. <br/>- Leverages cross functional teams and third party service provides to run a world class fulfillment operation and solicit ideas to solve problems.<br/>- Establishes objectives and metrics for node operations in the areas of safety, quality, productivity, and customer experience.<br/>- Sets clear goals and expectations for team members, measure performance and provide feedback.<br/>-This role will require frequent travel in the region. All applicants must be comfortable with frequent travel. <br/><br/>Qualifications<br/><br/> Minimum Qualifications:<br/>- Bachelor's degree in Business, Logistics, Operations, Engineering, a related field, or equivalent practical experience.<br/>- 5 years of experience managing third-party logistics providers/vendors.<br/>- Strong project management and continuous improvement skills.<br/>- Experience managing inbound, outbound, or quality operations with a thorough understanding of key metrics, inputs, and outputs.<br/>- Track record of success in operations management, including but not limited to problem solving, capacity planning, cost management, etc.<br/><br/>Preferred Qualifications:<br/>- Continuous improvement, Lean Six Sigma, Kaizen experience.<br/>- Writing training documents and standard operating procedures.<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $111000 - $208000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Manage end to end e-commerce fulfillment operations including inbounding goods, pick, pack and outbound operations.\n- Owns and delivers operational KPIs and cost targets for the regional areas of responsibility, including safety, productivity and financial goals.\n- Responsible for providing strategic  and long-term planning inputs including peak season planning.\n- Drives continuous improvement to optimize operations and improve productivity.\n- Champion strategic projects that have network-wide impact. \n- Leverages cross functional teams and third party service provides to run a world class fulfillment operation and solicit ideas to solve problems.\n- Establishes objectives and metrics for node operations in the areas of safety, quality, productivity, and customer experience.\n- Sets clear goals and expectations for team members, measure performance and provide feedback.\n-This role will require frequent travel in the region. All applicants must be comfortable with frequent travel. ", "qualifications": {"required": "- Bachelor's degree in Business, Logistics, Operations, Engineering, a related field, or equivalent practical experience.\n- 5 years of experience managing third-party logistics providers/vendors.\n- Strong project management and continuous improvement skills.\n- Experience managing inbound, outbound, or quality operations with a thorough understanding of key metrics, inputs, and outputs.\n- Track record of success in operations management, including but not limited to problem solving, capacity planning, cost management, etc.", "preferred": "- Continuous improvement, Lean Six Sigma, Kaizen experience.\n- Writing training documents and standard operating procedures."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span>\n\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span>\n\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3970756747"}