{"jobTitle": "National Account Manager", "company": {"name": "Crawford Thomas Recruiting", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Medical Equipment Manufacturing", "description": "National Account Manager: Remote/Based out of Southern CA (Orange, Los Angeles or San Diego Counties)<br/><br/><strong>Company Overview:</strong> Our client has 15+ years of experience as medical device company offering innovative solutions that benefit both surgeons and patients. They are looking to add a remote National Account Manager to their Southern CA team.<br/><br/><strong>Compensation &amp; Benefits: </strong> Our client offers a competitive $120k Base salary (flexible/negotiable DOE) + 10% performance bonus opportunity, comprehensive full health benefits, 401k with company match up to 4%, room for growth, etc. <strong>Job Summary:</strong> The National Account Manager is a member of the National Accounts team and is responsible for supporting and expanding company relationships with IDN’s, hospital systems, individual hospitals, and high-profile accounts. He or she supports the National Accounts team ensuring the accuracy, completeness, and reliability of the National Account team's data and processes. The National Account Manager will use different tools to review data quickly, identify and correct errors or discrepancies, and assist in maintaining that data. They will also support contracting functions, not limited to analysis, implementation, contract creation, and other functions requested by National Account management. The ideal candidate will be a team player who collaborates with members of the commercial sales team, legal team, customer service, supply chain, marketing, and operational teams to establish customer proposals, responses, and always ensure compliance with company policies. The National Account Manager reports to the Vice President of National Accounts and works closely with the commercial team to support opportunities to secure agreements and foster relationships that ultimately increase market share and grow sales volume. He or she must be a charismatic and passionate individual with the ability to clearly support the company’s mission, values, and brand plus its innovative and novel products.<br/><br/><strong>Principal Duties and Responsibilities:</strong> Significant, demonstrable market intelligence, product knowledge, and clinical expertise. Skilled at interacting in a professional and productive environment with the company’s customers, including hospital administration, leadership personnel, and orthopedic surgeons. Knowledge of financial business models and how to conduct detailed analysis. Intermediate computer and word processing skills, in particular Microsoft Word, Excel, and PowerPoint. Ability to: Communicate product-related clinical information and evidence-based opinions clearly and concisely. Multi-task, organize, plan, and set priorities with minimal supervision. Exercise good judgment with a strong attention to detail. Manage resources and leverage meaningful relationships. Work well with executives, physicians, sales representatives, and hospital/surgery center personnel. Instills a sense of urgency to meet deadlines, sets high expectations, and holds both self and others accountable for the expected results. Strong interpersonal skills; a team player who helps others while simultaneously building credibility; a professional who demonstrates fairness, balance, stability, and reason; skillfully aggressive. High standards; strong sense of integrity - one who makes and keeps commitments. Skilled at coordinating cross-functional projects in a collaborative and solutions-oriented manner. Exceptional verbal and written skills; fluency in English. <strong>Brand Awareness and Relationship Building:</strong> Support the efforts of the Sales Leadership in creating overall value and company success. Supports National Accounts leadership efforts with key personnel (such as supply chain administration, hospital executives, and surgeons) to increase our client’s brand awareness and ultimately orders. Perform troubleshooting procedures to identify and resolve problems quickly and with confidence. Ensure customer retention. <strong>Education/Experience Requirements:</strong> Associate degree from an accredited institution. Bachelor’s degree preferred. Two to three years of orthopedic implant commercial experience preferred (preferably in trauma/extremities). One to three years Healthcare account experience preferred, building C-suite and supply chain business relationships. Professional written, verbal communication, and interpersonal skills. Requested location, Southern California (Orange County preferred).<br/><br/>", "postedDate": "2 weeks ago", "qualifications": {"required": "Significant, demonstrable market intelligence, product knowledge, and clinical expertise. Skilled at interacting in a professional and productive environment with the company’s customers, including hospital administration, leadership personnel, and orthopedic surgeons. Knowledge of financial business models and how to conduct detailed analysis. Intermediate computer and word processing skills, in particular Microsoft Word, Excel, and PowerPoint. Ability to: Communicate product-related clinical information and evidence-based opinions clearly and concisely. Multi-task, organize, plan, and set priorities with minimal supervision. Exercise good judgment with a strong attention to detail. Manage resources and leverage meaningful relationships. Work well with executives, physicians, sales representatives, and hospital/surgery center personnel. Instills a sense of urgency to meet deadlines, sets high expectations, and holds both self and others accountable for the expected results. Strong interpersonal skills; a team player who helps others while simultaneously building credibility; a professional who demonstrates fairness, balance, stability, and reason; skillfully aggressive. High standards; strong sense of integrity - one who makes and keeps commitments. Skilled at coordinating cross-functional projects in a collaborative and solutions-oriented manner. Exceptional verbal and written skills; fluency in English.", "preferred": "Associate degree from an accredited institution. Bachelor’s degree preferred. Two to three years of orthopedic implant commercial experience preferred (preferably in trauma/extremities). One to three years Healthcare account experience preferred, building C-suite and supply chain business relationships. Professional written, verbal communication, and interpersonal skills. Requested location, Southern California (Orange County preferred)."}, "skills": ["Market Intelligence", "Product Knowledge", "Clinical Expertise", "Hospital Administration", "Orthopedic Surgeons", "Financial Business Models", "Microsoft Word", "Excel", "PowerPoint", "Communication", "Multi-tasking", "Organization", "Planning", "Prioritization", "Problem Solving", "Resource Management", "Relationship Building", "Teamwork", "Integrity", "Project Coordination", "Verbal Communication", "Written Communication", "Brand Awareness", "Customer Retention"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3971791100"}