{"jobTitle": "US Prime Business Analyst, US Prime", "company": {"name": "Amazon", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "106,400.00/year - 185,000.00/year", "currency": "USD"}, "jobFunction": "Business Development and Information Technology", "industry": "Software Development", "description": "Do you want to help drive growth and engagement with one of Amazon’s most important businesses? Do you enjoy using data and analytics to deliver actionable insights that support critical business decisions?\n\nAmazon seeks an experienced business analyst to be a key member of the US Prime team. This is an exciting opportunity to support and influence the strategy of US Prime, with a focus on delivering data and insights on business performance.\n\nAs a US Prime Performance Business Analyst, you will partner with product, marketing, finance, and analytical professionals to provide data and insights that influence and support critical business decisions. The successful candidate will have shown experience in past roles influencing business owners and supporting decision making in rapidly evolving environments. This role requires a self-starter with strong modeling skills, a keen attention to detail, and an ability to manage multiple projects across several stakeholders effectively. This role also has regular interaction with various business units including North America Retail, Prime Video, Delivery Experience, and other key Prime benefit partners across Amazon, and requires strong interpersonal and communication skills.\n\nKey job responsibilities\n\n<ul><li> Serve as the key business performance partner working directly with product, marketing, finance, and other stakeholders across US and Worldwide Prime teams</li><li> Develop, launch, and optimize business performance mechanisms</li><li> Deliver data, analysis, insights, and recommendations to help shape business, product, and marketing strategies for US Prime</li><li> Lead business performance analysis and reporting, including preparation of weekly, monthly, and quarterly business reviews</li><li> Partner with Business, Product, Marketing, and Finance leaders to provide data-driven insights and recommendations that influence business decisions<br/><br/></li></ul>About The Team<br/><br/>The US Prime team is focused on delivering the most engaging, satisfying, and loved membership program that drives the Amazon flywheel by growing the member base and accelerating engagement with Prime benefits.<br/><br/>Basic Qualifications<br/><br/><ul><li> 5+ years of tax, finance or a related analytical field experience</li><li> 3+ years of writing SQL queries and creating business intelligence reports using Tableau, Power BI experience</li><li> Bachelor's degree</li><li> Experience defining requirements and using data and metrics to draw business insights</li><li> Experience with Excel</li><li> Experience with SQL</li><li> Experience making business recommendations and influencing stakeholders<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li> MBA<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $106,400/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/>Company - Amazon.com Services LLC<br/><br/>Job ID: A2693647", "responsibilities": "<ul><li> Serve as the key business performance partner working directly with product, marketing, finance, and other stakeholders across US and Worldwide Prime teams</li><li> Develop, launch, and optimize business performance mechanisms</li><li> Deliver data, analysis, insights, and recommendations to help shape business, product, and marketing strategies for US Prime</li><li> Lead business performance analysis and reporting, including preparation of weekly, monthly, and quarterly business reviews</li><li> Partner with Business, Product, Marketing, and Finance leaders to provide data-driven insights and recommendations that influence business decisions<br/><br/></li></ul>", "qualifications": {"required": "5+ years of tax, finance or a related analytical field experience\n3+ years of writing SQL queries and creating business intelligence reports using Tableau, Power BI experience\nBachelor's degree\nExperience defining requirements and using data and metrics to draw business insights\nExperience with Excel\nExperience with SQL\nExperience making business recommendations and influencing stakeholders", "preferred": "MBA"}, "skills": ["SQL", "Tableau", "Power BI", "Excel"], "postedDate": "1 day ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971229551"}