{"jobTitle": "Sales Associate - Cerritos, CA", "company": {"name": "Hibbett", "location": "La Habra, CA"}, "location": "La Habra, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "16.90/hr - 16.90/hr", "currency": "USD"}, "jobFunction": "Purchasing", "industry": "Retail", "description": "01489 Fullerton, CA, 01502 Cerritos, CA, 01540 Santa Ana, CA, 01547 La Habra, CA<br/><br/>Job Title: Sales Associate<br/><br/>Department: Operations<br/><br/>FLSA Status: Non-Exempt<br/><br/>Reports To: Store Manager<br/><br/>Hourly: $16.90-$17.75<br/><br/><strong>Summary<br/><br/></strong>The Sales Associate is responsible for assisting the store's management staff with providing quality customer service. The Sales Associate is knowledgeable in each product area or department in our store. Upholds policies, procedures and standards listed in the visual manual. They must fully promote each sale and/or promotion. Serves as an ambassador of Hibbett I City Gear creating a unique customer experience helping to acquire and retain long-time customers. The Sales Associate is passionate about giving outstanding customer service and promoting the merchandise in stores.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Produce and give extraordinary customer service highlighted in the customer service manual, including helping customers as they enter the store, and helping multiple customers during peak periods.</li><li>Promote and sell services and merchandise provided by Hibbett I City Gear.</li><li>Consistently set goals to grow and improve selling skills and track overall sales.</li><li>Practice and uphold all Hibbett I City Gear policies, procedures, and standards as listed in the operations policy manual, personnel policy manual, visual manual, customer service manual, and memos with the company's direction.</li><li>Asist in the daily operations of the store, including completing work lists, clean up lists, weekly shipments, and store maintenance.</li><li>Utilize presenting merchandise to promote and sell goods, guidance found in the product knowledge manual.</li><li>Consistently achieve and/or exceed sales targets and goals.</li><li>Identify and communicate merchandise needs, pricing concerns, and operations problems to store management staff.</li><li>Attend all staff meetings and tech clinics for the store.</li><li>Protect the company's assets and financial information by ensuring the accuracy and effectiveness of internal control procedures and informing management and/or appropriate officials of potential fraud risk.<br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>There are no supervisory responsibilities for this role.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>0-2 years of customer service experience.</li><li>Excellent interpersonal and communication skills</li><li>Ability to work in a fast-paced environment.</li><li>Is a self-starter, has initiative to take on important tasks without being asked.</li><li>Strong attention to detail with the ability to handle multiple tasks simultaneously and with precision.</li><li>Is a team-player, passionate about outstanding customer service and selling merchandise.<br/><br/></li></ul>Hibbett's Privacy Policy<br/><br/>Candidates will have an option during the application process to withdraw their application prior to completion of the application. Throughout this online job application process, you will be asked to provide personal information about yourself. Please review Hibbett's Privacy Policy to understand how the information you provide will be utilized and safeguarded.<br/><br/>By clicking the Apply button, I acknowledge that I have read and understand the Hibbett's Privacy Policy. Further, I consent to the use of the same as my Electronic Agreement for purposes hereof. I acknowledge that I have a right to withdraw such consent at any time by contacting Hibbett.", "responsibilities": "The Sales Associate is responsible for assisting the store's management staff with providing quality customer service. The Sales Associate is knowledgeable in each product area or department in our store. Upholds policies, procedures and standards listed in the visual manual. They must fully promote each sale and/or promotion. Serves as an ambassador of Hibbett I City Gear creating a unique customer experience helping to acquire and retain long-time customers. The Sales Associate is passionate about giving outstanding customer service and promoting the merchandise in stores.", "qualifications": {"required": "0-2 years of customer service experience, Excellent interpersonal and communication skills, Ability to work in a fast-paced environment, Is a self-starter, has initiative to take on important tasks without being asked, Strong attention to detail with the ability to handle multiple tasks simultaneously and with precision, Is a team-player, passionate about outstanding customer service and selling merchandise."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971263088"}