{"jobTitle": "Associate, Fund Operations", "company": {"name": "Clocktower Group", "location": "Santa Monica, CA", "industry": "Financial Services"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "85,000.00/yr - 105,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Financial Services", "description": "Clocktower Group is an alternative asset management and advisory firm based in Santa Monica, California, with a presence in London and Shanghai. Our top-down macro framework and relationship-based investing approach inform our strategies and drive the way we do business. In public markets, we seed macro-oriented managers and invest in China-focused equities managers. In private markets, we invest in early stage fintech and climate disrupters. We also provide global macro research and advisory services.\n\nAs an Associate within our Fund Operations team, you will help drive our relationships with hedge fund managers, leading operational due diligence and supporting the launch of managers’ businesses, as well as supporting the operational requirements of our funds. Your skills and experience will be instrumental in maintaining the high standards of our fund operations and contributing to the overall success of our organization.\n\n**<u>What you’ll do:</u>**\n<ul><li>**Fund Accounting and Venture Valuation.** Work with the operations team and our fund administrators on the performance measurement and monthly NAV accounting for our funds. This includes maintaining a shadow book to verify and approve the administrators’ calculations and working with the funds’ auditors to finalize the annual audited financials, as well as valuing our portfolio companies in our venture funds.</li><li>**Fund Tax &amp; Operations.** Work with other Operations team members and the firm’s management in reviewing tax filings for its various entities and advising on relevant tax aspects of the firm’s investment activities. Handle cash movements and expense payments for the funds.</li><li>**Venture and Hedge Fund Investing.** Play an integral role in executing venture and hedge fund investments, including operational reviews, treasury management, and wire process. Leverage our expertise as well as that of our investors to provide best practices to help our hedge fund managers launch and grow their businesses.</li><li>**Fund Launches.** Will assist with the operational aspects of launching new fund products and co-investment vehicles, including onboarding service providers, opening bank accounts, and coordinating with internal and external legal counsel on entity formation and fund documents.</li></ul>\n\n**<u>Qualifications: </u>**\n<ul><li>2-3+ years’ partnership and/or investment tax experience with a focus on Hedge Funds, Private Equity, and/or Venture Capital fund tax preparation and consulting.</li><li>Bachelor’s degree in accounting, finance, economics, or equivalent experience.</li><li>The ability to work independently, manage multiple projects simultaneously, adjust to changing priorities, and thrive in a fast-paced environment.</li><li>A keen eye for accuracy and a commitment to maintaining high-quality fund operations.</li><li>Strong technical skills and analytical ability, good judgment, and a strong operational focus.</li><li>Completion of or progress towards CPA or CFA a plus.</li><li>Fluency in English written/verbal communication required.</li><li>This role must be onsite 3 days per week in our Santa Monica office.</li></ul>\n\n**<u>What you’ll get:</u>**\n<ul><li>Vast resources to learn and grow</li><li>Joining an elite team that works with some of the most sophisticated investors and entrepreneurs in the world</li><li>World-class benefit programs, including options for health, dental, vision, disability, life insurance, 401K plan (with matching), generous vacation, and sick leave</li><li>Delicious, healthy lunches and snacks</li><li>Beautiful office space with amazing ocean views</li></ul>\n\nClocktower Group is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other status protected by law.\n\nWhile the roles at Clocktower are primarily desk-based and do not typically require significant physical demands, employees in these positions should be able to:\n<ul><li>Sit for extended periods.</li><li>Use a computer and other office equipment effectively.</li><li>Occasionally lift and move lightweight office supplies or materials.</li></ul>\n\n**Salary Range:** $85,000-$105,000. Compensation may vary based on experience, training, education, and scope of the role. This position is eligible for an annual discretionary bonus.", "responsibilities": "As an Associate within our Fund Operations team, you will help drive our relationships with hedge fund managers, leading operational due diligence and supporting the launch of managers’ businesses, as well as supporting the operational requirements of our funds. Your skills and experience will be instrumental in maintaining the high standards of our fund operations and contributing to the overall success of our organization.", "qualifications": {"required": "2-3+ years’ partnership and/or investment tax experience with a focus on Hedge Funds, Private Equity, and/or Venture Capital fund tax preparation and consulting., Bachelor’s degree in accounting, finance, economics, or equivalent experience., The ability to work independently, manage multiple projects simultaneously, adjust to changing priorities, and thrive in a fast-paced environment., A keen eye for accuracy and a commitment to maintaining high-quality fund operations., Strong technical skills and analytical ability, good judgment, and a strong operational focus., Fluency in English written/verbal communication required., This role must be onsite 3 days per week in our Santa Monica office.", "preferred": "Completion of or progress towards CPA or CFA a plus."}, "skills": ["Hedge Funds", "Private Equity", "Venture Capital", "Fund Accounting", "Tax", "Operations", "Venture Investing", "Fund Launches", "CPA", "CFA"], "postedDate": "1 month ago", "benefits": "World-class benefit programs, including options for health, dental, vision, disability, life insurance, 401K plan (with matching), generous vacation, and sick leave, Delicious, healthy lunches and snacks, Beautiful office space with amazing ocean views", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971727442"}