{"jobTitle": "Associate Vice President, Human Resources", "company": {"name": "City of Long Beach", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Human Resources", "industry": "Government Administration", "description": "ASSOCIATE VICE PRESIDENT, HUMAN RESOURCES<br/><br/>LONG BEACH CITY COLLEGE<br/><br/>Long Beach City College is committed to providing equitable student learning and achievement, academic excellence, and workforce development by delivering high quality educational programs and support services to our diverse communities. Long Beach City College currently has the privilege of serving approximately 35,000 students, the majority of whom are students of color. Long Beach City College is a Hispanic serving institution, and of our student population 53% are Hispanic/Latinx, 14% are White, 13% are African American, 11% are Asian &amp; Filipino. An ideal candidate will demonstrate cultural competency in serving the diverse academic, socio economic, gender identity, sexual orientation, racial, and cultural backgrounds of community college student populations, including students with differing abilities (physical and/or learning). For more information on our College demographics please click here: https://www.lbcc.edu/pod/lbcc-college-facts<br/><br/><strong>About The Position<br/><br/></strong>Under the general supervision of the Vice President, Human Resources, plan, organize, coordinate and direct the operations of a District-wide human resources program including functions of collective bargaining, employee/employer relations, academic recruitment and hiring processes, staff equity and diversity, Human Resources information systems management, unlawful discrimination, ADA accommodations, and other related human resources functions.<br/><br/>DISTINGUISHING CHARACTERISTICS<br/><br/>The Associate Vice President is responsible for leadership, direction, supervision, and evaluation of programs and services as assigned and will provide general staff support to the instructional programs of the college. The Associate Vice President serves as a college-wide administrative officer. The Associate Vice President provides opportunity for involvement and collaboration by staff as appropriate in consideration and discussion of the development of policy, procedures, and programs. The leadership, supervision, planning, implementation, and coordination of responsibilities entails working with faculty, staff, students, and appropriate college committees to ensure instructional goals and delivery systems are meeting student-learning needs and are in alignment with district goals and objectives. In addition, the Associate Vice President functions effectively as a member of an administrative team; works equitably with and evidences sensitivity toward persons at all levels of the college.<br/><br/>COLLEGE MISSION<br/><br/>Long Beach City College is committed to providing equitable student learning and achievement, academic excellence, and workforce development by delivering high-quality educational programs and support services to our diverse communities. We are Purposeful, Focused, Nurturing, Connected and Respectful.<br/><br/>Equal Employment Opportunity Plan (Download PDF reader)<br/><br/>Strategic Plan (Download PDF reader)<br/><br/>Office of the Superintendent President<br/><br/>At Long Beach City College, we celebrate equity, diversity and ensure a positive and inclusive working environment for all college students, faculty, staff, and administrators. We believe diversity fosters awareness, promotes mutual understanding and respect, and provides suitable role models for our students. We are committed to the principles of equal employment opportunity and to hiring qualified applicants who are dedicated to student learning and success.<br/><br/>Duties<br/><br/><strong>Position Responsibilities<br/><br/></strong>Assist in legal issues related to labor relations and employee relations. Prepare or propose District responses regarding discipline, or grievance issues.<br/><br/>Serve as the District's ADA/504, unlawful discrimination compliance officer, oversight of the District's Sexual Misconduct Policy and Procedures including conducting investigations, bringing resolution and preparing appropriate reports for submittal to appropriate individuals and the Chancellor's Office.<br/><br/>Administer assigned collective bargaining agreements to ensure consistent District-wide implementation; counsel District managers, supervisory personnel and others on interpretation of collective bargaining agreements; conduct in-service training for managers and supervisors in contract provisions as needed.<br/><br/>Manage academic employee relations function of the District including the counseling of managers, supervisors and employees on matters concerning all job performance issues, reasonable accommodation requests, and complaints as well as review and make recommendations regarding proposed personnel actions.<br/><br/>Supervise the collection of salary survey data to recommend specific salary schedule placement for bargaining positions with respect to competitive positions within the local area and community college districts statewide.<br/><br/>Direct the development, coordination, and maintenance of the human resources information systems.<br/><br/>Represent the District in court, at hearings and on related administrative, personnel and other committees and commissions appropriate to assigned functional areas.<br/><br/>Counsel, coach and train District management personnel and others on the relevance of federal and state laws affecting assigned functional areas.<br/><br/>Assist with the development, revision, interpretation and administration of personnel related Board policies, and administrative rules, regulations, and procedures.<br/><br/>Develops, manages, and/or directs the District's human resources organizational planning, including development of the Human Resources Program Plan, management succession planning, and mentor/internship programs.<br/><br/>Conducts or coordinates academic employee orientations and in-service workshops on human resources related topics.<br/><br/>Directs the District's faculty and staff diversity program and fair employment practices including the development, implementation, and administration of the faculty and staff diversity plan and associated state reporting requirements.<br/><br/>Identify, communicate and make recommendations regarding trends in human resources.<br/><br/>Prepare reports on a range of human resources subjects for consideration; coordinate and supervise the collection and analysis of employment, salary, and benefit and assignment information for personnel reporting purposes.<br/><br/>Perform human resources research and special studies as directed.<br/><br/>Train, supervise and evaluate assigned staff; recommend personnel actions including disciplinary actions and dismissals.<br/><br/>May serve as chief negotiator for collective bargaining units; review and render decisions on grievances/complaints filed by academic staff.<br/><br/>Perform related duties as assigned.<br/><br/>SUPERVISORY RELATIONSHIP<br/><br/>This position reports to the Vice President, Human Resources, and supervises and evaluates assigned staff.<br/><br/>PERSONNEL<br/><br/>Responsible for effectively recommending the hire, transfer, suspension, lay-off, promotion, assignment, discipline, training, direction and timely evaluation of work, and adjustment of grievances of all assigned staff; administering collective bargaining agreements, employment and promotion selection procedures, and compliance with District policies, rules and regulations regarding personnel; providing direction and assistance wherever a need for improvement is identified.<br/><br/><strong>Qualifications<br/><br/></strong>MINIMUM QUALIFICATIONS<br/><br/>Master's degree from an accredited institution, or possession of a valid California Community College Supervisory Credential, AND<br/><br/>One year of formal training, internship, or leadership experience reasonably related to the administrative assignment, AND<br/><br/>Evidence of a sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.<br/><br/><strong>Desired Qualifications<br/><br/></strong>A juris doctorate is desirable.<br/><br/>Five years of experience in the management of a mid-to large sized human resources operation, with increasing responsibility, which includes oversight of labor relations and equal employment opportunity programs.<br/><br/>Knowledge of equal employment opportunity, laws, regulations, and judicial opinions.<br/><br/>Experience in collective bargaining, contract interpretation and administration, conflict resolution and mediation.<br/><br/>Experience in evaluating, revising, and administering Board Policies and Administrative Regulations pertaining to human resources management.<br/><br/>Experience in participatory governance, leadership, decision-making and communication with diverse constituencies.<br/><br/>Demonstrated record of fiscal responsibility and accountability, including experience in managing a budget.<br/><br/>Demonstrated ability to communicate effectively both verbally and in writing.<br/><br/><strong>Knowledge And Abilities<br/><br/></strong>Knowledge of:<br/><br/>Employee relations techniques and methods.<br/><br/>Information systems management and current methods of compiling and analyzing data.<br/><br/>Laws, practices and techniques of collective bargaining, employee and labor relations.<br/><br/>Principles and practices of discipline, grievance handling, mediation, and arbitration.<br/><br/>Principles and trends of human resources administration, employee recruitment and selection practices, fair employment practices, collective bargaining, employee/employer relations, staff equity and diversity, and EEO compliance.<br/><br/>Principles of organizational development and management.<br/><br/>Relevant federal and state legislation, regulations and policies.<br/><br/>Knowledge of Faculty and Staff Diversity and Equity programs and associated laws.<br/><br/>ABILITY TO<br/><br/>Analyze data and information, reason logically and develop alternative solutions effectively both orally and in writing.<br/><br/>Analyze, interpret and explain laws, rules, regulations and contracts.<br/><br/>Coordinate assigned technical personnel functions with other District operational activities such as workers' compensation, load scheduling and payroll matters.<br/><br/>Provide a high level of service and work effectively and cooperatively with other faculty and staff as well as outside individuals and entities.<br/><br/>Train, coach, supervise and evaluate assigned staff.<br/><br/>LICENSE AND/OR CERTIFICATE<br/><br/>Possession of, or ability to obtain an appropriate valid California Driver's License.<br/><br/>Additional Information<br/><br/><strong>Application Requirements<br/><br/></strong>Long Beach City College only considers complete applications for employment. All application materials must be electronically submitted and uploaded by the applicant by the application deadline. Applications are initially screened for completeness and State Minimum Qualifications. Complete applications are forwarded to the Department hiring committee for further review.<br/><br/><strong>a Complete Application Includes<br/><br/></strong>A Long Beach Community College District application<br/><br/>A cover letter outlining your education and experience relevant to this position<br/><br/>A list of three references, including current telephone numbers of both colleagues and supervisors<br/><br/>A current resume or CV<br/><br/>ALL graduate and undergraduate transcripts, showing school name, all college coursework, degree title and conferral date. This includes transcripts for any and all for the following degrees, BA/BS, MA/MS and above (Ed.D., Ph.D., etc.) and courses used for transfer credit. Transcripts can be official or unofficial and must be submitted as an attachment. The conferral date must be on or before the application deadline in order to meet Minimum Qualifications.<br/><br/>Transcripts from countries other than the United States must be evaluated by an agency that is a member of the National Association of Credentials Evaluation Services (NACES) or Association of International Credential Evaluators, Inc (AICE).<br/><br/><strong>Selection Process And Schedule<br/><br/></strong>**Please note that this schedule is tentative and subject to change**<br/><br/>Application deadline: 08/14/24<br/><br/>Application screening: 08/15/24<br/><br/><strong>Applications Are Initially Screened For Completeness And Minimum Qualifications.<br/><br/></strong>First level interview: Between 9/9/24-9/13/24<br/><br/>Final interview: tentatively planned for: Week of 9/25/24<br/><br/>DISABILITY ACCOMMODATIONS<br/><br/>Individuals who require reasonable accommodations in the Application or Examination Process in accordance with ADA should notify the Human Resources Office at least two days prior to the closing date, by calling (562) 938-4372.<br/><br/>LONG BEACH CITY COLLEGE IS AN EQUAL OPPORTUNITY EMPLOYER<br/><br/>The Long Beach City College is committed to the principles of equal employment opportunity and equity-minded hiring practices. It is the District's policy to ensure that all qualified applicants for employment and employees have full and equal access to employment opportunities and are not subject to discrimination in any program or activity of the District on the basis of ethnic group identification, race, gender, color, language, accent, citizenship status, ancestry, national origin, age, sex, religion, sexual orientation, gender identity, parental status, marital status, veteran status, physical or mental disability or medical condition, or on the basis of these perceived characteristics.<br/><br/>LAND ACKNOWLEDGEMENT<br/><br/>Long Beach City College acknowledges our presence on the traditional ancestral land of the Gabrielino/Tongva peoples. This land remains unceded territory. We acknowledge the painful history of genocide and forced removal from this territory. Long Beach City College honors and respects the Gabrielino/Tongva ancestors and their connection to this land. MINIMUM QUALIFICATIONS Master's degree from an accredited institution, or possession of a valid California Community College Supervisory Credential, AND One year of formal training, internship, or leadership experience reasonably related to the administrative assignment, AND Evidence of a sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.", "postedDate": "1 month ago", "qualifications": {"required": "Master's degree from an accredited institution, or possession of a valid California Community College Supervisory Credential, AND\nOne year of formal training, internship, or leadership experience reasonably related to the administrative assignment, AND\nEvidence of a sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.", "preferred": "A juris doctorate is desirable.\nFive years of experience in the management of a mid-to large sized human resources operation, with increasing responsibility, which includes oversight of labor relations and equal employment opportunity programs.\nKnowledge of equal employment opportunity, laws, regulations, and judicial opinions.\nExperience in collective bargaining, contract interpretation and administration, conflict resolution and mediation.\nExperience in evaluating, revising, and administering Board Policies and Administrative Regulations pertaining to human resources management.\nExperience in participatory governance, leadership, decision-making and communication with diverse constituencies.\nDemonstrated record of fiscal responsibility and accountability, including experience in managing a budget.\nDemonstrated ability to communicate effectively both verbally and in writing."}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3971279467"}