{"jobTitle": "Administrative Assistant", "company": {"name": "Conexess Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "IT Services and IT Consulting", "description": "Conexess Group is supporting a leading global law firm, advising clients on significant transactions and disputes. Our exceptional teams craft and deploy creative legal strategies that are meticulously tailored to every matter, however complex or high stakes. The firm’s work is distinguished by a unique combination of precision and vision.<br/><br/>Based in Los Angeles, the Administrative Assistant - Finance will support the finance and billing department by providing administrative support in project management tasks, materials preparation, and information gathering.<br/><br/>The Administrative Assistant - Finance will report to the Finance Director.<br/><br/>Responsibilities include:<br/><br/><ul><li>Drafting emails for distribution by management to partners and tracking responses. </li><li>Coordinating, scheduling, and calendaring of meetings, trainings and other activities (virtual and in office). </li><li>Assisting with onboarding of new hires by preparing onboarding and training materials and coordinating training schedules and system access. </li><li>Drafting informational and educational materials and emails for the Billing Department. </li><li>Assisting the Finance team with preparing presentations. </li><li>Preparing ad hoc reports as requested to support the Finance and Billing departments. <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Strong interpersonal and customer service skills as well as the ability to use good judgment in handling tasks with limited supervision in a timely manner. </li><li>Candidate must be proactive, resourceful and solutions oriented. </li><li>Superior attention to detail, strong organizational skills and an ability to multi-task and prioritize are required. </li><li>A commitment to quality, teamwork, and flexibility with a mindset of continuous improvement are critical to success in this position. </li><li>Candidate must have strong technology skills, including intermediate level Excel and PowerPoint, and an ability to easily adapt to new systems and technology solutions. <br/><br/></li></ul>Experience:<br/><br/><ul><li>A college degree is preferred but not required. </li><li>1+ year of administrative experience is required, prior experience in law firm environment is a plus. <br/><br/></li></ul>Conexess will consider for employment qualified Applicants with Criminal Histories in a manner consistent with the requirements of local law.<br/><br/>Compensation &amp; Benefits:<br/><br/>The annual compensation range for this position is $45,000 – $55,000. The salary offered within this range will depend upon qualifications and other operational considerations.<br/><br/>Benefits offered for this position include health care; retirement benefits; paid days off, including sick time, and vacation time; parental leave; basic life insurance; Flexible Spending Accounts; as well as discretionary, performance-based bonuses.<br/><br/>", "postedDate": "2 weeks ago", "salary": {"amount": "$45,000 – $55,000", "currency": "USD"}, "benefits": "The annual compensation range for this position is $45,000 – $55,000. The salary offered within this range will depend upon qualifications and other operational considerations.<br/><br/>Benefits offered for this position include health care; retirement benefits; paid days off, including sick time, and vacation time; parental leave; basic life insurance; Flexible Spending Accounts; as well as discretionary, performance-based bonuses.<br/><br/", "qualifications": {"required": "Strong interpersonal and customer service skills as well as the ability to use good judgment in handling tasks with limited supervision in a timely manner. \nCandidate must be proactive, resourceful and solutions oriented. \nSuperior attention to detail, strong organizational skills and an ability to multi-task and prioritize are required. \nA commitment to quality, teamwork, and flexibility with a mindset of continuous improvement are critical to success in this position. \nCandidate must have strong technology skills, including intermediate level Excel and PowerPoint, and an ability to easily adapt to new systems and technology solutions. <br/><br/>\n1+ year of administrative experience is required, prior experience in law firm environment is a plus. <br/><br/>", "preferred": "A college degree is preferred but not required."}, "skills": ["Excel", "PowerPoint", "Customer Service", "Communication", "Problem Solving", "Organization", "Teamwork", "Time Management"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971721401"}