{"jobTitle": "Ocean Import Coordinator freight forwarding (Mandarin/English)", "company": {"name": "Amrecco", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Diamond Bar, CA"}, "location": "Diamond Bar, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$27-$29/hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Growing freight forwarding company is looking for an Ocean Import Coordinator for their office in LA, CA. You will work with a great team and have an excellent opportunity to grow within the company. This is a full-time position (not remote).", "responsibilities": "Team Management: Assist the Operation Manager in day-to-day Logistics operations. Shipment Coordination: Coordinate and manage the end-to-end logistics process for shipments. Documentation Management: Ensure that all required shipping documentation, including arrival notices and bills of lading are accurate, complete, and submitted on time. Freight Release: Ensure payment and bill of lading received and coordinate freight release with freight cashier. Cargo Tracking: Monitor and track shipments in real-time to ensure timely movement, delivery, and empty return. Customer Communication: Provide regular updates to customers on the status of their shipments and address any inquiries or concerns promptly and professionally. Vendor Communication: Coordinate with carriers, truckers, origin agents, and other relevant stakeholders to ensure timely and accurate information exchange throughout the import process. Invoicing: Generate and issue invoices to customers. Perform other tasks that contribute to the overall goals of the company.", "qualifications": {"required": "2+ years’ experience in Ocean Import freight with an NVOCC/Freight Forwarder is required. Legal US working status. Excellent written and verbal knowledge in English. Must be proficient in Microsoft office (Excel, Outlook).", "preferred": "Ability to speak/read Mandarin would be required."}, "skills": ["Ocean Import freight", "NVOCC", "Freight Forwarder", "GoFreight system", "Microsoft Office", "Customer Communication", "Vendor Communication"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "health, dental, vision, PTO, commission", "remoteWork": "Not remote", "url": "https://www.linkedin.com/jobs/view/3971947748"}