{"jobTitle": "SoCal General Manager", "company": {"name": "Boulton & Watt", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Meadow Memorials is a contemporary funeral home offering simple cremations, personalized memorials, and transparent pricing. We are completely ‘virtual’ partnering with the city’s best venues to provide a new level of service.<br/><br/>It’s the second company from Boulton &amp; Watt's experienced founding team, which most recently started Moxie, and previously led large teams at Stripe and sold Thinkful for $100m.<br/><br/><ul><li>Responsible for overall market performance, including revenue and service delivery. </li></ul><ul><li>Build relationships with supplier vendors (including crematories, transportation, venues, events) and improve quality through deep partnership</li><li>Represent and grow the brand with partners through presentation, including hospice and senior living</li><li>Strengths we’re looking for:</li><ul><li>Ability to get stuff done, fast. </li><li>Ability to build meaningful relationships</li><li>Analytical problem solving - you will be facing many ambiguous problems. </li><li>Organizational capabilities, leaving a system behind your wake. </li></ul><li>Experiences we’re looking for:</li><ul><li>This role is most comparative to a market manager for Doordash or Uber back in the early days, but on a much more meaningful problem. </li><li>Ideal candidates might come from a consulting or operational background. Experience in a retail or physical setting is a huge plus but not required. </li><li>4-10 years of experience<br/></li></ul></ul>You’ll partner deeply with our Head of Customer Experience, Head of Marketing, and Head of Engineering to build long term solutions that scale across markets. If done well, this role will either expand geographically or take a more horizontal operational leadership role across the company. You’ll report to the CEO.<br/><br/>Compensation Range: $125K - $160K<br/><br/>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3971394833"}