{"jobTitle": "Executive Administrative Assistant", "company": {"name": "Sphere Entertainment Co.", "industry": "Entertainment Providers", "size": "Not specified", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000—$125,000", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "Sphere Entertainment Co. (NYSE: SPHR) is a premier live entertainment and media company. The Company includes Sphere, a next-generation entertainment medium powered by cutting-edge technologies to redefine the future of entertainment. The first Sphere venue in Las Vegas opened in September 2023. In addition, the Company includes MSG Networks, which operates two regional sports and entertainment networks, MSG Network and MSG Sportsnet, as well as a direct-to-consumer and authenticated streaming product, MSG+, delivering a wide range of live sports content and other programming. More information is available at sphereentertainmentco.com.\n\nWho are we hiring? \n\nThe Executive Administrative Assistant is responsible for performing administrative duties of advanced degrees of complexity for the Head of Sphere Studios. These functions include managing correspondence which is often of a confidential nature, preparing research, screening incoming phone calls and mail, communication on behalf of the Head of Sphere Studios, and acting as the \"gatekeeper;\" as well as handling more complicated special projects such as designing and preparing presentations, coordination of complex meetings or travel. In keeping with these duties, The EA will be required to develop an acute understanding of the Head of Sphere Studios’ work style, requirements, and preferences, and to utilize this understanding to manage the Head of Sphere Studios’ calendars. The EA is expected to accept the delegation of less consequential executive tasks, to perform those tasks with minimal disruption to the Head of Sphere Studios, to actively listen and resolve problems, and to anticipate and meet the challenges of a fast-paced environment. In summary, the EA is expected to conform to the highest standards of performance, dependability, and professionalism.\n\nWhat will you do? \n\n- Maintains close and highly responsive relationship to day-to-day activities of the Head of Sphere Studios and other key members of the company.\n- Coordinate and arrange Executive’s meetings and schedules in an always shifting schedule.\n- Manage schedules and workdays across east and west coast offices\n- Monitor travel schedule and adjust when needed\n- Prepare and distribute meeting agendas and take and distribute meeting notes\n- Work collaboratively with the other EA’s to ensure Senior Leadership receives necessary information and support\n- Acts as liaison between the Head of Sphere Studios and their direct reports, as well as internal and external contacts.\n- Anticipate all contingencies and be strategic in prioritizing tasks undertaken. \n- Work as part of a high touch team by providing regular communication and fostering a high level of collaboration, teamwork and cooperation. \n- Carry out regular and continual review of emails, phone calls, and other forms of correspondence and then identify the appropriate follow up action. \n- Coordinates all paperwork necessary for the Executives to approve. This may include, but is not limited to: travel and expenses, personnel requisitions, performance appraisals, personnel action forms (PAF) and authorization payment forms (APF). Follows up with other departments to ensure that requests are carried out and activities are coordinated\n- Prepare comprehensive travel itineraries and contact lists specific to each trip and orchestrate all necessary arrangements. \n- Prepares and proofreads correspondence, reports and other materials.\n- Manage sensitive, highly confidential, and proprietary information with discretion and the utmost level of confidentiality. \n- This individual will need to be available outside of normal business hours in order to accommodate required schedules.\n\nWhat do you need to succeed? \n\n- Candidates must have a minimum of 10+ years hands on experience expediting projects in support of a Senior executive in a complex organization, preferably within the entertainment industries. \n- The ideal candidate must be highly flexible, stress tolerant and motivated, with an ability to work independently as well as in a team setting. \n- Excellent knowledge, with proven experience with Microsoft Office and other software applications, specifically Word, Excel, PowerPoint, Outlook, Concur, and Coupa, etc.\n- Proven logical skills, well organized and detail oriented with the ability to multi-task and have a proven track record as a strategic thinker capable of foreseeing impacts of simultaneous projects.\n- Experience managing a highly changeable calendar with extreme tact and diplomacy. \n- Demonstrated ability to quickly learn the organizational structure and the objectives of the team as well as dealing with complexity and ambiguity within a large, matrixed organization.  \n- Able to maintain confidentiality and professionalism at all times.  \n- Strong judgment, decision making, time management, and prioritizing skills. \n- Must be energetic, positive, outgoing, and resourceful.\n- Must be flexible to work overtime on short notice\n- Ability to work a flexible schedule inclusive of days, nights, weekends and holidays.", "responsibilities": "Maintains close and highly responsive relationship to day-to-day activities of the Head of Sphere Studios and other key members of the company. Coordinate and arrange Executive’s meetings and schedules in an always shifting schedule. Manage schedules and workdays across east and west coast offices. Monitor travel schedule and adjust when needed. Prepare and distribute meeting agendas and take and distribute meeting notes. Work collaboratively with the other EA’s to ensure Senior Leadership receives necessary information and support. Acts as liaison between the Head of Sphere Studios and their direct reports, as well as internal and external contacts. Anticipate all contingencies and be strategic in prioritizing tasks undertaken. Work as part of a high touch team by providing regular communication and fostering a high level of collaboration, teamwork and cooperation. Carry out regular and continual review of emails, phone calls, and other forms of correspondence and then identify the appropriate follow up action. Coordinates all paperwork necessary for the Executives to approve. This may include, but is not limited to: travel and expenses, personnel requisitions, performance appraisals, personnel action forms (PAF) and authorization payment forms (APF). Follows up with other departments to ensure that requests are carried out and activities are coordinated. Prepare comprehensive travel itineraries and contact lists specific to each trip and orchestrate all necessary arrangements. Prepares and proofreads correspondence, reports and other materials. Manage sensitive, highly confidential, and proprietary information with discretion and the utmost level of confidentiality. This individual will need to be available outside of normal business hours in order to accommodate required schedules.", "qualifications": {"required": "Candidates must have a minimum of 10+ years hands on experience expediting projects in support of a Senior executive in a complex organization, preferably within the entertainment industries. The ideal candidate must be highly flexible, stress tolerant and motivated, with an ability to work independently as well as in a team setting. Excellent knowledge, with proven experience with Microsoft Office and other software applications, specifically Word, Excel, PowerPoint, Outlook, Concur, and Coupa, etc. Proven logical skills, well organized and detail oriented with the ability to multi-task and have a proven track record as a strategic thinker capable of foreseeing impacts of simultaneous projects. Experience managing a highly changeable calendar with extreme tact and diplomacy. Demonstrated ability to quickly learn the organizational structure and the objectives of the team as well as dealing with complexity and ambiguity within a large, matrixed organization. Able to maintain confidentiality and professionalism at all times. Strong judgment, decision making, time management, and prioritizing skills. Must be energetic, positive, outgoing, and resourceful. Must be flexible to work overtime on short notice. Ability to work a flexible schedule inclusive of days, nights, weekends and holidays.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "At MSG, we recognize the importance of upskilling employees’ talents and strengths so they can drive their careers forward. We are proud to offer a robust set of tools and resources to help employees understand their interests and purpose, harness their talents and obtain the skills they need to reach the next step in their careers. Growth and longevity for our employees are top priorities here.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3971168930"}