{"jobTitle": "Accounts Payable Clerk", "company": {"name": "Conexess Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Accounting/Auditing and Finance", "industry": "IT Services and IT Consulting", "description": "Conexess Group is supporting a leading global law firm, advising clients on significant transactions and disputes. Our exceptional teams craft and deploy creative legal strategies that are meticulously tailored to every matter, however complex or high-stakes. The firm's work is distinguished by a unique combination of precision and vision.<br/><br/>Based in Los Angeles, the Accounts Payable Clerk will be an integral part of the Accounting team.<br/><br/>This role reports to the Manager of Accounting.<br/><br/><strong>Responsibilities include:<br/><br/></strong><ul><li>Onboard new vendors in compliance with internal controls, fraud prevention best practices, and tax requirements. </li><li>Support internal firm personnel and external vendors with invoice and payment inquiries, providing a high level of customer service. </li><li>Work with firm personnel and external vendors to review vendor statements and address past due invoices. </li><li>Assist with payment processing, including obtaining proper approvals and following special handling instructions. </li><li>Transition vendors currently paid by check to ACH, the firm's preferred payment method. </li><li>Utilize CMS Aderant (ERP system) and Chrome River software to assist with accounts payable processing as needed, including high volume E-Invoice processing. </li><li>Enforce firm practices, policies, and procedures as they relate to accounts payable. </li><li>Test accounting and third party software programs during periodic system upgrades. </li><li>Work closely with accounting management team on special projects and ad hoc requests as needed. </li><li>Identify and implement opportunities for process improvements in order to increase efficiency. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>The ideal candidate is self-motivated, detail oriented, and is effective in problem solving. </li><li>The candidate must be committed to quality, customer service, teamwork, and supporting department goals. </li><li>This position requires strong written and verbal communication skills, superior attention to detail, excellent organizational skills, and the ability to multi-task and prioritize. </li><li>Must have strong technology skills, including Microsoft Outlook, Excel, and Word experience, with the ability to master and leverage accounting and legal technology solutions. </li><li>The ideal candidate is thorough, accurate, and monitors their own work to ensure quality. </li><li>Ability to work overtime as needed. <br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>2+ years of accounts payable experience, with law firm experience preferred</li><li>Work history with Chrome River and/or CMS Aderant software a plus</li><li>College degree or classes in Accounting, Business, or Finance preferred<br/><br/></li></ul>", "responsibilities": "Onboard new vendors in compliance with internal controls, fraud prevention best practices, and tax requirements. Support internal firm personnel and external vendors with invoice and payment inquiries, providing a high level of customer service. Work with firm personnel and external vendors to review vendor statements and address past due invoices. Assist with payment processing, including obtaining proper approvals and following special handling instructions. Transition vendors currently paid by check to ACH, the firm's preferred payment method. Utilize CMS Aderant (ERP system) and Chrome River software to assist with accounts payable processing as needed, including high volume E-Invoice processing. Enforce firm practices, policies, and procedures as they relate to accounts payable. Test accounting and third party software programs during periodic system upgrades. Work closely with accounting management team on special projects and ad hoc requests as needed. Identify and implement opportunities for process improvements in order to increase efficiency.", "qualifications": {"required": "The ideal candidate is self-motivated, detail oriented, and is effective in problem solving. The candidate must be committed to quality, customer service, teamwork, and supporting department goals. This position requires strong written and verbal communication skills, superior attention to detail, excellent organizational skills, and the ability to multi-task and prioritize. Must have strong technology skills, including Microsoft Outlook, Excel, and Word experience, with the ability to master and leverage accounting and legal technology solutions. The ideal candidate is thorough, accurate, and monitors their own work to ensure quality. Ability to work overtime as needed.", "preferred": "2+ years of accounts payable experience, with law firm experience preferredWork history with Chrome River and/or CMS Aderant software a plusCollege degree or classes in Accounting, Business, or Finance preferred"}, "skills": ["Customer Service", "Microsoft Excel", "Microsoft Word", "Accounting", "Vendor Management", "Invoice Processing", "Payment Processing", "Internal Controls", "Fraud Prevention", "Tax Requirements", "ERP Systems", "Chrome River", "CMS Aderant", "Process Improvement", "Problem Solving", "Teamwork", "Communication", "Technology Skills", "Quality Assurance", "Overtime"], "postedDate": "5 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971175574"}