{"jobTitle": "Early Phase Opportunities for Veteran/Military Talent", "company": {"name": "Parexel", "industry": "Pharmaceutical Manufacturing", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Pharmaceutical Manufacturing", "description": "Parexel is a Clinical Research Organization (CRO) dedicated to supporting, developing and retaining a diverse, best-in-class workforce that is inclusive of veteran and military spouse talent. We know ‘serving’ is a core value of many of our military community. At Parexel, you can continue on your mission to serve, by joining an organization dedicated to improving the lives of patients worldwide. The skills and values you have developed in your military career or as a military spouse are transferrable to meaningful careers here at Parexel. In fact, we have many colleagues who have found success in information technology, data analytics, clinical operations, logistics, and more.<br/><br/>With your prior experience in the military comes specialized expertise, the ability to lead others, and an understanding of the value of teamwork. The skills that you’ve acquired over time can be transferrable to roles at Parexel, and an asset to the way we support clinical trials — through our internal infrastructure or “boots on the ground” in clinical sites.<br/><br/><strong>Skills<br/><br/></strong>Our Early Phase Clinical units provide unique opportunities for you to apply your skills and truly make an impact with patients in positions such as:<br/><br/><ul><li>Research Associate: onsite Glendale, CA</li><li>Research Nurse: onsite Glendale, CA</li><li>Enrollment Specialist: onsite Glendale, CA</li><li>Laboratory Technician: onsite Glendale, CA</li><li>Early Phase Clinical Project Manager: onsite Glendale, CA or Remote<br/><br/></li></ul>If you are interested in joining Parexel, an organization with like-minded individuals, who share a mission to put patient’s first, please apply to this job posting for direct consideration. You can find more information on our Military Talent Community here: https://jobs.parexel.com/en/veteran-community", "postedDate": "5 days ago", "skills": ["Information Technology", "Data Analytics", "Clinical Operations", "Logistics"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3971409200"}