{"jobTitle": "Clip Clearance Producer", "company": {"name": "TMZ", "industry": "Media Production", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Media Production", "description": "TMZ is seeking a Clip Clearance Producer to join our team. The ideal candidate will be responsible for acquiring, negotiating, costing, and clearing rights on behalf of TMZ. This position requires someone who is adept at obtaining permissions for photo/video use on web and television platforms. The Clip Clearance Producer must have a sharp eye for pop culture news and be comfortable communicating with photo/video distribution companies to secure assets for production. This role will interact daily with other Clearance staff, Production/Accounting staff, and our Legal department.", "responsibilities": "Oversee agency videos and offers to create content for web and television. Assist Associate Producers with daily show needs. Contact third parties and news outlets to get permission or license photos/videos. Work with tipsters and contacts to obtain assets for TMZ. Develop contacts, cultivate sources, and maintain relationships to aid in securing future assets.", "qualifications": {"required": "Bachelor’s degree in Journalism, Communications, or related field; 3-5 years of progressive experience working in series or news television; Ability to negotiate and execute licenses and other contracts; Knowledge of celebrity news, pop culture & current events; Strong telephone/communication skills; Ability to negotiate and execute licenses and other contracts.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Medical/dental/vision insurance, 401(k) plan, paid time off, and other benefits in accordance with applicable plan documents.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3971860522"}