{"jobTitle": "Assistant Sales Associate- Orange County", "company": {"name": "Jackson Family Wines", "industry": "Beverage Manufacturing", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Beverage Manufacturing", "description": "Position at Regal Wine Company<br/><br/>Position Title: Assistant Sales Associate – Royal Division<br/><br/>Department: Sales<br/><br/>Reports to: District Manager – Royal Division<br/><br/>Regal Wine Company; a luxury wine distributor, that provides exceptional service and encompasses a world class wine portfolio of authenticity and integrity. We take pride in our people and are committed to cross functional training and development of our employees for a long-term career within the organization. We believe that diversity, equity, and inclusion drive our best innovation, enrich our employees, and connect us to our customers and global community. We aspire to evolve in our commitment for a better future and one that is rooted for good.<br/><br/>ESSENTIAL DUTIES/RESPONSIBILITIES:<br/><br/><ul><li>Assistant Sales Associate will support the Account Sales Executives in key chain accounts in assigned district </li><li>Maintain 100% shelf distribution of all authorized items of each account and sell in new item distribution, direct store delivery items and new products </li><li>Communicate current pricing information and ensure all pricing is correct on displays and in accounts </li><li>Build and merchandise displays, fill shelves and cold boxes, and maintain Royal Wine Company merchandising standards </li><li>Establish and maintain rapport with store managers, liquor department managers and other store personnel </li><li>Prioritize and plan account activities by completing preplans and recaps to District Manager </li><li>Attend and contribute to team meetings, participate in reviewing goals and develop execution plans </li><li>Responsible for carrying company cell phone and point of sales materials in vehicle during work hours </li><li>Continue to develop wine knowledge, business acumen and sales skills to increase professional acumen </li><li>Other duties as to be assigned by Royal District or Region Manager <br/><br/></li></ul>JOB REQUIREMENTS:<br/><br/><ul><li>Candidate must be at least 21 years of age </li><li>Must possess a current driver’s license; maintain current auto insurance coverage and a clean driving record </li><li>Available to work early morning hours, Monday to Friday </li><li>Ability to travel within California up to 6 times per year, out of the territory, for education and training </li><li>Able to repetitively lift a minimum of 50 lbs; be able to bend, squat, climb, kneel, twist and lift repetitively </li><li>Candidate must be willing to reside within territory <br/><br/></li></ul>Pay Range: $20.00 per hour<br/><br/>In addition to the hourly wage, the Account Sales Executive is eligible for a discretionary bonus, a $500 a month auto allowance, gas card for business, company issued cell phone, paid home internet (up to $50/month), expense account and other sales incentives.<br/><br/>Benefits:<br/><br/><ul><li>Health Benefits – Medical, Dental, Vision, Disability &amp; Life insurance </li><li>401k with employer match </li><li>Vacation accrual; 12 paid holidays; 72 hours for Health &amp; Wellness </li><li>Paid volunteer time - 16 hours per year </li><li>Learning &amp; Development opportunities </li><li>Modern Health virtual mental health &amp; coaching visits </li><li>Wine Discounts! <br/><br/></li></ul>At Jackson Family Wines, we respect, celebrate, and take pride in each other’s differences. Together we nurture a culture that embraces fairness, acceptance and belonging. We believe that diversity, equity, and inclusion drive our best innovation, enrich our employees, and connect us to our customers and global community. We aspire to evolve in our commitment for a better future and one that is rooted for good.", "responsibilities": "Assistant Sales Associate will support the Account Sales Executives in key chain accounts in assigned district Maintain 100% shelf distribution of all authorized items of each account and sell in new item distribution, direct store delivery items and new products Communicate current pricing information and ensure all pricing is correct on displays and in accounts Build and merchandise displays, fill shelves and cold boxes, and maintain Royal Wine Company merchandising standards Establish and maintain rapport with store managers, liquor department managers and other store personnel Prioritize and plan account activities by completing preplans and recaps to District Manager Attend and contribute to team meetings, participate in reviewing goals and develop execution plans Responsible for carrying company cell phone and point of sales materials in vehicle during work hours Continue to develop wine knowledge, business acumen and sales skills to increase professional acumen Other duties as to be assigned by Royal District or Region Manager", "qualifications": {"required": "Candidate must be at least 21 years of age Must possess a current driver’s license; maintain current auto insurance coverage and a clean driving record Available to work early morning hours, Monday to Friday Ability to travel within California up to 6 times per year, out of the territory, for education and training Able to repetitively lift a minimum of 50 lbs; be able to bend, squat, climb, kneel, twist and lift repetitively Candidate must be willing to reside within territory"}, "skills": [], "postedDate": "1 month ago", "benefits": "Health Benefits – Medical, Dental, Vision, Disability &amp; Life insurance 401k with employer match Vacation accrual; 12 paid holidays; 72 hours for Health &amp; Wellness Paid volunteer time - 16 hours per year Learning &amp; Development opportunities Modern Health virtual mental health &amp; coaching visits Wine Discounts!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971188561"}