{"jobTitle": "Director - Business Management", "company": {"name": "NKSFB", "industry": "Accounting", "size": "650+ employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$175,000 - $225,000", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Accounting", "description": "NKSFB, LLC is the largest business management firm in the country, with more than 650 employees working from seven offices in the Los Angeles and New York City area. We work alongside the world’s top artists in music, film, and television, as well as athletes, executives, entrepreneurs, and other high achievers, offering a sophisticated range of concierge-style services to meet their lifestyle management needs.", "responsibilities": "Lead and manage one or more business management client service teams. Manage workflow, ensure deadlines are being met, and internal processes and procedures are being followed. Review financial statements, tax returns, cash flow reports, other financial reporting and client meeting packages. Prepare financial statement summaries as required for Partners. Assist Partners with special projects including, but not limited to real estate transactions, cash flow analysis, investment analysis, custom financial reporting, estate planning, insurance, and forecasting. Regular communication with Partners regarding client financial matters. Regular communication with clients to answer questions, fulfill requests, and provide financial advice when needed. Attend client financial meetings. Participate in management meetings and provide input on recruiting, client distribution, staff performance, and internal processes. Coordinate with the tax department on client tax matters. Other related duties as assigned.", "qualifications": {"required": "High School diploma required. Bachelor's degree in Accounting; or other related Business field preferred. Certified Public Accountant or Enrolled Agent preferred. 10-15 years of related experience in the Business Management field, and/or working with high-net-worth individuals.", "preferred": "Oral and written communication skills. Fluent command of English. Professionalism, time management, and organizational skills. Math aptitude. Understanding of Generally Accepted Accounting Principles. Financial Statement analysis experience. Entity and Individual Income Taxation experience. Intermediate level understanding of Finance, Real Estate, and Banking. Advanced bookkeeping competencies. Problem solving skills. Proficiency in Microsoft Office Suite. Previous experience in people management."}, "skills": ["Oral and written communication skills", "Fluent command of English", "Professionalism", "Time management", "Organizational skills", "Math aptitude", "Understanding of Generally Accepted Accounting Principles", "Financial Statement analysis", "Entity and Individual Income Taxation", "Intermediate level understanding of Finance, Real Estate, and Banking", "Advanced bookkeeping competencies", "Problem solving skills", "Proficiency in Microsoft Office Suite", "Previous experience in people management"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Medical, Dental and Vision coverage, Flexible Spending Account, Basic Life and AD&D, Voluntary Life and AD&D, Long Term Disability, Voluntary Critical Illness and Cancer, Hospital Indemnity and Accident Coverage, Genetic Screening and Cancer Support, Pet Insurance, Accrue 20 PTO days annually, 401k, Match and Profit Sharing Plan, 10 Paid Holidays and 1 Floating Holiday", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3971555768"}