{"jobTitle": "Hospital Supply Chain Manager*", "company": {"name": "San Bernardino County", "location": "Colton, CA"}, "location": "Colton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Government Administration", "description": "<strong>The Job<br/><br/></strong><strong>Arrowhead Regional Medical Center (ARMC)</strong> is looking for a strong, self-motivated individual to join our team as a <strong>Hospital Supply Chain Manager*. </strong>The Hospital Supply Chain Manager will plan, organize and direct the activities for a large supply operation including centralized ordering, receiving, storing, processing, packing, and issuing of a wide variety of healthcare supplies and equipment as part of a complex hospital supply chain. The position, through subordinates, controls a wide range of operations and activities pertaining to contracting, procurement, warehousing functions and delivery functions of equipment, materials and services.<br/><br/><strong>Official Job Title:</strong> Material Manager. Refer to the <strong> Material Manager </strong> job description for more details.<br/><br/><strong>ARROWHEAD REGIONAL MEDICAL CENTER<br/><br/></strong>Located on a beautiful 70-acre campus in Colton, California (50 miles east of Los Angeles), Arrowhead Regional Medical Center (ARMC) is a state-of-the-art, public/nonprofit, 456-bed, university affiliated teaching hospital licensed by the State of California Department of Public Health and accredited by The Joint Commission. The hospital houses a regional burn center serving four counties (San Bernardino, Riverside, Mono and Inyo), a comprehensive stroke center, level I trauma center and a freestanding in-patient behavioral health center. Additionally, ARMC operates five community-based, primary care clinics and over 40 specialty care outpatient services. ARMC is the primary teaching hospital for the adjacently located California University of Science and Medicine (CUSM), the Inland Empire's newest medical school. To learn more, watch our video at <strong> this link </strong> !<br/><br/><strong><strong>CONDITIONS OF EMPLOYMENT<br/><br/></strong></strong><strong><strong>Pre-Employment Process</strong>: </strong>Applicants selected for these positions must pass a background investigation, physical and verification of employment history and education.<br/><br/><strong><strong>Certification : </strong></strong> Applicants chosen for this position must possess a valid Healthcare Provider level Basic Life Support (BLS) certification at the time of hire.<br/><br/><strong> Please note: San Bernardino County is not able to consider candidates who will require visa sponsorship at the time of application or in the future. <br/><br/></strong><strong>Minimum Requirements<br/><br/></strong>Candidates must meet both of the following:<br/><br/><strong>Education: </strong>Bachelor's degree in Business Administration, Healthcare Administration, Public Administration, Purchasing, or a related field.<br/><br/>-AND-<br/><br/><strong>Experience: </strong>Three (3) years of experience in planning, organizing and direct the activities of a large operation including centralized ordering, receiving, storing, processing, packaging and issuing of a wide variety of supplies, equipment and services which include 18 months of supervisory experience.<br/><br/><strong>Desired Qualifications<br/><br/></strong>Candidates with supervisory experience, an aptitude for leadership and progressive healthcare supply chain experience in a large acute care hospital are desired. A Master's degree in Healthcare or Business Administration is highly desired.<br/><br/><strong>Selection Process<br/><br/></strong>There will be a <strong>competitive evaluation</strong> of qualifications based on the information provided in your Application and the Supplemental Questionnaire. The most highly qualified candidates, based on the evaluation results, will be referred for an interview. Be sure to include in your application and supplemental questions your experience in meeting the minimum requirements.<br/><br/><strong>Application Procedure</strong><strong>: </strong>Please complete and submit the online employment application and supplemental questionnaire as soon as possible as this recruitment may close at any time with or without notice. Resumes will not be accepted in lieu of the application and/or supplemental questionnaires.<br/><br/>To ensure timely and successful submission of your online application, please allow ample time to complete and submit your application before the posted filing deadline. Applicants will be automatically logged-out if they have not submitted the application and all required materials prior to the posted deadline. Once your application has been successfully submitted you will receive an onscreen confirmation and an email. We recommend that you save and/or print these for your records. Please note, if you do not receive an onscreen confirmation and an email acknowledging our receipt of your application we have not received your application.<br/><br/>If you require <strong>technical assistance</strong>, please click <strong>HERE</strong> to review the Government Jobs <strong>online application guide</strong> , or contact their Toll-Free Applicant Support line at (855) 524-5627. Please note that Human Resources is not responsible for any issues or delays caused by the internet connection, computer or browser used to submit the application.<br/><br/><strong>EEO/ADA: </strong>San Bernardino County is an <strong>Equal Employment Opportunity (EEO)</strong> and Americans with Disabilities Act (ADA) compliant employer, committed to providing equal employment opportunity to all employees and applicants.<br/><br/><strong>ADA Accommodation: </strong>If you have a disability and require accommodations in the testing process, submit the <strong>Special Testing Accommodations Request Form</strong> within one week of a recruitment filing deadline.<br/><br/><strong>Veterans’ Preference: </strong>Eligible veterans and their spouse or widow(er) who are not current County employees may be awarded additional Veterans’ Preference points. Click <strong>HERE</strong> for information and instructions to request Veteran's Preference points.<br/><br/><strong> Please click HERE for important Applicant Information and the County Employment Process</strong>", "postedDate": "1 month ago", "qualifications": {"required": "Candidates must meet both of the following:<br/><br/><strong>Education: </strong>Bachelor's degree in Business Administration, Healthcare Administration, Public Administration, Purchasing, or a related field.<br/><br/>-AND-<br/><br/><strong>Experience: </strong>Three (3) years of experience in planning, organizing and direct the activities of a large operation including centralized ordering, receiving, storing, processing, packaging and issuing of a wide variety of supplies, equipment and services which include 18 months of supervisory experience.", "preferred": "Candidates with supervisory experience, an aptitude for leadership and progressive healthcare supply chain experience in a large acute care hospital are desired. A Master's degree in Healthcare or Business Administration is highly desired."}, "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971788142"}