{"jobTitle": "Administrative Coordinator", "company": {"name": "Joni and Friends", "location": "Agoura Hills, CA"}, "location": "Agoura Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.50-24.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Internet Publishing", "description": "Under the supervision of the Executive Assistant, Marketing & Development, support the overall objectives of Joni and Friends’ Development & Marketing departments. Perform duties and responsibilities including, but not limited to:<br/><br/><strong>Duties<br/><br/></strong><ul><li>Work with Events team to assist the Development Officers and Donor Care teams and marketing teams in preparing tasks for our volunteers like hand notes, receipts, donor care, product packaging projects and file management and updates</li><li>Coordinate meals, gifts, tours for donor visits. This includes assisting the development officers in scheduling, planning meals if necessary, coordinating wrapping and delivering gifts and presentation materials</li><li>Assist Executive Admin in preparing and planning for department meetings, development and marketing meetings, celebrations and more. This includes room set up, presentation materials, travel plans and other tasks for meetings, trainings and academies</li><li>Assist Major Gift Officers and Events team with notes, gifts and communication for major in-person fundraising events throughout the year</li><li>Assist Development officers and Donor Care team on major development projects like Easter Cards, Thanksgiving Cards, and year end gifts and mailings</li><li>Assist Executive Admin in planning travel for the two teams (over 40 employees) as necessary for education conferences, Training events, team meetings, Story gathering trips, in-person events, etc. </li><li>Assist Directors with expense reports, processing invoices, and other monthly reports supporting the departments for timely submission to accounting</li><li>Other duties and projects as assigned by supervisor to support department and organizational needs<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Must possess a vibrant personal relationship with Jesus Christ and agree with the Joni and Friends statement of faith</li><li>Desire to serve in a growing and dynamic Christian service ministry</li><li>Minimum 2+ years experience supporting teams or groups of employees. </li><li>Educational requirements Bachelor’s Degree preferred but not required</li><li>Good interpersonal communication skills both verbal and written and the ability to effectively organize and prioritize a wide range of daily tasks with varied deadlines are necessary</li><li>Must be detail oriented, committed to accuracy, and team player who is flexible and able to work independently</li><li>Must have a strong sense of confidentiality</li><li>Strong general computer skills are necessary along with a competent, working knowledge of Windows, Microsoft Excel, Microsoft Word, Microsoft Outlook and the Internet</li><li>Understanding of Christian ministry and specifically Joni and Friends is desirable<br/><br/></li></ul>Compensation is $21.50-24.00 per hour. This is a hybrid position, in office Monday, Tuesday, and Thursday, remote Wednesday and Friday.<br/><br/>Prior to applying for any position with Joni and Friends, all applicants must review our Statement of Faith and Mission Statement (below).<br/><br/><strong>MINISTRY LIFE:<br/><br/></strong>Joni and Friends desire is to glorify God in the way we conduct ourselves, and in the work we do. Employment at Joni and Friends is not just a job but a calling from God to serve and share the gospel with people living with disabilities. We desire to see the local church become a place of belonging for every family living with disabilities. We want every employee to excel in their walk with Christ and at their job. We purposely create a ministry-wide prayer life environment and offer leadership, and general training to help employees “Lead like Jesus*” and perform their work with excellence.<br/><br/><strong>CHRISTIAN DISABILITY MINISTRY ENGAGEMENT:<br/><br/></strong>Every employee at Joni and Friends, regardless of their specific role is expected to grow and develop as a Christian Disability Ministry Leader (CDML). This implies a continuous journey of learning and involvement, where employees engage not only in Joni and Friends’ programs but also extend their ministry efforts to their local Christ-honoring churches. This core competency includes:<br/><br/><strong>Active Participation</strong> – Actively participate in ministry, both within the organization and their local Christ-honoring churches (if possible and to what degree they are able), advocating for participation of people with disabilities<br/><br/><strong>Continuous Growth </strong>– Besides Lead Like Jesus and Beyond Suffering trainings, continue to develop in the realm of disability ministry<br/><br/><strong>Culture of Belonging Approach</strong> – Encourage a culture of belonging ensuring that the needs of the disability community are addressed with grace and understanding<br/><br/><strong>Integration of Faith and Work</strong> – Ensure that Christian values are a driving force in all aspects of work<br/><br/><strong>Below outlines the Biblical Commission, Vision, Mission, and Values of Joni and Friends which employees are required to believe and uphold.<br/><br/></strong><strong>BIBLICAL COMMISSION:<br/><br/></strong>“Go out quickly in the streets and alleys of the town and bring in the poor, the crippled, the blind and the lame…go out to the roads and country lanes and compel them to come in, so that my house will be full.” Luke 14:21-23 (NIV)<br/><br/><strong>VISION: <br/><br/></strong>“A world where every person with a disability finds hope, dignity, and their place in the body of Christ.”<br/><br/><strong>MISSION:<br/><br/></strong>“To glorify God as we communicate the Gospel and mobilize the global church to evangelize, disciple and serve people living with disability.”<br/><br/>VALUES:<br/><br/><ul><li>Honor God in everything we do</li><li>Build relationships based on trust and respect</li><li>Maintain integrity and excellence in programs and services</li><li>Practice responsible stewardship</li><li> Lead Like Jesus is a course of study provided to all employees and is based on the book written by Ken Blanchard and Phil Hodges of the same name. The Lead Like Jesus course is the model which governs our ministry culture and contributes significantly to Joni and Friends maintaining its certification as a “Best Christian Workplace” according to surveys by the Best Christian Workplace Institute (BCWI)<br/><br/></li></ul>Powered by JazzHR<br/><br/>RRTg5xJeUU", "responsibilities": "Under the supervision of the Executive Assistant, Marketing & Development, support the overall objectives of Joni and Friends’ Development & Marketing departments. Perform duties and responsibilities including, but not limited to:<br/><br/><strong>Duties<br/><br/></strong><ul><li>Work with Events team to assist the Development Officers and Donor Care teams and marketing teams in preparing tasks for our volunteers like hand notes, receipts, donor care, product packaging projects and file management and updates</li><li>Coordinate meals, gifts, tours for donor visits. This includes assisting the development officers in scheduling, planning meals if necessary, coordinating wrapping and delivering gifts and presentation materials</li><li>Assist Executive Admin in preparing and planning for department meetings, development and marketing meetings, celebrations and more. This includes room set up, presentation materials, travel plans and other tasks for meetings, trainings and academies</li><li>Assist Major Gift Officers and Events team with notes, gifts and communication for major in-person fundraising events throughout the year</li><li>Assist Development officers and Donor Care team on major development projects like Easter Cards, Thanksgiving Cards, and year end gifts and mailings</li><li>Assist Executive Admin in planning travel for the two teams (over 40 employees) as necessary for education conferences, Training events, team meetings, Story gathering trips, in-person events, etc. </li><li>Assist Directors with expense reports, processing invoices, and other monthly reports supporting the departments for timely submission to accounting</li><li>Other duties and projects as assigned by supervisor to support department and organizational needs<br/><br/></li></ul>", "qualifications": {"required": "Must possess a vibrant personal relationship with Jesus Christ and agree with the Joni and Friends statement of faith, Desire to serve in a growing and dynamic Christian service ministry, Minimum 2+ years experience supporting teams or groups of employees., Good interpersonal communication skills both verbal and written and the ability to effectively organize and prioritize a wide range of daily tasks with varied deadlines are necessary, Must be detail oriented, committed to accuracy, and team player who is flexible and able to work independently, Must have a strong sense of confidentiality, Strong general computer skills are necessary along with a competent, working knowledge of Windows, Microsoft Excel, Microsoft Word, Microsoft Outlook and the Internet, Understanding of Christian ministry and specifically Joni and Friends is desirable", "preferred": "Educational requirements Bachelor’s Degree preferred but not required"}, "skills": ["Microsoft Excel", "Microsoft Word", "Microsoft Outlook", "Communication", "Organization", "Teamwork", "Confidentiality", "Computer Skills"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3971584002"}