{"jobTitle": "Human Resource Generalist - Part-Time", "company": {"name": "April Parker Foundation", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Part-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "30/hr-$35/hr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "The April Parker Foundation is seeking a dedicated and experienced Human Resource Generalist to join our team. In this dual-role position, you will be responsible for managing the daily human resources functions of the organization.<br/><br/>As the Human Resource Generalist, you will be responsible for recruitment and onboarding, employee relations, performance management, volunteer management, payroll verification and policy development and implementation.<br/><br/>We desire, attention to detail, strong organizational skills, and confidentiality are essential. If you are a motivated, reliable, and self-driven professional with a passion for human resources and office management, we would love to hear from you!<br/><br/>Candidates who are familiar with Gusto will be given preference. Please note such experience in your application.<br/><br/>This position is part-time - 20-30 hours per week. Must have availability to be in-office 4 days per week.<br/><br/>Requirements<br/><br/>Qualifications:<br/><br/><ul><li>Bachelor's Degree in Human Resources Management or similar subject</li><li>Minimum of 3 years of experience in human resources, preferably in a generalist role</li><li>Proven experience managing full-cycle recruitment and onboarding processes</li><li>Working knowledge of employee relations, performance management, and benefits administration</li><li>Strong understanding of employment laws and regulations</li><li>Proficiency in HRIS systems (especially Gusto) and Microsoft Office Suite</li><li>Experience in office management, including maintaining office supplies and overseeing administrative processes</li><li>Exceptional organizational and time management skills</li><li>Excellent interpersonal and communication skills</li><li>Ability to maintain confidentiality and handle sensitive information with discretion</li><li>HR certification (e.g., SHRM-CP, PHR) highly preferred<br/><br/><br/></li></ul>Compensation<br/><br/>$30/hr-$35/hr<br/><br/>Benefits<br/><br/><ul><li>PTO eligible</li><li>Training &amp; Development</li><li>Wellness Resources</li></ul>", "responsibilities": "As the Human Resource Generalist, you will be responsible for recruitment and onboarding, employee relations, performance management, volunteer management, payroll verification and policy development and implementation.", "qualifications": {"required": "Bachelor's Degree in Human Resources Management or similar subject, Minimum of 3 years of experience in human resources, preferably in a generalist role, Proven experience managing full-cycle recruitment and onboarding processes, Working knowledge of employee relations, performance management, and benefits administration, Strong understanding of employment laws and regulations, Proficiency in HRIS systems (especially Gusto) and Microsoft Office Suite, Experience in office management, including maintaining office supplies and overseeing administrative processes, Exceptional organizational and time management skills, Excellent interpersonal and communication skills, Ability to maintain confidentiality and handle sensitive information with discretion", "preferred": "HR certification (e.g., SHRM-CP, PHR)"}, "skills": ["Human Resources", "Recruitment", "Onboarding", "Employee Relations", "Performance Management", "Volunteer Management", "Payroll", "Policy Development", "Gusto", "Microsoft Office Suite", "Office Management"], "postedDate": "2 months ago", "benefits": "PTO eligible, Training & Development, Wellness Resources", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971394544"}