{"jobTitle": "Supply Chain Planning Analyst", "company": {"name": "Careismatic Brands, Inc.", "location": "Chatsworth, CA"}, "location": "Chatsworth, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "Chatsworth, CA<br/><br/>We are Careismatic Brands Inc., the global leader in medical apparel, footwear, and accessories. We have an outstanding opportunity for a Supply Chain Planning Analyst to focus on creating and maintaining demand forecasts by utilizing category level plans, historical sales data, and insights from other departments within the organization.<br/><br/>This is a full-time hybrid role based in our corporate office in Chatsworth, CA.<br/><br/><strong>Salary Range</strong>: $65,000-$70,000<br/><br/><strong>Physical Demands &amp; Work Environment<br/><br/></strong>The physical demands described here are representative of those that must be met by a Team Member to successfully perform the essential functions for this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions.<br/><br/><ul><li>Prolonged periods of sitting at a desk and working on a computer</li><li>2-3 days in office in Chatsworth<br/><br/></li></ul><strong>What Your Day Looks Like<br/><br/></strong><ul><li>Create and maintain demand forecasts utilizing data and statistical models.</li><li>Gather information from Sales, Merchandising, and Marketing to incorporate into the forecast.</li><li>Monitor and improve forecast accuracy for their items/categories.</li><li>Develop seasonal and new item statistical models.</li><li>Recommend SKU reduction based on item or category sales trends.</li><li>Maximize in stocks for active items by matching demand and supply.</li><li>Expedite work orders based on need to maintain in stock at goal levels.</li><li>Recommend transportation mode changes when needed to maintain in stock goals.</li><li>Control inventory levels by keeping items at target level weeks of supply.</li><li>Reduce excess by accessing safety stock parameters and reduce the need for items to exceed target inventory.<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Excellent communication skills</li><li>Highly analytical approach to problem-solving</li><li>Solid proficiency in Microsoft Excel</li><li>Bachelor's degree in Business, Economics, or related field preferred.<br/><br/></li></ul><strong>What’s In It For You<br/><br/></strong><ul><li>401(k)</li><li>Dental insurance</li><li>Employee discount</li><li>Flexible spending account</li><li>Health insurance</li><li>Life insurance</li><li>Attractive Paid time off</li><li>Vision insurance<br/><br/></li></ul>At Careismatic Brands, we believe in the power of care. It’s the force that drives and inspires us, inside our company and out in the world. It’s why we strive to maintain a diverse and inclusive organization – an ever-evolving imperative - where everyone feels respected, valued, and empowered to bring their ideas and perspectives forward.<br/><br/>Careismatic embraces the differences that make our organization unique. We are strengthened by diversity in all its forms – including but not limited to race, religion, ethnicity, age, national origin, gender identity, and sexual orientation.", "responsibilities": "Create and maintain demand forecasts utilizing data and statistical models. Gather information from Sales, Merchandising, and Marketing to incorporate into the forecast. Monitor and improve forecast accuracy for their items/categories. Develop seasonal and new item statistical models. Recommend SKU reduction based on item or category sales trends. Maximize in stocks for active items by matching demand and supply. Expedite work orders based on need to maintain in stock at goal levels. Recommend transportation mode changes when needed to maintain in stock goals. Control inventory levels by keeping items at target level weeks of supply. Reduce excess by accessing safety stock parameters and reduce the need for items to exceed target inventory.", "qualifications": {"required": "Excellent communication skills, Highly analytical approach to problem-solving, Solid proficiency in Microsoft Excel", "preferred": "Bachelor's degree in Business, Economics, or related field"}, "skills": ["Communication", "Microsoft Excel", "Analytical Skills", "Demand Planning", "Inventory Management"], "postedDate": "3 weeks ago", "benefits": "401(k), Dental insurance, Employee discount, Flexible spending account, Health insurance, Life insurance, Attractive Paid time off, Vision insurance", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3971836364"}