{"jobTitle": "Visual Merchandising Assistant", "company": {"name": "Haven Closet Interiors ", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Design Services", "description": "As a Visual Merchandising Assistant, you will be integral to the organization and visual merchandising of our Closet design projects. This role requires a unique combination of creativity, organizational prowess, and a keen sense of style to ensure all project elements align with our high standards.<br/><br/>Responsibilities:<br/><br/><ul><li>Assist in the hands-on planning and organization of Interior design projects. </li><li>Oversee and contribute to the visual merchandising and styling of wardrobe elements. </li><li>Collaborate closely with the design team to maintain aesthetic and functional excellence. </li><li>Manage project timelines and deliverables, ensuring all deadlines are met with superior quality. </li><li>Maintain effective communication with team members and clients to accurately convey project visions and objectives. </li><li>Ensure reliable transportation to manage tasks across various locations as needed. <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Demonstrated experience in project organization, preferably within the interior design or retail industry. </li><li>A strong organizational eye for function, balance, and beauty. </li><li>Knowledge of fashion and style trends. </li><li>Exceptional organizational skills and meticulous attention to detail. </li><li>Capability to handle pressure and meet stringent deadlines. </li><li>Excellent communication skills. </li><li>Must have reliable transportation. <br/><br/></li></ul>Company Description<br/><br/>Haven Closet Interiors is a dynamic, innovative interior design firm creating unique, immersive closet experiences. We blend design principles, retail visual merchandising techniques, and organizational expertise to transform ordinary closets into extraordinary spaces. As we continue to expand, we seek a passionate and creative individual to join our team and contribute to our growth.<br/><br/>Haven Closet Interiors is a dynamic, innovative interior design firm creating unique, immersive closet experiences. We blend design principles, retail visual merchandising techniques, and organizational expertise to transform ordinary closets into extraordinary spaces. As we continue to expand, we seek a passionate and creative individual to join our team and contribute to our growth.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3972333124"}