{"jobTitle": "Client Account Manager II", "company": {"name": "Pinterest", "industry": "Technology, Information and Internet, Software Development, and IT Services and IT Consulting", "size": "1001-5000 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$61,285—$129,500", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet, Software Development, and IT Services and IT Consulting", "description": "Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet. Creating a life you love also means finding a career that celebrates the unique perspectives and experiences that you bring. As you read through the expectations of the position, consider how your skills and experiences may complement the responsibilities of the role. We encourage you to think through your relevant and transferable skills from prior experiences. Our new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our PinFlex landing page to learn more.", "responsibilities": "Build and nurture relationships with our Partners, proactively reaching out to partners regarding campaign performance, optimizations, updates, and opportunities. Ensure that our partners objectives and requirements are met by liaising between them and our internal teams (Measurement & Insights, Product Marketing, Creative Strategy, etc). Gain a deep understanding of our partners’ business goals and turn data into compelling stories and actionable insights to help them succeed. Specifically own the “how” conversation with advertisers to advise on media strategies across targeting, bidding models, creative, measurement, etc. Become an expert at Pinterest campaign best practices, enabling yourself to be the resource for performance related opportunities. Ensure that campaign setup is optimal. Interpret and communicate campaign results so that the customer sees impact. Evaluate if a digital media campaign is successful and how to troubleshoot. Understand how to drive results, optimize campaigns and deliver performance updates to partners. Ensure the performance metrics that were agreed upon are being met, and take action to course correct. Actively engaging in client meetings to understand their key objectives and challenges. Presenting and explaining complex solutions in a clear and concise manner to help partners achieve their objectives. Handle resistance, complaints, or objections from partners professionally and patiently. Cross sell and upsell opportunities that contribute to the team’s ability to exceed revenue targets. Understand complex processes and products, distilling them down into a digestible format for our partners. Provide partners with guidance and expertise on product, service best practices and features. Be highly knowledgeable about all relevant Pinterest ad product features and capable of clearly explaining their benefits to a customer. Maintain up-to-date education and fluency on evolving product roadmap and iterations. Efficiently interfaces with appropriate cross-functional teams to answer product-related questions or challenges when needed. Ensuring agency, client and Pinterest teams are aligned on all details, and respond to clients as promptly as possible. Manage expectations & moving at a fast pace, staying on top of it all without dropping the ball. Empowering Unilever to lead the way in terms of CPG performance - shopping/e-carting campaigns, RMNs/shopper marketing, and cAPI adoption.", "qualifications": {"required": "Digital advertising sales experience, managing high value relationships, driving strategic learning agendas and owning client communication. Track record of compelling data-backed storytelling and recommendations. Expert in managing forecasts and achieving goals. Strong communication skills in person, on the phone, and through email. A team player who’s able to work in a fast-paced environment with technical and non-technical teams. Expertise in digital advertising and media sales including campaign optimization, analytical problem solving, and product/platform knowledge. Technical foundation with relevant experience in Display/Social/Search/Shopping advertising technologies. Highly analytical with experience working with CPG performance advertisers needed. Confidence in making media recommendations & optimizations, providing a sound POV and opinion on what UL should do to maximize performance and grow their spend. The business acumen to assess, pause & suggest challenger solutions to Unilever teams. Detail oriented skill set to handle over 200+ campaigns at one time that are constantly in motion - in flight optimization recos, re-planning & budget changes. Ensuring agency, client and Pinterest teams are aligned on all details, and responds to clients as promptly as possible. A CAM energized by social connections and building relationships among the many teams we work with - agency, strategy team, Unilever brand, DMC, creative/ER. Willingness to think of new & better ways of working together so we can make the most impact on their business. Ability to roll up their sleeves and learn/work together to create the best partnership possible.", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "This role will need to be in the office for in-person collaboration 1 time per week and therefore needs to be in a commutable distance from one of the following offices Chicago, San Francisco, New York, or Los Angeles.", "url": "https://www.linkedin.com/jobs/view/3972756113"}