{"jobTitle": "Executive Administrative", "company": {"name": "RemX - Accounting & Finance Staffing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "RemX has an exciting opportunity for an Executive Administrative Assistant in West Los Angeles, CA for a large healthcare organization!<br/><br/><strong>Duration:</strong> 3 - 6 months with potential extension<br/><br/><strong>Shift: </strong>Monday - Friday 8am - 4:30pm<br/><br/><strong>Job Summary<br/><br/></strong><ul><li>In addition to the responsibilities listed below, this position is also responsible for beginning to coordinate department workflow; providing standard and nonstandard administrative support to senior leadership; coordinating intricate executive calendars and travel arrangements; notifying executive of issues that require immediate attention; anticipating the executive's upcoming needs; drafting and distributing details of highly confidential with discretion and cautionary judgement upon request; making basic commitments on the executive's behalf when interfacing with internal and external contacts; and independently resolving simple conflicts with the executive's best interests in mind. </li><li>Pursues effective relationships with others by proactively providing resources, information, advice, and expertise with coworkers and members. Listens to, seeks, and addresses performance feedback; provides mentoring to team members. Pursues self-development; creates plans and takes action to capitalize on strengths and develop weaknesses; influences others through technical explanations and examples. Adapts to and learns from change, challenges, and feedback; demonstrates flexibility in approaches to work; helps others adapt to new tasks and processes. Supports and responds to the needs of others to support a business outcome. </li><li>Completes work assignments autonomously by applying up-to-date expertise in subject area to generate creative solutions; ensures all procedures and policies are followed; leverages an understanding of data and resources to support projects or initiatives. Collaborates cross-functionally to solve business problems; escalates issues or risks as appropriate; communicates progress and information. Supports, identifies, and monitors priorities, deadlines, and expectations. Identifies, speaks up, and implements ways to address improvement opportunities for team. </li><li>Contributes to event coordination by: beginning to develop relationships with leaders' assistants and an understanding of organizational hierarchy to leverage when coordinating, calendaring, and facilitating meetings for directors and their direct teams with front line employees, independently; may be independently planning for meeting facilitation through PowerPoint presentation coordination, taking parking lot notes, ensuring equipment works, and ordering food when appropriate; finding and booking meeting standard and nonstandard rooms appropriate for the audience and meeting objectives, with general oversight. <br/><br/></li></ul><strong>Basic Qualifications:<br/><br/></strong><ul><li>Minimum one (1) year of experience in leadership administrative support. </li><li>Bachelors Degree preferred </li><li>Minimum three (3) years of experience in administrative support or related field. <br/><br/></li></ul><strong>Additional Qualifications:<br/><br/></strong><ul><li> Proven experience as an administrative assistant or in a related role</li><li> Strong organizational skills with the ability to prioritize tasks and meet deadlines</li><li> Excellent written and verbal communication skills</li><li> Attention to detail and problem-solving skills</li><li>Excel experience required</li><li> Ability to handle sensitive information with confidentiality</li><li> Ability to work independently with minimal supervision</li><li> Knowledge of office management systems and procedures<br/><br/></li></ul>RemX is the professional staffing division of Employbridge, America’s Leading Workforce Specialist. When our Talent is looking for their next opportunity, we know they are not just looking for their next paycheck. Our Recruiters are experts in their specialized fields and understand that making the right match between the candidate and the company, is the key to long term success. We offer a variety of staffing solutions, including: Temporary, temp-to-hire, direct hire Independent contract placements Executive search Managed staffing and outsourced workforce solutions", "responsibilities": "In addition to the responsibilities listed below, this position is also responsible for beginning to coordinate department workflow; providing standard and nonstandard administrative support to senior leadership; coordinating intricate executive calendars and travel arrangements; notifying executive of issues that require immediate attention; anticipating the executive's upcoming needs; drafting and distributing details of highly confidential with discretion and cautionary judgement upon request; making basic commitments on the executive's behalf when interfacing with internal and external contacts; and independently resolving simple conflicts with the executive's best interests in mind.", "qualifications": {"required": "Minimum one (1) year of experience in leadership administrative support.  Minimum three (3) years of experience in administrative support or related field.  Proven experience as an administrative assistant or in a related role Strong organizational skills with the ability to prioritize tasks and meet deadlines Excellent written and verbal communication skills Attention to detail and problem-solving skills Excel experience required Ability to handle sensitive information with confidentiality Ability to work independently with minimal supervision Knowledge of office management systems and procedures", "preferred": "Bachelors Degree"}, "skills": ["Administrative Support", "Leadership", "Organizational Skills", "Prioritization", "Communication", "Problem Solving", "Excel"], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3972389375"}