{"jobTitle": "Marketing Brand Manager", "company": {"name": "Sweetfin", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Hospitality", "description": "Job Description<br/><br/>We are looking for a Marketing &amp; Brand Manager that knows how to: build significant brand awareness, tell beautiful stories, inspire amazing design, dig into performance analytics, test and learn, organize, and lead team members, and strategize to create the long-term vision. The ideal candidate should be passionate about the Sweetfin brand, knowledgeable about our consumer and experienced with cutting edge growth marketing techniques &amp; media channels. This position reports to the President.<br/><br/>Responsibilities:<br/><br/><ul><li>Lead and direct all aspects of the company’s marketing and brand development</li><li>Develop and implement marketing plans including promotional calendars and programs, new product introductions and other marketing projects</li><li>Develop and execute comprehensive marketing plans for Sweetfin catering programs, future concepts, and new lines of business (we are very entrepreneurial and always creating)</li><li>Manage all marketing facets: loyalty, digital channels, email, social media, messaging and story development, copywriting, website design, public relations, in-store experience, partnerships and collaborations, guest loyalty, local store marketing and others areas to be determined by you</li><li>Lead all aspects of new restaurants marketing: in-store, opening buzz and awareness creation, long-term field marketing programs specific to the location, and activities to drive sales to the restaurants as needed</li><li>Work with General Managers to develop LSM (local store marketing) plans, schedules and goals</li><li>Critically analyze and report on the impact of each marketing channel</li><li>Lead design and development of digital and physical marketing materials and collateral</li><li>Thoroughly understand our customers and what resonates</li><li>Seek and explore opportunities to attract more customers and grow our brand</li><li>Embrace the entrepreneurial culture internally with team members and externally with vendors partners; take risks and learn</li><li>Champion consistent application of our vision, values, culture, and operating principles</li><li>Consistently achieve/exceed both short and long-term company financial objectives by responsibly growing restaurant sales through awareness and increased guest visits</li><li>Provide leadership to direct reports albeit with a hands-on approach, and ensure effective engagement to reinforce a culture of collaboration, trust, and open communication</li><li>Create an environment that provides direction and promotes continuous learning and development, with the ability to nurture and retain valued team members</li><li>Anticipate industry trends and continually evaluate the company’s strengths, weaknesses, opportunities, and threats to help improve overall company performance</li><li>Actively participate on the executive team and help to set overall company strategy<br/><br/></li></ul>Required Qualifications/Qualities:<br/><br/><ul><li>Someone who is super creative and is willing to take risks</li><li>BA/BS degree</li><li>7+ years of experience in marketing for a consumer brand (ideally DTC healthy lifestyle or food)</li><li>Deep passion for food and healthy lifestyle</li><li>Ability to thrive in a fast-paced, rapidly changing, “get it done” environment</li><li>Highly organized and willing to learn, be curious, and open to new challenges</li><li>Ability to work at both strategic and tactical levels – a hands-on, team player</li><li>Outstanding attention to detail from start to finish</li><li>Good judgment, versatility, flexibility, and a strong work ethic<br/><br/></li></ul>What To Expect:<br/><br/><ul><li>Start-up vibe</li><li>Hustle</li><li>Constant evolution</li><li>Good people</li><li>Obsession</li><li>Risk. Pivot. Innovate. Grow. </li><li>Challenge and reward<br/><br/></li></ul>Company Description<br/><br/>OUR MISSION IS TO FUEL LIFE THROUGH FRESHNESS. WE STRIVE TO PROVIDE A CULINARY EXPERIENCE THAT IS FRESH, ACCESSIBLE, AND NATURALLY CRAVEABLE. PREMIUM-GRADE FRESHNESS IS OUR SWEET SPOT.<br/><br/>www.sweetfin.com<br/><br/>Sweetfin was created with the goal of providing healthy, nutritious and flavorful bowls with premium quality ingredients and with approachability. Our fine-casual restaurant concept takes all the familiar flavors of sushi and puts them in an easy to eat, portable, customizable, and affordable bowl.<br/><br/>Our culinary philosophy is centered in our “Pole to Bowl” ethos which means that in sourcing our fish we aim to use the highest-quality and most sustainable raw fish we can find while still maintaining a reasonable price point. Our menu is 100% gluten free and we are vegan and vegetarian friendly.<br/><br/>OUR MISSION IS TO FUEL LIFE THROUGH FRESHNESS. WE STRIVE TO PROVIDE A CULINARY EXPERIENCE THAT IS FRESH, ACCESSIBLE, AND NATURALLY CRAVEABLE. PREMIUM-GRADE FRESHNESS IS OUR SWEET SPOT. www.sweetfin.com Sweetfin was created with the goal of providing healthy, nutritious and flavorful bowls with premium quality ingredients and with approachability. Our fine-casual restaurant concept takes all the familiar flavors of sushi and puts them in an easy to eat, portable, customizable, and affordable bowl. Our culinary philosophy is centered in our “Pole to Bowl” ethos which means that in sourcing our fish we aim to use the highest-quality and most sustainable raw fish we can find while still maintaining a reasonable price point. Our menu is 100% gluten free and we are vegan and vegetarian friendly.", "postedDate": "1 month ago", "skills": ["Marketing", "Brand Management", "Social Media", "Digital Marketing", "Email Marketing", "Public Relations", "Product Development", "Customer Relationship Management", "Analytics", "Leadership", "Team Management", "Communication", "Strategic Planning", "Project Management", "Food Industry", "Hospitality", "Entrepreneurship", "Innovation", "Growth Marketing", "DTC", "Healthy Lifestyle"], "url": "https://www.linkedin.com/jobs/view/3972385298"}