{"jobTitle": "Litigation Paralegals", "company": {"name": "The Midtown Group", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Staffing and Recruiting", "description": "Our legal client is hiring an on-site Litigation Paralegal at $48/hour (W2) to support their team in Los Angeles, CA OR San Francisco, CA.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Finalizing client agreements, coordinating signatures via DocuSign, preparing agreement flow charts in Microsoft (MS) PowerPoint, and organizing data in MS Excel Spreadsheets.</li><li> Support in-house Attorneys to ensure documentation compliance, regulatory and transactional matters are followed in legal proceedings.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> 3+ years' experience performing Paralegal duties would overseeing legal contracts, policy compliance and the implementation of a new documentation management software.</li><li> Completed bachelor's degree<br/><br/></li></ul><em>For 32 years, the Midtown Group has been connecting talented professionals with incredible employment opportunities.<br/><br/></em><em>We are a small, woman-owned business certified by the Women’s Business Enterprise National Council (WBENC). Operating from our headquarters in Washington, DC, we provide trusted staffing services nationwide. Our clients include thousands of the most prestigious Fortune 500 companies, law firms, financial organizations, tech innovators, non-profits, and lobbying firms, as well as federal, state and local government agencies.<br/><br/></em><em>Whether you’re looking for a temporary role or direct hire position, Midtown wants you to Love What You Do.<br/><br/></em><em>To get you there, we can navigate the best options in your industry, connect you directly to hiring managers, and give you the insider tips you need to nail your interview.<br/><br/></em><em>You’ve got the skills. You’ve got the experience. Let Midtown get you the response your resume deserves.<br/><br/></em><em>Check us out! www.themidtowngroup.com Finding the perfect fit should always be this easy.<br/><br/>The Midtown Group is a multi-award-winning “Best Places To Work” staffing firm in Washington, DC (per Inc. Magazine)!!<br/><br/>The Midtown Group is An Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</em>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3972973493"}