{"jobTitle": "Supply Chain Management (SCM) - Key Accounts Analyst II", "company": {"name": "Pulmuone Foods USA, Inc.", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food & Beverages", "description": "<strong>Job Description<br/><br/></strong><strong>Company Overview<br/><br/></strong>Pulmuone’s mission is a company that creates a healthy future for people and the earth with wholesome foods. Pulmuone Foods USA brands include Nasoya, Wildwood, Emerald Valley Kitchen, Monterey Gourmet Foods, and Cibo Naturals. Pulmuone’s family of brands provide our consumers a wide variety of delicious products that are inspired by contemporary flavor palates and encourage a healthy and sustainable lifestyle. Visit www.pulmuonefoodsusa.com to learn more about the company and brands.<br/><br/><strong>Job responsibilities:<br/><br/></strong><ul><li>Collect and analyze supply chain data and continuously recommend on improvements on supply chain processes and procedures for key accounts. </li><li>Perform inventory reconciliation and rectify/manage any errors, shortage, &amp; overage minimization by working with cross-functional departments. </li><li>Collect and analyze customer sales/ promotion data to optimize inventory and supply planning. </li><li>Coordinate and support with needs for the Inventory Control Tower and assist SCM operation team as needed. </li><li>Ensure implementation of SCM plans by efficiently working with operations and cross-functional departments. </li><li>Responsible for planning, analyzing and developing SOPs to standardize SCM operating procedures and processes key accounts. </li><li>Prepare and analyze ad-hoc business reports to identify issues and recommend improvements. </li><li>Support with other SCM related projects as requested by manager/division manager. <br/><br/></li></ul>Skill/Qualifications:<br/><br/><ul><li>Bachelor’s Degree in Supply Chain Management, Business, Finance or related field. </li><li>4+ years of relevant work experience in supply chain management. </li><li>Good understanding of Supply Chain Management &amp; selling process. </li><li>Strong knowledge of SCP (Supply Chain Planning) System. </li><li>Strong verbal and written communication. </li><li>Intermediate proficiency in MS Office, Outlook, Excel, Word, and PowerPoint. </li><li>Good interpersonal, organizational, and time management skills. </li><li>Ability to anticipate business needs and influence change to drive actionable and tangible results. </li><li>Previous work experience with operation and implementation of SCP System such as Kinaxis, JDA, SAP, etc. is preferred but not necessary. <br/><br/></li></ul>We offer competitive pay and benefits package, including health (~80-90% company paid) for employee and dependents, dental, vision, life insurance, long-term disability, company match 401K plan, vacation, floating holidays, and company holidays.<br/><br/>Pulmuone is a global, distributed workforce in four countries. We are an Equal Opportunity Employer and embrace people with different experiences, strengths, and backgrounds, who share a passion for making a healthier tomorrow for people and the planet with wholesome foods.", "responsibilities": "Collect and analyze supply chain data and continuously recommend on improvements on supply chain processes and procedures for key accounts. Perform inventory reconciliation and rectify/manage any errors, shortage, & overage minimization by working with cross-functional departments. Collect and analyze customer sales/ promotion data to optimize inventory and supply planning. Coordinate and support with needs for the Inventory Control Tower and assist SCM operation team as needed. Ensure implementation of SCM plans by efficiently working with operations and cross-functional departments. Responsible for planning, analyzing and developing SOPs to standardize SCM operating procedures and processes key accounts. Prepare and analyze ad-hoc business reports to identify issues and recommend improvements. Support with other SCM related projects as requested by manager/division manager.", "qualifications": {"required": "Bachelor’s Degree in Supply Chain Management, Business, Finance or related field. 4+ years of relevant work experience in supply chain management. Good understanding of Supply Chain Management & selling process. Strong knowledge of SCP (Supply Chain Planning) System. Strong verbal and written communication. Intermediate proficiency in MS Office, Outlook, Excel, Word, and PowerPoint. Good interpersonal, organizational, and time management skills. Ability to anticipate business needs and influence change to drive actionable and tangible results.", "preferred": "Previous work experience with operation and implementation of SCP System such as Kinaxis, JDA, SAP, etc. is preferred but not necessary."}, "skills": ["Supply Chain Management", "Inventory Management", "Supply Planning", "Data Analysis", "Communication", "MS Office", "Excel", "PowerPoint", "Interpersonal Skills", "Time Management", "Kinaxis", "JDA", "SAP"], "postedDate": "1 month ago", "benefits": "We offer competitive pay and benefits package, including health (~80-90% company paid) for employee and dependents, dental, vision, life insurance, long-term disability, company match 401K plan, vacation, floating holidays, and company holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3972358184"}