{"jobTitle": "Graduate Customer Success Manager", "company": {"name": "Canonical", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "The role of a Customer Success Manager at Canonical\nCustomer success is a new and strategic department at Canonical, with the objective to reduce risk and churn, facilitate the adoption of new products or services and support expansion within existing accounts. Customer Success Managers (CSM) are responsible for developing trust with their assigned customers and providing them with the best possible experience navigating Canonical's vast offering. Through a clear understanding of their customer's objectives, the CSM can activate a large range of internal and external capabilities to alleviate any pain point, align expectations, as well as help draw and deliver on an appropriate collaboration roadmap.\n\nWe are growing our Customer Success team to continue offering thoughtful, smart, precise interactions across our product portfolio, from Ubuntu to open source infrastructure and applications.\n\nThis role is a first step in the CSM organisation. Although you will primarily focus on the Tech segment, including the store customers, you will also have a portfolio assigned. Ubuntu is chosen by thousands of new users every month. Our responsibility is to ensure the best user experience for them through problem-solving, onboarding, enablement and value realisation all the way to success. Collaborating with other teams and participating in campaign efforts, you will connect with a diverse set of users of Canonical products and identify our future champions.\n\nLocation: This role will be based remotely worldwide.\n\nWhat your day will look like\n- A strong focus on supporting customers by finding solutions to ticket requests.\n- Enrich documentation about problem solving, Q&A, onboarding materials.\n- Drive campaigns targeting multiple customers through digital touch-points and activities.\n- Identify high potential as well as high risk customers from newly onboarded users or customers\n- Onboard new customers and introduce them to our products and support processes. Products include: Ubuntu Pro, MAAS, Landscape, Openstack, Ceph, Kubernetes, data applications and many more.\n- Collaborate with Sales and Support in developing and delivering engagement plans that fulfill the customer's objectives.\n- Engage with your portfolio of customers to ensure risk identification\n- Collect feedback from customers and format them for review by the product team\n\nWhat we are looking for in you\n- Customer-facing experience\n- An empathetic individual with a natural drive to help others\n- Passion for technology, infrastructure and Ubuntu in particular is a must\n- Excellent presentation skills\n- Strong organisational skills, ability to structure and constantly update documentation\n- A team player capable of interacting with all departments internally\n\nAdditional skills that you might also bring\n- We at the Customer Success team strongly appreciate various languages! Therefore, if you possess proficiency (both written and spoken) in Japanese, Korean, Spanish, Portuguese, German, French, or Italian, alongside an excellent command of English, please inform us!\n\nWhat we offer you\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n- Distributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues from your team and others\n- Priority Pass for travel and travel upgrades for long haul company events\n\nAbout Canonical\nCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.\n\nCanonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\n\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.", "responsibilities": "A strong focus on supporting customers by finding solutions to ticket requests. Enrich documentation about problem solving, Q&A, onboarding materials. Drive campaigns targeting multiple customers through digital touch-points and activities. Identify high potential as well as high risk customers from newly onboarded users or customers. Onboard new customers and introduce them to our products and support processes. Products include: Ubuntu Pro, MAAS, Landscape, Openstack, Ceph, Kubernetes, data applications and many more. Collaborate with Sales and Support in developing and delivering engagement plans that fulfill the customer's objectives. Engage with your portfolio of customers to ensure risk identification. Collect feedback from customers and format them for review by the product team.", "qualifications": {"required": "Customer-facing experience, An empathetic individual with a natural drive to help others, Passion for technology, infrastructure and Ubuntu in particular is a must, Excellent presentation skills, Strong organisational skills, ability to structure and constantly update documentation, A team player capable of interacting with all departments internally", "preferred": "Proficiency in Japanese, Korean, Spanish, Portuguese, German, French, or Italian, alongside an excellent command of English."}, "skills": ["Customer-facing experience", "Empathetic individual", "Passion for technology", "Excellent presentation skills", "Strong organisational skills", "Team player"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Distributed work environment, Personal learning and development budget of USD 2,000 per year, Annual compensation review, Recognition rewards, Annual holiday leave, Maternity and paternity leave, Employee Assistance Programme, Opportunity to travel to new locations to meet colleagues from your team and others, Priority Pass for travel and travel upgrades for long haul company events.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3972710134"}