{"jobTitle": "Strategy Director, Communications", "company": {"name": "Sid Lee", "industry": "Advertising Services", "size": "700", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Advertising Services", "description": "Sid Lee is a multidisciplinary creative collective striving to make a difference and celebrate culture with bold ideas. Its 700 professionals work as one team from offices in Montreal, Toronto, New York, Paris, London, Los Angeles and Seattle. Their mission is to create what matters through brand building, brand expression and brand experience. Its creative community also includes Yard, Digital Kitchen, BIMM and Haigo. Alongside progressive clients, Sid Lee draws on its rich collection of disciplines, from design to data and experiential communication and technology to advertising and architecture, empowering its clients to outperform their competitors, earn the trust of their customers and increase their influence on culture. Sid Lee is a member of kyu, a collective of top-tier global creative companies established by Hakuhodo DY Holdings. Sid Lee also imagined C2 Montréal, one of the largest creative-business conferences in the world.", "responsibilities": "Oversee the creation of communications strategy deliverables including audience journeys, campaign ecosystems, engagement frameworks, moments strategies and tactical briefs. Push us to think outside traditional delivery of campaigns with innovation and ingenuity. Ultimately, we need smart and novel translation of concepts to brand activation and behaviors. And, if necessary, advertising. An indispensable teammate people look forward to working with. Partners closely with clients and internal members of senior leadership, across disciplines and departments (Creative, Strategy, Production, Account, etc.) to get the best creative product possible. Drive collaboration with external IAT partners including media, PR and CRM agencies. Lead relationship with day-to-day clients, including presenting and selling through communications strategies. Oversee the process of working with creative teams to amplify their ideas via media strategy, tactics and creative thought-starters. Provide a strong and informed point of view on how the brand should behave and capture opportunities for growth that exist in the market. Partner with the data and analytics teams, to ensure that measurement frameworks, reporting cadences and campaign optimizations are taking place. Possess an in-depth understanding of how the client’s business operates and the motivations of the various stakeholders. Provide clear, constructive and actionable feedback to teams. Lead both internal and client presentations. Manage and mentor more junior team members to ensure strategic excellence is maintained across all clients and assignments.", "qualifications": {"required": "Bachelors or Masters degree in a related discipline. 10+ years experience in an agency environment, preferably a top creative agency. Deep understanding of the media landscape, both offline and online. Demonstrated ability to think both strategically and creatively. Can articulate your point-of-view with ease and authority. Excellent at crafting compelling, client-ready presentations. Advanced knowledge using media-based insight tools (MRI/Simmons, eMarketer, AdViews/AdRelevance, comScore and GWI). Experience with iconic American household brands and campaigns. Global advertising experience, an asset. Superior storyteller (both written and verbal) with a clear and concise style. Master of technological, cultural and media trends and best practices.", "preferred": "None specified."}, "skills": ["Strategic Leadership", "Campaign Management", "Client Relations", "Creative Collaboration", "Media Strategy", "Data Analysis", "Presentation Skills", "Mentoring", "Brand Development", "Advertising"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Sid Lee is strongly committed to hiring a diverse staff and believe all experiences and perspectives bring value to our clients. Sid Lee does not discriminate on the basis of race, color, gender, disability, age, religion, sexual orientation, national origin, ethnic origin, or any other characteristic protected by state or federal law.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3973984214"}