{"jobTitle": "Production Supervisor- MPP Los Angeles", "company": {"name": "Orora Packaging Solutions", "location": "Alhambra, CA"}, "location": "Alhambra, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Packaging and Containers Manufacturing", "description": "Manufactured Packaging Products Orora (MPP Orora), a division on Orora Packaging Solutions, offers a wide variety of high-quality custom and stock corrugated products to customers in the United States and Mexico. With multiple locations throughout the U.S., MPP takes product from conceptualization through design and printing. In addition to superior customer service, MPP’s comprehensive range of capabilities includes state-of-the-art equipment, talented designers, bulk box capabilities, digital printing and much more. It is with this passion and commitment to innovation, we believe in hiring and developing the very best talent by living our core values of Teamwork, Passion, Respect, and Integrity every day. These core values define who we are and how we operate. They shape the way we work with each other, with our customers, and with our communities. Every day, we deliver packaging solutions that exceed our customers’ expectations while solving complex problems as a team. We believe that all team members (irrespective of their role or level), should aspire to distinctive leadership behavior, as we continue to deliver on the promise for our customers, shareholders and each other. Leadership is not tied to a job title, i.e. you don’t need to be accountable for a team to be considered a leader.<br/><br/><strong>The Role: Production Supervisor <br/><br/></strong>MPP Los Angeles, a division of Orora is currently seeking a Production Supervisor to join our team. This position directly supervises all employees assigned to the manufacturing department. Carries out supervisory responsibilities in accordance with the organization’s policies and applicable laws. Trains co-workers, plans, assigns, and directs work; conducts performance appraisals and disciplines coworkers; conflict resolution; team building; coaching and leading co-workers to improve; addressing complaints and resolving problems; and setting an example of superior behavior, attitude and performance.<br/><br/><ul><li>This position will report to the: Production Superintendent </li><li>Travel Requirement: 0-3 % if required for training </li><li>FLSA Status: Exempt<br/><br/></li></ul><strong>What You’ll Be Responsible For In This Role<br/><br/></strong>In this role your primary duties include the following<br/><br/><ul><li>Coordinates manufacturing activities to ensure production and quality of products meet specification. Confers with production co-workers to coordinate activities of the department</li><li>Recommends measures to improve production methods, equipment performance, and quality of product. Suggests changes in working conditions and the use of equipment to increase the efficiency of the plant.</li><li>Maintains quality, efficiencies, and production levels set by management. Communicates these standards to subordinates.</li><li>Directs and trains co-workers in the operation of machinery and equipment.</li><li>Inspects machines and equipment to ensure specific operational performance and optimum utilization. Reports needs to maintenance for preventive maintenance and/or repair/modification.</li><li>Maintains inventories of sheets, inks and other converting supplies.</li><li>Compiles, stores, and retrieves production data.</li><li>Inspects work in progress and finished goods.</li><li>Interprets factory cards and directs the work flow in the plant. Resolves work problems as needed.</li><li>Reviews errors and complaints. Assists in any corrective and/or preventive action as needed.</li><li>Reviews production and operating reports and resolves operational, manufacturing, and maintenance problems to ensure minimum cost and prevent operation delays.</li><li>Communicates with necessary supervision to avoid problems between shift changes.</li><li>Prepares and provides subordinate performance evaluations.</li><li>Keeps upper management informed of problems or situations that may affect the performance of violating co-workers.</li><li>Performs other duties and/or responsibilities as requested.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong>What We’re Looking For <br/><br/></strong><ul><li>Bachelor’s Degree or equivalent combination of education and experience.<br/><br/></li></ul><strong>Additional Required Qualifications<br/><br/></strong><ul><li>Ability to communicate effectively with all levels in the organization, including dealing with customers, vendors, and co-workers.</li><li>Proficient in computer software (Outlook, Word, Excel).</li><li>Ability to work independently and as a team player.</li><li>Ability to operate various office machines.</li><li>Ability to write routine e-mails and correspondence.</li><li>Ability to possess basic mathematics skills.</li><li>Basic mechanical knowledge.</li><li>1 to 3 years of supervisory experience in corrugated industry highly preferred <br/><br/></li></ul><strong>Reasonable Accommodations<br/><br/></strong>Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions. If you are interested in applying for employment with Orora and need special assistance to apply for a posted position, or if you believe you do not meet any of the required qualifications of a posted position due to a protected disability and would like to explore the possibility of an accommodation, please contact our Talent Acquisition team at: careers@ororagroup.com for additional support<br/><br/><strong>Equal Employment Opportunity <br/><br/></strong>We are an equal opportunity employer committed to fostering a culturally diverse organization. We strive for inclusiveness and a workplace where mutual respect is paramount. We encourage applications from a diverse pool of candidates, and all qualified applicants will receive consideration for employment without regard to race, color, ethnicity, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, or veteran status. We will provide reasonable accommodations to qualified individuals with disabilities, as need, to assist them in performing essential job functions.<br/><br/><strong>Recruitment Agencies<br/><br/></strong>Orora does not accept unsolicited agency resumes. Orora is not responsible for any fees related to unsolicited resumes.<br/><br/><strong>Solicitation of Payment<br/><br/></strong>Orora does not solicit payment from our applicants and candidates for consideration or placement.<br/><br/><strong>Nearest Major Market: </strong>Los Angeles", "responsibilities": "This position directly supervises all employees assigned to the manufacturing department. Carries out supervisory responsibilities in accordance with the organization’s policies and applicable laws. Trains co-workers, plans, assigns, and directs work; conducts performance appraisals and disciplines coworkers; conflict resolution; team building; coaching and leading co-workers to improve; addressing complaints and resolving problems; and setting an example of superior behavior, attitude and performance.<br/><br/><ul><li>This position will report to the: Production Superintendent </li><li>Travel Requirement: 0-3 % if required for training </li><li>FLSA Status: Exempt<br/><br/></li></ul><strong>What You’ll Be Responsible For In This Role<br/><br/></strong>In this role your primary duties include the following<br/><br/><ul><li>Coordinates manufacturing activities to ensure production and quality of products meet specification. Confers with production co-workers to coordinate activities of the department</li><li>Recommends measures to improve production methods, equipment performance, and quality of product. Suggests changes in working conditions and the use of equipment to increase the efficiency of the plant.</li><li>Maintains quality, efficiencies, and production levels set by management. Communicates these standards to subordinates.</li><li>Directs and trains co-workers in the operation of machinery and equipment.</li><li>Inspects machines and equipment to ensure specific operational performance and optimum utilization. Reports needs to maintenance for preventive maintenance and/or repair/modification.</li><li>Maintains inventories of sheets, inks and other converting supplies.</li><li>Compiles, stores, and retrieves production data.</li><li>Inspects work in progress and finished goods.</li><li>Interprets factory cards and directs the work flow in the plant. Resolves work problems as needed.</li><li>Reviews errors and complaints. Assists in any corrective and/or preventive action as needed.</li><li>Reviews production and operating reports and resolves operational, manufacturing, and maintenance problems to ensure minimum cost and prevent operation delays.</li><li>Communicates with necessary supervision to avoid problems between shift changes.</li><li>Prepares and provides subordinate performance evaluations.</li><li>Keeps upper management informed of problems or situations that may affect the performance of violating co-workers.</li><li>Performs other duties and/or responsibilities as requested.<br/><br/></li></ul>", "qualifications": {"required": "Ability to communicate effectively with all levels in the organization, including dealing with customers, vendors, and co-workers.\nProficient in computer software (Outlook, Word, Excel).\nAbility to work independently and as a team player.\nAbility to operate various office machines.\nAbility to write routine e-mails and correspondence.\nAbility to possess basic mathematics skills.\nBasic mechanical knowledge.\n1 to 3 years of supervisory experience in corrugated industry highly preferred", "preferred": "Bachelor’s Degree or equivalent combination of education and experience."}, "skills": ["Outlook", "Word", "Excel"], "postedDate": "2 weeks ago", "benefits": "We believe that all team members (irrespective of their role or level), should aspire to distinctive leadership behavior, as we continue to deliver on the promise for our customers, shareholders and each other. Leadership is not tied to a job title, i.e. you don’t need to be accountable for a team to be considered a leader.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973573449"}