{"jobTitle": "Senior Analyst, DTC Strategy", "company": {"name": "The Walt Disney Company", "industry": "Entertainment Providers", "size": "Large", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$112,100 to $150,200", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Entertainment Providers", "description": "Disney Entertainment’s Direct to Consumer (DTC) or Streaming team leads all aspects of the Hulu and Disney+ streaming businesses, helping to bring The Walt Disney Company’s outstanding storytelling to fans and families everywhere! Join our team and contribute to shaping the future of entertainment. The DTC Streaming Strategy team tackles the most critical challenges and opportunities facing Disney+ and Hulu globally. Our recent high-impact streaming strategy projects include: Building business plans to launch new product features and streaming services (e.g. Hulu on Disney+, Disney+ Perks Program, Disney+ Premier Access), Assessing high-impact partnership and joint venture opportunities (e.g. Disney+/Hulu/MAX Bundle, Venu sports joint venture), Optimizing Disney+ and Hulu content slates and marketing investments to drive subscriber growth and retention, Defining the five-year growth plan trajectory and developing new strategies for growth in each region of the world, Crafting strategy materials for the Board of Directors and the investor community.", "responsibilities": "Structure and build sophisticated financial models for pivotal business development opportunities and growth strategies, Analyze subscriber engagement data to advise content and distribution strategies, helping to optimize the streaming viewer experience, Conduct comprehensive market research to track industry trends and identify new opportunities for growth and innovation, Develop executive-level presentations summarizing key insights and recommendations for streaming leadership and broader Disney leadership team.", "qualifications": {"required": "Bachelor's degree from a top tier university, 3+ years of experience at a top tier investment bank, consulting firm, or comparable corporate strategy/development group, Excel and PowerPoint wizardry, with experience building financial models, Sharp analytical mind capable of structuring ambiguous problems, Outstanding communication skills, both written and verbal, Passion for the intersection of streaming entertainment and technology", "preferred": "Prior experience in entertainment, Experience managing or coaching junior team members"}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3973100284"}