{"jobTitle": "Global Practice Head - Communications (Tele+) Industry Consulting", "company": {"name": "Wipro", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "IT Services and IT Consulting", "description": "Wipro empowers companies to transform their business and deliver superior experiences for their customers, partners, and employees. Our Domain and Consulting (D&C) team is at the heart of this. With an entrepreneurial mindset and a sense of fun, we thoughtfully evaluate clients’ problems; craft innovative solutions that leverage cutting-edge technologies; and work side-by-side with clients to drive business outcomes. Wipro D&amp;C is a proactive force of change, a true partner in our clients’ transformation, and a uniquely powerful group that combines strategic counsel with technical excellence. Our people are the tip-of-the-spear driving change, come join us!<br/><br/>Roles &amp; Responsibilities:<br/><br/><strong>Job Summary<br/><br/></strong>This role will lead the Domain &amp; Consulting’s Communications consulting practice to build on existing capabilities and deliver significant regional à global growth and scale. The primary expectation is to grow the practices portfolio of services, strategic accounts and C-level relationship whilst leveraging our wider Wipro services. Additionally, you will be a key partner in driving the business strategy of the Communications business, with other leaders across the practices globally.<br/><br/><strong>Responsibilities<br/><br/></strong>Core responsibilities will include:<br/><br/><ul><li>Grow and deliver:</li><ul><li>Defining a sound business growth strategy. Focus on growing the consulting business contribution to 15%+ of Comms strength. </li><li>Ensure the consulting business opens new business opportunities and expands Wipro’s client positioning. </li><li>Big picture orientation, conceiving effective strategies to drive growth for the vertical</li><li>Delivery and program expertise with experience in handling multi shore consulting projects with distributed teams</li><li>Ability to drive &amp; lead the strategic execution, manage change, build relationships with clients, partners, motivate teams &amp; achieve results.</li></ul><li>Transform and innovate:</li><ul><li>Significant transformation proposition definition and engagement shaping using core and disruptive business strategies and technologies to solve business problems with clear business benefits.</li><li>Proven track record in growing as well as sustaining and growing client account revenues through existing and new consulting engagements.</li><li>Deep understanding of innovative customer models, products, services and business re-platforming strategies</li></ul><li>Practice Leadership:</li><ul><li>Manage a diverse team of geographically distributed consulting professionals across different experience levels, including their goals &amp; objectives, mentoring, career planning etc. </li><li>Defining &amp; supporting a strong competency/capability-building strategy </li></ul><li>Thought Leadership:</li><ul><li>Ability to converse with industry leaders, analysts and formulate POV on trends and proactively propose solutions, investment decisions along with published artifacts, industry speakerships, analyst interactions etc. </li><li>Creating a strong Wipro Market Positioning - increasing Wipro’s mindshare in the communications and media industries ecosystem (product companies, analysts and influencers)</li></ul><li>Solutions:</li><ul><li>Identifying &amp; defining differentiated services and solutions for various process areas within the Comms sector</li></ul><li>Partnerships:</li><ul><li>Nurture key ecosystem partnerships in key focus areas based on product evaluation/due diligence with the objective of building knowledge and networks.<br/></li></ul></ul>Qualifications:<br/><br/><ul><li></li><ul><li>Experience leading, growing and delivering in a global, fast growing consulting business in communications domains. </li><li>Relevant leadership experience working as an SME in the Communications capability within a consulting and or industry organization.</li><li>Clear understanding of the various services for B2C &amp; B2B segments from an End-to-end perspective across legacy &amp; new age technologies - Telco Cloud, SDN/NFV, LTE, 5G, Edge Computing, Network Automation, Orchestration, Security, Analytics. </li><li>Entrepreneurial drive with a can-do attitude, a strong desire to learn and shape one’s own career path. </li><li>Ownership in Solution incubation and IP-creation</li><li>Good knowledge of the international market and demand including multiple engagements across geographies</li><li>Experience in consultative selling and creating client business case for value-based pitches.</li><li>Outstanding leadership, communication, relationship building and networking skills across clients, partners and your internal organisation. </li><li>Ability to develop and build a public profile with the media and press in addition to speaking at external seminars.</li><li>Creative and motivating consulting leader that can gel diverse teams to common outcomes.</li><li>Gravitas to engage and grow relationships with senior business and clients.</li><li>Exemplary professional and corporate image</li><li>Highly adaptable in dynamic environments </li><li>Integrates effectively into a global matrix environment.</li></ul></ul>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3973351796"}