{"jobTitle": "Operations Manager", "company": {"name": "Cynet Systems", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "43.00/hr - 48.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Information Technology & Services", "description": "<strong>Job Description:<br/> <br/> Pay Range $43hr - $48hr</strong><ul><li> <span> <span> The client owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.</span> </span> </li><li> <span> <span> Here you can be your authentic self. </span> </span> </li><li> <span> <span> As a company uniquely positioned to educate, entertain and empower through our platforms, stands for including everyone. </span> </span> </li><li> <span> <span> The client strives to foster a diverse and inclusive culture where our employees feel supported, embraced and heard. </span> </span> </li><li> <span> <span> We believe that our workforce should represent the communities we live in, so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. </span> </span> </li><li> <span> <span> Click here to learn more about commitment and how we are making an impact.</span> </span> </li><li> <span> <span> Home Entertainment (UPHE) Digital Distribution oversees the transactional film and television businesses including PVOD, PEST, EST and VOD , Focus Features, Illumination, DreamWorks Animation and independent studios. </span> </span> </li><li> <span> <span> Within this group, the Business Operations team focuses on ensuring titles are released accurately and on time across digital platforms and leveraging technology to create operational efficiencies for the Digital business. </span> </span> </li><li> <span> <span> The primary role of the Manager/Senior Manager will be to support the Business Operations Senior Director in title release related system development, vendor oversight, and special projects while managing day-to-day tasks aimed at ensuring clean data flow to downstream systems and teams, identifying and solving system issues as they arise, and leveraging reporting tools to automate business processes. </span> </span> </li><li> <span> <span> In addition, the Manager/Senior Manager is responsible for owning the supply chain process to ensure the timely release of transactional products and working with different stakeholders to help meet the business initiatives.</span> </span> </li> </ul> <span> <span> Responsibilities:</span> </span> <ul><li> <span> <span> Support title release projects from start to completion by helping to define project scope and objectives, identify key stakeholders, create project plans, and maintain cross functional alignment.</span> </span> </li><li> <span> <span> Manage backfill and other retailer-based projects across multiple teams and stakeholders while identifying and securing required resources to meet project goals and delivery timelines.</span> </span> </li><li> <span> <span> Maintain thorough and clear documentation for duration of title and retailer-based projects to ensure transparency, accountability, and collaboration.</span> </span> </li><li> <span> <span> Identify potential risks to project timelines, employ problem solving, and develop mitigation strategies to ensure project success while collaborating across retailers and internal stakeholders.</span> </span> </li><li> <span> <span> Troubleshoot systems and reporting issues impacting title releases.</span> </span> </li><li> <span> <span> Assess and adapt existing workflows to new strategies and to enable greater operational efficiencies for the supply chain.</span> </span> </li><li> <span> <span> Engage in data scrubbing to ensure system accuracy and clean data flow to maintain alignment around titles release strategies.</span> </span> </li><li> <span> <span> Support Sr. Director by providing indirect oversight of the operations team and workflows.</span> </span> </li><li> <span> <span> Provide direction and operational expertise on ad hoc projects supporting business initiatives.</span> </span> </li> </ul> <span> <span> Qualification:</span> </span> <ul><li> <span> <span> 4 years of professional, project management, or related field experience.</span> </span> </li><li> <span> <span> Strong organizational and analytical skills.</span> </span> </li><li> <span> <span> Excellent interpersonal, writing, and communication skills.</span> </span> </li><li> <span> <span> Proficiency using Microsoft Office including Excel.</span> </span> </li> </ul> <span> <span> Eligibility Requirements:</span> </span> <ul><li> <span> <span> Interested candidates must submit a resume/CV online to be considered.</span> </span> </li><li> <span> <span> Must be covered by Solutions, Alternative Dispute Resolution Program.</span> </span> </li> </ul> <span> <span> Characteristics:</span> </span> <ul><li> <span> <span> A team-player who can successfully operate in a team-oriented setting and possesses exceptional interpersonal, communication, and critical thinking skills.</span> </span> </li><li> <span> <span> Detail-oriented self-starter who loves efficiency and is passionate about creating solutions.</span> </span> </li><li> <span> <span> Strong work ethic with the ability to prioritize tasks and manage workload across multiple projects.</span> </span> </li><li> <span> <span> Highly adaptable and excels in fast-paced environments.</span> </span> </li><li> <span> <span> Ability to work under pressure.</span></span></li></ul>", "postedDate": "1 month ago", "skills": ["Microsoft Office", "Excel", "Project Management", "Communication", "Teamwork", "Problem Solving", "Analytical Skills", "Organizational Skills", "Data Analysis", "Workflow Management", "Risk Management", "Stakeholder Management", "Documentation", "Collaboration", "Adaptability", "Time Management", "Detail-Oriented", "Self-Starter", "Fast-Paced Environment", "Pressure Management"], "url": "https://www.linkedin.com/jobs/view/3973657816"}