{"jobTitle": "Strategic Business Development Senior Manager", "company": {"name": "Fever", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100,000.00/yr - 125,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Hi, we’re Fever<br/><br/>We’re excited you are checking out this job offer.<br/><br/>We are <em>the</em> leading global live-entertainment discovery tech platform with a clear mission: <strong>to democratize access to culture and entertainment. <br/><br/></strong>How do we achieve our mission? Fever has developed a proprietary technology that inspires a global community of over 125M people through personalized and curated experiences in their local city whilst empowering entertainment and event creators to reach new audiences and enhance their experience.<br/><br/>Sounds amazing, right?<br/><br/><strong>ABOUT THE ROLE<br/><br/></strong><strong>Here’s what you’ll be doing:<br/><br/></strong><ul><li>Create and cultivate deep business relationships with the biggest producers, creators, venues and key stakeholders in the entertainment industry</li><li>Develop and deliver a growth strategy for the market, with an innovative and effective approach to scaling Fever's presence in the region</li><li>Expertly manage contract negotiations with large partners ensuring sustainable economics and long lasting value for both parties</li><li>Evidence strong organizational skills to effectively balance and grow a large base of clients</li><li>Collaborate closely with cross functional stakeholders to successfully deliver on partner growth nationally and internationally</li><li>Keep up to date with everything cool that’s happening in the entertainment; think of yourself as the expert for new and trending experiences<br/><br/></li></ul><strong>ABOUT YOU<br/><br/></strong><strong>Here’s what you should bring to the table:<br/><br/></strong><ul><li>10+ years of experience either at a top-tier consulting firm and/or proven track record of sales success in a fast-paced, quota-carrying role</li><li>Proven track record of sales success in a fast-paced, quota-carrying role</li><li>Strong business development and partnership management skills</li><li>Self-starter mentality with an ability to work in a demanding, dynamic start-up environment</li><li>Demonstrated data-driven approach to business and task prioritization</li><li>Excellent communication skills both written and verbal along with strong attention to detail</li><li>Comfort in working with Microsoft Office, Google Docs, and a Sales CRM </li><li>Knowledge of the city’s entertainment, events, and lifestyle trends</li><li>Experience in the event and entertainment industry is a plus but not required<br/><br/></li></ul><strong>BENEFITS<br/><br/></strong><ul><li>Attractive compensation package consisting of base salary (between 100k and 125k depending on experience) and the potential to earn a significant bonus for top performance. </li><li>Stock options</li><li>Health and dental insurance</li><li>401(K) plan</li><li>Gympass membership</li><li>40% discount on all Fever events and experiences</li><li>Work from home one day per week (Wednesday or Friday) </li><li>Responsibility from day one and professional and personal growth</li><li>Opportunity to have a real impact in a high-growth global category leader</li><li>Great work environment with a fun, international team of talented people to work with!<br/><br/></li></ul>Thank you for considering joining Fever. We cannot wait to learn more about you!<br/><br/>If you want to learn more about us: Fever's Blog | Tech.Eu |TechCrunch<br/><br/>Fever is committed to creating an inclusive and diverse workspace where everyone's background and ideas count. Our main goal is to find the best possible talent regardless of place of birth, racial or ethnic origin, gender, gender identity, religion, opinion, sexual orientation, disability, pregnancy, marital status, age or caring responsibilities. We encourage everyone to apply!<br/><br/>If you require any kind of accommodation during the selection process please contact our Talent team so we can help you by providing a welcoming and seamless journey.<br/><br/>If you want to know more about how Fever processes your personal data, click here Fever - Candidate Privacy Notice", "responsibilities": "Create and cultivate deep business relationships with the biggest producers, creators, venues and key stakeholders in the entertainment industryDevelop and deliver a growth strategy for the market, with an innovative and effective approach to scaling Fever's presence in the regionExpertly manage contract negotiations with large partners ensuring sustainable economics and long lasting value for both partiesEvidence strong organizational skills to effectively balance and grow a large base of clientsCollaborate closely with cross functional stakeholders to successfully deliver on partner growth nationally and internationallyKeep up to date with everything cool that’s happening in the entertainment; think of yourself as the expert for new and trending experiences", "qualifications": {"required": "10+ years of experience either at a top-tier consulting firm and/or proven track record of sales success in a fast-paced, quota-carrying roleProven track record of sales success in a fast-paced, quota-carrying roleStrong business development and partnership management skillsSelf-starter mentality with an ability to work in a demanding, dynamic start-up environmentDemonstrated data-driven approach to business and task prioritizationExcellent communication skills both written and verbal along with strong attention to detailComfort in working with Microsoft Office, Google Docs, and a Sales CRM Knowledge of the city’s entertainment, events, and lifestyle trendsExperience in the event and entertainment industry is a plus but not required", "preferred": ""}, "skills": ["Business Development", "Sales", "Partnership Management", "Consulting", "Data Analysis", "Communication", "Microsoft Office", "Google Docs", "CRM"], "postedDate": "2 months ago", "benefits": "Attractive compensation package consisting of base salary (between 100k and 125k depending on experience) and the potential to earn a significant bonus for top performance. Stock optionsHealth and dental insurance401(K) planGympass membership40% discount on all Fever events and experiencesWork from home one day per week (Wednesday or Friday) Responsibility from day one and professional and personal growthOpportunity to have a real impact in a high-growth global category leaderGreat work environment with a fun, international team of talented people to work with!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3973159029"}