{"jobTitle": "Strategy Director (Full Time or Freelance)", "company": {"name": "Rapt Studio", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$120,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Design", "description": "At Rapt, we believe that the most compelling experiences are grounded in truth. A company’s authentic truths lie at the intersection of the value they offer, the needs and desires of their audience, and their culture and principles. Strategists are Rapt’s truth-seekers, helping our clients to understand and articulate what makes them meaningful to the world. They also help our own creative teams ensure that every design is grounded in purpose and story, and craft frameworks for presenting creative work effectively. Along the way, they uncover deeper challenges that deserve our attention. As a Strategy Director at Rapt Studio, you will help our clients innovate through strategic design thinking. We welcome candidates from the advertising, branding, and design communication industries. Qualifications<br/><br/><ul><li>15+ years of professional experienceBachelor’s degree in social sciences, psychology, design, or related field</li><li>Extensive experience with large organizations and complex stakeholders</li><li>Strong storytelling skills, and the ability to take in all of the exciting, abstract, and contradictory thoughts that clients have about themselves and simplify them into a few core ideas </li><li>Strong writing skills and the ability to help clients define their verbal identities</li><li>Experience conducting qualitative and quantitative research and using it to inform brand, service, and experience design</li><li>An ability to see the big picture, synthesize insights, and translate them into frameworks for brand strategy and design thinking<br/><br/><br/></li></ul>We're Looking For:<br/><br/><ul><li>A seasoned professional who has a proven track record of mentorship</li><li>A strong leader, who can build consensus with internal teams and client partners</li><li>A flexible thinker with good instincts and high empathy</li><li>A creative, collaborative individual who’s unafraid to try new things and think outside the box</li><li>A simplifier who sees a path forward through complicated ideas and conflicting opinions, and who can communicate this path with clarity, conviction, and purpose</li><li>A team player with experience working interdisciplinarily and collaborating closely with design teams</li><li>A lover of language who’s confident and articulate</li><li>A clear communicator who has experience working directly with clients, and who can build a positive relationship while standing behind a team’s work<br/><br/><br/></li></ul>Compensation is based on employment type, relevant experience, and qualifications. Salary for this role is estimated between $120,000 to $160,000 plus benefits and bonuses.", "responsibilities": "As a Strategy Director at Rapt Studio, you will help our clients innovate through strategic design thinking.", "qualifications": {"required": "15+ years of professional experienceBachelor’s degree in social sciences, psychology, design, or related field\nExtensive experience with large organizations and complex stakeholders\nStrong storytelling skills, and the ability to take in all of the exciting, abstract, and contradictory thoughts that clients have about themselves and simplify them into a few core ideas \nStrong writing skills and the ability to help clients define their verbal identities\nExperience conducting qualitative and quantitative research and using it to inform brand, service, and experience design\nAn ability to see the big picture, synthesize insights, and translate them into frameworks for brand strategy and design thinking", "preferred": "A seasoned professional who has a proven track record of mentorship\nA strong leader, who can build consensus with internal teams and client partners\nA flexible thinker with good instincts and high empathy\nA creative, collaborative individual who’s unafraid to try new things and think outside the box\nA simplifier who sees a path forward through complicated ideas and conflicting opinions, and who can communicate this path with clarity, conviction, and purpose\nA team player with experience working interdisciplinarily and collaborating closely with design teams\nA lover of language who’s confident and articulate\nA clear communicator who has experience working directly with clients, and who can build a positive relationship while standing behind a team’s work"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Salary for this role is estimated between $120,000 to $160,000 plus benefits and bonuses.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3973584991"}