{"jobTitle": "Ambulatory Clinic Department Supervisor", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>Entry level department supervisor to help support the daily management and operations of an ambulatory clinic by ensuring staff provide high quality, accessible, cost effective, and patient-focused care to members across the continuum which comply with local, state, and federal requirements. Responsible for implementing and maintaining clinical practice standards, budgets, and staff development. Will support the delivery of nursing/patient care services that adds value, is integrated with business plans, and meets or exceeds quality, costs, clinical, and utilization standards / performance measures.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Coordinates day to day staffing and workflows. </li><li>Supervises daily operations and ensures staff provide the highest quality of care that is in compliance with the Nurse Practice Act, NCQA, TJC, and federal, state, and local requirements. </li><li>Handles customer service complaints and acts as patient advocate to resolve patient care issues. </li><li>Conducts appropriate audits of front and back office work activities. </li><li>Assists in the development of policies and procedures and monitors adherence. </li><li>Instructs staff on current and new work flows. </li><li>Implements and maintains patient care and quality service standards to meet members and internal clients expectations. </li><li>Recommends and evaluates processes to improve systems and patient care services across the continuum of care. </li><li>Determines the appropriate staff mix for clinic operations. </li><li>Assists in providing on going staff development. </li><li>Implements and monitors departmental policies and procedures which support the organizations goals and business objectives and ensures they are met. </li><li>Collaborates with physicians, department chief, and department manager in developing the appropriate level of patient care services and the day-to-day operations of the department. </li><li>Assists in managing and resolving human resource, labor relations, employee and department safety, and risk management issues. <br/><br/></li></ul><strong>Experience<br/><br/></strong><strong>Basic Qualifications:<br/><br/></strong><ul><li>Minimum one (1) year of experience in ambulatory care or other relevant healthcare experience required. </li><li>OR</li><li>Minimum one (1) year in leadership capacity. <br/><br/></li></ul>Education<br/><br/><ul><li>Associates Degree or two (2) years of experience in a directly related field. </li><li>High School Diploma or General Education Development (GED) required. <br/><br/></li></ul>License, Certification, Registration<br/><br/><ul><li>N/A<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Excellent customer service skills. </li><li>Ability to manage conflict. </li><li>Ability to instruct clearly. </li><li>Demonstrated interpersonal skills; knowledge of ambulatory care practices/operations/issues. </li><li>Knowledge of applicable regulatory requirements. </li><li>Ability to demonstrate proficiency with electronic health record as indicated within six months of hire. </li><li>Must be able to work in a Labor/Management Partnership environment. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Minimum one (1) year of supervisory experience. <br/><br/></li></ul><strong>Notes<br/><br/></strong><ul><li>EE will be responsible for pre-analytical operations to include scheduling of 90+ EEs, CPT license and clinical hospital lab experience preferred;</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3973985538"}