{"jobTitle": "Supply Chain Planning Manager (Starship)", "company": {"name": "SpaceX", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "110,000.00 - 145,000.00/per year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.<br/><br/><strong>SUPPLY CHAIN PLANNING MANAGER (STARSHIP)<br/><br/></strong>This is a high-profile, cross functional position that plays an integral role in enabling production flow and supporting launch manifest. Working in close coordination with engineering and manufacturing departments, supply chain planners execute effective, creative, and smart supply chain strategies to achieve production goals. Some of the functions a supply chain planner will be responsible for include material requirements planning, purchasing, supplier delivery management, dock-to-stock coordination, and inventory levels management. With all integration and capsule refurbishment taking place in-house, supply chain planners are able to see their assemblies come to life every day!<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Show initiative in developing new methods or processes to ensure the highest quality product and efficient methods utilized </li><li>Evaluate technical feasibility of work content and understand suppliers’ technical capabilities and limitations</li><li>Inform DFM discussions based on vendor feedback</li><li>Ensure partners are prepared to support prototype builds with appropriate equipment, material to ensure a successful product development, ramping up and production</li><li>Take ownership of team effort to develop and implement sourcing and cost management strategies that support existing platforms and new product development</li><li>Present value propositions to SpaceX management, including those related to contract award, cost reviews, cost reduction strategies and critical supply issues</li><li>Manage cost aggressively to ensure adherence to project-specific budgets, forecasts and develop should-cost models for competitive cost analysis</li><li>Develop clear technology and commodity roadmaps for current commodity, product, vertical as they relate to future SpaceX programs</li><li>Be the liaison between supply chain and engineering for supplier and down selection during NPI while improving or sustaining cost targets</li><li>Ability to develop and maintain strong relationships across disciplines and multiple levels of management</li><li>Manage supply base from concept to end of life to ensure continuity of supply (COS) with the right materials driving plan in place and on time delivery</li><li>Responsible for creating POs, on-time delivery of materials for both internal and external operations, invoice resolution, meeting company quality requirements while meeting company cost targets</li><li>Guide junior staff members in some aspects of their jobs and provides strategic support whenever needed<br/><br/></li></ul><strong>Basic Qualifications</strong> <br/><br/><ul><li>Advanced degree and 3+ years of experience working in one or more of the following; or bachelor’s degree and 5+ years of experience working in one or more of the following; or 9+ years of experience working in one or more of the following:</li><ul><li>Engineering</li><li>Purchasing</li><li>Contract negotiation</li><li>Material or production planning</li><li>Operations or supply chain management</li><li>Material cost control</li><li>Master production scheduling<br/></li></ul></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li>Capable of managing existing external supply chain and suppliers both domestic and globally</li><li>Vast experience within supply chain (technical procurement, product development, NPI, manufacturing and negotiating high volume products)</li><li>Technical knowledge in a commodity (e.g. composites raw material, composite component manufacturing, machining, soft goods etc.)</li><li>Individual negotiation skills with the ability to influence</li><li>Proven track record of taking ownership, successfully negotiating preferred pricing and driving results</li><li>Exceptional analytical, problem solving, and organizational skills</li><li>Effective written, verbal and presentation communication skills</li><li>Detail-oriented, self-motivated and able to respond quickly to a fast-moving and ever-changing environment</li><li>Conducts all activities with the highest level of integrity</li><li>Experience of planning purchasing of commodity products and 3rd party services working as a team with product development, quality, finance and sales<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Must be able to travel - up to 30% work week travel may be required, including international travel</li><li>Must be able to work extended hours and/or weekends as needed to meet major milestones</li><li>This position is based in Hawthorne, CA and requires being onsite - remote work not considered<br/><br/></li></ul><strong>Compensation And Benefits<br/><br/></strong>Pay Range:<br/><br/>Supply Chain Planning Manager: $110,000.00 - $145,000.00/per year<br/><br/>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.<br/><br/>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.<br/><br/><strong>Itar Requirements<br/><br/></strong><ul><li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C.</li><li>1157, or (iv) Asylee under 8 U.S.C.</li><li>1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. <br/><br/></li></ul>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.<br/><br/>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.", "responsibilities": "This is a high-profile, cross functional position that plays an integral role in enabling production flow and supporting launch manifest. Working in close coordination with engineering and manufacturing departments, supply chain planners execute effective, creative, and smart supply chain strategies to achieve production goals. Some of the functions a supply chain planner will be responsible for include material requirements planning, purchasing, supplier delivery management, dock-to-stock coordination, and inventory levels management. With all integration and capsule refurbishment taking place in-house, supply chain planners are able to see their assemblies come to life every day!", "qualifications": {"required": "Advanced degree and 3+ years of experience working in one or more of the following; or bachelor’s degree and 5+ years of experience working in one or more of the following; or 9+ years of experience working in one or more of the following:\n\n* Engineering\n* Purchasing\n* Contract negotiation\n* Material or production planning\n* Operations or supply chain management\n* Material cost control\n* Master production scheduling", "preferred": "Capable of managing existing external supply chain and suppliers both domestic and globally\nVast experience within supply chain (technical procurement, product development, NPI, manufacturing and negotiating high volume products)\nTechnical knowledge in a commodity (e.g. composites raw material, composite component manufacturing, machining, soft goods etc.)\nIndividual negotiation skills with the ability to influence\nProven track record of taking ownership, successfully negotiating preferred pricing and driving results\nExceptional analytical, problem solving, and organizational skills\nEffective written, verbal and presentation communication skills\nDetail-oriented, self-motivated and able to respond quickly to a fast-moving and ever-changing environment\nConducts all activities with the highest level of integrity\nExperience of planning purchasing of commodity products and 3rd party services working as a team with product development, quality, finance and sales"}, "skills": ["Engineering", "Purchasing", "Contract negotiation", "Material or production planning", "Operations or supply chain management", "Material cost control", "Master production scheduling"], "postedDate": "2 weeks ago", "benefits": "Pay Range:\n\nSupply Chain Planning Manager: $110,000.00 - $145,000.00/per year\n\nYour actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.\n\nBase salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973566797"}