{"jobTitle": "Account Executive- HR Solutions", "company": {"name": "Paychex", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "<strong>Overview<br/><br/></strong>Selling Company's products and services by developing new clients and increasing the client base to increase profits in the Sale of Human Resource Services and PEO Sales organizations.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Leverage the Go-to-Market Sales Strategy to identify customers’ needs and present the Paychex solution to key stakeholders and decision makers in accordance with the client’s preference on in person or virtual interaction to increase revenue and market share.</li><li>Scheduling appointments and visiting potential and current referral sources to secure referrals to end users.</li><li>Prospecting for new clients and new referral sources utilizing the telephone, direct mail, seminars, current client visits, or other local marketing programs directed by Sales management.</li><li>Analyzing the customer needs and interests, determining which products are appropriate and referring to appropriate party when necessary.</li><li>Expediting the resolution of customer problems or complaints.</li><li>Completing and submitting accurate new business paperwork, expense reports and weekly activity reports by agreed upon dates set by Sales management.</li><li>Projecting a positive image in representing the Corporation to clients and the community.</li><li>Achieving technical, competitive and sales skills knowledge. Competency is measured by the successful attainment of objectives and performance within the HR Solutions and PEO Sales.</li><li>May be required to travel outside of geographical territory for purposes of attending Conference, training sessions and/or area Zone meetings.</li><li>Attend partner meetings to educate on HR Solutions and PEO services and processes.</li><li>Onboard HR Solutions and PEO clients, following policies and procedures to ensure a smooth transition onto the HR Solutions or PEO service.</li><li>Expediting the resolution of client problems or complaints to facilitate a positive onboarding experience.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>H.S. Diploma</li><li>Bachelor's Degree - Preferred</li><li>2 years of sales/marketing experience</li><li>Valid Drivers License required<br/><br/></li></ul><strong>Compensation<br/><br/></strong>In the spirit of pay transparency, we are excited to share that the starting base pay for this position is $29.33 hourly which is equal to $61,000 annually + bonus. Please keep in mind that this is the base pay only and does not consider other components that make up the total rewards package for the position. If you are hired at Paychex, your overall compensation will be determined based on factors such as geographic location, skills, education, and/or experience which may result in total compensation outside of this range.", "responsibilities": "Leverage the Go-to-Market Sales Strategy to identify customers’ needs and present the Paychex solution to key stakeholders and decision makers in accordance with the client’s preference on in person or virtual interaction to increase revenue and market share. Scheduling appointments and visiting potential and current referral sources to secure referrals to end users. Prospecting for new clients and new referral sources utilizing the telephone, direct mail, seminars, current client visits, or other local marketing programs directed by Sales management. Analyzing the customer needs and interests, determining which products are appropriate and referring to appropriate party when necessary. Expediting the resolution of customer problems or complaints. Completing and submitting accurate new business paperwork, expense reports and weekly activity reports by agreed upon dates set by Sales management. Projecting a positive image in representing the Corporation to clients and the community. Achieving technical, competitive and sales skills knowledge. Competency is measured by the successful attainment of objectives and performance within the HR Solutions and PEO Sales. May be required to travel outside of geographical territory for purposes of attending Conference, training sessions and/or area Zone meetings. Attend partner meetings to educate on HR Solutions and PEO services and processes. Onboard HR Solutions and PEO clients, following policies and procedures to ensure a smooth transition onto the HR Solutions or PEO service. Expediting the resolution of client problems or complaints to facilitate a positive onboarding experience.", "qualifications": {"required": "H.S. Diploma", "preferred": "Bachelor's Degree - Preferred, 2 years of sales/marketing experience, Valid Drivers License required"}, "skills": [], "postedDate": "2 weeks ago", "benefits": null, "remoteWork": null, "salary": {"amount": "$29.33 hourly which is equal to $61,000 annually + bonus", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3973049358"}