{"jobTitle": "Analytics Engineer - Remote", "company": {"name": "A+E Networks", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Entertainment Providers", "description": "<em>Work Locations: With the exception of some select roles that have in-office requirements, A+E Networks operates on a flexible model that allows for remote, hybrid or full time in office work (in certain locales). <br/><br/></em><em>Office locations include New York City, Los Angeles, Chicago, and Stamford, CT. <br/><br/></em><em>Our list of eligible states in which employees may work remotely includes: California, Connecticut, Florida, Georgia, Illinois, Indiana, Maryland, Massachusetts, Michigan, Minnesota, Nevada, New Hampshire, New Jersey, New York, North Carolina, Oregon, South Carolina, South Dakota, Texas, West Virginia, Wisconsin, and Wyoming.<br/><br/></em><strong>Division Story<br/><br/></strong>Do numbers tell you stories? Can you relay complex information in bite-sized nuggets to non-researchers? Do you enjoy influencing business decisions by providing fact-based recommendations infused with intuition? Our Research and Insights Team is comprised of wizards who practice the craft of “art and science.” We spend much of our time looking back at performance — and even more time looking forward making actionable recommendations for growing our business. We specialize in content, audience and revenue insights across all platforms. Come check out our pioneering work in predictive modeling, performance marketing and algorithms. Pocket protectors not required.<br/><br/><strong>Job Description<br/><br/></strong><strong>THE ROLE: Analytics Engineer<br/><br/></strong>As an Analytics Engineer in our Data Team within the Research Department, you will play a pivotal role in building cutting-edge prototypes of data tools. Your responsibilities will encompass both the art of Exploratory Data Analysis (EDA) and the skill of leveraging data to generate actionable insights. In this dynamic position, you will collaborate closely with a team of innovative professionals to transform complex data into actionable insights, driving our mission to create groundbreaking solutions for diverse business needs. If you're passionate about harnessing the power of data to build prototypes that make an impact, this role is your opportunity to shine.<br/><br/><strong>MORE ABOUT WHAT YOU’LL DO:</strong> <strong>Analytics Engineer<br/><br/></strong><ul><li>Collaborate with Business Users: Proactively engage with various business users across the organization, even when faced with open-ended requirements. Your ability to work comfortably in such scenarios will be crucial in uncovering the true needs and challenges of the team. Through effective communication and problem-solving, you'll identify opportunities where data tools can enhance productivity and provide valuable insights.</li><li>Effective Communication: Demonstrate the ability to clearly communicate insights and the intricacies within the data to the wider research team. Your proficiency in data visualization and presentation skills will be essential in conveying complex findings in a comprehensible manner, fostering a deeper understanding of data-driven insights among team members.</li><li>Prototype Development: Utilize your expertise in Python and SQL to build robust prototypes. Dive deep into the data, comfortably exploring it and identifying edge cases that may impact the effectiveness of the tools. Transform abstract ideas into tangible solutions, ensuring that the prototypes meet initial requirements and account for unforeseen challenges. Your keen eye for data nuances will be invaluable in this process.</li><li>Bridge the Gap with IT: Collaborate with the IT department to bridge the transition from prototypes to production-ready solutions. Work hand in hand with the IT team to ensure that the developed tools are seamlessly integrated into the organization's infrastructure and processes. Your ability to communicate technical requirements and concepts and dedication to writing clean and modular code will facilitate the smooth transition from prototype to production.<br/><br/></li></ul><strong>YOUR STORY: [+BEHAVIORS] <em>(what you need to have)</em></strong> : <strong>Analytics Engineer<br/><br/></strong><strong>Expertise<br/><br/></strong><ul><li>Data Analysis: Proven experience with a strong background in conducting Exploratory Data Analysis (EDA) and data mining. Proficiency in using data analysis techniques to derive insights from complex datasets.</li><li>Programming: Expertise in Python and/or SQL. Capable of both manipulating and analyzing data effectively and developing data-driven solutions while excelling in writing clean and modular code.</li><li>Business Intelligence Tools: Experience using business intelligence tools like DOMO, Tableau, or similar platforms to create interactive data visualizations and reports for decision-makers.</li><li>Cloud Platforms: Familiarity with cloud platforms, particularly AWS and/or Azure. Experience with services like EC2 and S3 is essential for managing data and infrastructure in a cloud environment.</li><li>Machine Learning and Statistics: A fundamental understanding of machine learning and statistical concepts to enhance data analysis, including basic predictive modeling and classification techniques, while also aiding in identifying data nuances for more effective Exploratory Data Analysis (EDA) is a plus.<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Analytical Mind: Possess an analytical mindset that enables you to dissect complex problems, identify patterns, and draw meaningful conclusions from data.</li><li>Business Acumen: Understanding of business processes and acumen to align data analysis and insights with organizational objectives, translating data into actionable recommendations.</li><li>Problem-Solving Aptitude: Strong problem-solving skills that allow you to tackle challenges creatively and develop data-driven solutions to meet business needs.</li><li>Communication and Presentation: Excellent communication and presentation skills to convey data findings and insights clearly and persuasively to both technical and non-technical stakeholders.</li><li>Passion for Continuous Learning: A strong inclination towards self-improvement and a genuine interest in staying updated with new techniques and advancements in data analysis, machine learning, and artificial intelligence. This reflects a personal passion for expanding knowledge and applying the latest methodologies to enhance data-driven projects and solutions.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>A Bachelor's degree in a related field such as Computer Science or Data Science. This educational background provides a solid foundation for applying data analysis in real-world scenarios and writing clean code.</li><li>5+ years of experience within Analytics Engineering / Data Engineering / Data Science.</li><li>Experience in TV/Media content or Consumer-facing industry is not required but candidate should be interested in the media space.<br/><br/></li></ul><strong>WHAT YOU’LL LEARN:</strong> <strong>Analytics Engineer<br/><br/></strong>As the media industry grapples with fragmentation and disruption, a key facet of Research is to be the driving force in helping their company capture, report on, monetize, and understand audiences. An opportunity lies in Research to work across divisions and departments to create a unified language that ensures that internal clients understand—and take advantage of—complex metrics. The key is giving the necessary context so that decisions can be made. While this sounds disarmingly simple, it is a challenge to get the majority of the company to speak the same language and understand new vernacular. Research is a central force within the broader organization in gaining an objective perspective for a wide array of complex questions. It may sound academic – and certainly there is a portion of the job that requires a love of learning – but the primary attribute that will bring you success is curiosity. For example, you’ll gain a deeper understanding of what motivates someone to tune into a show, buy a product based on placement of an ad, become a fan on social media, or why certain types of programs are successful across regions of this country and abroad. Ultimately, each research candidate gets a better understanding of the rigor that goes into making business decisions by uncovering not boulders, but pebbles along the path to connecting to A+E Networks core asset, its content.<br/><br/><strong>Compensation<br/><br/></strong>Annual Pay Range: $121,750 - $140,012<br/><br/>Annual Incentive Target: 10.00%<br/><br/><em>The annual/hourly</em> <em>pay range displayed serves as a</em><em> good faith estimate of</em><em> the <br/><br/></em><em>minimum and </em><em>maximum </em><em>base </em><em>pay </em><em>range </em><em>for this role. </em><em>Compensation for the role</em><em> will <br/><br/></em><em>be based on </em><em>a </em><em>number of different </em><em>factors such as </em><em>a candidate’s qualifications, skills, <br/><br/></em><em>competencies, </em><em>location, and </em><em>experience. </em><em>A+E offers a competitive total compensation <br/><br/></em><em>package, which </em><em>includes healthcare coverage, 401k matching, and a range of other benefits. </em><em>Learn more at aenetworks.com/careers.<br/><br/></em><em>A+E Networks proudly provides equal employment opportunity for all employees and job applicants, and makes employment decisions consistent with this principle. The company’s employment actions and decisions – including recruitment, hiring, training, promotion, demotion, compensation, transfer, layoff, and termination – are made without regard to an employee’s race, color, religion, creed, age, national origin, ancestry, sex (which includes pregnancy, childbirth, breastfeeding, and related medical conditions), gender, sexual orientation, gender identity, gender expression, marital status, alienage or citizenship status, physical and/or mental disability, medical condition, family and medical leave status, genetic information, military or veteran status, or any other characteristic protected by applicable law.<br/><br/>A+E Television Networks is a joint venture of the Hearst Corporation and The Walt Disney Company.<br/><br/>We are proud to be an Affirmative Action/Equal Opportunity Employer/Disabled/Veterans.</em>", "responsibilities": "As an Analytics Engineer in our Data Team within the Research Department, you will play a pivotal role in building cutting-edge prototypes of data tools. Your responsibilities will encompass both the art of Exploratory Data Analysis (EDA) and the skill of leveraging data to generate actionable insights. In this dynamic position, you will collaborate closely with a team of innovative professionals to transform complex data into actionable insights, driving our mission to create groundbreaking solutions for diverse business needs. If you're passionate about harnessing the power of data to build prototypes that make an impact, this role is your opportunity to shine.", "qualifications": {"required": "Data Analysis: Proven experience with a strong background in conducting Exploratory Data Analysis (EDA) and data mining. Proficiency in using data analysis techniques to derive insights from complex datasets.\nProgramming: Expertise in Python and/or SQL. Capable of both manipulating and analyzing data effectively and developing data-driven solutions while excelling in writing clean and modular code.\nBusiness Intelligence Tools: Experience using business intelligence tools like DOMO, Tableau, or similar platforms to create interactive data visualizations and reports for decision-makers.\nCloud Platforms: Familiarity with cloud platforms, particularly AWS and/or Azure. Experience with services like EC2 and S3 is essential for managing data and infrastructure in a cloud environment.\nMachine Learning and Statistics: A fundamental understanding of machine learning and statistical concepts to enhance data analysis, including basic predictive modeling and classification techniques, while also aiding in identifying data nuances for more effective Exploratory Data Analysis (EDA) is a plus.", "preferred": "A Bachelor's degree in a related field such as Computer Science or Data Science. This educational background provides a solid foundation for applying data analysis in real-world scenarios and writing clean code.\n5+ years of experience within Analytics Engineering / Data Engineering / Data Science.\nExperience in TV/Media content or Consumer-facing industry is not required but candidate should be interested in the media space."}, "skills": ["Data Analysis", "Python", "SQL", "Business Intelligence Tools", "DOMO", "Tableau", "Cloud Platforms", "AWS", "Azure", "EC2", "S3", "Machine Learning", "Statistics", "Predictive Modeling", "Classification Techniques", "Analytical Mind", "Business Acumen", "Problem-Solving", "Communication", "Presentation", "Continuous Learning"], "postedDate": "1 day ago", "salary": {"amount": "121,750 - 140,012", "currency": "USD"}, "benefits": "healthcare coverage, 401k matching, and a range of other benefits", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3973046512"}