{"jobTitle": "Vice President (VP), Product Management", "company": {"name": "Ad Hoc Labs (makers of Burner + Dialed)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Ad Hoc Labs are the makers of Burner, one of the top-grossing independent apps in the world. Our mission is to build best-in-class software that empowers our customers to better control their privacy, communications, and identity–and to do it as a self-sustaining company whose culture and practices we can be proud of. For over a decade, Burner has led the virtual phone number category, delivering control and privacy to millions of customers, without the hassles of wireless carriers and contracts. Burner was named a top 50 app by TIME and has been covered extensively in the press, including the New York Times, who said “a thin layer of privacy between yourself and the rest of the world, when needed, is hard to put a price on.” We couldn’t agree more. We are looking for the product leader who will help us build on this successful foundation and, in this time of rapid innovation in communications technologies, guide and lead our execution against opportunities that will have an even larger impact. What You'll Do<br/><br/><ul><li>Lead and build the product and design team, fostering a culture that’s ambitious, data driven, customer centric, and relentlessly focused on excellent outcomes</li><li>Serve as a strategic thought leader, internally and externally, helping set the course for our largest investments and championing them effectively to stakeholders</li><li>Build and execute against a product roadmap that drives innovation, user experience, technical leadership, and strategic impact</li><li>Collaborate and align with company leaders and teams including Engineering, Marketing, Operations, Analytics, Legal, and more, leading cross-functional initiatives and driving effective processes and communications</li><li>Participate in company leadership, team and culture development, and career mentorship<br/><br/><br/></li></ul>Qualifications<br/><br/><ul><li>A track record of 10+ years in product management, with a history of shipping complex consumer, mobile, privacy, and/or communications products successfully</li><li>Experience managing mobile products, in the mobile/app store ecosystem, leading consumer subscription products, working with messaging or telecom products, or equivalent, relevant domain experience </li><li>Leadership experience–a history of building and developing teams, as well as driving them to meaningful outcomes with a sense of urgency and excellence. </li><li>Demonstrated ability to drive strategic prioritization and synthesize across complex inputs to drive product decisions, technical tradeoffs, and customer metrics</li><li>A demonstrated ability to problem-solve, manage scope, and ship high-quality products effectively from ideation to market impact</li><li>The hard product skills, product sense, technical insight, and quantitative acumen to lead complex products to market and to be the standard-bearer for best practices across product management touchpoints in the company</li><li>Passion for consumer control, privacy, and independence<br/><br/><br/></li></ul>Perks &amp; Benefits<br/><br/><ul><li>Health and Dental coverage for employees, dependents, and domestic partners</li><li>401K with company 4% match</li><li>Choose how you want to invest in your career development. </li><li>We reimburse for training, conferences, and online learning resources</li><li>Work remotely in style, with a stipend to set up or enhance your remote work setup<br/><br/><br/></li></ul>Ad Hoc Labs is a Los Angeles based–but primarily remote–company. However, for this specific role we prefer candidates in Southern California or at least the pacific or mountain time zone. We are committed to building a diverse, inclusive company and we encourage applications from candidates of all backgrounds. Ad Hoc Labs is a remote-first company. Select roles may require regional geography and/or frequent travel. All candidates need to be able to maintain a productive remote working environment with access to video-quality internet. We are committed to building a diverse, inclusive company and we encourage applications from candidates of all backgrounds.", "jobFunction": "Product Management and Marketing", "industry": "Software Development", "postedDate": "1 month ago", "benefits": "Health and Dental coverage for employees, dependents, and domestic partners, 401K with company 4% match, Choose how you want to invest in your career development., We reimburse for training, conferences, and online learning resources, Work remotely in style, with a stipend to set up or enhance your remote work setup", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3973166561"}