{"jobTitle": "Shredder Maintenance Manager", "company": {"name": "American Iron & Metal (AIM)", "location": "Colton, CA"}, "location": "Colton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Distribution", "industry": "Utilities", "description": "<strong>Company Description<br/><br/></strong>American Iron & Metal (AIM) is a family-owned company and recognized global leader in the metal recycling industry with more than 125 sites and 3500 employees worldwide. We have continued to prosper for the last eight decades (we just celebrated our 86th birthday!) thanks to the dedication of our employees and the ongoing trust and support of our customers.<br/><br/>Become part of the AIM community, a growing team with an entrepreneurial spirit who has over the years evolved into a successful and multifaceted company with business divisions that include metal recycling, decommissioning and demolition, auto-parts sales and recycling, manufacturing of solder assemblies, construction waste recycling, and production of customized industrial and mining products.<br/><br/>We take pride in doing good things for the environment to help create a greener, more sustainable future for all.<br/><br/>It’s simple; we do it right. We AIM for excellence.<br/><br/><strong>Job Description<br/><br/></strong>The Shredder Maintenance Manager is responsible for the maintenance and repairs of electrical, plumbing, heating, ventilation, and air conditioning (HVAC), carpentry, painting, and other building systems.<br/><br/>Essential Duties:<br/><br/><ul><li> Maintenance and production of a metal shredder and downstream, including light equipment, heavy duty equipment, conveyor systems, and general facility maintenance.</li><li> Troubleshoot all conveyor systems and various metal processing equipment and create a clear plan of action for fixing necessary parts.</li><li> Ability to identify/troubleshoot/perform electrical issues.</li><li> Fabricate and weld metal components.</li><li> Organizes and cleans the yard as needed.</li><li> Assist and lead other employees with installation/fabrication/and repair of shredder components and downstream components.</li><li> Oversee, manage, and direct all maintenance procedures and operations.</li><li> Evaluates systems or facilities to determine maintenance or repairs that need to be performed.</li><li> Assesses building systems to plan work assignments and project schedules.</li><li> Ensures maintenance and repair work is completed correctly and in a timely manner.</li><li> Assists with departmental budget estimates and costs of specific repair projects.</li><li> Conduct monthly inventory.</li><li> Ensure all machinery is up to working standards.</li><li> Assess current maintenance work processes, to optimize efficiency.</li><li> Use data analysis to help prepare for and prevent future problems.</li><li> Train new employees in maintenance work processes and procedures.</li><li> Record and track daily progress/error reports.</li><li> Maintain vendor relationships and order new materials as needed.</li><li> Enforce all health and safety rules and regulations according to state/federal laws and company protocol.</li><li> Complete mandatory weekly/monthly or as needed, safety trainings via computer in an office environment.</li><li> Performs other related duties as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5-7 years of experience preferred.</li><li> Problem solving, reasoning, and “thinking out of the box” will be a constant requirement; in addition, applying common sense understanding to better serve our guests’ needs.<br/><br/></li></ul>Physical Demands:<br/><br/><ul><li>Prolonged periods of walking and standing.</li><li>Must be able to lift up to 40 pounds at a time.</li><li>Occasionally sits, climbs, balances, stoops, kneels, crawls or crouches.</li><li>Physically able to conduct inspections and carry equipment used for inspections.</li><li>Extended periods of reaching with hands and arms.</li><li>Consistently turning and moving of hands, arms, feet, and legs</li><li>Must have working knowledge of recycling material.</li><li>Thorough understanding of or the ability to quickly learn production operations and machinery.</li><li>Excellent time management skills with a proven ability to meet deadlines.</li><li>Must have strong organizational skills and the ability to multi-task.</li><li>Must display strong motivation and resourcefulness; be self-motivated.</li><li>Proficient in Microsoft Office Suite or similar software.</li><li>Willing to work different shifts and travel up to 25% of the time.</li><li>Excellent analytical and problem-solving skills.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><ul><li>A competitive salary ($100,000+), vacation time acrued, benefits and a 401k matching program.</li><li>The tools and support needed to be successful in your career and professional development.</li><li>A dynamic &amp; rewarding work environment that is also a lot of fun!</li></ul>", "postedDate": "1 month ago", "benefits": "A competitive salary ($100,000+), vacation time acrued, benefits and a 401k matching program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973751726"}