{"jobTitle": "Transportation Supervisor", "company": {"name": "Albertsons Companies", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$69,500.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Albertsons Companies is at the forefront of the revolution in retail. With a fixation on raising the bar with innovation and building belonging through our culture, our team is rallying our company around a unique purpose<em><strong>: to create joy around each table and inspire a healthier tomorrow for every community.<br/><br/></strong></em>Albertsons Companies is one of the largest food and drug retailers in the United States, with over 2,200 stores in 34 states and the District of Columbia. Our well-known banners include Albertsons, Safeway, Vons, Jewel-Osco, Shaw's, Acme, Tom Thumb, Randalls, United Supermarkets, Pavilions, Star Market, Haggen, Carrs, Kings Food Markets, and Balducci's Food Lovers Market. We support our stores with 22 distribution centers and 19 manufacturing plants.<br/><br/><strong>Bring your flavor<br/><br/></strong>Building the future of food and well-being starts with you. Join our team and bring your best self to the table.<br/><br/>#bringyourflavor<br/><br/>#<br/><br/><strong>What You Will Be Doing<br/><br/></strong>The position will be based in Brea, CA one of our main regional offices (Seattle, WA, Portland, OR, Pleasanton CA, Denver CO, Dallas TX, Chicago, IL, or Fullerton, CA, Phoenix, AZ).<br/><br/><strong>Main Responsibilities<br/><br/></strong><ul><li>Supervise Transportation Department activities and associates to ensure that all functions are performed within Company, Distribution Center, and Department guidelines. </li><li>Provides excellent customer service to stores serviced through timely order deliveries. </li><li>Routes and schedules loads for distribution to the store, utilizing personnel and equipment in the most efficient manner. Ensures that merchandise is delivered in the best possible condition. </li><li>Coordinates with Warehouse personnel to ensure proper timing for delivery schedules. Partners with Procurement and Traffic staff to coordinate backhauls. </li><li>Assigns drivers to loads ensuring compliance with Company and DOT guidelines. </li><li>Ensures all drivers comply with Company, Federal, State and Local laws and regulations. Ensure that all drivers follow correct check in/out procedures and perform required pre-trip safety checks. Issue road tests as required. </li><li>Maintains good public relations with store management via telephone communications and store visits. Works with store personnel on special requests. </li><li>Processes weekly/monthly reports. </li><li>Ensures compliance with Company and government rules and regulations by all department personnel. <br/><br/></li></ul>The salary range is $69,500 to $85,000 annually. Starting salary will vary based on criteria such as location, experience, and qualifications. There may be flexibility for exceptional candidates. Benefits may include medical, dental, vision, disability and life insurance, sick pay (accrued based on hours worked), PTO/Vacation Pay (accrued based on hours worked) or Flexible Time Off, paid holidays (8-9 days annually), bereavement pay, and retirement benefits (such as 401(k) eligibility). [If applicable:] Associates in this position are also eligible for a quarterly bonus.<br/><br/><em>A copy of the full job description can be made available to you.</em> <br/><br/><strong>What We Are Searching For<br/><br/></strong><ul><li>Previous experience and/or formal training or education in transportation including loading of trailers and store delivery procedures, preferably in the grocery industry. </li><li>Must have a good working knowledge of government regulations pertaining to transportation. </li><li>Possess good leadership skills and the ability to supervise the work of others. Must be able to motivate and work with and through others to achieve desired results. </li><li>Possess good communication skills, both verbal and written. Deal effectively with a wide variety of people both in person and over the telephone. </li><li>Personal computer skills required. Prior experience with Excel and Word applications in a Microsoft Windows environment. Working knowledge of the onboard computer system helpful. </li><li>Requires the analytical ability to handle administrative duties and mental alertness to ensure accurate, safe, and thorough completion of work activities. Possess ability to concentrate and deal with frequent interruptions in a fast-paced environment. <br/><br/></li></ul>We believe the successful candidate has these qualifications and experience:<br/><br/><ul><li>Most work is performed in a temperature controlled office environment. During part of the workday the incumbent may move about the Distribution Center including, the yard, garage and warehouse, potential hazards exist in regard to machinery such as forklifts, pallet jacks, mechanized systems, movement of tractors and trailers, etc. </li><li>Temperatures in the warehouse may vary between –20 to 70 degrees. Noise levels in all areas are within acceptable tolerance ranges for those specific work areas. </li><li>Incumbent may sit for long periods of time at a desk or computer terminal. </li><li>Incumbent will use calculators, keyboards, telephone, and other office equipment in the course of the workday. </li><li>Must be willing to be flexible on work hours and shifts. Operations are 7 days a week, 24 hours a day, including holidays. <br/><br/></li></ul>The above statements are intended to describe the general nature of work performed by the associate(s) in this job. Specific duties and responsibilities may vary by position.<br/><br/><ul><li>Work Remotely <br/><br/></li></ul>No<br/><br/><ul><li>Job Type: Full-time </li><li>Pay: From $70,000.00 per year </li><li>Schedule: <br/><br/></li></ul>Day shift<br/><br/>Holidays<br/><br/>Night shift<br/><br/>Overtime<br/><br/>Weekends as needed<br/><br/><ul><li>Education: <br/><br/></li></ul>High school or equivalent (Required)<br/><br/><ul><li>Experience: <br/><br/></li></ul>Supervising: 2 years (Required)<br/><br/>Leadership: 3 years (Preferred)<br/><br/>Transportation: 2 years (Required)<br/><br/><ul><li>Shift availability: <br/><br/></li></ul>Day Shift (Required)<br/><br/>Night Shift (Required)<br/><br/>Overnight Shift (Required)<br/><br/><strong>What is it like at Albertsons? <br/><br/></strong>Our 290,000 associates have a passion for great service and building lasting relationships with our customers. Through a companywide focus on innovation, we are continually enhancing our digital and product offerings, making it easy for customers to get what they need, wherever they are.<br/><br/><strong>Albertsons is an Equal Opportunity Employer <br/><br/></strong>This Company is an Equal Opportunity Employer, and does not discriminate on the basis of race, gender, ethnicity, religion, national origin, age, disability, veteran status, gender identity/expression, sexual orientation, or on any other basis prohibited by law. Consistent with applicable state and local law, the Company will consider for employment qualified applicants with arrest and conviction records.   <br/><br/>We endeavor to make this site accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at 1-888-255-2269(option #4). <br/><br/>", "responsibilities": "The position will be based in Brea, CA one of our main regional offices (Seattle, WA, Portland, OR, Pleasanton CA, Denver CO, Dallas TX, Chicago, IL, or Fullerton, CA, Phoenix, AZ).<br/><br/><strong>Main Responsibilities<br/><br/></strong><ul><li>Supervise Transportation Department activities and associates to ensure that all functions are performed within Company, Distribution Center, and Department guidelines. </li><li>Provides excellent customer service to stores serviced through timely order deliveries. </li><li>Routes and schedules loads for distribution to the store, utilizing personnel and equipment in the most efficient manner. Ensures that merchandise is delivered in the best possible condition. </li><li>Coordinates with Warehouse personnel to ensure proper timing for delivery schedules. Partners with Procurement and Traffic staff to coordinate backhauls. </li><li>Assigns drivers to loads ensuring compliance with Company and DOT guidelines. </li><li>Ensures all drivers comply with Company, Federal, State and Local laws and regulations. Ensure that all drivers follow correct check in/out procedures and perform required pre-trip safety checks. Issue road tests as required. </li><li>Maintains good public relations with store management via telephone communications and store visits. Works with store personnel on special requests. </li><li>Processes weekly/monthly reports. </li><li>Ensures compliance with Company and government rules and regulations by all department personnel. <br/><br/></li></ul>", "qualifications": {"required": "Previous experience and/or formal training or education in transportation including loading of trailers and store delivery procedures, preferably in the grocery industry. Must have a good working knowledge of government regulations pertaining to transportation. Possess good leadership skills and the ability to supervise the work of others. Must be able to motivate and work with and through others to achieve desired results. Possess good communication skills, both verbal and written. Deal effectively with a wide variety of people both in person and over the telephone. Personal computer skills required. Prior experience with Excel and Word applications in a Microsoft Windows environment. Working knowledge of the onboard computer system helpful. Requires the analytical ability to handle administrative duties and mental alertness to ensure accurate, safe, and thorough completion of work activities. Possess ability to concentrate and deal with frequent interruptions in a fast-paced environment. ", "preferred": "Leadership: 3 years (Preferred)<br/><br/>Transportation: 2 years (Required)"}, "skills": ["Excel", "Word", "Leadership", "Communication", "Transportation"], "postedDate": "1 day ago", "benefits": "The salary range is $69,500 to $85,000 annually. Starting salary will vary based on criteria such as location, experience, and qualifications. There may be flexibility for exceptional candidates. Benefits may include medical, dental, vision, disability and life insurance, sick pay (accrued based on hours worked), PTO/Vacation Pay (accrued based on hours worked) or Flexible Time Off, paid holidays (8-9 days annually), bereavement pay, and retirement benefits (such as 401(k) eligibility). [If applicable:] Associates in this position are also eligible for a quarterly bonus.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973061304"}