{"jobTitle": "Hmong Document Reviewer", "company": {"name": "CGS Federal (Contact Government Services)", "location": "Santa Ana, CA", "industry": "Government Relations Services"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Government Relations Services", "description": "Hmong Chinese Language Document Reviewer<br/><br/>Employment Type: Full Time, Mid-Level<br/><br/>Department: Legal<br/><br/>As a CGS Hmong Chinese Document Reviewer you will play a key role in supporting various aspects of the company's litigation portfolio including eDiscovery activities, workflow management, and litigation support. CGS is seeking an experienced Hmong Chinese Reviewer to join a fast paced and extremely active in-house legal team.<br/><br/>CGS brings motivated, highly skilled, and creative people together to solve government’s most dynamic problems with cutting edge technology. To carry out our mission, we are seeking candidates that are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.<br/><br/>Skills and attributes for success:<br/><br/><ul><li> Conduct research and draft responses for a variety of post-conviction motions</li><li> Conduct research and draft memorandums on questions of law for direct appeals pending before the court and pretrial motions for criminal cases pending at the Federal Court</li><li> Examines, prepares, and processes a wide variety of technical legal documents that are characteristically voluminous and complex in format. Reviews incoming materials and determines the need for assembly and preparation of a variety of legal documents, e.g., motions, orders, answers, pleadings, subpoenas, etc. Obtains needed information from case files, law enforcement agencies, civil client agencies, or other sources, and submits completed legal documents to the appropriate client assistant attorney for review and approval. Prepares such legal actions as indictments, complaints, search warrants, judgments, applications, notices, affidavits, summonses, subpoenas, rules to show cause, proofs of claim, motions for summary judgment, dismissals, satisfactions of judgment, etc. Ensures legal documents are in conformance with rules governing style and format;</li><li> Provides assistance to client attorneys in preparing trial notebooks, assembling jury instructions, compiling witness and exhibit lists. Prepares discovery for plaintiffs and/or defendants in accordance with governing rules and regulations and with the approval of the assigned attorneys. Uses original and online legal resources to verify citations and statutory references contained in legal documents and to ensure citations are complete and consistent with source material;</li><li> Composes original letters not requiring legal interpretations, but that require a good working knowledge of legal and administrative procedures and terminology;</li><li> Produces a variety of written documents and materials utilizing a wide range of office software applications;</li><li> Establishes and maintains a variety of files for client assistant attorneys. Searches legal reference files for information needed by client assistant attorneys in conducting interviews and preparing correspondence. Assemble exhibits, affidavits, and other legal documents from file material. Assembles and organizes files and records material for disposition or transfer to records depositories in accordance with established procedures; and</li><li> Produces a variety of written documents and materials utilizing a wide range of office software applications. For example, assignments may include integrating output from different software types, e.g., tables produced by database applications and charts and graphs produced by electronic spreadsheet applications, into word processing or desktop publishing text<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li> Must have three to five years of progressively more responsible experience on litigation support projects including proven capabilities and communication skills to successfully interact with clients and attorneys</li><li> Requires sound working knowledge of federal and state court systems, legal research procedures, and legal research resources</li><li> Requires excellent written and oral communication skills and thorough knowledge of legal research tools such as LEXIS and Westlaw</li><li> Must have hands-on familiarity with a variety of computer applications, including word processing, databases (such as document review and file management systems), spreadsheets, and imaging</li><li> Role also requires hands-on familiarity with ESI tools and knowledge of eDiscovery procedures and resources</li><li> Requires Law Degree<br/><br/><br/></li></ul>Our commitment:<br/><br/>Contact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting edge technology with world-class personnel to deliver customized solutions that fit our clients’ specific needs. We are committed to solving the most challenging and dynamic problems.<br/><br/>For the past seven years we’ve been growing our government-contracting portfolio, and along the way we’ve created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.<br/><br/>Here at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.<br/><br/>We care about our employees. Therefore, we offer a comprehensive benefits package:<br/><br/><ul><li> Health, Dental, and Vision</li><li> Life Insurance</li><li> 401k</li><li> Flexible Spending Account (Health, Dependent Care, and Commuter)</li><li> Paid Time Off and Observance of State/Federal Holidays<br/><br/><br/></li></ul>Contact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br/><br/>Join our team and become part of meaningful government innovation!<br/><br/>Explore additional job opportunities with CGS on our Job Board:<br/><br/>https://cgsfederal.com/join-our-team/<br/><br/>For more information about CGS please visit: https://www.cgsfederal.com or contact:<br/><br/>Email: info@cgsfederal.com", "responsibilities": "Conduct research and draft responses for a variety of post-conviction motions\nConduct research and draft memorandums on questions of law for direct appeals pending before the court and pretrial motions for criminal cases pending at the Federal Court\nExamines, prepares, and processes a wide variety of technical legal documents that are characteristically voluminous and complex in format. Reviews incoming materials and determines the need for assembly and preparation of a variety of legal documents, e.g., motions, orders, answers, pleadings, subpoenas, etc. Obtains needed information from case files, law enforcement agencies, civil client agencies, or other sources, and submits completed legal documents to the appropriate client assistant attorney for review and approval. Prepares such legal actions as indictments, complaints, search warrants, judgments, applications, notices, affidavits, summonses, subpoenas, rules to show cause, proofs of claim, motions for summary judgment, dismissals, satisfactions of judgment, etc. Ensures legal documents are in conformance with rules governing style and format;\nProvides assistance to client attorneys in preparing trial notebooks, assembling jury instructions, compiling witness and exhibit lists. Prepares discovery for plaintiffs and/or defendants in accordance with governing rules and regulations and with the approval of the assigned attorneys. Uses original and online legal resources to verify citations and statutory references contained in legal documents and to ensure citations are complete and consistent with source material;\nComposes original letters not requiring legal interpretations, but that require a good working knowledge of legal and administrative procedures and terminology;\nProduces a variety of written documents and materials utilizing a wide range of office software applications;\nEstablishes and maintains a variety of files for client assistant attorneys. Searches legal reference files for information needed by client assistant attorneys in conducting interviews and preparing correspondence. Assemble exhibits, affidavits, and other legal documents from file material. Assembles and organizes files and records material for disposition or transfer to records depositories in accordance with established procedures; and\nProduces a variety of written documents and materials utilizing a wide range of office software applications. For example, assignments may include integrating output from different software types, e.g., tables produced by database applications and charts and graphs produced by electronic spreadsheet applications, into word processing or desktop publishing text", "qualifications": {"required": "Must have three to five years of progressively more responsible experience on litigation support projects including proven capabilities and communication skills to successfully interact with clients and attorneys\nRequires sound working knowledge of federal and state court systems, legal research procedures, and legal research resources\nRequires excellent written and oral communication skills and thorough knowledge of legal research tools such as LEXIS and Westlaw\nMust have hands-on familiarity with a variety of computer applications, including word processing, databases (such as document review and file management systems), spreadsheets, and imaging\nRole also requires hands-on familiarity with ESI tools and knowledge of eDiscovery procedures and resources\nRequires Law Degree", "preferred": null}, "skills": ["eDiscovery", "Litigation Support", "Legal Research", "LEXIS", "Westlaw", "ESI", "Document Review", "File Management", "Word Processing", "Databases", "Spreadsheets", "Imaging"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Health, Dental, and Vision\nLife Insurance\n401k\nFlexible Spending Account (Health, Dependent Care, and Commuter)\nPaid Time Off and Observance of State/Federal Holidays", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3973163948"}