{"jobTitle": "Material Handler (Day Shift)", "company": {"name": "Eaton", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "20.00 - 26.40", "currency": "USD"}, "jobFunction": "Other", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "Eaton’s IS AER FMC division is currently seeking a Material Handler (Day Shift).<br/><br/>The hourly rate for this position is $20 - $26.40 per hour. The first shift hours are as follows; 8:30 am - 5:00 pm.<br/><br/>Salaries are based upon candidate skills, experience, and qualifications, as well as market and business considerations.<br/><br/><strong>What You’ll Do<br/><br/></strong>The Material Handler plays a crucial role in fostering a team-oriented environment and showcasing exceptional customer service skills. They advocate for teamwork and partnership and carry out daily tasks in accordance with the company’s safety guidelines to maintain a secure work environment. They uphold a zero-defects and right-the-first-time approach. In collaboration with the Logistics &amp; Materials Supervisor, they work towards the implementation of new strategies and initiatives to effectively fulfill or surpass these requirements and meet customer expectations.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Works Independently: Operates under limited supervision, demonstrating self-reliance and initiative.</li><li>Effective Communication: Communicates effectively with team members, supervisors, and other relevant personnel.</li><li>Receiving and Signing for Shipments: Accepts and signs for incoming packages and shipments from carriers such as UPS, FedEx, DHL, and local couriers.</li><li>Package Segregation: Upon arrival, segregates packages into appropriate categories (e.g., point of use or destination).</li><li>Damage Evaluation: Inspects packages for damage; if damage is detected, prepares claim documents and submits them in accordance with the company’s cargo claims process.</li><li>Data Entry: Performs data entry for inbound shipments using the ERP system.</li><li>Product Placement: Material Handlers ensure that products are delivered to the correct location or personnel within the organization.</li><li>Communication with Purchasing Team: They communicate with the purchasing team regarding shipments that are too early or have discrepancies preventing receipt.</li><li>Picking and Packaging: Material Handlers pull parts based on pick tickets (labels) to ensure correct quantities and lot IDs and delivery kits to focus factories.</li><li>Cure Date Management: They ensure that all cure date information is included in the Pick List for rubber goods.</li><li>Parts Movement Data Entry: Material Handlers record parts movement into the ERP system.</li><li>Stockroom Management: They receive products into the stockroom.</li><li>Assistance via Window: Material Handlers assist personnel through service counter.</li><li>Shipping Preparation: They package goods for shipment using standard commercial packaging or as per customer specifications.</li><li>Shipping Accuracy: Material Handlers ensure that products are shipped to the correct customer via the preferred carrier.</li><li>Shipment Data Entry: They record shipment details in the ERP system, Customer Portals, and courier systems.</li><li>Scheduling Shipments: Material Handlers schedule national and international shipments online and by phone.</li><li>Shipping Documentation: They prepare shipping documents and distribute them upon completion of shipment transactions</li><li>Supporting Contracts Personnel: Material Handlers assist Contracts personnel as needed for status updates or to resolve concerns.</li><li>Other Assigned Duties: They handle any other duties assigned by their Lead or Supervisor<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Basic Qualifications:<br/><br/><ul><li>High school diploma or equivalent from an accredited institution.</li><li>Minimum 1 year of experience in receiving, shipping, warehouse, and inventory control in a Manufacturing environment.</li><li>Minimum 1 year of experience using Microsoft Office programs, Excel, and Word, etc.</li><li>Strong personal work ethic and values, collaborator, and ability to work in a complex environment.</li><li>Relocation is not offered for this role. Candidates must reside within a 50-mile radius of the Los Angeles, CA facility (zip code 90039) to be considered.</li><li>Legally authorized to work in the United States without company sponsorship now or in the future.</li><li>This position requires use of information or access to hardware which is subject to the International Traffic in Arms Regulations (ITAR). All applicants must be U.S. persons within the meaning of ITAR. ITAR defines a U.S. person as a U.S. Citizen, U.S. Permanent Resident (i.e., 'Green Card Holder'), Political Asylee, or Refugee.</li><li>Eaton will consider for employment, qualified applicants with criminal histories in a manner consistent with the requirements of the FCIHO<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Forklift Certified</li><li>DOT/IATA Certified</li><li>Minimum 2 years’ experience as a receiving/shipping clerk.</li><li>Aerospace experience preferred.</li><li>Minimum of 1 year experience using ERP systems<br/><br/><br/></li></ul><strong>Skills<br/><br/></strong>We are committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job-related reasons regardless of an applicant's race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, marital status, genetic information, protected veteran status, or any other status protected by law.<br/><br/>Eaton considers qualified applicants regardless of criminal histories, consistent with local laws. To request a disability-related reasonable accommodation to assist you in your job search, application or interview process, please call us at 1-800-836-6345 to discuss your specific need. Only accommodation requests will be accepted by this phone number.<br/><br/>We know that good benefit programs are important to employees and their families. Eaton provides various Health and Welfare benefits as well as Retirement benefits, and several programs that provide for paid and unpaid time away from work. Click here for more detail: Eaton Benefits Overview. Please note that specific programs and options available to an employee may depend on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.<br/><br/>]]&gt;", "responsibilities": "The Material Handler plays a crucial role in fostering a team-oriented environment and showcasing exceptional customer service skills. They advocate for teamwork and partnership and carry out daily tasks in accordance with the company’s safety guidelines to maintain a secure work environment. They uphold a zero-defects and right-the-first-time approach. In collaboration with the Logistics &amp; Materials Supervisor, they work towards the implementation of new strategies and initiatives to effectively fulfill or surpass these requirements and meet customer expectations.", "qualifications": {"required": "High school diploma or equivalent from an accredited institution.\nMinimum 1 year of experience in receiving, shipping, warehouse, and inventory control in a Manufacturing environment.\nMinimum 1 year of experience using Microsoft Office programs, Excel, and Word, etc.\nStrong personal work ethic and values, collaborator, and ability to work in a complex environment.\nRelocation is not offered for this role. Candidates must reside within a 50-mile radius of the Los Angeles, CA facility (zip code 90039) to be considered.\nLegally authorized to work in the United States without company sponsorship now or in the future.\nThis position requires use of information or access to hardware which is subject to the International Traffic in Arms Regulations (ITAR). All applicants must be U.S. persons within the meaning of ITAR. ITAR defines a U.S. person as a U.S. Citizen, U.S. Permanent Resident (i.e., 'Green Card Holder'), Political Asylee, or Refugee.\nEaton will consider for employment, qualified applicants with criminal histories in a manner consistent with the requirements of the FCIHO", "preferred": "Forklift Certified\nDOT/IATA Certified\nMinimum 2 years’ experience as a receiving/shipping clerk.\nAerospace experience preferred.\nMinimum of 1 year experience using ERP systems"}, "skills": ["Microsoft Office", "Excel", "Word", "ERP systems", "Forklift", "DOT/IATA"], "postedDate": "2 weeks ago", "benefits": "Eaton provides various Health and Welfare benefits as well as Retirement benefits, and several programs that provide for paid and unpaid time away from work. Click here for more detail: Eaton Benefits Overview. Please note that specific programs and options available to an employee may depend on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973673913"}