{"jobTitle": "Entry Level Associate Recruiter / HR Assistant", "company": {"name": "Elysium Ventures", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are seeking an energetic, forward-thinking, and passionate team player to join our Human Resources team. As an entry-level Associate Recruiter and HR Assistant, you would actively receive full training and apply new skill sets and knowledge from day one. We pride ourselves on our ability to develop others, starting with our recruitment team.<br/><br/>As an entry-level Associate Recruiter and HR Assistant, you will have an incredible impact as the initial point of contact and first impression for all candidates. You also play a significant role in shaping our company culture and finding individuals who embody our core values and customer-focused mission. Finding the right people for the right position is the first line of defense to providing great customer service.<br/><br/>Entry Level Associate Recruiter and HR Assistants will receive training in:<br/><br/><ul><li>Sourcing qualified candidates using online databases, networking and employee referrals</li><li>Contact candidates who apply to positions in your assigned sector and conduct preliminary phone screenings in order to assess a candidate's skill sets, competence, and ability to thrive in our organization</li><li>Move qualified candidates through the recruitment pipeline while maintaining constant contact and following all HR protocols</li><li>Maintain an accurate candidate database through thorough candidates notes, codes and contact methods</li><li>Build incredible relationships with candidates at all stages of the recruitment process in order to ensure high closure rates</li><li>Assist with all new start and on-boarding procedures</li><li>Additional projects as assigned<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>1-2 years experience in a customer-facing position</li><li>Must have excellent communication skills (written and verbal)</li><li>Must be friendly, outgoing and authentically personable</li><li>Have the ability to thrive in both team and independent work environments</li><li>Flexible working hours for short term deadlines</li><li>Ability to work in-person in our Santa Ana, CA office 5 days a week<br/><br/></li></ul>Powered by JazzHR<br/><br/>W9BDrw1pvY<br/><br/>", "jobFunction": "Human Resources", "industry": "Internet Publishing", "postedDate": "1 month ago", "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974405276"}