{"jobTitle": "REGIONAL DIRECTOR OF OPERATIONS", "company": {"name": "Twenty Four Seven Hotels", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "<strong>Twenty Four Seven Hotels </strong> is currently seeking an experienced hospitality professional to join our leadership team as <strong>Regional Director of Operations.</strong> This position will help develop strategy to lead the company to success with outstanding financial performance, associates and guest satisfaction. The RDO will provide leadership to their assigned portfolio of Hotels. In this role, you will help us<strong> craft inspired workplaces that enable our Associates to deliver kick-ass guest experiences and maximize investor returns !</strong> This could be the perfect opportunity to advance your career with a growing and exciting hotel management company!<br/><br/><ul><li>SO-CAL BASED REQUIRED** <br/><br/></li></ul><strong>Position Responsibilities<br/><br/></strong><ul><li>Proactively lead and support properties to deliver desired results, continually improving guest service, profitability and associate satisfaction</li><li>Supporting company-wide programs, communication channels and other enterprise-wide initiatives</li><li>Manage Profit &amp; Loss statements with the ability to effectively train GM's and other managers in financial responsibility</li><li>Review, analyze and respond to performance metrics/data received from various reporting systems.</li><li>Ensure all brand standards are in place and help implement any new or updated brand initiatives as needed</li><li>Track QA/Brand visits/inspections and achieves outstanding results</li><li>Train, hire, mentor, assist with the development of GMs and operational team members</li><li>Review, monitor, and improve guest service scores and ensure hotels achieve top rankings within their respective hotel brands</li><li>Create and maintain positive, professional working environments in all hotels</li><li>Ensure positive people practices are upheld and are maintained by company standards and policies<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Minimum of 3-5 years of experience as a General Manager/Area Manager or RDO in overseeing major premium branded hotels (Hilton, Marriott preferred)</li><li>Prior recent experience working with select-service hotels</li><li>Prior employment with a recognized hotel management company</li><li>Bachelor’s Degree in Business or related field, preferred</li><li>Accomplished leader, self-motivated, team builder, team player and excellent communicator</li><li>Positive, creative, innovative approach to problem solving and the ability to exercise judgment and discretion</li><li>Diverse background managing hotels in various operating scenarios, management positions and locations.</li><li>Financial acumen with extensive experience working with P&amp;L statements and the ability to analyze and take appropriate action<br/><br/></li></ul><strong>Our Perks<br/><br/></strong>Highly competitive salary<br/><br/>Opportunity for Advancement<br/><br/>Medical, Dental, Vision, Ancillary Benefits, 401K<br/><br/>Paid Time Off, Paid Sick Time<br/><br/>Job Training<br/><br/>Associate Referral Program<br/><br/>Hotel Discounts<br/><br/>#HCareers<br/><br/><strong>247Hotels<br/><br/></strong>An entrepreneurial and spirited hospitality company, Twenty Four Seven Hotels delivers highly specialized services in hotel management, investment and development. After a decade of focusing on upscale select-service hotels, Twenty Four Seven Hotels has firmly established itself in the growing lifestyle hotel market segment with the 2016 opening of the first Moxy hotel in the United States. Concentrated in the Western U.S., Twenty Four Seven Hotels continues to invest in high caliber hospitality talent to support its growing portfolio, currently at 24 managed hotel properties with global hospitality brands including Marriott, Hilton and Hyatt. For more information on Twenty Four Seven Hotels, visit www.247hotels.com . Instagram: @247hotels Facebook: @247hotels<br/><br/>Twenty Four Seven Hotels is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. Twenty Four Seven Hotels does not discriminate on the basis of disability, veteran status or any other basis protected under federal, state or local laws.<br/><br/><strong>Notice To California Applicants<br/><br/></strong>The California Privacy Rights Act requires that applicants be informed that Twenty Four Seven Hotels will collect certain personal information during the application process. Personal information collected may include each applicant’s real name, email address, postal address, and similar identifiers. Additionally, Twenty Four Seven Hotels may collect professional and employment-related information, and education information. Twenty Four Seven Hotels does not collect sensitive personal information during the application process.<br/><br/>Twenty Four Seven Hotels will use the personal information collected to contact and communicate with applicants, and to assess each applicant’s qualifications for the job(s) to which they apply. Twenty Four Seven Hotels may also use and share Personal Information as reference checks are conducted. Twenty Four Seven Hotels may also share certain Personal Information provided by applicants to service providers who are engaged by Twenty Four Seven Hotels to conduct criminal background checks. The Personal Information collected will be retained at least two years from the time an application is submitted, and may be retained as long as seven years after termination of employment for applicants who are employed by the Company. Twenty Four Seven Hotels does not sell Personal Information provided by applicants.<br/><br/>Applicants have the right to request that Personal Information collected by Twenty Four Seven Hotels during the application process be deleted or to request that inaccurate Personal Information be corrected by submitting the request in writing to Twenty Four Seven Hotels, 520 Newport Center Drive #520, Newport Beach, Ca 92660, or by contacting the People Resources and Development Department by dialing 949-734-6400.", "responsibilities": "<ul><li>Proactively lead and support properties to deliver desired results, continually improving guest service, profitability and associate satisfaction</li><li>Supporting company-wide programs, communication channels and other enterprise-wide initiatives</li><li>Manage Profit &amp; Loss statements with the ability to effectively train GM's and other managers in financial responsibility</li><li>Review, analyze and respond to performance metrics/data received from various reporting systems.</li><li>Ensure all brand standards are in place and help implement any new or updated brand initiatives as needed</li><li>Track QA/Brand visits/inspections and achieves outstanding results</li><li>Train, hire, mentor, assist with the development of GMs and operational team members</li><li>Review, monitor, and improve guest service scores and ensure hotels achieve top rankings within their respective hotel brands</li><li>Create and maintain positive, professional working environments in all hotels</li><li>Ensure positive people practices are upheld and are maintained by company standards and policies<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Minimum of 3-5 years of experience as a General Manager/Area Manager or RDO in overseeing major premium branded hotels (Hilton, Marriott preferred)</li><li>Prior recent experience working with select-service hotels</li><li>Prior employment with a recognized hotel management company</li><li>Bachelor’s Degree in Business or related field, preferred</li><li>Accomplished leader, self-motivated, team builder, team player and excellent communicator</li><li>Positive, creative, innovative approach to problem solving and the ability to exercise judgment and discretion</li><li>Diverse background managing hotels in various operating scenarios, management positions and locations.</li><li>Financial acumen with extensive experience working with P&amp;L statements and the ability to analyze and take appropriate action<br/><br/></li></ul>", "preferred": null}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Highly competitive salary<br/><br/>Opportunity for Advancement<br/><br/>Medical, Dental, Vision, Ancillary Benefits, 401K<br/><br/>Paid Time Off, Paid Sick Time<br/><br/>Job Training<br/><br/>Associate Referral Program<br/><br/>Hotel Discounts<br/><br/>#HCareers", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3974226453"}