{"jobTitle": "Head of Operations", "company": {"name": "Robert Walters", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "An exciting opportunity has arisen for a dynamic and experienced Head of Operations to join a pioneering materials and packaging science company. This role is integral to the company's mission to revolutionize sustainability standards through innovative, eco-friendly solutions that minimize environmental impact without compromising on performance.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Develop and execute operational strategies aligned with the company's sustainability objectives and business goals.</li><li>Lead and manage the manufacturing, supply chain, and logistics teams to ensure seamless operations and product delivery.</li><li>Optimize production processes to enhance efficiency, reduce waste, and minimize environmental footprint.</li><li>Collaborate with cross-functional teams including R&amp;D, engineering, and sales to drive innovation and product development initiatives.</li><li>Establish and maintain vendor relationships, negotiate contracts, and manage supplier performance to ensure quality and cost-effectiveness.</li><li>Implement and monitor health, safety, and environmental policies to uphold regulatory compliance and sustainability standards.</li><li>Analyze operational data and metrics to identify areas for improvement and implement corrective actions.</li><li>Prepare and manage operational budgets, forecasts, and resource allocation.<br/><br/></li></ul><strong>What You Bring<br/><br/></strong><ul><li>Bachelor’s degree in Engineering, Operations Management, Business Administration, or a related field; Investment Banking/Consulting background or Master’s degree preferred.</li><li>Proven experience in operations management within the manufacturing or materials science industry, with a strong emphasis on sustainability practices.</li><li>Demonstrated leadership skills with the ability to inspire and motivate teams to achieve operational excellence.</li><li>Solid understanding of manufacturing processes, supply chain management, and logistics operations.</li><li>Excellent problem-solving abilities with a strategic mindset.</li><li>Strong communication skills to effectively collaborate with internal teams, stakeholders, and external partners.</li><li>Passion for sustainability and a commitment to driving positive environmental change through innovative business practices.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3974115151"}