{"jobTitle": "Senior Executive Assistant, Prime Video Sports", "company": {"name": "Prime Video & Amazon MGM Studios", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "The Prime Video & Amazon MGM Studios organization is looking for a Senior Executive Assistant who wants to work in a fast-paced, exciting, and growing organization. We are looking for someone to support the VP, Head of Sports & Ads, in Prime Video.<br/><br/>This role requires attention to detail, strong organizational skills, and the ability to meet tight deadlines while juggling multiple critical requests across global teams. The Senior Executive Assistant will act as a seamless extension of the Vice President and will work closely with other Executive Assistants throughout the organization to create a positive working relationship across the Executive Assistant community within this org and the wider Prime Video org. The ideal candidate will be a detail oriented, experienced planner with the demonstrated ability to respond effectively and efficiently while maintaining flexibility, composure and a good sense of humor.<br/><br/>The individual in this role must understand business priorities, demonstrate the ability to proactively anticipate needs and drive improvements to build capacity for the leadership team. A high level of integrity and discretion in handling confidential information as well as professionalism in dealing with senior executives inside and outside of the company is critical. The successful candidate will possess the ability to complete complex tasks quickly with little to no guidance, react with appropriate urgency to situations that require a quick turnaround, and take effective action without having to know the whole picture. The ideal candidate must be able to work successfully in a team environment and build effective working relationships inside and outside the team.<br/><br/>Key job responsibilities<br/><br/><ul><li> Manage complex calendars and scheduling to support teams in multiple locations</li><li> Manage domestic and international travel</li><li> Manage expense report coordination and submission</li><li> Organize, execute, and assist with team activities (e.g. staff meeting agendas, town hall meetings, off-sites, and team social events)</li><li> Track and help drive completion of key deliverables and follow up on outstanding items</li><li> Act as a liaison for the VP’s direct reports</li><li> Manage team office space, including moves and reconfigurations</li><li> Work closely with the leadership team, recruiting and other Executive Assistants to provide support to the organization</li><li> Assist with document writing, editing, and readiness</li><li> Plan morale and team building traditions and activities to foster a strong organizational and team culture. Have fun at work and help others do the same!<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 8+ years of executive assistant experience</li><li> Experience with domestic or international travel coordination</li><li> Experience with C-level executive calendar management</li><li> Experience with Microsoft Office products and applications</li><li> Experience as an Executive Assistant<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience managing teams</li><li> Experience working in a matrixed organization</li><li> Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $88,800/year in our lowest geographic market up to $176,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2640410", "postedDate": "2 weeks ago", "skills": [], "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3974274031"}