{"jobTitle": "Ecommerce Operations Coordinator", "company": {"name": "Identified Talent Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Consumer Services", "description": "<strong>Job Title: Ecommerce Operations Coordinator<br/><br/></strong><strong>Location:</strong> Los Angeles, CA<br/><br/><strong>Company:</strong> Fast-Growing Consumer Packaged Goods Company, based in the home goods industry.<br/><br/><strong>About Us:</strong> We are a fast-growing consumer packaged goods (CPG) company based in Los Angeles, dedicated to delivering high-quality, innovative products to our customers. As we expand, we are seeking a detail-oriented and proactive Ecommerce Operations Coordinator to join our dynamic team.<br/><br/><strong>Job Description:</strong> The Ecommerce Operations Coordinator will play a critical role in ensuring the smooth operation of our online sales channels. This individual will manage day-to-day ecommerce activities, coordinate with various departments, and help drive the growth of our online presence. The ideal candidate is highly organized, analytical, and passionate about ecommerce and consumer products.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Catalog Management:</li><ul><li>Oversee the daily operations of site and product catalog management.</li><li>Ensure timely and accurate content, shipping, and delivery.</li><li>Coordinate with all cross-functional web and ecommerce teams members for critical site ops updates. </li></ul><li>Site Management:</li><ul><li>Monitor and maintain accurate content across all ecommerce platforms.</li><li>Perform regular audits and reconcile discrepancies.</li></ul><li>Customer Service:</li><ul><li>Provide excellent customer service by addressing and resolving customer inquiries and issues promptly.</li><li>Collaborate with the customer service team to improve customer satisfaction and retention.</li></ul><li>Ecommerce Platform Management:</li><ul><li>Manage product listings, descriptions, and pricing on various ecommerce platforms (e.g., Shopify).</li><li>Optimize product listings for SEO and improve product visibility.</li><li>Coordinate promotional campaigns and update site content as needed.</li></ul><li>Data Analysis and Reporting:</li><ul><li>Track and analyze key ecommerce metrics (e.g., sales performance, conversion rates, customer behavior).</li><li>Generate regular reports to inform strategic decisions and identify areas for improvement.</li><li>Use data to develop and implement process improvements and efficiencies.</li></ul><li>Cross-functional Collaboration:</li><ul><li>Work closely with marketing, sales, finance, and IT teams to support ecommerce initiatives.</li><li>Assist in the development and execution of ecommerce strategies and promotional campaigns.</li><li>Provide support for product launches and other ecommerce projects.<br/></li></ul></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in Business, Marketing, or a related field.</li><li>1-2+ years of experience in ecommerce operations or a similar role.</li><li>Strong understanding of ecommerce platforms (e.g., Shopify, Amazon, etc) and order management systems.</li><li>Excellent organizational and multitasking skills.</li><li>Strong analytical skills and proficiency in using data to drive decisions.</li><li>Exceptional attention to detail and problem-solving abilities.</li><li>Proficient in Microsoft Office Suite (Excel, Word, PowerPoint).</li><li>Strong written and verbal communication skills.</li><li>Ability to work independently and as part of a team in a fast-paced environment.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive salary and benefits package. Salary Range for the Ecommerce Operations Coordinator is $50-60k</li><li>Opportunities for professional growth and development.</li><li>A collaborative and innovative work environment.</li><li>Employee discounts on company products.</li><li>Health, dental, and vision insurance.</li><li>Paid time off and holiday pay.</li></ul>", "responsibilities": "The Ecommerce Operations Coordinator will play a critical role in ensuring the smooth operation of our online sales channels. This individual will manage day-to-day ecommerce activities, coordinate with various departments, and help drive the growth of our online presence. The ideal candidate is highly organized, analytical, and passionate about ecommerce and consumer products.", "qualifications": {"required": "Bachelor's degree in Business, Marketing, or a related field. 1-2+ years of experience in ecommerce operations or a similar role. Strong understanding of ecommerce platforms (e.g., Shopify, Amazon, etc) and order management systems. Excellent organizational and multitasking skills. Strong analytical skills and proficiency in using data to drive decisions. Exceptional attention to detail and problem-solving abilities. Proficient in Microsoft Office Suite (Excel, Word, PowerPoint). Strong written and verbal communication skills. Ability to work independently and as part of a team in a fast-paced environment.", "preferred": ""}, "skills": ["Shopify", "Amazon", "Excel", "Word", "PowerPoint", "Data Analysis", "Customer Service", "Ecommerce", "Marketing", "Business"], "postedDate": "1 month ago", "benefits": "Competitive salary and benefits package. Salary Range for the Ecommerce Operations Coordinator is $50-60k Opportunities for professional growth and development. A collaborative and innovative work environment. Employee discounts on company products. Health, dental, and vision insurance. Paid time off and holiday pay.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3974451993"}