{"jobTitle": "Administrative Assistant", "company": {"name": "RemX - Accounting & Finance Staffing", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "RemX has an exciting opportunity for an Administrative Assistant in a large Healthcare Facility located in Valencia, CA!<br/><br/><strong>Duration: </strong>1 month with possible extension<br/><br/><strong>Schedule: </strong>Monday - Friday 8am - 5:00pm<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Responsible for calendar management, scheduling/ organizing meetings, creating meeting agendas and documents, taking meeting minutes, and follow-up email distribution</li><li>Maintain and update office records and filing systems</li><li>Assist with order entry and data entry tasks</li><li>Provide customer support and address inquiries or issues</li><li>Utilize computerized systems and software to perform tasks efficiently</li><li>Responsible for assisting with publicity, mailers, social media as well. <br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>High level of computer literacy, including proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and the ability to learn new software quickly</li><li>Excel Experience is a must - (Pivot, V-look ups)</li><li>Excellent organizational skills and attention to detail</li><li>Strong written and verbal communication skills</li><li>Ability to multitask and prioritize tasks effectively</li><li>Previous experience in an office or administrative role is preferred</li><li>Knowledge of medical office procedures is a plus</li><li>Ability to maintain confidentiality and handle sensitive information with professionalism<br/><br/></li></ul>Please forward your resume to estersantamaria@remx.com or apply directly to this job posting.<br/><br/>RemX is the professional staffing division of Employbridge, America’s Leading Workforce Specialist. When our Talent is looking for their next opportunity, we know they are not just looking for their next paycheck. Our Recruiters are experts in their specialized fields and understand that making the right match between the candidate and the company, is the key to long term success. We offer a variety of staffing solutions, including: Temporary, temp-to-hire, direct hire Independent contract placements Executive search Managed staffing and outsourced workforce solutions", "postedDate": "1 month ago", "skills": ["Microsoft Office", "Excel", "Customer Service", "Communication", "Organization"], "url": "https://www.linkedin.com/jobs/view/3974180638"}