{"jobTitle": "Airline Customer Service Agent", "company": {"name": "Pacific Aviation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.06", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Our Pacific Aviation/SAS family creates an environment where, together, we can all succeed.<br/><br/><strong>Pacific Aviation (with Superior Aircraft Services) is an airport-handling provider dedicated to providing exceptional service for some of the world's finest airlines. By developing and growing our people, we know that our team members are the reason for our 25-year plus success record. We currently support major west coast airports and have recently expanded the Pacific Aviation service to the East Coast.<br/><br/></strong><strong>At Pacific Aviation/SAS we don't just accept differences — we celebrate them and believe that a diverse team is a strong team. We thrive on our varied backgrounds and perspectives for the benefit of our employees, our services, and our community. All candidates for hire, promotion and performance are evaluated on the basis of merit alone.<br/><br/></strong>Pacific Aviation is looking for bright, ambitious, and motivated professionals to join our team as <strong>Customer Service Agents</strong>. Customer Services Agents guide airline customer across their entire journey at the airport. Our Customer Service Agents take pride in providing an exceptional customer experience and fostering a collaborative work environment.<br/><br/><em><strong>Airport Journey<br/><br/></strong></em>\"A customer service agent handles a full range of functions directly with passengers as they are embarking on their journey. The two main job roles include working at the check-in counters and the gates for departures and arrivals. At the check-in counters, the customer service agent processes the incoming passengers, checks required IDs, print boarding passes, and tag their luggage. At the boarding gates, the customer service agent makes boarding announcements to provide important flight information, scan boarding passes, and ensure all passengers have boarded the plane with required documentation. This position requires standing and walking for the majority of the shift.\"<br/><br/><strong>Bilingual Preferred<br/><br/></strong><ul><li>English/Korean </li><ul><li>Base pay + translator premium pay</li></ul><li>English/Tagalog</li><li>English/Mandarin</li><li>English/Cantonese</li><li>English/Vietnamese</li><li>English/Thai</li><li>English/Indonesian</li><li>English/Hindi, Gujarati</li><li>English/Japanese<br/><br/></li></ul><strong>Shifts Available:<br/><br/></strong>4-5 hours shifts<br/><br/><strong>Between the hours of:<br/><br/></strong>05:30 am - 12:00 noon<br/><br/>09:00 am - 2:30 pm<br/><br/>4:30 pm - 12:45 am<br/><br/>7:45 pm - 1:30 am<br/><br/><strong>Core Job Responsibilities:<br/><br/></strong><ul><li>Customer Service: Provide an exceptional customer experience for passengers, guiding them through their airport journey, and resolving challenges that arise with respect and compassion</li><li>Teamwork: Work together as a team and foster a collaborative environment that supports all agents in successfully fulfilling their duties</li><li>Operational Excellence: Successfully learning and mastering the technical aspects of the job in order to successful execute all required duties</li><li>For example, learning the check-in system, the boarding process, and following proper airport documentation</li><li>People Excellence: Successfully learning and master the soft-skill required to successfully execute all required duties</li><li>For example, learning how to quick build a relationship with a customer, understanding how to de-escalate frustrated passengers, and actively listening to learn the root cause of customers challenges</li><li>Safety: Ensure the safety of passenger and team members at all times<br/><br/><br/></li></ul><strong>What we are looking for:<br/><br/></strong><ul><li>A Growth Mindset: we are looking for individuals who are interested in personal and professional growth as we are committed to growing our people and advancing their careers</li><li>Professionalism: we are looking for individuals who demonstrate professional etiquette, behavior, and courtesy as our customers rely on us to help them with all their needs</li><li>Decision Making &amp; Organization: we are looking for individuals who understand how to organize and prioritize their work to ensure the most pressing tasks get completed</li><li>An Eye for Detail: We are looking for individuals who have an eye for detail as there are many documents that need to be submitted to the airport, the airline, and the airplane to successfully depart a flight<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Applicants must be:<br/><br/></strong><ul><li>Available to work a minimum of 4 days , per week (including weekends and holidays)</li><li>Available to attend 5 days of computer training</li><li>Fluent in English and Preferred Language</li><li>Computer literate</li><li>Legally authorized to work in the United States of America (USA)<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>Hourly pay rate $20.06<br/><br/>Medical , Dental, Vision benefits<br/><br/>401k<br/><br/>Paid Time Off<br/><br/>Uniform<br/><br/>Parking discount<br/><br/>Paid Training<br/><br/>Referral Bonus<br/><br/>Cell phone plan reimbursement", "responsibilities": "Customer Service: Provide an exceptional customer experience for passengers, guiding them through their airport journey, and resolving challenges that arise with respect and compassion\nTeamwork: Work together as a team and foster a collaborative environment that supports all agents in successfully fulfilling their duties\nOperational Excellence: Successfully learning and mastering the technical aspects of the job in order to successful execute all required duties\nFor example, learning the check-in system, the boarding process, and following proper airport documentation\nPeople Excellence: Successfully learning and master the soft-skill required to successfully execute all required duties\nFor example, learning how to quick build a relationship with a customer, understanding how to de-escalate frustrated passengers, and actively listening to learn the root cause of customers challenges\nSafety: Ensure the safety of passenger and team members at all times", "qualifications": {"required": "Available to work a minimum of 4 days , per week (including weekends and holidays)\nAvailable to attend 5 days of computer training\nFluent in English and Preferred Language\nComputer literate\nLegally authorized to work in the United States of America (USA)"}, "skills": ["Customer Service", "Teamwork", "Operational Excellence", "People Excellence", "Safety"], "postedDate": "2 months ago", "benefits": "Hourly pay rate $20.06<br/><br/>Medical , Dental, Vision benefits<br/><br/>401k<br/><br/>Paid Time Off<br/><br/>Uniform<br/><br/>Parking discount<br/><br/>Paid Training<br/><br/>Referral Bonus<br/><br/>Cell phone plan reimbursement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974513499"}