{"jobTitle": "Wellness Operations Manager", "company": {"name": "Four Seasons Hotels and Resorts", "industry": "Travel Arrangements and Hospitality", "size": "Not specified", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$74,000 - $84,000", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Travel Arrangements and Hospitality", "description": "Four Seasons Hotel Westlake Village is seeking a Wellness Operations Manager, where you'll lead a dedicated and dynamic team in providing exceptional service to our guests. Under the direction of the Executive Director, the operations manager is responsible for ensuring all Service Cultural and Core standards are met in Center for Health and Wellbeing by managing a team of credentialed, highly-driven, service oriented staff in a health and wellness business including operations management in guest services, life balance, wellness kitchen, fitness, membership and other support staff as required.", "responsibilities": "Leads an essential part of an integrated health and wellbeing team that provides comprehensive fitness, medical, nutritional, life balance and spa services. Interfaces with all relevant team members of wellness, Four Seasons, and medical to ensure strategic alignment, seamless guest experience (including pre-work distribution and follow-up), and effective use of resources. Ability to display a high level of integrity and professionalism at all times in dealing with guests and employees. Ability to develop close working relationships with Reservations, Front Desk, Laundry, Engineering, IT and Housekeeping as a support system in operations. Contributes to faculty vetting, program development, bundling and packaging process of the division. Supports Director in educating internal departments about wellness operations and changes with formal training; including but not limited to packages, promotions, services, protocols and procedures. Participate in the development and support of strategic business and marketing plan to drive better business results; including analysis of current trends and the wellness/hospitality marketplace conditions and economic influences; support of social media and website initiatives.", "qualifications": {"required": "Bachelors degree in a health or hospitality-related field or equivalent experience. 2-4 years experience in a supervisory/management role providing customer service in the spa, hospitality, medical or related industry. Strong interpersonal and communication skills with ability to adapt based on needs of the guest. Exemplary intuitive listening skills along with exceptional oral and written communication. Exceptional attention to detail and follow through with outstanding time management and organizational skills. Proven problem solving skills and sound judgment. Demonstrated ability to efficiently multitask and thrive in a fast paced environment. Successful candidate must possess legal work authorization in the United States.", "preferred": ""}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Health Insurance - Medical, Dental & Vision, Company Match 401K Plan, Complimentary stays at Four Seasons Worldwide, Complimentary meals in our Wellness Café, Laundered Employee Uniform, Employee Assistance Program, Investment in your Wellbeing, Life Insurance, Complimentary on-site parking, Training programs, tuition reimbursement, Growth & Development opportunities", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3974226254"}