{"jobTitle": "Customer Marketing Manager - Virtual/Remote", "company": {"name": "Enumerate", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Enumerate is looking for a Customer Marketing Manager to join our team! If you’re passionate about driving customer value, engagement and loyalty through strategic marketing initiatives, then you’ve come to the right place! Enumerate is a leading provider of community management software for property management companies and self-managed associations. We help community managers save time and money that they can invest back into improving their resident experience, and ultimately grow their business. Join us to drive impactful B2B and B2B2C marketing strategies that build relationships with our customers, and drive value for their customers, residents in homeowner communities. This is a newly created role on the marketing team reporting directly to the Chief Marketing Officer. We are looking for someone who loves building remarkable customer experiences and can seamlessly shift between building strategies and executing campaigns. This role will collaborate very closely with our product marketing, demand generation, customer success and customer operations teams. This role is remote and works EST/CST time zone schedule (meetings are commonly 9-5pm ET). Targeted compensation is $100K-$120K, depending on experience. Travel expected 10-20% of the time, as needed for team off-sites or customer meetings. Who will love this job<br/><br/>You can develop and execute customer-focused marketing strategies that drive engagement and retention throughout the customer lifecycle. You enjoy working with cross-functional teams to deliver comprehensive marketing campaigns. You rely on data to inform your decisions and measure the success of your initiatives. You’re passionate about understanding customer needs and delivering value through marketing efforts. You should have<br/><br/>Required: 5+ years of experience in marketing, marketing communications, or a related field. 1-2+ years of experience in customer marketing is preferred. Experience in a SaaS environment is preferred; B2B2C experience makes you a standout candidate! Proven ability to develop and execute customer marketing strategies and campaigns. Experience in accounting, payments or property management industries is a plus. Strong analytical skills and experience with marketing analytics tools. Excellent written and verbal communication skills. Familiarity with CRMs and marketing automation tools such as Hubspot and Salesforce is preferred. Ability to work collaboratively across teams and departments. Must be eligible to work in the United States without sponsorship. Benefits Medical insurance, Dental insurance, Vision insurance, 401K, Health Spending Account (HSA) Culture Why Enumerate Our team is changing the face of the HOA Property Technology space as a trusted industry leader for over 30 years. Today, our products enable over 1,500 of the highest-caliber property management companies in the world to grow and protect their organizations. We are a five-time winner of FLCAJ’s Readers Choice Awards for our solutions and support. Our approach to work is proactive, collaborative, and committed and our team of 140+ are truly passionate about creating a best-run company internally just as we create best-run Property Management Companies for our customers. Learn about our Core Values here. We offer a full slate of benefits, including competitive salaries, medical (including a $0 option for employees), dental, vision, life and disability coverage, paid vacation, paid holidays, tuition reimbursement, $1,000 employee referral program and a 401(k) plan. When possible, we also like to offer fun in-person perks like pet-friendly offices, paid food trucks and company outings. We have offices in Clearwater, FL (near Tampa), Fort Lauderdale, FL, Knoxville TN, and Mission Viejo, CA (an hour outside LA), plus a few fully remote team members across the US. We are an equal opportunity employer. We value each team member for their skills, experience and unique perspectives. This is a principle embodied in the way we do business, our policies, and is visible in our results. Come join us and find out what the best work of your career could look like here at Enumerate. Responsibilities What you’ll do<br/><br/>Customer Marketing Strategy: Own the strategy and execution of the customer journey and communications. Partner with product marketing and customer operations to develop a strategic cadence of customer-focused communications and a lifecycle campaign to drive adoption, engagement, and overall KPIs. Customer Marketing Campaigns: Lead and manage customer engagement and communication programs in partnership with Events and Demand Generation teams, such as in-person/virtual events, workshops, annual conferences, awards programs, onboarding, and ongoing nurture campaigns. Homeowner Enablement: Develop B2C and B2B2C programs to educate homeowners and drive adoption and utilization of our payments products. Analytics &amp; Measurement: Partner with Customer Operations to develop KPIs to measure customer retention. Measure, monitor, and drive improvements in our NPS by partnering across Customer Success, Support, Sales, and Product teams. Customer Education &amp; Enablement: Partner with Customer Success and Operations to build customer enablement materials and scalable training programs that ensure our customers are successfully adopting our products throughout their lifecycle. Revenue Expansion: Partner with demand generation and customer operations to build campaigns with customers to increase renewals, referrals, and cross-sell and upsell opportunities. Customer Advocacy Programs: Develop and manage programs that drive customer loyalty, including referral initiatives, testimonials, and case studies. Requirements 5+ years of experience in marketing, marketing communications, or a related field Authorized to work in the US without sponsorship Requisition #clygbqm6d4s4r0pqugmlwanjj", "responsibilities": "Customer Marketing Strategy: Own the strategy and execution of the customer journey and communications. Partner with product marketing and customer operations to develop a strategic cadence of customer-focused communications and a lifecycle campaign to drive adoption, engagement, and overall KPIs. Customer Marketing Campaigns: Lead and manage customer engagement and communication programs in partnership with Events and Demand Generation teams, such as in-person/virtual events, workshops, annual conferences, awards programs, onboarding, and ongoing nurture campaigns. Homeowner Enablement: Develop B2C and B2B2C programs to educate homeowners and drive adoption and utilization of our payments products. Analytics &amp; Measurement: Partner with Customer Operations to develop KPIs to measure customer retention. Measure, monitor, and drive improvements in our NPS by partnering across Customer Success, Support, Sales, and Product teams. Customer Education &amp; Enablement: Partner with Customer Success and Operations to build customer enablement materials and scalable training programs that ensure our customers are successfully adopting our products throughout their lifecycle. Revenue Expansion: Partner with demand generation and customer operations to build campaigns with customers to increase renewals, referrals, and cross-sell and upsell opportunities. Customer Advocacy Programs: Develop and manage programs that drive customer loyalty, including referral initiatives, testimonials, and case studies.", "qualifications": {"required": "5+ years of experience in marketing, marketing communications, or a related field Authorized to work in the US without sponsorship", "preferred": "1-2+ years of experience in customer marketing is preferred. Experience in a SaaS environment is preferred; B2B2C experience makes you a standout candidate! Proven ability to develop and execute customer marketing strategies and campaigns. Experience in accounting, payments or property management industries is a plus. Strong analytical skills and experience with marketing analytics tools. Excellent written and verbal communication skills. Familiarity with CRMs and marketing automation tools such as Hubspot and Salesforce is preferred. Ability to work collaboratively across teams and departments."}, "skills": ["Marketing", "Marketing Communications", "Customer Marketing", "SaaS", "B2B2C", "Customer Marketing Strategy", "Customer Marketing Campaigns", "Customer Engagement", "Customer Communications", "Events", "Demand Generation", "Homeowner Education", "Payments", "Property Management", "Analytics", "Marketing Analytics", "CRM", "Marketing Automation", "Hubspot", "Salesforce", "Collaboration", "Teamwork"], "postedDate": "1 month ago", "benefits": "Medical insurance, Dental insurance, Vision insurance, 401K, Health Spending Account (HSA)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3974036668"}