{"jobTitle": "Payroll Accountant Assistant", "company": {"name": "Klorman Construction", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Construction", "description": "We are looking for a Payroll Accountant Assistant to join our team.<br/><br/>This job is located in Woodland Hills CA!<br/><br/>Assist Payroll &amp; Human Resource Accountant to prepare and maintain of employee’s benefits, compensation, wages, evaluation, discipline and, relationship for one or more section within a department, project or division. Duties are, but no limited to, as follows:<br/><br/><ul><li>1. Process weekly or biweekly payrolls, including garnishments, benefits and taxes to consistent with federal and state wage and hour laws;</li><li>2. Ensures the processing of new hires, temporary workers, transfers, promotions and terminations is accurate and timely;</li><li>3. Prepares and audits W-4s, payroll balance sheets, YTD earnings, etc.;</li><li>4. Ensures systems are set-up and updated to reflect our current employee base, including wages, benefits, sick and vacation time in line with agreement (union and non-union);</li><li>5. Manages regular preparation of relevant management reports, including weekly, monthly, quarterly and year-end reports (gross payroll, hours worked, vacation accrual, tax deductions, benefits deductions, etc.);</li><li>6. Manages payroll or insurance audits, tax audits, and other audits as necessary;</li><li>7. Manages payroll taxes payment weekly with State and Federal;</li><li>8. Prepare quarterly and yearly Payroll tax filing with State and Federal;</li><li>9. Reconcile banks;</li><li>10. Maintains employee benefits programs and informs employees benefits by studying and assessing benefit needs and trends; recommending benefit programs to management; directing the processing of benefit claims; obtaining and evaluating benefit contract bids; awarding benefit contracts; designing and conducting educational programs on benefit programs;</li><li>11. Ensures legal compliance by monitoring and implementing applicable human resource federal and state requirements; maintaining records;</li><li>12. Maintains management guidelines by preparing, updating, and recommending human resource policies and procedures;</li><li>13. Maintains historical human resource records by designing a filing and retrieval system; keeping past and current records;</li><li>14. Completes human resource operational requirements by counseling and disciplining employees; planning, monitoring, and appraising employee job performance; advising management in appropriate resolution of employee relations issues;</li><li>15. Administers benefits programs such as life, health, and dental insurance, pension plans, vacation, sick leave, leave of absence, and employee assistance;</li><li>16. Perform additional assignments per supervisor’s direction.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3974600544"}