{"jobTitle": "Sr. Supply Chain Manager", "company": {"name": "Caldera Medical", "industry": "Medical Equipment Manufacturing", "size": "Not specified", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000 - $160,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Medical Equipment Manufacturing", "description": "Located in on site in Westlake Village, CA. Caldera Medical’s Mission - To Improve the Quality of Life for Women! Caldera Medical is focused solely on women’s pelvic health, we develop, build and market best in class surgical products for women seeking treatment for stress urinary incontinence, pelvic organ prolapse, polyps and fibroids. We are proud that our products are used by surgeons worldwide. The company culture at Caldera Medical is incredibly important to us. We believe in doing the right thing for the right reason. By putting patients, customers, employees and community above profit we have been rewarded by being the fastest growing women’s health company. The Position Caldera Medical is building an operations team that is crucial to creating and deploying increased capabilities for the company’s success in its high growth phase. We are looking for a passionate individual who values transparency, communication, and collaboration and who is motivated by continuously improving processes, developing their team and elevating the company. Caldera Medical is seeking a dynamic and experienced Supply Chain manager to develop a supply chain organization to the next level and support our international expansion plans. This position will lead Sales & Operations Planning (S&OP), materials planning, production planning, capacity planning, inventory planning, materials purchasing, inventory control, strategic sourcing, distribution, and logistics for the company. The Sr. Supply Chain Manager will monitor purchase orders, the movement of raw materials, in-process goods, and finished products to ensure that business needs are met. This role will foster and champion a culture of continuous improvement within the supply chain team, cross-functional teams, and suppliers, creating and implementing processes to meet service levels and financial goals across our supply chain.", "responsibilities": "Develop a high performing and talented supply chain team. Collaborate with quality, sales, customer service, engineering, product management, and finance departments to accomplish departmental and organizational goals. Lead all aspects of supply chain planning (S&OP, materials, production, capacity, inventory), logistics, and distribution for a global supply chain with manufacturing and distribution centers in the USA and internationally. Identify opportunities to develop and improve processes, guidelines, and policies for effective supplier management practices, order fulfillment, inventory management, logistics activities, and business risk management. Build and develop relationships, negotiate prices, costs savings, and terms with suppliers and partners to ensure quality and service expectations are met. Drive alignment and accountability through supplier performance reviews and continuous improvement plans. Support new product introduction teams with sourcing or subcontracting options. Compliance with regulatory and trade compliance requirements and standards related to supply chain activities. Organize and oversee warehouse operations and international third-party logistics (3PL) providers. Continuously aim to reduce waste, increase efficiency, and enhance service levels. Assess appropriate space requirements, capital equipment needs, staffing levels for warehouse, and manage 3PLs. Establish performance monitoring and KPIs to effectively measure performance of the internal supply chain team (e.g., purchasing, warehouse) and external partners. Work with the Quality Department to continuously improve supplier quality and reduce the cost of poor quality. Identify and address gaps in the current Oracle ERP implementation, ensuring full utilization of the system. Perform other duties as assigned.", "qualifications": {"required": "10 years of supply chain experience in a multisite environment in a regulated industry or high degree of quality control and bachelor’s degree in supply chain management, business, engineering, or related field. 7 years with a master’s degree in any those disciplines. At least 3 years of experience building and developing teams. At least 2 years of experience in strategic sourcing and 2 years of experience in end-to-end supply chain planning. Positive attitude and team player, with attention to detail and a sense of urgency in execution with continuous improvement philosophy. Able to balance multiple priorities and work streams. Experience deploying and managing with KPIs, Lean and Continuous Improvement principals, root-cause analysis, and corrective action and advancing a culture of Continuous Improvement. Strong negotiation skills, able to forge strong relationships, drive value and maintain credibility internally and with suppliers. Proficiency in ERP systems (Oracle preferred); deployment and scale-up experience is a plus. APICS certifications & credentials (CPIM, CSCP, CLTD, CTSC) a plus.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Competitive Compensation: $130,000 - $160,000. Medical / Dental Benefits - 75% paid for employees and families. Vision Coverage. Basic Life and AD&D. Unlimited Vacation. 6 weeks of paid Maternity Leave. 401(k) with 4% matching contributions. 10 paid Holidays.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3974501077"}