{"jobTitle": "Data Scientist", "company": {"name": "Home Organizers", "industry": "Furniture and Home Furnishings Manufacturing", "size": "9,000+ employees", "location": "Hacienda Heights, CA"}, "location": "Hacienda Heights, CA", "jobType": "Fulltime", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Furniture and Home Furnishings Manufacturing", "description": "Home Organizers is a renowned holding company encompassing over 14 home and lifestyle brands. Known for comprehensive solutions from whole home organizing to sophisticated water distribution technology, we have established a robust presence in over 30 years. With more than 9,000 system-wide employees across many subsidiaries, our company combines personalized service with innovative, top-tier designs to ensure client satisfaction and enhance the functionality and aesthetics of living spaces. We are excited to offer an opportunity for an experienced Data Scientists professional to join our team. This individual will work with our senior management across multiple departments under the direction of the Director of Software Strategy to analyze and prepare automated reports with clear KPI’s, while working with a Google Big Query Data Warehouse and utilizing statistical and machine learning models.", "responsibilities": "Analyze complex datasets to identify trends, patterns, and insights that drive business decisions. Work closely with the marketing department to prepare model for analyzing marketing performance and share reports in data visualization tools that meet the needs of management. Develop and implement statistical and machine learning models to provide correlation analysis, prediction behavior, and . Prepare and automate reports with clear KPIs to support various departments. Collaborate with senior management to understand business requirements and translate them into data analysis tasks. Ensure data integrity and accuracy by performing data cleaning and validation tasks.", "qualifications": {"required": "Proven experience as a Data Scientist or similar role, with a strong portfolio of data projects. Proficiency in programming languages such as Python or R for use in data analytics. Experience with Google BigQuery and very strong experience with SQL for data extraction, manipulation, and analytics. Strong understanding of statistical analysis and machine learning techniques. Excellent problem-solving skills and attention to detail, with the ability to manage multiple projects simultaneously. Experience in data visualization tools like PowerBi, Tableau, or Looker Studio.", "preferred": ""}, "skills": ["Python", "R", "SQL", "Google BigQuery", "Statistical Analysis", "Machine Learning", "Data Visualization", "PowerBi", "Tableau", "Looker Studio"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "We believe in recognizing and rewarding our employees for a job well done. We offer growth potential for motivated individuals, competitive compensation, and a comprehensive benefits package, including: Medical, Dental, Vision, 401(k) Retirement Plan, Paid Vacation Time, Paid Holidays, Life Insurance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3974436405"}