{"jobTitle": "Director, Production Security", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "113,400.00 - 210,600.00", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/>Your Role<br/><br/>The Director of Production Security is responsible for leading and overseeing all aspects of physical security across a wide slate of WBD Productions, mainly in North America. The role will lead on integrating physical security onto productions at the Burbank Lot, external studio spaces, on location domestically and, on occasion worldwide. Reporting to the Vice President of Global Production Security they will be the regional security lead, shaping the strategic direction and implementation of physical security to provide a best-in class security solution. They will be adept and experienced in identifying &amp; addressing risks to our people, brand, content, geographic location, assets, intellectual property whilst remaining sensitive and alert to future risks on production. An excellent &amp; proven leader in the seamless and swift implementation of security in this unique environment is critical. Therefore, strong interpersonal skills, proven experience of working in a production environment and the ability to integrate both above and below the line across the production environment will be vital. Our WBD Productions are world-class, varied and dynamic; a fast thinking person, who can quickly assess, lead and communicate effective and cost efficient plans will be well suited to this exciting role<br/><br/>Your Role Accountabilities<br/><br/><ul><li>Leads on physical security across all WBD Productions in North America and at times international locations. Partnering with freelance production executives, WBD departments and 3rd party partners to provide an approach which is robust, risk assessed and financially efficient to meet the needs of the production &amp; WBD.</li><li>Own, create and implement comprehensive security plans for all production activities assessed to require input from Physical Production Security. Managing others, both in-house and freelance, to enact physical security plans throughout the lifecycle of a production. </li><li>Establish and maintain relationships with local law enforcement and other agencies, understanding the importance of information analysis in relation to specific security risks.</li><li>Establish &amp; lead on the contracting of 3rd party security firms to support productions nationally to ensure first class service &amp; competitive rates. Working with other WBD corporate departments to ensure insurances, procurements and financial accounting regulations are met &amp; managed.</li><li>In conjunction with the Productions lead on drafting the initial production budget, engaging security services and recording of budget against forecast to ensure budget targets are maintained or reported against. </li><li>Implement effective Asset protection methods, to ensure the security of assets, investigate loss and in partnership with Corporate Archive destruction of assets.</li><li>Work globally, as required, on adhoc projects or in support of productions travelling internationally.</li><li>Assist in event planning as required as part of the wider Global Production team’s remit to lead on international events. </li><li>Advise on technical solutions and implementation across the production space to enhance Physical security.<br/><br/></li></ul><strong>Qualifications &amp; Experience<br/><br/></strong><ul><li>Previous proven experience (5+ years) of leading the application of production security supporting a diverse slate of international &amp;/or domestic productions.</li><li>2nd language preferred.</li><li>A detailed understanding of the dynamics of production from prep, through production and into post and how security integrates and compliments each stage.</li><li>Proven experience of leading security on multi-million $ projects and the integration of security across numerous projects simultaneously.</li><li>Significant experience leading the development, implementation, and maintaining cross departmental security plans to include crisis management.</li><li>Adept in risk planning according to many different factors, including but not limited to, location, subject and or talent. Continually review risk, implementing mitigation solutions that are both best in class and cost effective. </li><li>Experience in leading on budget management and reporting.</li><li>Ability to plan, assign and directly lead the work of contracted employees. This includes interviewing, appraising and performance managing individuals.<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $113,400.00 - $210,600.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "<ul><li>Leads on physical security across all WBD Productions in North America and at times international locations. Partnering with freelance production executives, WBD departments and 3rd party partners to provide an approach which is robust, risk assessed and financially efficient to meet the needs of the production &amp; WBD.</li><li>Own, create and implement comprehensive security plans for all production activities assessed to require input from Physical Production Security. Managing others, both in-house and freelance, to enact physical security plans throughout the lifecycle of a production. </li><li>Establish and maintain relationships with local law enforcement and other agencies, understanding the importance of information analysis in relation to specific security risks.</li><li>Establish &amp; lead on the contracting of 3rd party security firms to support productions nationally to ensure first class service &amp; competitive rates. Working with other WBD corporate departments to ensure insurances, procurements and financial accounting regulations are met &amp; managed.</li><li>In conjunction with the Productions lead on drafting the initial production budget, engaging security services and recording of budget against forecast to ensure budget targets are maintained or reported against. </li><li>Implement effective Asset protection methods, to ensure the security of assets, investigate loss and in partnership with Corporate Archive destruction of assets.</li><li>Work globally, as required, on adhoc projects or in support of productions travelling internationally.</li><li>Assist in event planning as required as part of the wider Global Production team’s remit to lead on international events. </li><li>Advise on technical solutions and implementation across the production space to enhance Physical security.<br/><br/></li></ul>", "qualifications": {"required": "Previous proven experience (5+ years) of leading the application of production security supporting a diverse slate of international &amp;/or domestic productions.", "preferred": "2nd language preferred."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974264103"}