{"jobTitle": "Logistics Manager", "company": {"name": "American Trading International, Inc.", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $96,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "International Trade and Development", "description": "We are seeking long-term growth and career-minded rock stars to join our team!  American Trading International, Inc. (ATI) is a service-oriented export trading company providing domestic and international companies the opportunity to import and export products to new and existing markets.  ATI exports USA food and beverages to over 80 markets worldwide.<br/><br/>ATI is seeking an experienced Logistics Manager to lead and support a dedicated team of logistics professionals. This role involves overseeing international exports from America to various global customers, collaborating closely with domestic suppliers, manufacturers, trucking companies, warehouses, international shipping carriers, and ATI customers. The Logistics Manager will set and monitor expectations, provide coaching, guidance, and constructive feedback to ensure the team meets departmental and company objectives.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Manage air or ocean shipments for export transactions from origin to delivery.</li><li>Track daily order progress using company software and standard operating procedures (SOP).</li><li>Provide regular updates to all parties involved, ensuring timely and efficient order execution.</li><li>Prepare Bill of Lading instructions and file AES/ACE reports.</li><li>Communicate with customers regarding order information, export shipment schedules, tentative delivery times, and any issues that may arise.</li><li>Prepare and finalize accurate export documentation in compliance with transaction instructions and customer requirements.</li><li>Schedule bookings with shipping lines and process accurate work orders.</li><li>Coordinate and communicate with shipping lines and trucking companies to arrange shipment schedules for assigned export shipments.</li><li>Review and audit bills and invoices from manufacturers, truckers, and shipping lines.</li><li>Manage and delegate assignments to team members, provide coaching, assist team members, and validate their work.</li><li>Provide feedback and coaching to team members on a weekly basis.</li><li>Manage the workflow assigned to team members to ensure fair and even work distribution.</li><li>Utilize management tools &amp; reporting for key performance indicators (KPIs).<br/><br/></li></ul><strong>What You’ll Bring<br/><br/></strong><ul><li>Bachelor’s degree in business or related discipline.</li><li>7 to 10 years of progressive experience managing a logistics and/or supply chain team, with a focus on managing export operations or a similar combination of education and management experience.</li><li>Expert knowledge of logistics and export documentation requirements and procedures.</li><li>Proficiency with shipping lines and trucking companies commonly used in the logistics and/or supply chain industry.</li><li>Highly dependable task completion skills to ensure prompt delivery from port to port.</li><li>Ability to manage multiple projects and staff.</li><li>Capability to escalate issues appropriately to Directors and Vice Presidents.</li><li>Ability to manage stress in a complex environment and remain calm under pressure.</li><li>Strong leadership and poise in addressing challenging logistics questions.</li><li>Positive attitude and a proactive approach to work.</li><li>Strong attention to detail.</li><li>Proficiency in MS Office applications, including Word, Excel, PowerPoint, Outlook, Teams, and SharePoint.<br/><br/></li></ul><strong>What You’ll Be Paid<br/><br/></strong>Commensurate with experience, you will be paid $80,000 – $96,000 annually.<br/><br/>ATI provides full-time employees with a range of benefits, including, medical, dental, vision, life insurance, voluntary benefits, and flexible spending accounts, matching 401k, profit-sharing, plus thirteen days of accrued PTO per year and eight (8) company paid holidays.<br/><br/>Join ATI and be part of a dynamic team that drives excellence in logistics and international export operations. Apply now to bring your expertise and leadership to our growing company.<br/><br/>We are proud to be an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Authorization to work in the U.S. is required for this position.", "responsibilities": "Manage air or ocean shipments for export transactions from origin to delivery. Track daily order progress using company software and standard operating procedures (SOP). Provide regular updates to all parties involved, ensuring timely and efficient order execution. Prepare Bill of Lading instructions and file AES/ACE reports. Communicate with customers regarding order information, export shipment schedules, tentative delivery times, and any issues that may arise. Prepare and finalize accurate export documentation in compliance with transaction instructions and customer requirements. Schedule bookings with shipping lines and process accurate work orders. Coordinate and communicate with shipping lines and trucking companies to arrange shipment schedules for assigned export shipments. Review and audit bills and invoices from manufacturers, truckers, and shipping lines. Manage and delegate assignments to team members, provide coaching, assist team members, and validate their work. Provide feedback and coaching to team members on a weekly basis. Manage the workflow assigned to team members to ensure fair and even work distribution. Utilize management tools & reporting for key performance indicators (KPIs).", "qualifications": {"required": "Bachelor’s degree in business or related discipline. 7 to 10 years of progressive experience managing a logistics and/or supply chain team, with a focus on managing export operations or a similar combination of education and management experience. Expert knowledge of logistics and export documentation requirements and procedures. Proficiency with shipping lines and trucking companies commonly used in the logistics and/or supply chain industry. Highly dependable task completion skills to ensure prompt delivery from port to port. Ability to manage multiple projects and staff. Capability to escalate issues appropriately to Directors and Vice Presidents. Ability to manage stress in a complex environment and remain calm under pressure. Strong leadership and poise in addressing challenging logistics questions. Positive attitude and a proactive approach to work. Strong attention to detail. Proficiency in MS Office applications, including Word, Excel, PowerPoint, Outlook, Teams, and SharePoint."}, "skills": ["Logistics", "Export Documentation", "Supply Chain Management", "Shipping", "Trucking", "Management", "Leadership", "MS Office", "Word", "Excel", "PowerPoint", "Outlook", "Teams", "SharePoint"], "postedDate": "1 month ago", "benefits": "ATI provides full-time employees with a range of benefits, including, medical, dental, vision, life insurance, voluntary benefits, and flexible spending accounts, matching 401k, profit-sharing, plus thirteen days of accrued PTO per year and eight (8) company paid holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974214904"}