{"jobTitle": "Strategy and Operations Manager, Executive Strategy, Cloud Marketing", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "134,000-198,000", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Sunnyvale, CA, USA; New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA**. **Minimum qualifications:**<br/><br/> <ul><li>6 years of experience in management consulting, business strategy, investment banking, or corporate advisory, or 4 years of experience with an advanced degree.</li><li>4 years of experience working with executive stakeholders.</li><li>3 years of experience leading organizational wide initiatives or programs.</li><li>2 years of experience developing business strategies or managing cross-functional initiatives.<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>Experience collaborating with executive-level (e.g., Director, VP, C-level) stakeholders.</li><li>Ability to think strategically about complex issues, leading to thoughtful executive-ready recommendations and action plan.</li><li>Ability to operate in a fast-paced, dynamic environment, to prioritize and advance multiple projects simultaneously.</li><li>Ability to understand and articulate the big picture to executive teams, while maintaining exceptional attention to execution details.<br/><br/></li></ul> **About The Job**<br/><br/> Strategy &amp; Operations (S&amp;O) professionals in Google’s Marketing organization provide business critical insights and analytics, ensure cross-functional alignment of goals and execution, and help teams drive strategic partnerships and new initiatives forward. Whether you are embedded within a specific marketing team to use insights to enable better marketing decisions or the global S&amp;O function to equip the organization to succeed at scale, you will engage with Google leadership in order to establish Marketing’s strategic direction. You will manage planning and operational processes and work cross-functionally with key partners across Marketing, Product, Finance and Engineering to solve our toughest challenges, advocate for high-priority projects, and drive greater operational excellence within Marketing.<br/><br/> To be successful in this role, you have a hypothesis-driven approach to problem solving, effective quantitative and communication skills, and the ability to take on broad-reaching and ambiguous questions while working collaboratively and cross-functionally with Googlers of all levels.<br/><br/> As the Strategy and Operations Manager, Executive Strategy and Special Projects, you will be a key member of the Cloud Marketing Chief of Staff team, driving a range of work across high priority special projects, strategic initiatives, and executive operations on behalf of the Chief of Staff and Chief Marketing Officer for Google Cloud. You’ll communicate, encourage collaboration and efficiency across teams, and plug into key organizational and company initiatives.<br/><br/> Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.<br/><br/> The US base salary range for this full-time position is $134,000-$198,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/> **Responsibilities:**<br/><br/> <ul><li>Build relationships with cross-functional stakeholders.</li><li>Work with the Strategy and Operations team to support activities and communications to ongoing business cadence and priorities.</li><li>Support service in partnership with the leadership team to identify priorities and opportunities.</li><li>Support Cloud Marketing CMO's aim to execute organizational programs, Cloud Marketing initiatives, and projects.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "Build relationships with cross-functional stakeholders.Work with the Strategy and Operations team to support activities and communications to ongoing business cadence and priorities.Support service in partnership with the leadership team to identify priorities and opportunities.Support Cloud Marketing CMO's aim to execute organizational programs, Cloud Marketing initiatives, and projects.", "postedDate": "2 weeks ago", "skills": ["Management Consulting", "Business Strategy", "Investment Banking", "Corporate Advisory", "Executive Stakeholders", "Organizational Initiatives", "Business Strategies", "Cross-Functional Initiatives", "Executive-Level Stakeholders", "Strategic Thinking", "Complex Issues", "Executive-Ready Recommendations", "Action Plan", "Fast-Paced Environment", "Dynamic Environment", "Prioritization", "Multiple Projects", "Big Picture", "Executive Teams", "Execution Details", "Quantitative Skills", "Communication Skills", "Broad-Reaching Questions", "Ambiguous Questions", "Collaborative Work", "Cross-Functional Collaboration", "Googlers", "Special Projects", "Strategic Initiatives", "Executive Operations", "Chief of Staff", "Chief Marketing Officer", "Google Cloud", "Communication", "Collaboration", "Efficiency", "Organizational Initiatives", "Company Initiatives", "Technology", "User Experience", "Unconventional Ways", "Problem Solving", "Marketing", "Google Products", "Benefits", "Salary", "Compensation", "Equity", "Recruiting", "Hiring Process", "EEO Policy", "EEO is the Law", "Accommodations for Applicants Form"], "benefits": "bonus + equity + benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974770708"}