{"jobTitle": "Regional Training Manager, West Coast", "company": {"name": "Zegna", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$115,000-$120,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Retail Luxury Goods and Jewelry", "description": "Following the path traced by the founder Ermenegildo over 110 years ago, ZEGNA is now internationally recognized as a leading global luxury menswear brand. Established as a fabric maker in the mountains of Piedmont, ZEGNA is part of the Ermenegildo Zegna Group, which counts more than 6,000 employees. Managed by Gildo Zegna as Chairman and CEO, Ermenegildo Zegna Group designs, creates, and distributes luxury ready-to-wear and accessories under both the ZEGNA and Thom Browne brands to over 500 stores. The Group also operates TOM FORD FASHION through a long-term license agreement with The Estée Lauder Companies Inc. to over 100 stores. As of 30th September 2023, ZEGNA has 403 stores of which 242 are directly operated. The brand remains committed to leveraging its rich heritage to build a better present and future.<br/><br/><strong>YOUR OPPORTUNITY<br/><br/></strong>As a<strong> Regional Training Manager </strong>for Zegna, you will be responsible for creating and implementing training and development programs for retail staff at all levels to build organizational capabilities and support the company’s strategic business objectives. You will also collaborate closely with HQ to deploy global programs and provide feedback to improve curriculum. The Regional Training manager creates a learning culture that engages and motivates store teams.<br/><br/>This role reports directly to the SVP of HR and will oversee 10 locations on the West Coast.<br/><br/>This role will be based out of our Beverly Hills boutique and requires travel.<br/><br/><strong>How You Will Contribute<br/><br/></strong><ul><li>Identifies and assesses future and current learning needs through talent assessments, performance feedback, annual performance appraisals, and consultation with managers.</li><li>Works with Retail Leadership for assigned stores to ensure alignment of the learning strategy with overall people and organization strategy</li><li>Proposes learning and development programs and objectives; partners with head office to represent regional needs/requirements.</li><li>Facilitates implementation of appropriate change management initiatives associated with organizational transition activities.</li><li>Acts as a coach and mentor </li><li>Implements Group programs regionally including leadership programs, sales programs, and product training</li><li>Conducts effective induction and orientation sessions</li><li>Plans, organizes, and facilitates region training and development programs.</li><li>Develops effective training materials as required</li><li>Monitors and evaluates training programs' effectiveness (ROI)</li><li>Manages training budget for assigned stores.</li><li>Maintains an understanding of training trends, developments, and best practices.</li><li>Exemplifies the culture and values of the Zegna Group</li><li>Works effectively as a team member with other members of the Human Resources department</li><li>Facilitates learning events and workshops</li><li>Champions the business case for learning and talent investment, and continually ensures the learning strategy and infrastructure is flexible to the evolving organization environment.<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>Minimum 5-7 years’ work experience as a retail training &amp; development manager or extensive retail management experience </li><li>Bachelor's degree in a relevant field or equivalent work experience</li><li>Ability to accommodate travel requirements (estimated 50%)</li><li>Ability to establish effective relationships with a diverse and dynamic client base. </li><li>Ability to manage competing priorities and balance multiple projects in a dynamic, fast-paced environment and respond quickly to feedback with high degrees of initiative and creativity. </li><li>Self-starter with strong initiative, energy and accountability with the ability to work autonomously and in a team environment.</li><li>Project Management skills with a demonstrated ability to lead projects from inception through completion while bringing stakeholders along. </li><li>Strong business acumen and a track record of success in partnering with business leaders. </li><li>Track record in designing and executing successful training programs</li><li>Familiarity with traditional and modern training methods (mentoring, coaching, on-the-job or in-classroom training, e-learning, workshops, simulations, etc.)</li><li>Excellent communication and leadership skills</li><li>Ability to plan, multi-task, and manage time effectively.</li><li>Strong writing skills</li><li>The pay range for this position ranges from $115,000-$120,000 annually with bonus potential. The rate of pay offered will be dependent upon candidates' relevant skills and experience.</li></ul>", "responsibilities": "As a Regional Training Manager for Zegna, you will be responsible for creating and implementing training and development programs for retail staff at all levels to build organizational capabilities and support the company’s strategic business objectives. You will also collaborate closely with HQ to deploy global programs and provide feedback to improve curriculum. The Regional Training manager creates a learning culture that engages and motivates store teams.", "qualifications": {"required": "Minimum 5-7 years’ work experience as a retail training &amp; development manager or extensive retail management experience , Bachelor's degree in a relevant field or equivalent work experience, Ability to accommodate travel requirements (estimated 50%), Ability to establish effective relationships with a diverse and dynamic client base., Ability to manage competing priorities and balance multiple projects in a dynamic, fast-paced environment and respond quickly to feedback with high degrees of initiative and creativity., Self-starter with strong initiative, energy and accountability with the ability to work autonomously and in a team environment., Project Management skills with a demonstrated ability to lead projects from inception through completion while bringing stakeholders along., Strong business acumen and a track record of success in partnering with business leaders., Track record in designing and executing successful training programs, Familiarity with traditional and modern training methods (mentoring, coaching, on-the-job or in-classroom training, e-learning, workshops, simulations, etc.), Excellent communication and leadership skills, Ability to plan, multi-task, and manage time effectively., Strong writing skills"}, "skills": [], "postedDate": "6 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3974978768"}