{"jobTitle": "Shipping / Packing", "company": {"name": "FLAG Solutions LLC", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Title:</strong> Packing/Shipping Associate<br/><br/><strong>Shift:</strong> 7:00 AM - 3:30 PM (8-hour shift)<br/><br/><strong>Pay</strong>: $19-$21<br/><br/><strong>Overview<br/><br/></strong>We are seeking a reliable and detail-oriented Packing/Shipping Associate to support our client in the Aerospace Industry. The ideal candidate will have basic computer skills and experience in inventory Shipping &amp; Receiving as well as Inventory managment. This role is crucial to ensuring our products are accurately packed and shipped to our customers in a timely manner.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Pack and prepare products for shipment according to company standards and customer requirements.</li><li> Ensure accurate labeling and documentation of all outgoing shipments.</li><li> Utilize basic computer skills for data entry and inventory management tasks.</li><li> Assist in managing inventory, including receiving, counting, and organizing products.</li><li> Maintain a clean and organized work area.</li><li> Collaborate with team members to meet daily shipping and packing goals.</li><li> Follow safety protocols and guidelines to ensure a safe working environment.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> High school diploma or equivalent.</li><li> Some computer skills, including familiarity with inventory management software or similar systems.</li><li> Previous experience or exposure to inventory management is preferred.</li><li> Strong attention to detail and organizational skills.</li><li> Ability to lift and move packages up to 30 pounds.</li><li> Excellent communication and teamwork skills.</li><li> Ability to work in a fast-paced environment and meet deadlines.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3974365395"}