{"jobTitle": "Shipping and Receiving Clerk", "company": {"name": "Staffmark Group", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00/hr - 20.00/hr", "currency": "USD"}, "jobFunction": "Distribution and Supply Chain", "industry": "Truck Transportation", "description": "Ready to sail into a new opportunity? Advantage Resourcing has partnered with a dynamic company in La Mirada, CA, passionate about innovation and customer satisfaction. As a Shipping and Receiving Clerk, you will be a crucial part of the team, contributing to our company's commitment to efficiency, teamwork, and excellence.<br/><br/>Shift Availability<br/><br/><ul><li>1st Shift: 6:00 AM - 2:30 PM</li><li>2nd Shift: 2:30 PM - 11:00 PM<br/><br/></li></ul>Pay: $18.00/hr - $20.00/hr<br/><br/>Requirements: The ideal candidate must have 2 years of related experience and be able to lift at least 50 pounds.<br/><br/>All your hard work isn't for nothing! We offer an extensive benefits package that includes:<br/><br/><ul><li>Weekly pay option, direct deposit, and pay card options</li><li>401(K) options and mentorship training program</li><li>Comprehensive benefits plan including medical, dental, and vision insurance</li><li>Referral bonus potential<br/><br/></li></ul>Job Duties: The Shipping and Receiving Clerk will receive all incoming parts and raw materials and ensure that all purchase order and drawing requirements are met. This individual will also be in charge of picking and filling orders from stock and packing and shipping orders using various shipping carriers.<br/><br/>To start a new and exciting journey with us, please click 'Apply Now' and let us be a part of your success story.<br/><br/>The base pay range above represents the low and high end of the base compensation range we reasonably expect to pay for this position. Actual base compensation will vary and may be above or below the range based on various factors including, but not limited to, geographic location, actual experience, and job performance. This job posting is not a promise of any specific pay for any specific employee.<br/><br/>The range listed is just one component of the total compensation package for our employees. Based on the details of your position, we provide a variety of benefits to our employees, including medical, dental, and vision plans, pre-tax savings plans, pre-tax parking and commuter plans, supplemental health and welfare plans, a retirement savings plan, an employee assistance program, pet insurance, and paid holidays. Other rewards may include short-term incentives and paid time off.<br/><br/>After you have applied, download our Staffmark Group WorkNOW App to receive real-time job offers and apply for additional opportunities. You can download it from the App Store or get it on Google Play.", "responsibilities": "The Shipping and Receiving Clerk will receive all incoming parts and raw materials and ensure that all purchase order and drawing requirements are met. This individual will also be in charge of picking and filling orders from stock and packing and shipping orders using various shipping carriers.", "qualifications": {"required": "The ideal candidate must have 2 years of related experience and be able to lift at least 50 pounds."}, "skills": [], "postedDate": "1 month ago", "benefits": "Weekly pay option, direct deposit, and pay card options, 401(K) options and mentorship training program, Comprehensive benefits plan including medical, dental, and vision insurance, Referral bonus potential", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975568101"}