{"jobTitle": "Senior Buyer", "company": {"name": "Amtec Inc.", "location": "Camarillo, CA"}, "location": "Camarillo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Supply Chain, and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Summary:</strong>\n<p>Senior Buyer is a subject matter expert in procurement and negotiating with suppliers for the purchase of designated materials, components, equipment, or services. Has responsibility for the purchase and/or procurement of designated materials, equipment, or services. Consistent with experience and performance, incumbent progress from less to more complex procurement lines.</p>\n<p> </p>\n<p><strong>Position Duties:</strong></p>\n<ul>\n<li>Purchases materials, equipment supplies and services of a specialized or complex nature in accordance with prescribed purchasing regulations and procedures.</li>\n<li>Gathers quotations, examines bids, negotiates to secure favorable terms meeting criteria such as price, quantity, quality and delivery date and places orders timely.</li>\n<li>Works closely with internal customers, to obtain specifications necessary to accomplish specific projects related to program needs and participate in meetings as well as reviews and analyzes departmental purchase requisitions for completeness and accuracy of information; contacts department or initiator to clarify or complete the required information.</li>\n<li>Interprets and communicates purchasing procedures to departments and suppliers as a specialist in the assigned material commodities; assists departments in initiating requisitions and orders.</li>\n<li>Proactive in identifying and solving material issues to eliminate shortages and minimize production delays. Expedites orders and keeps internal customers informed when problems occur.</li>\n<li>Interfaces with other departments timely to solve and support problem resolution to minimize impact to the production schedule. The use of initiative, discretion and independent judgment within established guidelines is required. Assists departments in the evaluation of goods and services as needed; ensures that customers' expectations and requirements are met.</li>\n<li>Resolves conflicts concerning materials or services at the department and supplier levels; coordinates delivery and installation; confirms with customer that all products are received in condition consistent with original request or bid.</li>\n<li>Evaluate supplier’s performance and reliability; identifies potential suppliers, schedules the necessary site visitations, and develops new supply sources where suppliers are inadequate.</li>\n<li>Monitors cost, schedule, and scope of assigned purchase orders to assure best quality at best value.</li>\n<li>Meet annual productivity goals through cost reduction efforts with suppliers.</li>\n<li>Works closely with suppliers to process rejections; inputs, edits, and retrieves purchasing data; disburses and maintains files related to purchase orders and purchasing; maintains other department files including those special provisions that may be changed and renegotiated throughout the duration of the contract.</li>\n<li>Monitors on-time delivery performance for assigned commodities or suppliers. Reviews monthly results reconciling discrepancies.</li>\n<li>Communicate issues and risks promptly to management which may result in interruptions in product and recommend alternative solutions.</li>\n<li>Manages the supply base by maintaining supplier performance in the areas of quality, delivery, and pricing to support the desired business target levels.</li>\n<li>Works closely with Production Planner and Supply Chain Manger, understanding all inputs of demand contributing to generation of purchasing requisitions.</li>\n<li>Coordinates the efficient and timely movement of material, purchase orders and work orders through the procurement and manufacturing cycle.</li>\n<li>Provides pricing and lead times and projected ship dates to internal customers, responsible for the maintenance of planning data fields such as lead time, min max quantity, minimum order, order multiple, and update supplier contact information.</li>\n<li>Ensure that business in conducted with integrity and in compliance with all processes and procedures.</li>\n</ul>\n<p><strong>Competencies: </strong></p>\n<ul>\n<li>Initiative - Plans ahead for upcoming problems or opportunities and takes appropriate action. Demonstrates the ability to foresee problems and prevent them by acting.</li>\n<li>Results Focused – The ability and drive for achieving and surpassing targets against an internal or external standard of excellence. This is about showing a passion for improving the delivery of services with a commitment to continuous improvement in your procurement process.</li>\n<li>Negotiation Skills – The ability to persuade, influence and explore positions and alternatives to reach outcomes that will gain acceptance of all parties and will also meet strategic procurement objectives.</li>\n<li>Communication – Clearly conveys information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message.</li>\n<li>Problem Solving- Identifies and resolves problems in a timely manner; Gathers and analyzes information skillfully.</li>\n<li>Quality- Demonstrates accuracy and thoroughness; Looks for way to improve and promote quality. Applies feedback to improve performance; Monitors own work to ensure quality.</li>\n</ul>\n<p><strong>Education &amp; Experience: </strong></p>\n<ul>\n<li>BA or BS degree in Supply Chain, Business Management, or Materials-related field.</li>\n<li>Minimum 5 years of experience in procurement, material/production planning or demonstrated equivalent knowledge of supply chain function through work experience or school.</li>\n<li>Strong Knowledge in ERP systems (required)</li>\n<li>Knowledgeable and experienced in machined and electronic components (preferred)</li>\n<li>Knowledge of ISO and/or AS9100 (preferred)</li>\n</ul>\n<p><strong>Skillset: </strong></p>\n<ul>\n<li>Thorough of computer systems that support production, e.g., inventory control, purchasing, production scheduling and Materials Requirement Planning (MRP)</li>\n<li>Intermediate Microsoft Office applications: Outlook, Word, Excel, PowerPoint</li>\n<li>Ability to coordinate materials and production schedules with multiple teams, solve urgent problems associated with the manufacture of products and document and communicate production outcomes and trends</li>\n</ul>\n<p><strong>Travel: </strong>Travel is required – estimated time once per calendar month or based on business needs and geographic location of supplier base.</p>", "responsibilities": "Senior Buyer is a subject matter expert in procurement and negotiating with suppliers for the purchase of designated materials, components, equipment, or services. Has responsibility for the purchase and/or procurement of designated materials, equipment, or services. Consistent with experience and performance, incumbent progress from less to more complex procurement lines.", "qualifications": {"required": "BA or BS degree in Supply Chain, Business Management, or Materials-related field.\nMinimum 5 years of experience in procurement, material/production planning or demonstrated equivalent knowledge of supply chain function through work experience or school.\nStrong Knowledge in ERP systems (required)", "preferred": "Knowledgeable and experienced in machined and electronic components (preferred)\nKnowledge of ISO and/or AS9100 (preferred)"}, "skills": ["Procurement", "Negotiation", "Supply Chain", "ERP", "Materials Requirement Planning (MRP)", "Microsoft Office", "ISO", "AS9100"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975028069"}