{"jobTitle": "Warehouse Associate", "company": {"name": "AMMEGA", "location": "Bell, CA"}, "location": "Bell, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Automation Machinery Manufacturing", "description": "<strong>Summary<br/><br/><br/></strong><strong> JOB DESCRIPTION <br/><br/><br/></strong>The CSC Associate’s primary responsibilities include processing incoming stock and materials, picking orders from stock, packing and shipping orders, and organizing the warehouse.<br/><br/><strong>Primary Duties And Responsibilities<br/><br/><br/></strong><ul><li>Observe and follow safety rules as prescribed by the safety policies, including wearing required PPE. Completes an expected amount of work based on time studies in accordance with schedule. Able to operate all necessary equipment in a proficient manner.</li><li>Prepare orders by pulling materials and checking for accuracy, packing boxes and placing orders in the delivery area.</li><li>Driving and operating forklift after you have been certified, (company will provide certification).</li><li>Load/unload containers and trucks, including check material in and report discrepancies, put stock in proper locations.</li><li>Maintain a safe and clean work environment by organizing the warehouse for orderliness and sweeping of the floor daily and general housekeeping.</li><li>Comply with OSHA and other safety regulations, wear the proper safety equipment provided at all times.</li><li>Perform cycle count inventory.</li><li>Cross-train and perform Shipper/Receiver duties such as: Print daily sales receipts and cross-check with computer software to ensure accuracy. Prepare and print shipping labels corresponding to shipping needs for domestic and international shipments. Check received goods against purchase orders or receiving papers – quantity, type, size, part numbers, dimensions. Route or deliver materials to storage or manufacturing locations. Maintain records and prepare receiving and shipping reports. May load and unload trucks. Assemble and fill boxes and other cartons with items that need to be shipped. Affix proper postage to each package in preparation for shipping. Track inventory and report any shortages to sales team so we can update the website. Process orders based on the buyer’s preferred shipping system (e.g. USPS, UPS, FedEx, etc.). Contact carrier and schedule shipping for each package.</li><li>Cross-train and perform Cutter/Slitter duties such as: Set-up and operate cutting machines and branding machines, Read work orders to determine dimensions of belts and then cut to customers’ specifications, Assist supervisor/manager with maintenance of machines, Unload shipping containers and trucks, check-in material and report discrepancies, put stock in proper locations, Maintain a safe and clean work environment by organizing the warehouse for orderliness and sweeping of the floor daily, Comply with OSHA and other safety regulations, wear the proper safety equipment provided at all times.</li><li>Maintain regular and timely attendance.</li><li>Follow company’s policies and procedures.</li><li>All other duties as assigned. <br/><br/></li></ul><strong>Knowledge And Skills Requirements<br/><br/><br/></strong><ul><li>High school diploma/GED preferred </li><li>1+ years’ experience in retail or e-commerce preferred, will receive on the job training </li><li>Excellent organizational and time management skills </li><li>Ability to work well in a fast-paced environment with frequently changing dynamics </li><li>Ability to lift up to 50 lbs.</li><li>Solid basic math skills using addition, subtraction, multiplication, division</li><li>Ability to be trained/certified on powered industrial truck (P.I.T.) </li><li>May use banding or shrink wrap machines</li><li>Understand stock locater system<br/><br/></li></ul><strong>Competencies<br/><br/><br/></strong><ul><li>Excellent communication and follow-up skills</li><li>Detail and task orientated</li><li>Continuous improvement/innovation</li><li>Must be able to read and write English<br/><br/></li></ul><strong>Key Behaviors <br/><br/><br/></strong><ul><li>Are accountable to others</li><li>Have the courage to challenge the status quo</li><li>Are honest with co-workers and customers</li><li>Able to be innovative problem solvers</li><li>Are engaged team members</li><li>Add value to the Company</li><li>Expects excellence of self and others</li><li>Overserves top customers </li><li>Understands, simplifies and acts to improve processes<br/><br/></li></ul><strong>Physical Demands<br/><br/><br/></strong><ul><li>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The phrases “occasionally,” “regularly,” and “frequently” correspond to the following definitions: “Occasionally” means up to 1/3 of working time, “regularly” means between 1/3 and 2/3 of working time, and “frequently” means 2/3 and more working time. </li><li>While performing the duties and responsibilities of this position, the employee is occasionally required to walk, use foot/feet to operate machine, climb or balance, stoop, kneel, crouch or crawl, reach above shoulders and move from place to place. The incumbent will regularly stand, sit and talk and listen and will frequently use hands to finger, handle or touch. Specific vision requirements for this position include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus. </li><li>During the performance of his/her work duties, the incumbent will be required to occasionally lift up to 50 pounds, and will frequently lift up to 25 pounds such as moving parts from material storage and moving parts in and out of work area. <br/><br/></li></ul><strong>Work Environment<br/><br/><br/></strong><ul><li>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. </li><li>The employee works in a factory environment and is occasionally exposed to wet, humid conditions and toxic or caustic chemicals. He/she is frequently exposed to fumes or airborne particles and work near moving mechanical parts. The noise level in the work environment is loud. </li><li>The above statement reflect the general details necessary to describe the principle functions of the occupation describes and shall not be construed as a detailed description of all the work that may be inherent in the occupation.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3975705988"}