{"jobTitle": "Senior Planner", "company": {"name": "Umanist Staffing", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Business Consulting and Services", "description": "RPO DIRECT HIRE<br/><br/><strong>No Relo at this time<br/><br/><strong>ONSITE MONDAY - FRIDAY<br/><br/></strong><ul><li>PLANNER SENIORThe Planner Sr ensures performance to the master production schedule to achieve objectives for customer service, inventory levels, and configuration management for the Irvine, CA location of *** Fluid Systems Division. Plans, prepares, issues, and controls diverse production schedules and material requirements to ensure a controlled flow of approved materials timed to meet production requirements. This is an on-site position located at our Irvine, CA facility.</li><li>MUST HAVE STRONG PLANNING EXPERIENCE (2 OR MORE YEARS A PLUS)</li><li>MUST HAVE EXPERIENCE IN MANUFACTURING/AEROSPACE</li><li>BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION</li><li>NO JOB HOPPING</li><li>RESPONSIBILITIES:Manages the Master Production Schedule (MPS) for their customer/value stream. Establishes all supply plans in support of the master schedule.</li><li>Identifies supply gaps affecting execution of the MPS and impacting on-time delivery to customers. Works closely with procurement and following escalation protocol to recover supply gaps in order to mitigate customer delinquencies and impact to sales outlooks.</li><li>Coordinates with Quality, Manufacturing, Purchasing, Engineering, Inventory Control, Shipping/Receiving, and Contract Administration to ensure flow of materials through the production process while providing status and coordinating priorities.</li><li>Manages the item master, bill of material, revision changes, and system integrity relating to part control.</li><li>Actively manages KPIs relating to DSI, LISC, Sales, and other supply chain related metrics.</li><li>Applies continuous improvement techniques and methods (Lean, Kaizen, etc.) to internal processes and systems. Complies with policies and procedures in Government/Commercial Practices Manual (GPM/CPM).</li><li>QUALIFICATIONS:Demonstrated ability to perform the essential functions of the job typically acquired through two or more years of related experience. In addition, has completed a bachelor’s degree in Business Administration concentration in Supply Chain highly desirable) or a related field.</li><li>CPIM certification, Manufacturing Resource Planning (MRP) systems, and Supply/Demand Planning experience in aerospace manufacturing are highly desirable.</li><li>Knowledge of manufacturing resources planning theories, principles, and industry practices. Proficient in standard business application software, manufacturing resource planning systems, and interface operations.</li><li>Ability to effectively apply continuous improvement methods to the planning function (e.g., pull systems, process mapping, JIT) of legal, regulatory, and internal policy requirements related to production control.</li><li>Ability to work on a variety of problems of moderate scope and complexity where analysis of the situation or data requires thorough identification of factors and analysis of impact.</li><li>Ability to respond to significant inquiries or complaints from customers, regulatory agencies, or members of the business community. Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to effectively demonstrate team member competencies and participate in goal setting, performance feedback, and self-development<br/><br/></li></ul>Skills: manufacturing,aerospace,materials,customer,continuous improvement", "responsibilities": "The Planner Sr ensures performance to the master production schedule to achieve objectives for customer service, inventory levels, and configuration management for the Irvine, CA location of *** Fluid Systems Division. Plans, prepares, issues, and controls diverse production schedules and material requirements to ensure a controlled flow of approved materials timed to meet production requirements. This is an on-site position located at our Irvine, CA facility.", "qualifications": {"required": "MUST HAVE STRONG PLANNING EXPERIENCE (2 OR MORE YEARS A PLUS)\nMUST HAVE EXPERIENCE IN MANUFACTURING/AEROSPACE\nBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION\nNO JOB HOPPING", "preferred": "CPIM certification, Manufacturing Resource Planning (MRP) systems, and Supply/Demand Planning experience in aerospace manufacturing are highly desirable."}, "skills": ["manufacturing", "aerospace", "materials", "customer", "continuous improvement"], "postedDate": "1 month ago", "salary": {"amount": "90,000.00/yr - 92,000.00/yr", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975053098"}