{"jobTitle": "Staff Accountant", "company": {"name": "IntelliPro", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$60,000 - $70,000", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Staffing and Recruiting", "description": "<strong>Job Title:</strong> Staff Accountant<br/><br/><strong>Position Type: </strong>Full-Time<br/><br/><strong>Location: </strong>City of Industry, CA<br/><br/><strong>Salary Range / Rate:</strong> $60,000 - $70,000<br/><br/><strong>Job ID#: </strong>141267<br/><br/><strong>Position Summary<br/><br/></strong>The Staff Accountant will report direct to the Accounting Manager and will be responsible for a variety of accounting tasks, including bank reconciliation, sales and use tax filing, and fixed asset maintenance. The Staff Accountant role requires a proactive approach to supporting our financial operations, ensuring accuracy and compliance with relevant laws and regulations.<br/><br/><strong>Essential Tasks, Duties, &amp; Responsibilities<br/><br/></strong><ul><li> Support month end closing process including preparation of accurate journal entries, account analysis and reconciliation.</li><li> Perform bank reconciliations to ensure accurate financial reporting and cash management.</li><li> Maintain fixed asset records, including depreciation schedules and asset verification.</li><li> Collaborate with external consultants on sales and use tax filings, ensuring timely submissions and adherence to state and federal regulations.</li><li> Assist with the preparation and filing of 571-L unsecured property tax returns.</li><li> Manage the renewal process for business licenses, ensuring compliance with local and state requirements. This includes overseeing and maintaining the company’s state online accounts related to tax and business filings.</li><li> Provide support during internal and external audits, including financial statement audit and royalty audits, to ensure all financial documentation is in order.</li><li> Take on additional projects as assigned by management, demonstrating flexibility and adaptability. This may include continuously updating existing SOP (standard operating procedures) or creating new ones.</li><li> Perform other duties as needed and directed by management.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><strong>Education &amp; Experience<br/><br/></strong><ul><li> B.A. degree in accounting or related field preferred.</li><li> 2+ years of overall Finance or General Accounting experience.<br/><br/></li></ul><strong>Knowledge, Skills &amp; Abilities<br/><br/></strong><ul><li> Knowledge of accounting principles and financial reporting.</li><li> Proficiency with accounting software.</li><li> Strong organizational skills and attention to detail.</li><li> Effective communication skills, both written and verbal</li><li> Exhibit an ability and eagerness to learn new skills and accounting practices and contributing to continuous improvement.</li><li> Intermediate to advance experience in MS Word, MS Excel.</li><li> Exhibit an ability and eagerness to learn new skills and accounting practices and contributing to continuous improvement.</li><li> Ability to work independently and as part of a team.<br/><br/></li></ul><em>Note: The statements herein are intended to describe the general nature and level of work being performed by employees, but are not a complete list of responsibilities, duties, and skills required of personnel so classified. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the employer.<br/><br/></em><strong>About Us:<br/><br/></strong>Founded in 2009, IntelliPro is a global leader in talent acquisition and HR solutions. Our commitment to delivering unparalleled service to clients, fostering employee growth, and building enduring partnerships sets us apart. With a dynamic presence in the USA, China, Canada, Singapore, Philippines, UK, India, Netherlands, and Germany, we continue leading global talent solutions.<br/><br/>IntelliPro, a global leader connecting individuals with rewarding employment opportunities, is dedicated to understanding your career aspirations. As an Equal Opportunity Employer, IntelliPro values diversity and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, disability, or any other legally protected group status. Moreover, our Inclusivity Commitment emphasizes embracing candidates of all abilities and ensures that our hiring and interview processes accommodate the needs of all applicants. Learn more about our commitment to diversity and inclusivity at https://intelliprogroup.com/.<br/><br/><strong>Compensation: </strong>The pay offered to a successful candidate will be determined by various factors, including education, work experience, location, job responsibilities, certifications, and more. Additionally, IntelliPro provides a comprehensive benefits package, all subject to eligibility.", "responsibilities": "Support month end closing process including preparation of accurate journal entries, account analysis and reconciliation. Perform bank reconciliations to ensure accurate financial reporting and cash management. Maintain fixed asset records, including depreciation schedules and asset verification. Collaborate with external consultants on sales and use tax filings, ensuring timely submissions and adherence to state and federal regulations. Assist with the preparation and filing of 571-L unsecured property tax returns. Manage the renewal process for business licenses, ensuring compliance with local and state requirements. This includes overseeing and maintaining the company’s state online accounts related to tax and business filings. Provide support during internal and external audits, including financial statement audit and royalty audits, to ensure all financial documentation is in order. Take on additional projects as assigned by management, demonstrating flexibility and adaptability. This may include continuously updating existing SOP (standard operating procedures) or creating new ones. Perform other duties as needed and directed by management.", "qualifications": {"required": "Knowledge of accounting principles and financial reporting. Proficiency with accounting software. Strong organizational skills and attention to detail. Effective communication skills, both written and verbal. Exhibit an ability and eagerness to learn new skills and accounting practices and contributing to continuous improvement. Intermediate to advance experience in MS Word, MS Excel. Exhibit an ability and eagerness to learn new skills and accounting practices and contributing to continuous improvement. Ability to work independently and as part of a team.", "preferred": "B.A. degree in accounting or related field preferred. 2+ years of overall Finance or General Accounting experience."}, "skills": ["Accounting", "Financial Reporting", "Accounting Software", "Organizational Skills", "Attention to Detail", "Communication", "MS Word", "MS Excel"], "postedDate": "1 month ago", "benefits": "IntelliPro provides a comprehensive benefits package, all subject to eligibility.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975258176"}