{"jobTitle": "Administrative Assistant, Global Publicity", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000-60,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Job Description<br/><br/></strong>Here at Universal’s Filmed Entertainment Group, we bring our campaigns to life by weaving innovation and creativity into our marketing campaigns. The Los Angeles Publicity team is looking for an Administrative Assistant who is passionate about film and entertainment and eager to work in the fast-paced and exciting world of publicity. This role is an integral part of the publicity function that has a focus of providing support to a talent team and helps bring to life the various pieces of marketing campaigns.<br/><br/>This person will be responsible managing schedules, coordinating meetings and handling travel arrangements for the SVP, Global Publicity as well as ad hoc request across the team.<br/><br/><ul><li>Handle all aspects of accounting/finance (including vendor registration, create POs, reconcile p-cards and invoices)</li><li>Arrange all filmmaker and talent travel/travel grids (including commercial flights, private jets, hotels, greeters, and cars)</li><li>Hire and negotiate rates with glam artists for filmmakers and talent</li><li>Create and edit talent/filmmaker schedules</li><li>Add travel/cars/greeters to territory tour schedules</li><li>Acquire visas for filmmakers/talent when needed</li><li>Organize and work screenings for press, talent/rep, charity and tastemakers, including securing tech, press list, security, parking and concessions</li><li>Manage Talent at premieres &amp; award ceremonies and staff hospitality at junkets and content days</li><li>Organize, collect and distribute press breaks to filmmakers</li><li>Compile and send out broadcast tune-ins internally and externally to filmmakers</li><li>Create, maintain and distribute team calendars, event &amp; festival documents, film calendars, quote docs, review docs, reaction memos, screening memos, distro lists, contact sheets, status reports, and publicity reports</li><li>Prepare filmmaker deck outline for filmmaker presentation decks</li><li>Support the greater PR team in coordinating meetings and conference calls, booking conference rooms and meeting setup (A/V etc.) when in office</li><li>Create the budget grid and breakdown for your team’s titles, keep track of changes and keep SVP apprised of film budgets</li><li>Create and distribute embargo forms for international screenings + events (junket, content days, etc.)</li><li>Create, review and distribute territory review reports and reactions to filmmakers and executives</li><li>Connect phone interviews with talent and filmmakers as needed<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>1+ years of experience in the entertainment industry</li><li>Working knowledge of Microsoft based software: Outlook, Word and Excel<br/><br/></li></ul><strong>Eligibility Requirements<br/><br/></strong><ul><li>Willingness to work evenings and weekends with short notice and be flexible with hours<br/><br/></li></ul><strong>Desired Characteristics<br/><br/></strong><ul><li>Experience working with multiple clients, departments, etc.</li><li>Strong written and communication skills at all levels</li><li>Flexibility to maintain ever-changing schedules and itineraries</li><li>Extremely detailed oriented and organized</li><li>Able to work well under pressure and be flexible in an ever-changing environment</li><li>4-year college degree in marketing or related field is preferred <br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/></li></ul>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $50,000-60,000<br/><br/><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "This person will be responsible managing schedules, coordinating meetings and handling travel arrangements for the SVP, Global Publicity as well as ad hoc request across the team.<br/><br/><ul><li>Handle all aspects of accounting/finance (including vendor registration, create POs, reconcile p-cards and invoices)</li><li>Arrange all filmmaker and talent travel/travel grids (including commercial flights, private jets, hotels, greeters, and cars)</li><li>Hire and negotiate rates with glam artists for filmmakers and talent</li><li>Create and edit talent/filmmaker schedules</li><li>Add travel/cars/greeters to territory tour schedules</li><li>Acquire visas for filmmakers/talent when needed</li><li>Organize and work screenings for press, talent/rep, charity and tastemakers, including securing tech, press list, security, parking and concessions</li><li>Manage Talent at premieres &amp; award ceremonies and staff hospitality at junkets and content days</li><li>Organize, collect and distribute press breaks to filmmakers</li><li>Compile and send out broadcast tune-ins internally and externally to filmmakers</li><li>Create, maintain and distribute team calendars, event &amp; festival documents, film calendars, quote docs, review docs, reaction memos, screening memos, distro lists, contact sheets, status reports, and publicity reports</li><li>Prepare filmmaker deck outline for filmmaker presentation decks</li><li>Support the greater PR team in coordinating meetings and conference calls, booking conference rooms and meeting setup (A/V etc.) when in office</li><li>Create the budget grid and breakdown for your team’s titles, keep track of changes and keep SVP apprised of film budgets</li><li>Create and distribute embargo forms for international screenings + events (junket, content days, etc.)</li><li>Create, review and distribute territory review reports and reactions to filmmakers and executives</li><li>Connect phone interviews with talent and filmmakers as needed<br/><br/></li></ul>", "qualifications": {"required": "1+ years of experience in the entertainment industry\nWorking knowledge of Microsoft based software: Outlook, Word and Excel", "preferred": "4-year college degree in marketing or related field"}, "skills": ["Microsoft Office", "Outlook", "Word", "Excel", "Travel Arrangements", "Scheduling", "Meeting Coordination", "Accounting", "Finance", "Vendor Management", "Budgeting", "Communication", "Public Relations", "Entertainment Industry"], "postedDate": "2 weeks ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3975679703"}