{"jobTitle": "Buyer", "company": {"name": "Belcan", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Information Technology & Services", "description": "The Buyer uses expertise in performing a variety of purchasing activities including pricing, negotiating terms, volume discounts, long-term contracts and delivery of goods\\services with suppliers. Applies government laws and regulations while conducting procurement activities and ensures alignment with management objectives.<br/><br/>", "responsibilities": "Review MRP (SAP) order action messages, maintain schedule and visibility, identify and resolve issues until shipment.<br/>Generate work orders and issue purchase orders based on MRP (SAP) messages.<br/>Negotiate price and deliveries that are consistent with schedule needs.<br/>Process changes, reschedules and outside processing that are required to accomplish the production schedule goals.<br/>Ensure customer satisfaction by achieving on time deliveries of quality product.<br/>Follow through special requests and expedites.<br/>Identify potential late deliveries and plan recovery.<br/>Prioritize material handling from receipt to shipment based on schedule requirements and department workload.<br/><br/>", "qualifications": {"required": "Excellent planning, organizational and motivational skills.<br/>Knowledge of MRP (SAP) system is a must<br/>General knowledge of machine shop practices and processing standards helpful.<br/>Knowledge of military spares standards helpful.<br/>Requires strong knowledge of Microsoft Word, Excel and Computerized MRP system<br/>Requires strong interpersonal communications (written and verbal) with a positive attitude and ability to motivate others.<br/><br/>", "preferred": "Bachelor's degree<br/>5+ years related experience<br/><br/>"}, "skills": ["MRP", "SAP", "Microsoft Word", "Excel", "Machine Shop", "Military Spares"], "postedDate": "1 month ago", "benefits": "Medical / Health Benefits with multiple plan options, Flexible Spending Accounts, Dental and Vision<br/>401k<br/>On the job training / cross-training<br/>Life Insurance, disability insurance<br/>Voluntary life insurance for family members available.<br/>Accident and critical illness insurance optional.<br/>Scheduled performance reviews<br/>Referral program<br/><br/>", "url": "https://www.linkedin.com/jobs/view/3975420479"}