{"jobTitle": "Assistant Store Manager", "company": {"name": "Pronovias Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales", "industry": "Retail Apparel and Fashion", "description": "Pronovias Group, worldwide leader in the bridal industry is looking for an Assistant Store Manager for our Store on Beverly Drive that will be responsible for coordinating and monitoring the team, the store and the activities carried out according to the guidelines of the Store Manager, guaranteeing the sales objectives assigned, the customer satisfaction and the store image.<br/><br/>Main responsibilites:<br/><br/><ul><li>Foster the team motivation.</li><li>Distribute and share the set up objectives with the store team, monitoring them closely.</li><li>Manage the store team timetable as well as their absences and its corresponding reporting.</li><li>Coordinate and ensure that the different projects and development plans for the store team are applied.</li><li>Foster the team growth to guarantee its profitability, acquiring a global business vision.</li><li>Monitor the results of the store inventories.</li><li>Organize, coordinate and monitor the store sales team to guarantee a customer service focused to be excellent.</li><li>Organize, coordinate and monitor the atelier team in order to guarantee that the product is adjusted according to the quality and the established time, always assuring the client satisfaction.</li><li>Organize and supervise the after sales period (fitting, delivering, ironing and refit) of each dress, assuring that the client satisfaction in the planned fittings.</li><li>Collaborate with the sales consultants in providing advice to the customer and being professional helping the customer to take a decision.</li><li>Provide updated information about the status of the store to the Store Manager in order to take appropriate decisions.</li><li>Manage the daily appointments planning, fittings and tasks to guarantee a correct organization according to human and material resources, assuring the client satisfaction.</li><li>Control the available stock to carry out activities to minimize it, as well as increasing or adjusting orders according to the customer requests. Inform to the store staff about possible adjustments in products, prices, IT… to develop their activities in a satisfactory manner.</li><li>Assure a global store image, according to the company internal policy and performing as a PRONOVIAS ambassador.<br/><br/><br/></li></ul>Requirements:<br/><br/><ul><li>Good academic background in business and/or fashion designing</li><li>At least 3-5 years as Assistant Store Manager in bridal or ready to wear luxury brand and used to manage large teams</li><li>Used to manage a P&amp;L, work with KPI’s and good level in excel (analytics, reporting, action plan development…)</li><li>Fluency in English is mandatory, the knowledge of Spanish is a plus.</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3975180627"}