{"jobTitle": "FT Sales Supervisor - Citadel", "company": {"name": "LVMH", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Luxury Goods and Jewelry", "description": "Marc JacobsInternational, powered bythe creative genius of Marc Jacobs, seeks a Sales Supervisorto join its Citadel Outletin Commerce, California. Coming in August 2024. RESPONSIBILITIES: Job responsibilities include but are not limited to: Partnerwith and assistthe Store Manager in all aspects of the store functions - Sales generation, people development, merchandising and operations. Coachand developsales associatesin the moment while driving sales on the floor Drive your own percentage of sales Trainall POS transactions - overseecustomer service issues as needed Open and close the store in absence of Store Manager QUALIFICATIONS: 2+ years retail experience Excellent organization skills Customer service skills Familiar with Microsoft Office Applications SALARY & BENEFITS/WHAT WE OFFER: The compensation for this position ranges from$21 to $22per hour plus commission. The rate of pay offered will be dependent upon candidate’s relevant skills and experience. If applicable, we offer our employees a comprehensive benefits package including paid holidays, vacation time, sick and personal time, medical, dental and vision insurance, and 401k matching. We also offer discounts on travel, entertainment, and more through our partnership with PerkSpot. MJ employees also receive discounts on MJ products throughout the year, as well as access to discounts on other LVMH brands. ABOUT MARC JACOBS For nearly 40 years, Marc Jacobs has been a driving force in fashion with his philosophy: pioneering designs, an irreverent spirit, the everyday and the extraordinary. Today, the brand continues to make its Marc as rebellious, unpredictable, and original. Our work is founded on our core brand pillars: unexpected, utilitarian, urban, unisex, and unique. NYC in design and spirit, our teams thrive off relentless authenticity, an openness to standing out, and inclusivity for all. EEO STATEMENT Marc Jacobs International was founded on Marc’s vision of celebrating uniqueness and being Perfect as You Are. We are committed to building an equitable and inclusive culture that values diversity of thought, background, and experience – all essential to our spirit of innovation and creativity. In line with this commitment, we believe that the best candidate may be one who comes from a less traditional background or may meet the qualifications in different ways. We encourage you to apply even if you don’t meet all of the listed qualifications. Marc Jacobs International is committed to providing equal employment opportunities to all employees and applicants for employment regardless of race, color, sex, sexual orientation, gender identity or expression, age, veteran status, national origin, religion, disability, or any other characteristic protected by federal, state or local law.", "responsibilities": "Job responsibilities include but are not limited to: Partnerwith and assistthe Store Manager in all aspects of the store functions - Sales generation, people development, merchandising and operations. Coachand developsales associatesin the moment while driving sales on the floor Drive your own percentage of sales Trainall POS transactions - overseecustomer service issues as needed Open and close the store in absence of Store Manager", "qualifications": {"required": "2+ years retail experience Excellent organization skills Customer service skills Familiar with Microsoft Office Applications"}, "skills": ["Sales", "Customer Service", "Retail", "Microsoft Office"], "postedDate": "1 month ago", "benefits": "The compensation for this position ranges from$21 to $22per hour plus commission. The rate of pay offered will be dependent upon candidate’s relevant skills and experience. If applicable, we offer our employees a comprehensive benefits package including paid holidays, vacation time, sick and personal time, medical, dental and vision insurance, and 401k matching. We also offer discounts on travel, entertainment, and more through our partnership with PerkSpot. MJ employees also receive discounts on MJ products throughout the year, as well as access to discounts on other LVMH brands.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975246648"}