{"jobTitle": "Business Operation Manager", "company": {"name": "Unio Health Partners", "location": "Torrance, CA", "industry": "Medical Practices"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "135,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Medical Practices", "description": "BUSINESS OPERATION MANAGER<br/><br/><strong>Company Description<br/><br/></strong>Unio Health Partners (UHP) is a highly differentiated physician practice management platform with the goal of transforming care delivery across the Western United States. UHP partners with leading physician practices, creating a cohesive, quality-oriented clinical culture and facilitating best practice sharing across the platform. Our affiliated practices gain access to a broader suite of services, providing a meaningful benefit to both physicians and patients. UHP's best-in-class clinical program covers three sub-specialties (urology, gastroenterology, and radiation oncology) and offers numerous ancillary services, including pathology lab, in-office dispensing, and chronic care management. We are led by a highly accomplished management team and provide a full suite of management services to its affiliated practices. UHP is currently affiliated with 68 providers consisting of 49 physicians and 19 advanced practice providers operating out of 21 locations in the greater Los Angeles and San Diego areas.<br/><br/><strong>Position Summary<br/><br/></strong>Under the general guidance of the Chief Operating Officer, the Business Operations Manager supports the organization across multiple functions and is responsible for ensuring effective coordination and management of numerous, varied projects for the Company, by developing tools and processes to ensure projects, initiatives, and business processes are actively managed both pre and post implementation. The successful candidate will engaging with subject matter experts, internal clients, as well as vendors or other third parties to achieve the desired outcome in support of business objectives, while also focusing on speed to value. This position requires an agile and dynamic person who is a critical thinker and influencer who has an eye for detail and the ability to work in a distributed fast-paced environment to support the delivery of programs and multi-channel projects designed to deliver business results. <br/><br/><strong>What You Will Be Doing<br/><br/></strong><ul><li>Manage the overall planning, execution, and delivery of assigned initiatives, including the creation and development of project plans and tracking against planned timelines.</li><li>Lead, plan, schedule, track, and manage project deliverables, goals, and milestones; adjust project plans and resources to meet changing needs and requirements.</li><li>Facilitate project teams to successfully plan and execute deliverables using project management techniques while managing risks and budget; provide relevant metrics to gauge team progress with a continual focus on improvement.</li><li>Assess risks and create strategies for risk mitigation and project contingency planning; provide project forecasting of duration, performance to date, overall cost, priorities, milestones, and capacity.</li><li>Deliver and coordinate communication with all areas of the enterprise that impact the scope, budget, risk, and resources of the work effort being managed; escalate issues with leadership as appropriate.</li><li>Other duties or schedules, including holidays, nights, or weekends, may be assigned based on business needs. .<br/><br/><br/></li></ul><strong>What You Will Bring To The Team<br/><br/></strong><ul><li>Minimum of 5-7 years of project management experience, preferably with a focus on healthcare operations.</li><li>BA/BS degree required; Project Management Professional (PMP) or equivalent experience preferred.</li><li>Previous experience with Strategic Planning preferred and Portfolio Management preferred.</li><li>An ability to lead diverse, large groups toward a common goal, developing and maintaining strong working relationships across all levels.</li><li>An Ability to strategize with executives, synthesize information, and translate complex issues into actionable plans, complemented by strong project planning, management, and documentation skills.</li><li>Strong organizational, problem-solving, and time management skills, essential for effective team leadership and project execution.<br/><br/><br/></li></ul><strong>What We Can Offer You<br/><br/></strong><ul><li>Competitive Salary and Health Benefits (Medical, Dental, Vision) </li><li>Generous time off (start accruing on your first day - no waiting period)</li><li>Paid Holidays</li><li>401(k)</li><li>Company Discounts</li><li>Collaborative work environment - we want our employees to have a say in how we run our office</li><li>Employee Recognition - we encourage employee recognition through our GEMS program</li></ul>", "responsibilities": "Manage the overall planning, execution, and delivery of assigned initiatives, including the creation and development of project plans and tracking against planned timelines.Lead, plan, schedule, track, and manage project deliverables, goals, and milestones; adjust project plans and resources to meet changing needs and requirements.Facilitate project teams to successfully plan and execute deliverables using project management techniques while managing risks and budget; provide relevant metrics to gauge team progress with a continual focus on improvement.Assess risks and create strategies for risk mitigation and project contingency planning; provide project forecasting of duration, performance to date, overall cost, priorities, milestones, and capacity.Deliver and coordinate communication with all areas of the enterprise that impact the scope, budget, risk, and resources of the work effort being managed; escalate issues with leadership as appropriate.Other duties or schedules, including holidays, nights, or weekends, may be assigned based on business needs.", "qualifications": {"required": "Minimum of 5-7 years of project management experience, preferably with a focus on healthcare operations.BA/BS degree required; Project Management Professional (PMP) or equivalent experience preferred.Previous experience with Strategic Planning preferred and Portfolio Management preferred.An ability to lead diverse, large groups toward a common goal, developing and maintaining strong working relationships across all levels.An Ability to strategize with executives, synthesize information, and translate complex issues into actionable plans, complemented by strong project planning, management, and documentation skills.Strong organizational, problem-solving, and time management skills, essential for effective team leadership and project execution.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "benefits": "Competitive Salary and Health Benefits (Medical, Dental, Vision) Generous time off (start accruing on your first day - no waiting period)Paid Holidays401(k)Company DiscountsCollaborative work environment - we want our employees to have a say in how we run our officeEmployee Recognition - we encourage employee recognition through our GEMS program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975416658"}