{"jobTitle": "General Manager (Venice)", "company": {"name": "Whalar", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$110,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Job Title:</strong> General Manager<br/><br/><strong>Location: </strong>Venice Beach, CA<br/><br/><strong>Company: </strong>The Lighthouse, a division of Whalar Group<br/><br/>The Lighthouse is an innovative Campus for Creators and their teams, with locations in Venice, CA, and Brooklyn, NY. Our mission is to serve as hubs for creators to learn, make, and belong. We believe in the power of the collective to spark creativity and unlock infinite possibilities. By bringing together original minds and bold spirits, we aim to provoke the next act of the creator economy and support the growth and sustainability of creators' careers.<br/><br/><strong>About the role:<br/><br/></strong>As the General Manager of The Lighthouse, you will play a pivotal role in bringing to life the ethos, vision, and mission of our dedicated Campus for Creators. The Lighthouse is a groundbreaking space designed to foster learning, creativity, collaboration, and a sense of belonging for content creators and their teams. We are seeking a dynamic and visionary leader to oversee the operations, growth, and overall success of The Lighthouse, its members, and our teams.<br/><br/><strong>Here's what you'll do on the day-to-day:<br/><br/></strong><ul><li>Oversee day-to-day operations, ensuring a seamless and vibrant environment for creators and their teams.</li><li>Develop and execute a strategic plan aligned with The Lighthouse's vision and mission.</li><li>Drive initiatives that contribute to the cultural and creative development of content creators within the Campus.</li><li>Manage wages and payroll, ensuring compliance with California labor laws and workplace regulations.</li><li>Foster a sense of belonging and community among members by organizing and promoting cultural-social events.</li><li>Implement programs and initiatives that enhance collaboration and knowledge-sharing among creators.</li><li>Continuously assess and enhance the membership experience based on feedback and industry trends.</li><li>Attend quarterly membership council meetings.</li><li>Ensure membership budgets and targets are being hit.</li><li>Oversee the implementation of learning and career development programs for Lighthouse Team leadership and management training.</li><li>Develop training programs for hourly employees to support their career development and advancement opportunities within The Lighthouse and beyond.</li><li>Develop and maintain annual budgets, including departmental budgets for studios, cafe, reception, stewarding, contract maintenance, contracted security, contracted overnight cleaners, etc., ensuring financial sustainability and growth.</li><li>Explore revenue-generating opportunities while maintaining alignment with the organization's mission.</li><li>Manage event budgets and forecasted monthly/annual revenue </li><li>Ensure brand events align with The Lighthouse's mission and provide value to the community.</li><li>Foster a positive and inclusive workplace culture that reflects The Lighthouse's values.</li><li>Address employee concerns, conduct performance reviews, and implement HR policies in compliance with applicable laws.</li><li>Manage the day-to-day operations of the production studios, ensuring optimal functionality.<br/><br/></li></ul><strong>Here's what we're looking for:<br/><br/></strong><ul><li>Proven leadership experience in a similar role with at least 5-7 years of experience, preferably in the hospitality, operations, creative, production or educational space.</li><li>A strong understanding of California labor laws and workplace regulations. This includes but is not limited to wage and hour laws, leave policies, workplace safety standards, and other relevant statutes.</li><li>Inspirational leader who understands the importance of leadership versus management.</li><li>Strong understanding of the Creator Economy and the needs of content creators.</li><li>Excellent organizational, communication, and interpersonal skills.</li><li>Ability to think strategically and drive results in a dynamic environment.</li><li>Passion for fostering creativity, learning, and community.</li><li>Be a great person.<br/><br/></li></ul><em>The salary range for this role is $110,000 - $150,000 and serves as a general guideline reflecting the potential compensation for the role. The final salary offer will be determined based on a comprehensive evaluation of factors such as the candidate's experience, expertise, alignment with the position's requirements, and ultimately budget approvals.<br/><br/></em><strong>Our values:<br/><br/></strong>At The Lighthouse, diversity, equity, and inclusion (DEI) isn't just a statement, it's our collective strength. Our people are our superpower. We champion a culture of respect and empathy, fostering a sense of belonging that transcends demographics. We hire individuals of all backgrounds and empower them to thrive, challenge stereotypes, and actively break societal barriers.<br/><br/>The Lighthouse is a vibrant and inclusive work environment with a focus on collaboration and innovation.Opportunities for professional development and career advancement.Competitive salary and benefits package.The chance to be a part of a forward-thinking company at the forefront of the Creator Economy. An environment where your distinctive voice contributes to a collective force, embodying the spirit of creativity and growth.<br/><br/><em>Whalar Group provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Equal opportunity extends to all aspects of the employment relationship, including hiring, promotions, training, working conditions, compensation, and benefits.</em>", "responsibilities": "Oversee day-to-day operations, ensuring a seamless and vibrant environment for creators and their teams. Develop and execute a strategic plan aligned with The Lighthouse's vision and mission. Drive initiatives that contribute to the cultural and creative development of content creators within the Campus. Manage wages and payroll, ensuring compliance with California labor laws and workplace regulations. Foster a sense of belonging and community among members by organizing and promoting cultural-social events. Implement programs and initiatives that enhance collaboration and knowledge-sharing among creators. Continuously assess and enhance the membership experience based on feedback and industry trends. Attend quarterly membership council meetings. Ensure membership budgets and targets are being hit. Oversee the implementation of learning and career development programs for Lighthouse Team leadership and management training. Develop training programs for hourly employees to support their career development and advancement opportunities within The Lighthouse and beyond. Develop and maintain annual budgets, including departmental budgets for studios, cafe, reception, stewarding, contract maintenance, contracted security, contracted overnight cleaners, etc., ensuring financial sustainability and growth. Explore revenue-generating opportunities while maintaining alignment with the organization's mission. Manage event budgets and forecasted monthly/annual revenue Ensure brand events align with The Lighthouse's mission and provide value to the community. Foster a positive and inclusive workplace culture that reflects The Lighthouse's values. Address employee concerns, conduct performance reviews, and implement HR policies in compliance with applicable laws. Manage the day-to-day operations of the production studios, ensuring optimal functionality.", "qualifications": {"required": "Proven leadership experience in a similar role with at least 5-7 years of experience, preferably in the hospitality, operations, creative, production or educational space. A strong understanding of California labor laws and workplace regulations. This includes but is not limited to wage and hour laws, leave policies, workplace safety standards, and other relevant statutes. Inspirational leader who understands the importance of leadership versus management. Strong understanding of the Creator Economy and the needs of content creators. Excellent organizational, communication, and interpersonal skills. Ability to think strategically and drive results in a dynamic environment. Passion for fostering creativity, learning, and community. Be a great person.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "The Lighthouse is a vibrant and inclusive work environment with a focus on collaboration and innovation.Opportunities for professional development and career advancement.Competitive salary and benefits package.The chance to be a part of a forward-thinking company at the forefront of the Creator Economy. An environment where your distinctive voice contributes to a collective force, embodying the spirit of creativity and growth.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3976899187"}