{"jobTitle": "Business Operations Manager [HYBRID]", "company": {"name": "Southern California Edison (SCE)", "industry": "Oil and Gas and Utilities", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "130,600.00/yr - 195,800.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Oil and Gas and Utilities", "description": "<strong>Job Description<br/><br/></strong><strong>Join the Clean Energy Revolution<br/><br/></strong>Become a <strong>Business Operations Manager</strong> at Southern California Edison (SCE) and build a better tomorrow. In this job you’ll lead a team of business operations analysts supporting the Environmental Department. You and your team will be responsible for developing and tracking the Department budget, provide regular budget analysis and trending to track spend throughout the year, provide central support and tracking of Department purchase order activity, lead the development of the Departments General Rate Case testimony, over see the development of the Department strategic plan and assume other tasks necessary to provide central business operations support to the Environmental Department.<br/><br/>As a <strong>Manager</strong>, your work will help power our planet, reduce carbon emissions and build cleaner air for everyone. Are you ready to take on the challenge to help us build the future?<br/><br/><strong>A day in the life - Get ready to think big, work smart and shine bright!<br/><br/></strong><ul><li>Manages staff specialized in business operations, align organization with overall department strategy and organizational unit objectives. Includes evaluating employee performance, making hiring decisions, and coaching.</li><li>Provides strategic leadership to staff for department operations such as goals, budget, and purchase order management.</li><li>Provides strategic direction and oversight in the creation of the Department General Rate Case.</li><li>Develops the Department strategic plan, and leads the development of department operating plans including budget and goals.</li><li>Leads special projects as assigned by Department leadership.<br/><br/></li></ul><strong>The Essentials<br/><br/></strong><ul><li>Five or more years combined experience performing or supervising business operations, data analytics and or budgets.<br/><br/></li></ul><strong>The Preferred<br/><br/></strong><ul><li>Bachelor's degree in business, or environmental technical field or equivalent combination of education, training, or experience.</li><li>Experience in strategizing and writing testimony for the General Rate Case and/or other technical writing related to policies and standards.</li><li>Experience with reporting for financial and purchase order activities.</li><li>Excellent written communication skills to support rate case development.<br/><br/></li></ul><strong>You should know <br/><br/></strong><ul><li>This position’s work mode is hybrid. The employee will report to an SCE facility for a set number of days with the option to work remotely on the remaining days. Unless otherwise noted, employees are required to reside in the state of California. Further details of this work mode will be discussed at the interview stage. The work mode can be changed based on business needs.</li><li>Visit our Candidate Resource page to get meaningful information related to benefits, perks, resources, testing information, hiring process, and more!</li><li>Relocation does not apply to this position.<br/><br/></li></ul><strong>About Southern California Edison<br/><br/></strong>The people at SCE don't just keep the lights on. Our mission is so much bigger. We’re fueling the kind of innovation that’s changing an entire industry, and quite possibly the planet. Join us and create a future with cleaner energy, while providing our customers with the safety and reliability they demand. At SCE, you’ll have a chance to grow personally and professionally, making a real impact in Southern California and around the world.<br/><br/>At SCE, we celebrate our differences. We are a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status.<br/><br/>We are committed to ensuring that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodations at (833) 343-0727.", "responsibilities": "<ul><li>Manages staff specialized in business operations, align organization with overall department strategy and organizational unit objectives. Includes evaluating employee performance, making hiring decisions, and coaching.</li><li>Provides strategic leadership to staff for department operations such as goals, budget, and purchase order management.</li><li>Provides strategic direction and oversight in the creation of the Department General Rate Case.</li><li>Develops the Department strategic plan, and leads the development of department operating plans including budget and goals.</li><li>Leads special projects as assigned by Department leadership.<br/><br/></li></ul>", "qualifications": {"required": "Five or more years combined experience performing or supervising business operations, data analytics and or budgets.", "preferred": "Bachelor's degree in business, or environmental technical field or equivalent combination of education, training, or experience.\nExperience in strategizing and writing testimony for the General Rate Case and/or other technical writing related to policies and standards.\nExperience with reporting for financial and purchase order activities.\nExcellent written communication skills to support rate case development."}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976476833"}