{"jobTitle": "Growth Marketing Manager", "company": {"name": "Calm", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Wellness and Fitness Services", "description": "About Calm\n\nCalm is on a mission to support everyone on every step of their mental health journey. With the #1 app for sleep, meditation and relaxation as well as a growing library of digital, evidence-based mental health programs, Calm offers trusted support for individuals and organizations alike. Our flagship consumer app provides personalized content and activities – featuring a range of experts and beloved celebrity voices – to help users manage stress, improve sleep and live mindfully. Our workplace and healthcare solutions offer a consumer-friendly approach to clinical content and HIPAA-compliant resources in order to drive positive health and business outcomes. Named a TIME100 Most Influential Company, Calm supports more than 150 million people and 3,500 organizations across seven languages and 190 countries.\n\nWhat We Do\n\nThe User Acquisition team is at the forefront of Calm’s mission, captivating people worldwide, and helping them to take their first steps toward more sleep and less stress. With over 100 million users worldwide, 100,000 new users daily, and our growing partnerships with major companies, we’re having a positive effect on more and more people each and every day. And while the heart of Calm is digital, we are growing and expanding offline with a variety of products and services to help deliver on our mission of health and happiness, the world over.\n\nWe are hiring remote workers for this role in the San Francisco Bay Area, Los Angeles, or NYC areas. At this time, only candidates in these locations will be considered.\n\nWhat You’ll Do\n\nThe Growth Marketing Manager will fuel Calm’s growth engine and help solve the mental health crisis by working across a variety of paid marketing channels but with a primary focus on leading our affiliate marketing initiatives. You are a self-driven generalist who can act both strategically and tactically, with a strong track record of driving measurable impact via performance marketing channels for a DTC business. You have strong analytical skills, experienced in diving deep into data to find meaningful trends and insights that drive optimization decisions. You have direct experience in campaign management and optimization, and are skilled in managing external agencies to drive performance outcomes. You’re both technical and creative, and will be a strong partner to internal media buyers, marketing ops, creative, brand marketing, and data teams to consistently evolve and improve our affiliate marketing strategy. In this role you will:\n\n<ul>\n<li>Develop and implement comprehensive affiliate marketing strategies to drive revenue growth</li>\n<li>Identify, recruit, and manage new affiliate partners to expand our network</li>\n<li>Optimize existing affiliate relationships to maximize performance and ROI</li>\n<li>Manage vendor relationships in support of the affiliate program</li>\n<li>Monitor and analyze affiliate performance metrics to ensure targets are met or exceeded</li>\n<li>Negotiate contracts and commission structures with affiliate partners to ensure favorable terms</li>\n<li>Stay current with industry trends, competitive landscape, and emerging technologies to maintain a cutting-edge affiliate program</li>\n<li>Provide regular reports and insights to senior management on affiliate program performance and growth opportunities</li>\n<li>Dive deep into data to find meaningful trends and insights, which fuel new opportunities and drive optimization decisions</li>\n<li>Collaborate with internal team members to align affiliate marketing efforts with broader marketing and business objectives</li>\n<li>Partner with established paid marketing channel owners to test strategies and optimize campaigns in order to maximize efficiency, jumping in to actively manage campaigns as needed<br/><br/></li>\n</ul>\nWho You Are\n\n<ul>\n<li>Skilled performance marketer with deep expertise in optimizing paid marketing campaigns to ROI goals</li>\n<li>Proven track record of successfully managing and growing affiliate programs or other paid channels, with experience operating as a sole owner of a channel to drive business outcomes</li>\n<li>Strong analytical skills with the ability to interpret data and generate actionable insights</li>\n<li>Excellent communication, negotiation, and relationship management skills</li>\n<li>Proficiency in affiliate tracking platforms and digital marketing tools</li>\n<li>Self sufficient and comfortable building new approaches </li>\n<li>Highly organized with strong attention to detail<br/><br/></li>\n</ul>\nNice to Haves\n\n<ul>\n<li>Experience managing Meta, ASA, SEM, and/or offline performance marketing campaigns</li>\n<li>Experience managing performance marketing campaigns for apps and/or subscription businesses<br/><br/></li>\n</ul>\nMinimum Requirements\n\n<ul>\n<li>5+ years of experience in partner or affiliate management, including experience with affiliate networks, platforms, and agencies<br/><br/></li>\n</ul>\nThe anticipated salary range for this position is $120,500 - $168,700. The base salary range represents the low and high end of Calm’s salary range for this position. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which may include the successful candidate's geographic location, skills, experience and other qualifications. This role is also eligible for equity + comprehensive benefits + 401k + flexible time off.\n\nPlease note that Calm may leverage artificial intelligence technology in the application review process.\n\nCalm is committed to providing reasonable accommodations for qualified individuals with disabilities, including disabled veterans. Please contact Calm’s Recruiting team if you need a reasonable accommodation, assistance completing any forms, or to otherwise participate in the application process. You can reach the Recruiting team at recruitingaccommodations@calm.com\n\nWe believe that mental health is health, and every person should be considered in the discussion. That’s why we’re proud to be an equal opportunity workplace, committed to providing equal employment opportunities to all applicants and employees regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, medical condition, genetic information, military or veteran status, gender identity or expression, sexual orientation, or any other characteristic protected by applicable federal, state or local law.\n\nCalm is deeply committed to diversity, equity and inclusion. We strive to create a mindful and respectful environment where everyone can bring their authentic self to work, and experience a culture that is free of harassment, racism, and discrimination.\n\nEmployment offers are contingent upon the successful completion of a background check. Roles which require access to certain types of information may also require the successful completion of a drug screening.\n\nCalm participates in e-verify. E-verify provides the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.\n\n<ul>\n<li>Right to Work</li>\n<li>E-Verify Participation<br/><br/></li>\n</ul>", "responsibilities": "The Growth Marketing Manager will fuel Calm’s growth engine and help solve the mental health crisis by working across a variety of paid marketing channels but with a primary focus on leading our affiliate marketing initiatives. You are a self-driven generalist who can act both strategically and tactically, with a strong track record of driving measurable impact via performance marketing channels for a DTC business. You have strong analytical skills, experienced in diving deep into data to find meaningful trends and insights that drive optimization decisions. You have direct experience in campaign management and optimization, and are skilled in managing external agencies to drive performance outcomes. You’re both technical and creative, and will be a strong partner to internal media buyers, marketing ops, creative, brand marketing, and data teams to consistently evolve and improve our affiliate marketing strategy. In this role you will:\n\n<ul>\n<li>Develop and implement comprehensive affiliate marketing strategies to drive revenue growth</li>\n<li>Identify, recruit, and manage new affiliate partners to expand our network</li>\n<li>Optimize existing affiliate relationships to maximize performance and ROI</li>\n<li>Manage vendor relationships in support of the affiliate program</li>\n<li>Monitor and analyze affiliate performance metrics to ensure targets are met or exceeded</li>\n<li>Negotiate contracts and commission structures with affiliate partners to ensure favorable terms</li>\n<li>Stay current with industry trends, competitive landscape, and emerging technologies to maintain a cutting-edge affiliate program</li>\n<li>Provide regular reports and insights to senior management on affiliate program performance and growth opportunities</li>\n<li>Dive deep into data to find meaningful trends and insights, which fuel new opportunities and drive optimization decisions</li>\n<li>Collaborate with internal team members to align affiliate marketing efforts with broader marketing and business objectives</li>\n<li>Partner with established paid marketing channel owners to test strategies and optimize campaigns in order to maximize efficiency, jumping in to actively manage campaigns as needed<br/><br/></li>\n</ul>", "qualifications": {"required": "Skilled performance marketer with deep expertise in optimizing paid marketing campaigns to ROI goals\nProven track record of successfully managing and growing affiliate programs or other paid channels, with experience operating as a sole owner of a channel to drive business outcomes\nStrong analytical skills with the ability to interpret data and generate actionable insights\nExcellent communication, negotiation, and relationship management skills\nProficiency in affiliate tracking platforms and digital marketing tools\nSelf sufficient and comfortable building new approaches \nHighly organized with strong attention to detail<br/><br/>", "preferred": "Experience managing Meta, ASA, SEM, and/or offline performance marketing campaigns\nExperience managing performance marketing campaigns for apps and/or subscription businesses<br/><br/>"}, "skills": ["Performance Marketing", "Affiliate Marketing", "Paid Media", "Digital Marketing", "Data Analysis", "Campaign Management", "ROI Optimization", "Affiliate Networks", "Affiliate Platforms", "Affiliate Agencies", "Vendor Management", "Negotiation", "Relationship Management", "Communication", "Analytical Skills", "Strategic Thinking", "Tactical Execution", "DTC", "App Marketing", "Subscription Business", "Meta", "ASA", "SEM", "Offline Marketing"], "postedDate": "2 weeks ago", "benefits": "The anticipated salary range for this position is $120,500 - $168,700. The base salary range represents the low and high end of Calm’s salary range for this position. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which may include the successful candidate's geographic location, skills, experience and other qualifications. This role is also eligible for equity + comprehensive benefits + 401k + flexible time off.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3976477785"}