{"jobTitle": "Event Sales Coordinator", "company": {"name": "NeueHouse", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "24 - 26", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "NeueHouse is a work and social club where creatives and thought-leaders gather and connect. Our community of members aligns in their ambition to live a creative life, supported by an elevated experience bringing work and social together through iconic buildings, timeless design, thought-provoking cultural programming, and gracious hospitality. _NeueHouse: Home of the New._\n\nOur Properties\n\nNeueHouse currently operates across three different, but equally iconic properties in New York City and Los Angeles:\n\n<ul><li>Our Madison Square (MSQ) House is situated in New York's iconic Flatiron District, was previously home for Tepper Galleries, a well-known Manhattan auction house for international artists and collectors in the 1930s - and neighbors the 69th Regiment Armory where the first International Exhibition of Modern Art was held</li><li>Our Hollywood House (HWD), which sits on Sunset Boulevard, is one of LA's most celebrated buildings and occupies the original CBS Studio (the world's first structure built intentionally for broadcast). Here genre-defining artists from Orson Wells and Lucille Ball to Janis Joplin, the Beach Boys, and Bob Dylan built their legacy</li><li>Our Venice Beach House (VB) was once the creative home to some of the most influential creative luminaries in art and entertainment including Hal Ashby, Oliver Stone, and David Hockney, NeueHouse Venice Beach is a new work, social, and cultural hub for the Venice creative community<br/><br/><br/></li></ul>The Role\n\nIn collaboration with Executive Director of Events and Event Sales Manager, the Event Sales Coordinator will assist in the coordination of prospecting and sales for private hire events within their individual market segments. Specific emphasis will be placed on the administrative support in developing and maintaining key business relationships with event clients, sponsors & partners while learning the necessary functions to properly manage private events.\n\nRequirements\n\nThe role requires someone who is ready to: \n\n<ul><li>2-3 years as a coordinator in a sales-focused environment assisting with the sale + acquisition of leads. </li><li>The Sales Coordinator will assist the Event Sales team with solicitation and scheduling of offsite inspections and lunches as well as assist with onsite inspections and tours. With a reputation for an innate understanding of high-touch customer service - you are the consummate host for prospective Clients and no detail in providing for these, our guests or our teams go unnoticed. </li><li>The role will likewise demand the coordinator to be consistent and creative in researching, identifying, and targeting the relevant prospective client base for NeueHouse</li><li>NeueHouse uses Salesforce to track and measure the progress of our sales over time, and while experience with the system isn't necessary, you demonstrate a passion to drive sales across a multi-million-dollar, multi-unit business with several different revenue streams. </li><li>Assist with sales and marketing budget, travel and trade show budgets along with administrative duties in support of Event Sales dept. (ie contracts). </li><li>Assist with compiling reports and distributing Weekly Sales reports to the Event Sales team</li><li>Any other duties assigned by the Event Sales team. </li><li>Comfortable conversing with clients, members, guests, and potential members regarding NeueHouse events and our various programs, pricing structure, and amenities.  </li><li>Must always be a positive and articulate ambassador of the NeueHouse project/brand.  </li><li>Prepare presentations, pitches, and proposals for private hire event clients.  </li><li>Manage client entertaining efforts and initiatives.  </li><li>Conduct walk-throughs & tours for event opportunities.  </li><li>We envision a coordinator who is high-energy, a self-starter (we are a small team where everyone plays high and low) and adaptable. You should be excited by the opportunity to wear more than just one hat: marketing, lead generation and qualification, assisting with driving and closing sales, brand knowledge, partnerships, and more will organically be woven into the role</li><li>Strong emphasis was placed on the communication of event information to relevant parties including, but not limited to, the Chefs, Event Operations Director, General Manager, Head of Security, and Tech Manager.  </li><li>Responsible for making sure deposits and balances get to run and tracking events sales.  </li><li>Support Event Sales Managers & Directors with client event details. </li><li>Support sales goals by booking Meeting Rooms + event calendar management </li><li>Support Managers' & Directors' sales targets and goals by driving additional revenue</li><li>NeueHouse is open to a variety of educational backgrounds and training in support of the Event Sales Coordinator role. <br/><br/></li></ul>The anticipated hourly rate for this position is $24 - $26 per hour. NeueHouse is committed to equitable and competitive compensation and benefits packages for our team members and will consider many factors when extending offers of employment. Some of the factors we consider may include: qualifications of individual applicants against the position and business needs, years of relevant experience in role or industry, specific or unique skills, certifications or professional accreditations specific to the role, and the location in which the applicant lives and/or from which they will perform the role. The anticipated range for compensation shared here does not include any other components or benefits that may available.\n\nDiversity & Representation: NeueHouse is committed to building and supporting inclusive and representative communities, long-term career opportunities and extends Equal Employment Opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law.\n\nBenefits\n\n<ul><li>Salary is $24 - $26 an hour</li><li>Health Care Plan (Medical, Dental & Vision)</li><li>Retirement Plan (401k, IRA)</li><li>Life Insurance (Basic, Voluntary & AD&D)</li><li>Paid Time Off (Vacation, Sick & Public Holidays)</li><li>Paid Family + Caregiver Leave</li><li>Short Term & Long Term Disability</li><li>Training & Development</li><li>Wellness Resources</li></ul>", "responsibilities": "In collaboration with Executive Director of Events and Event Sales Manager, the Event Sales Coordinator will assist in the coordination of prospecting and sales for private hire events within their individual market segments. Specific emphasis will be placed on the administrative support in developing and maintaining key business relationships with event clients, sponsors & partners while learning the necessary functions to properly manage private events.", "qualifications": {"required": "2-3 years as a coordinator in a sales-focused environment assisting with the sale + acquisition of leads. The Sales Coordinator will assist the Event Sales team with solicitation and scheduling of offsite inspections and lunches as well as assist with onsite inspections and tours. With a reputation for an innate understanding of high-touch customer service - you are the consummate host for prospective Clients and no detail in providing for these, our guests or our teams go unnoticed. The role will likewise demand the coordinator to be consistent and creative in researching, identifying, and targeting the relevant prospective client base for NeueHouse NeueHouse uses Salesforce to track and measure the progress of our sales over time, and while experience with the system isn't necessary, you demonstrate a passion to drive sales across a multi-million-dollar, multi-unit business with several different revenue streams. Assist with sales and marketing budget, travel and trade show budgets along with administrative duties in support of Event Sales dept. (ie contracts). Assist with compiling reports and distributing Weekly Sales reports to the Event Sales team Any other duties assigned by the Event Sales team. Comfortable conversing with clients, members, guests, and potential members regarding NeueHouse events and our various programs, pricing structure, and amenities.  Must always be a positive and articulate ambassador of the NeueHouse project/brand.  Prepare presentations, pitches, and proposals for private hire event clients.  Manage client entertaining efforts and initiatives.  Conduct walk-throughs & tours for event opportunities.  We envision a coordinator who is high-energy, a self-starter (we are a small team where everyone plays high and low) and adaptable. You should be excited by the opportunity to wear more than just one hat: marketing, lead generation and qualification, assisting with driving and closing sales, brand knowledge, partnerships, and more will organically be woven into the role Strong emphasis was placed on the communication of event information to relevant parties including, but not limited to, the Chefs, Event Operations Director, General Manager, Head of Security, and Tech Manager.  Responsible for making sure deposits and balances get to run and tracking events sales.  Support Event Sales Managers & Directors with client event details. Support sales goals by booking Meeting Rooms + event calendar management Support Managers' & Directors' sales targets and goals by driving additional revenue NeueHouse is open to a variety of educational backgrounds and training in support of the Event Sales Coordinator role.", "preferred": ""}, "skills": ["Sales", "Customer Service", "Event Management", "Salesforce", "Budgeting", "Reporting", "Communication", "Presentation Skills", "Proposal Writing", "Client Management", "Teamwork", "Adaptability"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Salary is $24 - $26 an hour Health Care Plan (Medical, Dental & Vision) Retirement Plan (401k, IRA) Life Insurance (Basic, Voluntary & AD&D) Paid Time Off (Vacation, Sick & Public Holidays) Paid Family + Caregiver Leave Short Term & Long Term Disability Training & Development Wellness Resources", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976452264"}