{"jobTitle": "Planning Manager", "company": {"name": "Ecolab", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$102,900.00/yr - $154,300.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Chemical Manufacturing", "description": "Our Global Supply Chain is a network of more than 300 manufacturing plants, distribution centers and other facilities designed and located to support our direct sales, marketing and distribution activities. We enable company growth by delivering savings through more efficient operations and high levels of service that create competitive advantage while earning and keeping customers' trust.<br/><br/>We are seeking a Planning Manager to be responsible for a larger and/or more complex organization. As the Planning Manager, you will drive improvement of supply assumptions, exception management and root cause analysis to identify deviations and issues for the long-term planning. You will act as a strategic partner, skilled in change management and highly proficient in influencing across a wide network of both internal and external stakeholders. You may manage a team of individuals with varying levels of experience.<br/><br/><strong>What’s In It For You<br/><br/></strong><ul><li>Opportunity for a long-term career path that allows for exposure into all areas of Ecolab’s supply chain</li><li>Access to best-in-class resources, tools, and technology</li><li>Thrive in a company that values sustainability, drives a safety-focused culture and has been recognized as one of the most ethical companies in the world<br/><br/></li></ul><strong>What You Will Do<br/><br/></strong><ul><li>May directly manage and/or coach a Supply/Demand/Material Planning team focused on longer-term planning</li><li>May have accountability for multiple sites or planning activities and/or a single region</li><li>Provide advanced input to the creation of a strategic roadmap and be responsible for being a change agent</li><li>Identify and implement best practices to improve results for identified reporting metrics. Work with appropriate groups to improve inputs to the process and ongoing continuous improvement</li><li>Drive improvement of supply assumptions, exception management and root cause analysis to identify deviations and issues for long-term planning</li><li>Foster a collaborative, inclusive and motivational team environment</li><li>Work alongside team members to create individual development plans</li><li>Other areas of responsibility could include, but are not limited to, one or more of the following:</li><ul><li>High level sourcing decisions &amp; manufacturing plans</li><li>Driving improvement of supply assumptions </li><li>Root-cause analysis for deviations in long-term planning processes </li><li>Cross-functional collaboration </li><li>Team &amp; Talent development</li><li>Order level service <br/></li></ul></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree</li><li>6 years of Planning, Logistics, Manufacturing experience </li><li>1 year experience leading others</li><li>Proficiency with an ERP, advanced planning system, analytical system or equivalent</li><li>Strong leadership, communication, analytical, and problem-solving skills to drive decisions and build consensus among stakeholders</li><li>No immigration sponsorship available for this position<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree in Business, Supply Chain Management, Engineering or related field of study</li><li>Advanced technical or business degree, MBA preferred</li><li>Ability to create, clearly articulate and execute on a strategic vision</li><li>Strong business acumen and experience collaborating with Operations, Marketing and Customers</li><li>Skilled in resolving conflict situations effectively</li><li>Experience in operational excellence and project management such as TPM, Lean Six Sigma, continuous improvement, Green Belt, etc.</li><li>APICS Certification</li><li>Direct people management experience<br/><br/></li></ul><strong>Annual Or Hourly Compensation Range<br/><br/></strong>Base salary range is $102900 – $154300. This position has base salary and is eligible to participate in a discretionary bonus plan as a % of eligible pay, per plan terms.<br/><br/>Annual or Hourly Compensation Range is based on full-time 40 hours per week. Ecolab in good faith anticipates it will pay within the posted range. Many factors are taken into consideration when determining the compensation for a potential new employee such as education, training, experience, work location, travel (if required), etc.<br/><br/><strong>Benefits<br/><br/></strong>Ecolab strives to provide comprehensive and market-competitive benefits to meet the needs of our associates and their families. Ecolab has the following US benefit offerings: Medical/Prescription Coverage, Health Savings Account, Wellness Program, Dental, Vison, Flexible Spending Accounts (Health Care, Limited Purpose Health Care, Dependent Care), Employee Assistance Program, Life Insurance Plans (Basic Life, Optional Employee Life, Spouse Domestic Partner Life, Dependent Child(ren) Life, Accidental Death and Dismemberment Insurance, Business and Travel Insurance), Disability (Short-Term, Long-Term and Optional Long-Term), 401k Savings Plan, Pension Plan, Retirement Health Care Benefits, Employee Stock Purchase Plan (Full-Time Associates), Long-Term Incentives (Executive Level), Short-Term Incentives, Group Legal Services, Education Assistance Program, Time Off (Vacation, Holiday, Jury Duty and Bereavement leave), Parental Leave (Medical/Short-Term Disability and Paid Parental Leave), Adoption Assistance, Discount on Day Care Services, Caregiver Services and Voluntary Benefits (Accident Insurance, Critical Illness Insurance, Hospital Indemnity Insurance, Auto and Homeowners Insurance, Pet Insurance, Identity Theft Protection and Employee Discount Program). On-Site childcare and fitness facilities may be available at select Ecolab locations. Click here for additional benefits information. <br/><br/><em>If you are viewing this posting on a site other than our Ecolab Career website, view our benefits at jobs.ecolab.com/working-here.<br/><br/></em><strong>Covid-19 Vaccine Notice<br/><br/></strong>Due to local mandates and customer requirements, applicants for certain customer-facing positions must be fully vaccinated (which in some situations requires a booster if eligible), unless a religious or medical accommodation is requested by the applicant and approved by Ecolab.<br/><br/><strong>Americans With Disabilities Act (ADA)<br/><br/></strong>Ecolab will provide reasonable accommodation (such as a qualified sign language interpreter or other personal assistance) with our application process upon request as required to comply with applicable laws. If you have a disability and require accommodation assistance in this application process, please visit the Recruiting Support link in the footer of each page of our career website.<br/><br/><strong>Our Commitment to Diversity and Inclusion<br/><br/></strong>At Ecolab, we believe the best teams are diverse and inclusive, and we are on a journey to create a workplace where every associate can grow and achieve their best. We are committed to fair and equal treatment of associates and applicants. We recruit, hire, promote, transfer and provide opportunities for advancement on the basis of individual qualifications and job performance. In all matters affecting employment, compensation, benefits, working conditions, and opportunities for advancement, we will not discriminate against any associate or applicant for employment because of race, religion, color, creed, national origin, citizenship status, sex, sexual orientation, gender identity and expressions, genetic information, marital status, age, disability, or status as a covered veteran.<br/><br/>In addition, we are committed to furthering the principles of Equal Employment Opportunity (EEO) through Affirmative Action (AA). Our goal is to fully utilize minority, female, disabled and covered veteran individuals at all levels of the workforce. Ecolab is a place where you can grow your career, own your future and impact what matters.<br/><br/>We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York City Fair Chance Act.", "responsibilities": "May directly manage and/or coach a Supply/Demand/Material Planning team focused on longer-term planning\nMay have accountability for multiple sites or planning activities and/or a single region\nProvide advanced input to the creation of a strategic roadmap and be responsible for being a change agent\nIdentify and implement best practices to improve results for identified reporting metrics. Work with appropriate groups to improve inputs to the process and ongoing continuous improvement\nDrive improvement of supply assumptions, exception management and root cause analysis to identify deviations and issues for long-term planning\nFoster a collaborative, inclusive and motivational team environment\nWork alongside team members to create individual development plans\nOther areas of responsibility could include, but are not limited to, one or more of the following:\nHigh level sourcing decisions &amp; manufacturing plans\nDriving improvement of supply assumptions \nRoot-cause analysis for deviations in long-term planning processes \nCross-functional collaboration \nTeam &amp; Talent development\nOrder level service", "qualifications": {"required": "Bachelor’s Degree\n6 years of Planning, Logistics, Manufacturing experience \n1 year experience leading others\nProficiency with an ERP, advanced planning system, analytical system or equivalent\nStrong leadership, communication, analytical, and problem-solving skills to drive decisions and build consensus among stakeholders\nNo immigration sponsorship available for this position", "preferred": "Bachelor’s Degree in Business, Supply Chain Management, Engineering or related field of study\nAdvanced technical or business degree, MBA preferred\nAbility to create, clearly articulate and execute on a strategic vision\nStrong business acumen and experience collaborating with Operations, Marketing and Customers\nSkilled in resolving conflict situations effectively\nExperience in operational excellence and project management such as TPM, Lean Six Sigma, continuous improvement, Green Belt, etc.\nAPICS Certification\nDirect people management experience"}, "skills": ["Supply Chain", "Planning", "Logistics", "Manufacturing", "ERP", "Leadership", "Communication", "Analytical", "Problem Solving", "Change Management", "Business Acumen", "Operational Excellence", "Project Management", "TPM", "Lean Six Sigma", "Continuous Improvement", "Green Belt", "APICS Certification"], "postedDate": "2 weeks ago", "benefits": "Ecolab strives to provide comprehensive and market-competitive benefits to meet the needs of our associates and their families. Ecolab has the following US benefit offerings: Medical/Prescription Coverage, Health Savings Account, Wellness Program, Dental, Vison, Flexible Spending Accounts (Health Care, Limited Purpose Health Care, Dependent Care), Employee Assistance Program, Life Insurance Plans (Basic Life, Optional Employee Life, Spouse Domestic Partner Life, Dependent Child(ren) Life, Accidental Death and Dismemberment Insurance, Business and Travel Insurance), Disability (Short-Term, Long-Term and Optional Long-Term), 401k Savings Plan, Pension Plan, Retirement Health Care Benefits, Employee Stock Purchase Plan (Full-Time Associates), Long-Term Incentives (Executive Level), Short-Term Incentives, Group Legal Services, Education Assistance Program, Time Off (Vacation, Holiday, Jury Duty and Bereavement leave), Parental Leave (Medical/Short-Term Disability and Paid Parental Leave), Adoption Assistance, Discount on Day Care Services, Caregiver Services and Voluntary Benefits (Accident Insurance, Critical Illness Insurance, Hospital Indemnity Insurance, Auto and Homeowners Insurance, Pet Insurance, Identity Theft Protection and Employee Discount Program). On-Site childcare and fitness facilities may be available at select Ecolab locations. Click here for additional benefits information. <br/><br/><em>If you are viewing this posting on a site other than our Ecolab Career website, view our benefits at jobs.ecolab.com/working-here.</em>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976928941"}