{"jobTitle": "Distribution Analyst", "company": {"name": "Liquid I.V.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$72,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "About Liquid I.V.\n\nLiquid I.V. is a functional hydration company based in Los Angeles, CA. Acquired by Unilever in 2020, Liquid I.V. is the #1 powdered hydration brand in America, delivering superior hydration than water alone. Liquid I.V. utilizes LIV HYDRASCIENCE™, a science-backed formula designed with an optimized ratio of electrolytes, essential vitamins, and clinically tested nutrients to turn ordinary water into extraordinary hydration.\n\nLiquid I.V.’s great-tasting flavors contain 3x more electrolytes than the leading sports drink, have 5 essential nutrients and vitamins, and are vegan, gluten-free, non-GMO.\n\nLiquid I.V. believes a healthier world for all begins with equitable access to clean and abundant water. The brand partners with leading water, humanitarian, and community-based organizations to advance innovative solutions and help communities both expand and protect their clean water access. To-date, Liquid I.V. has donated over 54 million servings to people around the globe and has committed to donating a total of 150 million servings by 2032. Over 1% of the company’s revenue goes directly to its impact program.\n\nLiquid I.V. is available online and in-store at over 40,000 retailer doors across the United States. Liquid I.V.’s product offerings include Hydration Multiplier ® and the brand’s most innovative launch to date, Hydration Multiplier® Sugar-Free. Additional product offerings include: Hydration Multiplier® + Energy, Hydration Multiplier® + Immune Support, Hydration Multiplier® + Kids, Hydration Multiplier® + Gut Health, and Hydration Multiplier® + Sleep.\n\nTo learn more, visit www.liquid-iv.com and follow @liquidiv on Instagram, TikTok, Facebook, and X.\n\nAbout the role: \n\nThe Distribution Analyst for LIV is a new position created to bring process improvement and standardized operations to the LIV 3PL Distribution Centers. LIV is looking for an experienced candidate in the supply chain space that doesn’t shy away from deep process improvement work and vendor management, finding joy in tackling the big, painful problem areas that exist in a decentralized distribution network.\n\nLIV views this role as a critical cog in training and development. The right candidate is or can grow into a subject matter expert and excel in passing their knowledge to other participants in the distribution, logistics, and broader supply chain team.\n\nFunctions and duties of this role include, but not limited to: \n\n<ul><li>Work with Liquid IV 3PL distribution partners to make sure they manage our inbound, storage, and outbound processes effectively.</li><li>Own scorecards and dashboards that drive action across key distribution KPIs and OKRs for the LIV supply chain.</li><li>Be the voice of Liquid IV to our distribution 3PL partners, own communication and context from LIV to 3PL and 3PL to LIV.</li><li>Plan and execute time and cost saving projects related to distribution area improvements.</li><li>Collaborate with inventory control, accounting, and planning team to streamline inventory control processes at warehouses and minimize unwanted inventory adjustments and surprises.</li><li>Own distribution costing and reporting on a monthly basis, partner with accounting to create GLs as needed.<br/><br/></li></ul>Qualifications: \n\n<ul><li>Bachelor’s Degree (preferably in business, economics, or another business-related field).</li><li>Minimum 2-4 years’ experience in CPG or beverage company.</li><li>Ability to take a set of data and turn it into insights and actions.</li><li>Able to adapt and think critically under pressure in a constantly changing and sometimes ambiguous environment.</li><li>Strong organizational skills and attention to detail; dependable and accurate.</li><li>Highly proficient in Microsoft Office (Excel, Word, and PowerPoint) and/or other data analysis/presentation toolsets.</li><li>Quick learner – not afraid of testing new programs, ways of working, or strategy. Constant seeker of untapped knowledge.</li><li>Demonstrated ability to interact with vendors and colleagues in a thoughtful and attentive manner.<br/><br/></li></ul>What We Give: \n\n<ul><li>100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options).</li><li>A 401k plan with company match, short and long-term disability coverage.</li><li>A generous PTO and sick policy that includes 13+ paid annual holidays.</li><li>Wellness classes (fitness, mental health, nutrition, finance, etc.).</li><li>An Employee Assistance Program, including membership for guided meditation for all employees.</li><li>Monthly tech and wellness stipend.</li><li>Opportunities to participate in our Impact Program. </li><li>Copious amount of Liquid I.V. product to keep you hydrated! <br/><br/></li></ul>Work Environment: \n\n<ul><li>Hybrid office environment with flexibility for industry events.<br/><br/></li></ul>Candidates must be authorized to work in the United States without sponsorship.<br/><br/>The expected salary range for this position is $72,000 - $85,000 annually. The exact salary is determined by various factors including experience, skills, education, geographic location, internal company equity, and budget.<br/><br/>This job description indicates in general the nature and levels of work, knowledge, skills, abilities and other essential functions expected of the role. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required. It is not intended to limit or in any way modify the right of any supervisor to assign, direct, and control the work of employees under his/her supervision. Ability to competently perform all the essential duties of the position, with or without reasonable accommodation, demonstrated commitment to the company’s mission, and the ability to work productively as a member of a team or work group are basic requirements of all positions at Liquid I.V.<br/><br/>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives that encourage new ways of solving problems, so we strive to attract and develop talent from all backgrounds and create workplaces where everyone feels seen, heard, and empowered to bring their full, authentic selves to work.<br/><br/>Liquid I.V. is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.", "responsibilities": "The Distribution Analyst for LIV is a new position created to bring process improvement and standardized operations to the LIV 3PL Distribution Centers. LIV is looking for an experienced candidate in the supply chain space that doesn’t shy away from deep process improvement work and vendor management, finding joy in tackling the big, painful problem areas that exist in a decentralized distribution network.\n\nLIV views this role as a critical cog in training and development. The right candidate is or can grow into a subject matter expert and excel in passing their knowledge to other participants in the distribution, logistics, and broader supply chain team.\n\nFunctions and duties of this role include, but not limited to: \n\n<ul><li>Work with Liquid IV 3PL distribution partners to make sure they manage our inbound, storage, and outbound processes effectively.</li><li>Own scorecards and dashboards that drive action across key distribution KPIs and OKRs for the LIV supply chain.</li><li>Be the voice of Liquid IV to our distribution 3PL partners, own communication and context from LIV to 3PL and 3PL to LIV.</li><li>Plan and execute time and cost saving projects related to distribution area improvements.</li><li>Collaborate with inventory control, accounting, and planning team to streamline inventory control processes at warehouses and minimize unwanted inventory adjustments and surprises.</li><li>Own distribution costing and reporting on a monthly basis, partner with accounting to create GLs as needed.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree (preferably in business, economics, or another business-related field).\nMinimum 2-4 years’ experience in CPG or beverage company.\nAbility to take a set of data and turn it into insights and actions.\nAble to adapt and think critically under pressure in a constantly changing and sometimes ambiguous environment.\nStrong organizational skills and attention to detail; dependable and accurate.\nHighly proficient in Microsoft Office (Excel, Word, and PowerPoint) and/or other data analysis/presentation toolsets.\nQuick learner – not afraid of testing new programs, ways of working, or strategy. Constant seeker of untapped knowledge.\nDemonstrated ability to interact with vendors and colleagues in a thoughtful and attentive manner.", "preferred": ""}, "skills": ["CPG", "Beverage", "Data Analysis", "Microsoft Office", "Excel", "Word", "PowerPoint", "Vendor Management", "Process Improvement", "Supply Chain", "Logistics", "Distribution", "Inventory Control", "KPI", "OKR"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options).\nA 401k plan with company match, short and long-term disability coverage.\nA generous PTO and sick policy that includes 13+ paid annual holidays.\nWellness classes (fitness, mental health, nutrition, finance, etc.).\nAn Employee Assistance Program, including membership for guided meditation for all employees.\nMonthly tech and wellness stipend.\nOpportunities to participate in our Impact Program. \nCopious amount of Liquid I.V. product to keep you hydrated!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976961126"}