{"jobTitle": "Managed Care Operations Coordinator", "company": {"name": "Pediatric Associates Family of Companies", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Laguna Niguel, CA"}, "location": "Laguna Niguel, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Pediatric Associates was founded in Hollywood, FL in 1955. The same clinician-led, evidence-based, medical home passion is a unifying driver for those who join Pediatric Associates Family of Companies. The Pediatric Associates Family of Companies is a growing team of Pediatricians and Pediatric Care Teammates who are excited to be part of the first nationwide Pediatric Primary Care Medical Home. We further our uniqueness by ensuring the clinician voice is leading our medical home innovations.", "responsibilities": "Develops and maintains strong payor relationships, serves as primary point of contact and payor liaison. Maintains an understanding of contractual arrangements. Ensures all payor issues are addressed at monthly/quarterly meetings. Resolves and responds to payor communications/requests, addresses payor issues including member complaints, and evaluates and resolves payor compliance issues. Responsible for payor operations including maintaining contract data bases and fee schedule. Monitors, tracks, and evaluates incentive programs and assists in the resolution of program performance and payment issues. Researches, escalates, and addresses contract loading and payment issues involving Capitation, Gainshare/Risk, Pay for Performance, and other Incentive arrangements. Supports growth initiatives by conducting due diligence, managing the payor notification process, and ensuring timely loading and issue resolution for all acquisitions. Maintains tracking tools/systems, and processes for contract implementation, evaluation, and ongoing performance. Maintains a system of communication to collaborate with internal departments and management. Identifies payor trends and anticipate issues which may impact the organization.", "qualifications": {"required": "Minimum Bachelor’s Degree required. Associates Degree plus minimum of 5 years related experience may substitute for Bachelor’s Degree requirement. Minimum 3 years of Managed Care or Healthcare experience required including experience with payors and large groups. Experience working with CA Managed Care contracts required.", "preferred": "Candidates in CA or TX highly preferred."}, "skills": ["Managed Care and provider relations experience and knowledge", "Knowledge of Medicaid, payor reimbursement methodologies, and Value Based Care", "Ability to analyze and interpret financial data", "Knowledge of credentialing and claims processes", "Advanced Microsoft Office skills", "Excellent oral and written communication skills", "Strong interpersonal skills", "Effective planning and organizational skills, critical thinker and action oriented"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "May be either full time remote/telework or rotate working in the office and remote/telework.", "url": "https://www.linkedin.com/jobs/view/3976368632"}