{"jobTitle": "Administration and Clerical", "company": {"name": "Walmart", "industry": "Retail", "location": "South Gate, CA"}, "location": "South Gate, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Retail", "description": "These roles will provide administrative support by performing clerical duties (e.g., filing, keying, faxing), entering data and extracting data from multiple systems. You will be using computer applications (e.g., email, spreadsheets, word processing and Microsoft Office). Your ability to be accurate and focus on the details will be critical.<br/><br/>These roles will include clerical positions such as Service Shop Clerks, Quality Assurance Clerks, Administration assistance and Human Resources clerks etc.<br/><br/>At Walmart, we offer competitive pay as well as performance-based incentive awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.<br/><br/>You will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable. For information about PTO, see https://one.walmart.com/notices.<br/><br/>Live Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.<br/><br/>Eligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms. For information about benefits and eligibility, see One.Walmart.com.<br/><br/>The hourly wage range for this position is $16.00 to $29.65.<br/><br/><ul><li>The actual hourly rate will equal or exceed the required minimum wage applicable to the job location. <br/><br/></li></ul><strong>Additional Compensation Includes Annual Or Quarterly Performance Incentives.<br/><br/></strong>Additional compensation in the form of premiums may be paid in amounts ranging from $0.35 per hour to $3.00 per hour in specific circumstances. Premiums may be based on schedule, facility, season, or specific work performed. Multiple premiums may apply if applicable criteria are met.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Provides clerical/administrative support through generating and maintaining forms, reports, and logs via computerized management software; performing weekly inventory; tracking financial transactions; communicating with suppliers regarding equipment warranties. </li><li>Clerical duties (e.g., filing, keying, faxing), entering data and extracting data from multiple systems. Use of computer applications required (e.g., email, spreadsheets, word processing, and Microsoft Office). </li><li>The ability to be accurate and focus on attention to details will be critical. </li><li>Complies with company policies, procedures, and standards of ethics and integrity. Performs additional duties as assigned. </li><li>These roles will include clerical positions such as Service Shop Clerks, Quality Assurance Clerks, Administration Assistant and Human Resources clerks etc. <br/><br/></li></ul>#supplychainjobs<br/><br/><strong>Minimum Qualifications<br/><br/></strong><strong>Administrative and Clerical</strong> positions will require that specific minimum qualifications are met in order to compete for these position.<br/><br/>The <strong>Clerical</strong> positions will require the following:<br/><br/><ul><li>6 months experience performing Walmart Logistics clerical related responsibilities (e.g., filing, data entry) using computer applications (e.g., email, spreadsheet, word processing) OR 1 year experience performing clerical related responsibilities (e.g., filing, data entry) using computer applications (e.g., email, spreadsheet, word processing)<br/><br/></li></ul><strong>Human Resources Clerk<br/><br/></strong><ul><li>1 year coursework in a Human Resource related field (e.g., Business Management, Human Resources) and 1 year experience using computer applications (e.g., email, spreadsheets, word processing) OR </li><li>1 year experience with human resource activities (e.g., payroll, benefits, workers compensation, FMLA, OSHA) and 1 year experience using computer applications (e.g., email, spreadsheets, word processing)<br/><br/></li></ul><strong>About Walmart<br/><br/></strong>At Walmart, we help people save money so they can live better. This mission serves as the foundation for every decision we make, from responsible sourcing to sustainability-and everything in between. As a Walmart associate, you will play an integral role in shaping the future of retail, tech, merchandising, finance and hundreds of other industries-all while affecting the lives of millions of customers all over the world. Here, your work makes an impact every day. What are you waiting for?<br/><br/>Walmart, Inc. is an Equal Opportunity Employer- By Choice. We believe we are best equipped to help our associates, customers, and the communities we serve live better when we really know them. That means understanding, respecting, and valuing diversity- unique styles, experiences, identities, abilities, ideas and opinions- while being inclusive of all people.", "responsibilities": "Provides clerical/administrative support through generating and maintaining forms, reports, and logs via computerized management software; performing weekly inventory; tracking financial transactions; communicating with suppliers regarding equipment warranties. \nClerical duties (e.g., filing, keying, faxing), entering data and extracting data from multiple systems. Use of computer applications required (e.g., email, spreadsheets, word processing, and Microsoft Office). \nThe ability to be accurate and focus on attention to details will be critical. \nComplies with company policies, procedures, and standards of ethics and integrity. Performs additional duties as assigned. \nThese roles will include clerical positions such as Service Shop Clerks, Quality Assurance Clerks, Administration Assistant and Human Resources clerks etc. ", "qualifications": {"required": "6 months experience performing Walmart Logistics clerical related responsibilities (e.g., filing, data entry) using computer applications (e.g., email, spreadsheet, word processing) OR 1 year experience performing clerical related responsibilities (e.g., filing, data entry) using computer applications (e.g., email, spreadsheet, word processing)\n1 year coursework in a Human Resource related field (e.g., Business Management, Human Resources) and 1 year experience using computer applications (e.g., email, spreadsheets, word processing) OR \n1 year experience with human resource activities (e.g., payroll, benefits, workers compensation, FMLA, OSHA) and 1 year experience using computer applications (e.g., email, spreadsheets, word processing)"}, "skills": ["Microsoft Office", "Data Entry", "Filing", "Customer Service", "Inventory Management", "Communication", "Computer Skills", "Spreadsheets", "Word Processing", "Email", "Attention to Detail", "Organization", "Time Management", "Problem Solving", "Teamwork", "Ethics", "Integrity"], "postedDate": "2 weeks ago", "benefits": "At Walmart, we offer competitive pay as well as performance-based incentive awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.", "remoteWork": "No", "salary": {"amount": "16.00 to 29.65", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3976703701"}