{"jobTitle": "Purchasing Manager", "company": {"name": "That's it.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Food and Beverage Services", "description": "<strong>Full-Time | In-Office ONLY | Location: Downtown Los Angeles</strong><br/><br/><strong>About the Company</strong><br/>That’s it. has transformed the natural foods category with its portfolio of super snacks, which today includes: Fruit Bars, Mini Fruit Bars, Probiotic Bars, Truffles, Energy Bars, and Crunchables. The entire range of simple and nutritious items are made from limited ingredients while the brand’s flagship fruit bars – the #1 selling fruit bar in America – contain only two ingredients: fruit + fruit. That’s it.<br/><br/><strong>Job Responsibilities</strong><br/><ul><li>Create Purchase Orders using an ERP system (Netsuite).</li><li>Communicate with upper management on PO approvals to include any relevant information needed to make an informed decision.</li><li>Submit all Ingredient Purchase Orders to suppliers following company guidelines.</li><li>Assist with identifying new ingredient suppliers as needed.</li><li>Assist with R&amp;D projects as needed.</li><li>Maintain supplier relations.</li><li>Manage all open ingredient purchase orders and have a clear understanding of shipping schedules.</li><li>Work with warehouse staff on upcoming deliveries to insure proper receipt of goods in our ERP system and assist with any PO discrepancies.</li><li>Work with all manufacturing facilities to insure all PO’s are received in a timely manner and in accordance with pre-established policies and procedures.</li><li>Maintain a database of all quote requests, supplier contracts, and specifications.</li><li>Track and maintain the status of all open purchase orders and report any delivery issues to management.</li><li>Respond to emergency requests and expedite any orders as needed.</li><li>Create clear, up to date, purchasing reports for weekly presentations or as needed.</li><li>Conduct cost analysis when verifying quotations from suppliers to include landed costs.</li><li>Assist upper management with any additional duties within the scope of operations as needed.</li></ul><br/><br/><strong>Required Skills</strong><br/><ul><li><span>Knowledgable with supply chain principles and practices.</span></li><li><span>Experience in Food/Ingredient sourcing is preferred.</span></li><li><span>Proficient in Google Docs, Excel and other MS Office Applications.</span></li><li><span>General understanding of logistics and food manufacturing is preferred.</span></li><li><span>Netsuite or other ERP software experience is preferred.</span></li><li><span>Excellent problem-solving skills with the ability to conduct root cause analysis</span></li><li><span>Strong attention to detail and ability to work with complex data sets</span></li><li><span>Effective communication skills to collaborate with cross-functional teams</span></li><li><span>Ability to prioritize tasks and meet deadlines in a fast-paced environment</span></li></ul><br/><br/><br/><br/><strong>No Remote work is offered with this position.</strong>", "responsibilities": "Create Purchase Orders using an ERP system (Netsuite). Communicate with upper management on PO approvals to include any relevant information needed to make an informed decision. Submit all Ingredient Purchase Orders to suppliers following company guidelines. Assist with identifying new ingredient suppliers as needed. Assist with R&D projects as needed. Maintain supplier relations. Manage all open ingredient purchase orders and have a clear understanding of shipping schedules. Work with warehouse staff on upcoming deliveries to insure proper receipt of goods in our ERP system and assist with any PO discrepancies. Work with all manufacturing facilities to insure all PO’s are received in a timely manner and in accordance with pre-established policies and procedures. Maintain a database of all quote requests, supplier contracts, and specifications. Track and maintain the status of all open purchase orders and report any delivery issues to management. Respond to emergency requests and expedite any orders as needed. Create clear, up to date, purchasing reports for weekly presentations or as needed. Conduct cost analysis when verifying quotations from suppliers to include landed costs. Assist upper management with any additional duties within the scope of operations as needed.", "qualifications": {"required": "Knowledgable with supply chain principles and practices. Experience in Food/Ingredient sourcing is preferred. Proficient in Google Docs, Excel and other MS Office Applications. General understanding of logistics and food manufacturing is preferred. Netsuite or other ERP software experience is preferred. Excellent problem-solving skills with the ability to conduct root cause analysis Strong attention to detail and ability to work with complex data sets Effective communication skills to collaborate with cross-functional teams Ability to prioritize tasks and meet deadlines in a fast-paced environment", "preferred": ""}, "skills": ["Supply Chain", "Food Sourcing", "Google Docs", "Excel", "MS Office", "Logistics", "Food Manufacturing", "Netsuite", "ERP", "Problem Solving", "Communication"], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976362587"}