{"jobTitle": "Store Manager", "company": {"name": "Lolli & Pops", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$19.00 - $20.19", "currency": "Hourly"}, "jobFunction": "Management and Customer Service", "industry": "Retail", "description": "<strong>Job Details<br/><br/></strong>Job Location<br/><br/>Glendale Galleria - Glendale, CA<br/><br/>Position Type<br/><br/>Full Time<br/><br/>Salary Range<br/><br/>$19.00 - $20.19 Hourly<br/><br/><strong>Description<br/><br/></strong><strong>Lolli &amp; Pops Store Manager<br/><br/></strong>Joining our team will be the sweetest decision you'll ever make!<br/><br/>At Lolli &amp; Pops, we believe that candy is so much more than just candy. It has the power to say thank you, I love you, I celebrate you. And at its heart, candy Spreads Joy with Bits of Optimism. We offer an optimistic culture, a fast-paced work environment, and of course a sweet discount on sweet treats. We consider ourselves a <strong>Company of Firsts</strong> which means we love giving people their first opportunity at employment, their first key to a store, and even their first store to run on their own.<br/><br/>We are seeking inspiring and results-driven candidates to be a Store Manager. Store Managers lead and manage our stores and are at the heart of our team at Lolli &amp; Pops. They are passionate go-getters who care deeply about their team and their community. They ensure that every guest who enters our store has a positive and inspiring experience. They are visionaries who help us create a compelling and ever-changing store experience that makes Lolli &amp; Pops the preferred destination for our community's candy needs.<br/><br/>Specifically, Store Manager essential responsibilities include, but are not limited to, the following:<br/><br/><ul><li> Drive store-level financial and operational results by consistently monitoring the stores key performance indicator (KPI) targets and taking appropriate action to achieve store targets </li><li> Hire, train, develop and motivate team members. Ensure effective succession planning by identifying and developing future leaders with an interest and potential to grow </li><li> Lead excellent customer service through in-the-moment coaching, role modeling, and utilizing customer feedback to reinforce and improve the quality of service </li><li> Maximize the sales performance of the team through product knowledge education, coaching selling skills and leading by example </li><li> Manage inventory, including ordering, receiving, stocking and conducting inventory counts </li><li> Maintain visual and merchandising standards and ensure store cleanliness </li><li> Protect store assets, facilities, and team members by ensuring all team members adherence to operational guidelines and standards, compliance with all safety and security policies, the proper functioning and maintenance of store equipment, and performance of all financial transactions according to the Cash Handling Policy </li><li> Maintain current and accurate business, legal, and personnel records and store resource materials by actions such as performing daily and weekly payroll and labor responsibilities, reviewing and maintaining all timekeeping records, and ensuring company communications are cascaded as appropriate to all store team members </li><li> Develop marketing opportunities; partner with mall management on marketing and promotional events and programs </li><li> Work traditional retail hours consistent with a high performing retail location </li><li> Be a champion of Lolli &amp; Pops inside and outside of the store <br/><br/></li></ul>While There Is No Single Recipe For An Excellent Store Manager, The Following Are Qualities And Experiences We Recognize As Contributing To The Success Of Our Best Managers<br/><br/><ul><li> Exceptional leadership and interpersonal skills you are energized by working with people; both guests and your team. </li><li> A bias towards action you are an owner who does not hesitate to roll up your sleeves and do whatever it takes to get the job done. </li><li> The desire to coach and mentor you see potential in your team and enjoy growing that potential. </li><li> An eye for detail -- you know that the little things be it cleanliness, the extra touch, or a few decimals can make all the difference. </li><li> The desire to problem solve you like finding problems and fixing them. </li><li> The ability to multitask you can prioritize and execute at many different tasks each day. </li><li> The desire to learn you recognize that everyone can always learn if they set their minds to it. </li><li> A positive attitude and fun-loving spirit you are an optimist who freely embraces your inner child and enjoys having fun while you work. </li><li> 1 year proven, results-driven retail store manager experience is helpful. <br/><br/></li></ul><strong>Our Company values are important to us! We are:<br/><br/></strong><strong>Guest-icated</strong> our guests are at the heart of everything we do<br/><br/><strong>Collaborative</strong> we are a joyful mix of unique individuals working together<br/><br/><strong>Agile</strong> we are flexible and open to change in order to be the best we can be<br/><br/><strong>Authentic</strong> we honor what's real and authentic and give feedback from the heart<br/><br/><strong>Betterment</strong> we have a never ending drive to continuously improve<br/><br/><strong>We cannot wait to meet you!<br/><br/></strong>We are an equal opportunity employer of all qualified individuals. We consider all applicants - minorities, women, veterans and individuals with disabilities no matter their sexual orientation or gender identity. We consider giving opportunities to qualified individuals with criminal histories when it aligns with federal, state and local statutes.", "responsibilities": "Specifically, Store Manager essential responsibilities include, but are not limited to, the following:<br/><br/><ul><li> Drive store-level financial and operational results by consistently monitoring the stores key performance indicator (KPI) targets and taking appropriate action to achieve store targets </li><li> Hire, train, develop and motivate team members. Ensure effective succession planning by identifying and developing future leaders with an interest and potential to grow </li><li> Lead excellent customer service through in-the-moment coaching, role modeling, and utilizing customer feedback to reinforce and improve the quality of service </li><li> Maximize the sales performance of the team through product knowledge education, coaching selling skills and leading by example </li><li> Manage inventory, including ordering, receiving, stocking and conducting inventory counts </li><li> Maintain visual and merchandising standards and ensure store cleanliness </li><li> Protect store assets, facilities, and team members by ensuring all team members adherence to operational guidelines and standards, compliance with all safety and security policies, the proper functioning and maintenance of store equipment, and performance of all financial transactions according to the Cash Handling Policy </li><li> Maintain current and accurate business, legal, and personnel records and store resource materials by actions such as performing daily and weekly payroll and labor responsibilities, reviewing and maintaining all timekeeping records, and ensuring company communications are cascaded as appropriate to all store team members </li><li> Develop marketing opportunities; partner with mall management on marketing and promotional events and programs </li><li> Work traditional retail hours consistent with a high performing retail location </li><li> Be a champion of Lolli &amp; Pops inside and outside of the store <br/><br/></li></ul>", "qualifications": {"required": "1 year proven, results-driven retail store manager experience is helpful.", "preferred": null}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3976372790"}