{"jobTitle": "Human Resources Business Partner", "company": {"name": "Nikkiso Clean Energy & Industrial Gases", "industry": "Oil and Gas", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Oil and Gas", "description": "<strong>Company Overview<br/><br/></strong>Nikkiso Clean Energy &amp; Industrial Gases is a leading provider of cryogenic pumps, heat exchangers, process systems, turboexpanders, services, and solutions for the liquefied natural gas (LNG), liquefied hydrogen (LH2), and industrial gases industries. Applications include fueling stations, marine engines, peak shaving, power generation, virtual pipelines, carbon capture, geothermal power, and well stimulation. We are a subsidiary of Nikkiso Company Ltd, a leading industrial manufacturer headquartered in Tokyo, Japan, with $1.5 B USD in annual revenue, 8000 + employees worldwide, and publicly traded on the Tokyo Stock Exchange.<br/><br/><strong>Job Overview<br/><br/></strong>Nikkiso is hiring for an experienced Human Resources Business Partner to support our Nikkiso Cryogenic Services Business Unit headquartered in Irvine, California, and its customer centers operating around the world. With a direct reporting line to the business unit President and dotted line to EVP HR, the HRBP is a key member of the Unit’s Management Team and responsible for aligning HR practices with global business objectives for this rapidly growing company. Due to our growth, this senior role is a new position and will have responsibility for the Service-related activities of Regional HR leaders globally who are either fully dedicated to the Services Unit or are supporting the Unit through the organizational matrix structure.<br/><br/>At Nikkiso, our HR Team is dedicated to cultivating a world-class employee experience. It is our mission to provide our global workforce with strategic support and exceptional services to ensure we attract, develop, engage, and retain bright and passionate people. The successful candidate for this role will exemplify our HR core values, collaboration, integrity, agility, and transparency.<br/><br/>This is a strategic role and the successful HRBP will act as a senior advisor and employee champion who anticipates and addresses HR-related needs, communicates proactively, and seeks to develop integrated solutions. The position fosters partnerships across the organization to deliver value-added service and support. The HRBP will maintain an effective level of business literacy about the Unit's financial position, operational objectives, culture, and competition. The role will also drive Nikkiso CEIG Group HR initiatives, programs, and activities.<br/><br/>This is a challenging global role with an emphasis on growth, organizational design, talent &amp; management development, retention, organizational planning, and an opportunity to demonstrate the HR Value Proposition. Global travel will be required on occasion as needed.<br/><br/>Annual Salary Range: $109,237 to $215,625 plus 20% bonus opportunity<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Responsible for the Unit’s HR strategy and all HR related activities globally. </li><li> Administers human resource plans, programs, policies, and procedures. </li><li> Ensures the Unit’s compliance with employment laws, regulations, and practices globally. </li><li> Maintains current and in-depth knowledge of legal requirements related to employment and provides guidance and support to managers and employees. Consults with HR Operations, Legal Department, local experts, and external counsel as needed to ensure compliance and consistency. </li><li> Interacts regularly with management and provides advice and consultation to promote employee engagement, productivity, morale, retention, and an excellent employee experience. </li><li> Provides leadership and coordination in areas such as immigration, safety, system implementations, HR projects &amp; initiatives, etc. </li><li> Works collaboratively with Talent Acquisition team, management, and regional leaders to hire qualified candidates, including specialized technical field service roles that are unique and often hard-to-fill. </li><li> Responsible for HR-related administrative tasks including personnel data maintenance, annual processes (i.e. reviews, TMP, bonus), J-SOX &amp; procedural compliance, audit, Board preparation/analysis, headcount allocations, local reporting, etc. </li><li> Coordinates new employee orientation and training plans, maintains recordkeeping, and monitors engagement. </li><li> Drives the Talent Management Process (TMP) including the creation of Individual Development Plans and ensures execution of the development action. </li><li> Identifies and coordinates training for employees via Nikkiso University or in-person. Works with management and training specialists to establish effective learning content aligned with the Nikkiso standard and ensures completion of assignments. </li><li> Resolves employee relations issues, conducts thorough investigations and recommends/implements interventions and coaching to avoid unfavorable situations. </li><li> Processes terminations, performs exit interviews, and conducts turnover analysis to identify trends and implement mitigation strategies. </li><li> Supports the performance review process including manager/employee communication, performance improvement plans, and management of disciplinary actions. </li><li> Actively participates in Group HR initiatives and collaborates with HR colleagues globally in the development of policies, programs, and solutions. </li><li> Undertakes all responsibilities with a superior commitment to ethical practices, integrity, and confidentiality of sensitive information. </li><li> Supports projects and fulfills other responsibilities as needed. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree or higher</li><li>Senior experience in human resources</li><li>Experience with HR systems including HRIS, ATS and LMS</li><li>Solid coaching and employee relations experience</li><li>HR certification preferred</li><li>Proven success in relationship management</li><li>Credible &amp; knowledgeable advisor</li><li>Problem-solver</li><li>Global acumen</li><li>Detail oriented and highly accurate</li><li>Excellent communicator, both verbal &amp; written</li><li>Project manager</li><li>Talent leader</li><li>Development coach</li><li>Relationship manager</li><li>Organized and quickly drives work to closure</li><li>Flexible collaborator</li><li>Ability to travel as needed including internationally</li></ul>", "responsibilities": "<ul><li> Responsible for the Unit’s HR strategy and all HR related activities globally. </li><li> Administers human resource plans, programs, policies, and procedures. </li><li> Ensures the Unit’s compliance with employment laws, regulations, and practices globally. </li><li> Maintains current and in-depth knowledge of legal requirements related to employment and provides guidance and support to managers and employees. Consults with HR Operations, Legal Department, local experts, and external counsel as needed to ensure compliance and consistency. </li><li> Interacts regularly with management and provides advice and consultation to promote employee engagement, productivity, morale, retention, and an excellent employee experience. </li><li> Provides leadership and coordination in areas such as immigration, safety, system implementations, HR projects &amp; initiatives, etc. </li><li> Works collaboratively with Talent Acquisition team, management, and regional leaders to hire qualified candidates, including specialized technical field service roles that are unique and often hard-to-fill. </li><li> Responsible for HR-related administrative tasks including personnel data maintenance, annual processes (i.e. reviews, TMP, bonus), J-SOX &amp; procedural compliance, audit, Board preparation/analysis, headcount allocations, local reporting, etc. </li><li> Coordinates new employee orientation and training plans, maintains recordkeeping, and monitors engagement. </li><li> Drives the Talent Management Process (TMP) including the creation of Individual Development Plans and ensures execution of the development action. </li><li> Identifies and coordinates training for employees via Nikkiso University or in-person. Works with management and training specialists to establish effective learning content aligned with the Nikkiso standard and ensures completion of assignments. </li><li> Resolves employee relations issues, conducts thorough investigations and recommends/implements interventions and coaching to avoid unfavorable situations. </li><li> Processes terminations, performs exit interviews, and conducts turnover analysis to identify trends and implement mitigation strategies. </li><li> Supports the performance review process including manager/employee communication, performance improvement plans, and management of disciplinary actions. </li><li> Actively participates in Group HR initiatives and collaborates with HR colleagues globally in the development of policies, programs, and solutions. </li><li> Undertakes all responsibilities with a superior commitment to ethical practices, integrity, and confidentiality of sensitive information. </li><li> Supports projects and fulfills other responsibilities as needed. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree or higher, Senior experience in human resources, Experience with HR systems including HRIS, ATS and LMS, Solid coaching and employee relations experience, Proven success in relationship management, Credible &amp; knowledgeable advisor, Problem-solver, Global acumen, Detail oriented and highly accurate, Excellent communicator, both verbal &amp; written, Project manager, Talent leader, Development coach, Relationship manager, Organized and quickly drives work to closure, Flexible collaborator, Ability to travel as needed including internationally", "preferred": "HR certification"}, "skills": ["HRIS", "ATS", "LMS", "Coaching", "Employee Relations", "Relationship Management", "Global Acumen", "Communication", "Project Management", "Talent Management", "Development", "Organization"], "postedDate": "2 weeks ago", "salary": {"amount": "109,237 to $215,625", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3976924540"}