{"jobTitle": "Business & Inventory Analyst", "company": {"name": "Killer Merch", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "72,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Killer Merch</strong> located in Chatsworth, is seeking a detail-oriented and analytical Business and Inventory Analyst to join our team. The successful candidate will be responsible for managing and optimizing inventory levels, analyzing business data, and providing insights to improve operational efficiency. This role requires a strong understanding of inventory management principles, excellent analytical skills, and the ability to communicate findings effectively to various stakeholders.", "responsibilities": "Inventory Data Management:\n\n* Monitor and manage inventory levels to ensure optimal stock levels.\n* SKU Creation and Sync between Acumatica, Shopify and TikTok.\n* Conduct regular inventory audits and reconciliations.\n* Oversee Year End Physical Inventories.\n* Develop and implement inventory control procedures to minimize losses and improve accuracy.\n* Forecast inventory needs based on sales trends, historical data, and market conditions.\n* Provide CPA with inventory data in relation to year-end audits.\n\nShipping Data Analysis\n\n* Analyze shipping data to identify trends and opportunities for optimizing logistics operations.\n* Collaborate with logistics teams to improve shipping efficiency and reduce costs.\n* Prepare reports on shipping performance and provide recommendations for improvements.\n\neComm Fraud Data Analysis\n\n* Review and interpret fraud data from eComm sales.\n* Coordinate with Customer Service to provide analytics to assist with fraud prevention.\n* Continuously review fraud data to identify and improve fraud prevention tactics.\n\nData Analysis\n\n* Collect, analyze, and interpret business data to identify trends, patterns, and opportunities for improvement.\n* Prepare regular reports on inventory performance, sales trends, and other key metrics.\n* Use data-driven insights to recommend strategies for optimizing inventory levels and reducing costs.\n* Develop and maintain dashboards and other reporting tools to facilitate decision-making.\n\nBusiness Process Improvement\n\n* Identify inefficiencies in current inventory management processes and propose solutions for improvement.\n* Collaborate with cross-functional teams to implement process improvements and best practices.\n* Participate in the development and implementation of new systems and technologies to enhance inventory management and business operations.\n\nStakeholder Communication\n\n* Communicate findings and recommendations to various stakeholders, including senior management, sales, and operations teams.\n* Provide training and support to team members on inventory management best practices and tools.", "qualifications": {"required": "Bachelor’s degree in Business Administration, Supply Chain Management, Finance, or equivalent work experience.\nProven experience in inventory management, business analysis, or a data-related role.\nStrong analytical skills with the ability to interpret complex data sets.\nProficiency in inventory management software and data analysis tools (e.g., Excel, SQL, ERP systems).\nExperience with advanced data analysis tools and software (e.g., Tableau, Power BI).\nShopify Experience is a plus.\nExcellent communication and presentation skills.\nDetail-oriented with strong organizational skills.\nAbility to work independently and as part of a team.\nKnowledge of industry best practices and trends in inventory management.", "preferred": ""}, "skills": ["Inventory Management", "Data Analysis", "Business Analysis", "Excel", "SQL", "ERP Systems", "Tableau", "Power BI", "Shopify"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Competitive salary and performance-based bonuses.\nComprehensive health, dental, and vision insurance.\nRetirement savings plan with employer match.\nProfessional development opportunities.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3976347869"}