{"jobTitle": "Social Media Coordinator", "company": {"name": "PACSUN", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$64,480-$66,560", "currency": "USD"}, "jobFunction": "Sales and Marketing", "industry": "Retail", "description": "Join the Pacsun Community Pacsun is dedicated to delivering an exclusive collection of the most relevant brands and styles to a community of inspired youth. Through partnerships with brands such as adidas, Brandy Melville, Essentials Fear of God, our own brands, and many more. Our Pacsun community believes in and understands the importance of using our voice, platform, and resources to inspire and bring about positive development. Our program PacCares supports and partners with organizations that align with our internal and external initiatives surrounding mental health, diversity, and equality.\n\nJoin the Pacsun Community. Learn more here: LinkedIn- Our Community\n\n\nAbout the Job:\nCreate engaging content across social media channels, specifically Instagram.\n\nA day in the life, what you’ll be doing: \n\n· Daily moderation of all social networks especially Instagram and Pinterest\n· Able to create and design graphics for Instagram\n· Stay updated on latest brand-right social trends to ideate and incorporate · Contribute to creative brainstorms to develop new content concepts\n· Plan and schedule social media posts to ensure a consistent and timely online presence.\n· Monitor and engage with comments, messages, and mentions across platforms.\n· Plan, schedule and post daily Instagram story content, ensuring they serve merchandising /business goals\n· Attend shoots, events and activations for coverage\n\nWhat it takes to Join:\n\n· Ability to work in a dynamic, fast-paced environment and partner across many teams and levels within the organization.\n· Knowledge of graphic design + video editing is a plus\n· Extremely organized, detail-oriented, and works well in fast-paced environments\n· Possess eye for aesthetic curation and cohesive visual storytelling\n· Passion for social media marketing, fashion & pop-culture trends\n· Strong written and verbal communication\n· Strong attention to detail and organization\n· Availability to work evenings and weekends\n· Retail and Social Media experience a plus\n· Ability to work with multiple partners and manage many day-to-day projects.\n\nSalary Range: $64,480-$66,560\n\nPac Perks: \n\n· Dog friendly office environment\n· On-site Cafe\n· On-site Gym\n· $1,000 referral incentive program\n· Generous associate discount of 30-50% off merchandise online and in-stores\n· Competitive long term and short-term incentive program\n· Immediate 100% vested 401K contributions and employer match\n· Calm Premium access for all employees\n· Employee perks throughout the year\nPhysical Requirements: The physical demands described here are representative of those that are required by an associate to successfully perform the essential functions of this job.\n· While performing the duties of this job, the associate is regularly required to talk or hear. The associate is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms.\n· Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus.\n· Ability to work in open environment with fluctuating temperatures and standard lighting.\n· Ability to work on computer and mobile phone for multiple hours; with frequent interruptions.\n· Required to travel in elevator or stairwells to attend meetings and engage with associates on multiple floors throughout building.\n· Hotel, Airplane, and Car Travel may be required.\n\nPosition Type/Expected Hours of Work: \n\nThis is a full-time position. As a National Retailer, occasional evening and/or weekend work may be required during periods of high volume. This role operates in a professional office environment and routinely uses standard office equipment. Other Considerations: Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the associate for this job. Duties, responsibilities and activities may change at any time with or without notice. Reasonable accommodation may be made to qualified individuals with disabilities to enable them to perform the essential functions of the role.", "responsibilities": "Create engaging content across social media channels, specifically Instagram.\n\n· Daily moderation of all social networks especially Instagram and Pinterest\n· Able to create and design graphics for Instagram\n· Stay updated on latest brand-right social trends to ideate and incorporate · Contribute to creative brainstorms to develop new content concepts\n· Plan and schedule social media posts to ensure a consistent and timely online presence.\n· Monitor and engage with comments, messages, and mentions across platforms.\n· Plan, schedule and post daily Instagram story content, ensuring they serve merchandising /business goals\n· Attend shoots, events and activations for coverage", "qualifications": {"required": "· Ability to work in a dynamic, fast-paced environment and partner across many teams and levels within the organization.\n· Extremely organized, detail-oriented, and works well in fast-paced environments\n· Possess eye for aesthetic curation and cohesive visual storytelling\n· Passion for social media marketing, fashion & pop-culture trends\n· Strong written and verbal communication\n· Strong attention to detail and organization\n· Availability to work evenings and weekends\n· Retail and Social Media experience a plus\n· Ability to work with multiple partners and manage many day-to-day projects.", "preferred": "· Knowledge of graphic design + video editing is a plus"}, "skills": ["Instagram", "Social Media", "Graphic Design", "Video Editing", "Retail"], "postedDate": "1 week ago", "benefits": "· Dog friendly office environment\n· On-site Cafe\n· On-site Gym\n· $1,000 referral incentive program\n· Generous associate discount of 30-50% off merchandise online and in-stores\n· Competitive long term and short-term incentive program\n· Immediate 100% vested 401K contributions and employer match\n· Calm Premium access for all employees\n· Employee perks throughout the year", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976470916"}