{"jobTitle": "Sr. Sales Strategy and Operations Manager , Strategy Operations and Digital Analytics", "company": {"name": "Amazon", "industry": "Software Development", "size": "Large", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,500 - $199,300", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Business Development", "industry": "Software Development", "description": "Amazon Ads helps brands create experiences that delight customers and deliver meaningful results. With 300+ million worldwide active customer accounts, and first-party insights based on shopping, streaming and browsing signals, brands can craft relevant campaigns that enhance customer experiences. Our solutions on Amazon.com, services like Twitch, IMDb TV, Alexa, Amazon Music, and partnerships with third-party publishers and exchanges make Amazon Ads the ultimate amplifier for brands to reach the right audiences in the right places, both on and off Amazon.\n\nThe global Sales Operations and Digital Analytics (SODA) team under Global Sales Product Engineering and Operations (SPEO) builds reliable data foundations and sales operation processes for sales teams to successfully function. This includes the design of the data infrastructure to track and attribute sales revenue, the segmentation model to prioritize advertiser accounts and service model, and the collection of processes to determine sellers’ books of business, sales goals and quotas.\n\nIn this role, you will be a key member of the SPEO team ensuring the Sales leadership team and Sales organization have the necessary information to operate and execute efficiently. You will drive and coordinate the ongoing sales planning activities worldwide, from forward-looking design to execution. You will build scalable mechanisms to support business and operation processes. You will have strong oral and written communication skills enabling you to dive deep into the data to find answers, and to summarize the data into a logical analysis that ensures all stakeholders are informed. You will influence senior sales leadership and front-line managers, with a balance of backbone to enforce agreed upon decisions and adaptability to support strategic business changes.\n\nThe candidate must be a strong leader, and will draw upon solid analytical, critical thinking, and problem-solving skills to effectively partner and influence Sales teams globally. You will need to have the ability to manage complexity, design, implement and execute processes and coordinate cross-functional teams to deliver on high standards. You will feel comfortable navigating ambiguity and solving complex problems, communicating effectively with partners, sales customers and leadership to drive results. You should have a proven work ethic, strong ownership and customer obsession.", "responsibilities": "Lead projects designed to improve operational and process efficiency. This will include accessing and analyzing data and working extensively with partner teams such as Finance, Sales Compensation, Tech Product and Regional Sales Operations. Drive cross-functional coordination to deliver results based on a predefined timeline, mapping and managing the interdependencies and potential risks. Lead and support teams in responding to, investigating, managing and resolving complex and high-impact problems and escalations around data that impacts Sales. Analyze existing process gaps, and develop solutions to close them. Drive towards simple, scalable solutions to difficult problems. Work with our customers to gather and document business requirements, propose solutions, evaluate feasibility, and work with Product to prioritize features. Use high-level judgment to own complex decisions and escalate to leadership when required. Project-manage multiple workflows and communicate complex analytical results, both written and verbal, in a clear and easy-to-understand way.", "qualifications": {"required": "Bachelor's degree or equivalent, Experience defining, refining and implementing sales processes, procedures and policies or equivalent, Experience developing and implementing systems/tools utilized for CRM, variable compensation, revenue reporting, forecasting, Salesforce automation, etc., 10+ years of Microsoft Excel experience", "preferred": "Experience using Salesforce (or other CRM tool) or BI tools, Experience presenting to senior leadership, Experience in sales operations or equivalent"}, "skills": ["Sales Strategy", "Operations Management", "Data Analysis", "Project Management", "Salesforce", "Microsoft Excel"], "postedDate": "2 weeks ago", "applicationDeadline": "Open until filled", "benefits": "Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $120,500/year in our lowest geographic market up to $199,300/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3976472198"}