{"jobTitle": "Sr. Manager, Human Resources, West Region", "company": {"name": "Van Cleef & Arpels", "industry": "Retail Luxury Goods and Jewelry", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "125,000-150,000", "currency": "USD"}, "jobFunction": "Training, Education, and Human Resources", "industry": "Retail Luxury Goods and Jewelry", "description": "At Richemont Americas, we aspire to reflect the ever-changing world around us. We are proud to employ talent from many different backgrounds, experiences, and identities to build a continually evolving, inclusive community where the diversity of our colleagues and clients is rich and celebrated. We believe when inclusion is fully embraced and empowered, creativity and knowledge emerge to deliver excellence, advancing the community that is uniquely Richemont Americas. <br/><br/><em>Sr. Manager, Human Resources, West Region<br/><br/></em>Van Cleef &amp; Arpels | Los Angeles<br/><br/>Reports to: Director, Human Resources<br/><br/><strong>Role Overview<br/><br/></strong>The Sr. Manager, Human Resources plays a key role in the recruitment, growth and development of its internal leaders. The successful individual will be a strong generalist practitioner, with key experience driving and delivering talent management services in support of the Van Cleef &amp; Arpels and Richemont North America initiatives.<br/><br/>The Sr. Manager will provide thought partnership and managerial knowhow to the leadership and human resources teams to help develop and implement leading-edge talent processes and practices. Reporting to the Director, Human Resources, Retail, the role will assist in creating and enhancing business performance through organization design, alignment, accountability, culture shift and process improvement.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Support brand leadership with all related Talent Management &amp; Organizational Development activities:</li><li>Assess organization’s development needs and develop programs accordingly to raise the level of human resources development awareness and competencies.</li><li>Development program will include technical as well as professional development – this role will require extensive collaboration with our brand leaders to develop specific training tools to meet their needs.</li><li>Partners with employees at all levels across the company to better understand and incorporate their needs into training, career-pathing, and development initiatives in relation to Global and Regional guidelines.</li><li>Act as organizational development liaison and advisor to North America leadership team and facilitate organizational development initiatives across the company.</li><li>Manage and oversee Employee Relations for the Van Cleef &amp; Arpels team, as needed:</li><li>Evaluate Employee Relations issues at hand and advise the Manager of proper protocol.</li><li>Partner with the Corporate Attorney in ensuring the issue is being evaluated appropriately and handled in the best manner possible.</li><li>Coach Managers in dealing with performance management and Employee Relations issues.</li><li>Ensure that Managers are complying with appropriate protocol and procedures upon issuing a verbal, written or final warning, if necessary. Review written warning memos to be issued.</li><li>Ensure that all HR policies and procedures are being adhered to fairly and consistently.</li><li>Follow-up on issues with the Managers as needed</li><li>Drive an efficient and effective Staffing &amp; Recruitment process, which is reflective of the Richemont values and principles</li><li>Coordinate recruitment process with the Hiring Manager. Create job descriptions, post positions, source resumes and screen candidates, ensure that the hiring manager has developed a departmental induction process and is prepared to welcome and integrate the new hire.</li><li>Create a pleasant and memorable recruitment experience, providing the candidate with a compelling image of the Richemont group.</li><li>Manage and provide overall support throughout the Performance Management (MPJ) and Salary Review Process:</li><li>Provide guidance to all managers throughout the Performance Management Process and ensure that PMP forms are being completed in a timely manner.</li><li>Provide overall support and advice in delivering performance management reviews.</li><li>Provide guidance and support to the Manager in building promotional business cases.</li><li>Coordinate with HR Compensation team in determining compensation increase and bonuses and advice managers during the salary review process.</li><li>Ensure that all performance reviews are received and filed</li><li>Have thorough knowledge of Employee Benefit programs, FMLA guidelines and company leave of absence processes in order to assist employees with inquiries and partner with the RNA Benefits Manager on claims management.</li><li>Assist the RNA Benefits Manager with annual open enrollment or other benefit programs as needed.</li><li>Assist employees and management teams with payroll questions and inquiries relating to payroll, direct deposits, E-time, earned time off, holiday pay, etc.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A minimum of 10 years of experience in Human Resources management, with skills in talent management, employee relations, recruiting, and performance management, as well as compensation &amp; benefit administration.</li><li>College degree in a related area, MBA or Masters preferred. Experience in luxury retail industry a plus.</li><li>Experience within a talent role with an organization known for successful talent management is ideal. Knowledge of state laws.</li><li>Strong interpersonal and consulting skills in dealing with employees at all levels of the organization, including leadership, influencing and relationship-building across functions</li><li>Experience coaching mid or senior-level leaders to improve leadership performance. Excellent negotiating and conflict resolution skills.</li><li>Drive-for-results orientation with the ability to translate complex, strategic topics into specific, understandable goals, tactics, action plans and deliverables.</li><li>Excellent interpersonal and consulting skills, including leadership, influencing and relationship-building across functions</li><li>Demonstrated effectiveness in identifying needs, developing action plans and executing deliverables and presenting outcomes and recommendations Strong verbal and written communication skills.</li><li>Must possess strong leadership skills and have strong customer service skills.</li><li>Ability to travel 40% of the time.<br/><br/></li></ul>Richemont offers a generous compensation and benefits package for eligible employees. Only candidates selected for further consideration will be contacted.<br/><br/><strong>We Offer<br/><br/></strong>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.<br/><br/>At Richemont, We Craft the Future!<br/><br/>Expected Salary Range: <strong>$125,000-150,000<br/><br/></strong>Salary will be determined based on relevant skills and experience.<br/><br/>", "responsibilities": "Support brand leadership with all related Talent Management & Organizational Development activities: Assess organization’s development needs and develop programs accordingly to raise the level of human resources development awareness and competencies. Development program will include technical as well as professional development – this role will require extensive collaboration with our brand leaders to develop specific training tools to meet their needs. Partners with employees at all levels across the company to better understand and incorporate their needs into training, career-pathing, and development initiatives in relation to Global and Regional guidelines. Act as organizational development liaison and advisor to North America leadership team and facilitate organizational development initiatives across the company. Manage and oversee Employee Relations for the Van Cleef & Arpels team, as needed: Evaluate Employee Relations issues at hand and advise the Manager of proper protocol. Partner with the Corporate Attorney in ensuring the issue is being evaluated appropriately and handled in the best manner possible. Coach Managers in dealing with performance management and Employee Relations issues. Ensure that Managers are complying with appropriate protocol and procedures upon issuing a verbal, written or final warning, if necessary. Review written warning memos to be issued. Ensure that all HR policies and procedures are being adhered to fairly and consistently. Follow-up on issues with the Managers as needed Drive an efficient and effective Staffing & Recruitment process, which is reflective of the Richemont values and principles Coordinate recruitment process with the Hiring Manager. Create job descriptions, post positions, source resumes and screen candidates, ensure that the hiring manager has developed a departmental induction process and is prepared to welcome and integrate the new hire. Create a pleasant and memorable recruitment experience, providing the candidate with a compelling image of the Richemont group. Manage and provide overall support throughout the Performance Management (MPJ) and Salary Review Process: Provide guidance to all managers throughout the Performance Management Process and ensure that PMP forms are being completed in a timely manner. Provide overall support and advice in delivering performance management reviews. Provide guidance and support to the Manager in building promotional business cases. Coordinate with HR Compensation team in determining compensation increase and bonuses and advice managers during the salary review process. Ensure that all performance reviews are received and filed Have thorough knowledge of Employee Benefit programs, FMLA guidelines and company leave of absence processes in order to assist employees with inquiries and partner with the RNA Benefits Manager on claims management. Assist the RNA Benefits Manager with annual open enrollment or other benefit programs as needed. Assist employees and management teams with payroll questions and inquiries relating to payroll, direct deposits, E-time, earned time off, holiday pay, etc.", "qualifications": {"required": "A minimum of 10 years of experience in Human Resources management, with skills in talent management, employee relations, recruiting, and performance management, as well as compensation & benefit administration. College degree in a related area, MBA or Masters preferred. Experience in luxury retail industry a plus. Experience within a talent role with an organization known for successful talent management is ideal. Knowledge of state laws. Strong interpersonal and consulting skills in dealing with employees at all levels of the organization, including leadership, influencing and relationship-building across functions Experience coaching mid or senior-level leaders to improve leadership performance. Excellent negotiating and conflict resolution skills. Drive-for-results orientation with the ability to translate complex, strategic topics into specific, understandable goals, tactics, action plans and deliverables. Excellent interpersonal and consulting skills, including leadership, influencing and relationship-building across functions Demonstrated effectiveness in identifying needs, developing action plans and executing deliverables and presenting outcomes and recommendations Strong verbal and written communication skills. Must possess strong leadership skills and have strong customer service skills. Ability to travel 40% of the time.", "preferred": "MBA or Masters preferred. Experience in luxury retail industry a plus."}, "skills": ["Talent Management", "Employee Relations", "Recruiting", "Performance Management", "Compensation & Benefit Administration", "Luxury Retail", "Organizational Development", "Leadership Coaching", "Negotiation", "Conflict Resolution", "Communication", "Customer Service"], "postedDate": "2 weeks ago", "benefits": "Richemont offers a generous compensation and benefits package for eligible employees. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3976446930"}