{"jobTitle": "Patient Care / Front Office Coordinator", "company": {"name": "DermCare Management", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "19.00/hr - 22.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "<strong>Patient Care/Front Office Coordinator<br/><br/></strong>The Patient Care / Front Office Coordinator will be responsible for accurate management and triaging of messages, capturing and facilitating the needs of the patients, responding to patient inquires, managing patient service &amp; scheduling process, and overall facility care.<br/><br/>Candidate must have prior medical office experience.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Manage and triage messages accurately, including: relaying messages timely, including emails and phone calls from service and real time messaging based on active calls and patient visits, capturing messages accurately and completely, routing messages to the proper individuals, thoroughly and completely documenting messages in proper destination, including any notations in the system and/or patient chart, all while maintaining a positive and welcoming atmosphere. </li><li>Capture and facilitate the management of all expressed and anticipated needs of the patient including the posting and auditing function.</li><li>Capture and manage all patient inquiries, including inquiries by phone, email, walk in, or onsite visiting with another patient and for new or existing patients; such as obtaining first name, last name, current phone number, best time to return call, statement of interest, etc.</li><li>Review schedule to ensure the best facilitation of customer needs, inclusive of cross-scheduled services, timing for services, accuracy of services to be provided, and preparation of visit.</li><li>Ensure the delivery and receipt of welcome packets prior to the confirmation call of office visits.</li><li>Ensure the delivery and receipt of welcome packets subsequent to welcome call when welcome packet was not received prior to confirmation call. </li><li>Ensure confirmation calls are made 3 business days prior to all scheduled visit to the allocated owners of the related appointment type.</li><li>Assess the needs for move up and dispatch move up invitations in a timely fashion for all appointment types.</li><li>Find resolutions to outstanding items on to do lists.</li><li>Verify the accuracy of the daily schedule with respect to actual appointment type, appointment purpose, status of visit, add-ons, services rendered, fees collected and additional visits scheduled or visits to be scheduled.</li><li>Prepare charts timely. </li><li>Manage check out process, including areas such as computing and collecting fees accurately, noting additional patient needs for communication to providers, scheduling next visit, return of charts to proper individuals, etc. </li><li>Manage check in process, including areas such as welcoming the patient, reviewing patient paperwork for HIPPA forms, understanding schedule and possible wait times, etc. </li><li>Manage posting function, including updating the schedule for patient visit appointment type and purpose in the appointment window based on notes for the actual visit, updating for any addons or changes in the appointment, billing the visit identifying the correct appointment type and fee, posting fees collected into payment window attaching correct description and provider and payment type, applying fees collected to charges billed (for cosmetic and insurance) and notifying accounting of any unreconciled differences. </li><li>Coordinate and complete the audit process for the super bill, including reviewing office notes and verifying completion of signatures, dates, provider and matching to purpose of visit scheduled. Noting differences forwarded for resolution and updating schedule for conclusion. </li><li>Coordinate and complete the surgery audit process including operative notes, fee quote, bill charges and applying fees. </li><li>Facilitate the pre-op process, including collecting fees and with witness signatures. </li><li>Facilitate the fee quoting process for Botox, fillers, skincare, etc. </li><li>Oversee general facility care, such as ensuring waiting room/exam room/consult room/work areas have proper appearance and neatly maintained, TV and music in waiting area is properly functioning, ensuring no trash in exterior areas or safety hazards, ensuring working order of office equipment, etc.<br/><br/></li></ul><strong>Qualifications &amp; Skills<br/><br/></strong><ul><li>2+ years related administrative experience. Medical office experience required. </li><li>Excellent attention to detail.</li><li>Ability to adjust priorities quickly as circumstances dictate.</li><li>Team-player mentality, wanting to work cohesively with others.</li><li>Ability to maintain composure under pressure.</li><li>Ability to multitask.</li><li>Ability to work autonomously as dictated &amp; make appropriate decisions.</li><li>Proven planning and organizational skills, attention to detail, ability to handle multiple tasks.</li><li>Outstanding written and verbal communication.</li><li>Efficient and accurate in managing multiple phone lines, with knowledge of general phone systems. </li><li>Proficient in data entry and accurate and speedy typing. <br/><br/></li></ul>Wage Range - $19.00/hr - $22.00/hr DOE", "responsibilities": "The Patient Care / Front Office Coordinator will be responsible for accurate management and triaging of messages, capturing and facilitating the needs of the patients, responding to patient inquires, managing patient service & scheduling process, and overall facility care.", "qualifications": {"required": "2+ years related administrative experience. Medical office experience required. \nExcellent attention to detail.\nAbility to adjust priorities quickly as circumstances dictate.\nTeam-player mentality, wanting to work cohesively with others.\nAbility to maintain composure under pressure.\nAbility to multitask.\nAbility to work autonomously as dictated & make appropriate decisions.\nProven planning and organizational skills, attention to detail, ability to handle multiple tasks.\nOutstanding written and verbal communication.\nEfficient and accurate in managing multiple phone lines, with knowledge of general phone systems. \nProficient in data entry and accurate and speedy typing."}, "skills": ["Medical Office", "Administrative", "Communication", "Multitasking", "Organization", "Data Entry", "Phone Systems"], "postedDate": "2 months ago", "url": "https://www.linkedin.com/jobs/view/3976372496"}