{"jobTitle": "Merchandise Planning Analyst", "company": {"name": "BYLT Basics", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst, Strategy/Planning, and Purchasing", "industry": "Retail Apparel and Fashion", "description": "<strong>POSITION SUMMARY </strong><p>As the <strong>Merchandise Planning Analyst</strong>, you will help plan for a rapidly growing multi category Direct to Consumer eCommerce business. This position will work cross functionally with marketing, merchandising and supply chain to analyze &amp; forecast demand, assist in building out our product assortment and support supply chain to issue and track purchase orders inbound. The right candidate has a passion for product and analytics with an entrepreneurial spirit. You’ll be part of a dynamic team that is obsessed with data and influences the day-to-day decisions of the business.</p><p><br/></p><p><br/></p><p><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong></p><ul><li>Assists in creating and maintaining both established and ad hoc reporting.</li><li>Analyzes sales trends and marketing analytics to help build out merchandise categories and go to market strategies.</li><li>Support forecasting demand for all channels ranging from the department, category, style, product and size level</li><li>Works closely with marketing, design and merchandising to build out seasonal buy plans based on historical demand analysis and marketplace trends.</li><li>Places purchase orders to our vendors at the size/sku level on time according to the company calendar.</li><li>Upkeeps and improves on Work in Progress reporting and publishes to key stake</li><li>Help maintain and improve current Open-To-Buy process and help build sales and receipts plans</li><li>Help manage inventory providing insights to slow moving clogs and overpacing positions, willingness to work with the team on inventory strategies</li><li>Open and supportive communication to the team, willing to learn and work together to push growth</li><li>Supporting in quick turn inventory chase purchasing strategies</li><li>Always seeking to find efficiencies and streamline processes within planning and other departments.</li><li>Other duties as assigned.</li></ul><p><br/></p><p><br/></p><p><strong>QUALIFICATIONS &amp; REQUIRED SKILLS </strong></p><ul><li>1-2 years in a business environment, preferably in an analytical or apparel related role</li><li>Economics, Finance, Business or related degree</li><li>Proficient at Excel and can pickup on systems quickly</li><li>Strong quantitative and analytical skills with the ability to interpret and provide insights</li><li>Thrives in a fast-paced, entrepreneurial environment</li><li>ERP experience a plus but not required</li><li>Detail oriented and data driven</li><li>Willingness to learn and motivated personality</li></ul><p><br/></p><p><br/></p><p><strong>PHYSICAL DEMANDS AND WORK ENVIRONMENT </strong></p><p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions. While performing the duties of this position, the employee is regularly required to talk or hear. The employee frequently is required to use hands or fingers, and handle or feel objects, tools, or controls. The employee is occasionally required to stand; walk; sit, and reach with hands and arms. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this position include close vision, distance vision, and the ability to adjust focus. The noise level in the work environment is usually low to moderate. </p><p><br/></p><p><strong>NOTE </strong></p><p> This job description in no way states or implies that these are the only duties to be performed by the employee(s) incumbent in this position. Employees will be required to follow any other job-related instructions and to perform any other job-related duties requested by any person authorized to give instructions or assignments. All duties and responsibilities are essential functions and requirements and are subject to possible modification to reasonably accommodate individuals with disabilities. To perform this job successfully, the incumbents will possess the skills, aptitudes, and abilities to perform each duty proficiently. Some requirements may exclude individuals who pose a direct threat or significant risk to the health or safety of themselves or others. The requirements listed in this document are the minimum levels of knowledge, skills, or abilities. This document does not create an employment contract, implied or otherwise, other than an “at-will” relationship. </p><p> BYLT provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any time without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristics protected by federal, state, or local laws.</p><p> This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.</p><p></p>", "responsibilities": "As the Merchandise Planning Analyst, you will help plan for a rapidly growing multi category Direct to Consumer eCommerce business. This position will work cross functionally with marketing, merchandising and supply chain to analyze & forecast demand, assist in building out our product assortment and support supply chain to issue and track purchase orders inbound. The right candidate has a passion for product and analytics with an entrepreneurial spirit. You’ll be part of a dynamic team that is obsessed with data and influences the day-to-day decisions of the business.", "qualifications": {"required": "1-2 years in a business environment, preferably in an analytical or apparel related role, Economics, Finance, Business or related degree, Proficient at Excel and can pickup on systems quickly, Strong quantitative and analytical skills with the ability to interpret and provide insights, Thrives in a fast-paced, entrepreneurial environment, ERP experience a plus but not required, Detail oriented and data driven, Willingness to learn and motivated personality", "preferred": ""}, "skills": ["Excel", "ERP", "Analytics", "Demand Planning", "Merchandising", "Supply Chain", "Product Management", "Data Analysis", "Business Analysis", "Marketing"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976349736"}