{"jobTitle": "Business Solutions Manager", "company": {"name": "NBCUniversal", "location": "Universal City, CA", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "General Business", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/>Does process simplification and working with the smartest creative talent in the Media &amp; Entertainment industry excite you? Then welcome to your new home. NBCUniversal is looking for a Business Solutions Manager in our Technical Operations team supporting Marketing functions for NBCU’s Media businesses (comprising of Peacock, NBC, USA, SYFY, Bravo, E!, Oxygen, Universal Kids, NBC Sports, and more).<br/><br/>This role involves partnering across teams to establish and support business processes, gather requirements, document needs, capture value stories, and manage projects with a focus. A strong understanding of business analysis, project management, stakeholder management, and business transformation are imperative in this role. The ideal candidate will have a strong analytical mindset, excellent troubleshooting skills, and a passion for customer focus and software.<br/><br/>The individual contributor Business Solutions Manager will work unsupervised on simultaneous priorities and keep their direct manager, the Sr. Director of Marketing Solutions, informed of pertinent updates, blockers, and beyond while ensuring projects are delivered on time.<br/><br/>Serve as the primary business technology point of contact for Photography and Press and Publicity stakeholders, fostering an inclusive mindset for learning and sharing with other brands and colleagues. Lead the evaluation, selection, and implementation of a photography digital asset management (DAM) solution, ensuring it meets the organization's needs and integrates seamlessly with existing systems. Oversee the day-to-day management of the DAM solution and its related websites (such as NBCU MediaVillage which provides press releases, approved photography, and beyond to external users like journalists). This includes user support, system maintenance, and continuous improvement initiatives to enhance functionality, usability, and performance. Collaborate with key stakeholders, including photographers, marketing teams, and IT, to gather and document business requirements, ensuring technical solutions addresses all user needs and operational goals. Establish multi-year technology priorities with input and support from all business stakeholders. Capture and manage current and future state business process maps, along with transformation plans with stakeholder buy-in. Define, quantify, and realize the value of all product enhancements and projects with CFO-level buy-in. Manage business demos and user acceptance testing, communicate notable releases and features, and communicate project statuses to all stakeholders. Align product taxonomies with current and future business needs. Ensure effective and open communication with all business partners (both technical and non-technical) to enable project work and meet business needs and requirements. Work within a matrix organization alongside peer Product Management, Engineering, Content Operations, Program Management, and Portfolio Management teams. Think and work independently, demonstrating creativity to deliver quick and actionable results. Provide occasional off-hours support to address outages, special events, and urgent system issues. All other duties as assigned<br/><br/>Bachelor's degree in Management Information Systems, Computer Science, or a related field or equivalent work experience Minimum of 8 years of relevant work experience, ideally in project management, business analysis, marketing strategy, business relationship management, or content production at a large network, publisher, or agency. Minimum of 6 years of client-facing project management or business analysis experience. Proven experience in selecting, implementing, and managing digital asset management solutions, preferably within the photography or media industry. Proficiency in relevant technologies and software, including DAM systems, metadata standards, and integration tools. Familiarity with content management systems (CMS) and cloud storage solutions is a plus. Strong analytical skills with the ability to identify business needs, analyze complex data, and develop effective solutions to improve asset management processes. Demonstrated experience in requirements analysis and delivery (e.g., conducting user interviews, documenting requirements, confirming requirements, and implementing solutions). Outstanding written and verbal communication skills, with the ability to clearly convey complex technical information to non-technical stakeholders and collaborate effectively with diverse teams. Motivated, self-starter, independent, results-oriented, and professional. Collaborative team player accustomed to working with diverse groups. Energetic and people-oriented with high emotional intelligence. Ability to adapt to changing priorities and requirements, including juggling multiple competing priorities and deadlines. Willingness to travel to other NBCU offices, such as New York, Denver, and London. Ability to manage and resolve competing or conflicting requests and obtain consensus.<br/><br/>Experience in the US Media &amp; Entertainment industry. Understanding of the photography industry, including workflows, file formats, and specific requirements for managing and distributing digital assets. Experience leading change management initiatives, including training and supporting users through the transition to a new DAM solution. Experience with products like Airtable, Workfront, Campaign Monitor, and Digital Asset Management (DAM) systems (MediaValet, Adobe Experience Manager, Global Edit, etc.). Relevant certifications such as Certified Business Analysis Professional (CBAP), Project Management Professional (PMP), or other related credentials that demonstrate expertise and commitment to the field. Ability to think creatively and develop new solutions.<br/><br/>This job is based in LA. This position has been designated as hybrid, generally contributing from the office a minimum of three days per week. This position is eligible for company-sponsored benefits, including medical, dental, and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. <em>Salary range: $130,000 - $160,000 (bonus eligible)<br/><br/></em>NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories, or arrest or conviction records, in a manner consistent with relevant legal requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable. If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "Serve as the primary business technology point of contact for Photography and Press and Publicity stakeholders, fostering an inclusive mindset for learning and sharing with other brands and colleagues. Lead the evaluation, selection, and implementation of a photography digital asset management (DAM) solution, ensuring it meets the organization's needs and integrates seamlessly with existing systems. Oversee the day-to-day management of the DAM solution and its related websites (such as NBCU MediaVillage which provides press releases, approved photography, and beyond to external users like journalists). This includes user support, system maintenance, and continuous improvement initiatives to enhance functionality, usability, and performance. Collaborate with key stakeholders, including photographers, marketing teams, and IT, to gather and document business requirements, ensuring technical solutions addresses all user needs and operational goals. Establish multi-year technology priorities with input and support from all business stakeholders. Capture and manage current and future state business process maps, along with transformation plans with stakeholder buy-in. Define, quantify, and realize the value of all product enhancements and projects with CFO-level buy-in. Manage business demos and user acceptance testing, communicate notable releases and features, and communicate project statuses to all stakeholders. Align product taxonomies with current and future business needs. Ensure effective and open communication with all business partners (both technical and non-technical) to enable project work and meet business needs and requirements. Work within a matrix organization alongside peer Product Management, Engineering, Content Operations, Program Management, and Portfolio Management teams. Think and work independently, demonstrating creativity to deliver quick and actionable results. Provide occasional off-hours support to address outages, special events, and urgent system issues. All other duties as assigned", "qualifications": {"required": "Bachelor's degree in Management Information Systems, Computer Science, or a related field or equivalent work experience Minimum of 8 years of relevant work experience, ideally in project management, business analysis, marketing strategy, business relationship management, or content production at a large network, publisher, or agency. Minimum of 6 years of client-facing project management or business analysis experience. Proven experience in selecting, implementing, and managing digital asset management solutions, preferably within the photography or media industry. Proficiency in relevant technologies and software, including DAM systems, metadata standards, and integration tools. Familiarity with content management systems (CMS) and cloud storage solutions is a plus. Strong analytical skills with the ability to identify business needs, analyze complex data, and develop effective solutions to improve asset management processes. Demonstrated experience in requirements analysis and delivery (e.g., conducting user interviews, documenting requirements, confirming requirements, and implementing solutions). Outstanding written and verbal communication skills, with the ability to clearly convey complex technical information to non-technical stakeholders and collaborate effectively with diverse teams. Motivated, self-starter, independent, results-oriented, and professional. Collaborative team player accustomed to working with diverse groups. Energetic and people-oriented with high emotional intelligence. Ability to adapt to changing priorities and requirements, including juggling multiple competing priorities and deadlines. Willingness to travel to other NBCU offices, such as New York, Denver, and London. Ability to manage and resolve competing or conflicting requests and obtain consensus.", "preferred": "Experience in the US Media &amp; Entertainment industry. Understanding of the photography industry, including workflows, file formats, and specific requirements for managing and distributing digital assets. Experience leading change management initiatives, including training and supporting users through the transition to a new DAM solution. Experience with products like Airtable, Workfront, Campaign Monitor, and Digital Asset Management (DAM) systems (MediaValet, Adobe Experience Manager, Global Edit, etc.). Relevant certifications such as Certified Business Analysis Professional (CBAP), Project Management Professional (PMP), or other related credentials that demonstrate expertise and commitment to the field. Ability to think creatively and develop new solutions."}, "skills": ["Digital Asset Management", "Project Management", "Business Analysis", "Marketing Strategy", "Business Relationship Management", "Content Production", "Client-Facing", "Requirements Analysis", "Communication", "Teamwork", "Emotional Intelligence", "Change Management", "Airtable", "Workfront", "Campaign Monitor", "MediaValet", "Adobe Experience Manager", "Global Edit", "CBAP", "PMP"], "postedDate": "2 weeks ago", "salary": {"amount": "130,000 - 160,000", "currency": "USD"}, "benefits": "This position is eligible for company-sponsored benefits, including medical, dental, and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977983927"}