{"jobTitle": "Dental Office Supervisor", "company": {"name": "Optimize Practice Alliance", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Hospitals and Health Care", "description": "<strong>About The Company<br/><br/></strong>At Tarzana Smile Center, we are dedicated to crafting beautiful smiles and fostering a warm, welcoming environment for our patients. As a leading dental practice in Tarzana, we strive to deliver exceptional dental care tailored to the unique needs and preferences of each individual.<br/><br/>Our team is comprised of highly skilled and compassionate professionals who share a collective passion for enhancing oral health and overall well-being. We believe that a healthy smile not only brightens your face but also positively impacts your quality of life.<br/><br/>With state-of-the-art technology and a patient-centric approach, we offer a comprehensive range of dental services, including preventive care, cosmetic dentistry, restorative treatments, and more. Our commitment goes beyond treatments; it's about building lasting relationships based on trust, transparency, and personalized care.<br/><br/>At Tarzana Smile Center, we value continuous growth and learning, staying updated with the latest advancements in dentistry to provide our patients with the best possible care. We invite you to join our dynamic team where your skills, enthusiasm, and dedication to patient care will be valued and nurtured.<br/><br/>If you're looking to be part of a practice that prioritizes excellence, patient satisfaction, and a positive work environment, Tarzana Smile Center is the place for you. Join us as we create smiles that radiate confidence and happiness in our community.<br/><br/><strong>Description<br/><br/></strong>The Office Supervisor is responsible for the supervision of the overall workflow throughout the office. Their job is to administer the day-to-day activities of the business including but not limited to patient and employee relations, staff interviewing/dismissal, management of marketing and communications efforts, regulatory compliance, staff training &amp; motivation. The office manager will ensure that the highest quality work standards are maintained along with planning the overall workload, communication, and adherence to the practice's policies and procedures.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>AA/BA Degree or equivalent work experience (essential) </li><li>Possess knowledge of dental terminology. </li><li>Understand and comply with licensing and continuing education requirements for professional staff. </li><li>Understand and comply with dental office HIPAA and OSHA compliance. </li><li>Excellent interpersonal, oral, and written communication skills <br/><br/></li></ul><strong>Essential Functions<br/><br/></strong><ul><li>Express ideas and information in written form clearly, succinctly, accurately, and in an organized manner; </li><li>Manage day-to-day operations of the dental office. </li><li>Manage and direct staff assignments and activities in accordance with office policy and applicable laws. </li><li>Manage compliance with OSHA, HIPAA, state and federal regulations, and patient financial accounts. </li><li>Manage and oversee timely patient billing and collections processes. </li><li>Ensure that records are securely stored and handled in compliance with HIPAA regulations. </li><li>Update and maintain employee personnel manuals. </li><li>Review and display any posters required by federal, state, and local law. Ensure that all mandatory office policies and procedures are reviewed and followed by staff. </li><li>Manage and oversee patient relations and handle patient grievances. </li><li>Coordinate team meetings, trainings, and staff schedules. </li><li>Lead daily morning huddles. </li><li>Build consensus among individuals or groups by resolving conflicts, confrontations, and disagreements while maintaining productive working relationships. </li><li>Motivate, inspire, and influence others towards effective individual or team performance, goal attainment, and personal learning and development by serving as a mentor, coach, and role model and by providing feedback and recognition. </li><li>Manage staff performance and reviews. </li><li>Manage the interview and hiring process as directed. </li><li>Interpret and communicate work procedures and company policies to staff.  </li><li>Research, compile, and prepare reports, manuals, correspondence, or other information required by office or governmental agencies.  <br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee may be regularly required to sit for long periods of time. While performing the duties of this job, the employee is required to do detailed work, using arms, hands, and fingers to handle and feel objects associated with work. The employee intermittently is required to sit, stand, walk, stoop, bend or reach throughout the day. Good hand-eye coordination and manual dexterity is needed.<br/><br/> ", "responsibilities": "The Office Supervisor is responsible for the supervision of the overall workflow throughout the office. Their job is to administer the day-to-day activities of the business including but not limited to patient and employee relations, staff interviewing/dismissal, management of marketing and communications efforts, regulatory compliance, staff training &amp; motivation. The office manager will ensure that the highest quality work standards are maintained along with planning the overall workload, communication, and adherence to the practice's policies and procedures.", "qualifications": {"required": "AA/BA Degree or equivalent work experience (essential) \nPossess knowledge of dental terminology. \nUnderstand and comply with licensing and continuing education requirements for professional staff. \nUnderstand and comply with dental office HIPAA and OSHA compliance. \nExcellent interpersonal, oral, and written communication skills ", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977160977"}