{"jobTitle": "Executive Assistant to VP of Development", "company": {"name": "J. Paul Getty Trust", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "68,883.00/yr - 91,271.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Museums, Historical Sites, and Zoos", "description": "Diversity, Equity, Accessibility, and Inclusion at Getty <br/><br/>Getty believes diversity, equity, accessibility, and inclusion are essential to our excellence and to the execution of our mission. The Getty community values differences in the pursuit of inquiry and knowledge, mutual understanding, respect, trust, transparency, and cooperation. We are committed to creating a welcoming workplace that reflects the various backgrounds of the communities we serve and includes individuals who bring a diversity of values and experiences. Individuals of color, women, LGBTQIA+, veterans, and persons with disabilities are encouraged to apply.<br/><br/>Job Summary<br/><br/>The Executive Assistant provides high-level administrative support to the Vice President of Development, including scheduling meetings, managing daily calendars, and other administrative responsibilities. The EA also oversees overall departmental needs such as organizing departmental meetings, onboarding new team members, disseminating important information, etc.<br/><br/>Major Job Responsibilities<br/><br/><ul><li>Administers operations of the VP of Development's office, which may include supervising staff, managing electronic information systems, and resolving complex departmental problems. </li><li>Analyzes operations and prepares reports, including conclusions and recommendations for change. </li><li>Prepares VP for meetings, including collecting and presenting information for use in discussions/meetings with President, senior leadership, trustees, visiting dignitaries, and donors. </li><li>Manages high priority projects and ensures deadlines are met. </li><li>Prepares written communications on behalf of the VP, and reviews/edits correspondence, reports, and departmental communications. </li><li>Assists in public relations and other activities as assigned, including coordinating planning and logistics for donor meetings and VIP visits and providing support for Development event activities. </li><li>Manages a wide variety of projects on behalf of supervisor or program, including monitoring progress and apprising appropriate individuals of progress toward established goals. Follows through with colleagues throughout Getty and outside the organization. </li><li>Assists in development, preparation, and delivery of reports, publications, presentations, and official correspondence. </li><li>Assists in preparation of materials for quarterly Board Committee meeting. </li><li>Arranges VP travel as needed - local, national, and international. </li><li>Exercises considerable discretion and judgment so as to schedule priorities and effective use of the VP’s time while adhering to Getty business policies. </li><li>Manages and accesses sensitive information, including email and other electronic information. Must exercise high level of discretion and sound judgment. </li><li>Uses Raiser's Edge database software (training provided) to access information and track donor stewardship, solicitation, and engagement. </li><li>Preparation and submission of expense reports, with adherence to Getty business policies. </li><li>Perform other duties and responsibilities as assigned. <br/><br/></li></ul>Qualifications<br/><br/><ul><li>Bachelor's degree</li><li>5-7 years of related experience, preferably with 5+ years in a cultural or educational organization<br/><br/></li></ul>Knowledge, Skills And Abilities<br/><br/><ul><li>High level of professionalism, employing tact, discretion, diplomacy, awareness, and exemplary judgement. </li><li>Proactive self-starter with initiative. Ability to maintain calm, positive demeanor in a frequently high-paced work environment. Creative problem-solver; thinks on their feet. </li><li>Strong communications skills, both written and verbal, with high-level of attention to details. Strong editing and research skills. </li><li>Ability to develop and maintain effective working relationships with individuals at all levels of the organization as well as external contacts. </li><li>Advanced computer skills and demonstrated experience with office software and email applications. </li><li>Demonstrated success in planning, organizing, and completing projects. </li><li>Ability to effectively prioritize and assign work to others. <br/><br/></li></ul>Benefits And Perks<br/><br/>Here are just some examples that Getty offers/provides for full-time employees:<br/><br/><ul><li>Medical, Dental and Vision insurance coverage, starting on date of hire. Getty pays 75%-95% of the premium, depending on the plan selected. </li><li>403(b) Employee Investment retirement plan – with up to 5% Getty Match</li><li>Getty contribution of 6%, on behalf of employee, to 401(a) retirement account</li><li>Educational Assistance and professional development</li><li>Paid Vacation, Sick and Personal Days</li><li>12 Paid Holidays</li><li>Many positions have bi-weekly Off-Fridays</li><li>On-Site Fitness Center at Getty Center</li><li>Community service opportunities<br/><br/></li></ul>To learn more about our comprehensive benefits and long list of perks, go to <strong> Getty HR </strong>.<br/><br/>Equal Opportunity Employer <br/><br/>We are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship or immigration status, color, disability, ethnicity, familial status, gender identity and/or expression, genetic information, marital status, national origin, race, religion, sex, sexual orientation, veteran status, or any other protected status.", "responsibilities": "Administers operations of the VP of Development's office, which may include supervising staff, managing electronic information systems, and resolving complex departmental problems. Analyzes operations and prepares reports, including conclusions and recommendations for change. Prepares VP for meetings, including collecting and presenting information for use in discussions/meetings with President, senior leadership, trustees, visiting dignitaries, and donors. Manages high priority projects and ensures deadlines are met. Prepares written communications on behalf of the VP, and reviews/edits correspondence, reports, and departmental communications. Assists in public relations and other activities as assigned, including coordinating planning and logistics for donor meetings and VIP visits and providing support for Development event activities. Manages a wide variety of projects on behalf of supervisor or program, including monitoring progress and apprising appropriate individuals of progress toward established goals. Follows through with colleagues throughout Getty and outside the organization. Assists in development, preparation, and delivery of reports, publications, presentations, and official correspondence. Assists in preparation of materials for quarterly Board Committee meeting. Arranges VP travel as needed - local, national, and international. Exercises considerable discretion and judgment so as to schedule priorities and effective use of the VP’s time while adhering to Getty business policies. Manages and accesses sensitive information, including email and other electronic information. Must exercise high level of discretion and sound judgment. Uses Raiser's Edge database software (training provided) to access information and track donor stewardship, solicitation, and engagement. Preparation and submission of expense reports, with adherence to Getty business policies. Perform other duties and responsibilities as assigned.", "qualifications": {"required": "Bachelor's degree, 5-7 years of related experience, preferably with 5+ years in a cultural or educational organization", "preferred": "High level of professionalism, employing tact, discretion, diplomacy, awareness, and exemplary judgement. Proactive self-starter with initiative. Ability to maintain calm, positive demeanor in a frequently high-paced work environment. Creative problem-solver; thinks on their feet. Strong communications skills, both written and verbal, with high-level of attention to details. Strong editing and research skills. Ability to develop and maintain effective working relationships with individuals at all levels of the organization as well as external contacts. Advanced computer skills and demonstrated experience with office software and email applications. Demonstrated success in planning, organizing, and completing projects. Ability to effectively prioritize and assign work to others."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Medical, Dental and Vision insurance coverage, starting on date of hire. Getty pays 75%-95% of the premium, depending on the plan selected. 403(b) Employee Investment retirement plan – with up to 5% Getty Match Getty contribution of 6%, on behalf of employee, to 401(a) retirement account Educational Assistance and professional development Paid Vacation, Sick and Personal Days 12 Paid Holidays Many positions have bi-weekly Off-Fridays On-Site Fitness Center at Getty Center Community service opportunities", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3977044097"}