{"jobTitle": "Replenishment Analyst", "company": {"name": "REVOLVE", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "Meet REVOLVE<br/><br/>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand, and a go-to online source for discovery and inspiration, we deliver an engaging customer experience from a vast yet curated offering totaling over 45,000 apparel, footwear, accessories and beauty styles. Our dynamic platform connects a deeply engaged community of millions of consumers, thousands of global fashion influencers, and more than 500 emerging, established and owned brands. Through 16 years of continued investment in technology, data analytics, and innovative marketing and merchandising strategies, we have built a powerful platform and brand that we believe is connecting with the next generation of consumers and is redefining fashion retail for the 21st century. For more information please visit www.revolve.com.<br/><br/>At REVOLVE the most successful team members have a thirst and the creativity to make this the top e-commerce brand in the world. With a team of 1,000+ based out of Cerritos, California we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment. In return, we promise to keep REVOLVE a company where inspired people will always thrive.<br/><br/>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or .<br/><br/>Are you ready to set the standard for Premium apparel?<br/><br/>Main Purpose Of The Replenishment Analyst Role<br/><br/>The Replenishment Analyst is a critical role in the Merchandising Planning arm of the organization that is responsible for maximizing sales and driving top-line growth by ensuring optimal inventory levels of best-selling products at all times. They will be responsible for utilizing industry-leading, data-driven algorithms, techniques, and strategies to ensure proper decision-making.<br/><br/>The ideal candidate for the Replenishment Analyst position will be thorough, detail-oriented, and possess strong analytical skills. They will be a collaborative team player who is able to understand the big picture, effectively communicate findings, and is also able to roll up their sleeves and execute at the micro level. Their strong drive and curiosity makes them a self-starter who can execute strategic change and consistently deliver results.<br/><br/>Major Responsibilities<br/><br/>Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Execute replenishment strategies to support sales, inventory, and on order trends in order to maximize sales opportunities while optimizing turns and minimizing risk</li><li> Monitor demand planning algorithms and processes to maintain the feedback loop for identifying opportunities to continuously improve forecasting accuracy and results</li><li> Maintain ideal inventory levels in order to maximize in-stock rates while minimizing markdowns</li><li> Ensure constant communication flow and collaboration with Planning and Buying Teams by sharing recaps, insightful analyses, and opportunities<br/><br/></li></ul>Required Competencies<br/><br/>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/><ul><li> Strong aptitude with numbers and clear understanding of retail math</li><li> Strong organizational skills - ability to manage multiple projects, prioritize, and meet deadlines and to keep abreast of current and future fashion trends</li><li> Ability to communicate persuasively, influentially, and responsibly across a cross-functional team</li><li> Excels in team environments and in building / developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals</li><li> Ability to demonstrate logical thinking and problem-solving skills multi-tasking, time management, self-motivation, persistence, and takes full ownership of their success</li><li> Advanced knowledge and understanding of Microsoft Excel and Office Suite<br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li> 3-5 years of quantitative analytical experience with a proven track record of achieving successful results from data-oriented decision-making</li><li> Solid experience with designing and building Excel spreadsheet models</li><li> Bachelor’s Degree or Master’s Degree required<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li> E-commerce apparel experience</li><li> SQL experience a plus</li><li> Interest and knowledge in contemporary, aspiring-luxury, and luxury fashion<br/><br/></li></ul>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day.<br/><br/>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.<br/><br/>A reasonable estimate of the current base salary range is $70K-80K a year.<br/><br/>Attention<br/><br/>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.<br/><br/>The following job description contains representative examples of work that will be performed in positions allocated to this classification. It is not required that any position perform all of the duties listed, so long as primary responsibilities are consistent with the work as described. Roles and responsibilities can often be expanded to accommodate changing business conditions and goals, as well as to tap into the skills and talents of the individuals in the company. Accordingly, associates may be asked to perform duties that are outside the specific functions that are listed.", "responsibilities": "Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Execute replenishment strategies to support sales, inventory, and on order trends in order to maximize sales opportunities while optimizing turns and minimizing risk</li><li> Monitor demand planning algorithms and processes to maintain the feedback loop for identifying opportunities to continuously improve forecasting accuracy and results</li><li> Maintain ideal inventory levels in order to maximize in-stock rates while minimizing markdowns</li><li> Ensure constant communication flow and collaboration with Planning and Buying Teams by sharing recaps, insightful analyses, and opportunities<br/><br/></li></ul>", "qualifications": {"required": "Strong aptitude with numbers and clear understanding of retail math, Strong organizational skills - ability to manage multiple projects, prioritize, and meet deadlines and to keep abreast of current and future fashion trends, Ability to communicate persuasively, influentially, and responsibly across a cross-functional team, Excels in team environments and in building / developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals, Ability to demonstrate logical thinking and problem-solving skills multi-tasking, time management, self-motivation, persistence, and takes full ownership of their success, Advanced knowledge and understanding of Microsoft Excel and Office Suite, 3-5 years of quantitative analytical experience with a proven track record of achieving successful results from data-oriented decision-making, Solid experience with designing and building Excel spreadsheet models, Bachelor’s Degree or Master’s Degree required", "preferred": "E-commerce apparel experience, SQL experience a plus, Interest and knowledge in contemporary, aspiring-luxury, and luxury fashion"}, "skills": ["Retail Math", "Microsoft Excel", "Data Analysis", "Communication", "Teamwork", "Problem Solving", "Time Management", "Self-Motivation", "SQL"], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977518376"}