{"jobTitle": "Clinical Research Coordinator", "company": {"name": "Parexel", "industry": "Pharmaceutical Manufacturing", "size": "Not specified", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$28.00 to $33.00", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Pharmaceutical Manufacturing", "description": "Join Parexel’s team of changemakers as we help advance healthcare throughout the globe, all while keeping the patient at the heart of everything we do. Job Title: Clinical Research Coordinator. Job Introduction: As a Clinical Research Coordinator, you will execute and coordinate a variety of specialized clinical research activities within the Early Phase Clinical Unit (EPCU), ensuring that assigned protocols are executed with high quality, and Standard Operating Procedures (SOPs) and GCP/ICH guidelines are followed. Primary responsibilities for assigned trials include development of clinical execution strategies, management of source data collection and coordination of core study team (medical, pharmacy, laboratory, enrollment).", "responsibilities": "Review and understand the study protocol, proactively seeking to identify and address questions and operational risks with Project Manager and/or sponsor to ensure successful execution of studies. Responsible for study resource allocation, maintaining timely resource requests and optimizing efficient and effective planning and utilization of resources. Responsible for ensuring study team training compliance with protocol and any other study procedure/task required trainings, arranging and providing trainings as appropriate to ensure study team members are oriented and understand tasks to be performed. Responsible for establishing and ensuring timelines relating to area of responsibility are met. Responsible for data quality and protocol compliance excellence demonstrated in study start up, execution, and closeout through accuracy in ClinBase or paper source, ensuring source data entry completeness and adherence to GCP, meeting study timelines. Responsible for ensuring procedure coverage and task execution, coordinating with other departments to optimize efficiency in execution. Responsible for creating study specific paperwork and or materials as needed. Communicates with physicians and relevant Clinical Staff in evaluating study participant status. Responsible for monitoring study participant test results, including but not limited to Adverse Events, laboratory, vitals, ECG, and other procedure results, escalating any protocol, safety or other concerns as appropriate to medical group and management. Responsible for oversight with monitors, proactively seeking to ensure preparation for the visit with study materials, establishing study team presence and coverage, to expedite and address query, question and or issue resolution as soon as possible. Responsible for overseeing clinical trial volunteers according to protocol specific requirements and CFR/ICH GCP guidelines. Ensure all study laboratory and medical tests are completed and the eligibility requirements specific to assigned studies are met. Oversee study data entry and QC, ensuring sponsor timelines are upheld through timely data entry, query resolution, and data transfers, communicating updates to PM. Oversees study team to ensure Glendale Medical Adventist Center (GAMC) subject requirements for dietary, admission and safety are collected and provided to GAMC in a timely manner. Assumes other duties and responsibilities as assigned. The above responsibilities are a general description of the level and nature of the work assigned to this classification and is not to be considered as all inclusive.", "qualifications": {"required": "Clinical Research Coordinator experience required. Experience working on early phase trials preferably at the site level. Preferred knowledge of the following systems: VeevaVault and Medidata. Proven capability to work in a fast-paced environment with effective time management of multiple tasks and prioritizing workload as needed. Bachelor's or Master's degree in health sciences highly preferred or applicable experience. Ability to work onsite in Glendale, CA M-F (occasional weekends might be required).", "preferred": ""}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "Not specified", "benefits": "Health, Vision & Dental Insurance, Tuition Reimbursement, Vacation/Holiday/Sick Time, Flexible Spending & Health Savings Accounts, Work/Life Balance, 401(k) with Company match, Pet Insurance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3977328980"}