{"jobTitle": "General Service Manager", "company": {"name": "Quinn Company", "industry": "Machinery Manufacturing", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "131,040.00/yr - 164,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Machinery Manufacturing", "description": "<strong>Overview<br/><br/></strong>Quinn Company, your local Caterpillar store, is hiring a General Service Manager in City of Industry, California. This position can work from either City of Industry or Riverside, California.<br/><br/>Quinn Company is a Caterpillar dealership founded in 1919. The company sells, services, and rents a full line of new and used construction, agricultural, and material handling equipment, diesel and natural gas engines.<br/><br/>As a Caterpillar Dealership, Quinn Company enjoys a unique ability to be a nimble company with entrepreneurial spirit and leverage the global reach and support of a Fortune 50 company… local and global at the same time.<br/><br/>Quinn Company ranks among the top performing Caterpillar Dealers in the world. This competitive, performance based drive is the foundation of the company’s culture.<br/><br/>The General Service Manager for Power Systems is responsible for all of the power service operations across the Metro Region of Quinn’s territory. They will set the strategic direction for service in the territory and have full P&amp;L responsibility for the service results. As a senior member of the Power Systems leadership team, the General Service Manager will be expected to collaborate with their peers in regular leadership meetings with Sales, Rental and Operations.<br/><br/>Wages<br/><br/>Starting wage will depend on experience and education.$131,040 to $174,000<br/><br/><strong>Responsibilities<br/><br/></strong>Essential duties and responsibilities include the following. Other duties may be assigned.<br/><br/><br/><ul><li> Responsible for the overall financial performance that includes budgets and capital expenditures. </li><li> Provide leadership direction to the Regional Service Managers, Service Managers and the overall service department. Communicate and effectively influence direct reports to develop good working relationships and teamwork. </li><li> Communicate understanding and support of Quinn’s organizational goals. Interact effectively with individuals and groups throughout the company. Develop and maintain working relationships with departments and sister business units in order to improve the overall company performance. </li><li> Responsible for employee satisfaction utilizing turn-over metric, employee surveys and developing successful action plans. </li><li> Aligns, partners, and collaborates with assigned HR representative to proactively manage staffing, workforce development, employee communication, employee relations and support / develop business unit objectives. </li><li> Maintain customer satisfaction with timely and accurate communication. Communicate with service customers, analyze service needs and review quotes when required. </li><li> Mentor, coach and develop Service Supervisors, Coordinators, Technical staff and other direct and indirect reports as required. </li><li> Provide goals and objectives including a training and development plan for all direct reports. </li><li> Provide decision-making support to supervisors, coordinators and technicians in the analysis and resolution of product support issues. </li><li> Effectively analyze and proactively seek out all options to provide the best solution for the customers and Quinn. </li><li> Elevate customer or product support issues to Vice President of Power Systems when appropriate. </li><li> Responsible and accountable for maintaining and promoting a safe work environment. Promote a Safety First culture and zero incident workplace. Identify and ensure all necessary safety training is performed in accordance with all regulatory requirements and industry best practices. </li><li> Demonstrate and promote Quinn Company core values of Integrity, Teamwork, Safety, Respect, Relationships, Quality and Service. </li><li> Travel to various branch operations in the region on a regular basis to meet with staff and develop relationships with other branch personnel. </li><li> Demonstrate full competency and knowledge of the products we support and the services we provide. <br/><br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>Overall supervision of entire service territory in the Power Systems department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance using the PADS process; rewarding and disciplining employees; addressing complaints and resolving problems.<br/><br/><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>EDUCATION And/or EXPERIENCE<br/><br/></strong>Bachelor’s degree or Mechanical discipline preferred and seven to ten years of power systems service management experience or equivalent combination of education and experience. Experience to include management/supervisory, computer skills, and general mechanical and electrical aptitude and service capabilities.<br/><br/><strong>Language Skills<br/><br/></strong>Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively with customers or employees of organization.<br/><br/><strong>Mathematical Skills<br/><br/></strong>Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to interpret bar graphs.<br/><br/><strong>REASONING ABILITY<br/><br/></strong>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.<br/><br/><strong>Problem Solving<br/><br/></strong>Identifies and resolves problems in a timely manner; Gathers and analyzes information skillfully; Develops alternative solutions; Focuses on solving conflict, not blaming; Maintains confidentiality; Listens to others without interrupting; Keeps emotions under control; Remains open to others' ideas and tries new things; Works well in group problem solving situations; Uses reason even when dealing with emotional topics; Manages difficult or emotional customer situations; Responds promptly to customer and employee needs; Solicits employee feedback to improve service; Responds to requests for service and assistance; Meets commitments.<br/><br/><strong>Project Management<br/><br/></strong>Develops project plans; Coordinates projects; Communicates changes and progress; Completes projects on time and budget; Manages project team activities; Sets and achieves challenging goals; Demonstrates persistence and overcomes obstacles; Measures self against standard of excellence; Takes calculated risks to accomplish goals; Uses time efficiently; Sets goals and objectives; Develops realistic action plans.<br/><br/><strong>Technical Skills<br/><br/></strong>Pursues training and development opportunities; Strives to continuously build knowledge and skills; Shares expertise with others; Understands business implications of decisions; Demonstrates knowledge of market and competition; Aligns work with strategic goals.<br/><br/><strong>Communication<br/><br/></strong>Speaks clearly and persuasively in positive or negative situations; Listens and gets clarification; Responds well to questions; Participates in meetings; Writes clearly and informatively; Edits work for spelling and grammar; Varies writing style to meet needs; Able to read and interpret written information.<br/><br/><strong>Teamwork<br/><br/></strong>Balances team and individual responsibilities; Exhibits objectivity and openness to others' views; Gives and welcomes feedback; Contributes to building a positive team spirit; Puts success of team above own interests. Gives authority to work independently; Sets expectations and monitors delegated activities; Provides recognition for results.<br/><br/><strong>Visionary Leadership<br/><br/></strong>Inspires respect and trust; mobilizes others to fulfill the vision; Provides vision and inspiration to peers and subordinates. Develops workable implementation plans; Communicates changes effectively; Builds commitment and overcomes resistance; Prepares and supports those affected by change; Monitors transition and evaluates results; Effectively influences actions and opinions of others; Accepts feedback from others; Ads value by discovering ways to improve and promote quality.<br/><br/><strong>Ethics<br/><br/></strong>Keeps commitments; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values; Supports affirmative action and respects diversity.<br/><br/><strong>Strategic Thinking<br/><br/></strong>Understands business unit goals and objectives. Develops HR solutions and strategies in partnership with business unit to support organizational objectives and to take advantage of developing opportunities and changing market conditions; Displays willingness to make decisions; Includes appropriate people in decision-making process; Makes timely decisions.<br/><br/><strong>Professionalism<br/><br/></strong>Approaches others in a tactful manner; Reacts well under pressure; Treats others with respect and consideration regardless of their status or position; Accepts responsibility for own actions; Follows through on commitments.<br/><br/><strong>Adaptability<br/><br/></strong>Adapts to changes in the work environment; Manages competing demands; Able to deal with frequent change, delays, or unexpected events.<br/><br/><strong>Dependability<br/><br/></strong>Follows instructions, responds to management direction; Takes responsibility for own actions; Keeps commitments; Commits to long hours of work when necessary to reach goals. Completes tasks on time or notifies appropriate person with an alternate plan.<br/><br/><strong>Initiative<br/><br/></strong>Undertakes self-development activities; Looks for and takes advantage of opportunities; Asks for and offers help when needed; Looks for ways to improve and promote quality; Applies feedback to improve performance.<br/><br/><strong> CERTIFICATES, LICENSES, REGISTRATIONS <br/><br/></strong>None required.<br/><br/><strong> PHYSICAL DEMANDS <br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is regularly required to walk and talk or hear. The employee is occasionally required to sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl<br/><br/><strong> WORK ENVIRONMENT <br/><br/></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is regularly exposed to moving mechanical parts, fumes or airborne particles, toxic or caustic chemicals, and outside weather conditions. The employee is frequently exposed to wet and/or humid conditions, extreme cold, and extreme heat. The employee is occasionally exposed to risk of electrical shock and vibration. The noise level in the work environment is usually loud.<br/><br/>Quinn is an Equal Opportunity Employer M/F/V/DV<br/><br/>Quinn Group, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, age, national origin, physical or mental disability, all applicable veteran status or disabled veteran status. Quinn Group, Inc. has established an Affirmative Action Plan to promote the employment and advancement of members of those covered groups identified by statute and regulations, including minorities, women, qualified disabled individuals and all Veterans and disabled Veterans<br/><br/>", "responsibilities": "Essential duties and responsibilities include the following. Other duties may be assigned.<br/><br/><br/><ul><li> Responsible for the overall financial performance that includes budgets and capital expenditures. </li><li> Provide leadership direction to the Regional Service Managers, Service Managers and the overall service department. Communicate and effectively influence direct reports to develop good working relationships and teamwork. </li><li> Communicate understanding and support of Quinn’s organizational goals. Interact effectively with individuals and groups throughout the company. Develop and maintain working relationships with departments and sister business units in order to improve the overall company performance. </li><li> Responsible for employee satisfaction utilizing turn-over metric, employee surveys and developing successful action plans. </li><li> Aligns, partners, and collaborates with assigned HR representative to proactively manage staffing, workforce development, employee communication, employee relations and support / develop business unit objectives. </li><li> Maintain customer satisfaction with timely and accurate communication. Communicate with service customers, analyze service needs and review quotes when required. </li><li> Mentor, coach and develop Service Supervisors, Coordinators, Technical staff and other direct and indirect reports as required. </li><li> Provide goals and objectives including a training and development plan for all direct reports. </li><li> Provide decision-making support to supervisors, coordinators and technicians in the analysis and resolution of product support issues. </li><li> Effectively analyze and proactively seek out all options to provide the best solution for the customers and Quinn. </li><li> Elevate customer or product support issues to Vice President of Power Systems when appropriate. </li><li> Responsible and accountable for maintaining and promoting a safe work environment. Promote a Safety First culture and zero incident workplace. Identify and ensure all necessary safety training is performed in accordance with all regulatory requirements and industry best practices. </li><li> Demonstrate and promote Quinn Company core values of Integrity, Teamwork, Safety, Respect, Relationships, Quality and Service. </li><li> Travel to various branch operations in the region on a regular basis to meet with staff and develop relationships with other branch personnel. </li><li> Demonstrate full competency and knowledge of the products we support and the services we provide. <br/><br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>Overall supervision of entire service territory in the Power Systems department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance using the PADS process; rewarding and disciplining employees; addressing complaints and resolving problems.", "qualifications": {"required": "Bachelor’s degree or Mechanical discipline preferred and seven to ten years of power systems service management experience or equivalent combination of education and experience. Experience to include management/supervisory, computer skills, and general mechanical and electrical aptitude and service capabilities.", "preferred": "Bachelor’s degree or Mechanical discipline preferred and seven to ten years of power systems service management experience or equivalent combination of education and experience. Experience to include management/supervisory, computer skills, and general mechanical and electrical aptitude and service capabilities."}, "skills": ["Problem Solving", "Project Management", "Technical Skills", "Communication", "Teamwork", "Visionary Leadership", "Ethics", "Strategic Thinking", "Professionalism", "Adaptability", "Dependability", "Initiative"], "postedDate": "1 month ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3977409151"}