{"jobTitle": "Excel Spreadsheet Specialist for Payroll, Benefits, and Human Resources", "company": {"name": "The Matian Firm, APC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.00-26.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Technology, Information and Internet", "description": "Our office in Los Angeles is actively looking to hire an experienced Excel Spreadsheet Specialist that will be servicing our Payroll, Benefits, and Human Resources departments. This position must be staffed by an individual who is trustworthy, organized and works well with people. Discretion and integrity are top priorities. <strong>The ideal candidate for this role must be able to interpret existing and incoming data using statistical techniques on excel to provide continual reporting to department leads. Identify, analyze, and interpret trends and patterns in complex data sets on Excel. Experience in the area of Payroll and Benefits is highly preferred.<br/><br/></strong>RESPONSIBILITIES:<br/><br/><ul><li>Participate in the auditing and processing of payroll forms, records and documents.</li><li>Expertise level of familiarity with computerized charting programs to produce spreadsheet reports.</li><li>Participate in creating reports related to payroll, employee information, time sheets, benefits, salaries, leave, taxes, deductions, payments and other assigned duties; review, evaluate and audit payroll, health benefit changes and related financial and statistical reports.</li><li>Servicing the departments by creating reports and spreadsheets that allow reconciliation.</li><li>Utilizing Excel to create complex formulas and functions to analyze data</li><li>Auditing data to extract valuable insights and support decision-making processes.</li><li>Responsible for creating reports and visualizations to communicate your findings to departments</li><li>Participate in auditing of manual and automated payroll data, information, records and reports; ensure accuracy and completeness of payroll transactions.</li><li>Controller must the company's reported financial results and that they comply with generally accepted accounting principles<br/><br/></li></ul>QUALIFICATIONS:<br/><br/><ul><li>Advanced knowledge of Excel with possessing the ability to use spreadsheets, graphing, tables, calculations, and automation efficiently to process large quantities of data relevant to business tasks.</li><li>At least 6 months of experience with Payroll and Benefits.</li><li>Solid written and verbal communication skills.</li><li>Ability to analyze data sets and communicate analytics to interpret data findings.</li><li>Multitasking and time-management skills, with the ability to prioritize tasks.</li><li>Auditing and reporting functions to ensure proper calculation and reporting of payroll data, benefits and taxes.</li><li>Strongly skilled in data manipulation from multiple databases and integrating information from all accounts.<br/><br/></li></ul><strong>Salary: $24.00-$26.00 per hour <br/><br/></strong>Here at the Matian Firm, <strong>we offer benefits (medical, dental and vision insurance), an excellent compensation package, paid parking, paid time off, and more! </strong>Come work as an Excel Spreadsheet Specialist at a growing firm with opportunities to advance and learn alongside a team of professionals within' the legal industry. Apply now!<br/><br/>The Matian Firm, APC is an equal employment opportunity employer, and we welcome everyone regardless of their race, color, religion, sex, national origin, age, disability, veteran status or genetics. We're dedicated to providing an inclusive, open, and diverse work environment.", "responsibilities": "Participate in the auditing and processing of payroll forms, records and documents. Expertise level of familiarity with computerized charting programs to produce spreadsheet reports. Participate in creating reports related to payroll, employee information, time sheets, benefits, salaries, leave, taxes, deductions, payments and other assigned duties; review, evaluate and audit payroll, health benefit changes and related financial and statistical reports. Servicing the departments by creating reports and spreadsheets that allow reconciliation. Utilizing Excel to create complex formulas and functions to analyze data Auditing data to extract valuable insights and support decision-making processes. Responsible for creating reports and visualizations to communicate your findings to departments Participate in auditing of manual and automated payroll data, information, records and reports; ensure accuracy and completeness of payroll transactions. Controller must the company's reported financial results and that they comply with generally accepted accounting principles", "qualifications": {"required": "Advanced knowledge of Excel with possessing the ability to use spreadsheets, graphing, tables, calculations, and automation efficiently to process large quantities of data relevant to business tasks. At least 6 months of experience with Payroll and Benefits. Solid written and verbal communication skills. Ability to analyze data sets and communicate analytics to interpret data findings. Multitasking and time-management skills, with the ability to prioritize tasks. Auditing and reporting functions to ensure proper calculation and reporting of payroll data, benefits and taxes. Strongly skilled in data manipulation from multiple databases and integrating information from all accounts."}, "skills": ["Excel", "Payroll", "Benefits", "Data Analysis", "Reporting", "Auditing"], "postedDate": "1 month ago", "benefits": "benefits (medical, dental and vision insurance), an excellent compensation package, paid parking, paid time off, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977084513"}