{"jobTitle": "Operations Coordinator", "company": {"name": "ASSA ABLOY Group", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Wholesale Building Materials", "description": "ASSA ABLOY Entrance Systems, an international manufacturer of automated doors is considering candidates for an Operations Manager for the Field Operations, at the district located in Sacramento as part of the Texas district.<br/><br/>ASSA ABLOY Entrance Systems is a leading supplier of entrance automation solutions for efficient flow of goods and people. With global product brands such as Besam, Crawford, Megadoor and Albany, we offer complete pedestrian, industrial and high-performance door solutions. We provide a wide number of products and services to a global clientele in more than 100 countries.<br/><br/>ASSA ABLOY Entrance Systems is a division within ASSA ABLOY .<br/><br/>This position will directly report to the District Manager and will have full responsibility of all activities in the installation and servicing of automatic doors in the Maryland Market.<br/><br/><strong> Responsibilities: <br/><br/></strong><ul><li> Responsibilities will include managing the Installation and Service departments, all associated support and administrative office personnel, as well as all direct field associates and independent subcontractors. </li><li> Accountable to meet established goals and growth objectives under the direction of the District Manager. </li><li> Develop and maintain relationship with End-users in the Health Care and Retail segments as well as General Contractors, Sub-contractors, Architects and Suppliers. </li><li> Develop and maintain a professional, respectful and motivated workforce. </li><li> Work to develop managers and other administrative personnel. </li><li> Maintain communication with Factory regarding backlog and job release (Work In Progress). </li><li> Interact with Branch Sales Department on a continual basis to determine proper labor hours, and proper margins on projects. </li><li> Review projections and forecast reports frequently. <br/><br/></li></ul><strong> Requirements: </strong> The successful Candidate will possess the following experience:<br/><br/><ul><li> Must have direct experience managing employees in multiple installation and service divisions, within one location. </li><li> Minimum of 5 years experience in a multi-phased operation is essential and a history of long term employment is desired. </li><li> Background that includes strong experiences in the developing of a service company which includes all facets of our service company including driving demand service, planning PM contracts and growth, driving service quoting and sales, driving field efficiencies, continuous training, controlling inventories, collecting money, as well as recruiting, hiring and monitoring of field technician levels to efficiently allow for this ongoing growth. </li><li> Prior experience supervising Administrative personnel in the instruction of their duties as it relates to scheduling, ordering, and coordinating installation and service activities. </li><li> Documented experience in managing multiple business units into a cohesive team, while developing a service culture within, focusing on results with our customer/end users. </li><li> Familiar with general construction, contract documentation and customer contact. </li><li> Possess the flexibility to work a varying schedule (different hours of the day and weekends if necessary). </li><li> Familiar with general construction, contract documentation and customer contact. </li><li> Exceptional communication (written/verbal) skills. </li><li> Experience in establishing monthly forecasting and results. </li><li> Computer experience in Microsoft Office and Baan. <br/><br/></li></ul>This is a team approach with effective communication skills to successfully work with other departments such as: Sales Reps, Field Operations, Supply Chain, Parts Department, Customer Service, etc. Must be an excellent communicator to lead, manage and motivate the staff in an effective and fair manner.<br/><br/>This position demands a results-oriented approach coupled with high-energy, reliability and be disciplined. High School Diploma (required) and AA, BA, BS preferred.<br/><br/><strong>We are the ASSA ABLOY Group<br/><br/></strong>Our people have made us the global leader in access solutions. In return, we open doors for them wherever they go. With nearly 61,000 colleagues in more than 70 different countries, we help billions of people experience a more open world. Our innovations make all sorts of spaces – physical and virtual – safer, more secure, and easier to access.<br/><br/>As an employer, we value results – not titles, or backgrounds. We empower our people to build their career around their aspirations and our ambitions – supporting them with regular feedback, training, and development opportunities. Our colleagues think broadly about where they can make the most impact, and we encourage them to grow their role locally, regionally, or even internationally.<br/><br/>As we welcome new people on board, it’s important to us to have diverse, inclusive teams, and we value different perspectives and experiences.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3977778636"}