{"jobTitle": "Supply Chain Manager , S&OP", "company": {"name": "Amazon", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Distribution, Supply Chain, and Engineering", "industry": "Software Development", "description": "As a Supply Chain Manager within Sales and Operations Planning (S&OP), you will have the opportunity to own supply chain planning at the highest level for Amazon’s fulfillment business. You will have a holistic view of supply and demand within the Amazon fulfillment network and be an integral part in creating and implementing large scale strategic initiatives in inventory optimization, transportation cost, labor capacity management and more – all with the goal of better serving our customers. There will rarely be a perfect solution, so it will be up to you to make data-driven decisions and manage stakeholder relationships while planning and executing within an ever-changing environment.<br/><br/>The Supply Chain Manager will work in a fast-paced, fluid environment and communicate business conditions and decisions effectively with stakeholders across multiple groups and levels – from warehouse associates to various Amazon Directors and VPs. In this role, a S&OP Supply Chain Manager will seek out problems, dive deep into data, earn trust of partner teams, and deliver results that can have a large scale influence. This role is a blend of short term execution and long term strategic planning, that requires quick decision-making, with incomplete data, while also thinking big and influencing the long term direction of the network. The end goal of this role is to answer the question of how we can fulfill more products to our customers in a safer, faster, more efficient, and more cost-effective manner.<br/><br/>Key job responsibilities<br/><br/><ul><li> Demonstrate strong Customer focus</li><li> Make sound business judgments to drive both tactical as well as strategic improvements</li><li> Own programmatic execution and the detailed and strategic levels</li><li> Identify, prioritize, and implement processes to eliminate defects in the supply chain</li><li> Create, develop, and drive solutions that lead to a richer end to end customer experience</li><li> Execute thorough root cause analysis and deliver results</li><li> Successfully support, operate and influence in a cross-functional capacity<br/><br/></li></ul>A day in the life<br/><br/>Amazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:<br/><br/><ul><li> Medical, Dental, and Vision Coverage</li><li> Maternity and Parental Leave Options</li><li> Paid Time Off (PTO)</li><li> 401(k) Plan<br/><br/></li></ul>If you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of program or project management experience</li><li> 3+ years of working cross functionally with tech and non-tech teams experience</li><li> Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL</li><li> 3+ years of defining and implementing process improvement initiatives using data and metrics experience</li><li> 2+ years of supply chain experience</li><li> Bachelor's degree</li><li> Experience defining program requirements and using data and metrics to determine improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 3+ years of driving end to end delivery, and communicating results to senior leadership experience</li><li> 3+ years of driving process improvements experience</li><li> Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization</li><li> Experience building processes, project management, and schedules<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $77,200/year in our lowest geographic market up to $141,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2699184", "responsibilities": "As a Supply Chain Manager within Sales and Operations Planning (S&OP), you will have the opportunity to own supply chain planning at the highest level for Amazon’s fulfillment business. You will have a holistic view of supply and demand within the Amazon fulfillment network and be an integral part in creating and implementing large scale strategic initiatives in inventory optimization, transportation cost, labor capacity management and more – all with the goal of better serving our customers. There will rarely be a perfect solution, so it will be up to you to make data-driven decisions and manage stakeholder relationships while planning and executing within an ever-changing environment.<br/><br/>The Supply Chain Manager will work in a fast-paced, fluid environment and communicate business conditions and decisions effectively with stakeholders across multiple groups and levels – from warehouse associates to various Amazon Directors and VPs. In this role, a S&OP Supply Chain Manager will seek out problems, dive deep into data, earn trust of partner teams, and deliver results that can have a large scale influence. This role is a blend of short term execution and long term strategic planning, that requires quick decision-making, with incomplete data, while also thinking big and influencing the long term direction of the network. The end goal of this role is to answer the question of how we can fulfill more products to our customers in a safer, faster, more efficient, and more cost-effective manner.", "qualifications": {"required": "3+ years of program or project management experience, 3+ years of working cross functionally with tech and non-tech teams experience, Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL, 3+ years of defining and implementing process improvement initiatives using data and metrics experience, 2+ years of supply chain experience, Bachelor's degree, Experience defining program requirements and using data and metrics to determine improvements", "preferred": "3+ years of driving end to end delivery, and communicating results to senior leadership experience, 3+ years of driving process improvements experience, Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization, Experience building processes, project management, and schedules"}, "skills": ["Supply Chain Management", "S&OP", "Inventory Optimization", "Transportation Cost Management", "Labor Capacity Management", "Customer Focus", "Business Judgment", "Program Management", "Project Management", "Cross-Functional Collaboration", "Process Improvement", "Data Analysis", "Metrics", "Stakeholder Management", "Excel", "SQL"], "postedDate": "2 weeks ago", "benefits": "Amazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:<br/><br/><ul><li> Medical, Dental, and Vision Coverage</li><li> Maternity and Parental Leave Options</li><li> Paid Time Off (PTO)</li><li> 401(k) Plan<br/><br/></li></ul>", "salary": {"amount": "77,200.00/year - $141,500.00/year", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977080175"}