{"jobTitle": "International Production and Planning Coordinator", "company": {"name": "Skechers", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "25.00/hr - 28.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Job Purpose-<br/><br/></strong>Interface with Skechers China office, factories, product development/design department, customer service, and allocations department to ensure accurate and timely processing of production and customer orders.<br/><br/><strong>Essential Job Results-<br/><br/></strong><ul><li>Process production orders and follow up with the Skechers China office or factories to ensure production placement, x-factory dates and on time delivery.</li><li>Communicate with the Skechers China office, product development/design department, allocations team and customer service on any production delays on shipments and resolve any problems.</li><li>Review weekly order status report received from factories. Identify problems, discrepancies, delays, etc. and take action to resolve.</li><li>Produce and maintain all sizes for Intl Subsidiary production. Analyze orders booked against production on a daily basis and make necessary adjustments.</li><li>Create weekly Intl Subsidiary availability reports that are distributed to our Intl sales team throughout Europe, Brazil, Chile, Japan, and Latin America.</li><li>Review weekly product line sheets, identify any discrepancies and take action to correct.<br/><br/></li></ul><strong>Additional Responsibilities-<br/><br/></strong><ul><li>Other duties as assigned.<br/><br/></li></ul><strong>Supervisory Responsibilities-<br/><br/></strong><ul><li>No.<br/><br/></li></ul><strong>Job Requirements-<br/><br/></strong><ul><li>Must be proficient in Microsoft Windows, Excel, Word</li><li>Ability to think critically and conceptually</li><li>Excellent problem solving skills</li><li>Superior written and verbal communication skills</li><li>Very detail oriented and highly organized</li><li>Must be able to multi-task</li><li>Must work well under pressure<br/><br/></li></ul><strong>Education And Experience-<br/><br/></strong><ul><li>1-2 years of experience in purchasing analysis and planning</li><li>College education required<br/><br/></li></ul>$25-$28/HOURLY<br/><br/><strong>About Skechers<br/><br/></strong>Skechers (NYSE: SKX), a global, Fortune 500® brand develops and markets a diverse range of lifestyle and performance footwear, apparel, and accessories. Developing comfort technologies is the foundation of all we do – delivering stylish, innovative, and quality products. Serving over 180 countries and territories, Skechers connects customers to products through department and specialty stores, e-commerce and digital stores, and through our more than 5,200 company-and third-party-owned retail locations. Headquartered in Southern California, with offices and distribution centers around the globe, Skechers has spent 30 years helping people of all ages look and feel good.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Skechers is committed to providing a safe, inclusive, and respectful work environment. Skechers provides equal employment opportunities for all employees and applicants for employment without regard race, color, religion, gender, gender identification and expression, national origin, marital status, age, disability, genetic information, military status, sexual orientation, or any other protected characteristic established by local, state or federal law.<br/><br/><strong>Reasonable Accommodation<br/><br/></strong>Applicants for employment who require a reasonable accommodation to apply for a job should request appropriate accommodation by emailing benefits@skechers.com.<br/><br/>To perform this job successfully, an individual must be able to perform each job responsibility satisfactorily. The skills, abilities and physical demands described are representative of those duties that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities, who are otherwise qualified for the job position, to perform the essential functions.", "responsibilities": "<strong>Job Purpose-<br/><br/></strong>Interface with Skechers China office, factories, product development/design department, customer service, and allocations department to ensure accurate and timely processing of production and customer orders.<br/><br/><strong>Essential Job Results-<br/><br/></strong><ul><li>Process production orders and follow up with the Skechers China office or factories to ensure production placement, x-factory dates and on time delivery.</li><li>Communicate with the Skechers China office, product development/design department, allocations team and customer service on any production delays on shipments and resolve any problems.</li><li>Review weekly order status report received from factories. Identify problems, discrepancies, delays, etc. and take action to resolve.</li><li>Produce and maintain all sizes for Intl Subsidiary production. Analyze orders booked against production on a daily basis and make necessary adjustments.</li><li>Create weekly Intl Subsidiary availability reports that are distributed to our Intl sales team throughout Europe, Brazil, Chile, Japan, and Latin America.</li><li>Review weekly product line sheets, identify any discrepancies and take action to correct.<br/><br/></li></ul><strong>Additional Responsibilities-<br/><br/></strong><ul><li>Other duties as assigned.<br/><br/></li></ul><strong>Supervisory Responsibilities-<br/><br/></strong><ul><li>No.<br/><br/></li></ul>", "qualifications": {"required": "Must be proficient in Microsoft Windows, Excel, Word, Ability to think critically and conceptually, Excellent problem solving skills, Superior written and verbal communication skills, Very detail oriented and highly organized, Must be able to multi-task, Must work well under pressure", "preferred": "1-2 years of experience in purchasing analysis and planning, College education required"}, "skills": ["Microsoft Windows", "Excel", "Word", "Problem Solving", "Communication"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977888341"}