{"jobTitle": "Legal Secretary II - Floater", "company": {"name": "Mercury Insurance", "location": "West Covina, CA"}, "location": "West Covina, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Insurance", "description": "Join an amazing team that is consistently recognized for our achievements and culture, including our most recent Forbes award of being one of America's Best Midsize Employers for 2024!<br/><br/>The primary job function of the Legal Secretary II is to provide secretarial and administrative support to professional legal staff. Demonstrates high level degree of legal knowledge, competence and secretarial skills. Prepares and files legal documents, motions, pleadings and correspondence of a legal nature as directed. Maintains attorneys' calendar, sets court dates and appearances, and schedules meetings with witnesses and other involved parties. Maintains department records. May be required to support up to as many as three litigation attorneys.<br/><br/>These worker characteristics are normally acquired through completion of a general high school educational, vocational training in legal support. 15+ years experience in insurance defense litigation. Must have advanced knowledge as to civil litigation/ PI court rules for Los Angeles, Orange, San Diego, Ventura, San Bernardino, Riverside and Sacramento counties.<br/><br/><strong><em>Why choose a career at Mercury?<br/><br/></em></strong>At Mercury, we have been guided by our purpose to help people reduce risk and overcome unexpected events for more than 60 years. We are one team with a common goal to help others. Everyone needs insurance and we can’t imagine a world without it.<br/><br/>Our team will encourage you to grow, make time to have fun, and work together to make great things happen. We embrace the strengths and values of each team member. We believe in having diverse perspectives where everyone is included, to serve customers from all walks of life.<br/><br/>We care about our people, and we mean it. We reward our talented professionals with a competitive salary, bonus potential, and a variety of benefits to help our team members reach their health, retirement, and professional goals.<br/><br/>Learn more about us here: https://www.mercuryinsurance.com/about/careers<br/><br/><strong>We Offer Many Great Benefits, Including<br/><br/></strong><ul><li>Competitive compensation</li><li>Flexibility to work from anywhere in the United States for most positions</li><li>Paid time off (vacation time, sick time, 9 paid Company holidays, volunteer hours)</li><li>Incentive bonus programs (potential for holiday bonus, referral bonus, and performance-based bonus)</li><li>Medical, dental, vision, life, and pet insurance</li><li>401 (k) retirement savings plan with company match</li><li>Engaging work environment</li><li>Promotional opportunities</li><li>Education assistance</li><li>Professional and personal development opportunities</li><li>Company recognition program</li><li>Health and wellbeing resources, including free mental wellbeing therapy/coaching sessions, child and eldercare resources, and more<br/><br/></li></ul>Mercury Insurance is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other characteristic protected by federal, state, or local law.", "postedDate": "2 weeks ago", "salary": {"amount": "53,969.00/yr - 94,289.00/yr", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3977886014"}