{"jobTitle": "Forward Planner - SCIE North", "company": {"name": "D.R. Horton", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Construction", "description": "<strong>Description<br/><br/></strong><strong>D.R. Horton, Inc., the largest homebuilder in the U.S.,</strong> was founded in 1978 and is a publicly traded company on the New York Stock Exchange. It is engaged in the construction and sale of high quality homes designed principally for the entry-level and first time move-up markets. The Company also provides mortgage financing and title services for homebuyers through its mortgage and title subsidiaries. Please visit our website at www.drhorton.com for more information.<br/><br/><strong>D.R. Horton, Inc.</strong> is currently looking for an Forward Planner. The right candidate be responsible for the overall progress and planning of projects, approval of plans, and procurement of necessary permits for construction.<br/><br/><strong>Essential Duties and Responsibilities</strong> include the following. Other duties may be assigned.<br/><br/><ul><li>Lead, manage, and direct consultants in design and development of improvement, final plat, landscape and dry utility plans</li><li>Submit plans to city and county agencies for approval and permit processing</li><li>Develop and maintain entitlement schedule and budget</li><li>Manage consultant contracts and approve invoices</li><li>Provide lot exhibits, community information statements, CC&amp;Rs and easement disclosure, etc. to Sales Department for purchases and sales documentation</li><li>Coordinate with outside legal counsel to draft CC&amp;R’s, disclosures, and Sales and HOA documents</li><li>Serve as the primary liaison between the development team and various governmental agencies and departments</li><li>Conduct all business in a professional and ethical manner to serve customers and increase the goodwill and profit of the company<br/><br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>Directly manages two or more employees in the Operations Department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Education and/or Experience<br/><br/></strong><ul><li>Associate degree or equivalent from two-year college or technical school</li><li>Three to five years of related experience and/or training</li><li>Must have a vehicle and a valid driver’s license</li><li>Ability to read architectural and engineering plans</li><li>Ability to apply common sense understanding to carry out instructions furnished in written oral form or via DRH applications</li><li>Proficiency with MS Office and email<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s degree from a four-year college or university preferred</li><li>Strong communication skills</li><li>Creative thinking and attention to detail<br/><br/><br/></li></ul>Come join a winning team with a Fortune 500 company! We are growing fast and are looking for enthusiastic attitudes and team players to join our success. We offer an excellent benefits package including:<br/><br/><ul><li>Medical, Vision and Dental</li><li>401(K)</li><li>Employee Stock Purchase Plan</li><li>Flex Spending Accounts</li><li>Life Insurance</li><li>Vacation, Sick, Personal Time and Company Holidays</li><li>Expected Pay Scale: $129,000 - $131,000. <br/><br/><br/></li></ul><strong><em>Build YOUR future with D.R. Horton, America’s Builder. #WeBuildPeople2<br/><br/></em></strong>Follow us on social media @hortoncareers for an inside look at our company and connect with us on LinkedIn for up to date job listings!<br/><br/>LinkedIn, Twitter, Facebook, Instagram", "responsibilities": "<strong>Essential Duties and Responsibilities</strong> include the following. Other duties may be assigned.<br/><br/><ul><li>Lead, manage, and direct consultants in design and development of improvement, final plat, landscape and dry utility plans</li><li>Submit plans to city and county agencies for approval and permit processing</li><li>Develop and maintain entitlement schedule and budget</li><li>Manage consultant contracts and approve invoices</li><li>Provide lot exhibits, community information statements, CC&amp;Rs and easement disclosure, etc. to Sales Department for purchases and sales documentation</li><li>Coordinate with outside legal counsel to draft CC&amp;R’s, disclosures, and Sales and HOA documents</li><li>Serve as the primary liaison between the development team and various governmental agencies and departments</li><li>Conduct all business in a professional and ethical manner to serve customers and increase the goodwill and profit of the company<br/><br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong>Directly manages two or more employees in the Operations Department. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.", "qualifications": {"required": "Associate degree or equivalent from two-year college or technical school, Three to five years of related experience and/or training, Must have a vehicle and a valid driver’s license, Ability to read architectural and engineering plans, Ability to apply common sense understanding to carry out instructions furnished in written oral form or via DRH applications, Proficiency with MS Office and email", "preferred": "Bachelor’s degree from a four-year college or university preferred, Strong communication skills, Creative thinking and attention to detail"}, "skills": ["MS Office", "Email", "Communication", "Architectural Plans", "Engineering Plans"], "postedDate": "2 weeks ago", "benefits": "Medical, Vision and Dental, 401(K), Employee Stock Purchase Plan, Flex Spending Accounts, Life Insurance, Vacation, Sick, Personal Time and Company Holidays, Expected Pay Scale: $129,000 - $131,000.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977531504"}