{"jobTitle": "Manager, Energy Program Management", "company": {"name": "LA28 Olympic & Paralympic Games", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Spectator Sports", "description": "The Summer Olympic and Paralympic Games will be hosted in Los Angeles, California in 2028, returning to the United States for the first time in over 30 years. 2028 will be the first time LA hosts the Paralympic Games, creating an opportunity to expand awareness, understanding and inclusion of people with disabilities.<br/><br/>LA28, the organizers for the 2028 Olympic and Paralympic Games in Los Angeles, is on a mission to create an unparalleled Games experience for athletes, fans, partners, our community and our people. Our vision is to collectively create what’s next through sport, community and the power of our differences.<br/><br/>The 2028 Olympics and Paralympics will represent LA and leverage the strength of our community’s diversity and creativity as we collectively work to design a Games that we all want to be a part of. We do this by focusing on people and by inviting everyone into the story of the LA28 Games.<br/><br/>The LA28 organizing committee is an independent, non-profit organization that is privately funded and governed by a board of directors.<br/><br/>Our Vision is to collectively create what’s next by harnessing sport, community and the power of our differences. Our Mission is to create an unparalleled Paralympic and Olympic Games for athletes, fans, partners, our community and our people.<br/><br/><strong>Values and Behaviors:<br/><br/></strong><ul><li>Optimism – Embody a positive, enthusiastic, and solution-oriented attitude in everything we do; challenge the status quo, inspire and support one another to achieve our best; have our eyes on the future and believe we can make a meaningful impact</li><li>Integrity – We communicate openly and honestly, listen, and respectfully value multiple perspectives; we do what we say and are accountable for everything we do; we do the right thing, always. Even when it isn’t easy</li><li>Excellence – We hold ourselves to the highest standard and expectations; we live our values and truths and persevere through challenges; we are continuous learners and adapt and pivot with speed to meet changing needs</li><li>Inclusion – We seek to represent, include, empower and level the playing field; our work reflects the communities we serve and the world in which we live; we leverage our platforms to bring awareness to issues relevant to who we are</li><li>Co-Creation – We are authors of a shared story. Everyone contributes their unique voice to our shared mission; we share pride in our accomplishments and ownership of our shortcomings</li><li>Boldness – We embrace creativity, courage and outside-the-box thinking; we are unafraid to take risks, explore unconventional solutions, and learn from the process; we are innovators, disruptors, and challengers of the status quo<br/><br/></li></ul><strong>Position Summary<br/><br/></strong>The Games Planning &amp; Delivery Group aims to deliver the most seamless, innovative, and engaging Games experience ever for all athletes, fans, partners, and the community. The Games Planning &amp; Delivery team is currently organized in four key areas including Venue Infrastructure, Venue Management, Revenue &amp; Commercial, and Games Operations, but will expand to over 30 functional areas by Games time.<br/><br/>The Venue Infrastructure Team is responsible for delivering the competition and non-competition venues fit-for-purpose for the preparation and staging of the Olympic and Paralympic Games. This department is responsible for managing the design, development, program management, construction, maintenance, and removal of all Games infrastructure in existing and fully temporary venues.<br/><br/>Energy is a functional area that lives within the Venue Infrastructure Team. The Energy Team is responsible to ensure the end-to-end delivery of power to all Games venues and facilities. The Energy Team coordinates with other LA28 functional areas, external utility providers, government organizations, venue owners and temporary power providers to ensure successful delivery of electrical services and operations to power all Games operational sites.<br/><br/>Reporting to the Senior Director of Energy, the Manager, Energy Project Management will be responsible for supporting the Energy project office, including being responsible during the strategy and planning phases to manage various Energy activities such as creating and updating the Master Schedule for Energy and the Energy project schedule, updating the Energy budget, and managing Energy procurement and resource planning. This will involve coordinating transfer of financial, scheduling, and other required deliverables and creating and presenting reports and dashboards to highlight progress to plan and risk. They will work closely with other functional leads (internal and external) to implement strategic business milestones, work plans, and transition to delivery and execution work structure.<br/><br/>This role will manage operational readiness including delivery of key operational dependencies from other areas for support services, such as Venue Infrastructure, Technology, Broadcast, etc. Generic skills needed to work in the Energy project office include capabilities in project management, with experience in using project management tools.<br/><br/><strong>Key Responsibilities<br/><br/></strong><strong>Planning and Reporting <br/><br/></strong><ul><li>Ensure oversight and management of the Energy program and all program management partners, including owning all internal reporting of key objectives and success metrics. </li><li>Support the integration of internal stakeholders with external delivery partners, including all external program management resources with other venue development functions, internal stakeholders, and central services (e.g., finance, procurement, sustainability). </li><li>Support the assessment of cost and delivery impacts as the design development process evolves, helping to identify and evaluate both opportunities and risks in delivery. </li><li>Develop and execute an approval and review process for all internal and external stakeholders involved in establishing Energy technical requirements for Games overlay. </li><li>Ensure a robust, data-driven approach to Energy infrastructure program management through use of timely and digestible views to current progress and outlook. <br/><br/></li></ul><strong>Cross-Functional Collaboration <br/><br/></strong><ul><li>Establish close working relationships with key functional areas (especially Venue Infrastructure, Technology, Broadcast, etc.) to ensure the infrastructure planning and reporting process incorporates cross-functional timelines and objectives. </li><li>Closely align with the Venue Development sub-function to ensure coordinated planning for all venue design and delivery milestones and deliverables and advocate where risks to timeline and delivery require attention. </li><li>Planning and reporting will be the coordinated output of cross-functional stakeholder needs and this person will need to demonstrate expertise with complex planning across many internal and external stakeholder groups. <br/><br/></li></ul><strong>Strategic Leadership <br/><br/></strong><ul><li>Hire, train, motivate, and evaluate department staff and external partners. </li><li>Coordinate with multiple sub-functions including contracting, scheduling, procurement, and construction management resources that oversee internal and external resources. </li><li>Support activities to develop and adhere to the Energy budget with clear steps to implement, monitor, and appropriately measure deliverables. <br/><br/></li></ul><strong>Background And Requirements<br/><br/></strong><ul><li>Minimum 5-years’ experience with permanent electrical infrastructure and temporary electrical infrastructure delivery with 2 years of leadership experience within planning or program management. </li><li>Experience in creating and managing electrical projects in planning, design, and implementation phases. </li><li>Demonstrated commitment to Diversity, Equity, Inclusion, and Belonging  </li><li>Experience working with a diverse range of stakeholders and proven success at building excellent working relationships.  </li><li>Strong experience with PowerBI / Tableau, Smartsheet, and P6 or other project management tools. </li><li>Experience working with senior executives across multiple functional areas. <br/><br/></li></ul><strong>Physical Requirements And Working Conditions<br/><br/></strong><ul><li>This full-time position is located in the LA28 office in Los Angeles, California. </li><li>Some travel, as needed, to external stakeholder offices, government agencies, and Games venues and facilities. <br/><br/></li></ul><strong>Expectations<br/><br/></strong><ul><li>Extremely detail oriented with excellent command of productivity and collaboration tools (Office360, SharePoint, Smartsheet, etc.) </li><li>Present information concisely to wide audience of executive leadership, external contractors and advisors, and governmental agencies. </li><li>Well-developed problem-solving skills and ability to work independently to resolve issues.  </li><li>Strong communication, team building, and interpersonal skills. </li><li>Self-starter with experience in defining tasks, seeking feedback, and evolving work where applicable.  </li><li>A collaborative mindset: someone who prioritizes the team and fosters a culture of high performance without ego. </li><li>An innovative viewpoint, challenging the status quo and thinking ahead to future years of the Movement.   </li><li>Ability to implement and manage change effectively as well as manage and mitigate risk. <br/><br/></li></ul><strong>Education / Training / Certifications<br/><br/></strong><ul><li>  Bachelor’s degree or equivalent in Electrical Engineering, Project Management or closely related.<br/><br/></li></ul>The annual base salary range for this position is $85,000.00 to $105,000.00. The pay scale provided is the range that LA28 reasonably expects to pay as starting base compensation for this role. All LA28 compensation remains subject to final determination based on individual candidate qualifications, experience, or other reasonable criteria consistent with LA28’s operational business needs and applicable law.<br/><br/>LA28 does not provide relocation assistance.<br/><br/><em>LA28 is committed to operating fair and unbiased recruitment procedures allowing all applicants an equal opportunity for employment, free from discrimination on the basis of religion, race, sex, age, sexual orientation, disability, color, ethnic or national origin, or any other classification as may be protected by applicable law. We strive to build a team that is diverse, inclusive and encourages qualified candidates of all backgrounds, perspectives, and identities to apply. </em><em>We will consider all qualified candidates with criminal histories in a manner consistent with local law. </em><em>We assess applications based on relevant skills, education, and experience a candidate can add to our team.</em>", "responsibilities": "Planning and Reporting <br/><br/>\n<ul><li>Ensure oversight and management of the Energy program and all program management partners, including owning all internal reporting of key objectives and success metrics. </li><li>Support the integration of internal stakeholders with external delivery partners, including all external program management resources with other venue development functions, internal stakeholders, and central services (e.g., finance, procurement, sustainability). </li><li>Support the assessment of cost and delivery impacts as the design development process evolves, helping to identify and evaluate both opportunities and risks in delivery. </li><li>Develop and execute an approval and review process for all internal and external stakeholders involved in establishing Energy technical requirements for Games overlay. </li><li>Ensure a robust, data-driven approach to Energy infrastructure program management through use of timely and digestible views to current progress and outlook. <br/><br/></li></ul>\nCross-Functional Collaboration <br/><br/>\n<ul><li>Establish close working relationships with key functional areas (especially Venue Infrastructure, Technology, Broadcast, etc.) to ensure the infrastructure planning and reporting process incorporates cross-functional timelines and objectives. </li><li>Closely align with the Venue Development sub-function to ensure coordinated planning for all venue design and delivery milestones and deliverables and advocate where risks to timeline and delivery require attention. </li><li>Planning and reporting will be the coordinated output of cross-functional stakeholder needs and this person will need to demonstrate expertise with complex planning across many internal and external stakeholder groups. <br/><br/></li></ul>\nStrategic Leadership <br/><br/>\n<ul><li>Hire, train, motivate, and evaluate department staff and external partners. </li><li>Coordinate with multiple sub-functions including contracting, scheduling, procurement, and construction management resources that oversee internal and external resources. </li><li>Support activities to develop and adhere to the Energy budget with clear steps to implement, monitor, and appropriately measure deliverables. <br/><br/></li></ul>", "qualifications": {"required": "Minimum 5-years’ experience with permanent electrical infrastructure and temporary electrical infrastructure delivery with 2 years of leadership experience within planning or program management. \nExperience in creating and managing electrical projects in planning, design, and implementation phases. \nDemonstrated commitment to Diversity, Equity, Inclusion, and Belonging  \nExperience working with a diverse range of stakeholders and proven success at building excellent working relationships.  \nStrong experience with PowerBI / Tableau, Smartsheet, and P6 or other project management tools. \nExperience working with senior executives across multiple functional areas. <br/><br/>", "preferred": "Bachelor’s degree or equivalent in Electrical Engineering, Project Management or closely related.<br/><br/>"}, "skills": ["PowerBI", "Tableau", "Smartsheet", "P6", "Project Management", "Electrical Engineering"], "postedDate": "2 weeks ago", "salary": {"amount": "85,000.00 to 105,000.00", "currency": "USD"}, "benefits": "The annual base salary range for this position is $85,000.00 to $105,000.00. The pay scale provided is the range that LA28 reasonably expects to pay as starting base compensation for this role. All LA28 compensation remains subject to final determination based on individual candidate qualifications, experience, or other reasonable criteria consistent with LA28’s operational business needs and applicable law.<br/><br/>LA28 does not provide relocation assistance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977114021"}