{"jobTitle": "Retail Merchandise Planner", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "75,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "Each day Universal Studios Hollywood creates unforgettable experiences for our guests from around the world. We bring to life the ultimate Hollywood experience with our real working movie studio and heart-pounding rides, shows and attractions that put you inside some of the world’s most popular movies and TV shows. USH offers something for everyone from thrill seekers to movie lovers to family fun for all ages. Our Team Members are passionate individuals who create memorable moments whether it’s on the studio lot, or in our conference rooms, theaters, or kitchens. We believe in the talent of our team members. It’s our passion and commitment to excellence that drives our business to succeed in everything we do across the park. We believe in a culture of family and fun, here you can make a difference and build your career!<br/><br/>NBCUniversal owns and operates over 20 different businesses across 30 countries including a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks and a premium ad-supported streaming service.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain, and empower through our platforms, Comcast NBCUniversal stands for including everyone. We strive to foster a diverse and inclusive culture where our employees feel supported, embraced, and heard. We believe that our workforce should represent the communities we live in so that together, we can continue to create and deliver content that reflects the current and ever-changing face of the world. Click here to learn more about Comcast NBCUniversal’s commitment and how we are making an impact.<br/><br/><strong>Job Description<br/><br/></strong>The USH planning department serves as the bridge between Universal Park and Resorts Buying Team in Orlando and the Retail Team in Hollywood. We oversee all our great IPs in our retail locations as well as special event merchandise such as Halloween Horror Nights and Grinchmas. Take the lead of a great team that impacts the retail experience for guests from all over the world. This person will report to the Retail Planning manager and will work closely with the Visual Merchandising, Retail Operators, and Orlando Buying and Planning team.<br/><br/>The candidate will be directly responsible for managing the proper flow of inventory at the Universal Hollywood stores. Provide weekly and ad hoc financial analysis on store and SKU level performance. In collaborations with the Merchandizing/Visuals team, work on store merchandising plans to ensure proper assortments are added to locations; merchandise is placed in accordance with the merchandiser-developed SKU to fixture; determine allocation amounts; and ensure adequate real estate for programs. Work directly with the UPR buying team, Merchandise Warehouse, and Visual Team to manage product levels, store layouts, and product placement.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Responsible for retail inventory planning at Universal Studios Hollywood stores. Ensure inventory is available at the right place, at the right time, with the right QTY to meet demand.</li><li>Work closely with the Merchandising/Visuals team to create merchandising plans and ensure proper assortments and inventory are added to the stores.</li><li>Responsible for forecasting out-of-stock and ensuring proper store inventory levels and timely replenishment.</li><li>Work closely with the warehouse team to prioritize inbounds from suppliers for items with low inventory.</li><li>Review inventory targets in the system and make appropriate adjustments to meet demand through auto-replenishment.</li><li>Directly responsible for monitoring, tracking, and ensuring the proper flow of goods, including new products, re-orders, and delivery schedules. This includes supporting the forecasting of product needs. Independently controls updates to the auto-replenishment schedules, parameter display minimums, replenishment adjustments, and manual inventory orders and supports the store teams in inventory control.</li><li>Provide analysis of sales contributions on the SKU, program, and department levels. Responsible for the development of post-execution reports. Conducts independent analyses to ensure the program is meeting financial expectations &amp; makes decisions to re-assort the store if necessary. Communicate needs, suggestions, and stock level concerns and provide direction to field team and buyers on assortment issues, merchandise exit strategies, and product replacement.</li><li>Demonstrate a solid working partnership with our Store Operation teams to ensure ease of store changes and retail walk-throughs.</li><li>Makes determinations and decisions regarding the overall Special Event product placement, stock balancing, flow of goods from warehouse to stores, event reporting, and operational support. </li><li>Monitor the sales of top-selling programs.</li><li>Manage merchandising &amp; planning procedures in accordance with visual &amp; merchandising standards for each retail location.</li><li>Create exit strategies for discontinued and broken styles.</li><li>Partner with Buyers and the Visual Merchandisers/Visuals team on incoming products to support seasonal and event store sets.</li><li>Increase per cap and penetration through placement of key drivers.</li><li>Park walks focusing on set performance and maintenance and inventory levels.</li><li>Create weekly and monthly sales reports as directed by Planning Manager.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Basic Requirements:<br/><br/></strong><ul><li>Bachelor’s Degree preferred or strong record of work history in the business field.</li><li>Minimum 5 years of leading multi-store merchandising, planning, and/or buying experience.<br/><br/></li></ul>Required On-Site: This position is required to be performed full-time from an NBCUniversal-designated worksite, with some hybrid work from home opportunity.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $75,000-$85,000.<br/><br/><strong>Desired Characteristics<br/><br/></strong><ul><li>Excellent written and verbal skills to effectively communicate with all levels of the organization.</li><li>Proficient in Microsoft programs such as Word and Excel, MMS, or equivalent inventory management programs. AS400, Power BI, and Access proficiency a plus</li><li>Strong interpersonal and analytical skills</li><li>Good time management skills and ability to juggle multiple priorities.</li><li>Proactive thinker/self-starter</li><li>Proven independent leadership skills.<br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Must be willing to adhere to all Company COVID-19 workplace safety policies and protocols. <br/><br/></li></ul><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The USH planning department serves as the bridge between Universal Park and Resorts Buying Team in Orlando and the Retail Team in Hollywood. We oversee all our great IPs in our retail locations as well as special event merchandise such as Halloween Horror Nights and Grinchmas. Take the lead of a great team that impacts the retail experience for guests from all over the world. This person will report to the Retail Planning manager and will work closely with the Visual Merchandising, Retail Operators, and Orlando Buying and Planning team.<br/><br/>The candidate will be directly responsible for managing the proper flow of inventory at the Universal Hollywood stores. Provide weekly and ad hoc financial analysis on store and SKU level performance. In collaborations with the Merchandizing/Visuals team, work on store merchandising plans to ensure proper assortments are added to locations; merchandise is placed in accordance with the merchandiser-developed SKU to fixture; determine allocation amounts; and ensure adequate real estate for programs. Work directly with the UPR buying team, Merchandise Warehouse, and Visual Team to manage product levels, store layouts, and product placement.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Responsible for retail inventory planning at Universal Studios Hollywood stores. Ensure inventory is available at the right place, at the right time, with the right QTY to meet demand.</li><li>Work closely with the Merchandising/Visuals team to create merchandising plans and ensure proper assortments and inventory are added to the stores.</li><li>Responsible for forecasting out-of-stock and ensuring proper store inventory levels and timely replenishment.</li><li>Work closely with the warehouse team to prioritize inbounds from suppliers for items with low inventory.</li><li>Review inventory targets in the system and make appropriate adjustments to meet demand through auto-replenishment.</li><li>Directly responsible for monitoring, tracking, and ensuring the proper flow of goods, including new products, re-orders, and delivery schedules. This includes supporting the forecasting of product needs. Independently controls updates to the auto-replenishment schedules, parameter display minimums, replenishment adjustments, and manual inventory orders and supports the store teams in inventory control.</li><li>Provide analysis of sales contributions on the SKU, program, and department levels. Responsible for the development of post-execution reports. Conducts independent analyses to ensure the program is meeting financial expectations &amp; makes decisions to re-assort the store if necessary. Communicate needs, suggestions, and stock level concerns and provide direction to field team and buyers on assortment issues, merchandise exit strategies, and product replacement.</li><li>Demonstrate a solid working partnership with our Store Operation teams to ensure ease of store changes and retail walk-throughs.</li><li>Makes determinations and decisions regarding the overall Special Event product placement, stock balancing, flow of goods from warehouse to stores, event reporting, and operational support. </li><li>Monitor the sales of top-selling programs.</li><li>Manage merchandising &amp; planning procedures in accordance with visual &amp; merchandising standards for each retail location.</li><li>Create exit strategies for discontinued and broken styles.</li><li>Partner with Buyers and the Visual Merchandisers/Visuals team on incoming products to support seasonal and event store sets.</li><li>Increase per cap and penetration through placement of key drivers.</li><li>Park walks focusing on set performance and maintenance and inventory levels.</li><li>Create weekly and monthly sales reports as directed by Planning Manager.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree preferred or strong record of work history in the business field.<br/><br/>Minimum 5 years of leading multi-store merchandising, planning, and/or buying experience.<br/><br/>Required On-Site: This position is required to be performed full-time from an NBCUniversal-designated worksite, with some hybrid work from home opportunity.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $75,000-$85,000.", "preferred": "Excellent written and verbal skills to effectively communicate with all levels of the organization.<br/><br/>Proficient in Microsoft programs such as Word and Excel, MMS, or equivalent inventory management programs. AS400, Power BI, and Access proficiency a plus<br/><br/>Strong interpersonal and analytical skills<br/><br/>Good time management skills and ability to juggle multiple priorities.<br/><br/>Proactive thinker/self-starter<br/><br/>Proven independent leadership skills.<br/><br/>Must be willing to adhere to all Company COVID-19 workplace safety policies and protocols. <br/><br/>"}, "skills": ["Microsoft Word", "Microsoft Excel", "MMS", "AS400", "Power BI", "Access"], "postedDate": "1 month ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977985676"}