{"jobTitle": "Senior Accountant", "company": {"name": "Icertis", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "95,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "IT Services and IT Consulting", "description": "With unmatched technology and category-defining innovation, Icertis pushes the boundaries of what’s possible with contract lifecycle management (CLM). The AI-powered, analyst-validated Icertis Contract Intelligence (ICI) platform turns contracts from static documents into strategic advantage by structuring and connecting the critical contract information that defines how an organization runs. Today, the world’s most iconic brands and disruptive innovators trust Icertis to fully realize the intent of their combined 10 million contracts worth more than $1 trillion, in 40+ languages and 93 countries.<br/><br/><strong>Who we are: </strong>Icertis is the only contract intelligence platform companies trust to keep them out in front, now and in the future. Our unwavering commitment to contract intelligence is grounded in our FORTE values—Fairness, Openness, Respect, Teamwork and Execution—which guide all our interactions with employees, customers, partners and stakeholders. Because in our mission to be the contract intelligence platform of the world, we believe how we get there is as important as the destination<br/><br/>This is an opportunity to join an accounting team that is strategically planning for and laying the foundation to be a public company ready. This position will be a remote role, who will be based in PST or MST time zone.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Lead assigned monthly close activities, including preparation of journal entries, intercompany transactions, account reconciliations, etc.</li><li>Conduct monthly, quarterly and annual variance analysis to ensure resulting financial statement results accurately reflect business activity and are in accordance with US GAAP.</li><li>Engage in ad hoc technical research and will add to the technical accounting bench for the team.</li><li>Contribute to the implementation and maintenance of the Company's internal control system.</li><li>Develop and establish accounting policies, thresholds, and procedures.</li><li>Collaborate cross-functionally to analyze accounting impacts of anticipated business transactions.</li><li>Drive continuous improvement initiatives, identifying opportunities for improvement to support scalable accounting processes, including systems implementations, to ensure compliance and accuracy of financial results.</li><li>Prepare audit-ready support documentation for external auditors.</li><li>Support various ad-hoc projects as needed.<br/><br/></li></ul><strong>What You Will Bring<br/><br/></strong><ul><li>3 + years of combined public and private accounting experience, preferably at a publicly traded company. CPA certification is strongly preferred.</li><li>Exceptional attention to detail and the ability to analyze underlying data to address unexpected occurrences.</li><li>Ability to thrive in a fast-paced environment, manage competing priorities, and meet tight deadlines.</li><li>In-depth knowledge of US GAAP and Sarbanes-Oxley (SOX) internal control requirements.</li><li>Excellent written and verbal communication skills, with the ability to tailor communication to the audience.</li><li>Strong problem-solving and decision-making skills in a high-growth environment.</li><li>High emotional intelligence with the ability to build and sustain relationships within and outside of the finance team.</li><li>Experience with NetSuite ERP or similar systems.</li><li>Bachelor’s degree in Business Administration or Accounting.</li><li>Understanding of foreign exchange (FX) and consolidation is a plus.</li><li>Passion for creating detailed workbooks and account reconciliations that tell a story.<br/><br/></li></ul>$95,000 - $120,000 a year<br/><br/><em>Pay offered will vary based on job-related factors such as location, experience, training, skills, and abilities. In addition to the base salary and annual bonus target and an equity component is included in the compensation package.<br/><br/></em><strong>Our Commitments: Icertis is committed to:<br/><br/></strong><ul><li>Icertians (employees) and their family's physical, mental and financial health and wellbeing</li><li>Turbocharging Icertians careers</li><li>Making a social and environmental impact in our communities</li><li>Cultivation and advancing a culture of diversity, equity, inclusion and belonging (DEIB) within our company, customers, and<br/><br/></li></ul>suppliers<br/><br/><ul><li>Generous holidays including the 4th of July week off – paid</li><li>Free professional and leadership coaching</li><li>Annual personal development allowance<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Robust medical (physical &amp; mental vision and dental benefits</li><li>Employee assistance program (EAP)</li><li>Equity (RSUs) and shared ownership in the company</li><li>Generous 401K match</li><li>Flexible work environment</li><li>Paid maternity and paternity leave</li><li>Generous holiday and PTO program</li><li>CaaS (coaching as a service)</li><li>Annual personal development allowance</li><li>7 Days for Humanity – 7 paid volunteer days annually</li><li>Global and regional DEIB steering committees, employee resource groups (ERGs)</li><li>Global DEIB training programs and guest speakers throughout the year<br/><br/></li></ul>Icertis, Inc. provides Equal Employment Opportunity to all employees and applicants for employment without regard to race, color, religion, gender identity or expression, sex, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Icertis, Inc. complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. If you are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to careers@icertis.com or get in touch with your recruiter.<br/><br/>By submitting your application you acknowledge that you have read Icertis’s Privacy Policy ( https://www.icertis.com/privacy-statement/ )<br/><br/>Icertis is not open to third party solicitation or resumes for our posted FTE positions. Resumes received from third party agencies that are unsolicited will be considered complimentary.<br/><br/>", "responsibilities": "<ul><li>Lead assigned monthly close activities, including preparation of journal entries, intercompany transactions, account reconciliations, etc.</li><li>Conduct monthly, quarterly and annual variance analysis to ensure resulting financial statement results accurately reflect business activity and are in accordance with US GAAP.</li><li>Engage in ad hoc technical research and will add to the technical accounting bench for the team.</li><li>Contribute to the implementation and maintenance of the Company's internal control system.</li><li>Develop and establish accounting policies, thresholds, and procedures.</li><li>Collaborate cross-functionally to analyze accounting impacts of anticipated business transactions.</li><li>Drive continuous improvement initiatives, identifying opportunities for improvement to support scalable accounting processes, including systems implementations, to ensure compliance and accuracy of financial results.</li><li>Prepare audit-ready support documentation for external auditors.</li><li>Support various ad-hoc projects as needed.<br/><br/></li></ul>", "qualifications": {"required": "3 + years of combined public and private accounting experience, preferably at a publicly traded company. CPA certification is strongly preferred.", "preferred": "Exceptional attention to detail and the ability to analyze underlying data to address unexpected occurrences., Ability to thrive in a fast-paced environment, manage competing priorities, and meet tight deadlines., In-depth knowledge of US GAAP and Sarbanes-Oxley (SOX) internal control requirements., Excellent written and verbal communication skills, with the ability to tailor communication to the audience., Strong problem-solving and decision-making skills in a high-growth environment., High emotional intelligence with the ability to build and sustain relationships within and outside of the finance team., Experience with NetSuite ERP or similar systems., Bachelor’s degree in Business Administration or Accounting., Understanding of foreign exchange (FX) and consolidation is a plus., Passion for creating detailed workbooks and account reconciliations that tell a story."}, "skills": ["US GAAP", "Sarbanes-Oxley", "NetSuite ERP", "Accounting", "Financial Reporting", "Internal Controls", "Financial Analysis", "Communication", "Problem Solving", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Robust medical (physical & mental vision and dental benefits, Employee assistance program (EAP), Equity (RSUs) and shared ownership in the company, Generous 401K match, Flexible work environment, Paid maternity and paternity leave, Generous holiday and PTO program, CaaS (coaching as a service), Annual personal development allowance, 7 Days for Humanity – 7 paid volunteer days annually, Global and regional DEIB steering committees, employee resource groups (ERGs), Global DEIB training programs and guest speakers throughout the year", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3977049684"}