{"jobTitle": "Logistics Specialist", "company": {"name": "Workhouse", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "World Centric is a highly mission driven company that seeks to have a meaningful impact on people and planet through our compostable products and the donation of 25% of profits to the most vulnerable in the world. World Centric aims to build a strong team with diverse backgrounds and experience, with the common vision of making a positive impact on people and planet. If you meet some, but not all of the requirements, we urge you to apply anyway. For more information on working and life at World Centric, please visit our website .<br/><br/><strong>Scope<br/><br/></strong>The Logistics Specialist will have various responsibilities related to the overall material flow, product and service oversight, process improvement and implementation, system enhancement, and supply chain support. This includes gathering, analyzing, and interpreting data and metrics to identify opportunities to improve overall service, efficiency, and cost for the company. The individual will execute day-to-day processes with internal teams and 3PL partners and will recommend and implement improvements to optimize the Supply Chain. Specific duties include inventory control, coordinating critical parts, and integrating with third parties. The Logistics Specialist acts as a liaison between Account Management and Logistics teams, contributing to concept development, product knowledge coordination, data analysis, and process improvement efforts. Additionally, they will evaluate metrics to enhance customer satisfaction and uphold service commitments at our distribution center.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Utilizes Logistics expertise and data assessment to recommend and implement applicable changes to processes and reporting to optimize cost, service, and productivity.</li><li>Reviews logistics processes and procedures; identifies, recommends, and implements improvements to maximize delivery performance while minimizing costs.</li><li>Provides performance feedback to 3rd party transportation and warehousing providers</li><li>Assists with freight bill audit and payment (FBAP) of international and domestic freight invoices through ERP systems and 3rd party reporting.</li><li>Tracks product flow from origin to delivery via web-based logistics systems and other appropriate methods of monitoring shipments.</li><li>Help manage shipment exceptions and uses learnings to improve processes.</li><li>Maintains and helps enhance accuracy of logistics databases.</li><li>Reviews and analyzes Logistics costs, procurement and delivery processes, inventory issues such as back orders, and other fulfillment metrics.</li><li>Help organize Logistics inquiries and communication between internal and external parties.</li><li>Use exception-based planning to identify and resolve fulfillment and distribution issues in real time.</li><li>Develop processes to track and improve visibility and performance of DCs</li><li>Provides status updates and recommendations to internal stakeholders.</li><li>Support international and domestic transportation processes and activities as needed.</li><li>Performs other related duties, as assigned.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>2+ years’ experience working in Logistics or Supply Chain Management</li><li>Bachelor’s degree in Supply Chain Management, Industrial Engineering, or related study OR 5+ years’ experience working in similar roles.</li><li>Ability to learn quickly, be highly organized, able to multitask and work independently in a fast paced and changing environment within an office or remote setting.</li><li>Experience with MS Office Suite (specifically Word, Excel, and PowerPoint), ERP order management systems (NetSuite), and inventory management are a plus.</li><li>Extensive knowledge of Transportation and Distribution channels.</li><li>Excellent internal and external customer service skills with the ability to use judgment and tact, always putting the customer first. Experience working with and tailoring replies based on customer importance and size.</li><li>Strong interpersonal skills; patient, enthusiastic and professional.</li><li>Awareness and understanding of environmental and social issues.</li><li>Excellent analytical and problem-solving skills.</li><li>Excellent written and verbal communication skills.<br/><br/></li></ul>This position is a remote role so candidates are expected to have a functional remote work office that is free from distraction. World Centric offers a competitive compensation package with base salary, benefits, and bonus. The listed range is based on the range we expect to pay for the position. Actual salary offered is dependent on factors such as geographic location and experience. World Centric welcomes applicants from all backgrounds and aims to find the people who not only meet the requirements of the job but also contribute to the culture in a way that recognizes our efforts towards the overall wellbeing of people and planet.", "jobFunction": "Management and Manufacturing", "industry": "Investment Management", "postedDate": "1 month ago", "skills": ["Logistics", "Supply Chain Management", "MS Office Suite", "Word", "Excel", "PowerPoint", "ERP", "NetSuite", "Inventory Management", "Transportation", "Distribution", "Customer Service", "Problem Solving", "Communication"], "url": "https://www.linkedin.com/jobs/view/3977478670"}