{"jobTitle": "Automotive Internet Sales Associate", "company": {"name": "Subaru of Glendale", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing", "description": "Automotive Internet Sales Associate @ The #1 Subaru Dealer in America<br/><br/>Glendale, CA<br/><br/>The #1 Subaru Dealer in America is currently looking for Internet Sales Associates to join our team! If you have interest in working in a fast-paced, high-reward industry; you've come to the right place. At our dealership, we value our employees as human capital and an essential part of why we're able to provide our customers with the best. Our promise is to keep delivering the same award winning service and value that our community has come to expect from our dealership through the years.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Nurture enriching relationships to build clientele for life</li><li> Exhibit consultative selling skills. Assist customers in selecting a vehicle by asking questions and listening carefully to their responses</li><li> Continuously develop product and sales acumen to become the vehicle authority. Know the in’s and the out’s of product offerings, optional packages, and the latest technologies</li><li> Perform high-quality, professional demonstrations of new/used vehicles</li><li> Follow-up with buyers to ensure successful referral business</li><li> Learn to overcome objections and thrive within sales situations</li><li> Report directly to the Sales Manager regarding objectives, planned activities, reviews, and analyses</li><li> Bring your ‘A game’ along with a positive attitude to work with you every single day<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Available to work flexible hours and weekends</li><li> Self-starter mentality and ambitious spirit preferred</li><li> Ready to waste no time on learning new product in’s and out’s, eager to improve</li><li> Phenomenal communication skills with customers and team members</li><li> Professional, well-groomed personal appearance</li><li> Clean driving record and valid driver’s license<br/><br/><br/></li></ul>We are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3977819709"}