{"jobTitle": "Junior Talent Manager", "company": {"name": "PRELUDE MANAGEMENT, LLC.", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00/yr - 65,000.00/yr", "currency": "USD"}, "description": "Prelude Management is a digital talent management company dedicated to nurturing and representing top-tier content creators across various industries, including entertainment, fashion, beauty, and media. We are committed to providing exceptional service to our clients and fostering long-lasting, successful careers.\n\nPosition Overview: This junior-level position is ideal for someone passionate about the digital space and eager to learn the ins-and-outs of talent management. The Junior Talent Manager will work closely the CEO in all facets of talent representation and development, offer support to the team and the company’s roster of managed talent. This role involves assisting in campaign coordination, pitching to brands, and handling administrative tasks critical to daily operations. You will act as a key link between talent and brands/agencies, ensuring the seamless execution of all campaigns.\n\nResponsibilities:\n\n* Provide administrative support to the CEO in the day-to-day management of talent clients, including scheduling, contract negotiations, and planning.\n* Schedule shoot dates, coordinate content calendars, oversee shipments and arrange preview and live dates\n* Coordinate and facilitate meetings and attend events & set visits with talent.\n* Project manage partnerships with talent from post-contract phase through campaign completion, including short and long-term influencer programs. \n* Show interest in and willingness to identify new influencers and podcasts.\n* Develop influencer strategies to meet campaign KPIs.\n* Prepare and review client content.\n* Monitor and report influencer performance.\n* Prepare, submit, and update proposals and presentations in a timely and efficient manner.\n* Draft and/or update contracts.\n* Conduct industry research to stay informed about trends, opportunities, and potential brand partners.\n* Identify new opportunities including endorsements, partnerships and affiliate opportunities for talent.\n* Handle administrative tasks such as managing ongoing correspondence between clients and brands.\n* Work with the company’s business manager to ensure invoices are submitted accurately and on time.\n\nEssential Functions:\n\n* Build relationships with brands and agencies to drive new business.\n* Demonstrate interest to understand the contract process, rates and negotiations.\n* Commit to furthering individual industry knowledge and professional growth & development.\n\nRequired Experience:\n\n* 3-5 years of administrative assistant experience in a related field (i.e. Talent Agency and/or Management, PR, Marketing).\n* 2-4 years of project management experience in a related field. (i.e. Social Media, Talent Agency and/or Management, PR, Marketing).\n* Clear understanding of the differences in all social media platforms.\n* Strong written, verbal, and visual presentation communication skills.\n* Excellent interpersonal skills; ability to interact with all personality types and behaviors; flexibility and adaptability.\n* Ability to work efficiently in a fast-paced environment with a high-volume email/workload.\n* Proactive, organized, and detail-oriented work style.\n* Ability to work against deadlines.\n* A passion for social media and an interest in developing talent relationships.a\n* In depth knowledge of and experience using Instagram, YouTube, TikTok, Facebook, Snap etc.\n* Knowledge of Google Analytics.\n\nOccasional travel may be required.", "responsibilities": "Provide administrative support to the CEO in the day-to-day management of talent clients, including scheduling, contract negotiations, and planning. Schedule shoot dates, coordinate content calendars, oversee shipments and arrange preview and live dates Coordinate and facilitate meetings and attend events & set visits with talent. Project manage partnerships with talent from post-contract phase through campaign completion, including short and long-term influencer programs.  Show interest in and willingness to identify new influencers and podcasts. Develop influencer strategies to meet campaign KPIs. Prepare and review client content. Monitor and report influencer performance. Prepare, submit, and update proposals and presentations in a timely and efficient manner. Draft and/or update contracts. Conduct industry research to stay informed about trends, opportunities, and potential brand partners. Identify new opportunities including endorsements, partnerships and affiliate opportunities for talent. Handle administrative tasks such as managing ongoing correspondence between clients and brands. Work with the company’s business manager to ensure invoices are submitted accurately and on time.", "qualifications": {"required": "3-5 years of administrative assistant experience in a related field (i.e. Talent Agency and/or Management, PR, Marketing). 2-4 years of project management experience in a related field. (i.e. Social Media, Talent Agency and/or Management, PR, Marketing). Clear understanding of the differences in all social media platforms. Strong written, verbal, and visual presentation communication skills. Excellent interpersonal skills; ability to interact with all personality types and behaviors; flexibility and adaptability. Ability to work efficiently in a fast-paced environment with a high-volume email/workload. Proactive, organized, and detail-oriented work style. Ability to work against deadlines. A passion for social media and an interest in developing talent relationships.a In depth knowledge of and experience using Instagram, YouTube, TikTok, Facebook, Snap etc. Knowledge of Google Analytics."}, "skills": ["Social Media", "Talent Management", "Project Management", "Administrative Support", "Contract Negotiation", "Influencer Marketing", "Campaign Management", "Brand Partnerships", "Communication", "Presentation Skills", "Interpersonal Skills", "Google Analytics", "Instagram", "YouTube", "TikTok", "Facebook", "Snap"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977113945"}