{"jobTitle": "Procurement Manager - Professional Services, AMS", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "101,000.00/yr - 175,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/> About TikTok<br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible.<br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day.<br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always.<br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve.<br/>Join us.<br/><br/>The Procurement team aims to provide high-quality purchasing solutions and establish a global platform for purchasing resources. Through providing professional management of procurement resources, selecting high-quality suppliers, and managing supplier performance, we aim to improve the efficiency, cost-effectiveness and compliance of our company's procurement behavior, fostering a healthy long-term business environment.<br/><br/>We are seeking an experienced Procurement Manager to oversee our company's service outsourcing activities. The role involves strategizing to secure cost-effective deals and suppliers, identifying resources to support rapidly growing businesses across various segments and regions, engaging with key stakeholders to determine valid demands and optimal supplier strategies, and ensuring business compliance for effective risk control.<br/><br/>Responsibilities:<br/>- Oversee sourcing for company services including consulting, research and reporting, outsourcing, and insurance.<br/>- Implement and optimize procurement processes to enhance efficiency and reduce costs.<br/>- Support and participate in all sourcing activities, building expertise in procurement project management.<br/>- Collaborate closely with business owners, applying strong business acumen to define procurement and supply strategies; provide feasible and innovative advice to help businesses scale quickly.<br/>- Conduct in-depth analysis of the global outsourcing service industry, benchmarking categories, and analyzing necessary data to select high-quality and cost-effective vendors.<br/>- Manage supplier deliverables, establish performance measurement systems to increase vendor competition, secure supply, and enhance efficiency and flexibility. <br/><br/>Qualifications<br/><br/> Minimum Qualifications: <br/>- 5+ years of progressive experience within the Professional Services indirect category <br/>- Proficient in negotiation and contract management.<br/>- Outstanding communication and interpersonal skills.<br/>- Skilled in data analysis, decision-making, and complex problem-solving.<br/>- Capable of handling ambiguity, managing conflicts, and navigating change.<br/>- Willingness to travel within the region as needed.<br/><br/>Preferred Qualifications:<br/>- Professional certifications in procurement (e.g., CSCP, CPM, CPP, or equivalent).<br/>- Prior experience working in fast-paced multinational companies, preferably within the tech industry.<br/>- In-depth knowledge of procurement regulations, best practices, and market trends in the region.<br/>- Familiarity with procurement software and tools such as SAP and Coupa.<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $101000 - $175000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Oversee sourcing for company services including consulting, research and reporting, outsourcing, and insurance.\n- Implement and optimize procurement processes to enhance efficiency and reduce costs.\n- Support and participate in all sourcing activities, building expertise in procurement project management.\n- Collaborate closely with business owners, applying strong business acumen to define procurement and supply strategies; provide feasible and innovative advice to help businesses scale quickly.\n- Conduct in-depth analysis of the global outsourcing service industry, benchmarking categories, and analyzing necessary data to select high-quality and cost-effective vendors.\n- Manage supplier deliverables, establish performance measurement systems to increase vendor competition, secure supply, and enhance efficiency and flexibility.", "qualifications": {"required": "- 5+ years of progressive experience within the Professional Services indirect category \n- Proficient in negotiation and contract management.\n- Outstanding communication and interpersonal skills.\n- Skilled in data analysis, decision-making, and complex problem-solving.\n- Capable of handling ambiguity, managing conflicts, and navigating change.\n- Willingness to travel within the region as needed.", "preferred": "- Professional certifications in procurement (e.g., CSCP, CPM, CPP, or equivalent).\n- Prior experience working in fast-paced multinational companies, preferably within the tech industry.\n- In-depth knowledge of procurement regulations, best practices, and market trends in the region.\n- Familiarity with procurement software and tools such as SAP and Coupa."}, "skills": [], "postedDate": "1 week ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3977798362"}