{"jobTitle": "Operations and Project Analyst", "company": {"name": "California State University, Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "Job No: 541268; 07/18/2024<br/><br/>Operations and Project Analyst<br/><br/><strong>Administrative Analyst/Specialist - Exempt II<br/><br/></strong>Office of Strategic Communications<br/><br/><strong>Salary Range</strong><strong>:</strong> $5,273 - $9,537/Monthly (Budgeted Hiring Salary Range: $5,273 - $7,500/Monthly)<br/><br/><strong>Work Schedule</strong><strong>:</strong> Full-Time, Monday - Friday, 8:00 a.m. to 5:00 p.m.; exempt classification.<br/><br/><strong>Essential Functions</strong><strong>:</strong> The Operations and Project Analyst, under general direction of the Executive Director of Strategic Communications, fulfills a dual responsibility. The Analyst leverages project management expertise to lead strategic communication initiatives that overlap multiple functional areas. The Analyst gathers and synthesizes market research, tracks project success measures, participates in project evaluation, and visualizes data for reporting. As a primary point of contact for department stakeholders and university executives, the Analyst develops and sustains key relationships. For department operations, the Analyst develops annual budgets, tracks budget expenditures, advises on efficient resource allocation and staffing levels, and ensures the flow of critical information. Working with the Executive Director, the incumbent assesses departmental needs, formulates plans, and sets timelines for the development of policy, protocol, and practice. Independently, the Analyst develops innovative approaches to complex administrative challenges, addressing long-term departmental goals consistent with broad internal and external expectations. The Analyst may be asked to support media relations and issue-based communications as needed.<br/><br/><strong>Required Qualifications &amp; Experience</strong><strong>:</strong> A minimum of five years’ professional experience in communications, public affairs, marketing, and/or advancement programs. Demonstrated grasp of public administration principles, public sector employment regulations, and department-level financial and personnel process management. Strong editing and proofreading skills. Excellent customer service approach. Experience interpreting data and developing strategic solutions based on sound conclusions. Experience working with diverse stakeholders in a multicultural/multi-ethnic environment. Experience navigating sensitive situations, handling confidential employment information, and fostering consensus through strong communication and collaboration. Experience in a position of trust in the management of contracts and financial transactions. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022 the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/><strong>Desired Qualifications</strong><strong>:</strong> Bachelor's degree preferred. Bilingual. Experience in a public higher education setting. Experience navigating a common management system (e.g., the CSU Common Financial System, other Oracle Peoplesoft applications, or similar product such as Ellucian Banner).<br/><br/><strong>Closing Date</strong><strong>:</strong> Review of applications will begin on 8/1/2024 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A COMPLETED ON-LINE CAL STATE LA EMPLOYMENT APPLICATION IS REQUIRED. RESUMES WILL NOT BE ACCEPTED IN LIEU OF A COMPLETED APPLICATION.<br/><br/>The person holding this position is considered a \"mandated reporter\" under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 revised July 21, 2017, as a condition of employment.<br/><br/>In addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.<br/><br/>Candidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.<br/><br/><strong>To Obtain Employment Information For The Impaired Call<br/><br/></strong>TDD Line (323) 343-3670<br/><br/>24-hour Dial-A-Job Line (323) 343-3678", "responsibilities": "The Operations and Project Analyst, under general direction of the Executive Director of Strategic Communications, fulfills a dual responsibility. The Analyst leverages project management expertise to lead strategic communication initiatives that overlap multiple functional areas. The Analyst gathers and synthesizes market research, tracks project success measures, participates in project evaluation, and visualizes data for reporting. As a primary point of contact for department stakeholders and university executives, the Analyst develops and sustains key relationships. For department operations, the Analyst develops annual budgets, tracks budget expenditures, advises on efficient resource allocation and staffing levels, and ensures the flow of critical information. Working with the Executive Director, the incumbent assesses departmental needs, formulates plans, and sets timelines for the development of policy, protocol, and practice. Independently, the Analyst develops innovative approaches to complex administrative challenges, addressing long-term departmental goals consistent with broad internal and external expectations. The Analyst may be asked to support media relations and issue-based communications as needed.", "qualifications": {"required": "A minimum of five years’ professional experience in communications, public affairs, marketing, and/or advancement programs. Demonstrated grasp of public administration principles, public sector employment regulations, and department-level financial and personnel process management. Strong editing and proofreading skills. Excellent customer service approach. Experience interpreting data and developing strategic solutions based on sound conclusions. Experience working with diverse stakeholders in a multicultural/multi-ethnic environment. Experience navigating sensitive situations, handling confidential employment information, and fostering consensus through strong communication and collaboration. Experience in a position of trust in the management of contracts and financial transactions. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.", "preferred": "Bachelor's degree preferred. Bilingual. Experience in a public higher education setting. Experience navigating a common management system (e.g., the CSU Common Financial System, other Oracle Peoplesoft applications, or similar product such as Ellucian Banner)."}, "skills": [], "postedDate": "1 month ago", "salary": {"amount": "5,273 - 9,537/Monthly", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3977108519"}