{"jobTitle": "Community Sales Manager- Riverside County", "company": {"name": "Taylor Morrison", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Management", "industry": "Real Estate", "description": "<strong>Job Description Summary<br/><br/></strong>As a Community Sales Manager working for Taylor Morrison you will be working in one of our state-of-the-art models greeting and registering future homeowners, answering phones, and have an exciting opportunity to help a person’s dream of owning a TM home come true.<br/><br/><strong>Job Details<br/><br/></strong><strong>We trust that as a Community Sales Manager you will: (responsibilities)<br/></strong><ul><li>Manage and maintain your model and community as if it were your personal retail business.</li><li>Open a minimum of 15 minutes early, complete full model opening process (including all lights on, replacing burned out bulbs, put the toilet seats down, turn on all technology, sweep entryways, remove bugs on window sills, bathrooms and behind doors, remove debris from the landscaping, remove trash from trash cans, unlock all doors etc.)</li><li>Conduct weekly customer care calls and community team meetings to review the status of the community backlog, closings, starts, customer issues/concerns, and community and model maintenance items. The day and time of the meeting varies per division. If anyone is on vacation, it is the responsibility of the sales representative to schedule the meeting on a different day due to the absence</li><li>Maintain clean and complete inventory of all sales collateral (price sheets, community information etc.)</li><li>Maintain flags and exterior signage. They should be clean and look like new</li><li>Maintain the interior and exterior of the models. They should look like opening day every day</li><li>Complete the buying experience with every customer until the CUSTOMER ends the process</li><li>Get a commitment from each prospect by: contract, home-site reservation, appointment with day and time, or telephone appointment with day and time</li><li>Be a great team player for your sales partner, construction team, design studio coordinators, mortgage team, customer care coordinators, title company and ce team</li><li>Complete the required follow-up with all internal customers and prospects by telephone and take good notes</li><li>Complete weekly buyer telephone follow-up calls to keep customers up to date on the status of their home. The call must be initiated by sales. When a buyer initiates a call, that call does not count as one of the weekly calls and neither will a visit initiated by the buyer</li><li>Execute clean and precise paperwork, and submit all contract documents and earnest money deposits it in a timely manner per your division’s policies. If not policy is set in writing then all documents needs to be submitted within 24 business hours</li><li>Maintain knowledge and status of your buyer’s mortgage process and what is still missing and ensure constant communication with mortgage personnel and your buyers to ensure that all mortgage paperwork is submitted in a timely fashion</li><li>Maintain knowledge and status of Design Studio process, stay in touch with Design Studio on how the process is going and when sign off is complete</li><li>Attend all pre-construction meetings when possible – these are not to\u2028be scheduled during your weekly community team meetings. Community team meeting agendas are to be emailed to sales and construction management.</li><li>Adhere to all company policies and procedures</li><li>Set outstanding expectations for how we do business</li><li>Develop and implement a lead generation plan. In order to meet\u2028and exceed sales goals, a sales professional must be proactive in generating leads, and must constantly hone their sales skills in order to convert the greatest number of leads possible. Sources of new leads include: existing homeowners, current purchasers, REALTORS apartment dwellers, business owners/leaders, personal affiliations, neighboring older communities and corporate driven leads. The methods to reach out to these new leads are: direct mail, flyers, office visits for presentations, gifts/incentives (real estate agent community only), scheduled follow up letters, e-blasts, and telephone calls to any and all prospects</li><li>Understand how to read blueprints and know all the options that are offered in your community</li><li>Maintain a current inventory list (if applicable). Walk inventory homes on a regular basis to make sure they are clean, punched out, smell good and look immaculate</li><li>Be knowledgeable about the HOA deeds, school system, public report, community covenants and restrictions for your communities. Sell homes in accordance with those rules</li><li>Always work with a positive attitude, readiness (and explanation of “why” when people have questions), and integrity.</li><li>Be a problem solver and recommend solutions</li><li>Professional appearance and neat car at all times \u2028</li><li>Walk your customer’s home at least once every two weeks \u2028</li><li>Meet or exceed sales and closing goals every month. All sales must be e-mailed to sales management after the purchase agreement is complete on the required sales report\u2028</li><li>Register all prospects and record them in MSCRM immediately according to the Prospect Registration Policy. They should be recorded as indicated in examples below. \u2028</li><li>Shop the competition and complete CMA tools</li><li>Attend all sales meetings and trainings as scheduled</li><li>You are willing to perform other duties as assigned<br/></li></ul><strong>What you will need: (competencies, behaviors &amp; attributes) <br/><br/></strong><ul><li>Creativity</li><li>Customer Focus</li><li>Ethics &amp; Integrity</li><li>Persistence</li><li>Relentless/Perseverance</li><li>Resilience<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>Active Real Estate License (where applicable by state)</li><li>Preferred candidates who reside in Riverside County</li><li>You are proficient in all Microsoft Office Applications as well as have savvy computer skills</li><li>You are very organized and good at documentation</li><li>You are customer service oriented and believe customer is number one priority</li><li>You understand the need to be flexible and prioritize tasks in order to meet deadlines <br/><br/></li></ul><strong>FLSA Status: </strong><strong>Non-Exempt<br/><br/></strong><strong><strong>Pay Range: $28.37/hourly plus commission <br/><br/></strong></strong><strong>Will Have Responsibilities Such As<br/><br/></strong><ul><li>Meet with prospects to show and sell in a Taylor Morrison community the prospects a real estate property which could be a developed lot, a home under construction, a model home, or a completed home </li><li>Tour with and demonstrate to prospects model homes and home sites within the Taylor Morrison community, visiting non-Taylor Morrison real estate sales agents and brokers in their offices or elsewhere, perform inspection of competing neighborhoods and communities, tour the Taylor Morrison community to ensure that it is attractive to prospective customers, and meet with construction personnel to ensure customer satisfaction throughout the sale and construction of the new home</li><li>Work out of a temporary sales facility that is typically a garage in a model home (or could be a trailer in the Taylor Morrison community) that is transformed into a temporary sales office that serves as a place to meet prospects.</li><li>Take the prospect out to the various home sites within the Taylor Morrison community. Leave the model home sales office (or trailer) for a minimum two hours a day, two times a week to engage in selling or sales-related activities</li><li>Perform a variety of marketing efforts in conjunction with accomplishing a sale such as completing paperwork, prospecting customers, creating customer contact lists, developing promotional materials, following up with customers, scheduling appointments, and calling non-Taylor Morrison real estate sales agents and brokers to generate interest in Taylor Morrison homes<br/><br/></li></ul><strong>Essential Functions<br/><br/></strong>Successful job applicants will be able to perform these functions. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Report to Division/Corporate Office/Community daily and adhere to schedule</li><li>Ability to access, input, and retrieve information from a computer and/or electronic device</li><li>Ability to have face to face conversations with customers, co-workers and higher level manager</li><li>Ability to sit or stand for long periods of time and move around work environment as needed</li><li>Ability to operate a motor vehicle if applicable</li><li>Comply with company policies and procedure<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Must be able to able to remain in a stationary position up to 50% of the time</li><li>The ability to frequently lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds</li><li>Taylor Morrison experience and/or successful completion of training program may override required education and/or experience requirement.<br/><br/></li></ul>Job descriptions are not intended as, nor should be construed to be, exhaustive lists of all responsibilities, skills, efforts, or working conditions associated with a job. They are intended to be accurate reflections of those principal job duties and responsibilities essential for making fair pay decisions about the job.<br/><br/><strong>Benefits Of Working With Taylor Morrison<br/><br/></strong>We are looking for dedicated professionals that share our values of putting the customer - and their needs - first. In addition to a great team atmosphere, career development and advancement opportunities, we offer full-time employees an extensive benefits package, to include:<br/><br/><ul><li>Competitive Compensation</li><li>Health Care - Medical/Dental/Visio n/Prescription Drug Coverage</li><li>401(k) with Company Matching Contributions</li><li>Flexible Spending Accounts</li><li>Disability Programs</li><li>Employee &amp; Dependent Life Insurance</li><li>Vacation &amp; Company Holidays</li><li>Tuition Reimbursement</li><li>Employee Home Purchase Rebate Program</li><li>Home Mortgage Program</li><li>Employee Assistance Program (EAP)<br/><br/></li></ul>", "responsibilities": "Manage and maintain your model and community as if it were your personal retail business.Open a minimum of 15 minutes early, complete full model opening process (including all lights on, replacing burned out bulbs, put the toilet seats down, turn on all technology, sweep entryways, remove bugs on window sills, bathrooms and behind doors, remove debris from the landscaping, remove trash from trash cans, unlock all doors etc.)Conduct weekly customer care calls and community team meetings to review the status of the community backlog, closings, starts, customer issues/concerns, and community and model maintenance items. The day and time of the meeting varies per division. If anyone is on vacation, it is the responsibility of the sales representative to schedule the meeting on a different day due to the absenceMaintain clean and complete inventory of all sales collateral (price sheets, community information etc.)Maintain flags and exterior signage. They should be clean and look like newMaintain the interior and exterior of the models. They should look like opening day every dayComplete the buying experience with every customer until the CUSTOMER ends the processGet a commitment from each prospect by: contract, home-site reservation, appointment with day and time, or telephone appointment with day and timeBe a great team player for your sales partner, construction team, design studio coordinators, mortgage team, customer care coordinators, title company and ce teamComplete the required follow-up with all internal customers and prospects by telephone and take good notesComplete weekly buyer telephone follow-up calls to keep customers up to date on the status of their home. The call must be initiated by sales. When a buyer initiates a call, that call does not count as one of the weekly calls and neither will a visit initiated by the buyerExecute clean and precise paperwork, and submit all contract documents and earnest money deposits it in a timely manner per your division’s policies. If not policy is set in writing then all documents needs to be submitted within 24 business hoursMaintain knowledge and status of your buyer’s mortgage process and what is still missing and ensure constant communication with mortgage personnel and your buyers to ensure that all mortgage paperwork is submitted in a timely fashionMaintain knowledge and status of Design Studio process, stay in touch with Design Studio on how the process is going and when sign off is completeAttend all pre-construction meetings when possible – these are not to\u2028be scheduled during your weekly community team meetings. Community team meeting agendas are to be emailed to sales and construction management.Adhere to all company policies and proceduresSet outstanding expectations for how we do businessDevelop and implement a lead generation plan. In order to meet\u2028and exceed sales goals, a sales professional must be proactive in generating leads, and must constantly hone their sales skills in order to convert the greatest number of leads possible. Sources of new leads include: existing homeowners, current purchasers, REALTORS apartment dwellers, business owners/leaders, personal affiliations, neighboring older communities and corporate driven leads. The methods to reach out to these new leads are: direct mail, flyers, office visits for presentations, gifts/incentives (real estate agent community only), scheduled follow up letters, e-blasts, and telephone calls to any and all prospectsUnderstand how to read blueprints and know all the options that are offered in your communityMaintain a current inventory list (if applicable). Walk inventory homes on a regular basis to make sure they are clean, punched out, smell good and look immaculateBe knowledgeable about the HOA deeds, school system, public report, community covenants and restrictions for your communities. Sell homes in accordance with those rulesAlways work with a positive attitude, readiness (and explanation of “why” when people have questions), and integrity.Be a problem solver and recommend solutionsProfessional appearance and neat car at all times \u2028Walk your customer’s home at least once every two weeks \u2028Meet or exceed sales and closing goals every month. All sales must be e-mailed to sales management after the purchase agreement is complete on the required sales report\u2028Register all prospects and record them in MSCRM immediately according to the Prospect Registration Policy. They should be recorded as indicated in examples below. \u2028Shop the competition and complete CMA toolsAttend all sales meetings and trainings as scheduledYou are willing to perform other duties as assigned<br/></ul>", "qualifications": {"required": "Active Real Estate License (where applicable by state)Preferred candidates who reside in Riverside CountyYou are proficient in all Microsoft Office Applications as well as have savvy computer skillsYou are very organized and good at documentationYou are customer service oriented and believe customer is number one priorityYou understand the need to be flexible and prioritize tasks in order to meet deadlines <br/><br/>", "preferred": ""}, "skills": ["Microsoft Office", "Customer Service", "Sales", "Real Estate"], "postedDate": "2 weeks ago", "benefits": "Competitive CompensationHealth Care - Medical/Dental/Visio n/Prescription Drug Coverage401(k) with Company Matching ContributionsFlexible Spending AccountsDisability ProgramsEmployee & Dependent Life InsuranceVacation & Company HolidaysTuition ReimbursementEmployee Home Purchase Rebate ProgramHome Mortgage ProgramEmployee Assistance Program (EAP)<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977984416"}