{"jobTitle": "Architect (Unreal Engine)", "company": {"name": "Zynga", "industry": "Computer Games", "size": "Large", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$149,800.00 - $221,680.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Computer Games, Software Development, and Entertainment Providers", "description": "At Zynga, we are a leading developer of popular social games enjoyed by millions of players worldwide. We are dedicated to creating fun, engaging, and innovative gaming experiences that bring people together. With a diverse portfolio of hit games, we strive to push the boundaries of interactive entertainment. Join our team and help shape the future of gaming.", "responsibilities": "Drive the definition of the technical architecture for the game on the client side and the coordination with our server technology. Contribute to server technology architecting over time. Collaborate with product managers and producers on analysing feature set complexity, planning releases and delivering code solutions on schedule. Work with the Art, UX and UI disciplines, to improve tools and processes for content creation, import pipelines, prototyping, production and testing. Ensure the creation of well-designed, adaptable and testable software for mobile and other platforms. Sometimes architect and write production ready code yourself. Mentor Senior and Principal engineers from a technical perspective, developing the next generation of Architects. Fostering a tech approach that embraces sustainable live operations, a regular cadence of game updates, and high-quality rapid releases. Ensure the correct management of technical debt. Capture and share knowledge across the team, NaturalMotion and Zynga.", "qualifications": {"required": "Developed and released multiple games with Unreal Engine, as an Architect or hands-on Technical Director, with at least one Game as a Service. Deep experience with C++, plus a detailed understanding of mobile CPU and GPU hardware. You are an authority when it comes to AAA game architecture. Expertise in multiple areas, such as – NPC behaviour, AI, multiplayer, UI / UX, meta game systems, F2P game mechanics, graphics, tools, systems, and game engines. Have deep understanding of design patterns, memory / performance optimisation, and importantly, how to summarise and share your knowledge. A great understanding of mentoring engineers of all levels throughout the game development cycle. Deep experience of being a strategic problem-solver, and be able to collaborate with peers across disciplines when problems stretch across different areas. Ability to present technical challenges, recommendations, and solutions to game leadership level.", "preferred": ""}, "skills": ["Unreal Engine", "C++", "AAA game architecture", "AI", "multiplayer", "UI/UX", "F2P game mechanics", "graphics", "tools", "systems", "game engines"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Competitive salary, bonus plan and ESPP (Employee Stock Purchase Plan). 401K Company Match Contribution (US). Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada). Medical, dental, vision, EAP, life insurance, and disability benefits (US). Virtual mental health and neurodiversity support programs. Global Fitness reimbursement program. Global Wellbeing Program. Financial wellness program with unlimited access to certified financial planners. Discretionary Time Off policy for many employees. Family planning support program. Generous paid parental, pregnancy-related disability, caregiver, and compassionate leaves. Zynga happy hours and frequent employee events. Flexible working hours on many teams. Culture of diversity and inclusion including employee resource groups. Work with cool people and impact millions of daily players.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977560405"}