{"jobTitle": "Sales Strategy and Operations Manager- Channel", "company": {"name": "Miro", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>In RevOps we have a simple (but not easy) mission to drive predictable, scalable, and profitable revenue growth for Miro. You will join a highly motivated, energetic Revenue Operations Team that takes pride in growing customer relationships, running strategic sales cycles, and delivering the Miro value proposition to a diverse base of accounts globally across all segments. You will be in a unique position to have a substantial impact on sales culture and top line and bottom line revenue. Each role at Miro is based at one of our physical hubs and we look for talent that want to be part of these local, collaborative communities. Mironeers work in a hybrid model, with 3 days a week in office culture as our baseline<br/><br/>About The Role<br/><br/>We are seeking a creative experienced Sales Strategy and Operations Manager to support the Global Channel Team at Miro. This role will support multiple indirect routes to market including resellers, distribution partners, solution partners, and AWS Marketplace with the goal of driving new business and expansion in Miro’s core markets as well as supporting our strategic bets in Latin America, Asia, Japan, and Emerging Europe.<br/><br/>This position requires a deep understanding of the SaaS revenue model and partner revenue share structure. You will need to be fluent in reporting and analytics to evaluate the performance of the Channel business, including creating operating KPIs, pressure testing the viability of financial targets, and identifying areas of opportunity. You will also need to develop a deep understanding of the “day in the life” of our partners and Channel Managers to create an end-user experience that minimizes friction while enforcing the required guardrails.<br/><br/>What You’ll Do<br/><br/><ul><li>Analyze partner landscape and identify right partner mix / strategy tied to a value proposition that is beneficial to both Miro and the partner</li><li>Make it easy for partners to do business with Miro</li><ul><li>Partner with Business Technology team to streamline deal registration and optimize the Salesforce PRM configuration. </li><li>Bring our own vision and best practices; seek feedback; iterate; drive consensus; execute. </li><li>Ensure timely and accurate partner rebates administration, payments</li><li>Drive core business cadences to monitor the health of the business (e.g., forecasting, pipeline reviews, QBRs) </li></ul><li>Partner with Finance to report on ROI of the channel program and support annual planning</li><li>Architect and administer partner programs to align with behaviors that create scale and drive growth; define and analyze operating KPIs<br/></li></ul>What You’ll Need<br/><br/><ul><li>6+ years of work experience, including 2+ in channel, partnerships, or business development roles</li><li>Advanced Excel or GSheet skills; knowledge of SQL preferred </li><li>Experience with Quote to Cash and Partner Portal/Deal registration processes </li><li>Ability to thrive in a dynamic environment; create structure out of ambiguity; prioritize effectively; communicate clearly to leadership, manager, and cross-functional partners </li><li>Deep sense of accountability, strong project management, and a commitment to continuous process improvement<br/><br/></li></ul>What's In It For You<br/><br/><ul><li>401k matching + Competitive equity package</li><li>Excellent Medical, Dental and Vision health benefits</li><li>Fertility &amp; Family Forming Benefits</li><li>Flexible time off</li><li>Lunch, snacks and drinks provided in the office</li><li>Wellbeing benefit and WFH equipment allowance</li><li>Annual learning and development allowance to grow your skills and career</li><li>Up to $2,000 of charitable donation matches each year<br/><br/></li></ul>About Miro<br/><br/>Miro is a visual workspace for innovation that enables distributed teams of any size to build the next big thing. The platform's infinite canvas enables teams to lead engaging workshops and meetings, design products, brainstorm ideas, and more. Miro, co-headquartered in San Francisco and Amsterdam, serves more than 60M users worldwide, including 99% of the Fortune 100. Miro was founded in 2011 and currently has more than 1,800 employees in 12 hubs around the world.<br/><br/>We are a team of dreamers. We look for individuals who dream big, work hard, and above all stay humble. Collaboration is at the heart of what we do and through our work together we hope to create a supportive, welcoming, and innovative environment. We strive to play as a team to win the world and create a better version of ourselves every day. If this sounds like something that excites you, we want to hear from you!<br/><br/>Check Out More About Life At Miro<br/><br/><ul><li>Youtube: https://www.youtube.com/@lifeatmiro</li><li>Blog: https://miro.com/careers/life-at-miro/all/</li><li>Instagram: https://www.instagram.com/mirohq/<br/><br/></li></ul>At Miro, we strive to create and foster an environment of belonging and collaboration across cultural differences. Miro’s mission — <em>Empower teams to create the next big thing</em> — is how we think about our product, people, and culture. We believe that creating big things requires diverse and inclusive teams. <em>Diversity</em> invites all talent with different demography, identities and styles <em>to step in</em>, and <em>inclusion</em> invites them to step <em>closer together. </em>Every day, we are working to build a more diverse Miro, cultivate a sense of belonging for future and current Mironeers around the world, and foster an environment where everyone can collaborate and embrace differences.<br/><br/><strong><strong>Miro handles and uses personal data of job applicants in line with its Recruitment Privacy Policy found here.</strong></strong>", "responsibilities": "Analyze partner landscape and identify right partner mix / strategy tied to a value proposition that is beneficial to both Miro and the partner\nMake it easy for partners to do business with Miro\nPartner with Business Technology team to streamline deal registration and optimize the Salesforce PRM configuration. \nBring our own vision and best practices; seek feedback; iterate; drive consensus; execute. \nEnsure timely and accurate partner rebates administration, payments\nDrive core business cadences to monitor the health of the business (e.g., forecasting, pipeline reviews, QBRs) \nPartner with Finance to report on ROI of the channel program and support annual planning\nArchitect and administer partner programs to align with behaviors that create scale and drive growth; define and analyze operating KPIs", "qualifications": {"required": "6+ years of work experience, including 2+ in channel, partnerships, or business development roles\nAdvanced Excel or GSheet skills; knowledge of SQL preferred \nExperience with Quote to Cash and Partner Portal/Deal registration processes \nAbility to thrive in a dynamic environment; create structure out of ambiguity; prioritize effectively; communicate clearly to leadership, manager, and cross-functional partners \nDeep sense of accountability, strong project management, and a commitment to continuous process improvement", "preferred": ""}, "skills": ["Salesforce", "PRM", "Excel", "GSheet", "SQL", "Project Management", "Communication"], "postedDate": "2 weeks ago", "benefits": "401k matching + Competitive equity package\nExcellent Medical, Dental and Vision health benefits\nFertility &amp; Family Forming Benefits\nFlexible time off\nLunch, snacks and drinks provided in the office\nWellbeing benefit and WFH equipment allowance\nAnnual learning and development allowance to grow your skills and career\nUp to $2,000 of charitable donation matches each year", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977668342"}