{"jobTitle": "Technical Sales Representative, Manufacturing", "company": {"name": "Keller Executive Search International", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Our client designs, manufactures and installs automated conveyor systems for distribution centers, retail stores and industrial laundries. Their conveyor systems are often tailor-made. Their sales are mainly centered in the USA and Canada, but they also have customers all around the world.<br/><br/>They are seeking a highly motivated and experienced Technical Sales Representative to join their team. As a Technical Sales Representative, you will be responsible for establishing and maintaining relationships with customers, understanding their needs, and providing technical solutions to meet those needs.<br/><br/><strong>Main Responsibilities:<br/><br/></strong><ul><li>Identify and develop new business opportunities with potential clients</li><li>Build and maintain strong relationships with existing and new customers</li><li>Provide technical support and expertise in product demonstrations and presentations</li><li>Collaborate with internal teams to ensure customer satisfaction and successful project implementation</li><li>Stay up-to-date with industry trends and competitors' activities<br/><br/></li></ul>If you are a self-motivated individual with a passion for sales and engineering, and you thrive in a fast-paced environment, then we want to hear from you. Join our client's team and contribute to their continued success in the manufacturing industry.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in engineering or a related field</li><li>Any Project Management certification such as PMP would be advantegeous</li><li>Minimum of 3 years of experience in technical sales, preferably in manufacturing or industrial sectors</li><li>Strong understanding of the United States and Canadian markets, with the ability to identify key players and emerging opportunities</li><li>Strong communication and presentation skills</li><li>Ability to understand and explain technical concepts effectively to both technical and non-technical individuals</li><li>Proven track record of meeting sales targets and driving revenue growth</li><li>Willingness to travel as needed<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Salary depending on experience</li><li>Flexible hours<br/><br/></li></ul>Equal Employment Opportunity and Non-Discrimination Policy USA<br/><br/>Equal Employment Opportunity Statement: Both Keller Executive Search and our clients are Equal Opportunity Employers. For all positions, whether with Keller Executive Search or our clients, qualified applicants will receive consideration for employment without regard to race, skin color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran status, disability, genetic information, or any other legally protected status.<br/><br/>Commitment to Diversity: Keller Executive Search and its clients are committed to fostering a diverse and inclusive work environment where all individuals are valued and respected.<br/><br/>Reasonable Accommodations: Both Keller Executive Search and our clients are committed to providing reasonable accommodations to individuals with disabilities and pregnant individuals. We engage in an interactive process to determine effective, reasonable accommodations. If you need assistance or an accommodation, please contact us at assistance@kellerexecutivesearch.com.<br/><br/>Compensation Information: For client positions, compensation information is available in the job post. If not provided, it will be shared during the interview process in accordance with applicable laws. When required by law, salary ranges will be included in job postings. Actual salary may depend on skills, experience, and comparison to current employees in similar roles. Salary ranges may vary based on role and location.<br/><br/>Compliance with Laws: Both Keller Executive Search and our clients comply with federal, state, and local laws governing nondiscrimination in employment. This policy applies to all employment terms and conditions, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/>Workplace Harassment: Both Keller Executive Search and our clients expressly prohibit any form of workplace harassment based on race, skin color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.<br/><br/>E-Verify Participation: Keller Executive Search and/or our clients may participate in E-Verify. Information about E-Verify participation will be provided during the application process where applicable.<br/><br/>Privacy and Pay Equity:<br/><br/><ul><li>California Residents: For more information about the categories of personal information we collect for recruiting and employment purposes, please review our Privacy Policy at www.kellerexecutivesearch.com. </li><li>Colorado, Nevada, New York City, California, and Washington Residents: Compensation information is available in the job post or will be provided during the interview process if not initially available. </li><li>Both Keller Executive Search and our clients are committed to pay equity and conduct periodic pay equity analyses in accordance with applicable laws. <br/><br/></li></ul>State-Specific Information:<br/><br/><ul><li>Rhode Island: We do not request or require salary history from applicants. </li><li>Connecticut: We provide wage range information upon request or before discussing compensation. </li><li>New Jersey: We do not inquire about salary history unless voluntarily disclosed. <br/><br/></li></ul>Veteran Status: Both Keller Executive Search and our clients provide equal employment opportunities to veterans and comply with applicable state laws regarding veteran preference in employment. If you are a veteran, please inform us during the application process.<br/><br/>Genetic Information: In accordance with federal and state laws, both Keller Executive Search and our clients do not discriminate based on genetic information. We do not request or require genetic information from applicants or employees, except as permitted by law.<br/><br/>Local Laws: Both Keller Executive Search and our clients comply with all applicable local laws and ordinances regarding employment practices in the areas where we operate.<br/><br/>Additional Assistance: If you need further assistance to fully engage in our application process, please contact assistance@kellerexecutivesearch.com.<br/><br/>Note: This job posting may be for a position with Keller Executive Search or one of our clients. The specific employer will be identified during the application and interview process. Employment laws and requirements may vary depending on the employer and location.", "responsibilities": "Identify and develop new business opportunities with potential clients\nBuild and maintain strong relationships with existing and new customers\nProvide technical support and expertise in product demonstrations and presentations\nCollaborate with internal teams to ensure customer satisfaction and successful project implementation\nStay up-to-date with industry trends and competitors' activities", "qualifications": {"required": "Bachelor's degree in engineering or a related field\nAny Project Management certification such as PMP would be advantegeous\nMinimum of 3 years of experience in technical sales, preferably in manufacturing or industrial sectors\nStrong understanding of the United States and Canadian markets, with the ability to identify key players and emerging opportunities\nStrong communication and presentation skills\nAbility to understand and explain technical concepts effectively to both technical and non-technical individuals\nProven track record of meeting sales targets and driving revenue growth\nWillingness to travel as needed", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "benefits": "Salary depending on experience\nFlexible hours", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3977522238"}