{"jobTitle": "Retail Store Planner, Footwear", "company": {"name": "Skechers", "industry": "Retail", "size": "5001-10000 employees", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "The Store Planner is responsible for the management of execution of allocations to support merchandise assortments for multiple channels and stores. The Store Planner manages in-store inventory for maximum sales results. Based on capacity, they are responsible for a balanced inventory assortment across all gender categories. This position requires strong leadership and management abilities.", "responsibilities": "Work with the Buying & Merchandising Planning team to develop and manage allocation strategies for product by channel and location on weekly basis. Manage styles from initial allocation through end of life cycle, including replenishment and consolidation of goods to other stores or channels. Maintain the appropriate mix by department/class, style, color and size in each store in order to achieve target covers and planned sales. Analyze and react to individual store trends and the performance of store groupings to improve productivity of merchandise through initial allocations and replenishment. Consolidate, analyze and communicate size and location-based selling, including sales/inventory comparisons to affect allocations. Size analysis to optimize buys & allocations. Ad-hoc product/store analysis and inventory requests as required. Review Store Targets on a quarterly basis, provide sales information and recommend changes. Work with ecommerce team to efficiently manage inventory between the store and ecommerce. Review store pre-allocation at gender, brand and category level; partner with Merchandise Planner and Divisional Merchandise Manager (DMM) to balance receipts to store sales and sku plans within +/-5%. Set direction and weekly and monthly priorities to effectively manage a team of allocators and analysts for assigned store channel type. Analyze and interpret weekly and monthly business data to identify sales and inventory needs. Communicate all allocations changes to appropriate stakeholders (e.g. buying and planning team).", "qualifications": {"required": "Bachelor’s Degree or equivalent experience. Two years of progressively increased responsibility spent in inventory control or allocation area of high-volume specialty retailer. Experience in a decision-making position and retail management. At least two years of experience with hiring, developing and managing a team required.", "preferred": "Ability to effectively lead and manage a team. Strong aptitude with numbers and clear understanding of retail math skills. Ability to effectively multi-task, prioritize, and adapt to fast-paced, dynamic business environment to meet deadlines. Superior communication skills; able to communicate persuasively, influentially and responsibly across a broad spectrum of stakeholders. Excel in team-environments and in building and developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals. Computer proficiency with advanced knowledge of Microsoft Excel (pivot tables, v-lookups, etc.)"}, "skills": ["Leadership", "Inventory Management", "Retail Math", "Communication", "Microsoft Excel"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3977883785"}