{"jobTitle": "Business Analyst, Amazon Fresh Grocery", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "66,900.00/year - 143,100.00/year", "currency": "USD"}, "jobFunction": "Strategy/Planning, Analyst, and Information Technology", "industry": "Software Development", "description": "The Amazon Fresh Grocery team is looking for a Business Analyst (BA) to support business reporting/data needs (e.g., weekly performance reporting, selection management, cost improvements, promotion optimization, etc.) while developing scalable solutions for the future. A successful BA delivers results at both strategic and tactical levels, carefully balances speed and depth, influences decision making, and impacts multiple parts of the business.<br/><br/>Business Analysts think deeply about the data and information needed to support growth, reduce costs, and improve efficiency, and provide clear recommendations and/or modeling to support their conclusions. They identify opportunities and drive improvements through data fueled solutions, and leverage stakeholder input and feedback to develop roadmaps and set expectations.<br/><br/>The ideal candidate will take a customer centric approach when identifying and addressing challenges, having both a business sense and a solid understanding of the technical landscape. You must be able to thrive and succeed in an entrepreneurial environment, and be able to navigate a high level of ambiguity and competing priorities. High judgment, speed, ability to influence, analytical capability, and exceptional communication are essential to succeed in this role.<br/><br/>Key job responsibilities<br/><br/><ul><li>Own, influence, and improve existing shared, business critical reporting such as the Weekly Business Review.</li><li>Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities.</li><li>Play an active business role by proactively identifying business, data, measurement, etc., needs.</li><li>Create a roadmap mechanism and process that allows you to educate and set expectations with leaders and team members.</li><li>Deliver on your roadmap, on time, and at a high standard.</li><li>In coordination with the leaders in the business, develop goals for yourself that balance meeting the needs of the business and your personal growth.</li><li>Represent Category data needs and drive improvements in org-wide settings.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field</li><li> 3+ years of business analyst, data analyst or similar role experience</li><li> Experience with SQL</li><li> 3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience</li><li> Experience defining requirements and using data and metrics to draw business insights</li><li> Experience with data visualization using Tableau, Quicksight, or similar tools<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience partnering with executive-level leaders to identifying and solving business issues</li><li> Experience making business recommendations and influencing stakeholders</li><li> Experience with providing data to make retail business decisions, including sales, margin, shrink, promotions and inventory data.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2699858", "responsibilities": "The Amazon Fresh Grocery team is looking for a Business Analyst (BA) to support business reporting/data needs (e.g., weekly performance reporting, selection management, cost improvements, promotion optimization, etc.) while developing scalable solutions for the future. A successful BA delivers results at both strategic and tactical levels, carefully balances speed and depth, influences decision making, and impacts multiple parts of the business.<br/><br/>Business Analysts think deeply about the data and information needed to support growth, reduce costs, and improve efficiency, and provide clear recommendations and/or modeling to support their conclusions. They identify opportunities and drive improvements through data fueled solutions, and leverage stakeholder input and feedback to develop roadmaps and set expectations.<br/><br/>The ideal candidate will take a customer centric approach when identifying and addressing challenges, having both a business sense and a solid understanding of the technical landscape. You must be able to thrive and succeed in an entrepreneurial environment, and be able to navigate a high level of ambiguity and competing priorities. High judgment, speed, ability to influence, analytical capability, and exceptional communication are essential to succeed in this role.<br/><br/>Key job responsibilities<br/><br/><ul><li>Own, influence, and improve existing shared, business critical reporting such as the Weekly Business Review.</li><li>Solicit the team for reporting needs, areas of opportunity, dashboard requests, and cost reduction opportunities.</li><li>Play an active business role by proactively identifying business, data, measurement, etc., needs.</li><li>Create a roadmap mechanism and process that allows you to educate and set expectations with leaders and team members.</li><li>Deliver on your roadmap, on time, and at a high standard.</li><li>In coordination with the leaders in the business, develop goals for yourself that balance meeting the needs of the business and your personal growth.</li><li>Represent Category data needs and drive improvements in org-wide settings.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field, 3+ years of business analyst, data analyst or similar role experience, Experience with SQL, 3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience, Experience defining requirements and using data and metrics to draw business insights, Experience with data visualization using Tableau, Quicksight, or similar tools", "preferred": "Experience partnering with executive-level leaders to identifying and solving business issues, Experience making business recommendations and influencing stakeholders, Experience with providing data to make retail business decisions, including sales, margin, shrink, promotions and inventory data."}, "skills": ["SQL", "Excel", "Tableau", "Quicksight", "Data Visualization", "Business Analysis", "Data Analysis"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977082164"}