{"jobTitle": "Tax Manager Health Care, Tax Exempt Remote", "company": {"name": "Kaiser Permanente", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Hospitals and Health Care", "description": "This position is remote however candidates must reside within the States that we operate in, which include California, Colorado, Connecticut, District of Columbia, Georgia, Hawaii, Illinois, Maryland, Oregon, and Virginia. The Tax Manager will be responsible for managing the organization's nonprofit federal and state tax compliance and reporting requirements. This role will work closely with the finance and accounting teams to ensure accurate and timely non-profit tax filings and will also provide guidance and support to other departments as needed. The Tax Manager will review tax forms, including Form 990s, 990Ts, for-profit tax returns, and related schedules, supervise and mentor staff, and perform thorough tax research and analysis, presenting the findings in detailed memoranda. In this role you will apply excellent project management skills and effectively collaborate with external stakeholders to ensure the success of projects.", "responsibilities": "Develop and implement tax policies and procedures to ensure compliance with federal, state, and local laws and regulations. Review and file annual tax returns, including Forms 990, 990-T, and other required forms. Maintain accurate records of all tax-related transactions and activities. Conduct tax research to identify tax-saving opportunities and ensure compliance with changing tax laws and regulations. Collaborate with other departments to ensure compliance with nonprofit laws and regulations. Manage tax projects and collaborate with internal and external stakeholders to ensure the success of the projects. Support internal and external audits by preparing audit schedules and reviewing information and/or documentation for submission to internal and external auditors. Pursue professional growth and provide developmental opportunities for others; build collaborative, cross-functional relationships; train and develop talent for growth opportunities; delegate tasks and decisions; foster open dialogue amongst team members; execute performance management guidelines and expectations; and work closely with employees to set goals and provide open feedback and coaching to drive performance.", "qualifications": {"required": "Minimum four (4) years tax experience. Minimum three (3) years experience in a leadership role with or without direct reports. Bachelors degree in Accounting, Business, or related field AND Minimum six (6) years accounting or related business experience. Additional equivalent work experience in a directly related field may be substituted for the degree requirement.", "preferred": "N/A"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3978920490"}