{"jobTitle": "Facilities Manager", "company": {"name": "Tripalink", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Who We Are: Tripalink is a leading co-living and apartment rental platform that aims to redefine urban living. With a strong presence in major cities across the United States, we offer modern apartments designed to create a sense of community among residents. As a fast-growing startup, we are committed to building a community that supports personal growth, celebrates diversity, and encourages excellence. Our team is dedicated to providing exceptional living experiences through cutting-edge technology and unparalleled customer service. If you're passionate about making a difference and eager to be part of a team that values creativity and teamwork, we invite you to explore our career opportunities and join us on our journey. We are seeking an experienced and proactive Facility Manager to oversee the maintenance and operations of our properties. The ideal candidate will have a strong background in facility management, excellent organizational skills, and a commitment to maintaining the highest standards of property upkeep and resident satisfaction. Responsibilities:<br/><br/><ul><li>Property Maintenance:</li><li>Oversee the maintenance and repair of all building systems including HVAC, electrical, plumbing, and structural elements</li><li>Conduct regular property inspections to identify and address maintenance needs and potential safety hazards</li><li>Develop and implement preventative maintenance programs to ensure the longevity of property assets</li><li>Vendor Management:</li><li>Coordinate and manage relationships with external contractors and service providers</li><li>Negotiate contracts, monitor performance, and ensure compliance with agreed terms and standards</li><li>Budget Management:</li><li>Prepare and manage the maintenance budget, ensuring cost-effective solutions and adherence to financial guidelines</li><li>Track and report on maintenance expenses and identify opportunities for cost savings</li><li>Resident Relations:</li><li>Address and resolve maintenance-related resident complaints and requests in a timely and efficient manner</li><li>Foster positive relationships with residents to enhance their living experience</li><li>Compliance and Safety:</li><li>Ensure compliance with all local, state, and federal regulations related to property maintenance and safety</li><li>Implement and enforce safety protocols and emergency response procedures</li><li>Team Leadership:</li><li>Supervise and provide direction to maintenance staff, fostering a collaborative and high-performing team environment</li><li>Conduct training and development programs for maintenance personnel to enhance their skills and knowledge<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Minimum 3 years of facilities experience in conventional multifamily residential properties required</li><li>Minimum of 5 years of experience in facilities management, property maintenance, or a related role</li><li>Strong knowledge of building systems, maintenance practices, and safety regulations</li><li>Excellent organizational and time management skills</li><li>Strong interpersonal and communication skills</li><li>Ability to work independently and as part of a team</li><li>Proficiency in maintenance management software and Microsoft Office Suite<br/><br/><br/></li></ul>What We Provide: - Excellent Working Environment: Energetic, Ambitious, Passionate - Great Team Experience - Regular Team Building Activities - Free Community Event Entrance - Leadership Cultivation &amp; Individual Development - Networking &amp; Resources from External Partners - Opportunities of Rotation Among Departments &amp; Locations Diversity &amp; Inclusion at Tripalink Tripalink is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. We are proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status. Note on Pay Transparency: Tripalink provides an estimate of the compensation for roles that may be hired as required by state regulations. This role may also qualify for annual incentive and/or comprehensive benefits. Compensation may vary based on (a) location, as Tripalink factors in specific location when benchmarking compensation for most roles; (b) individual candidate skills and qualifications; and (c) individual candidate experience. Additionally, Tripalink leverages current market data to determine compensation, so posted compensation figures are subject to change as new market data becomes available. The salary, other compensation, and benefits information is accurate as of the date of this posting. Tripalink reserves the right to modify this information at any time, subject to applicable law.", "responsibilities": "Property Maintenance:\nOversee the maintenance and repair of all building systems including HVAC, electrical, plumbing, and structural elements\nConduct regular property inspections to identify and address maintenance needs and potential safety hazards\nDevelop and implement preventative maintenance programs to ensure the longevity of property assets\nVendor Management:\nCoordinate and manage relationships with external contractors and service providers\nNegotiate contracts, monitor performance, and ensure compliance with agreed terms and standards\nBudget Management:\nPrepare and manage the maintenance budget, ensuring cost-effective solutions and adherence to financial guidelines\nTrack and report on maintenance expenses and identify opportunities for cost savings\nResident Relations:\nAddress and resolve maintenance-related resident complaints and requests in a timely and efficient manner\nFoster positive relationships with residents to enhance their living experience\nCompliance and Safety:\nEnsure compliance with all local, state, and federal regulations related to property maintenance and safety\nImplement and enforce safety protocols and emergency response procedures\nTeam Leadership:\nSupervise and provide direction to maintenance staff, fostering a collaborative and high-performing team environment\nConduct training and development programs for maintenance personnel to enhance their skills and knowledge", "qualifications": {"required": "Minimum 3 years of facilities experience in conventional multifamily residential properties required\nMinimum of 5 years of experience in facilities management, property maintenance, or a related role\nStrong knowledge of building systems, maintenance practices, and safety regulations\nExcellent organizational and time management skills\nStrong interpersonal and communication skills\nAbility to work independently and as part of a team\nProficiency in maintenance management software and Microsoft Office Suite", "preferred": ""}, "skills": ["HVAC", "Electrical", "Plumbing", "Maintenance", "Vendor Management", "Budget Management", "Customer Service", "Safety", "Team Leadership", "Microsoft Office Suite"], "postedDate": "1 month ago", "benefits": "Excellent Working Environment: Energetic, Ambitious, Passionate - Great Team Experience - Regular Team Building Activities - Free Community Event Entrance - Leadership Cultivation &amp; Individual Development - Networking &amp; Resources from External Partners - Opportunities of Rotation Among Departments &amp; Locations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978498121"}