{"jobTitle": "Architect/Designer with Technical Experience", "company": {"name": "Archinect", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Architecture and Planning", "description": "Who are we looking for?<br/><br/>The following information aims to provide potential candidates with a better understanding of the requirements for this role.We are looking for dynamic, energetic architects, and designers to contribute, collaborate, and engage with us on exciting projects with sophisticated, interesting clients in California. If you have between five and seven years of experience, are highly motivated, have excellent written, technical, and visual communication skills, and like challenges, we would like to meet you.What would a successful candidate do?You will participate in every phase of a project’s development, from the concept to the construction phase. You will interact with consultants, contractors, and clients. You will brainstorm ideas, argue, sketch, and stand up for better creative solutions. You will produce construction documents, presentations, renderings, schedules, research new materials, and, with the guidance of more senior level staff, take ownership of your work, see it implemented, and built.Why work with us?We are an award-winning, multidisciplinary architecture and product design practice, with deep ties to the local design &amp; building community. Our projects range in size and scope with a focus on carefully detailed, custom, modern single family residential design. We engage other disciplines such as product design and digital fabrication as key components to our design ethos. We work in an open studio environment for the purpose of fostering collaboration, and the sharing of ideas in a non-hierarchical fashion. Our studio is composed of a diverse, and international staff with a broad range of experiences, interests, and expertise. We offer great benefits and a studio culture geared for a healthy work-life balance.What impact will you make?If you’re curious, love to sweat the details, and are confident, chances are you will grow quickly and see your ideas put to the test right away. We design beautiful projects with and for our clients and are closely involved during the construction phase. You will be a part of that.<br/><br/>#J-18808-Ljbffr", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3978788701"}