{"jobTitle": "Mail Clerk", "company": {"name": "KBR, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "39,905 USD to 59,915 USD", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "<strong>Title<br/><br/></strong>Mail Clerk<br/><br/><strong>Who We Are<br/><br/></strong><strong><em>KBR Government Solutions</em></strong> delivers full life cycle professional and technical solutions that improve operational readiness and drive innovation. Our solutions help ensure mission success on land, air, sea, space and cyberspace for the Department of Defense, Intelligence Community, NASA and other federal agencies. KBR’s areas of expertise include engineering, logistics, operations, science, program management, mission IT and cybersecurity. KBR strives to create a safer, more secure and sustainable world by bringing together the best and brightest to deliver technologies and solutions that help our customers accomplish their most critical missions and objectives.<br/><br/><strong><em>The Mission Ahead <br/><br/></em></strong>This role is with KBR’s Government Solutions U.S. division. At KBR Government Solutions, we don't just envision a world that's safer, more secure, and sustainable - we create it. Our legacy of delivering advanced full life cycle professional and technical solutions is matched only by our commitment to operational readiness and innovation. As stewards of critical missions for the Department of Defense, Intelligence Community, NASA, and other key federal entities, we excel in engineering, logistics, operations, science, program management, mission IT, and cybersecurity. United in our quest for excellence, KBR stands at the vanguard, ready to transform possibilities into impactful realities for a better tomorrow.<br/><br/><strong>Position Title: Mail Clerk<br/><br/></strong><strong>Position Summary<br/><br/></strong>Under direct supervision, performs a wide variety of clerical duties to facilitate postal service operations, typically at a military installation. Duties include sorting, distributing and dispatching incoming &amp; outgoing mail accurately and on time. Additional duties may include cashiering, inspecting letters and packages, operating common mailroom equipment including postage meters, processing returned mail, etc.<br/><br/>This role will be located in El Segundo, CA. <em> T</em><em>his position is expected to be onsite 100%. <br/><br/></em><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Sort and distribute incoming mail.</li><li>Prepare outgoing mail (enveloping, stamping, sorting).</li><li>Manage postal requirements and ensure postage is up-to-date.</li><li>Maintain records and logs of mail.</li><li>Maintain Quality Control: Implement and maintain quality control measures to ensure that all installations and repairs meet or exceed the set standards.</li><li>Facilitate Team Communication: Ensure clear and consistent communication within the team and with other project stakeholders to keep everyone informed and aligned on project goals and updates.</li><li>Other duties as required.<br/><br/></li></ul><strong>Basic Qualifications And Skills Requirements<br/><br/></strong><ul><li>This position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. Must possess an active U.S Government Top Secret security clearance with SCI eligibility required. Willingness to take a polygraph and upgrade clearance as required. </li><li>High school diploma or equivalent.</li><li>5+ years of proven experience as a mail clerk or similar role.</li><li>Good organizational and time management skills.</li><li>Working knowledge of mail processes and postal regulations.</li><li>Attention to Detail: Precision and attention to detail to ensure high-quality service delivery and compliance with safety standards.</li><li>Adaptability: Flexibility to adapt to changing conditions, technologies, and requirements.</li><li>Decision-Making Ability: Strong decision-making skills to resolve issues quickly and effectively under pressure.<br/><br/></li></ul><strong>Scheduled Weekly Hours<br/><br/></strong>40 hours<br/><br/><strong>Basic Compensation<br/><br/></strong>$39,905 USD to $59,915 USD<br/><br/>The offered rate will be based on the selected candidate’s knowledge, skills, abilities and/or experience and in consideration of internal parity.<br/><br/><strong>Additional Compensation<br/><br/></strong>KBR may offer bonuses, commissions, or other forms of compensation to certain job titles or levels, per internal policy or contractual designation. Additional compensation may be in the form of sign on bonus, relocation benefits, short term incentives, long term incentives, or discretionary payments for exceptional performance.<br/><br/><strong>Benefits<br/><br/></strong>KBR offers a selection of competitive lifestyle benefits which could include a 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.<br/><br/><strong>Job Eligible For Referral Payout<br/><br/></strong>No<br/><br/><strong>INCLUSION AND DIVERSITY AT KBR<br/><br/></strong>At KBR, we are passionate about our people, sustainability, and our Zero Harm culture. These inform all that we do and are at the heart of our commitment to and ongoing journey toward being a more inclusive and diverse company. That commitment is central to our team of teams philosophy and fosters an environment of real collaboration across cultures and locations. Our individual differences and perspectives bring enhanced value to our teams and help us develop solutions for the most challenging problems. We understand that by embracing those differences and working together, we are more innovative, more resilient, and safer.<br/><br/><strong>We Deliver – Together.<br/><br/></strong>#EC<br/><br/>KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.<br/><br/><strong>R2091527</strong>", "responsibilities": "<ul><li>Sort and distribute incoming mail.</li><li>Prepare outgoing mail (enveloping, stamping, sorting).</li><li>Manage postal requirements and ensure postage is up-to-date.</li><li>Maintain records and logs of mail.</li><li>Maintain Quality Control: Implement and maintain quality control measures to ensure that all installations and repairs meet or exceed the set standards.</li><li>Facilitate Team Communication: Ensure clear and consistent communication within the team and with other project stakeholders to keep everyone informed and aligned on project goals and updates.</li><li>Other duties as required.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>This position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. Must possess an active U.S Government Top Secret security clearance with SCI eligibility required. Willingness to take a polygraph and upgrade clearance as required. </li><li>High school diploma or equivalent.</li><li>5+ years of proven experience as a mail clerk or similar role.</li><li>Good organizational and time management skills.</li><li>Working knowledge of mail processes and postal regulations.</li><li>Attention to Detail: Precision and attention to detail to ensure high-quality service delivery and compliance with safety standards.</li><li>Adaptability: Flexibility to adapt to changing conditions, technologies, and requirements.</li><li>Decision-Making Ability: Strong decision-making skills to resolve issues quickly and effectively under pressure.<br/><br/></li></ul>", "preferred": ""}, "skills": ["Quality Control", "Team Communication"], "postedDate": "1 month ago", "benefits": "KBR offers a selection of competitive lifestyle benefits which could include a 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978643438"}