{"jobTitle": "Supply Chain Manager", "company": {"name": "Miso Robotics", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "120,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Automation Machinery Manufacturing", "description": "Our Company<br/><br/>Miso Robotics is transforming the restaurant industry, and making food workers’ lives better. Our signature product is an AI-powered kitchen robot named Flippy which automates the dangerous operation of a restaurant’s fry station and cooks all sorts of fried items. Flippy is powered by a sophisticated AI platform driven by our proprietary and patented technologies.<br/><br/>Miso is a well known first-mover in kitchen automation, AI, and robotics. The company has raised over $125 million from equity crowdfunding, which we believe makes it THE most successful crowdfunding story in history. It has successfully piloted its products with the most prominent global brands in food, and now it’s time for the company to scale.<br/><br/>The company recently added a new CEO and other senior leaders, including a new CTO – all of whom hold decades of experience operating growth companies. Our CEO has a track record of successful exits, and we recently accepted a strategic investment and partnership from Ecolab (NYSE: ECL), a $70 billion public company which, as the global leader in sales of cleaning solutions to restaurants, truly knows how to operate at scale. Our new leadership team is evolving the company’s culture from early stage to growth stage with new processes and disciplines, and is supported by a board that includes the former President and CTO of OpenTable.<br/><br/>With Ecolab’s support, we are building a world-class team, and are looking for more exceptional people to join us.<br/><br/>Benefits We Offer<br/><br/><ul><li>Company Equity</li><li>Flexible vacation </li><li>Comprehensive benefits </li><li>401K plan</li><li>Accelerated growth opportunities</li><li>Free snacks from our robot chefs<br/><br/></li></ul><strong>Job Description<br/><br/></strong>Miso Robotics is seeking a highly motivated and experienced Supply Chain Manager to oversee and optimize our supply chain operations. The ideal candidate will be responsible for ensuring the efficient and cost-effective flow of materials, products, and information from suppliers to customers. This role is critical to our mission of delivering innovative automation solutions to the food service industry.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Develop and implement supply chain strategies that support our business goals and objectives.</li><li>Manage end-to-end supply chain operations, including procurement, inventory management, logistics, and distribution.</li><li>Establish and maintain relationships with suppliers, negotiating contracts and ensuring quality standards are met.</li><li>Monitor and analyze key performance indicators (KPIs) to identify areas for improvement and implement corrective actions.</li><li>Collaborate with cross-functional teams, including engineering, production, and sales, to ensure alignment and coordination.</li><li>Implement best practices and continuous improvement initiatives to optimize supply chain efficiency and reduce costs.</li><li>Develop and manage the supply chain budget, tracking expenses and identifying cost-saving opportunities.</li><li>Lead and mentor a team of supply chain professionals, fostering a culture of excellence and continuous improvement.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Supply Chain Management, Business Administration, or a related field. Master’s degree or professional certification (e.g., CSCP, CPIM) is a plus.</li><li>5 years of experience in supply chain management, preferably in a manufacturing or technology environment.</li><li>Strong understanding of supply chain principles, practices, and technologies.</li><li>Proven track record of managing and optimizing supply chain operations, with a focus on cost reduction and efficiency improvement.</li><li>Excellent analytical, problem-solving, and decision-making skills.</li><li>Strong negotiation and relationship management skills.</li><li>Proficiency in supply chain management software and tools (e.g., NetSuite ERP systems, demand planning software).</li><li>Exceptional communication and interpersonal skills, with the ability to work effectively in a fast-paced, dynamic environment.</li><li>Ability to work onsite in Pasadena, CA<br/><br/></li></ul><strong>Compensation<br/><br/></strong>$120,000-$140,000 /yr + Equity + Benefits<br/><br/>The stated compensation range reflects only the targeted base salary range for candidates residing in the Los Angeles Metro area and excludes additional earnings such as bonus and benefits. If your salary requirements fall outside of the range, we still encourage you to apply.<br/><br/>At Miso Robotics, we are committed to fostering an inclusive, diverse, and equitable workplace where every team member is valued and respected. We believe that diversity in our team drives innovation and creativity, which is why we strive to create a welcoming environment for everyone, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or veteran status.", "responsibilities": "Develop and implement supply chain strategies that support our business goals and objectives.\nManage end-to-end supply chain operations, including procurement, inventory management, logistics, and distribution.\nEstablish and maintain relationships with suppliers, negotiating contracts and ensuring quality standards are met.\nMonitor and analyze key performance indicators (KPIs) to identify areas for improvement and implement corrective actions.\nCollaborate with cross-functional teams, including engineering, production, and sales, to ensure alignment and coordination.\nImplement best practices and continuous improvement initiatives to optimize supply chain efficiency and reduce costs.\nDevelop and manage the supply chain budget, tracking expenses and identifying cost-saving opportunities.\nLead and mentor a team of supply chain professionals, fostering a culture of excellence and continuous improvement.", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Business Administration, or a related field. Master’s degree or professional certification (e.g., CSCP, CPIM) is a plus.\n5 years of experience in supply chain management, preferably in a manufacturing or technology environment.\nStrong understanding of supply chain principles, practices, and technologies.\nProven track record of managing and optimizing supply chain operations, with a focus on cost reduction and efficiency improvement.\nExcellent analytical, problem-solving, and decision-making skills.\nStrong negotiation and relationship management skills.\nProficiency in supply chain management software and tools (e.g., NetSuite ERP systems, demand planning software).\nExceptional communication and interpersonal skills, with the ability to work effectively in a fast-paced, dynamic environment.\nAbility to work onsite in Pasadena, CA", "preferred": ""}, "skills": ["Supply Chain Management", "Procurement", "Inventory Management", "Logistics", "Distribution", "Negotiation", "Relationship Management", "Continuous Improvement", "ERP Systems", "Demand Planning", "Communication", "Interpersonal Skills"], "postedDate": "1 month ago", "benefits": "Company Equity, Flexible vacation, Comprehensive benefits, 401K plan, Accelerated growth opportunities, Free snacks from our robot chefs", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978295637"}