{"jobTitle": "Office Shipping & Receiving", "company": {"name": "Mercury Air Cargo", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Airlines and Aviation", "description": "<strong>Overview<br/><br/></strong>In the role of Warehouse Shipping &amp; Receiving Coordinator, you will be integral to our logistics operations, focusing on the precise and efficient handling of goods entering and departing our facility. This position demands meticulous attention to detail and the ability to perform tasks in strict accordance with international and domestic regulations for air travel logistics. The successful candidate will excel in a changing environment, demonstrate flexibility, and prioritize collective and personal safety.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Efficiently process and document all inbound and outbound shipments.</li><li>Quickly unload trucks, following designated protocols.</li><li>Work with Customer Service to ensure documentation accuracy.</li><li>Conduct thorough inspections of goods and log any damages.</li><li>Monitor and log temperatures for perishables as necessary.</li><li>Guide truck drivers safely on-site.</li><li>Verify and match product counts with documentation.</li><li>Accurately fill out and validate the Bill of Lading.</li><li>Report any documentation discrepancies to supervisors.</li><li>Store merchandise following specific instructions.</li><li>Prepare pallets for security checks and storage.</li><li>Ensure Purchase Order details are correct.</li><li>Label pallets accurately according to the Bill of Lading.</li><li>Stay informed about customer, product, and airline requirements.</li><li>Become adept with cargo loading equipment like LD3, AKE, and PMC.</li><li>Break down and ready pallets for airline transport.</li><li>Operate warehouse equipment safely.</li><li>Participate in training to improve operational skills.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>You're at least 18 years of age and can provide proof of your legal right to work in the United States, embracing opportunities with enthusiasm and dedication.</li><li>You bring experience from the warehouse floor, specifically in the shipping and receiving arena.</li><li>You're proficient with the ins and outs of warehouse management systems and can navigate relevant computer applications with ease.</li><li>Forklifts and pallet jacks are tools of your trade, and you're certified and comfortable operating them.</li><li>Your organizational skills are top-notch, and you're adept at juggling multiple tasks simultaneously.</li><li>You have a knack for clear and effective communication, making you a valued team player.</li><li>You take pride in your unwavering commitment to safety and regulatory compliance in the workplace.<br/><br/></li></ul><strong>Position Details<br/><br/></strong><ul><li>Job Type: Full-time</li><li>Benefits:</li><li>Health, Dental and Vision insurance</li><li>Paid time off</li><li>Flexible work schedule</li><li>Cellphone reimbursement when applicable </li><li>Supplemental Pay: Commission-based incentives</li><li>Schedule: Monday to Friday with weekend availability as needed</li><li>Work Location: Los Angeles <br/><br/></li></ul>Join us in driving the next phase of our growth while building a rewarding career in a role where your contributions have a direct impact on our success.<br/><br/>HPL Apollo is dedicated to creating an inclusive workplace where diversity is not only recognized but celebrated. We are proud to be an equal opportunity employer, welcoming applications from all qualified individuals regardless of race, color, religion, sex, national origin, age, disability, veteran status, gender identity, or sexual orientation. Our commitment extends to comply with all federal, state, and local employment laws, including but not limited to the Fair Labor Standards Act, the Americans with Disabilities Act, the Family and Medical Leave Act, and the Fair Chance Initiative for Hiring where applicable. We believe in providing a work environment free from discrimination and harassment, where every employee feels valued and respected. HPL Apollo supports and adheres to the principles of fair employment practices and affirmative action.", "postedDate": "1 month ago", "benefits": "Health, Dental and Vision insurance\nPaid time off\nFlexible work schedule\nCellphone reimbursement when applicable \nSupplemental Pay: Commission-based incentives\nSchedule: Monday to Friday with weekend availability as needed\nWork Location: Los Angeles", "skills": [], "url": "https://www.linkedin.com/jobs/view/3978696092"}