{"jobTitle": "AE - Merchandising Team Leader (Assistant Manager)", "company": {"name": "American Eagle Outfitters Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Retail, Retail Apparel and Fashion, and IT Services and IT Consulting", "description": "<strong>Job Description<br/><br/></strong><strong>YOUR ROLE<br/><br/></strong>As the full-time Merchandising Team Leader, you are the Store Team Leader's \"go-to\" in developing and implementing the Merchandising strategy for the store. Your passion lies in training and coaching your team into great merchants delivering AEO brand Visual standards every day. Through your leadership, your team always nails floorset execution, and rocks merchandising and marketing brand standards. You ensure the store is always \"guest ready\" through effective replenishment. Most importantly, you represent our company values and bring your REAL self to work every day.<br/><br/><strong>Your Responsibilities<br/><br/></strong><ul><li>You have a passion for driving sales: As a key LOD (Leader on Duty), you're an expert at driving sales by maximizing Fitting Room and Salesfloor productivity and building guest loyalty through a best-in-class guest experience. You contribute to the overall financial success of the store by analyzing reporting and daily trends to make strategic business decisions. You're the Store Team Leader's right hand in developing short and long-term business plans to drive key KPIs.</li><li>You're a merchandising innovator: You coach your team to deliver an outstanding guest experience by ensuring your store is always representative of AEO Brand Standards. You ensure your store stays in tip-top shape by #leading day-to-day merchandising, sell-through adjustments and replenishment. You have a keen eye for merchandising opportunities and are always ready with a game plan to take action!</li><li>You're a people leader: You're all about motivating and inspiring your team through AEO's core values. You're a role-model leader and you always hold your team accountable to rocking AEO's customer service standards, especially on the Salesfloor and in the Fitting Room.</li><li>You've got an eye for talent and a love of training: You make it a top priority to recruit and hire strong talent to ensure the store is always staffed to meet business needs. You take pride in training and developing your team to ensure they continue to provide outstanding service to the best of their abilities.</li><li>You know that teamwork makes the dream work: You know that building a great team requires you to consistently provide ongoing performance feedback through real-time coaching. You make team touchbases, development plans, and performance reviews a priority and you drive associate engagement by celebrating your team's outstanding performance - #winning!</li><li>You're an operational innovator: You're a natural at executing and innovating daily operational procedures, you support the team in maintaining visual standards throughout every zone in the store, and most importantly, you ensure the Fitting Rooms are always guest-ready and rocking AEO Brand Standards.</li><li>Integrity is your middle name: You ensure store safety standards are maintained, you're committed to Asset Protection standards, you always adhere to AEO's policies and procedures, and you do the right thing - always.<br/><br/></li></ul><strong>You'd Be Great For This Role If<br/><br/></strong><ul><li>You love AE and Aerie products!</li><li>You've led teams in a retail management role previously - #practicemakesperfect!</li><li>You can multi-task and have attention to detail; priority-setting and time management are your strong suits.</li><li>You know how to lead and develop teams and have a general understanding of employment law.</li><li>Business acumen? You've got it!</li><li>You have flexible availability - you're available to work when the guest shops!<br/><br/></li></ul><strong>Our Associates Love Aeo Because<br/><br/></strong><ul><li>They work with REAL people - there's nothing like your #AEOFamily.</li><li>They're given opportunities for development, the chance to learn new skills, and are offered great potential for career advancement.</li><li>They receive 40% off product at both AE &amp; Aerie year-round (plus additional seasonal discounts with new Floorsets!)</li><li>They participate in store contests for the chance to win FREE merchandise and other exclusive prizes.<br/><br/></li></ul><strong>About Us<br/><br/></strong>American Eagle is a leading American jeans and apparel brand, the go-to destination for casual style, embraced by generations of youth since 1977. We are rooted in authenticity, powered by positivity and inspired by our community. Our collections are designed to inspire self-expression and empower our customers to celebrate their own uniqueness. We have broadened our leadership by producing innovative, sustainable fabrics.<br/><br/><em>AEO is an Equal Opportunity Employer and is committed to complying with all federal, state and local equal employment opportunity (\"EEO\") laws. AEO prohibits discrimination against associates and applicants for employment because of the individual's race or color, religion or creed, alienage or citizenship status, sex (including pregnancy), national origin, age, sexual orientation, disability, gender identity or expression, marital or partnership status, domestic violence or stalking victim status, genetic information or predisposing genetic characteristics, military or veteran status, or any other characteristic protected by law. This applies to all AEO activities, including, but not limited to, recruitment, hiring, compensation, assignment, training, promotion, performance evaluation, discipline and discharge. AEO also provides reasonable accommodation of religion and disability in accordance with applicable law.<br/><br/></em><em>For Brand Ambassador and Stock positions, hiring will be based on need, however, applications are accepted on an ongoing basis. For all other store jobs, applications will be accepted until the Apply Before date (if applicable), but may be extended based on applicant volume.<br/><br/></em><strong>Pay/Benefits Information<br/><br/></strong><ul><li>Actual starting pay is determined by various factors, including but not limited to relevant experience and location.</li><li>Subject to eligibility requirements, associates may receive health care benefits (including medical, vision, and dental); wellness benefits; 401(k) retirement benefits; life and disability insurance; employee stock purchase program; paid time off; paid sick leave; and parental leave and benefits.</li><li>Paid Time Off, paid sick leave, and holiday pay vary by job level and type, job location, employment classification (part-time or full-time / exempt or non-exempt), and years of service. For additional information, please click HERE .</li><li>AEO may also provide discretionary bonuses and other incentives at its discretion.<br/><br/></li></ul><strong>JOB INFO <br/><br/></strong>Job Identification 3526<br/><br/>Job Category : Stores<br/><br/>Posting Date : 2024-07-16T15:38:16+00:00<br/><br/>Job Schedule : Full time<br/><br/>Locations : Sherman Oaks, CA, United States", "responsibilities": "As the full-time Merchandising Team Leader, you are the Store Team Leader's \"go-to\" in developing and implementing the Merchandising strategy for the store. Your passion lies in training and coaching your team into great merchants delivering AEO brand Visual standards every day. Through your leadership, your team always nails floorset execution, and rocks merchandising and marketing brand standards. You ensure the store is always \"guest ready\" through effective replenishment. Most importantly, you represent our company values and bring your REAL self to work every day.", "qualifications": {"required": "You love AE and Aerie products!, You've led teams in a retail management role previously - #practicemakesperfect!, You can multi-task and have attention to detail; priority-setting and time management are your strong suits., You know how to lead and develop teams and have a general understanding of employment law., Business acumen? You've got it!, You have flexible availability - you're available to work when the guest shops!", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "benefits": "They work with REAL people - there's nothing like your #AEOFamily., They're given opportunities for development, the chance to learn new skills, and are offered great potential for career advancement., They receive 40% off product at both AE &amp; Aerie year-round (plus additional seasonal discounts with new Floorsets!), They participate in store contests for the chance to win FREE merchandise and other exclusive prizes.", "remoteWork": "No", "salary": {"amount": "19.15/yr - 31.85/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3978002533"}