{"jobTitle": "Senior Operations Manager, Amazon Freight", "company": {"name": "Amazon", "location": "Nashville, TN"}, "location": "Nashville, TN", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "General Business, Management, and Strategy/Planning", "industry": "Software Development", "description": "Amazon Freight is looking for an entrepreneurial minded leader to join our growing start up business as an Enterprise Partner Operations Manager. The right candidate will thrive in ambiguous environments, have excellent written and verbal communication skills, have experience and success with building, growing, and leading high performing teams capable of defining new processes and ways of operating, and will be able to interface with senior leaders at Fortune companies. In this role, you will be responsible for building and leading a team who will provide excellent customer service while overseeing daily operational functions for Amazon Freight’s Enterprise customers, including load building, load planning, scheduling appointments, receiving and responding to customer requests (both email and phone), and building a world-class operations team. You will partner with sales counterparts to identify our Customer’s needs and build processes that give your team a clear path on how to execute to those expectations. We are an early stage startup team that is still developing much of the technology we need to scale and will require complex problem solving and process definition in order to implement processes that enable us to meet our Customer’s needs until we can deploy new technology to help you scale.<br/><br/>The ideal candidate enjoys continuously learning, problem solving, and thrives in a dynamic and fast-paced, innovative environment while maintaining the ability to multi-task and prioritize responsibilities. You will partner closely with the Account Management team and routinely communicate and collaborate with stakeholder teams across the Amazon Freight organization to deliver best-in-class experiences for our customers. If you are excited about building a new business, leading a team to deliver best in class service, and influencing how we built scalable technology solutions then this role may be for you.<br/><br/>Key job responsibilities<br/><br/><ul><li>Build and lead a team to oversee day-to-day operations for key enterprise customer accounts, including load planning, shipment tracking, and disruption management</li><li>Partner with sales counterparts to influence the book of business they build and define solutions that meet our Customer’s needs while ensuring your team has a path to successfully operate them.</li><li>Partner with and influence operations leaders at enterprise Customers to implement changes to improve operational outcomes that drive efficiency gains or reduce disruptions/defects.</li><li>Assign loads and plan, route, and monitor freight movement to provide on-time service and meet customer requirements, including managing freight exceptions and driver ETA adjustments based on pick-up and delivery schedules, and other environmental factors on the road</li><li>Proactively communicate relevant updates to customers and/or internal teams as needed<br/><br/></li></ul>Investigate, provide solutions, and resolve customer problems such as order delays, missed pickups, missed deliveries, and damaged freight without always having defined pathways to resolve<br/><br/><ul><li>Conduct analysis on operational processes to make recommendations for continuous improvement, determine and measure KPIs, and create, maintain and present customer specific reporting through quarterly face-to-face interactions</li><li>Anticipate, recognize, and deal effectively with existing or potential conflicts at the individual, group, or situation level<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 5+ years of working cross functionally with tech and non-tech teams experience</li><li> 5+ years of team management experience</li><li> 5+ years of cross functional project delivery experience</li><li> 5+ years of program or project management experience</li><li> 2+ years of supply chain experience</li><li> Experience defining program requirements and using data and metrics to determine improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience managing, analyzing and communicating results to senior leadership<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2702410", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3978653727"}