{"jobTitle": "Land Planning Manager", "company": {"name": "K. Hovnanian® Homes", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "K. Hovnanian is celebrating 60 years of quality and leadership in the home building and community development industry. Do you want to play a large role in those every day decisions that help build dream homes? It’s the homes where people will raise their child, form their most important memories, plot the course for their future, spend quality time with their grandchildren or enjoy quiet times reflecting on a life full of accomplishments. Over 300,000 families have put their dreams in our hands, and you can as well.<br/><br/>As a Land Planning Manager, you bring our vision to life by overseeing the design of community landscaping, amenities and entrances. You know how to make things happen by ensuring the scope, schedule, and budget of all construction activities meet specified objectives for all projects. You’re a communicator and a listener who will keep our projects on schedule and a planner and advisor, whose high standards will push our company ahead of the competition.<br/><br/>To join our team in this role, you must have a bachelor's degree from four-year college or university focusing on Business, Urban Planning, or Finance, three to five years of related experience and/or training or equivalent combination of education and experience. Successful candidate must maintain a valid driver’s license.<br/><br/>K. Hovnanian Companies, LLC, a subsidiary of Hovnanian Enterprises, Inc., a well-respected publicly traded company, is committed to providing an environment and programs that help our associates flourish. You can look forward to professional support, an annual salary of $120,000 - $130,000 plus bonus potential and extensive benefits—including medical/dental/vision coverage, discounts on mortgages and home appliances, and a 401(k) plan. To learn more about us, visit www.khov.com/careers.<br/><br/><strong>Search Firms Please Read Carefully<br/><br/></strong>K. Hovnanian Companies, LLC is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any associate at K. Hovnanian via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of K. Hovnanian. No fee will be paid in the event the candidate is hired by K. Hovnanian as a result of the referral or through other means.<br/><br/><strong>Job Travel<br/><br/></strong><strong>10%</strong>", "postedDate": "1 month ago", "salary": {"amount": "$120,000 - $130,000", "currency": "USD"}, "benefits": "annual salary of $120,000 - $130,000 plus bonus potential and extensive benefits—including medical/dental/vision coverage, discounts on mortgages and home appliances, and a 401(k) plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978617397"}