{"jobTitle": "Field Logistics Manager", "company": {"name": "Via", "location": "Pomona, CA"}, "location": "Pomona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "55,000 - 65,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Via is using technology to transform transportation around the world. From changing a single person’s daily commute to reducing humanity’s collective environmental footprint — we’ve got huge goals.<br/><br/>As a <strong>Field Logistics Manager </strong>on Via’s Transit-as-a-Service (TaaS) Operations team, you’ll manage logistics for field operations teams using our innovative technology platform. You’ll manage day-to-day operations while driving continuous improvement and efficiency of our operations.<br/><br/><strong>What You’ll Do:<br/><br/></strong><ul><li>Coordinate, track, and prioritize different aspects of our operations with partners, vendors, and local teams </li><li>Communicate real-time status updates and provide visibility into key performance indicators to internal and external stakeholders</li><li>Build strong working relationships with partners, vendors, and other stakeholders</li><li>Be proactive and work collaboratively and cross-functionally to develop scalable processes and tools for increasing operating efficiency and performance</li><li>Analyze data and own reports to provide insights on operational performance</li><li>Travel to local and regional operations throughout the US (several times a quarter)<br/><br/></li></ul><strong>Who You Are:<br/><br/></strong><ul><li>Self-starter who is proactive and comfortable taking on a high level of responsibility</li><li>Strong project manager eager to create and refine operational processes</li><li>Outgoing and sociable leader; skilled at communicating professionally with partners, vendors, and partners from a broad range of backgrounds</li><li>Comfortable prioritizing and working on multiple initiatives with various stakeholders </li><li>Team player who is willing to wear multiple hats to contribute and take initiative on projects</li><li>Hold a valid driver’s license and be willing to travel<br/><br/></li></ul><strong>Compensation and Benefits: <br/><br/></strong><ul><li>Final salary will be determined by the candidate’s experience, knowledge, and skills. Salary reflected does not include equity or variable pay, where applicable</li><li>Salary Range: $55,000 - $65,000</li><li>We are proud to offer a generous and comprehensive benefits package, including free medical plans and 401K matching.<br/><br/></li></ul>We’re Via, and we build technology that changes the way the world moves. We pioneered the TransitTech category to ensure that the future of transportation is shared, dynamic public mobility — the kind that reduces carbon emissions across congested cities, minimizes reliance on private cars, and provides everyone with accessible, efficient, and affordable ways of getting around.<br/><br/>We created the first end-to-end TransitTech solution for cities and transit agencies, offering world-class software, service design, and operational expertise to fundamentally improve the way the world moves.<br/><br/>Via was founded with the guiding principle that we go further when we go together. We are dedicated to building a diverse, inclusive and authentic workplace. If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles. All backgrounds, identities, and voices are welcomed and celebrated at Via.<br/><br/>Ready to join the ride?<br/><br/>Via is an equal opportunity employer.", "responsibilities": "Coordinate, track, and prioritize different aspects of our operations with partners, vendors, and local teams\nCommunicate real-time status updates and provide visibility into key performance indicators to internal and external stakeholders\nBuild strong working relationships with partners, vendors, and other stakeholders\nBe proactive and work collaboratively and cross-functionally to develop scalable processes and tools for increasing operating efficiency and performance\nAnalyze data and own reports to provide insights on operational performance\nTravel to local and regional operations throughout the US (several times a quarter)", "qualifications": {"required": "Self-starter who is proactive and comfortable taking on a high level of responsibility\nStrong project manager eager to create and refine operational processes\nOutgoing and sociable leader; skilled at communicating professionally with partners, vendors, and partners from a broad range of backgrounds\nComfortable prioritizing and working on multiple initiatives with various stakeholders \nTeam player who is willing to wear multiple hats to contribute and take initiative on projects\nHold a valid driver’s license and be willing to travel"}, "skills": ["Project Management", "Data Analysis", "Communication", "Relationship Building", "Operations Management"], "postedDate": "1 week ago", "benefits": "Final salary will be determined by the candidate’s experience, knowledge, and skills. Salary reflected does not include equity or variable pay, where applicable\nSalary Range: $55,000 - $65,000\nWe are proud to offer a generous and comprehensive benefits package, including free medical plans and 401K matching.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978174725"}