{"jobTitle": "Ecommerce Merchandise Coordinator", "company": {"name": "CyberCoders", "location": "Chatsworth, CA"}, "location": "Chatsworth, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Retail Apparel and Fashion", "description": "<strong>Position: Ecommerce Merchandise Coordinator<br/><br/></strong><strong>Location: Onsite 3 days a week - Chatsworth, CA<br/><br/></strong>The Ecommerce Merchandise Coordinator will be responsible for managing the online product listings and merchandising for our company's ecommerce platform. This role requires a strong understanding of ecommerce operations, as well as experience with product posting and Amazon marketplace. The ideal candidate will also have experience in merchandising and sales, and be familiar with Shopify.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Manage and update product listings on our ecommerce platform, ensuring accurate and compelling product information and images</li><li>Monitor inventory levels and ensure timely restocking of products</li><li>Collaborate with the marketing team to develop and implement effective merchandising strategies</li><li>Analyze sales data and make recommendations for improving product performance</li><li>Work with the customer service team to address any product-related inquiries or issues</li><li>Stay up-to-date on industry trends and competitor activity<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>The successful candidate will possess the following qualifications:<br/><br/><ul><li>Strong understanding of ecommerce operations, including product posting and order fulfillment</li><li>Experience with Amazon marketplace and other online marketplaces</li><li>Previous experience in merchandising and sales is preferred</li><li>Familiarity with Shopify or other ecommerce platforms</li><li>Ability to analyze and interpret sales data to make informed decisions</li><li>Excellent communication and teamwork skills</li><li>Attention to detail and ability to meet deadlines<br/><br/></li></ul><strong>Benefits<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/><strong>Email Your Resume In Word To<br/><br/></strong>lauren.formby@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : LF2-1810858 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Lauren Formby - Director of Recruiting<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>", "responsibilities": "The Ecommerce Merchandise Coordinator will be responsible for managing the online product listings and merchandising for our company's ecommerce platform. This role requires a strong understanding of ecommerce operations, as well as experience with product posting and Amazon marketplace. The ideal candidate will also have experience in merchandising and sales, and be familiar with Shopify.", "qualifications": {"required": "Strong understanding of ecommerce operations, including product posting and order fulfillment, Experience with Amazon marketplace and other online marketplaces, Previous experience in merchandising and sales is preferred, Familiarity with Shopify or other ecommerce platforms, Ability to analyze and interpret sales data to make informed decisions, Excellent communication and teamwork skills, Attention to detail and ability to meet deadlines", "preferred": "Previous experience in merchandising and sales is preferred"}, "skills": ["Ecommerce", "Amazon Marketplace", "Shopify", "Merchandising", "Sales", "Product Listing", "Inventory Management", "Sales Data Analysis", "Customer Service"], "postedDate": "2 weeks ago", "benefits": "Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nEmail Your Resume In Word To\n\nlauren.formby@cybercoders.com\n\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : LF2-1810858 -- in the email subject line for your application to be considered.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978068327"}