{"jobTitle": "Air Import Agent", "company": {"name": "Forward Air Corporation", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$26-$30 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "Omni Logistics is a global provider of air, ocean and ground services, including supplemental services for enterprises dependent on the efficient movement of high value freight. Omni Logistics is a wholly owned subsidiary of Forward Air, a leading asset-light provider of transportation services across the United States, Canada and Mexico. We provide expedited less-than-truckload services, including local pick-up and delivery, shipment consolidation/deconsolidation, warehousing, and customs brokerage by utilizing a comprehensive national network of terminals. In addition, we offer truckload brokerage services, including dedicated fleet services, and intermodal, first- and last-mile, high-value drayage services, both to and from seaports and railheads, dedicated contract and Container Freight Station warehouse and handling services. We are more than a transportation company. Forward is a single resource for your shipping needs.<br/><br/>Position: Air Import Agent<br/><br/>Compensation: $26-$30 per hour<br/><br/>Core Responsibilities &amp; Duties<br/><br/><ul><li>Coordinate the transportation of goods by air </li><li>Prepare and process required documentation for International Import Transportation </li><li>Track and monitor shipments, providing regular status updates to customers </li><li>Manage relationships with customers, ensuring their satisfaction and addressing any concerns or issues that may arise </li><li>Collaborate with other internal departments such as accounting, sales, and operations to ensure timely and efficient service requirements </li><li>Ensure compliance with all relevant regulations and laws, including customs regulations and trade laws </li><li>Other duties as assigned <br/><br/></li></ul>Job Requirements &amp; Qualifications<br/><br/><ul><li>Minimum of 2-3 years of experience in international import operation </li><li>Previous knowledge of cargo operations preferred <br/><br/></li></ul>What We Offer<br/><br/><ul><li>Competitive base salary</li><li>Two weeks of paid time off within the first year of employment, sick time and holidays</li><li>Company provided life insurance</li><li>Health, vision, and dental insurance options</li><li>Commuter benefit plan</li><li>Optional supplemental life insurance</li><li>401(k)</li><li>Wellness program</li><li>A great place to work with a terrific culture<br/><br/></li></ul>About Us<br/><br/>Since 1990, Forward Air has been a leading provider of ground transportation and related logistics services to the North American air freight and expedited LTL market. We offer surface shipping on an accelerated “time-definite” basis, delivering cargo at a specific time, but under less time-sensitive situations – supplying you with a cost effective, reliable alternative to air transportation. We work with companies of all sizes to develop tangible advantages and build the best products to meet your specific needs. Forward Air presents to the wholesale transportation community (logistics companies, freight forwarders, integrated air cargo carriers, passenger/ cargo airlines, and non-traditional shippers), a single-source provider that can deliver more supply chain services and a superior menu of choices. Throughout the years we have added supplementary lines to our linehaul service, such as full truckload operations (Truckload Services), final-mile coverage (Complete® Cartage), and an Airline Logistics program, and we will continue to expand our services to meet the changing needs and growth of our customer base.<br/><br/>Forward Air is structured to optimize both savings and service to our customers. Direct partnerships with owner-operators and other surface transportation providers, enable us to remain cost-competitive. The Forward Air network is designed with over 90 facilities located at or near major U.S. and Canadian airports, 12 regional sort centers and over 300 beyond points (secondary airports provided through our Complete Cartage service), creating one of the most comprehensive linehaul networks in the industry.<br/><br/>Ranked 3rd in Newsweeks 2022 “ Americas Most Trustworthy Companies ” publication", "responsibilities": "<ul><li>Coordinate the transportation of goods by air </li><li>Prepare and process required documentation for International Import Transportation </li><li>Track and monitor shipments, providing regular status updates to customers </li><li>Manage relationships with customers, ensuring their satisfaction and addressing any concerns or issues that may arise </li><li>Collaborate with other internal departments such as accounting, sales, and operations to ensure timely and efficient service requirements </li><li>Ensure compliance with all relevant regulations and laws, including customs regulations and trade laws </li><li>Other duties as assigned <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Minimum of 2-3 years of experience in international import operation </li><li>Previous knowledge of cargo operations preferred <br/><br/></li></ul>"}, "skills": ["Air Freight", "International Shipping", "Logistics", "Transportation", "Customer Service", "Documentation", "Cargo Operations", "Customs Regulations", "Trade Laws"], "postedDate": "1 week ago", "benefits": "<ul><li>Competitive base salary</li><li>Two weeks of paid time off within the first year of employment, sick time and holidays</li><li>Company provided life insurance</li><li>Health, vision, and dental insurance options</li><li>Commuter benefit plan</li><li>Optional supplemental life insurance</li><li>401(k)</li><li>Wellness program</li><li>A great place to work with a terrific culture<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978168871"}