{"jobTitle": "Supervisor, Outbound Fulfillment", "company": {"name": "Southern Glazer's Wine & Spirits", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,700.00/yr - $113,300.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Beverage Manufacturing, Food and Beverage Services, and Freight and Package Transportation", "description": "<strong>What You Need To Know<br/><br/></strong>Open your future to incredible career potential. Work for an industry-leader who invests in their people. Southern Glazer’s Wine &amp; Spirits is North America’s preeminent wine and spirits distributor, as well as a family-owned, privately held company with a 50+ year legacy of success. We were named by Newsweek as a Most Loved Workplace and are included on the Forbes lists for Largest Private Companies and Best Employers for Diversity.<br/><br/>As a full-time employee, you can choose from a full menu of our Top Shelf Benefits, including comprehensive medical and prescription drug coverage, dental and vision plans, tax-saving Flexible Spending Accounts, disability coverage, life insurance plans, and a 401(k) plan. We also offer tuition reimbursement, a wellness program, parental leave, vacation accrual, paid sick leave, and more.<br/><br/>Southern Glazer’s offers a competitive compensation package with a salary range of $68,700 - $113,300/yr. plus bonus. This salary range is an average range for this position. In determining a final offer, the company will evaluate a specific candidate's education, skills and experience and will make an offer appropriately.<br/><br/>At Southern Glazer’s, you’ll enjoy an environment where continuous learning and growth are supported and experience a culture where you are respected, and your voice is heard. If you’re looking to fill your glass with opportunity, come join our FAMILY.<br/><br/><strong>Overview<br/><br/></strong>Responsible for providing general supervision to employees in order fulfillment, distribution center. This role will also be responsible for receiving, storing, delivering items, and securing the warehouse. The Outbound Supervisor will use various operations reports to accurately record and measure metrics to ensure efficient production levels.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Direct the filling, loading, and checking of product orders for retail customers through the management of team associates</li><li>Train new team assoociates and ensures understanding of organization and operation policies and service guidelines</li><li>Ensure accurate and efficient fullfillment of orders to retail customers</li><li>Coach, direct, and counsel team associates on overall performance</li><li>Define productivity expectations and monitors progress regularly</li><li>Conduct meetings with team associates</li><li>Identify and recommends opportunities for employee development and performance improvement requirements</li><li>Participate in the recruitment and hiring of team associates</li><li>Assist with evening scheduling for night warehouse operations<br/><br/></li></ul><strong>Additional Primary Responsibilities<br/><br/></strong><ul><li>Attend monthly safety meetings</li><li>Participate in the online training courses each quarter</li><li>Achieve all operational performance metrics as required</li><li>Maintain safe working environment according to company and OSHA regulations</li><li>Perform other related duties as assigned<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Bachelors Dregree/preferred</li><li>3 years of experience or equivalent education and related experience</li><li>Proficient in Microsoft Office Suite</li><li>Strong organization, multi-tasking, and time management skills <br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Physical demands include a considerable amount of time walking, bending, reaching, standing, squatting, and stooping </li><li>Additional hours may be required during October, November, and December and other peak periods</li><li>Capable of working flexible hours which could include overnight, early morning, and/or late evening</li><li>May require working at heights of 8 feet or greater </li><li>May require lifting/lowering, pushing, carrying, or pulling up to 56lbs<br/><br/></li></ul><strong>EEO Statement<br/><br/></strong>Southern Glazer's Wine and Spirits, an Affirmative Action/EEO employer, prohibits discrimination and harassment of any type and provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Southern Glazer's Wine and Spirits provides competitive compensation based on estimated performance level consistent with the past relevant experience, knowledge, skills, abilities and education of employees. Unless otherwise expressly stated, any pay ranges posted here are estimates from outside of Southern Glazer's Wine and Spirits and do not reflect Southern Glazer's pay bands or ranges.<br/><br/>", "responsibilities": "Responsible for providing general supervision to employees in order fulfillment, distribution center. This role will also be responsible for receiving, storing, delivering items, and securing the warehouse. The Outbound Supervisor will use various operations reports to accurately record and measure metrics to ensure efficient production levels.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Direct the filling, loading, and checking of product orders for retail customers through the management of team associates</li><li>Train new team assoociates and ensures understanding of organization and operation policies and service guidelines</li><li>Ensure accurate and efficient fullfillment of orders to retail customers</li><li>Coach, direct, and counsel team associates on overall performance</li><li>Define productivity expectations and monitors progress regularly</li><li>Conduct meetings with team associates</li><li>Identify and recommends opportunities for employee development and performance improvement requirements</li><li>Participate in the recruitment and hiring of team associates</li><li>Assist with evening scheduling for night warehouse operations<br/><br/></li></ul><strong>Additional Primary Responsibilities<br/><br/></strong><ul><li>Attend monthly safety meetings</li><li>Participate in the online training courses each quarter</li><li>Achieve all operational performance metrics as required</li><li>Maintain safe working environment according to company and OSHA regulations</li><li>Perform other related duties as assigned<br/><br/></li></ul>", "qualifications": {"required": "3 years of experience or equivalent education and related experience, Proficient in Microsoft Office Suite, Strong organization, multi-tasking, and time management skills", "preferred": "Bachelors Dregree"}, "skills": ["Microsoft Office", "Management", "Training", "Customer Service", "Warehouse Management", "Teamwork", "Communication", "Leadership", "Operations", "Safety"], "postedDate": "1 month ago", "benefits": "As a full-time employee, you can choose from a full menu of our Top Shelf Benefits, including comprehensive medical and prescription drug coverage, dental and vision plans, tax-saving Flexible Spending Accounts, disability coverage, life insurance plans, and a 401(k) plan. We also offer tuition reimbursement, a wellness program, parental leave, vacation accrual, paid sick leave, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978010716"}