{"jobTitle": "Commercial Banking Relationship Manager", "company": {"name": "U.S. Bank", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance and Sales", "industry": "Banking", "description": "At U.S. Bank, we’re on a journey to do our best. Helping the customers and businesses we serve to make better and smarter financial decisions and enabling the communities we support to grow and succeed. We believe it takes all of us to bring our shared ambition to life, and each person is unique in their potential. A career with U.S. Bank gives you a wide, ever-growing range of opportunities to discover what makes you thrive at every stage of your career. Try new things, learn new skills and discover what you excel at—all from Day One.<br/><br/><strong>Job Description<br/><br/></strong>We have an exciting opportunity for a talented senior level Relationship Manager to come in and manage and grow portfolio of commercial loans. This sales and relationship focused individual will prospect for and close new business relationships and retain and expand relationships with existing customers. The Relationship Manager will sell appropriate bank products and services to those prospects and clients, identifying and successfully capitalizing on One U.S. Bank and making appropriate referrals. The Relationship Manager provides financial advice to customers, approves loans within assigned limits, manages loans and portfolio credit quality.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Master's degree in finance, accounting or other related field</li><li> 10 or more years of commercial lending experience<br/><br/><br/></li></ul><strong>Preferred Skills/Experience<br/><br/></strong><ul><li> Considerable knowledge and experience in managing and growing a large and complex portfolio of commercial loans</li><li> Strong leadership and strategic management skills</li><li> Excellent verbal and written communication skills</li><li> Well-developed analytical, decision-making and problem-solving skills<br/><br/><br/></li></ul>We have an exciting opportunity for a dynamic Senior Banker on U.S. Bank’s Denver Commercial Banking Team. The ideal candidate has proven business development experience in the commercial and industrial space in addition to having the ability manage and grow a large, complex commercial loan portfolio. Candidate should have knowledge and experience with regards to advising clients and prospects on commercial banking ancillary product sets and services, be able to identify and successfully capitalize on cross-sell opportunities and make appropriate referrals. This person will understand how to navigate a commercial banking loan approval process and can successfully manage portfolio credit quality.<br/><br/>If there’s anything we can do to accommodate a disability during any portion of the application or hiring process, please refer to our disability accommodations for applicants.<br/><br/><strong>Benefits:<br/><br/></strong>Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours):<br/><br/><ul><li>Healthcare (medical, dental, vision)</li><li>Basic term and optional term life insurance</li><li>Short-term and long-term disability</li><li>Pregnancy disability and parental leave</li><li>401(k) and employer-funded retirement plan</li><li>Paid vacation (from two to five weeks depending on salary grade and tenure)</li><li>Up to 11 paid holiday opportunities</li><li>Adoption assistance</li><li>Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law<br/><br/><br/></li></ul><strong>EEO is the Law<br/><br/></strong>U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors. Applicants can learn more about the company’s status as an equal opportunity employer by viewing the federal <strong>KNOW YOUR RIGHTS</strong> EEO poster.<br/><br/><strong>E-Verify<br/><br/></strong>U.S. Bank participates in the U.S. Department of Homeland Security E-Verify program in all facilities located in the United States and certain U.S. territories. The E-Verify program is an Internet-based employment eligibility verification system operated by the U.S. Citizenship and Immigration Services. Learn more about the E-Verify program.<br/><br/>The salary range reflects figures based on the primary location, which is listed first. The actual range for the role may differ based on the location of the role. In addition to salary, U.S. Bank offers a comprehensive benefits package, including incentive and recognition programs, equity stock purchase 401(k) contribution and pension (all benefits are subject to eligibility requirements). Pay Range: $155,295.00 - $182,700.00 - $200,970.00<br/><br/>Job postings typically remain open for approximately 20 days of the posting date listed above, however the job posting may be closed earlier should it be determined the position is no longer required due to business need. Job postings in areas with a high volume of applicants, such as customer service, contact center, and Financial Crimes investigations, remain open for approximately 5 days of the posting listed date.", "responsibilities": "We have an exciting opportunity for a talented senior level Relationship Manager to come in and manage and grow portfolio of commercial loans. This sales and relationship focused individual will prospect for and close new business relationships and retain and expand relationships with existing customers. The Relationship Manager will sell appropriate bank products and services to those prospects and clients, identifying and successfully capitalizing on One U.S. Bank and making appropriate referrals. The Relationship Manager provides financial advice to customers, approves loans within assigned limits, manages loans and portfolio credit quality.", "qualifications": {"required": "Master's degree in finance, accounting or other related field, 10 or more years of commercial lending experience", "preferred": "Considerable knowledge and experience in managing and growing a large and complex portfolio of commercial loans, Strong leadership and strategic management skills, Excellent verbal and written communication skills, Well-developed analytical, decision-making and problem-solving skills"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours):<br/><br/><ul><li>Healthcare (medical, dental, vision)</li><li>Basic term and optional term life insurance</li><li>Short-term and long-term disability</li><li>Pregnancy disability and parental leave</li><li>401(k) and employer-funded retirement plan</li><li>Paid vacation (from two to five weeks depending on salary grade and tenure)</li><li>Up to 11 paid holiday opportunities</li><li>Adoption assistance</li><li>Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law<br/><br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "155,295.00 - 182,700.00 - 200,970.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3978075205"}