{"jobTitle": "Executive Assistant, Franchise Management and Marketing", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "54,600.00 - 101,400.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Your new role...<br/><br/></strong>Warner Bros. Discovery Consumer Products seeks an Executive Assistant to provide administrative support for four executives across the Global Franchise Management &amp; Marketing and Consumer Products divisions. Based in Burbank, CA, the Executive Assistant will be responsible for managing the administrative functions for the four executives including but not limited to calendar management, travel, expense reports, meetings, and purchase orders. Note that the Executive Assistant must be able to support 3 executives based in Burbank CA and 1 executive based in New York.<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><ul><li>Manages calendars including but not limited to scheduling meetings, securing meeting rooms, coordinate drive-on passes for external attendees, ordering catering items, etc.</li><li>Coordinates and arranges travel and hotel accommodations, and completes travel and expense reports</li><li>General administrative duties including but not limited to making photocopies of reports, documents and other materials, prepares packages for delivery or courier services and orders supplies</li><li>Coordinates internal and external WBDGCP distribution of materials</li><li>Support Team Members with the Processing of Independent Contractor forms and Master Vendor Agreements when needed</li><li>Serve as point person for outside vendors when resolving invoice and payment issues Maintains and reconciles all PCard expenses for marketing team</li><li>Attends team meetings and actively participates in team initiatives, brainstorming, planning, etc.</li><li>Create and manage team documents, meeting agendas and reports, etc. as directed by supervisor</li><li>Onboarding new and temporary employees, procure hardware, arrange systems access and request software Other duties or special projects as requested by supervisor<br/><br/></li></ul><strong>Qualifications &amp; Experience...<br/><br/></strong><ul><li>1-4 years of previous EA experience preferred</li><li>Previous experience in licensing, marketing, entertainment or retail environment preferred</li><li>High School diploma</li><li>College degree preferred</li><li>Proficiency with Outlook, Microsoft Word, Excel and PowerPoint required, PhotoShop, Illustrator, Teams, WebEx, Zoom and Keynote. SAP familiarity preferred</li><li>Must be able to support executives in various locations and time zones</li><li>Must have the ability to communicate effectively and tactfully with persons on all levels, in person and on the telephone</li><li>Must have the ability to pay close attention to detail and understand written and oral instructions</li><li>Must have the ability to organize and schedule work effectively</li><li>Must have the ability to work well under time constraints</li><li>Must be able to handle multiple tasks<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $54,600.00 - $101,400.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "Warner Bros. Discovery Consumer Products seeks an Executive Assistant to provide administrative support for four executives across the Global Franchise Management &amp; Marketing and Consumer Products divisions. Based in Burbank, CA, the Executive Assistant will be responsible for managing the administrative functions for the four executives including but not limited to calendar management, travel, expense reports, meetings, and purchase orders. Note that the Executive Assistant must be able to support 3 executives based in Burbank CA and 1 executive based in New York.", "qualifications": {"required": "Proficiency with Outlook, Microsoft Word, Excel and PowerPoint required, PhotoShop, Illustrator, Teams, WebEx, Zoom and Keynote. SAP familiarity preferred", "preferred": "1-4 years of previous EA experience preferred, Previous experience in licensing, marketing, entertainment or retail environment preferred, High School diploma, College degree preferred, Must be able to support executives in various locations and time zones, Must have the ability to communicate effectively and tactfully with persons on all levels, in person and on the telephone, Must have the ability to pay close attention to detail and understand written and oral instructions, Must have the ability to organize and schedule work effectively, Must have the ability to work well under time constraints, Must be able to handle multiple tasks"}, "skills": ["Outlook", "Microsoft Word", "Excel", "PowerPoint", "PhotoShop", "Illustrator", "Teams", "WebEx", "Zoom", "Keynote", "SAP"], "postedDate": "2 weeks ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978647242"}