{"jobTitle": "Director", "company": {"name": "HR&A Advisors", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "129,000.00/yr - 146,400.00/yr", "currency": "USD"}, "jobFunction": "Consulting, Management, and Strategy/Planning", "industry": "Real Estate", "description": "<strong>ABOUT US | </strong> HR&A Advisors, Inc. (HR&A) is an employee-owned company advising public, private, non-profit, and philanthropic clients on how to increase opportunity and advance quality of life in cities. <p><br/></p><p>We believe in creating vital places, building equitable and resilient communities, and improving people’s lives. </p><p><br/></p><p>From Brooklyn to London, Medellin to Hong Kong, we have guided hundreds of clients in transforming real estate and economic development concepts, and public infrastructure, first into actionable plans and then into job-producing, community-strengthening assets. </p><p><br/></p><p>Our clients include real estate owners and investors, hospitals and universities, cultural institutions and philanthropies, community development organizations, and governments. </p><p><br/></p><p>HR&A has offices in Atlanta, Dallas, Los Angeles, New York, Raleigh, and Washington D.C. We come from diverse backgrounds, have a breadth of lived experience, and share a passion for cities. We are former city officials, executive directors, planners, lawyers, architects, and economists. </p><p><br/></p><p><strong>THE PRACTICE | </strong>HR&A’s Housing Affordability Practice works at all levels of the housing ecosystem. We create housing plans and strategies based on local needs and priorities. We design and implement solutions, from inclusionary zoning policies to affordable housing investment funds. And we underwrite and close housing transactions on behalf of public and private sector clients. This range of work, from planning to deal making, makes us better at designing policies and local housing plans that achieve their goals in practice and at integrating public incentives into individual projects. We enjoy understanding and working with the complexities of the housing market to advance the interests of all parties. </p><p><br/></p><p><strong>THE ROLE |</strong> HR&A’s Housing Affordability Practice is seeking a full-time <strong>Director</strong> to join our<strong> Los Angeles</strong> office. Directors are seasoned career professionals with 8-12 years of professional experience in project management, real estate, economic development, affordable housing, or related consulting fields, and must demonstrate critical analytic thinking skills to serve our clients, possess a passion for intelligent urban development, and have a deep curiosity about the challenges and opportunities facing cities.</p><p><br/></p><p>Successful candidates will have relevant project management experience in housing policy, housing market analysis, housing regulations, affordable housing finance or related consulting fields. Day-to-day tasks will require managing internal and external teams to complete complex housing assignments, including housing market analysis and needs assessments, pro forma analysis for affordable and market rate housing, public-private partnership strategy, and public policy program design. <strong>Experience in California housing policy and regulations and familiarity with affordable housing finance in California is strongly preferred. </strong></p><p><br/></p><p>The Director will develop, review, and present client deliverables – including memos, reports, and PowerPoint presentations – and will support the firm’s business development efforts. Successful candidates will bring a strong foundation of California-based housing market, policy and/or finance expertise and an interest in creative public-private solutions, as well as significant capacity for leadership.</p><p><br/></p><p>Depending on the project, Directors may expect their work to include:</p><ul><li>managing internal and external teams to complete complex housing assignments including housing market analysis and needs assessments</li><li>pro forma analysis for affordable and market rate housing</li><li>public-private partnership strategy and financing</li><li>public policy program design</li><li>reviewing and presenting client deliverables, including memos, reports, financial models and PowerPoint presentations aimed at technical and non-technical audiences</li><li>supporting the firm's business development efforts, including proposal drafting, team building, leading interviews with potential clients, and identifying new business opportunities </li></ul><p><br/></p><p><strong>EXPERIENCE REQUIRED | </strong>We are looking for candidates with a strong background in housing policy and related fields, a passion for urban development, and the ability to lead and manage complex projects. Ideal Director candidates will bring substantial expertise and capabilities aligned with the roles and responsibilities described above, including:</p><p><br/></p><ul><li>8–12 years of work experience in housing policy, housing regulation analysis and design, housing market analysis, affordable housing finance, and/or consulting in a related field</li><li>project management experience for consulting engagements in a relevant field in California is preferred</li><li>substantial project management experience in housing-related specializations</li><li>excellent writing and presentation skills</li><li>mentoring capabilities</li><li>high motivation and independent thinking</li><li>poise for direct client interaction</li><li>potential for rapid professional growth</li><li>Master’s degree, preferably in housing policy, real estate, city planning, economics, public administration, economic development, and/or business (considerable additional experience in a closely related field may substitute for a graduate degree) </li></ul><p><br/></p><p><strong>HYBRID WORK POLICY | </strong>HR&A fosters a collaborative and flexible work environment through our hybrid work policy. Employees work from the office at least two days a week, which allows individuals the freedom to balance their professional and personal lives while maintaining a strong connection to their teams.</p><p><br/></p><p><strong>COMPENSATION | </strong>The base salary range for this position is $129,000 - $146,400, plus the opportunity for a discretionary year-end bonus. Where an offer falls inside this pay range is dependent on experience. We offer competitive compensation packages, based on qualifications and experience. We are an employee-owned company, meaning you will have the opportunity to benefit from the firm’s growth over time through participation in our Employee Stock Ownership Plan. Each year, the firm will contribute funds to this long-term wealth-building account and may make contributions to other retirement accounts. We also provide a comprehensive benefits package that goes well beyond coverage of 90-95% of healthcare premiums, including dental and vision coverage. </p><p><br/></p><p><strong>HOW TO APPLY |</strong> HR&A is committed to attracting and retaining a talented, diverse, competitive team of professionals dedicated to solving the challenges of urban life. Women, people of color, members of the LGBTQ community, individuals with disabilities, and veterans are strongly encouraged to apply. </p><p><br/></p><p>To apply, p<strong>lease submit your cover letter and your resume as a single PDF document. Applications without this requested cover letter will not be reviewed. </strong></p><p><br/></p><p>As part of our ongoing work to build a hiring system that mitigates bias and is based on candidate merit and performance, we ask that you <strong>submit a version of your resume and cover letter that has your school information removed</strong>. Please list your degree, e.g., B.A. Economics; however, <strong>remove all references to undergraduate and graduate schools you have attended</strong>. </p><p><br/></p><p>All qualified candidates will receive consideration for employment without regard to their race, religion, ancestry, national origin, sex, sexual orientation, gender identity or expression, age, disability, marital status, medical condition, veteran status or any other basis as protected by federal, state, or local law.</p>", "responsibilities": "Directors are seasoned career professionals with 8-12 years of professional experience in project management, real estate, economic development, affordable housing, or related consulting fields, and must demonstrate critical analytic thinking skills to serve our clients, possess a passion for intelligent urban development, and have a deep curiosity about the challenges and opportunities facing cities.", "qualifications": {"required": "8–12 years of work experience in housing policy, housing regulation analysis and design, housing market analysis, affordable housing finance, and/or consulting in a related field\nproject management experience for consulting engagements in a relevant field in California is preferred\nsubstantial project management experience in housing-related specializations\nexcellent writing and presentation skills\nmentoring capabilities\nhigh motivation and independent thinking\npoise for direct client interaction\npotential for rapid professional growth\nMaster’s degree, preferably in housing policy, real estate, city planning, economics, public administration, economic development, and/or business (considerable additional experience in a closely related field may substitute for a graduate degree)", "preferred": "Experience in California housing policy and regulations and familiarity with affordable housing finance in California is strongly preferred."}, "skills": ["Project Management", "Real Estate", "Economic Development", "Affordable Housing", "Consulting", "Housing Policy", "Housing Market Analysis", "Housing Regulations", "Affordable Housing Finance", "Public-Private Partnerships", "Public Policy", "Client Management", "Business Development", "Proposal Writing", "Team Building", "Leadership", "California Housing Policy", "California Affordable Housing Finance", "Urban Development", "Presentation Skills", "Writing Skills", "Mentoring"], "postedDate": "2 weeks ago", "benefits": "We offer competitive compensation packages, based on qualifications and experience. We are an employee-owned company, meaning you will have the opportunity to benefit from the firm’s growth over time through participation in our Employee Stock Ownership Plan. Each year, the firm will contribute funds to this long-term wealth-building account and may make contributions to other retirement accounts. We also provide a comprehensive benefits package that goes well beyond coverage of 90-95% of healthcare premiums, including dental and vision coverage.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3978284919"}