{"jobTitle": "Supervisor Técnico - Senior", "company": {"name": "CEA · Centro de Ecologia Aplicada S.A.", "industry": "Environmental Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Engineering and Information Technology", "industry": "Environmental Services", "description": "En nuestra consultora de medio ambiente 🌱🌎 deseamos agregar valor a nuestra organización, incorporando a un Jefe de proyectos con experiencia en medio marino a nuestro gran equipo de trabajo en CEA 👏. Tu Misión Será Supervisión de los estudios, monitoreos y seguimientos que el cliente encargue a teceros, dentro de las competencias de CEA. Levantamiento y procesamiento de la información para la supervisión de actividades de terreno y evaluar el cumplimiento de las medidas. Supervisar la calidad de las actividades y el correcto desempeño del trabajo de los especialistas a cargo de la ejecución de las medidas. Requisitos Disponiblidad de trabajo en turno 7x7, Licencia de conducción (Excluyente), Examenes de altura, incluye alcohol y drogas (Excluyentes), Profesional con mas de 8 años de experiencia en la supervisión de trabajos en terreno.", "responsibilities": "Supervisión de los estudios, monitoreos y seguimientos que el cliente encargue a teceros, dentro de las competencias de CEA. Levantamiento y procesamiento de la información para la supervisión de actividades de terreno y evaluar el cumplimiento de las medidas. Supervisar la calidad de las actividades y el correcto desempeño del trabajo de los especialistas a cargo de la ejecución de las medidas.", "qualifications": {"required": "Disponiblidad de trabajo en turno 7x7, Licencia de conducción (Excluyente), Examenes de altura, incluye alcohol y drogas (Excluyentes), Profesional con mas de 8 años de experiencia en la supervisión de trabajos en terreno.", "preferred": "Not specified"}, "skills": ["Supervisión", "Monitoreo", "Evaluación de cumplimiento", "Gestión de proyectos"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Grato ambiente laboral, Vestimenta informal de oficina, Excelente ubicación a sólo cuadras de estación de metro, Estacionamiento de bicicletas al interior de oficina, Sector de área verde dentro de nuestras dependencias, Compromiso con reciclaje con artículos de oficina y sanitarios, Atractivos proyectos y turnos de trabajo, Seguro de Vida, Caja de compensación, Tarde libre de cumpleaños, Día semanal de la fruta, Aguinaldo fiestas patrias, Aguinaldo navidad, Fiesta Fin de Año, Reajusta IPC anual, Beneficios corporativos, Aprendizaje y desarrollo profesional.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978179599"}