{"jobTitle": "Warehouse Shipping & Receiver", "company": {"name": "Mercury Air Cargo", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Airlines and Aviation", "description": "<strong>Job Summary<br/><br/></strong>As a shipping and Receiver, you are responsible for the accurate and efficient unloading and documentation of incoming shipments and products and the correct loading of pallets and shipments in a manner compliant with international and domestic air travel. Attention to detail, precision, and critical thinking are fundamental to performing this job. To succeed, you should be able to adapt well to change, be flexible, and always keep in mind your safety and the safety of others.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Receive products and loads in an efficient and timely manner.</li><li>Unload trucks in a timely manner from the appropriate dock area.</li><li>Coordinate with Customer service to ensure the accuracy of documents and unloading procedures.</li><li>Check received product for damage and keep thorough and accurate notations of damage to received products.</li><li>Take and document temperatures of received products.</li><li>Escort truck drivers.</li><li>Confirm that received product documentation has correct piece counts.</li><li>Stamp Bill of Lading (BOL) document and fill in fields accurately and completely.</li><li>Notate and communicate any discrepancies found on the BOL to the Leads, Supervisors and Managers.</li><li>Store product correctly, according to notes on the BOL.</li><li>Prepare pallets for the screening and K9 teams and return to the proper storage area once screening is completed.</li><li>Confirm Purchase Order (PO) information is accurate and consistent.</li><li>Correctly label and tag pallets with the appropriate BOL labels.</li><li>Learn and maintain a thorough knowledge of procedures required by various customers, products, airlines, and destinations. </li><li>Learn and maintain a thorough knowledge of cargo loading devices (ex. LD3, AKE, PMC, etc.)</li><li>Break down pallets and organize product into airline-ready shipments. </li><li>Operate a forklift and pallet jack safely and appropriately as needed.</li><li>Operate all warehouse equipment used in the core duties safely and appropriately.</li><li>Participate in any training programs as assigned.</li><li>Report to your assigned shift on time each day you are scheduled to work.</li><li>Keep the work area well-organized, clean, and free from trash and debris.</li><li>Wear a safety vest always while in the warehouse facility.</li><li>Assist in training and teaching new hires as needed.</li><li>Report any Compliance issues to the Shift Manager promptly.</li><li>Follow all safety protocols.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Comprehension of English (both written and verbal)</li><li>Detail oriented </li><li>High level of accuracy in work</li><li>A safety-conscious mindset</li><li>Ability to work in a fast-paced environment.</li><li>Ability to work under deadlines and pressure.</li><li>Ability to obtain and maintain forklift certification.</li><li>Must be able to work in a refrigerated or cold environment for duration of shift.</li><li>Must be comfortable in a warehouse environment and around fast-moving equipment.</li><li>Must be able to lift, push, or pull up to 50 lbs.</li><li>Must be able to reach above shoulder level, bend, sit, squat, stoop, crouch, reach, kneel, and twist/turn.</li><li>Must be able to stand for long periods of time.</li><li>Must be able to pass a preemployment physical, background check, and drug screening.<br/><br/></li></ul><strong>EDUCATION<br/><br/></strong><ul><li>High School Diploma or GED preferred.<br/><br/></li></ul><strong>Preferred Skills<br/><br/></strong><ul><li>Experience in a refrigerated/cold climate warehouse</li><li>Experience in using a computer or tablet for work.<br/><br/></li></ul>This job description is a summary of duties for which you as an employee are expected to perform in your assignment. It is by no means an all-inclusive list, rather a broad guide to expected duties. As an employee you must understand that a job description is neither complete nor permanent and may be modified at any time. At the request of management, any employee may be asked to perform additional duties, responsibilities, or projects without notice.", "responsibilities": "Receive products and loads in an efficient and timely manner. Unload trucks in a timely manner from the appropriate dock area. Coordinate with Customer service to ensure the accuracy of documents and unloading procedures. Check received product for damage and keep thorough and accurate notations of damage to received products. Take and document temperatures of received products. Escort truck drivers. Confirm that received product documentation has correct piece counts. Stamp Bill of Lading (BOL) document and fill in fields accurately and completely. Notate and communicate any discrepancies found on the BOL to the Leads, Supervisors and Managers. Store product correctly, according to notes on the BOL. Prepare pallets for the screening and K9 teams and return to the proper storage area once screening is completed. Confirm Purchase Order (PO) information is accurate and consistent. Correctly label and tag pallets with the appropriate BOL labels. Learn and maintain a thorough knowledge of procedures required by various customers, products, airlines, and destinations. Learn and maintain a thorough knowledge of cargo loading devices (ex. LD3, AKE, PMC, etc.). Break down pallets and organize product into airline-ready shipments. Operate a forklift and pallet jack safely and appropriately as needed. Operate all warehouse equipment used in the core duties safely and appropriately. Participate in any training programs as assigned. Report to your assigned shift on time each day you are scheduled to work. Keep the work area well-organized, clean, and free from trash and debris. Wear a safety vest always while in the warehouse facility. Assist in training and teaching new hires as needed. Report any Compliance issues to the Shift Manager promptly. Follow all safety protocols.", "qualifications": {"required": "Comprehension of English (both written and verbal), Detail oriented, High level of accuracy in work, A safety-conscious mindset, Ability to work in a fast-paced environment, Ability to work under deadlines and pressure, Ability to obtain and maintain forklift certification, Must be able to work in a refrigerated or cold environment for duration of shift, Must be comfortable in a warehouse environment and around fast-moving equipment, Must be able to lift, push, or pull up to 50 lbs, Must be able to reach above shoulder level, bend, sit, squat, stoop, crouch, reach, kneel, and twist/turn, Must be able to stand for long periods of time, Must be able to pass a preemployment physical, background check, and drug screening", "preferred": "Experience in a refrigerated/cold climate warehouse, Experience in using a computer or tablet for work"}, "skills": ["Forklift Operation", "Warehouse Management", "Safety", "Customer Service", "Documentation", "Inventory Management", "Shipping", "Receiving", "Cold Storage", "Pallet Jack Operation"], "postedDate": "1 month ago", "url": "https://www.linkedin.com/jobs/view/3978692574"}