{"jobTitle": "Buyer, Housewares", "company": {"name": "Gibson Homewares", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Manufacturing", "description": "<strong>About Gibson<br/><br/></strong>Gibson Homewares is the nation's leading producer of dinnerware, cookware, cutlery, tools, and gadgets - all the essentials needed for prep, cooking, dining, and entertaining.<br/><br/>For over 40 years and spanning four generations as a respected and trusted family-owned company, Gibson Homewares has developed a portfolio of brands across multiple categories. <strong>Based in Los Angeles</strong>, Gibson is known for delivering product lines with style and value for the global retail marketplace. Gibson's legacy brands include Gibson Elite, Gibson Home, and Soho Lounge. In addition, Gibson is a driving force behind global brands such as Martha Stewart, Babish, Kenmore, Crockpot, Oster, Mr. Coffee, Sur La Table and Peanuts.<br/><br/>At Gibson, <strong>PEOPLE ARE THE #1 PRIORITY</strong>. Gibson is always looking for new talent to join our growing team.<br/><br/>For more information, visit us at http://www.gibsonhomewares.com.<br/><br/><strong>Job Title: Buyer, Housewares<br/><br/></strong><strong>Buyer, Housewares Responsibilities<br/><br/></strong><ul><li>The Buyer, Housewares is responsible for sourcing and developing new products with factories in India and other countries in Southeast Asia</li><li>Build relationship with our factory partners in buying and negotiating pricing of Housewares products</li><li>Take charge for the assigned projects understanding the US retailers needs and meet shipping deadlines</li><li>Work in collaboration with internal Creative, Marketing, Sales and Overseas teams for product category and brand selection<br/><br/></li></ul><strong>Buyer, Housewares Requirements<br/><br/></strong><ul><li>College degree preferred in related field, or equivalent work experience</li><li>Relevant work experience, purchasing CPG products, hard goods, preferably cookware, cutlery, flatware </li><li>Excellent professional-level communication skills, written and verbal with factories in India and other countries in Southeast Asia</li><li>Proficiency in Microsoft 365, notably MS Excel</li><li>Must be organized and able to work in a fast paced, deadline-driven work environment</li></ul>", "postedDate": "1 month ago", "skills": ["Microsoft 365", "MS Excel", "Communication", "Purchasing", "CPG", "Hard Goods", "Cookware", "Cutlery", "Flatware"], "url": "https://www.linkedin.com/jobs/view/3978563625"}