{"jobTitle": "Quality Control Manager - Manufacturing", "company": {"name": "JSG (Johnson Service Group, Inc.)", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Engineering", "industry": "Staffing and Recruiting", "description": "JSG is hiring a Quality Control Manager - Manufacturing for our client in Corona, CA. Must have a BS degree to qualify.", "responsibilities": "Leads the quality and environmental management systems in the company. Assists in defining and documenting processes and creation of and compilation of monthly reports from all departments within the company for objectives or metrics reporting. Creates the communication system for customer requirements throughout the organization through active participation in customer assessments, performance evaluations, quality audits or surveys and completion of certification process requirements. Drive quality improvements to our production system. Serves as liaison with external customers and auditors on matters relating to the quality and environmental management systems. Effectively maintains, updates and coordinates required activities with responsible personnel on Ion system used for Document Control, Calibration, Training, Suppliers management, Nonconformance Reports (NCR), Customer Survey, Preventive Actions and Management modules. Total oversight over the maintenance of required records per applicable standards (ISO 9001, ISO/TS 16949 and/or ISO 14001) and closely works with other dept. or functions who are responsible for such records. Conducts as scheduled internal system, process and product audits based on ISO 9001, ISO/TS 16949 and ISO 14001 standards or coordinates with 2nd party auditors. This includes scheduling, documentation and issuance of audit results (summary and audit findings, if any) and conduct if required, follow-up for deficient areas or processes found. Completes and submits all statutory and regulatory requirements such as Hazardous Materials permit, Annual EPA ID Number Verification Questionnaire. Performs other activities or functions, as assigned. You will collaborate with or guide the activities of all 1st shift quality and production staff. You will report to and gain direction from the General Manager and operate with considerable independence. Experience leading teams to strive for quality compliance influencing machine operators. Experience growing small businesses by championing change and improvement. Deliver results; be data and metrics driven. Cooperate with teammates throughout the organization, influence others, and gain the support needed to make improvements and move in a positive direction.", "qualifications": {"required": "Must have a BS degree to qualify.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Johnson Service Group (JSG) is an Equal Opportunity Employer. JSG provides equal employment opportunities to all applicants and employees without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, marital status, protected veteran status, or any other characteristic protected by law.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978066292"}