{"jobTitle": "Talent Acquisition Coordinator", "company": {"name": "Panda Restaurant Group", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "industry": "Restaurants", "description": "The Talent Acquisition Coordinator position is responsible for providing administrative and recruiting support to the Field Recruiting team, including field recruiting activities, general administrative tasks, and preparation of correspondence and memos as needed. This position works with various levels of Operations management to assist them with recruiting needs, such as recruiting events, New Store Openings, and in-house projects.<br/><br/><strong>You’ll get a chance to:<br/><br/></strong><ul><li>Provide support for the Field Recruiting team with candidate sourcing, initial screening, and contact of applicants to determine qualification and interest level. </li><li>Refer appropriate candidates to recruiter or hiring team.</li><li>Provide support for Field HR Recruiting, including posting jobs on job boards, conducting background checks, scheduling interviews, and ensuring smooth operation of Field Recruiting processes. </li><li>Respond to basic inquiries from Operations management related to job posting and recruiting materials, and train associates on recruiting technology.</li><li>Interface and serve as a point of contact for setting up Open Houses for Operations Management from logistical event set-up, registration, confirmations, and advertisement. </li><li>Attend and participate in job fairs, community activities, and other public and departmental recruitment-related events.</li><li>Assist with identifying issues affecting field recruitment and implementing recruitment activities to continuously improve the process.</li><li>Oversee administration of Operations referral bonus program, reviewing requests, determining eligibility, gaining approval, and sending out the bonus check as needed. </li><li>Perform general administrative tasks such as data-entry for recruiting metrics, returning calls and/or emails, and generating standard weekly/monthly HR reports. </li><li>Support Field Recruiting on special projects as needed.<br/><br/><br/></li></ul><strong>Work Environment:<br/><br/></strong><ul><li>Office conditions; Travel 10% to 15% based on business need<br/><br/><br/></li></ul><strong>How we reward you:<br/><br/></strong><ul><li>Hybrid Work schedule</li><li>401K with company match</li><li>Yearly bonus opportunity*</li><li>Full medical, dental, and vision insurance *</li><li>On-site fitness center, biometric screen, and flu shot clinic</li><li>Discounts at Panda restaurants, theme parks, and gym memberships</li><li>Paid time off starting at 15 days with 7 federal holidays*</li><li>Continuous education assistance and scholarships*</li><li>Income protection including Disability, Life and AD&amp;D insurance*</li><li>Bereavement leave*</li><li>Benefits available for eligible permanent full time associates<br/><br/><br/></li></ul><strong>Your background and experience: <br/><br/></strong><ul><li>Bachelor’s degree or equivalent</li><li>Minimum one year of administrative or customer service experience required</li><li>Minimum one year of HR experience in sourcing candidates using a wide variety of job boards or recruitment, or other relevant experience preferred</li><li>Successful completion of initial and periodically required trainings.</li><li>Obtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position.<br/><br/><br/></li></ul><strong>Panda Strong since 1983<br/><br/></strong>Founded in Glendale, California, we are now the largest family-owned American Chinese Restaurant concept in America. With close to 2,000 locations globally, we continue our mission of delivering exceptional Asian dining experiences by building an organization where people are inspired to better their lives. Whether it’s impacting our team or the communities we work in, we’re proud to be an organization that embraces family values.<br/><br/><strong>You’re wanted here<br/><br/></strong>We value diversity in all forms and know the strength it brings. Workplace equality allows for creative ideas to blossom, diverse points of view to be heard, and improves overall happiness. We like the sound of that.<br/><br/><em>Panda Restaurant Group, Inc. is an Equal Opportunity Employer and prohibits discrimination and harassment on the basis of race, color, religion, sex, national origin, disability, age and any other basis protected by the laws which apply where we operate. Panda provides accommodations for disabilities and religious observance purposes as required by law.<br/><br/></em>", "jobFunction": "Human Resources", "postedDate": "2 weeks ago", "benefits": "Hybrid Work schedule, 401K with company match, Yearly bonus opportunity*, Full medical, dental, and vision insurance *, On-site fitness center, biometric screen, and flu shot clinic, Discounts at Panda restaurants, theme parks, and gym memberships, Paid time off starting at 15 days with 7 federal holidays*, Continuous education assistance and scholarships*, Income protection including Disability, Life and AD&amp;D insurance*, Bereavement leave*, Benefits available for eligible permanent full time associates", "qualifications": {"required": "Bachelor’s degree or equivalent, Minimum one year of administrative or customer service experience required, Minimum one year of HR experience in sourcing candidates using a wide variety of job boards or recruitment, or other relevant experience preferred, Successful completion of initial and periodically required trainings., Obtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position."}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3978521066"}