{"jobTitle": "Senior Technical Project Manager", "company": {"name": "Motivo", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Gardena, CA"}, "location": "Gardena, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$115,000 - $130,000", "currency": "USD"}, "jobFunction": "Project Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Motivo is looking for a passionate Senior Technical Project Manager with a strong technical background who enjoys being part of a tight-knit team and is looking to make an immediate impact. We work on cool, clean-sheet design projects from a variety of industries, in a fast-paced, innovative environment. Current projects include automotive, wearable electronics, robotics, aerospace, and clean energy, and we complete projects in weeks or months, not years. We are passionate about our work and strive for excellence within each project's unique constraints.\n\nTo be successful in this role you'd need to be comfortable owning your projects from beginning to end. This means developing \"new to Motivo\" clients through early project success, maintaining existing client relationships, contracting and budgeting, and guiding the technical team to the best solution. We need someone who's driven, detail-oriented, adaptable, and who can create buy-in across all stakeholders, both internally and externally. You'll need to be the voice of the customer to our technical team and vice-versa. We are always on the lookout for exceptional team leaders. If you are someone who is motivated, hands-on, and results-oriented with a passion for engineering, you're in the right place.", "responsibilities": "Experience and understanding of hardware product development, and integration of major engineering components into a cohesive product. i.e Mechanical engineering, Electrical engineering, software development, Industrial design. Ability to apply agile methodologies to both software and hardware development. Knowledge/Experience in embedded hardware/controls development a huge plus. Strong communication skills to clearly convey project needs and technical concepts to internal and external teams. Experience delivering \"the hard news\" to stakeholders (internal and external) and walking them through the next steps. Effective at managing technical risk, mitigation strategies, schedule, cost, and product performance balance. Experience with system-level rapid prototyping techniques and materials. Ability to thrive in the face of ambiguity - most of our projects have scope gaps. Identify prototype manufacturing vendors, and assist in vendor management. Strong ability to handle concurrent fast-paced projects with minimal direction. Experience with tightly integrated multidisciplinary teams in employer or academic setting (Solar Car, Formula SAE, etc).", "qualifications": {"required": "Minimum 2 years of engineering experience and 5 years of project management or product management experience. Ability to plan, manage and coordinate multidisciplinary engineering efforts. Past experience in a startup/small business/team environment. Excellent verbal and written communication skills, as well as interpersonal skills. Manage teams in a fast-paced/time-critical development environment. US Citizenship or Permanent Resident. Ability to travel as required (less than 25% - usually much less).", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "We're convinced that the team and projects are hands down the best part of working at Motivo, but we also have some pretty sweet benefits including company-wide profit sharing, high-quality insurance plans, 401k match, generous paid vacation time, a Monday-Thursday 4/10 work week and more!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978045693"}