{"jobTitle": "Business Optimization Sr Manager - Global Logistics", "company": {"name": "CS Recruiting", "industry": "Transportation, Logistics, Supply Chain and Storage and Truck Transportation", "size": "Not specified", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Competitive base salary", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage and Truck Transportation", "description": "Our client is a professional services firm that develops, implements and manages cost-reduction solutions for FORTUNE 1000 companies, law firms, private equity firms and private companies throughout North America. Their spend management, supplier management and procurement strategies have resulted in more than $7 billion in client savings. A Senior Manager of Business Optimization position is an individual with an experience in consulting to develop and negotiate innovative expense reduction solutions for large enterprise clients in the company’s Practice Groups. Ideal candidates have specific experience with cost optimization. This role will consult directly with CFOs and CIOs at some of the largest companies in North America and is responsible for managing expense reduction projects from initial assessment of the client’s existing product usage, pricing, vendor contracts and agreements all the way through expense reduction strategy development and vendor negotiations.", "responsibilities": "Collect, analyze, and present data that helps clients decide how best to reduce their expenses. Review organizational processes/systems and uncover expense reduction opportunities for clients by applying your industry expertise, business acumen, and analytical skill. Negotiate, or consult with clients on how to negotiate, best-in-class pricing and business terms with vendors on new contracts and licensing agreements. Monitor, evaluate, and present on industry trends, vendor contract terms, and pricing changes. Manage project timelines/milestones and action items. Develop and follow defined Practice Group and Company processes and procedures. Demonstrate creative thinking and ability to resolve complex and sensitive client issues. Maintain healthy and productive relationships with clients, colleagues, and vendor executives. Present or assist in the presentation of savings and new project opportunities to clients. Provide creditability to sales process including developing the value propositions, attending strategic sales calls, and conducting ongoing sales training. Prepare effective analysis and documentation regarding savings opportunities available to existing and prospective clients.", "qualifications": {"required": "BA/BS Degree required with a minimum 7+ years of relevant experience with consulting and/or price negotiation. Demonstrated experience and knowledge of cost optimization. Experience working with manufacturers and/or resellers. Proficiency with Microsoft Office suite of products. Expert ability with the analysis of data in MS Excel. Prior consulting experience is preferred. Excellent communication and written skills with attention to details. Exceptional team player; work well with cross-functional teams & with diverse levels within the organization. Self-motivated, disciplined, and highly organized; able to prioritize in a fast-paced environment. Flexible and willing to accept a change in priorities as necessary. Sense of urgency and timely deliveries.", "preferred": ""}, "skills": ["Consulting", "Cost Optimization", "Data Analysis", "Vendor Negotiation", "Project Management", "Communication", "Microsoft Office", "Excel"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978781158"}