{"jobTitle": "Fleet Manager - Hybrid", "company": {"name": "XPO", "industry": "Transportation, Logistics, Supply Chain and Storage", "size": "Not specified", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$66,560 – 77,366", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "What you’ll need to succeed as a Fleet Manager at XPO\n\nMinimum qualifications:\n- Bachelor's degree or equivalent related work or military experience\n- 3 years of related work experience, including leadership experience in transportation or a related field\n- Strong working knowledge of freight movement systems, methodologies and procedures\n- Able to work 0500-1630 Thursday-Sunday with flexibility in start and end time\n\nPreferred qualifications:\n- 5 years of relevant experience or master's degree in supply chain, logistics or business administration\n- Available to work a variety of shifts, including days, evenings, nights, and weekends\n- Working knowledge of the less-than-truckload (LTL) industry\n- Solid analytical skills\n- Experience with dispatching drivers, fleets or service center supervision\n- Excellent interpersonal and communication skills with the ability to motivate and influence team members\n\nAbout the Fleet Manager job\n\nPay, benefits and more:\n- Competitive compensation package\n- Full health insurance benefits are available on day one\n- Life and disability insurance\n- Earn up to 15 days of PTO over your first year\n- 10 paid company holidays\n- 401(k) option with company match\n- Education assistance\n- Opportunity to participate in a company incentive plan\n\nWhat you’ll do on a typical day:\n- Set work schedules and efficient routes for road flex teams (RFTs) while monitoring hours of service and other requirements, including coordinating alternative coverage plans for PTO, bereavement and absences\n- Act as a point of contact and escalation for RFTs, provide dispatch information, route conditions and detour guidance\n- Communicate with service center leadership regarding RFT dispatch and arrival helping to ensure that loads are ready to minimize downtime\n- Prepare reports and other documents for management regarding schedules and maintenance\n- Act as the primary point of contact for delays and accidents involving safety and fueling\n- Act as the primary point of contact for service center leadership, maintenance, and HR as appropriate to resolve issues\n- Support linehaul network operations, as needed\n- Ensure all DOT, compliance and safety requirements are adhered to and properly reported\n- Establish relationships with RFTs to maintain an inclusive culture and escalate any issues to management or HR for guidance/resolution", "responsibilities": "Set work schedules and efficient routes for road flex teams (RFTs) while monitoring hours of service and other requirements, including coordinating alternative coverage plans for PTO, bereavement and absences. Act as a point of contact and escalation for RFTs, provide dispatch information, route conditions and detour guidance. Communicate with service center leadership regarding RFT dispatch and arrival helping to ensure that loads are ready to minimize downtime. Prepare reports and other documents for management regarding schedules and maintenance. Act as the primary point of contact for delays and accidents involving safety and fueling. Act as the primary point of contact for service center leadership, maintenance, and HR as appropriate to resolve issues. Support linehaul network operations, as needed. Ensure all DOT, compliance and safety requirements are adhered to and properly reported. Establish relationships with RFTs to maintain an inclusive culture and escalate any issues to management or HR for guidance/resolution.", "qualifications": {"required": "Bachelor's degree or equivalent related work or military experience, 3 years of related work experience, including leadership experience in transportation or a related field, Strong working knowledge of freight movement systems, methodologies and procedures, Able to work 0500-1630 Thursday-Sunday with flexibility in start and end time", "preferred": "5 years of relevant experience or master's degree in supply chain, logistics or business administration, Available to work a variety of shifts, including days, evenings, nights, and weekends, Working knowledge of the less-than-truckload (LTL) industry, Solid analytical skills, Experience with dispatching drivers, fleets or service center supervision, Excellent interpersonal and communication skills with the ability to motivate and influence team members"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive compensation package, Full health insurance benefits are available on day one, Life and disability insurance, Earn up to 15 days of PTO over your first year, 10 paid company holidays, 401(k) option with company match, Education assistance, Opportunity to participate in a company incentive plan", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978221076"}