{"jobTitle": "Production Coordinator", "company": {"name": "Arrowhead Products", "industry": "Aviation & Aerospace", "size": "Not specified", "location": "Los Alamitos, CA"}, "location": "Los Alamitos, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Aviation & Aerospace", "description": "Assists with planning and manufacturing, organizes and controls the flow of production hardware to support upper level demands and customer order requirements. Monitor and control product line MRP schedules that effectively support both customer demands and internal requirements. Accommodate and plan to customer “need” early requirements if detailed investigation yields it to be achievable.", "responsibilities": "Generate and respond to the various MRP/MPS exception based reporting systems in a timely manner to insure due dates and priorities are properly defined for the shop floor or procurement staff. Utilize various tools available to review and coordinate efforts needed to support required start and completion dates of components, subs and top assemblies. Alert upper level supervision when an unresolved capacity/material constraint is/will affect the company’s ability to meet a customer’s scheduled delivery requirement. Validate shop order packet data for accuracy and completion. Correct as needed before submitting to the shop floor. Notify interfacing departments to effect corrections to system data values that have resulted in invalid outputs, particularly those affecting shop load and scheduling. Respond and coordinate all activities associated with part drawing releases and subsequent revisions related thereto. Review planning- SO traveler, making sure all required items for travels are released with proper lot number for traceability. Prepare any special labels for shipping, per customer requirements (space item have special requirements). Prepare packing slips with all special space requirement ( i.e. serial no., P.O. number, critical path, X-ray# ). Follow up with manufacturing to ensure work orders are completed as scheduled. Comply with prescribed operating practices including those associated with QCI, MEP and SOP processes and procedures. Participate in production meetings, conferences, seminars and presentations as directed by immediate or department head supervision. Excellent communication skills in a cross functional workplace. Ability to effectively organize several distinct manufacturing functions, delegate appropriately, and review the work and performance of all areas in a manner conducive to efficient performance and supportive of the company culture. This job description is not all inclusive of all duties. Other duties may be assigned.", "qualifications": {"required": "High School Graduate, 6 months+ work related experience in Production/Inventory Control field or some experience as a PC material planner/scheduler or expeditor, 6 months working background within a manufacturing type environment, including some experience with an online computerized MRP or equivalent scheduling system.", "preferred": "APICS training, seminars and/or college courses. Vocational or national certification preferred but not required. Professional related seminars, symposiums or accredited logistics management courses."}, "skills": ["Basic analytical and sound decision making skills", "Able to work independently with minimal direct supervision", "Experience with computerized systems – BPCS or equivalent MRP II software, and job related Microsoft Applications", "Knowledge/exposure to various types of manufacturing processes and controls", "Excellent written and verbal communication skills"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3978656914"}