{"jobTitle": "Director, ICU", "company": {"name": "AHMC HealthCare", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "The Director, ICU is accountable for the strategic planning, direction, organization and control of the inpatient Critical Care Services Department. This position is responsible for the direction of clinical delivery of care and meeting fiscal goals. The position is accountable to the County, State and Federal agencies as well as Joint Commission for maintaining compliance with all applicable laws, regulations and standards and for providing quality patient outcomes.<br/><br/>The Director, ICU is responsible for operational oversight and direction of the Critical Care Services Department of AHMC-ARMC through program development, operational improvement, financial performance and organizational change.<br/><br/>Integrate Critical Care Services department’s services with AHMC-ARMC’s primary functions.<br/><br/>Coordinate and integrate services within Critical Care Services and with other departments.<br/><br/>Develop and implement policies and procedures that guide and support the provision of services.<br/><br/>Recommend a sufficient number of qualified and competent individuals to provide care.<br/><br/>Determine the qualifications and competence of staff and who are not licensed practitioners.<br/><br/>Continuously assess and improve performance of the Critical Care Services Department.<br/><br/>Maintain appropriate quality control programs.<br/><br/>Provide for orientation, in-service training, and continuing education of all staff in the Critical Care Services department.<br/><br/>Participate in selecting outside sources for needed services.<br/><br/>Licensed RN with minimum of 5 years progressive management responsibility or related administrative experience.<br/><br/>BSN required; Master’s Degree in Nursing or Business preferred.<br/><br/>Demonstrated leadership experience including personnel management, cost reduction, productivity enhancement, and interdisciplinary practice with emphasis on quality/performance improvement within designated department responsibilities.<br/><br/>Experience in working and problem solving with physicians, administration, and hospital staff.<br/><br/>Clinical background with sound clinical assessment skills, along with the ability to make independent decisions regarding patient care.<br/><br/>Highly developed sense of initiative and flexibility, along with good judgment and analytical skills.<br/><br/>A management style that is open, team-oriented, collaborative, and based on trust and personal integrity.<br/><br/>Effective motivational, written, and verbal communication skills.<br/><br/>Experience with technology and ability to participate actively in the selection and purchase of capital equipment.<br/><br/>Comprehensive knowledge of regulatory requirements including Title 22 and Joint Commission.", "postedDate": "1 month ago", "experienceLevel": "Director", "url": "https://www.linkedin.com/jobs/view/3978792005"}