{"jobTitle": "Director, Accounts - ULTA", "company": {"name": "Too Faced Cosmetics", "industry": "Personal Care Product Manufacturing", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Standard", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "120,550.00/yr - 208,200.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Personal Care Product Manufacturing", "description": "<strong>Summary<br/><br/></strong>Responsible for the leadership, development, and sales performance at ULTA. Will craft annual retailer strategy and sales plan to align with brand strategy. Will make strategic decisions based on retailer performance. Director will develop &amp; pursue opportunities via advertising, corporate events, marketing, merchandising, inventory &amp; sales analysis to ultimately increase brand awareness &amp; build.<br/><br/><strong>Areas Of Responsibility<br/><br/></strong><ul><li> Overall Strategy Development and Execution</li><li> Drive consumer and brand growth strategically and operationally.</li><li> Create Account specific strategy for brand to include all retailer brick and mortar and retailer.com.</li><li> Ensure alignment with corporate, NA and Brand strategies. Top notch strategy execution and integrated approach across all key functional areas for goal attainment.</li><li> Lead market development with focus on synthesizing and articulating needs of Account in product development, education, creative, marketing and merchandising.</li><li> Drive the 360 planning of new launches with a focus on digital/social/mobile.</li><li> Develop retail sales objectives, plans, and programs.</li><li> Spend time in the field focusing on the understanding of the competitive set and channel opportunities.</li><li> Develop and strengthen the retailer relationship.</li><li> Events &amp; Marketing</li><li> Work with buyer, internal team, and field to plan &amp; execute seasonal major events in A Level Markets.</li><li> Work with buyer and visual manager to review seasonal in-store visual opportunities and ensure maximum exposure.</li><li> Work with buyer on potential corporate &amp; in-store marketing opportunities.</li><li> Work with Merchant &amp; Cross functional ULTA teams to pursue all advertising/marketing opportunities.</li><li> Merchandising</li><li> Responsible for initiating all gondola updates.</li><li> Responsible for recommending and reviewing product assortment &amp; sales to determine what gondola product changes will most positively impact sales.</li><li> Work with VM to ensure all updates are executed in a timely manner and correspond with all advertised items.</li><li> Sales Analysis</li><li> Support the development of all sales plans, by store, by month.</li><li> Analyze sales, product and mix trend to determine action.</li><li> General business analysis daily.</li><li> Work with lead Planner to ensure strategy execution.</li><li> DotCom</li><li> Develop dotcom business by implementing online programs and concepts.</li><li> Pursue opportunities to ensure maximum ROI.</li><li> P&amp;L Management</li><li> Manage Account OPEX spend and partner with planner on monthly Net sales estimates.</li><li> Submit accurate monthly estimates on Retail and expenses.</li><li> Ensure strong ROI on key business levers.</li><li> Partner with the Planner to review retailer stock to sales ratio in an effort to maximize retail and net sales.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Qualifications:<br/><br/></strong><ul><li> 8+ years relevant work experience</li><li> Proven, successful sales track record in cosmetic industry</li><li> ULTA experience a plus</li><li> Self-motivated and flexible; able to adapt quickly to change</li><li> Able to build collaborative relationships and work cross functionally with sales, marketing, retail partners, demand planning and supply chain</li><li> Excellent analytical skills</li><li> Must be proficient at Excel and Power Point</li><li> Strong presentation skills</li><li> Handle multiple projects simultaneously<br/><br/></li></ul>The anticipated base salary range for this position is $120,550 - $208,200. Exact salary depends on several factors such as experience, skills, education, and budget. Salary range may vary based on geographic location. In addition to base salary, this position is eligible for participation in a highly competitive bonus program with possibility for overachievement based on performance and company results as well as participation in the share incentive plan.<br/><br/>In addition, The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life, and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.<br/><br/><strong>Job:</strong> Strategy / Business Development<br/><br/><strong>Primary Location:</strong> Americas-US-CA-Irvine<br/><br/><strong>Job Type:</strong> Standard<br/><br/><strong>Schedule:</strong> Full-time<br/><br/><strong>Shift:</strong> 1st (Day) Shift<br/><br/><strong>Job Number:</strong> 249215<br/><br/>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. It is Company's policy not to discriminate against any employee or applicant for employment on the basis of race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth and related medical conditions), gender identity or gender expression (including transgender status), sexual orientation, marital status, military service and veteran status, physical or mental disability, protected medical condition as defined by applicable state or local law, genetic information, or any other characteristic protected by applicable federal, state, or local laws and ordinances. The Company will endeavor to provide a reasonable accommodation consistent with the law to otherwise qualified employees and prospective employees with a disability and to employees and prospective employees with needs related to their religious observance or practices. Should you wish to apply for this position or any other position with the Company and you believe you require assistance to complete an application or participate in an interview, please contact USApplicantAccommodations@Estee.com.", "responsibilities": "Responsible for the leadership, development, and sales performance at ULTA. Will craft annual retailer strategy and sales plan to align with brand strategy. Will make strategic decisions based on retailer performance. Director will develop &amp; pursue opportunities via advertising, corporate events, marketing, merchandising, inventory &amp; sales analysis to ultimately increase brand awareness &amp; build.", "qualifications": {"required": "8+ years relevant work experience, Proven, successful sales track record in cosmetic industry, ULTA experience a plus, Self-motivated and flexible; able to adapt quickly to change, Able to build collaborative relationships and work cross functionally with sales, marketing, retail partners, demand planning and supply chain, Excellent analytical skills, Must be proficient at Excel and Power Point, Strong presentation skills, Handle multiple projects simultaneously", "preferred": ""}, "skills": ["Sales", "Marketing", "Retail", "Demand Planning", "Supply Chain", "Analytical Skills", "Excel", "PowerPoint", "Presentation Skills"], "postedDate": "1 month ago", "benefits": "In addition to base salary, this position is eligible for participation in a highly competitive bonus program with possibility for overachievement based on performance and company results as well as participation in the share incentive plan.<br/><br/>In addition, The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life, and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3978095449"}