{"jobTitle": "Operations Coordinator", "company": {"name": "AIDS Healthcare Foundation", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care, Pharmaceutical Manufacturing, and Non-profit Organizations", "description": "<strong>Who We Are<br/><br/></strong><strong>Who we are<br/><br/></strong><strong>AMAZING INDIVIDUALS WORKING FOR POSITIVE PEOPLE at AIDS Healthcare Foundation!<br/><br/></strong>Does the idea of doing something that really makes a difference in people’s lives while being well-compensated intrigue you? Are you looking to work for an organization that encourages growth and success from each and every one of its employees?<br/><br/><strong>If so, AIDS Healthcare Foundation is the place for you!<br/><br/></strong>Founded in 1987, AIDS Healthcare Foundation is the largest specialized provider of HIV/AIDS medical care in the nation. Our mission is to provide cutting edge medicine and advocacy, regardless of ability to pay. Through our healthcare centers, pharmacies, health plan, research and other activities, AHF provides access to the latest HIV treatments for all who need them.<br/><br/><strong>AHF’s Core Values Are To Be<br/><br/></strong><ul><li> Patient-Centered</li><li> Value Employees</li><li> Respect for Diversity</li><li> Nimble</li><li> Fight for What’s Right<br/><br/></li></ul><strong>STILL INTERESTED? Please continue!<br/><br/></strong>We offer a competitive salary including quarterly bonuses, paid v acation, company holidays &amp; 5 personal holidays, sick pay, Student Loan Forgiveness, 401K Matching, Life Insurance, etc.<br/><br/><strong> YOUR CONTRIBUTION TO OUR SUCCESS! <br/><br/></strong><strong> This is a Driving position: The Candidate must be comfortable towing a small trailor <br/><br/></strong>The Operations Coordinator contributes to AHF by description.<br/><br/>The Operations Coordinator enhances the reputation of AHF by description<br/><br/>You will be a passionate advocate for our top initiatives.<br/><br/>To be successful as the Operations Coordinator, it is crucial to ensure that the AHF Core Values and Mission stay top of mind with all that you do. At AHF, we are nimble and able to adapt in a dynamic environment to assist in providing the best experience for our clients and workplace for our employees.<br/><br/>AHF has a collaborative organizational structure where staff are accountable to multiple leaders.<br/><br/>The Operations Coordinator will work as a part of a close-knit team.<br/><br/><strong> AHF Commitment <br/><br/></strong>We at AIDS Healthcare Foundation believe that each individual is entitled to equal employment opportunities without regard to race, color, creed, gender, sexual orientation, gender identity, marital status, national origin, age, veteran status or disability. The right of equal employment opportunity extends to recruiting, hiring selection, transfer, promotion, training and all other conditions of employment. AHF will consider qualified applicants with criminal histories in a manner consistent with the requirements of the ordinance.", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3978033066"}