{"jobTitle": "Vice President of Sales", "company": {"name": "ARCHIMED", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Company Overview:</strong> Regenerative cosmeceutical brand with thousands of active accounts in North America, growing at 25% Y/Y, with 40+ direct reps. Our range is exclusive to medical aesthetic practices and includes both in-office and homecare formulations. 10+ years in the industry and recently backed by private equity, the company has a strong innovation pipeline and multiple clinical trials ongoing.<br/><br/><strong>Position Overview:</strong> We are seeking an experienced and dynamic Vice President of Sales to lead our sales team. The ideal candidate will have sales management experience in physician-dispensed skincare or injectables and possess strong relationships within the industry. This role requires a leader with high integrity, the ability to inspire loyalty, and the passion to achieve extraordinary results. The role is responsible to deliver the largest category of revenue for the company and reports directly to the CEO. The VP, Sales attends monthly board meetings and presents on team health, sales metrics, and strategic initiatives.<br/><br/><strong>Support: </strong>Direct reports in place include National Sales Director &amp; National Education Manager.Ambitiousmarketing department closely in-tune with sales needs, providing promotional support and data analytics. CRM with active development team and business intelligence tools.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Develop and execute a strategic sales plan to achieve company sales targets</li><li>Lead, mentor, and manage a high-performing sales team, fostering a culture of excellence and accountability</li><li>Build and maintain strong relationships with key industry contacts, including physicians, high-value accounts, and top-performing sales representatives</li><li>Identify new business opportunities and develop strategies to maximize revenue growth</li><li>Collaborate with the marketing team to create effective sales and promotional materials</li><li>Monitor market trends, competitor activities, and customer feedback to inform sales strategies</li><li>Prepare and present sales reports, forecasts, and performance metrics to senior management<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>3+ years of management experience in physician-dispensed skincare or injectables</li><li>Proven success in building and maintaining relationships with physicians and high-value account contacts</li><li>Established network of talented sales representatives</li><li>Exceptional leadership and team management skills</li><li>High degree of integrity and the ability to inspire trust and loyalty</li><li>Excellent communication, negotiation, and presentation skills</li><li>Strong analytical and problem-solving abilities</li><li>Ability to thrive in a fast-paced, results-driven environment<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>PTO</li><li>Healthcare </li><li>LTIP</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3978494532"}