{"jobTitle": "Program Manager II, Ring Insights", "company": {"name": "Ring", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management, Management, and Product Management", "industry": "Computers and Electronics Manufacturing", "description": "Are you a passionate, self-starting Program Manager interested in facilitating Alpha, Beta, and Delta testing for products designed to reduce crime in neighborhoods? Ring is looking for a Program Manager that is customer obsessed, has a bias for action, and wants to learn and be curious. You will join the Ring Insights Team in supporting our product team in managing highly successful Alpha, Beta, and Delta tests that bring new products to market.<br/><br/>Key job responsibilities<br/><br/><ul><li> Managing multiple (cross-functional or technical and non-technical) stakeholder groups each week.</li><li> Build weekly detailed reports around feedback, survey results, and metrics captured during testing.</li><li> Ability to take action and ownership of situations with minimal guidance.</li><li> Monitor backend metrics for programs assigned.</li><li> Correlate backend metrics with tester feedback to identify trends.</li><li> Manage multiple project/programs simultaneously.</li><li> Create test plans for Alpha, Beta, and Delta Programs.</li><li> Create test cases with the Product Managers for the users to go through during the testing phase.</li><li> Create end of week reports for stakeholder for all assigned programs.</li><li> Attend weekly business reviews to review programs assigned with leadership.</li><li> Work with the logistics team to ship product for assigned programs.<br/><br/></li></ul><strong>About The Team<br/><br/></strong>The Ring Insights organization, founded in 2017 is a growing group of customer obsessed individuals. Our work and workstreams center around identifying customer needs and advocating for them. We do this through Trials (Alpha / Beta Testing), UX Research, User Acceptance Testing. Our team functions are built to assess a product or experience with a 360 degree perspective, ensuring we are meeting our customers needs through leveraging research and data.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent</li><li> PMP certificate</li><li> Experience defining and executing program requirements</li><li> Experience using data and metrics to determine and drive improvements</li><li> Experience working cross functionally with tech and non-tech teams</li><li> 3+ years of program or project management experience</li><li> 3+ years of defining and implementing process improvement initiatives using data and metrics experience</li><li> Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> 3+ years of driving end to end delivery, and communicating results to senior leadership experience</li><li> 3+ years of driving process improvements experience</li><li> Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization</li><li> Experience building processes, project management, and schedules<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,800/year in our lowest geographic market up to $142,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2701680", "responsibilities": "Managing multiple (cross-functional or technical and non-technical) stakeholder groups each week.\nBuild weekly detailed reports around feedback, survey results, and metrics captured during testing.\nAbility to take action and ownership of situations with minimal guidance.\nMonitor backend metrics for programs assigned.\nCorrelate backend metrics with tester feedback to identify trends.\nManage multiple project/programs simultaneously.\nCreate test plans for Alpha, Beta, and Delta Programs.\nCreate test cases with the Product Managers for the users to go through during the testing phase.\nCreate end of week reports for stakeholder for all assigned programs.\nAttend weekly business reviews to review programs assigned with leadership.\nWork with the logistics team to ship product for assigned programs.", "qualifications": {"required": "Bachelor's degree in computer science, engineering, analytics, mathematics, statistics, IT or equivalent\nPMP certificate\nExperience defining and executing program requirements\nExperience using data and metrics to determine and drive improvements\nExperience working cross functionally with tech and non-tech teams\n3+ years of program or project management experience\n3+ years of defining and implementing process improvement initiatives using data and metrics experience\nKnowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL", "preferred": "3+ years of driving end to end delivery, and communicating results to senior leadership experience\n3+ years of driving process improvements experience\nExperience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\nExperience building processes, project management, and schedules"}, "skills": ["Program Management", "Project Management", "Stakeholder Management", "Data Analysis", "Metrics", "Process Improvement", "Excel", "SQL"], "postedDate": "2 weeks ago", "salary": {"amount": "66,800.00/year - 142,800.00/year", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3978421072"}