{"jobTitle": "Assistant, Brand Integration", "company": {"name": "Sunshine Sachs Morgan & Lylis", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "salary": {"amount": "40,000 - 40,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Public Relations and Communications Services", "description": "Sunshine Sachs Morgan & Lylis is proud to represent clients across many industries including entertainment, social good, tech and lifestyle and we tell their stories through a variety of mediums. We know that even during the toughest times, our responsibility to our clients and each other can bring meaningful and long-lasting impact for those affected the most. We’re proud of each and every campaign we execute, but you may be wondering why we don’t have more than a landing page as our website. While many of our clients are household names (you know them, we’re sure of it), our digital footprint is purposefully small. We fly under the radar and we like it that way.<br/><br/>If you are fired up and ready to do good, join us!<br/><br/>We have an immediate opening for a <strong>PR Assistant</strong> on our Brand Integration team.<br/><br/>What does this mean? You have a strong interest and clear understanding of what PR and Brand Integration are and, most importantly, you love this work! This is a great role for someone who has a wide range of interests and just really wants to DO. You’ve had a couple of internships that solidified that this is where you want to be. You have all this energy, are building amazing relationships but just want more. Maybe consumer? Perhaps events? Social good? Tech and startups? If you want to take it on, show us you can, and we’ll encourage it!<br/><br/>Assistants are the essential foundation of many teams and account-critical administrative functions. We teach our assistants the skills they need to grow, however, from Day 1, we expect them to exhibit behaviors that define the most successful communications professionals.<br/><br/>Our candidate is curious, eager and open to trying new things, eager to learnall aspects of integrated communications (from media relations to social media, creative, brand integration, and talent integration). Even though this may be their first professional job, they demonstrate emotional maturity in their interpersonal interactions. They are collaborative and inclusive of others. They are often the first point of contact for special guests, clients and visitors at the company (when we are back in the office!) and, as such, they are a clear communicator, professional and courteous.<br/><br/><strong>Responsibilities Include<br/><br/></strong><ul><li>Willingness and an interest to soak it all in; learn the ins and outs of integrated communications (talent/influencer integration, media relations, social media, creative and brand integration) – with a special interest in strategic partnerships, sponsorships, events and/or cause marketing.</li><li>Creating and maintaining lists! Lots of lists! Specifically, lists of events, contacts at brands, studio and network upcoming slates, sponsorship and film/TV integration opportunities. </li><li>Scheduling and providing logistical support for client meetings and events.</li><li>Supporting client account teams as needed.</li><li>Monitoring news cycles and flagging latest “pop culture moments”, competitor news, for clients.</li><li>Communicating effectively with senior staff on status of requested tasks and projects.</li><li>Occasionally attending and supporting the execution of client events.</li><li>Supporting administration of accounts including developing agendas, meeting recaps, activity reports, client status reports, budget trackers, industry trend reports, etc.</li><li>Providing internal support for the brand integration team including: scheduling for the head of the department, meeting recaps from team meetings, and helping compile the monthly internal brand integration newsletter. </li><li>Maintaining our brand integration database by keeping contact information up to date and creating new entries for contacts made across the team. <br/><br/></li></ul><strong>You Should Apply If<br/><br/></strong><ul><li>You have 1 year of experience in this industry (communications, entertainment, politics, public relations, etc.) Internships count! </li><li>You are eager and open to learning more about brand integration (partnerships, sponsorships, etc.) as well as all other aspects of integrated communications (media relations, social media, creative, talent integration)</li><li>You are a strong writer – persuasive, concise, creative, and quick!</li><li>You are eager to network and build connections in the media and marketing industry </li><li>You are a strategic thinker, bring new ideas to the table, and love a good brainstorm.</li><li>You have strong decision-making abilities and accountability; this is an important role, own it!</li><li>You have an innate curiosity and an entrepreneurial spirit.</li><li>You are incredibly organized and able to excel at managing multiple projects simultaneously.</li><li>You’re willing to work select evenings/weekends </li><li>You enjoy overdelivering rather than meeting expectations and take genuine pride in being part of something good.<br/><br/></li></ul>", "responsibilities": "Assistants are the essential foundation of many teams and account-critical administrative functions. We teach our assistants the skills they need to grow, however, from Day 1, we expect them to exhibit behaviors that define the most successful communications professionals.<br/><br/>Our candidate is curious, eager and open to trying new things, eager to learnall aspects of integrated communications (from media relations to social media, creative, brand integration, and talent integration). Even though this may be their first professional job, they demonstrate emotional maturity in their interpersonal interactions. They are collaborative and inclusive of others. They are often the first point of contact for special guests, clients and visitors at the company (when we are back in the office!) and, as such, they are a clear communicator, professional and courteous.<br/><br/><strong>Responsibilities Include<br/><br/></strong><ul><li>Willingness and an interest to soak it all in; learn the ins and outs of integrated communications (talent/influencer integration, media relations, social media, creative and brand integration) – with a special interest in strategic partnerships, sponsorships, events and/or cause marketing.</li><li>Creating and maintaining lists! Lots of lists! Specifically, lists of events, contacts at brands, studio and network upcoming slates, sponsorship and film/TV integration opportunities. </li><li>Scheduling and providing logistical support for client meetings and events.</li><li>Supporting client account teams as needed.</li><li>Monitoring news cycles and flagging latest “pop culture moments”, competitor news, for clients.</li><li>Communicating effectively with senior staff on status of requested tasks and projects.</li><li>Occasionally attending and supporting the execution of client events.</li><li>Supporting administration of accounts including developing agendas, meeting recaps, activity reports, client status reports, budget trackers, industry trend reports, etc.</li><li>Providing internal support for the brand integration team including: scheduling for the head of the department, meeting recaps from team meetings, and helping compile the monthly internal brand integration newsletter. </li><li>Maintaining our brand integration database by keeping contact information up to date and creating new entries for contacts made across the team. <br/><br/></li></ul>", "qualifications": {"required": "You have 1 year of experience in this industry (communications, entertainment, politics, public relations, etc.) Internships count! <br/>You are eager and open to learning more about brand integration (partnerships, sponsorships, etc.) as well as all other aspects of integrated communications (media relations, social media, creative, talent integration)<br/>You are a strong writer – persuasive, concise, creative, and quick!<br/>You are eager to network and build connections in the media and marketing industry <br/>You are a strategic thinker, bring new ideas to the table, and love a good brainstorm.<br/>You have strong decision-making abilities and accountability; this is an important role, own it!<br/>You have an innate curiosity and an entrepreneurial spirit.<br/>You are incredibly organized and able to excel at managing multiple projects simultaneously.<br/>You’re willing to work select evenings/weekends <br/>You enjoy overdelivering rather than meeting expectations and take genuine pride in being part of something good.<br/><br/>", "preferred": ""}, "skills": ["PR", "Brand Integration", "Strategic Partnerships", "Sponsorships", "Events", "Cause Marketing", "Media Relations", "Social Media", "Creative", "Talent Integration", "Writing", "Networking", "Brainstorming", "Decision Making", "Accountability", "Organization", "Project Management"], "postedDate": "1 month ago", "benefits": "We go well beyond the benefits that you’re looking for like medical, dental, and vision plans, 401(k) with matching, annual merit-based bonuses, PTO, fertility, FSA for medical, childcare, and commuter expenses. Sunshine Sachs Morgan & Lylis offers those benefits and many perks including, a flexible work schedule, Work from Anywhere program, Summer Fridays, Wellness Days, and a 4-week sabbatical or trip to celebrate select anniversaries. We love to socialize so, we have collaborative workspaces, some offices even have rooftops, celebrations, networking opportunities, and community volunteering. We frequently mark opportunities to listen, learn and act throughout the year (Juneteenth, Election Day, International Women’s Day, etc.).", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3978677176"}