{"jobTitle": "Executive Director of External Affairs and University Relations", "company": {"name": "California State University, Los Angeles", "industry": "Higher Education", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$14,166.00/yr - $15,449.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Higher Education", "description": "Job No: 541402; 07/18/2024\n\nCalifornia State University, Los Angeles, invites applications for the above Administrator II position.\n\nThe University: California State University, Los Angeles (Cal State LA) is one of 23 campuses within the California State University system. The University is the premier comprehensive public university in the heart of Los Angeles. We offer nationally recognized programs and our faculty have a strong commitment to scholarship, research, creative pursuits, and service.\n\nAs a federally recognized Hispanic-serving (HSI) and Asian-American, Native American, and Pacific Islander-serving institution (AANAPISI), Cal State LA recognizes the transformative power of education and embraces its duty to identify and serve the needs of all of its students. The University is committed to creating a community in which a diverse population of students, faculty, and staff can thrive.\n\nThe Position: Under the Office of the President and reporting to the Chief of Staff, the Executive Director of External Affairs and University Relations (Executive Director) is responsible for developing, implementing, and advising on strategic internal and external stakeholder cultivation, and advocacy to Cal State LA’s University President, Chief of Staff, and members of the cabinet and leadership team. The Executive Director will advocate to develop strong relationships between Cal State LA and its many audiences. It does so by communicating the impact, importance and relevance of the CSU and Cal State LA as a state and national leader in higher education. The Executive Director will implement initiatives that continuously enhance and improve the mission of the California State University, Los Angeles, with external constituents and stakeholders. The responsibilities include a multifaceted unit that grows, cultivates, and stewards effective relationships and partnerships with external organizations, elected officials, alumni, business, industry, governmental, and nongovernmental organizations to enhance the visibility and prominence of the University and to advance the systems strategic interest and reputation on a local, statewide, national, and international level. The Executive Director will collaborate closely with the President, Chief of Staff, and campus and systemwide leaders by facilitating effective partnerships among academic divisions, student success programs/initiatives, and administrative units. This will include cultivating relationships with industry leaders, community leaders, and government and non-governmental organizations through innovative programming, engaged learning opportunities, career pathways, and strategic partnerships. The Executive Director is responsible for devising, managing, overseeing, and pursuing engagement strategies that lead to effective, collaborative, and long-term partnerships that support the mission of Cal State LA and augment the California State University system’s reach into targeted communities in support of targeted initiatives. The Executive Director of External Affairs and University Relations will provide lead oversight over the following functional areas: External Relations; Government Relations (local, state and federal); Community Relations and Civic Engagement; Tribal Relations; Industry Workforce Partnerships and Alliances; Educational Partnerships and Programs; Government Partnerships and Programs; and the Pat Brown Institute.\n\nRequired Qualifications & Experience: Bachelor’s degree or equivalent from an accredited four-year college or university. Demonstrated experience in developing, planning, and executing special projects and programs related to community and government relations. Knowledge and understanding of political institutions and organizations at the local and state government. Demonstrated skills in advancing organizational goals and relationships with internal and external constituencies. Demonstrate advanced analytical and conceptual skills for use in advocacy programs, government relations, issues management, and managerial support. Excellent writing skills and strong public speaking skills to make presentations to individuals or groups. Lead varying initiatives through a collaborative, service-oriented and communicative approach. Represent the University at large with External Affairs, Government and External Relations, at community meetings, neighborhood councils, hearings, and external events related to university programs, policies, priorities, and mission, and will recommend and coordinate the implementation of administrative policies to conduct the objectives of the university and department more effectively and efficiently. Assist the university and departments in making local government and community connections, and identifying opportunities for partnerships, grants, and funding opportunities. Maintain positive working relationships and open communication channels with on-campus partners across different units. Responsible for developing campus expertise and knowledge on departments that will help promote advocacy efforts and serve as a resource to those departments in communicating governmental-related and policy issues. Develop and execute community outreach programs, events, and initiatives to inform and increase support among government officials, strengthen town-gown relations, and deepen the university's community engagement efforts. Research and provide information to elected officials and community leaders on Cal State LA’s contributions to the community and areas of interest. Will support advocacy efforts, including annual advocacy visits to Sacramento and Washington, D.C. when needed. Assist with the development of the legislative request and documentation, including literature appropriate for supporting legislative requests. Assist campus departments and colleagues with external stakeholder engagement. Draft correspondence to elected officials and external stakeholders. Gather data and prepare policy briefs and reports in response to inquiries from internal and external stakeholders. Ability to establish credibility and cultivate productive relationships across organizations. Ability to communicate with constituents in a professional and respectful manner. Ability to be self-motivated; detail and goal-oriented with the ability to quickly pick up concepts and apply them to their work; and utilize utmost discretion as it relates to dealing with confidential materials; with the ability to travel and work evenings and/or weekends. Incumbent must demonstrate an interest or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.\n\nCalifornia State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022 the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.\n\nDesired Qualifications: Master’s degree or equivalent from an accredited college or university in a job-related field. Prior experience, demonstrating skills in advancing organizational goals and relationships with internal and external constituencies. General knowledge of CSU policies and guidelines. Prior experience in higher education. Familiarity with higher education, academia, and with California state public policy.\n\nCompensation: Salary is commensurate with experience and qualifications. Salary range is $4,812 - $15,449/monthly (Budgeted Hiring Salary Range: $4,812 - $14,166/Monthly). A comprehensive benefits package is provided.\n\nAppointment: The Administrator II appointment will be made under the guidelines for management and supervisory employees of the California State University. All rights and benefits associated with this appointment are governed by the Management Personnel Plan.\n\nThis position is a \"designated position\" in the California State University's Conflict of Interest Code. The successful candidate accepting this position is required to file Conflict of Interest forms subject to the regulations of the Fair Political Practices Commission.\n\nClosing Date: Review of applications will begin on 8/1/2024 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A completed online Cal State LA employment application is required. Resumes will not be accepted in lieu of a completed application.\n\nThe person holding this position is considered a \"mandated reporter\" under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 revised July 21, 2017.\n\nIn addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.\n\nCandidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.", "responsibilities": "The Executive Director will advocate to develop strong relationships between Cal State LA and its many audiences. It does so by communicating the impact, importance and relevance of the CSU and Cal State LA as a state and national leader in higher education. The Executive Director will implement initiatives that continuously enhance and improve the mission of the California State University, Los Angeles, with external constituents and stakeholders. The responsibilities include a multifaceted unit that grows, cultivates, and stewards effective relationships and partnerships with external organizations, elected officials, alumni, business, industry, governmental, and nongovernmental organizations to enhance the visibility and prominence of the University and to advance the systems strategic interest and reputation on a local, statewide, national, and international level. The Executive Director will collaborate closely with the President, Chief of Staff, and campus and systemwide leaders by facilitating effective partnerships among academic divisions, student success programs/initiatives, and administrative units. This will include cultivating relationships with industry leaders, community leaders, and government and non-governmental organizations through innovative programming, engaged learning opportunities, career pathways, and strategic partnerships. The Executive Director is responsible for devising, managing, overseeing, and pursuing engagement strategies that lead to effective, collaborative, and long-term partnerships that support the mission of Cal State LA and augment the California State University system’s reach into targeted communities in support of targeted initiatives. The Executive Director of External Affairs and University Relations will provide lead oversight over the following functional areas: External Relations; Government Relations (local, state and federal); Community Relations and Civic Engagement; Tribal Relations; Industry Workforce Partnerships and Alliances; Educational Partnerships and Programs; Government Partnerships and Programs; and the Pat Brown Institute.", "qualifications": {"required": "Bachelor’s degree or equivalent from an accredited four-year college or university. Demonstrated experience in developing, planning, and executing special projects and programs related to community and government relations. Knowledge and understanding of political institutions and organizations at the local and state government. Demonstrated skills in advancing organizational goals and relationships with internal and external constituencies. Demonstrate advanced analytical and conceptual skills for use in advocacy programs, government relations, issues management, and managerial support. Excellent writing skills and strong public speaking skills to make presentations to individuals or groups. Lead varying initiatives through a collaborative, service-oriented and communicative approach. Represent the University at large with External Affairs, Government and External Relations, at community meetings, neighborhood councils, hearings, and external events related to university programs, policies, priorities, and mission, and will recommend and coordinate the implementation of administrative policies to conduct the objectives of the university and department more effectively and efficiently. Assist the university and departments in making local government and community connections, and identifying opportunities for partnerships, grants, and funding opportunities. Maintain positive working relationships and open communication channels with on-campus partners across different units. Responsible for developing campus expertise and knowledge on departments that will help promote advocacy efforts and serve as a resource to those departments in communicating governmental-related and policy issues. Develop and execute community outreach programs, events, and initiatives to inform and increase support among government officials, strengthen town-gown relations, and deepen the university's community engagement efforts. Research and provide information to elected officials and community leaders on Cal State LA’s contributions to the community and areas of interest. Will support advocacy efforts, including annual advocacy visits to Sacramento and Washington, D.C. when needed. Assist with the development of the legislative request and documentation, including literature appropriate for supporting legislative requests. Assist campus departments and colleagues with external stakeholder engagement. Draft correspondence to elected officials and external stakeholders. Gather data and prepare policy briefs and reports in response to inquiries from internal and external stakeholders. Ability to establish credibility and cultivate productive relationships across organizations. Ability to communicate with constituents in a professional and respectful manner. Ability to be self-motivated; detail and goal-oriented with the ability to quickly pick up concepts and apply them to their work; and utilize utmost discretion as it relates to dealing with confidential materials; with the ability to travel and work evenings and/or weekends. Incumbent must demonstrate an interest or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.", "preferred": "Master’s degree or equivalent from an accredited college or university in a job-related field. Prior experience, demonstrating skills in advancing organizational goals and relationships with internal and external constituencies. General knowledge of CSU policies and guidelines. Prior experience in higher education. Familiarity with higher education, academia, and with California state public policy."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "8/1/2024", "benefits": "A comprehensive benefits package is provided.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978330069"}