{"jobTitle": "Patient Coordinator - Cosmetics", "company": {"name": "Divina Dermatology & Cosmetic Center", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "24.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Location:</strong> 436 N Bedford Dr. Beverly Hills, CA<p><strong>Company:</strong> Divina Dermatology &amp; Cosmetic Center</p><p>www.DivinaDermatology.com</p><p><br/></p><p><strong>Position:</strong> Full-Time or Part-Time Experienced Patient Coordinator</p><p>Are you a detail-oriented and compassionate professional with a passion for patient care? Do you thrive in a fast-paced environment where your organizational skills and dedication to service make a real difference? Join our esteemed team at our state-of-the-art facility in the heart of Beverly Hills, where we offer a rewarding role for an experienced Patient Coordinator.</p><p><br/></p><p><strong>About Us:</strong> At our premier dermatology facility, we pride ourselves on providing the highest level of care to our discerning clientele. With cutting-edge equipment and a luxurious atmosphere, we offer a top-tier experience for both patients and practitioners.</p><p><br/></p><p><strong>Position Overview:</strong> We are seeking an experienced Patient Coordinator with a strong background in dermatology and cosmetic procedures to join our team on a part-time basis. In this role, you will have the opportunity to showcase your skills in patient management and coordination, ensuring a seamless and exceptional experience for our clients.</p><p><strong>Key Responsibilities:</strong></p><p><br/></p><ul><li>Coordinate patient appointments, including scheduling, rescheduling, and confirming consultations and follow-up visits.</li><li>Provide detailed information to patients about cosmetic dermatology procedures, including injectables (Botox, fillers), lasers (Clear + Brilliant, Sciton), and skin rejuvenation treatments.</li><li>Manage patient records and ensure accurate and up-to-date documentation.</li><li>Demonstrate exceptional patient care and service, addressing patient inquiries and concerns with professionalism and empathy.</li><li>Collaborate with our dedicated support staff and medical professionals to streamline office operations and enhance patient satisfaction.</li></ul><p><br/></p><p><strong>Benefits:</strong></p><ul><li>Competitive compensation</li><li>Access to state-of-the-art equipment and technology</li><li>Dedicated support staff to assist with administrative tasks</li><li>Prime location in Beverly Hills, providing ample opportunity for professional development</li><li>Room for growth within the organization</li></ul><p><br/></p><p><strong>How to Apply:</strong> If you are a self-motivated and ambitious Patient Coordinator seeking a rewarding opportunity in a dynamic environment, we want to hear from you! Please submit your resume and cover letter to<strong> Info@DivinaDermatology.com</strong></p><p>Join us in revolutionizing dermatological and cosmetic care in Beverly Hills, where your dedication and organizational skills contribute to the success and satisfaction of our clients!</p><p><br/></p><p><strong>Seniority Level:</strong></p><p>Mid-Senior level</p><p><br/></p><p><strong>Industry:</strong></p><p>Hospitals and Health Care</p><p><br/></p><p><strong>Job Functions:</strong></p><p>Health Care Provider</p><p><br/></p><p><strong>Skills:</strong></p><ul><li>Patient Scheduling</li><li>Cosmetic Dermatology Knowledge</li><li>Laser Treatment Familiarity (Clear + Brilliant, Sciton)</li><li>Botox and Dermal Fillers Knowledge</li><li>Exceptional Patient Care</li><li>Administrative Coordination</li></ul><p></p>", "responsibilities": "Coordinate patient appointments, including scheduling, rescheduling, and confirming consultations and follow-up visits. Provide detailed information to patients about cosmetic dermatology procedures, including injectables (Botox, fillers), lasers (Clear + Brilliant, Sciton), and skin rejuvenation treatments. Manage patient records and ensure accurate and up-to-date documentation. Demonstrate exceptional patient care and service, addressing patient inquiries and concerns with professionalism and empathy. Collaborate with our dedicated support staff and medical professionals to streamline office operations and enhance patient satisfaction.", "qualifications": {"required": null, "preferred": null}, "skills": ["Patient Scheduling", "Cosmetic Dermatology Knowledge", "Laser Treatment Familiarity (Clear + Brilliant, Sciton)", "Botox and Dermal Fillers Knowledge", "Exceptional Patient Care", "Administrative Coordination"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Competitive compensation, Access to state-of-the-art equipment and technology, Dedicated support staff to assist with administrative tasks, Prime location in Beverly Hills, providing ample opportunity for professional development, Room for growth within the organization.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3978982441"}