{"jobTitle": "Regional Sales Manager - Los Angeles", "company": {"name": "WEKA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "WEKA is architecting a new approach to the enterprise data stack built for the AI era. The WEKA® Data Platform sets the standard for AI infrastructure with a cloud and AI-native software solution that can be deployed anywhere. It transforms legacy data silos into data pipelines that make GPUs, AI, and other performance-intensive workloads run faster, work more efficiently, and consume less energy.<br/><br/>WEKA is a pre-IPO, growth-stage company on a hyper-growth trajectory. We’ve raised $375M in capital with dozens of world-class venture capital and strategic investors. We help the world’s most innovative enterprises and research organizations, including 12 of the Fortune 50, reach discoveries, insights, and outcomes faster and more sustainably.<br/><br/>We’re passionate about helping our customers overcome complex data challenges to accelerate their innovation and help grow their businesses. If you share our passion, we invite you to join us on this exciting journey.<br/><br/><strong>What’s Cool About This Job<br/><br/></strong>WEKA is hiring for a driven Regional Sales Manager for the Los Angeles. This is a quota-carrying hunter sales role targeting organizations who need uncompromising speed, simplicity, scale, and sustainability when storing, managing, processing, and analyzing their data.<br/><br/><strong>Bring Your Passion<br/><br/></strong><ul><li>You have relationships with customers and focus partners across the region </li><li>You have experience building out new territories</li><li>You have a passion for winning and are results driven</li><li>You have an ability to influence others to achieve results<br/><br/></li></ul><strong>Responsibilities Include<br/><br/></strong><ul><li>Demonstrate a deep understanding of WEKA and the value to our customers</li><li>Develop and execute against a strategic plan to create sales pipeline while acquiring new logos and maintaining positive ongoing relationships with customers</li><li>Accelerate customer adoption through education and engagement</li><li>Work with strategic and VAR partners to cultivate and manage joint selling opportunities</li><li>Collaborate on and improve all aspects of the sales cycle, including product, support, and sales engineering</li><li>Interface at many levels of WEKA senior management<br/><br/></li></ul><strong>Your Background<br/><br/></strong><ul><li>10+ years of IT Sales experience</li><li>Experience selling into the Los Angeles territory</li><li>Passion and desire to work in a startup culture directly impacting the growth of the company</li><li>Proven track record of effective selling within the geo</li><li>Superb written and verbal communications skills</li><li>Bachelors Degree preferred<br/><br/></li></ul><strong>USA Residents Only: </strong>The OTE hiring wage range for this position which the Company reasonably and in good faith expects to pay for the position in the specified geographic areas or locations, is $290,000-320,000. Final compensation will be dependent on various factors relevant to the position and candidate such as geographical location, candidate qualifications, certifications, relevant job-related work experience, education, skillset and other relevant business and organizational factors, consistent with applicable law. In addition, the position may include some of the following comprehensive benefits such Medical, Dental, Vision, Life, 401(K), Flexible Time off (FTO), sick time, leave of absence as per the FMLA and other relevant leave laws.<br/><br/><strong>Concerned you don’t meet every qualification? Don’t let it stop you from applying!<br/><br/></strong>Studies have shown that traditionally underrepresented groups may be less likely to apply for jobs if they don’t meet every qualification specified. WEKA is committed to building a diverse, inclusive, and authentic workplace. If you are excited about this position but are concerned your past work experience doesn’t match up perfectly with the job description, we encourage you to apply anyway – you may be just the right candidate for this or other roles at WEKA.<br/><br/>WEKA is an equal-opportunity employer that prohibits discrimination and harassment of any kind. We provide equal opportunities to all employees and applicants for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.", "responsibilities": "Demonstrate a deep understanding of WEKA and the value to our customers\nDevelop and execute against a strategic plan to create sales pipeline while acquiring new logos and maintaining positive ongoing relationships with customers\nAccelerate customer adoption through education and engagement\nWork with strategic and VAR partners to cultivate and manage joint selling opportunities\nCollaborate on and improve all aspects of the sales cycle, including product, support, and sales engineering\nInterface at many levels of WEKA senior management", "qualifications": {"required": "10+ years of IT Sales experience\nExperience selling into the Los Angeles territory\nPassion and desire to work in a startup culture directly impacting the growth of the company\nProven track record of effective selling within the geo\nSuperb written and verbal communications skills", "preferred": "Bachelors Degree"}, "skills": ["Sales", "Business Development", "Strategic Planning", "Customer Relationship Management", "Partner Management", "Sales Engineering", "Product Knowledge", "Communication", "IT"], "postedDate": "2 weeks ago", "benefits": "Medical, Dental, Vision, Life, 401(K), Flexible Time off (FTO), sick time, leave of absence as per the FMLA and other relevant leave laws.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979019829"}