{"jobTitle": "Sales Operations Manager", "company": {"name": "Franki", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$75,000 - $85,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Media", "description": "<em><strong>Hi, We’re Franki <br/><br/></strong></em>Franki is an AI-powered startup transforming how people discover and choose the next place they’ll eat, drink and play. Our platform curates video-powered recommendations provided by a vibrant community of content creators and foodies who are passionate about sharing the best their city has to offer.<br/><br/>At Franki, we offer a dynamic and entrepreneurial work environment with tremendous opportunities for growth. As part of our team, you will be on the ground floor of a high-growth startup that is building the future of how people will find places and experiences that create meaningful connections.<br/><br/><strong>About The Role<br/><br/></strong>Franki’s Sales team is seeking a Sales Operations Manager to refine and execute on our go-to-market strategy. Reporting to the Chief Revenue Officer, you will be part of a growing team and will be tasked with supporting Franki’s sales org and leadership, partnering with cross-functional teams to identify system, data or process needs that can drive revenue growth. This new role offers an incredible opportunity to be responsible for architecting, measuring, and reporting on Franki’s revenue performance and growth.<br/><br/><em>Note: This is a fully remote position, with occasional travel to team offsites and events</em>. <em>Candidates residing in our preferred locations; AZ, CA, FL, GA, TX will be given first consideration.<br/><br/></em><em><strong>What you’ll do:<br/><br/></strong></em><ul><li>Collaborate with Sales, Marketing and Product to streamline sales processes and manage implementation of necessary solutions while working to establish and ensure standards across our business applications. </li><li>Perform lead, pipeline, and sales performance analyses to provide and make recommendations to increase sales velocity and metric improvements. </li><li>Assist with territory assignments and account assignments. </li><li>Generate and maintain detailed documentation of policies and processes. </li><li>Create and maintain reports and dashboards to track key performance metrics related to lead generation, pipeline development, and acquisition performance for our B2B, B2C and B2I efforts. </li><li>Develop and deliver best in class analytical infrastructure for Sales Operations and cross functional business partners by leveraging our tech stack including Tableau, Salesforce CRM and others. </li><li>Partner with our CRO and other sales leadership to define strategy &amp; planning including org structure, Go-To-Market Motion, KPIs, HC requirements, investments, and training needed for success in all segments. </li><li>Assist in developing compensation and incentive plans for various sales and CS/CX roles as we scale.. </li><li>Deliver Operational Excellence in Pipeline, Forecast, and Reporting by delivering analytics and insights to Sales, Marketing and Product leadership that measure key business drivers.. </li><li>Lead Data governance and stewardship for Sales Operations including cleansing, manipulation, and preparation; Partner with cross-functional operations and analytics teams when necessary. </li><li>Continuously evaluate and recommend technology investments with clear ROI and implementation plans; Stay up-to-date on the latest trends and best practices in data analysis and visualization. <br/><br/></li></ul><em><strong>You’re a good fit if you have..</strong>.<br/><br/></em><ul><li>BA/BS degree or equivalent work experience in Sales Operations. </li><li>1+ year of Sales Operations experience. </li><li>Proficiency in G-suite products and email communication. </li><li>Experience with Salesforce, Tableau, SalesLoft, and other similar systems. <br/><br/></li></ul><em><strong>Bonus points if you have...<br/><br/></strong></em><ul><li>Experience in Saas. </li><li>SFDC admin experience. </li><li>Strong strategic planning and anticipation skills, with an ability to manage by influence. <br/><br/></li></ul><em><strong>Perks &amp; Benefits<br/><br/></strong></em><ul><li>Remote work: Our team works remotely across the US but primarily PST time zone; we travel together several times a year for company kick-offs and mid-year meetings. </li><li>PTO: 15 days per year, plus additional PTO between Christmas and the end of the year (25th Dec - 31st Dec). Additionally, we recognize 11 public holidays per year. </li><li>Medical, dental &amp; vision: We cover 100% of Medical, Vision, and Dental insurance costs for employees and 50% for dependents. </li><li>401(k)</li><li>Equipment: Computer &amp; technology equipment applicable to your role. </li><li>Monthly Stipend: $40 (Tax-free) to cover home office expenses<br/><br/></li></ul><em><strong>The base salary range for this role is…<br/><br/></strong></em><ul><li>$75,000 - $85,000 per year. <br/><br/></li></ul><em><strong>Statement of Equal Opportunity <br/><br/></strong></em><em>At Franki, we value diversity in backgrounds and perspectives and depend on it to drive community and our innovative culture. That’s why we’re a proud Equal Opportunity Employer, and we believe that our products, our teams, and our business are stronger because of it. This means that no matter what race, color, religion, sex, sexual orientation, gender identification, national origin, age, marital status, ancestry, physical or mental disability, or veteran status, you’re always welcome at Franki.<br/><br/></em>", "responsibilities": "Collaborate with Sales, Marketing and Product to streamline sales processes and manage implementation of necessary solutions while working to establish and ensure standards across our business applications. Perform lead, pipeline, and sales performance analyses to provide and make recommendations to increase sales velocity and metric improvements. Assist with territory assignments and account assignments. Generate and maintain detailed documentation of policies and processes. Create and maintain reports and dashboards to track key performance metrics related to lead generation, pipeline development, and acquisition performance for our B2B, B2C and B2I efforts. Develop and deliver best in class analytical infrastructure for Sales Operations and cross functional business partners by leveraging our tech stack including Tableau, Salesforce CRM and others. Partner with our CRO and other sales leadership to define strategy & planning including org structure, Go-To-Market Motion, KPIs, HC requirements, investments, and training needed for success in all segments. Assist in developing compensation and incentive plans for various sales and CS/CX roles as we scale.. Deliver Operational Excellence in Pipeline, Forecast, and Reporting by delivering analytics and insights to Sales, Marketing and Product leadership that measure key business drivers.. Lead Data governance and stewardship for Sales Operations including cleansing, manipulation, and preparation; Partner with cross-functional operations and analytics teams when necessary. Continuously evaluate and recommend technology investments with clear ROI and implementation plans; Stay up-to-date on the latest trends and best practices in data analysis and visualization.", "qualifications": {"required": "BA/BS degree or equivalent work experience in Sales Operations. 1+ year of Sales Operations experience. Proficiency in G-suite products and email communication. Experience with Salesforce, Tableau, SalesLoft, and other similar systems.", "preferred": "Experience in Saas. SFDC admin experience. Strong strategic planning and anticipation skills, with an ability to manage by influence."}, "skills": ["Sales Operations", "Salesforce", "Tableau", "SalesLoft", "G-suite", "Email Communication", "Saas", "SFDC", "Strategic Planning"], "postedDate": "1 month ago", "benefits": "Remote work: Our team works remotely across the US but primarily PST time zone; we travel together several times a year for company kick-offs and mid-year meetings. PTO: 15 days per year, plus additional PTO between Christmas and the end of the year (25th Dec - 31st Dec). Additionally, we recognize 11 public holidays per year. Medical, dental & vision: We cover 100% of Medical, Vision, and Dental insurance costs for employees and 50% for dependents. 401(k) Equipment: Computer & technology equipment applicable to your role. Monthly Stipend: $40 (Tax-free) to cover home office expenses", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3979957063"}