{"jobTitle": "Program Manager", "company": {"name": "Thales", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Onsite", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$71,142.40 - $101,632.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Thales is looking for a Program Manager to join our team in Irvine, CA. In this role, you will report to the Director of Program Management, and you will be responsible for helping to manage the execution of customer program(s) and/or portfolio(s) with technical and business complexity. In this position, you will also assist with program data and requirements conducting work with the highest ethical standards, transparency and compliance with all applicable laws.", "responsibilities": "Support demand management duties, i.e., validating SAP reflects Customer’s demand via CP, follow-up and validate missing Customer Purchase Orders (POs), maintain SAP’s Project Data fields. Help with PCO processing, e.g., review PCO Kanban requests to ensure requirements are met for proper quoting. Workload forecasting, e.g., coordinate with PM/SEM; PMO to train how to load in PV. Other back-office program support duties, i.e., Action item follow-up, meeting minutes, etc. Works closely with Customer Delivery personnel and other department personnel, as necessary, e.g., obtain inputs from project team members to support various project tasks. Help manage project relevant documentation, history and organizational knowledge.", "qualifications": {"required": "Bachelor's degree with a minimum of 1-4+ years of relevant work experience or a Master’s degree with 0-2+ years of relevant work experience. Some financial understanding to work with P&L statements. Effective at communications with multicultural customers/stakeholders. Effectively present information and respond to questions from various stakeholders. Proficient with MS Office applications, i.e., Excel, Word, PowerPoint, Project, Outlook and Teams.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Elective Health and Dental plans. Retirement Savings Plan with a company contribution and a match, and without vesting period. Company paid holidays, vacation days, and paid sick leave. Company provided Life Insurance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3979007401"}