{"jobTitle": "Human Resources Analyst", "company": {"name": "City of Glendale, CA", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "<strong>The Position<br/><br/></strong><strong>OPEN EXAMINATION - ONE YEAR PROBATION PERIOD<br/><br/></strong>Under the direction of senior management, this mid-management classification is the journey level position of the series and performs professional-level technical Human Resources work.<br/><br/><strong>Essential functions of the job include, but are not limited to, the following:<br/><br/></strong>Ensures Department services are provided with exceptional customer service and the highest level of ethical standards.<br/><br/>Plans and coordinates selection and recruitment activities with City departments; composes job bulletins and recruitment information; recommends, schedules, and coordinates advertising activities in appropriate media.<br/><br/>Coordinates selection processes as assigned, including recruitment, evaluating applications and developing and administering examinations.<br/><br/>Utilizes automated applicant tracking/exam scoring/statistical analysis software to conduct analysis of exams.<br/><br/>Reviews, updates and revises class specifications, and develops class specifications for new classifications.<br/><br/>Conducts formal job analysis processes and job audits as directed.<br/><br/>Investigates civil service appeals.<br/><br/>Conducts salary and benefit surveys and prepares related analytical reports. Develops, analyzes and responds to salary and benefit surveys.<br/><br/>Prepares and/or delivers orientation programs, training programs, and other related workshops.<br/><br/>Researches special issues in fields related to human resources and employee relations subject matters and prepares written reports.<br/><br/>Counsels and informs employees and supervisors of procedures and regulations pertaining to human resources actions and policies.<br/><br/>Participates in various phases of employee relations program, including preparation of disciplinary actions, assistance with negotiations and contract administration.<br/><br/>Participates in employment outreach activities including representing the City at job fairs and community events.<br/><br/>Develops, updates or revises policies, procedures, handbooks, and manuals.<br/><br/>Prepares agenda items/reports for review and approval by the Civil Service Commission.<br/><br/>Prepares responses to Unemployment Insurance claims and may represent the City at Unemployment Insurance hearings.<br/><br/>Represents the department at Civil Service Commission meetings and hearings.<br/><br/>Conducts employee exit interviews.<br/><br/>Reviews employee performance evaluations.<br/><br/>Provides career counseling for City employees and prospective applicants.<br/><br/>Conducts and coordinates investigations in discipline and grievance matters.<br/><br/>Participates in and coordinates processes to ensure that disabled employees and applicants receive appropriate accommodation in compliance with federal and state law.<br/><br/>Drives on city business.<br/><br/>Assumes responsibility for ensuring the duties of the position are performed in a safe, efficient manner.<br/><br/>Performs other related duties as assigned or as the situation requires.<br/><br/><strong>Experience<br/><br/></strong><strong>Minimum Requirements<br/><br/></strong>One year of increasingly responsible professional experience in the following areas of human resources administration: recruitment and selection, classification and compensation, employee relations, and employment and training.<br/><br/>Full-cycle recruitment experience is highly desirable.<br/><br/>Experience with automated applicant tracking systems is desirable.<br/><br/><strong>Public Agency Experience Is Preferred.<br/><br/></strong><strong>Education<br/><br/></strong>Bachelor's Degree in Human Resource Management, Public Administration, Business Administration, or a related scientific or human relations field.<br/><br/><strong>License(s)/Certification(s)<br/><br/></strong>Valid Class C California driver's license.<br/><br/><strong>Knowledge Of<br/><br/></strong>Knowledge, Skills &amp; Abilities<br/><br/>Basic mathematical operations including basic statistics such as averages, percentages and ratios.<br/><br/>Business letter writing and report preparation.<br/><br/>Current Federal, State and local legislation pertaining to human resource management, employee relations and equal employment opportunity.<br/><br/>English grammar usage, spelling, punctuation, and business vocabulary.<br/><br/>Equal employment opportunity and diversity management principles.<br/><br/>Job analysis methods and basic psychometric principles.<br/><br/>Laws and legal principles relevant to labor and employee relations, including but not limited to the Meyers-Milias-Brown Act, Fair Labor Standards Act, Public Safety Officer Procedural Bill of Rights, Americans With Disabilities Act, Family and Medical Leave Act, and other related laws.<br/><br/>Principles and practices of human resources administration including job analysis, position classification, compensation, recruitment and selection, and pertinent Federal and State laws.<br/><br/>Recruitment sources, techniques and procedures.<br/><br/>Uniform guidelines of employee selection procedures.<br/><br/>Wide variety of PC software applications for word processing, applicant tracking, spread sheets, and data bases.<br/><br/><strong>Knowledge Of And Skill In<br/><br/></strong>Exceptional customer service practices.<br/><br/><strong>Skill In<br/><br/></strong>Effective oral and written communications, both on a one-on-one and a group basis.<br/><br/>Making independent judgments and decisions based on standard policy or procedure.<br/><br/>Organizing and prioritizing assignments.<br/><br/>Utilizing a variety of Microsoft Office software programs, including Outlook, Excel, and PowerPoint.<br/><br/><strong>Ability To<br/><br/></strong>Provide exceptional customer service to those using of the Human Resources Department services.<br/><br/>Collect, analyze, and interpret data including classification and salary and benefit information.<br/><br/>Deal calmly with rude or angry people.<br/><br/>Develop and prepare clear, concise and comprehensive reports and agenda items.<br/><br/>Develop, create and administer examinations.<br/><br/>Develop necessary skills from on-the-job training and meet the standards of performance for the classification by the end of the probationary period.<br/><br/>Foster a teamwork environment and positive organizational relations.<br/><br/>Interpret and apply Memoranda of Understanding, and City policies.<br/><br/>Maintain confidentiality when necessary and prudent.<br/><br/>Model and practice the highest standards of ethical conduct.<br/><br/>Read, write, communicate effectively, and comprehend directions in English.<br/><br/>Review and evaluate employees' job performance and provide feedback.<br/><br/>Utilize a computer system.<br/><br/>Other Characteristics<br/><br/><strong>Willingness To<br/><br/></strong>Assume responsibility for maintaining a safe working environment.<br/><br/>Work the necessary hours and times to complete goals, tasks, and objectives.<br/><br/><strong>Note<br/><br/></strong>An equivalent combination of experience, education and/or training may substitute for the listed minimum requirements.<br/><br/><strong><strong><strong><strong><strong><strong> Exceptional Customer Service Policy <br/><br/></strong></strong></strong></strong></strong></strong>The City of Glendale places a high importance on quality customer service and prides itself for the high level of services it provides by every employee of the organization. As employees of the City of Glendale, we are committed to providing our diverse community and each other with courteous, considerate, and personal attention.<br/><br/>Please click on the link to read the Exceptional Customer Service Policy .<br/><br/><strong>Selection Process<br/><br/></strong><strong> EVALUATION OF APPLICATION: </strong> All applications, resumes and submitted reference materials will be reviewed and evaluated and only the best-qualified candidates based on applicable experience will be invited to the selection process.  <strong><strong>WRITTEN EXAM:</strong> </strong> (Weight of 25%) To evaluate the applicant’s ability to be successful in this position. Exam will be relevant to the duties of this position. A pproximately the top 12 scoring candidates who achieve a minimum passing score of 70.00% on the written exam will be invited to the further stages of the examination process.<br/><br/><strong><strong><strong><strong><strong><strong><strong>ORAL INTERVIEW: </strong></strong></strong></strong></strong></strong></strong>(Weight of 75%) To evaluate the applicant's experience, education, and general background for the position.<br/><br/>Candidates must pass each exam component with a minimum score of 70.00% in order to be placed on the eligible list.<br/><br/><strong><strong><strong><strong><strong><strong><strong>TIME AND PLACE OF THE EXAMINATION WILL BE ANNOUNCED.</strong></strong></strong></strong> </strong></strong></strong> Any evaluation will be based on the candidate's education and experience as related to the position. Any examination will be to evaluate the candidate's education, experience, knowledge and skills for the position. The City of Glendale reserves the right to modify the above stated examination components and/or weights. Should this be necessary, the candidates will be notified of the specific examination components and weights prior to the administration of any examination. The selected candidate will be subjected to a background check including Livescan fingerprinting. The City of Glendale conforms with State and Federal obligations to make reasonable accommodation for applicants and employees with disabilities. The Human Resources Department asks that it be advised of special needs at least five days prior to the first test part so that a reasonable accommodation may be made. The provisions of this bulletin do not constitute an express or implied contract. In compliance with the Immigration Reform and Control Act of 1986, the City of Glendale requires that all new employees provide documentation to establish both work authorization and identity.<br/><br/>The City of Glendale offers a comprehensive benefit package including vacation, holiday, and sick leave as well as medical, dental, vision, life, and long-term disability insurance.<br/><br/>The above listed benefits apply to full-time, salaried positions only.<br/><br/>Closing Date/Time: 8/23/2024 11:59 PM Pacific", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3979382073"}