{"jobTitle": "Production Manager - HW", "company": {"name": "Interplastic Corporation", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Chemical Manufacturing", "description": "Salary up to $130,000<br/><br/><strong>Position Summary<br/><br/></strong>Manage the production operations at this manufacturing facility, including all available production resources, materials and human resources, in a timely and cost-efficient manner to produce a quality product on-time with customer satisfaction for the entire line of products manufactured at the Hawthorne plant.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>BS degree in chemical engineering or other technical degree with appropriate work experience </li><li>5 years’ experience in manufacturing (resin and gel coat preferred)</li><li>Experience Supervising Production workforce </li><li>Experience in quality systems such as ISO9000.</li><li>Six Sigma or Lean Six Sigma Certification (preferred)<br/><br/><br/></li></ul><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Support the plant manager in the operation of this manufacturing facility in a manner that promotes employee safety, housekeeping and compliance with environmental standards.</li><li>Support the plant manager and plant scheduler in managing the inventories of raw materials to ensure the timely and cost-effective production of customer orders.</li><li>Schedule and manage the shift supervisors to ensure the objectives of this production facility are achieved.</li><li>Ensure the procedures defined in our ISO 9001 quality system are followed in the manufacturing operations.</li><li>Support the QC department to ensure that quality standards are maintained through the manufacturing, packaging, and labeling of all resin and gel coat and colorant products.</li><li>Provide for timely and economical shipment of the product to the customer.</li><li>Maintain a positive and energetic interface with all staff members. Be a leader and teacher at all times.</li><li>Establish performance standards and hold all production personnel accountable for those standards. This includes working within the company established Progressive Disciplinary Policy guidelines as needed in order to achieve the desired results.</li><li>Punctuality and regularity of attendance are job requirements.<br/><br/><br/></li></ul><strong>Physical Requirements:<br/><br/></strong><ul><li>Ability for prolonged periods of sitting at a desk and working with office equipment </li><li>Ability for standing and walking the plant floor (including stairs)</li><li>Ability to use a computer, telephone, keyboard, mouse, and office equipment such as printers, scanners, etc.</li><li>Lifting up to 10 lbs. regularly and up to 40 lbs. occasionally.</li><li>Ability to travel occasionally to other work sites for meetings or support</li></ul>", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3979751455"}