{"jobTitle": "Sales Account Executive", "company": {"name": "Confidential", "industry": "Aviation and Aerospace Component Manufacturing", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "My client is one of the #1 companies in the logistics industry and are highly specialized to service organizations in the technology sector. They have been around for 25 years and have consistently met and exceeded their growth targets year over year.\n\nThey are a leader in their space and industries serviced include, but are not limited to, medical device, electronics and aerospace. This position is an expansion role. They have almost zero turnover. Despite the economic downturn, this company has continued to thrive and expand! Once you bring on a client, you maintain and grow the account. It is your account for LIFE. You actually get the opportunity to build a book of business. Your new business quota does not increase every year because they understand you also need to focus on your existing account base. You earn residual commission for the life of the account and because of that top Reps in the company make considerably more year over year.\n\nPerks:\n<ul><li><strong>Generous base salary and bonus.</strong></li><li>They offer full medical benefits that are 70% employer paid for employee and dependents, matching 401k, home office, car allowance, cell, laptop, and generous expense account.</li></ul>\nRequirements:\n<ul><li>We are looking for a high-energy, driven individual with excellent communication skills who is ready for an opportunity to drive sales and impact revenue growth.</li><li>To succeed, you’ll need to be both a farmer and a hunter, be persistent in your approach and be someone who won’t take no for an answer.</li><li>These traits are essential to helping get our sales team into new doors and generate additional business with existing customers.</li><li>If you are qualified, please send resume for review.</li><li>Seniority Level</li><li>Entry level</li><li>Industry</li><li>Aviation and Aerospace Component Manufacturing</li><li>Transportation, Logistics, Supply Chain and Storage</li><li>Employment Type</li><li>Full-time</li><li>Job Functions</li><li>Sales</li><li>Business Development</li><li>Skills</li><li>Sales</li><li>Business</li><li>Hunter</li><li>Outside Sales</li><li>New Business Development</li><li>Account Management</li><li>Quota</li></ul>", "responsibilities": null, "qualifications": null, "skills": ["Sales", "Business", "Hunter", "Outside Sales", "New Business Development", "Account Management", "Quota"], "postedDate": "1 day ago", "applicationDeadline": null, "benefits": "Generous base salary and bonus., They offer full medical benefits that are 70% employer paid for employee and dependents, matching 401k, home office, car allowance, cell, laptop, and generous expense account.", "remoteWork": null, "salary": null, "url": "https://www.linkedin.com/jobs/view/3979385980"}