{"jobTitle": "Warehouse Associate", "company": {"name": "Snap One", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Computers and Electronics Manufacturing", "description": "Snap One is a leading manufacturer and exclusive source of control, A/V, surveillance, networking, power, and infrastructure equipment for residential and commercial professionals. With a vast catalogue of today’s most popular brands, Snap One is the premier choice for professional installers across the globe. We believe that life’s better when everything works together, and the same can be said about the collaborative work we do. Join our award-winning team in our continuous quest to deliver the most brilliant, personalized smart living and smart business experiences to people around the world.<br/><br/>In recent years SnapAV has acquired numerous regional distributors, such as Allnet, Volutone, MRI and CPD, enabling it to deliver additional best-in-class products through its award-winning ecommerce platform and brick-and-mortar “SnapAV Pro” stores. The new unified company offers what the individual companies could not provide on their own, creating new value for the company, its partners, and customers.<br/><br/>Reporting to the Branch Manager the Warehouse Associate focuses on receiving and shipping of customer products. The candidate must be comfortable working in a fast-paced environment that is safety and customer service oriented. The position will require multitasking, attention to detail and working well with other team members and customers.<br/><br/>Specific Responsibilities<br/><br/><ul><li>Management of shipping &amp; receiving products</li><li>Pick and prepare customer orders for pick up or shipment</li><li>Perform routine inventory cycle counts</li><li>Move and stock merchandise within distribution warehouse</li><li>Maintain the workplace and warehouse in a neat, clean and orderly condition<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>1 year forklift experience</li><li>1+ year experience with customer service and/or warehouse environment</li><li>Must be able to lift up to 40 lbs<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Previous Audio-Visual experience <br/><br/></li></ul>Snap One is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status and will not be discriminated against on the basis of disability.", "responsibilities": "Management of shipping &amp; receiving products\nPick and prepare customer orders for pick up or shipment\nPerform routine inventory cycle counts\nMove and stock merchandise within distribution warehouse\nMaintain the workplace and warehouse in a neat, clean and orderly condition", "qualifications": {"required": "High School Diploma or equivalent\n1 year forklift experience\n1+ year experience with customer service and/or warehouse environment\nMust be able to lift up to 40 lbs", "preferred": "Previous Audio-Visual experience"}, "skills": ["Forklift", "Customer Service", "Warehouse", "Inventory", "Shipping", "Receiving"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979754264"}