{"jobTitle": "Coordinator, Logistics and Distribution", "company": {"name": "Liquid I.V.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "66,560.00/yr - $75,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Food and Beverage Services", "description": "About Liquid I.V.\n\nAt Liquid I.V., our purpose is to elevate the vitality of people and the planet. An ambitious goal? Yes! But by playing to win, holding the bar higher, championing wellbeing, and always thinking with a pioneering mindset we can go further together to leave a lasting mark.\n\nOur products are stocked in over 80,000 retail doors, including the world’s leading specialty, big box, and online retailers such as Costco, Walmart, Target, Amazon, and many more. In just over 10 years, our growth has been exponential. And as part of Unilever, we’re continuing the expansion of Liquid I.V. into a global brand.\n\nWe’re also passionate about cultivating solutions for equitable clean water access, a healthier planet, and thriving communities. We contribute over 1% of our company revenue to our Impact Program through which we provide partnerships and grants to organizations that expand access to clean and abundant water locally and globally. By 2026, our goal is to help ensure access to clean water for 2 million people around the world.\n\n About our Team: \n\nWe are a world-class team of innovators and passionate changemakers, looking to develop transformative hydration solutions and make a meaningful impact on the world around us.\n\nAt Liquid I.V., we are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve.\n\nOur team members enjoy a flexible and inclusive working environment, a highly collaborative and innovation-forward culture, generous benefits and perks that empower employees to champion their wellbeing every day, as well as an infinite supply of Liquid I.V. for extraordinary hydration.\n\n About the role: \n\nLiquid I.V. is looking for a motivated, fast thinker who thrives in a fast-paced environment to join our Operations Department as an Outbound Shipments Coordinator. This role will support the Logistics and Distribution Team through ownership of shipments from pick-up to delivery, serving as the main point of contact for shipments within the Liquid I.V. network.\n\nThis individual will be a part of cross-functional teams to execute the goals of Liquid I.V. and ensure deliverables are being met. This candidate will be able to work autonomously, tracking deadlines and KPIs, while also being an exceptional collaborator and team player.\n\n Functions and duties of this role include, but not limited to: \n\n<ul><li>Coordinate shipments on a weekly basis from manufacturing sites to distribution centers and LIV distribution centers to customers.</li><li>Responsible for moving inventory in a customer centric and cost-effective manner.</li><li>Collaborate with members of the Sales, Supply Planning, and Order Management teams to ensure inventory is in the right place at the right time.</li><li>Responsible for tracking and updating shipments in-transit and making sure ERP data/files are properly maintained.</li><li>Communicate shipment details with shippers, receivers, and internal stakeholders. Responsible for effectively communicating shipment delays and escalating shipment issues that impact the Liquid I.V. customer base.</li><li>Collaborate closely with distribution specialist, logistics analyst, logistics manager, and accounting to resolve shipment discrepancies. Serve as main point of contact for shipper and receiver.<br/><br/></li></ul> Qualifications: \n\n<ul><li>Bachelor’s Degree (preferably in business, economics, or another business-related field).</li><li>1-3 years’ experience in CPG or beverage company.</li><li>Ability to take a set of data and turn it into insights and actions.</li><li>Able to adapt and think critically under pressure in a constantly changing and sometimes ambiguous environment.</li><li>Strong organizational skills and attention to detail; dependable and accurate.</li><li>Highly proficient in Microsoft Office (Excel, Word, and PowerPoint) and/or other data analysis/presentation toolsets.</li><li>Quick learner – not afraid of testing new programs, ways of working, or strategy. Constant seeker of untapped knowledge.</li><li>Demonstrated ability to interact with vendors and colleagues in a thoughtful and attentive manner.<br/><br/></li></ul> What We Give: \n\n<ul><li>100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options).</li><li>A 401k plan with company match, short and long-term disability coverage. </li><li>A generous PTO and sick policy that includes 13+ paid annual holidays. </li><li>Wellness classes (fitness, mental health, nutrition, finance, etc.). </li><li>An Employee Assistance Program, including membership for guided meditation for all employees. </li><li>Monthly tech and wellness reimbursement. </li><li>An infinite supply of Liquid I.V. for endless hydration! <br/><br/></li></ul> Work Environment: \n\n<ul><li>Hybrid office environment with flexibility for industry events.<br/><br/></li></ul>Candidates must be authorized to work in the United States without sponsorship.<br/><br/>The expected salary range for this position is $66,560 - $75,000 annually. The exact salary is determined by various factors including experience, skills, education, geographic location, internal company equity, and budget.<br/><br/>This job description indicates in general the nature and levels of work, knowledge, skills, abilities and other essential functions expected of the role. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required. It is not intended to limit or in any way modify the right of any supervisor to assign, direct, and control the work of employees under his/her supervision. Ability to competently perform all the essential duties of the position, with or without reasonable accommodation, demonstrated commitment to the company’s mission, and the ability to work productively as a member of a team or work group are basic requirements of all positions at Liquid I.V.<br/><br/>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives that encourage new ways of solving problems, so we strive to attract and develop talent from all backgrounds and create workplaces where everyone feels seen, heard, and empowered to bring their full, authentic selves to work.<br/><br/>Liquid I.V. is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.", "responsibilities": "Functions and duties of this role include, but not limited to: \n\n<ul><li>Coordinate shipments on a weekly basis from manufacturing sites to distribution centers and LIV distribution centers to customers.</li><li>Responsible for moving inventory in a customer centric and cost-effective manner.</li><li>Collaborate with members of the Sales, Supply Planning, and Order Management teams to ensure inventory is in the right place at the right time.</li><li>Responsible for tracking and updating shipments in-transit and making sure ERP data/files are properly maintained.</li><li>Communicate shipment details with shippers, receivers, and internal stakeholders. Responsible for effectively communicating shipment delays and escalating shipment issues that impact the Liquid I.V. customer base.</li><li>Collaborate closely with distribution specialist, logistics analyst, logistics manager, and accounting to resolve shipment discrepancies. Serve as main point of contact for shipper and receiver.<br/><br/></li></ul>", "qualifications": {"required": "1-3 years’ experience in CPG or beverage company.", "preferred": "Bachelor’s Degree (preferably in business, economics, or another business-related field)."}, "skills": ["CPG", "Beverage", "Data Analysis", "Microsoft Office", "Excel", "Word", "PowerPoint", "Vendor Management", "Collaboration", "Communication", "Problem Solving", "Time Management", "Organization", "Detail Oriented"], "postedDate": "1 week ago", "benefits": "100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options).\nA 401k plan with company match, short and long-term disability coverage. \nA generous PTO and sick policy that includes 13+ paid annual holidays. \nWellness classes (fitness, mental health, nutrition, finance, etc.). \nAn Employee Assistance Program, including membership for guided meditation for all employees. \nMonthly tech and wellness reimbursement. \nAn infinite supply of Liquid I.V. for endless hydration!", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3979745141"}