{"jobTitle": "Marketing Specialist (SoCal)", "company": {"name": "Turner Construction Company", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Construction", "description": "<strong>Division:</strong> Southwest<br/><br/><strong>Project Location(s):</strong> Anaheim, CA 92801 USA<br/><br/><strong>Minimum Years Experience:<br/><br/></strong><strong>Travel Involved:<br/><br/></strong><strong>Job Type:</strong> Regular<br/><br/><strong>Job Classification:</strong> Experienced<br/><br/><strong>Education:<br/><br/></strong><strong>Job Family:</strong> Marketing<br/><br/><strong>Compensation:</strong> Salaried Exempt<br/><br/><strong> Position Description </strong>: Develop marketing and communications materials in support of company internal and external communications and marketing goals.<br/><br/><strong> Reports to </strong>: Marketing Manager, Business Manager, or other.<br/><br/><strong> Essential Duties &amp; Responsibilities*: <br/><br/></strong><strong>External Communications:<br/><br/><br/></strong><ul><li>Develop content in support of company’s social media and brand strategy.</li><li>Assist with creation and management of communications and digital marketing content development calendar</li><li>Assist in planning and organization of promotional, business, and social company events</li><li>Support development and provide information for award applications</li><li>Conduct research and identify external opportunities to communicate company vision, mission, and brand in public-facing forums.</li><li>Creation &amp; management of external-facing marketing collateral for events and meetings</li><li>Work with vendors and photographers to create content for use in external marketing campaigns</li><li>Develop content and generate ideas for company website and support website maintenance.</li><li>Create advertisements for various external media publications with direction, as directed.</li><li>Draft and issue press releases, as directed.</li><li>Conduct project site visits to identify project-specific marketing opportunities.<br/><br/><br/></li></ul><strong>Internal Communications:<br/><br/><br/></strong><ul><li>Produce written &amp; graphic materials for distribution across various internal communication channels (e.g., internal internet stories, newsletters, executive messages, company policy and procedure documents).</li><li>Collaborate in the creation and maintenance of internal communications needs for departments and employee resources groups.</li><li>Assist with planning and managing business unit/team events (i.e. all-hands meetings, employee appreciation events)<br/><br/><br/></li></ul>The salary range for this position is estimated to be 71,000.00 - 80,000.00 annualized.<br/><br/><strong> Qualifications: <br/><br/><br/></strong><ul><li>Bachelor’s Degree from accredited degree program in Marketing, Communications, Business, or related field required, and minimum of three (3) years of related experience. </li><li>Basic understanding of marketing and construction business acumen.</li><li>Proactive, curious, and eager to tackle new projects and contribute ideas.</li><li>Clear and professional verbal and written communication skills.</li><li>Demonstrate interpersonal and team-building skills.</li><li>Familiar with marketing fundamentals including brand management, graphic design, and layout skills.</li><li>Able to take direction, learn and process information quickly, follow tasks through to completion, and work in deadline-driven team and environment.</li><li>Attention to detail, highly organized, and good time management skills.</li><li>Proficient computer skills, Microsoft Office suite of applications, and Adobe Creative Cloud (Acrobat, InDesign, Photoshop, Illustrator).</li><li>Familiar with social media platforms, SEM/SEO, and related analytics. </li><li>May need to work on-call at times remotely to troubleshoot during events.</li><li>Travel is required.<br/><br/><br/></li></ul><strong> Physical Demands: </strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions. The employee frequently views a computer monitor and frequently uses a computer keyboard. Specific vision abilities required by this job include close vision, peripheral vision, depth perception, and the ability to adjust focus. The employee is regularly required to be mobile, and the employee regularly travels both short and long distances via a variety of conveyances.<br/><br/>Performance of the required duties may require physical ability to climb permanent and temporary stairs, passenger use of construction personnel hoists, ability to climb ladders and negotiate work areas under construction. While performing the duties of this job, the employee is frequently required to sit, climb, balance, stoop, kneel, crouch, crawl, use hands to finger, handle or feel objects, tools, or controls, and reach with hands, talk, and hear. The employee regularly performs work at office locations, off-site venues, and occasionally at construction work sites. The employee must regularly lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds<br/><br/><strong> Work Environment: </strong> The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee regularly works in an office or remote setting. The noise in the work environment is usually quiet to moderate in an office setting. While performing the duties of this job, the employee occasionally works at construction work sites where the employee is exposed to moving mechanical parts, high places, fumes, or airborne particles, outside weather conditions, and risk of electrical shock. The noise in the work environment is usually moderate to loud. The employee is required to work in compliance with company safety policies, procedures, and applicable laws.<br/><br/><br/><ul><li>May perform other duties as assigned.<br/><br/><br/></li></ul><strong>Turner is an Equal Opportunity Employer - race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or other characteristics protected by applicable law.</strong>", "salary": {"amount": "71,000.00 - 80,000.00", "currency": "USD"}, "postedDate": "2 weeks ago", "skills": ["Marketing", "Communications", "Business", "Brand Management", "Graphic Design", "Layout Skills", "Microsoft Office", "Adobe Creative Cloud", "Social Media", "SEM", "SEO", "Analytics"], "url": "https://www.linkedin.com/jobs/view/3979756346"}