{"jobTitle": "Supply Chain Operations Analyst", "company": {"name": "Veo", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00 - 107,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Company Overview:<br/><br/></strong>At Veo, we are on a mission to end car dependency by making clean transportation accessible to all and advancing the next generation of fully electric micro-mobility systems. Our fleets are constantly evolving and feature a range of vehicles - from pedal and electric bicycles, to standing and seated e-scooters, e-cargo bikes, and ADA accessible devices. We design and build our own vehicles, hardware, and software systems in house and run all our local operations to provide safe, efficient, and responsive mobility services that make communities more sustainable and livable. We are looking for exceptionally talented individuals who are ready to develop and implement new solutions to these exciting challenges. We are headquartered in Santa Monica, CA, but are hiring across the U.S. Join us!<br/><br/><strong>Operations Strategy Analyst <br/><br/></strong>We are headquartered in Santa Monica, CA and this role will have a hybrid work schedule where you will be able to showcase your creativity and build strong relationships with teams in a cross-functional manner <strong>three days a week</strong> and work remotely for the remaining working days.<br/><br/><strong>Responsibilities <br/><br/></strong><ul><li>Lead initiatives to drive operations efficiency and support Veo to scale </li><li>Identify levers of revenue growth, develop business plans for new initiatives, and drive the implementation of new processes and strategies</li><li>Collaborate with Regional General Managers as an internal consultant and present your projects and proposals to our executive board<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5+ years of work experience in operations, consulting, strategy or similar fields</li><li>Demonstrate background in driving and executing operational excellence</li><li>Ability to define problems, collect data, establish facts, and draw valid action items</li><li>Experience working in a fast paced operations environment</li><li>Thrives in a heavily multifunctional work environment</li><li>Willingness to travel up to 40% of the time<br/><br/></li></ul><strong>Benefits and Perks<br/><br/></strong><ul><li>Unlimited PTO</li><li>Medical/dental/vision coverage </li><li>401k</li><li>Opportunity to work in a fast-paced, early-stage technology company</li><li>Veo credits</li><li>Commitment to professional development and mentorship<br/><br/></li></ul>The base salary range for this full-time position is $85,000 - $100,000 + Annual Performance Bonus + Full Range of Benefits. Veo is a total compensation company, and pay is determined by geographic cost of labor and additional factors, including job-related skills, experience, and relevant education or training - so not all candidates will be eligible for the upper end of the salary range. Our total compensation package for this role, including bonus potential, ranges from $85,000 to $107,000 per year.<br/><br/>Below is the expected salary range for this position. The listed range is a good faith estimate, and exact compensation and total package may vary depending on market conditions and candidate qualifications.<br/><br/>Pay Range<br/><br/>$85,000—$100,000 USD", "responsibilities": "Lead initiatives to drive operations efficiency and support Veo to scale Identify levers of revenue growth, develop business plans for new initiatives, and drive the implementation of new processes and strategies Collaborate with Regional General Managers as an internal consultant and present your projects and proposals to our executive board", "qualifications": {"required": "5+ years of work experience in operations, consulting, strategy or similar fields Demonstrate background in driving and executing operational excellence Ability to define problems, collect data, establish facts, and draw valid action items Experience working in a fast paced operations environment Thrives in a heavily multifunctional work environment Willingness to travel up to 40% of the time"}, "skills": [], "postedDate": "1 month ago", "benefits": "Unlimited PTO Medical/dental/vision coverage  401k Opportunity to work in a fast-paced, early-stage technology company Veo credits Commitment to professional development and mentorship", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3979913055"}