{"jobTitle": "Senior Administrative Assistant, OR Administration", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "25.55/hr - 38.33/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "<strong>Job Description<br/><br/></strong>Align yourself with an organization that has a reputation for excellence! Cedars-Sinai received the National Research Corporation’s Consumer Choice Award 19 times for providing the highest-quality medical care in Los Angeles. We also were awarded the Advisory Board Company’s Workplace of the Year, 3 years in a row. This recognizes hospitals and health systems nationwide that have outstanding levels of employee engagement. We offer an outstanding benefit package and competitive compensation. Come find out why Cedars-Sinai was Voted #1 in California and #2 in the Nation by U.S. News Best Hospitals in 2022-2023!<br/><br/><strong>Why work here?<br/><br/></strong>Beyond outstanding benefits, competitive salaries and health and dental insurance We take pride in hiring the best, most passionate employees. Our talented staff reflects the culturally and ethnically diverse community we serve. They are proof of our commitment to creating a dynamic, inclusive environment that fuels innovation and the gold standard of patient care we strive for.<br/><br/><strong>Summary of Essential Duties :<br/><br/></strong>The Senior Administrative Assistant Performs a broad range of clerical, administrative and general office activities in order to support the facilitation of administrative workflow within the department and/or unit. Supports an individual or multiple staff members by arranging their schedules, appointments and itineraries.<br/><br/><strong>Job Duties and Responsibilities: <br/><br/></strong><ul><li>Schedules appointments and meetings. Makes arrangements for meetings, conferences, or travel for an individual, group or department.</li><li>Researches and responds to inquiries and calls, may escalate to other levels of the organization as appropriate.</li><li>Formats, types, and edits correspondence, documents, memos, reports, meeting minutes and/or presentation materials.</li><li>Compiles financial and operational data from multiple sources to assist management in preparing and monitoring budget and workforce planning and/or other department reports. May prepare summary of information or data.</li><li>Distributes and disseminates information within the department and/or unit.</li><li>Orders supplies and arranges for equipment maintenance.</li><li>Submits, monitors and tracks invoices, reimbursements, and supply management. May assist with preparation and submission of expense reports.</li><li>Establishes and maintains an internal filing system.</li><li>May act as or support the Staff Development Advisory Network (SDAN), Safety Representative and/or UKG Timecard editor within the department and or unit.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Educational Requirements:<br/><br/></strong><ul><li>High School Diploma or GED required</li><li>Bachelor's Degree preferred<br/><br/></li></ul><strong>Experience:<br/><br/></strong>A minimum of 2 years of office and administrative experience required<br/><br/><strong>Req ID</strong> : 3766<br/><br/><strong>Working Title</strong> : Senior Administrative Assistant, OR Administration<br/><br/><strong>Department</strong> : OR Administration<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Administrative<br/><br/><strong>Job Specialty</strong> : Administrative<br/><br/><strong>Overtime Status</strong> : NONEXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $25.55 - $38.33", "responsibilities": "The Senior Administrative Assistant Performs a broad range of clerical, administrative and general office activities in order to support the facilitation of administrative workflow within the department and/or unit. Supports an individual or multiple staff members by arranging their schedules, appointments and itineraries.", "qualifications": {"required": "A minimum of 2 years of office and administrative experience required", "preferred": "Bachelor's Degree preferred"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "We offer an outstanding benefit package and competitive compensation.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979281138"}