{"jobTitle": "OC-IHS-Program Manager -Case Management-801 (JR4324)", "company": {"name": "PATH", "industry": "Non-profit Organizations", "size": "Not specified", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,000.00 to $83,000.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Non-profit Organizations", "description": "We are mission and values driven and your contributions will make a difference. We make a positive difference in people's lives and help an average of 23 people per week to find a place to live. If you join us, you will be able to advocate for change while also working with influential people who effect changes in policy and devote time to issues of racial and social justice. We prioritize your work/life balance and provide various scheduling options in addition to generous time off, health, and wellness benefits and we're committed to helping you reach your potential by providing opportunities for professional growth across the state.", "responsibilities": "Provide leadership to the multidisciplinary teams, ensuring continuity of care and services between PATH agency resources and partnering agencies. Provide individual and team supervision, support, and performance evaluations for assigned staff. Ensure that services emphasize trauma informed care, client safety, and harm reduction interventions. Be available to respond to emergency calls and situations as required by the contract and organization. Assist in the screening, assessment, and enrollment of clients in a range of services. Ensure all paperwork and data collection is complete, timely, accurate, and current in agency records and electronic databases through ongoing audits of electronic databases and chart reviews. Ensure adherence to funding source contracts and performance standards; prepare written reports on program activities as assigned and as required by funding sources.", "qualifications": {"required": "Two (2) years of experience in healthcare, case management, homeless services or working with vulnerable populations.", "preferred": "Three (3) years of experience in healthcare, case management, homeless services or working with vulnerable populations. One (1) year of supervisory experience in homeless services or related social services field strongly preferred."}, "skills": ["Analytical Skills", "Collaboration and Teamwork", "Communication", "Creativity and Initiative", "Critical Thinking and Problem Solving", "Ethics and Boundaries"], "postedDate": "2 months ago", "applicationDeadline": "Not specified", "benefits": "In addition to a rewarding work environment, we offer our employees a competitive benefits package that includes medical, dental and vision coverage, vacation and sick time, paid holidays, and a retirement plan.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3979284934"}