{"jobTitle": "Senior Compensation Analyst/HCM Compensation Project Leader – Hybrid Remote.", "company": {"name": "Cedars-Sinai", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "size": "Not specified", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$102,003.20 - $163,196.80", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "Grow your career at Cedars-Sinai! “World-class Human Resources\" are more than just pretty words here, it is our singular goal. A goal we are making remarkable progress on, and one we hope to achieve with your help. Why work here? Beyond outstanding benefits, competitive salaries and health and dental insurance we offer tuition reimbursement and learning programs so you can achieve additional certifications and degrees while gaining the knowledge and experience needed to advance your career. At Cedars-Sinai, you’ll work among our state-of-the-art biomedical research facilities with access to the best physicians and scientists in the Los Angeles area. Cedars-Sinai placed in the top 20 on Newsweek’s “World's Best Smart Hospitals 2024” list, which highlights hospitals that have excelled in the utilization of electronic functionalities, telemedicine, digital imaging, artificial intelligence and robotics. What will you be doing in this role: The Senior Compensation Analyst/HCM Compensation Project Leader provides complex compensation consultative services to Human Resources and Leadership for assigned areas to include Oracle compensation module design, leadership of the job description enhancement project and support for UKG enhancements. Designs and implements system solutions, strategies and programs through strong communication and influence. The Senior Compensation Analyst manages projects impacting areas of responsibility and manages aspects of major compensation initiatives and/or programs. Note: Position is a 1-year contract with benefits. Possible for contract to be extended or transition to career opportunity depending on operational needs.", "responsibilities": "Participate in all required meetings, evaluating the functionality of the Oracle system and providing input into design, testing, and documentation of decisions. Lead organization-wide job description project to include evaluation of current tools and templates, obtain stakeholder feedback, and finalization of pending job descriptions. Conduct reviews of job levels, assesses and makes determinations regarding requests for new job titles, and update job descriptions in conjunction with HR and management. Manage and administer assigned compensation projects and programs, including design, update, communication and implementation of project/program changes and/or updates. Identify opportunities for process improvements and introduction of best practices. Conduct market and best practice research to formulate and support compensation recommendations. Conduct complex costing and other statistical analyses. Prepare a variety of ad hoc reports and analyses. Maintain and audit compensation related information, such as job codes, salary plans, grades, and shift differentials in the HR system. Provide compensation guidance, training and regulatory updates to HR and Leadership. Act as a mentor and resource for HR, Compensation and other staff across the organization pertaining to compensation related policies and procedures; as well as in the execution of their duties and accountabilities involving compensation. Partner with Human Resources staff and organizational leadership in solving complex business/operational issues across the organization. Partner with Payroll and applicable areas of Human Resources on the upload of mass pay and job changes. Ensure pay practices remain compliant with federal, state, and local regulations.", "qualifications": {"required": "Five (5) plus years of experience in compensation, HR business partner (HRBP), or total rewards. One (1) plus years of experience on a project team implementing a new HCM system.", "preferred": "Bachelor’s degree in Business Administration, Human Resources, Finance or other related field. Certified Compensation Professional (CCP) Preferred."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Outstanding benefits, competitive salaries, health and dental insurance, tuition reimbursement, and learning programs.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3979279307"}