{"jobTitle": "Senior Coordinator, Events and Talent Relations", "company": {"name": "Academy Museum of Motion Pictures", "industry": "Museums, Historical Sites, and Zoos", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Museums, Historical Sites, and Zoos", "description": "<strong>Description<br/><br/></strong>Reporting to the Manager, Events, the Senior Coordinator, Events and Talent Relations provides administrative and operational support for meetings and events at the Academy Museum, Academy Headquarters, Pickford Center, and Fairbanks Center for Motion Picture Study. You will also support private event logistics as well as internal meetings, events, and programs across departments (including Advancement, Education, Film Programs, and Retail). The role requires a positive, customer-service approach, as well as the ability to quickly problem-solve and successfully communicate details to team members, clients, and vendors.<br/><br/><strong>Duties and Responsibilities:<br/><br/></strong><ul><li>Support on-site events as scheduled (including installations and strikes).</li><li>Lead departmental and small client events.</li><li>Provide catering and operations support for Executive Office meetings, including Board of Governors and Board of Trustees.</li><li>Respond to private event inquires via email and phone; schedule and lead site tours for vendors and clients; schedule production calls and meetings.</li><li>Update internal calendars and Airtable bases on a daily basis.</li><li>Serve as host for talent/panelists for events and programs as scheduled.</li><li>Draft and distribute internal works orders for the operating teams including Facilities, Engineering, Security, and Theater Operations.</li><li>Generate client invoices and record payments; process and submit vendor invoices to accounting for payment; participate in monthly payment audit and reconcile unpaid vendor invoices.</li><li>Coordinate guest lists and respond to RSVPs for internal events and opening receptions.</li><li>Update client and department protocol documents and templates on a regular basis.</li><li>Order catering, meeting, and office supplies for all Academy locations.</li><li>Support Managers with onboarding and training new hires.</li><li>Track internal projects and work on special assignments as needed.<br/><br/></li></ul><strong>Position Requirements<br/><br/></strong><strong>Qualifications and Requirements:<br/><br/></strong><ul><li>A college degree required.</li><li>A valid driver license and reliable mode of transportation.</li><li>2+ years of experience in special events, production, catering, or hospitality.</li><li>Availability to work early mornings, late evenings, and weekends as scheduled.</li><li>A friendly, positive, and professional approach towards work and clients.</li><li>Ability to manage confidential and sensitive information.</li><li>Ability to communicate with partners and stakeholders from a variety of cultures and backgrounds.</li><li>Professional experience interfacing with executive leadership and talent.</li><li>Passion for project management, organization, calendars, timelines, details, and problem-solving.</li><li>Excellent written and verbal communication skills.</li><li>Ability to work both independently and collaboratively with larger groups.</li><li>Intermediate proficiency with Microsoft Office Suite, Airtable, and Google Workspace (e.g., calendars, spreadsheets).</li><li>Familiarity with layout, seating, and guest registration software is a plus.</li><li>A commitment to diversity, equity, accessibility, and inclusion.<br/><br/></li></ul><strong>Physical Requirements: <br/><br/></strong><ul><li>Ability to move and transport objects up to 30 lbs.<br/><br/></li></ul><strong>If hired, we require all employees to be vaccinated against COVID-19, unless a medical or religious accommodation is needed as determined on a case-by-case basis. <br/><br/></strong>The expected salary for this role is $25 per hour. The actual base pay offered will be determined on factors such as experience, skills, training, location, certifications, education, and other factors permitted by law. Decisions will be made on a case-by-case basis.<br/><br/><strong>Our Benefits:<br/><br/></strong><ul><li>Comprehensive medical, dental, and vision.</li><li>PTO and Sick Time</li><li>401(k)<br/><br/></li></ul>@museumLI<br/><br/>About the Organization The Academy of Motion Picture Arts and Sciences is a global community of more than 10,000 of the most accomplished artists, filmmakers and executives working in film. In addition to celebrating and recognizing excellence in filmmaking through the Oscars, the Academy supports a wide range of initiatives to promote the art and science of the movies, including public programming, educational outreach and the Academy Museum of Motion Pictures.<br/><br/>EOE Statement The Academy is committed to equal opportunity in employment and to creating and valuing diversity in its workforce. Maintaining a diverse workforce is important to the Academy. The Academy enforces a strict policy that prohibits discrimination in hiring, training, compensation, promotion, transfer, or termination, whether on the basis of race, color, national origin, religion, sex, disability, age, veteran status, sexual orientation or genetic information. This includes a workplace that is free of all forms of harassment. Also, to help foster diversity, the Academy uses programs that ensure fairness of opportunity, pay, and growth to all applicants and employees. Every employee of the Academy is required to follow this policy and to preserve the Academy’s commitment to diversity.", "responsibilities": "Support on-site events as scheduled (including installations and strikes).Lead departmental and small client events.Provide catering and operations support for Executive Office meetings, including Board of Governors and Board of Trustees.Respond to private event inquires via email and phone; schedule and lead site tours for vendors and clients; schedule production calls and meetings.Update internal calendars and Airtable bases on a daily basis.Serve as host for talent/panelists for events and programs as scheduled.Draft and distribute internal works orders for the operating teams including Facilities, Engineering, Security, and Theater Operations.Generate client invoices and record payments; process and submit vendor invoices to accounting for payment; participate in monthly payment audit and reconcile unpaid vendor invoices.Coordinate guest lists and respond to RSVPs for internal events and opening receptions.Update client and department protocol documents and templates on a regular basis.Order catering, meeting, and office supplies for all Academy locations.Support Managers with onboarding and training new hires.Track internal projects and work on special assignments as needed.", "qualifications": {"required": "A college degree required.A valid driver license and reliable mode of transportation.2+ years of experience in special events, production, catering, or hospitality.Availability to work early mornings, late evenings, and weekends as scheduled.A friendly, positive, and professional approach towards work and clients.Ability to manage confidential and sensitive information.Ability to communicate with partners and stakeholders from a variety of cultures and backgrounds.Professional experience interfacing with executive leadership and talent.Passion for project management, organization, calendars, timelines, details, and problem-solving.Excellent written and verbal communication skills.Ability to work both independently and collaboratively with larger groups.Intermediate proficiency with Microsoft Office Suite, Airtable, and Google Workspace (e.g., calendars, spreadsheets).Familiarity with layout, seating, and guest registration software is a plus.A commitment to diversity, equity, accessibility, and inclusion.", "preferred": "Ability to move and transport objects up to 30 lbs."}, "skills": ["Project Management", "Event Management", "Customer Service", "Communication", "Microsoft Office", "Airtable", "Google Workspace", "Hospitality", "Catering", "Production"], "postedDate": "1 week ago", "benefits": "Comprehensive medical, dental, and vision.PTO and Sick Time401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979774604"}