{"jobTitle": "Program Manager - College of Nursing and Health Sciences", "company": {"name": "Azusa Pacific University", "location": "Azusa, CA", "industry": "Higher Education"}, "location": "Azusa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "25.94 to 29.83", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Higher Education", "description": "APU is seeking employees who desire to engage in our thriving culture by cultivating community through professional interactions, demonstrating a posture of lifelong learning, and modeling Christ-like character. Working together, employees at APU commit to establishing a university atmosphere that is edifying to God and to one another.<br/><br/>APU is seeking a Program Manager for the Department of Physical Therapy to work alongside a team of program staff to manage day-to-day operations while helping the students and faculty across the department. The ideal candidate can perform under general supervision, be highly organized, and maintain outstanding customer service.<br/><br/>We are looking for an efficient individual who thrives within a team. The valuable ability to prioritize and multi-task while maintaining complex project schedules and managing organizational support is essential in this role. The ideal candidate is resourceful, organized, solution-driven, and sensitive to handling student records following the Family Educational Rights and Privacy Act (FERPA). In addition, working with students and faculty requires a keen ability to navigate various technology applications, systems, and third-party solutions.<br/><br/>The position reports to the department chair and works closely with the program directors. The position is located at the Azusa Campus. The Department of Physical Therapy houses two doctoral programs serving over 220 students.<br/><br/>The Program Manager for Physical Therapy will manage department activities, as well as special projects, for the graduate programs in Physical Therapy under the direction of the Department Chair. The program manager will work closely with the program directors and the Department Chair in an effort to manage the administrative responsibilities of the graduate programs, and assist with budget operations. The manager is also responsible for overseeing the planning and managing of special events and activities for the Graduate Programs.<br/><br/><strong>Required Education<br/><br/></strong><ul><li>Master’s degree or equivalent education and experience.<br/><br/></li></ul><strong>Required Experience<br/><br/></strong><ul><li>Four years of experience in a client-based, service-oriented environment.</li><li>Demonstrated ability to manage multiple complex priorities and systems.</li><li>Worked well with team members across programs.</li><li>Higher education experience preferred.<br/><br/></li></ul><strong>Primary Duties/Essential Functions<br/><br/></strong>The Program Manager for the Department of Physical Therapy reports directly to the Department Chair, supervises student workers, contracts of adjunct faculty, and supports the overall functioning of the programs in the Department of Physical Therapy, supporting students, faculty, and the public.<br/><br/><ul><li>Serves as confidential assistant and administrative support to the Department Chair.</li><li>Serves as first contact and liaison with the department, students, university community and public</li><li>Oversees the essential day to day office functions: monitoring paperwork, answering email and the telephone, distributing office mail, maintaining office files, ordering office supplies, processing mailings and duplication.</li><li>Coordinates with university services such as catering, printing and binding, mailroom, room resources, information and media technology, facility and equipment requests, etc.</li><li>Coordinates meetings, and provides administrative support to the chair, program directors, and faculty of the department.</li><li>Maintains the program’s calendar of activities and coordinate faculty, student, and alumni engagement, including special events.</li><li>Create, maintain, and distribute promotional materials for events, bulletin boards, etc.</li><li>Prepares all paperwork and forms including adjunct contracts, faculty overloads, course materials, and other departmental documents.</li><li>Assists program directors of two graduate programs in the oversight and administration of programs.</li><li>Coordinates and submits course schedules and schedule changes in a timely manner to Registrar.</li><li>Manages correspondence with students and file management of student files, program forms, etc.</li><li>Manage graduate student employees and the assignment of their daily duties and coordinate their schedules for coverage of the department programs to support staff, faculty, and students. Oversee timely and accurate record-keeping, filing, and other clerical duties performed by student workers for the program.</li><li>Processes contracts and oversees timecards for adjunct faculty in Physical Therapy department.</li><li>Assists the chair in budget management for programs (e.g., track spending, credit card reconciliation).</li><li>With the Program Directors, oversees the service and maintenance of all program resources and equipment</li><li>Create and maintain meeting minutes and correspondence as directed.</li><li>Regular, punctual attendance as required by the supervisor based on department needs.</li><li>Performs other duties as assigned by the supervisor.</li><li>Review and post general ledger transactions for accuracy, timeliness and adequacy of supporting .</li><li>Responsible for daily electronic timekeeping as it applies to the scope of this position.</li><li>Regular, punctual attendance as required by the supervisor based on department needs.</li><li>Performs various related accounting duties as assigned by Accounting Operations manager.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Strong interpersonal skills.</li><li>Strong organizational skills. </li><li>Excellent attention to detail. </li><li>Excellent written and verbal communication skills. </li><li>Ability to coordinate multiple schedules.</li><li>Ability to manage student workers and prioritize tasks. </li><li>Knowledge of accounting practices and budget tracking.</li><li>Grant tracking and management.</li><li>Proficient in learning software and university internal databases and electronic/software programs,.</li><li>Proficient in social media platforms and website development/maintenance,<br/><br/></li></ul><strong>Mental Demands<br/><br/></strong><ul><li>Ability to exercise independent judgment and discretion.</li><li>Ability to manage several tasks simultaneously.</li><li>Ability to work under pressure and meet deadlines.</li><li>Ability to maintain a courteous, helpful attitude when dealing with faculty, staff, students and the public.</li><li>In agreement with the purpose and goals of Azusa Pacific University in providing a Christian-based higher education for its students.<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Intermittent sitting and standing. </li><li>Requires keyboard and 10-key work.</li><li>Extensive telephone usage. </li><li>Meetings may require walking and/or driving to various University locations.</li><li>Ability to lift, pull, grasp, bend and reach. </li><li>Ability to lift up to 20 lbs.<br/><br/></li></ul><strong>Visual Demands<br/><br/></strong><ul><li>Computer monitor, writing notes, and reading.<br/><br/></li></ul><strong>Environment<br/><br/></strong><ul><li>Pleasant office, comfortable temperatures. </li><li>Multiple conversations and transactions occurring simultaneously.<br/><br/></li></ul><strong>Technologies<br/><br/></strong><ul><li>Proficient in Google Apps., Microsoft Office, Word, Excel, MS Powerpoint, MS Publisher, Gmail, Macintosh OS</li><li>The Department of Physical Therapy uses PeopleSoft, 25Live, Zoom, Adobe Acrobat, Dropbox Sign, Canva, Formstack, etc. <br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Grade 10: $25.94 to $29.83 is the hourly compensation for this role and reflects what Azusa Pacific University reasonably expects to pay for this position. Actual compensation may vary based on the qualifications, experience, and internal equity. In addition to compensation, APU offers a competitive benefits package.<br/><br/></li></ul>Azusa Pacific University is a Christ-centered, multicultural community that values and seeks faculty and staff who are committed to diversity, work effectively with diverse populations, and engage others in ways that honor our rich cultural mosaic and biblical foundation. Please click the links to learn more about 'what we believe', our 'missions statement', and 'statement of faith'.<br/><br/>You can learn more about APU by watching the stories of faculty, staff, and alumni as they carry out our mission here: http://www.apu.edu/stories/<br/><br/>Azusa Pacific University will conduct a background check on all final candidates.<br/><br/>Review of applications will begin immediately, and the position will remain open until filled unless otherwise stated. Azusa Pacific University does not discriminate on the basis of race, color, national origin, sex, age, disability, or status as a veteran in any of its policies, practices, or procedures. Women and minorities are encouraged to apply.<br/><br/><strong>Required Skills<br/><br/></strong>Required Experience", "responsibilities": "The Program Manager for the Department of Physical Therapy reports directly to the Department Chair, supervises student workers, contracts of adjunct faculty, and supports the overall functioning of the programs in the Department of Physical Therapy, supporting students, faculty, and the public.<br/><br/><ul><li>Serves as confidential assistant and administrative support to the Department Chair.</li><li>Serves as first contact and liaison with the department, students, university community and public</li><li>Oversees the essential day to day office functions: monitoring paperwork, answering email and the telephone, distributing office mail, maintaining office files, ordering office supplies, processing mailings and duplication.</li><li>Coordinates with university services such as catering, printing and binding, mailroom, room resources, information and media technology, facility and equipment requests, etc.</li><li>Coordinates meetings, and provides administrative support to the chair, program directors, and faculty of the department.</li><li>Maintains the program’s calendar of activities and coordinate faculty, student, and alumni engagement, including special events.</li><li>Create, maintain, and distribute promotional materials for events, bulletin boards, etc.</li><li>Prepares all paperwork and forms including adjunct contracts, faculty overloads, course materials, and other departmental documents.</li><li>Assists program directors of two graduate programs in the oversight and administration of programs.</li><li>Coordinates and submits course schedules and schedule changes in a timely manner to Registrar.</li><li>Manages correspondence with students and file management of student files, program forms, etc.</li><li>Manage graduate student employees and the assignment of their daily duties and coordinate their schedules for coverage of the department programs to support staff, faculty, and students. Oversee timely and accurate record-keeping, filing, and other clerical duties performed by student workers for the program.</li><li>Processes contracts and oversees timecards for adjunct faculty in Physical Therapy department.</li><li>Assists the chair in budget management for programs (e.g., track spending, credit card reconciliation).</li><li>With the Program Directors, oversees the service and maintenance of all program resources and equipment</li><li>Create and maintain meeting minutes and correspondence as directed.</li><li>Regular, punctual attendance as required by the supervisor based on department needs.</li><li>Performs other duties as assigned by the supervisor.</li><li>Review and post general ledger transactions for accuracy, timeliness and adequacy of supporting .</li><li>Responsible for daily electronic timekeeping as it applies to the scope of this position.</li><li>Regular, punctual attendance as required by the supervisor based on department needs.</li><li>Performs various related accounting duties as assigned by Accounting Operations manager.<br/><br/></li></ul>", "qualifications": {"required": "Master’s degree or equivalent education and experience.<br/><br/>Four years of experience in a client-based, service-oriented environment.Demonstrated ability to manage multiple complex priorities and systems.Worked well with team members across programs.Higher education experience preferred.<br/><br/>", "preferred": ""}, "skills": ["Interpersonal Skills", "Organizational Skills", "Attention to Detail", "Written Communication", "Verbal Communication", "Coordination", "Student Management", "Prioritization", "Accounting", "Budget Tracking", "Grant Management", "Software Proficiency", "Database Management", "Electronic Programs", "Social Media", "Website Development", "Website Maintenance", "Independent Judgment", "Multitasking", "Deadline Management", "Customer Service", "Christian Values", "Google Apps", "Microsoft Office", "Word", "Excel", "MS Powerpoint", "MS Publisher", "Gmail", "Macintosh OS", "PeopleSoft", "25Live", "Zoom", "Adobe Acrobat", "Dropbox Sign", "Canva", "Formstack"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "In addition to compensation, APU offers a competitive benefits package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979280982"}