{"jobTitle": "Senior Global Business Analyst", "company": {"name": "Crew Connectors", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Business Development and Sales", "industry": "Staffing and Recruiting", "description": "In a start-up, Day 01 environment, the Global Business Analyst will report directly to the VP of Transformation and Innovations, the Chief Strategy and Innovation Officer, and other key leaders. This role is crucial for the transformational growth and development of the company's innovation and excellence capability. The Global Business Analyst will accelerate the profitable growth of the businesses by collaborating with SBUs (Strategic Business Units)/Regional Teams to lead the development and validation of innovative new offerings. This role involves providing thought leadership, influence, and hands-on engagement to implement initiatives and innovation capability development throughout the company. The successful candidate will ensure alignment of existing programs within each SBU/Regional Team, provide overall guidance, and lead metrics and leadership toward a unified approach across the enterprise. Close partnership with each SBU is essential to achieve growth, innovation, and margin expansion goals.", "responsibilities": "Requirements Gathering and Analysis: Collaborate with stakeholders to understand and document project objectives, requirements, and success criteria. Conduct thorough analysis of existing business processes and systems, identifying areas for improvement and optimization. Solution Design: Work with cross-functional teams to design and propose effective and efficient solutions aligned with business goals. Create detailed documentation, including process flows, use cases, and functional specifications. Data Analysis: Analyze large datasets to extract meaningful insights and provide data-driven recommendations. Collaborate with the business intelligence team to develop and enhance reporting capabilities. Stakeholder Management: Build and maintain strong relationships with business users, IT teams, and executive leadership. Communicate project objectives, timelines, and deliverables effectively. Project Management: Develop and maintain project plans, including tasks, timelines, and resource requirements. Work with project managers to ensure successful project delivery within scope, time, and budget constraints. Testing and Quality Assurance: Develop and execute comprehensive test plans to ensure the quality of implemented solutions. Collaborate with testing teams to identify and address any issues during the testing phase. Training and Support: Provide training and support to end-users during the implementation phase. Address user concerns and ensure a smooth transition to new processes or systems. Continuous Improvement: Proactively identify opportunities for process improvement and optimization. Stay informed about industry trends and best practices to contribute to ongoing improvement initiatives.", "qualifications": {"required": "Not specified", "preferred": "10+ years of experience building and bringing innovative, tech-enabled solutions to market. Deep subject-matter knowledge in transformations, productization, consumer finance, and/or FinTech/FinServ. 10+ years of experience leading and managing teams, creating a high-performance, engaging work climate. Proven ability to inspire, coach, and influence direct reports, senior leaders, board members, and other staff. Experience as a spokesperson and thought leader on behalf of an organization. Excellent written, verbal, and interpersonal communication skills. Ability to quickly synthesize data and processes to help others make data-driven decisions. Proven experience as a Business Analyst with a focus on process improvement and project delivery. Strong analytical and problem-solving skills, with the ability to think critically and strategically. Proficiency in business analysis tools and methodologies. Project management skills and familiarity with project management tools. Knowledge of the industry and business domain. Leadership skills with the ability to guide and mentor junior analysts."}, "skills": ["Not specified"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3979924539"}