{"jobTitle": "Warehouse Associate (PT)", "company": {"name": "The Salvation Army", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Manufacturing", "industry": "Non-profit Organizations", "description": "About The Arc<br/><br/>The Salvation Army (TSA) Adult Rehabilitation Center (ARC) is a no-fee program to assist men &amp; women in their journey to complete our rehabilitation program. We are grateful for the contributions our valued employees make toward the maintenance and effectiveness of the programs. The organization is indebted to and dependent on the diligence and devotion of its employees.<br/><br/>About Our Production Team<br/><br/>Become part of the dedicated Production Team at The Salvation Army! Together we can continue to serve and impact our local community, through the commitment to “<strong><em>Do The Most Good</em></strong>” at our Canoga Park Distribution Center, which supports the Adult Rehabilitation Program. This is an opportunity to promote teamwork skills, while contributing to the success of our Program and its participants.<br/><br/>PAY RATE: $17.28 HOUR<br/><br/>Please apply directly at ARCWest.salvationarmy.org<br/><br/>Employee Benefits Offered<br/><br/><ul><li>Opportunity for career growth</li><li>Paid time off</li><li>Employee Discounts</li><li>Employee Referral Bonuses</li><li>Medical, Dental, and Vision</li><li>Retirement Plan</li><li>AFLAC</li><li>Great Work Perks</li><li>Employee Assistance Program (EAP)<br/><br/></li></ul>As our enthusiastic and hardworking WAREHOUSE ASSOCIATE, you will be responsible for (but not limited to): <br/><br/><ul><li>Sorting product efficiently and properly according to the standard of TSA policy.</li><li>Provide Quality Assurance by inspecting products for defects and damages.</li><li>Identify product correctly and direct to proper department for processing.</li><li>Collecting merchandise from the distribution center and safely transporting materials.</li><li>Follow safety measures established and maintained by TSA policy and government regulations.</li><li>Maintain confidentiality as needed and required for the operation of the total program.<br/><br/></li></ul>Qualifications To Be Considered For This Position<br/><br/><ul><li>High School diploma/GED preferred</li><li>Must pass background check, which will include Criminal History and Sex Offender Registry.</li><li>Ability to read and write and to understand and follow both written and verbal instructions.<br/><br/></li></ul>Physical Demands<br/><br/><ul><li>Ability to sit, walk, stand, bend, squat, climb, kneel, and twist on an intermittent or continuous basis.</li><li>Ability to grasp, push, pull objects such as files, file cabinet drawers, clothing carts, merchandise carts, rolling clothing racks, fixtures, furniture dollies, platform trucks and carts, hand trucks and miscellaneous carts.</li><li>Ability to move product up to 75lbs.</li><li>Ability to perform various repetitive motion tasks.</li><li>Must be able to perform duties with or without reasonable accommodation.<br/><br/></li></ul>Schedule <br/><br/>Our Distribution Center operate 5 days per week mostly Monday through Friday day shift. Warehouse Associates may be scheduled to work weekends and holidays.<br/><br/>About The Salvation Army<br/><br/>For more than 100 years, The Salvation Army’s Adult Rehabilitation Centers programs have offered spiritual, emotional, and social assistance to those who have lost the ability to cope with their problems and provide for themselves. Our no-cost programs provide housing, food, counseling, community, and employment as we work to treat the symptoms, and ultimately the root causes, of prolonged alcohol and drug dependence.", "responsibilities": "As our enthusiastic and hardworking WAREHOUSE ASSOCIATE, you will be responsible for (but not limited to): <br/><br/><ul><li>Sorting product efficiently and properly according to the standard of TSA policy.</li><li>Provide Quality Assurance by inspecting products for defects and damages.</li><li>Identify product correctly and direct to proper department for processing.</li><li>Collecting merchandise from the distribution center and safely transporting materials.</li><li>Follow safety measures established and maintained by TSA policy and government regulations.</li><li>Maintain confidentiality as needed and required for the operation of the total program.<br/><br/></li></ul>", "qualifications": {"required": "Must pass background check, which will include Criminal History and Sex Offender Registry.", "preferred": "High School diploma/GED preferred"}, "skills": [], "postedDate": "1 month ago", "benefits": "Employee Benefits Offered<br/><br/><ul><li>Opportunity for career growth</li><li>Paid time off</li><li>Employee Discounts</li><li>Employee Referral Bonuses</li><li>Medical, Dental, and Vision</li><li>Retirement Plan</li><li>AFLAC</li><li>Great Work Perks</li><li>Employee Assistance Program (EAP)<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3979777629"}