{"jobTitle": "Director, Brand & Product Marketing", "company": {"name": "Seed Beauty/ColourPop", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "The Director, Brand & Product Marketing leads the overall go-to-market strategy and process, including: defining product positioning and unique selling proposition, consumer messaging, content pillars, and campaign ideation + strategy. This leader is responsible for driving and managing the overarching brand marketing calendar to support the financial goals of the business and each channel leader. This person must be able to then drive the brand calendar, campaign strategy and story-telling, and key messaging throughout the organization – working cross-functionally with teams to ensure that each team’s plans are aligned with the central marketing strategy. This role oversees a Content Strategist and Product Marketing Manager.<br/><br/><strong>Your Opportunity:<br/><br/></strong><ul><li>Responsible for creating, with cross-functional collaboration, the annual Marketing Plan – consisting of new launches, pillar support plans, promotions, and tentpole moments to drive incremental revenue and gain increased market share across all brands and product categories</li><li>Leverage consumer, market, behavioral, channel and category trends to recommend new product innovations to leadership for development</li><li>Lead the development of innovative, insight-driven marketing campaigns + deliver to the activation team the strategy, stories, and plan for each program</li><li>Utilize consumer research and post-mortem reports to adjust marketing strategy and programming on a continual basis</li><li>Foster strong relationships with internal stakeholders to drive a culture of mutual accountability, collaboration and partnership</li><li>Quantify sales potential for new product innovations through a detailed launch sizing analysis using market data and share of market potential</li><li>Responsible for the execution of the Marketing Plan which consists of empowering their team to develop products and creative communication, then partner with cross-functional teams, such as Social, Influencer, Creative, and Sales, to develop successful 360 campaign activation plans for all key launches and animations</li><li>Develop a strong partnership with the Product Development team to formulate award-winning formulas, and enticing packaging, to excite and delight our consumers</li><li>Partner with Creative to develop powerful storytelling through impactful creative assets</li><li>Communicate launch plans and strategies to management and across the Organization; seek buy-in from leadership on key product marketing plans</li><li>Optimize the category assortment by identifying key opportunities for newness, top performing and low performing SKUs and franchises; develop action plan to optimize assortment<br/><br/></li></ul><strong>Your Attributes:<br/><br/></strong><ul><li>BA/BS; Master's degree a plus</li><li>7+years of experience in brand/ product marketing roles in color cosmetics</li><li>Experienceworking directly with C-Level Executives, Board of Directors, and/or Founders</li><li>Ability to synthesize market data and leverage insights to provide solutions</li><li>Collaborative leadership skills</li><li>Project management skills</li><li>Entrepreneurial mindset</li><li>Ability to handle multiple projects at one time</li><li>Quantitative data analysis skills</li><li>Experience leadingcross-functional teams, including project management (e.g. timeline / key milestone development)</li><li>Abilityto thrive in a fast-paced setting without ready-made processes</li><li>Must be able to commute to Sherman Oaks 3x/week<br/><br/></li></ul>The annual salary range for this position is $140k-$160k DOE. ColourPop offers a competitive benefits package including paid vacation time, health benefits, 401k + 100% match, paid holidays, and more.<br/><br/>Powered by JazzHR<br/><br/>OKuHJCejkA", "responsibilities": "The Director, Brand & Product Marketing leads the overall go-to-market strategy and process, including: defining product positioning and unique selling proposition, consumer messaging, content pillars, and campaign ideation + strategy. This leader is responsible for driving and managing the overarching brand marketing calendar to support the financial goals of the business and each channel leader. This person must be able to then drive the brand calendar, campaign strategy and story-telling, and key messaging throughout the organization – working cross-functionally with teams to ensure that each team’s plans are aligned with the central marketing strategy. This role oversees a Content Strategist and Product Marketing Manager.", "qualifications": {"required": "BA/BS; Master's degree a plus, 7+years of experience in brand/ product marketing roles in color cosmetics, Experienceworking directly with C-Level Executives, Board of Directors, and/or Founders, Ability to synthesize market data and leverage insights to provide solutions, Collaborative leadership skills, Project management skills, Entrepreneurial mindset, Ability to handle multiple projects at one time, Quantitative data analysis skills, Experience leadingcross-functional teams, including project management (e.g. timeline / key milestone development), Abilityto thrive in a fast-paced setting without ready-made processes, Must be able to commute to Sherman Oaks 3x/week", "preferred": ""}, "skills": ["Marketing", "Product Marketing", "Brand Management", "Go-to-Market Strategy", "Campaign Development", "Consumer Insights", "Market Research", "Cross-Functional Collaboration", "Project Management", "Leadership", "Entrepreneurship", "Data Analysis", "Team Management"], "postedDate": "1 month ago", "benefits": "ColourPop offers a competitive benefits package including paid vacation time, health benefits, 401k + 100% match, paid holidays, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980531987"}