{"jobTitle": "Logistics Specialist 3", "company": {"name": "Further Enterprise Solutions", "industry": "Telecommunications", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Telecommunications", "description": "Job Title: Business Professional - Logistics Specialist 3\nExpected duration: 12 months\nLocation:Santa Ana, CA, USA\nWork Schedule: Onsite\n\nTop Three Skills Listed: Data analysis, excel, problem solving\n\n**Education and years of experience: 1-2 years experience, bachelors degree\nJob Responsibilities:\n• Prepare weekly and monthly KPI for Risk Control to streamline SEA logistics operations Communicate with various teams on different KPI or issue points and work together to find solutions\n• Prepare quarterly MBO's for SEA operations teams, including performance forecasts on logistics cost and expenses\n• Analyze data and compare to the monthly, quarterly and yearly forecast to track cost fluctuations\n• Analyze data and models to predict the likely outcomes of business decisions and actions\n• Cross-functional team collaboration to create risk mitigation strategies\n• Support ad-hoc reports\n\nSkills and Qualifications:\n• Bachelor’s degree in Logistics, Supply Chain, Business, Finance or similar\n• Expertise with SAP and advanced Excel and Power Point skills\n• Strong analytical skills\n• Ability to manage and work effectively within cross-functional groups.\n• Ability to adapt quickly and be flexible in a dynamic environment\n• Experience using advanced supply chain management, enterprise planning or financial planning systems is highly desired. (SAP, etc.)\n• Should have advanced MS Excel and MS PowerPoint knowledge and skills.\n• Strong communication, both written (PPT presentations) and oral skills.\n• The ability to work either independently or in a team environment to achieve personal and team project goals, including the completion of assignments within and exceeding established time frames.\n\nSummary:\nThe main function of a logistics specialist is to coordinate and expedite the flow of work and materials within or between departments of an establishment according to production schedule. A typical logistics specialist is responsible for reviewing and distributing production, work and shipment schedules and compiling reports on inventory levels, cost, etc.", "responsibilities": "• Examine documents, materials and products, and monitor work processes in order to assess completeness, accuracy and conformation to standards and specifications.\n• Review documents such as production schedules, work orders, and staffing tables to determine personnel and materials requirements, and material priorities.\n• Record production data, including volume produced, consumption of raw materials, and quality control measures.\n• Requisition and maintain inventories of materials and supplies necessary to meet production demands.\n• Revise production schedule, when required, due to design changes, labor or material shortages or other interruptions.\n• Distribute production schedules and work orders to departments.", "qualifications": {"required": "Bachelor’s degree in Logistics, Supply Chain, Business, Finance or similar", "preferred": "1-2 years experience, expertise with SAP and advanced Excel and Power Point skills."}, "skills": ["Data analysis", "Excel", "Problem solving", "Strong analytical skills", "Communication skills", "Ability to manage and work effectively within cross-functional groups", "Ability to adapt quickly and be flexible in a dynamic environment"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3980257287"}