{"jobTitle": "Business Development Representative", "company": {"name": "PortPro ", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Company Overview: PortPro Technologies, Inc. is a leading innovator in the tech industry, recognized for our cutting-edge products and solutions that drive digital transformation in the logistics and transportation industry. As a company at the forefront of technological advancement, we are dedicated to empowering businesses with tools and insights to thrive in a digital-first world. Joining our team means you'll be at the heart of a progressive movement, working with a company that's committed not just to growth but to setting the technological standard in logistics and transportation. Position Summary: We are looking for a dynamic and driven Business Development Representative (BDR) to join our sales force at PortPro. The ideal candidate will have a hunter's mentality, ready to break open frontier territory and create opportunities for business expansion. Your primary role will be to generate leads, build relationships with potential clients, and lay the groundwork for transformative deals. If you're passionate about the business impact of great technology, love connecting with people, and have a talent for identifying business opportunities, we want you on our team. Key Responsibilities<br/><br/><ul><li>Research and identify new business opportunities among drayage carriers</li><li>Engage with potential clients through cold calling, emails, and social media platforms to generate new sales prospects</li><li> Develop and maintain strong, sustainable relationships with potential clients and industry professionals</li><li>Work closely with the sales and marketing team to create and implement strategies that will increase the company's customer base and market share</li><li>Conduct regular competitor analysis and stay informed on market trends to identify unique selling propositions and differentiators</li><li>Provide insights to product development teams based on feedback from potential and current customers</li><li>Track all sales activities in the company CRM system and keep current by updating account information regularly</li><li>Activity goal of 80 intentional calls per day<br/><br/><br/></li></ul>Qualifications<br/><br/><ul><li>Proven work experience as a Business Development Representative, Sales Account Executive, or similar role within the technology sector</li><li>Experience with CRM software (e.g., Salesforce) and the Google suite of products</li><li>Commitment to take full personal responsibility for your success, genuine curiosity and a passion for learning, and the ability to work collaboratively with others</li><li>Familiarity with different sales techniques and pipeline management</li><li>Strong communication, negotiation, and interpersonal skills, with the ability to build rapport at all organizational levels</li><li>Competent with time management and working in a remote environment<br/><br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Prior experience in a tech startup or fast-paced sales environment. Demonstrable track record of over-achieving quota and hitting sales targets</li><li>Understanding of sales performance metrics and the ability to interpret and leverage data to drive business strategies</li><li>Experience in selling SaaS products or technology solutions to businesses. Professional sales training or certifications would be a distinct advantage<br/><br/><br/></li></ul>Note: The responsibilities and duties listed above are indicative but not exhaustive. The need for flexibility is a prerequisite in a fast-evolving business environment, and this job description may evolve as the market landscape changes. We expect our team members to be adaptable and ready to take on challenges that may lie outside their primary skill set.", "jobFunction": "Sales and Business Development", "industry": "Truck Transportation", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3980482988"}