{"jobTitle": "Sr. Merchant", "company": {"name": "JustFab", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "JustFab is currently looking for a Sr. Merchant.<br/><br/>How Do You Fit In?<br/><br/>As the Sr. Merchant, you will oversee the overarching growth strategies for Justfab and Shoedazzle Footwear, Apparel, Handbags and Accessories departments, working closely with cross-functional partners in Site Merchandising, Planning, Design, Production, Marketing, etc. In addition, the Sr. Merchant is responsible for assorting categories and working closely with team to ensure seamless execution of category objectives, clear understanding of who our customer is and the competitive landscape.<br/><br/>This position will report to the Vice President of Merchandising & Design– JustFab & ShoeDazzle.<br/><br/>What You Will Do<br/><br/><ul><li>Drive category growth by developing departmental assortment strategies with respect to sub-category split, SKU Count, new vs. carryover, pricing, margin and retail pricing</li><li>Strategic thinking as it relates to long-term growth strategies for the division, making recommendations across departments and leveraging a diverse experience of departments, customer, and results</li><li>Spearhead strategy and execution alongside VP of Merchandising & Design with any future category/department expansion</li><li>Develop compelling merchandise assortments in partnership with design (utilize trend and competitive insights, build hindsights, develop SKU Plans, assortment lines)</li><li>Partner with planning to determine appropriate distortions and investment levels and manage GM, OTB, inventory receipts and GM%</li><li>Analyze sales in season and post-season (hindsight) to identify hits, misses and associated actions.</li><li>Utilize learnings to inform in season action and future season assortment</li><li>Partner with Creative, Marketing, Design, Production, Site Merchandising to ensure all assortment strategies (Design Themes, Color Stores, Key Investments, Product Focuses) are effectively communicated and cross functional strategies support department objectives</li><li>Foster growth and development of junior team members by creating a collaborative and innovative work environment<br/><br/></li></ul>What You Can Bring<br/><br/><ul><li>BA or BS preferred</li><li>7+ years of experience in Merchandising</li><li>Experience managing direct reports and ability to guide teams in executing a global strategy</li><li>Experience in the footwear, apparel, handbags, accessories categories</li><li>Excellent presentation and communication skills</li><li>Highly strategic thinker, ability to think creatively and analytically</li><li>Proficient in data analytics</li><li>Excellent prioritization and project management skills</li><li>Highly proficient in Microsoft Excel, Office, Word, PowerPoint</li><li>Must be willing/able to travel<br/><br/></li></ul>Compensation & Total Rewards<br/><br/>At JF, we believe work and life should fit together! We continue to build a culture of flexibility, to empower you to do your best and put yourself first. Our Total Rewards program rewards employees for their hard work, supporting their health, well-being, families, and ultimately their life journey. Total Rewards at JF includes: <br/><br/>  <br/><br/><ul><li>Hybrid Work Schedule*  </li><li>Discretionary Paid Time Off*  </li><li>Summer Fridays*  </li><li>Healthcare Plans  </li><li>Employee Discounts  </li><li>401k  </li><li>Annual Bonus Program  </li><li>Equity Program*  </li><li>And More  <br/><br/></li></ul>  <br/><br/><ul><li>Varied for retail and fulfillment roles <br/><br/></li></ul>  <br/><br/>The annual base salary range for this position is from $88,300-$120,000. The range provided includes the base salary that JF expects to pay for the role. Offered base salary will be dependent on factors including the scope and complexity of the role, candidate’s related work experience, subject matter expertise and work location. <br/><br/>About TechStyleOS<br/><br/>TechStyleOS is the globally integrated Operations and Services provider behind some of the fastest growing online fashion brands in history, including Fabletics, Savage X Fenty, JustFab, ShoeDazzle, and FabKids. With capabilities spanning technology, data science, supply chain management, fulfillment, customer service, and more, we help brands launch, scale and grow—across product categories and geographically. From predictive analytics to data-driven marketing and attribution, our unique approach is powered by our proprietary, end-to-end tech platform that enables the brands we serve to deliver a level of personalization, value, and satisfaction that are unrivaled in the fashion industry.<br/><br/>JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids) is an equal opportunity employer. We recruit, employ, compensate, develop, and promote regardless of race, national origin, religion, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, and other protected status as required by applicable. At JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids), we champion a vibrant workplace culture that thrives on diversity law and do not tolerate discrimination or harassment. We are one team from many backgrounds, innovating through diversity of individuals, who are driven by passion for creating an inclusive space for all. JustFab LLC, ShoeDazzle, LLC, Personal Retailing Inc. (d/b/a FabKids) will continue to champion a workplace culture that prizes diversity and inclusivity.<br/><br/>We encourage you to apply regardless of meeting all qualifications and/or requirements.<br/><br/>", "responsibilities": "<ul><li>Drive category growth by developing departmental assortment strategies with respect to sub-category split, SKU Count, new vs. carryover, pricing, margin and retail pricing</li><li>Strategic thinking as it relates to long-term growth strategies for the division, making recommendations across departments and leveraging a diverse experience of departments, customer, and results</li><li>Spearhead strategy and execution alongside VP of Merchandising & Design with any future category/department expansion</li><li>Develop compelling merchandise assortments in partnership with design (utilize trend and competitive insights, build hindsights, develop SKU Plans, assortment lines)</li><li>Partner with planning to determine appropriate distortions and investment levels and manage GM, OTB, inventory receipts and GM%</li><li>Analyze sales in season and post-season (hindsight) to identify hits, misses and associated actions.</li><li>Utilize learnings to inform in season action and future season assortment</li><li>Partner with Creative, Marketing, Design, Production, Site Merchandising to ensure all assortment strategies (Design Themes, Color Stores, Key Investments, Product Focuses) are effectively communicated and cross functional strategies support department objectives</li><li>Foster growth and development of junior team members by creating a collaborative and innovative work environment<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>BA or BS preferred</li><li>7+ years of experience in Merchandising</li><li>Experience managing direct reports and ability to guide teams in executing a global strategy</li><li>Experience in the footwear, apparel, handbags, accessories categories</li><li>Excellent presentation and communication skills</li><li>Highly strategic thinker, ability to think creatively and analytically</li><li>Proficient in data analytics</li><li>Excellent prioritization and project management skills</li><li>Highly proficient in Microsoft Excel, Office, Word, PowerPoint</li><li>Must be willing/able to travel<br/><br/></li></ul>", "preferred": ""}, "skills": ["Merchandising", "Data Analytics", "Microsoft Excel", "Project Management", "Communication", "Strategic Thinking", "Presentation Skills"], "postedDate": "1 week ago", "benefits": "<ul><li>Hybrid Work Schedule*  </li><li>Discretionary Paid Time Off*  </li><li>Summer Fridays*  </li><li>Healthcare Plans  </li><li>Employee Discounts  </li><li>401k  </li><li>Annual Bonus Program  </li><li>Equity Program*  </li><li>And More  <br/><br/></li></ul>  <br/><br/><ul><li>Varied for retail and fulfillment roles <br/><br/></li></ul>", "salary": {"amount": "88,300-$120,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980681117"}