{"jobTitle": "Sales Representative", "company": {"name": "McGraw Hill", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "40,000.00/yr - 92,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Education Administration Programs, E-Learning Providers, and Book and Periodical Publishing", "description": "<strong>Overview<br/><br/></strong><strong>Impact the Moment<br/><br/></strong>When was the last time you experienced the impact of your work? Our School Sales Representative (K12 Sales) team thrives on building meaningful relationships. With that comes the unique opportunity to impact lives in your designated territory and experience first-hand the difference your hard work makes.<br/><br/>As a <strong>Sales Representative</strong> (K-12 Sales), you’ll focus on selling Core and Personalized Curriculum and Technology Solutions to our K-12 customer base, focusing on both new and expansion business. The School Sales Representative position<strong> requires 50-75% sales territory daily travel and requires occasional overnight travel.<br/><br/></strong>Candidates <strong>must live</strong> <strong>in California in Kern or Tulare Counties </strong>to be considered for this position. If you’re curious and passionate about education - join us as we open doors. You’ll work in an enriching, collaborative environment where we create opportunities for learners and celebrate successes. Why? Because learning changes everything.<br/><br/><strong>Your impact on the team<br/><br/></strong>We’re looking for fresh, new approaches to serving our customers. In this role, you’ll be directly responsible for selling to and partnering with Educators, District and School Level Administrators (Superintendents, Chief Academic Officers, Curriculum &amp; Technology Leaders, Principals, and Teachers) focused on Solution Based Selling.<br/><br/><strong>What is this role about?<br/><br/></strong><ul><li>Attaining and surpassing sales goals, with the proven ability to develop and build customer relationships to maintain and expand market penetration.</li><li>Creating and executing marketing and strategic territory plans, with excellent organization and follow-through.</li><li>Conducting successful sales presentations and conducting and coordinating in-service presentations.</li><li>Understanding how the business makes money and demonstrating an ability to negotiate and manage resources based on corporate policy and profitability.</li><li>Using appropriate written and verbal communication skills internally and externally to facilitate a desired outcome.</li><li>Managing company resources, including the company-provided vehicle, company credit card, home office and computer equipment.<br/><br/></li></ul><strong>We’re looking for someone with…<br/><br/></strong><ul><li>Bachelor's degree required.</li><li>Sales experience in K-12 educational publishing or EdTech services is strongly preferred, although a strong understanding of the K-12 space as an educator or administrator is relative and of interest</li><li>Experience working with internal cross-functional teams including Product Development, Product Marketing and Platform Development.</li><li>A deep understanding of the use of technology in an educational instructional environment as it relates to educational infrastructures, such as platforms and curricula.</li><li>Evidence of being organized, territory management capabilities, and resolving issues and problems in a fast-paced environment.</li><li>Experience selling digital or Saas products preferred.</li><li>Microsoft software skills: Outlook and PowerPoint (basic), Word and Excel (intermediate).</li><li>Experience with a CRM database (we use Salesforce) is strongly preferred.</li><li>Organized, self-starter, with the desire to learn and collaborate.</li><li>Drive sales through creative and innovative solutions to meet the ever-changing needs of educators and students.</li><li>A valid driver’s license.</li><li>Ability to lift to up to 50 lbs.<br/><br/></li></ul>As this position requires traveling by car, <strong>we require candidates to have a valid driver’s license with the ability to drive a car in the designated territory</strong>.<br/><br/>The pay range for this position is between $40,000-$84,000 or $60,000-$92,000 annually. Pay range is based on candidate's location and base pay offered may vary depending on job-related knowledge, skills, and experience. An annual bonus plan is provided as part of the compensation package, in addition to a full range of medical and/or other benefits, depending on the position offered. Click here to learn more about our benefit offerings.<br/><br/>McGraw Hill recruiters always use a “@mheducation.com” email address and/or from our Applicant Tracking System, iCIMS. Any variation of this email domain should be considered suspicious. Additionally, McGraw Hill recruiters and authorized representatives will never request sensitive information in email.<br/><br/>47531", "responsibilities": "<ul><li>Attaining and surpassing sales goals, with the proven ability to develop and build customer relationships to maintain and expand market penetration.</li><li>Creating and executing marketing and strategic territory plans, with excellent organization and follow-through.</li><li>Conducting successful sales presentations and conducting and coordinating in-service presentations.</li><li>Understanding how the business makes money and demonstrating an ability to negotiate and manage resources based on corporate policy and profitability.</li><li>Using appropriate written and verbal communication skills internally and externally to facilitate a desired outcome.</li><li>Managing company resources, including the company-provided vehicle, company credit card, home office and computer equipment.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree required.", "preferred": "Sales experience in K-12 educational publishing or EdTech services is strongly preferred, although a strong understanding of the K-12 space as an educator or administrator is relative and of interest\nExperience working with internal cross-functional teams including Product Development, Product Marketing and Platform Development.\nA deep understanding of the use of technology in an educational instructional environment as it relates to educational infrastructures, such as platforms and curricula.\nEvidence of being organized, territory management capabilities, and resolving issues and problems in a fast-paced environment.\nExperience selling digital or Saas products preferred.\nMicrosoft software skills: Outlook and PowerPoint (basic), Word and Excel (intermediate).\nExperience with a CRM database (we use Salesforce) is strongly preferred.\nOrganized, self-starter, with the desire to learn and collaborate.\nDrive sales through creative and innovative solutions to meet the ever-changing needs of educators and students.\nA valid driver’s license.\nAbility to lift to up to 50 lbs.<br/><br/>"}, "skills": ["Sales", "K-12", "Education", "Technology", "Curriculum", "CRM", "Salesforce", "Microsoft Office", "Excel", "PowerPoint", "Outlook", "Communication", "Relationship Building", "Territory Management", "Problem Solving", "Organization", "Negotiation", "Time Management", "Customer Service", "Presentation Skills", "Product Knowledge", "Solution Selling", "Digital Sales", "SaaS", "EdTech", "Educational Publishing", "Driver's License"], "postedDate": "19 hours ago", "benefits": "An annual bonus plan is provided as part of the compensation package, in addition to a full range of medical and/or other benefits, depending on the position offered. Click here to learn more about our benefit offerings.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980922176"}