{"jobTitle": "Qualitative User Experience Researcher, Early Career 2024", "company": {"name": "Google", "location": "New York, NY", "industry": "Information Services and Technology, Information and Internet"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Mountain View, CA, USA; San Francisco, CA, USA; New York, NY, USA; Seattle, WA, USA**. **Minimum qualifications:**<br/><br/>  <ul>  <li>Bachelor’s degree in Human-Computer Interaction, Human Factors, Psychology, Computer Science, Cognitive Science, Information Science, Statistics, a related field, or equivalent practical experience.</li>  <li>Experience from an internship, work, or project with research design utilizing various methods including, usability studies, contextual inquiry, and surveys.<br/><br/></li>  </ul> **Preferred qualifications:**<br/><br/>  <ul>  <li>Master's degree or Phd in Human Factors, Psychology, Human Computer Interaction, Cognitive Science, Computer Science, Information Science, related field, or equivalent practical experience.</li>  <li>1 year of experience in User Experience, Human factors, Human-Computer Interaction, applied research settings, or product research and development.</li>  <li>Experience integrating qualitative findings with quantitative results to provide learning and recommendations.</li>  <li>Excellent communication, negotiation, and collaboration skills.<br/><br/></li>  </ul> **About The Job**<br/><br/> At Google, we follow a simple but vital premise: “Focus on the user and all else will follow.” User Experience Researchers (UXRs) make this possible.<br/><br/> Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers: we care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the needs, attitudes, emotions, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses.<br/><br/> As a User Experience Researcher (UXR), you’ll help your team of UXers, product managers, and engineers understand user needs. You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You’ll play a critical role in creating useful, usable, and delightful products. You’ll explore user behaviors and motivations by conducting primary research such as field studies, interviews, diary studies, participatory workshops, ethnography, surveys, usability testing, and logs analysis.<br/><br/> The UXR community at Google is unique and will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools.<br/><br/> User experience is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to gather insights that inform product strategy and design. Our UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and simplicity. We work on collaborative teams to solve complex challenges and craft experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”<br/><br/> **Responsibilities**<br/><br/>  <ul>  <li>Conduct research on multiple aspects of products and collect/analyze user behavior through lab studies, field visits, ethnography, surveys, benchmark studies, server logs, and online experiments.</li>  <li>Work cross-functionally with design, engineering, and product management teams to make data-driven decisions.</li>  <li>Design and conduct independent research using a variety of qualitative research methods, utilizing quantitative methods when necessary.</li>  <li>Ensure communication of research findings and advocate findings outside of the project team.<br/><br/><br/></li>  </ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "jobFunction": "Art/Creative, Design, and Engineering", "industry": "Information Services and Technology, Information and Internet", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3980058757"}