{"jobTitle": "Principal Product Manager, Growth Leads", "company": {"name": "Gusto", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "<strong>About Gusto<br/><br/></strong>Gusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 300,000 businesses nationwide.<br/><br/>Our mission is to create a world where work empowers a better life, and it starts right here at Gusto. That’s why we’re committed to building a collaborative and inclusive workplace, both physically and virtually. Learn more about our Total Rewards philosophy.<br/><br/><strong>About The Role<br/><br/></strong>We are looking for a dynamic and strategic Principal Product Manager to join our Growth team. In this role, you'll be at the helm of defining our strategic roadmap, aligning long-term visions with actionable plans. Your decisions will shape the direction of our growth trajectory, positioning us for success in the ever-evolving market landscape.<br/><br/><strong>About The Team<br/><br/></strong>You’ll be working with an established team and seasoned Growth leaders across Marketing, Design, and Engineering teams to maximize visitors to Gusto and convert those visitors into sign ups across multiple acquisition channels. You will drive the strategy and execution of initiatives that grow our user base and enhance our market presence.<br/><br/><strong>Here’s What You’ll Do Day-to-day<br/><br/></strong><ul><li>Develop a deep understanding of the customer’s lifecycle and develop and implement a comprehensive acquisition strategy to drive traffic and sign-ups across various channels, including SEO, SEM, social media, email marketing, and partnerships.</li><li>Partner with Engineering, Design, Data Science (EPDD) and Marketing to solve complex cross-functional opportunities related to growing product adoption.</li><ul><li>Set goals and strategy for your domain then translate it into a roadmap, milestones, and requirements. Collaboratively to drive alignment and excitement with your cross-functional partners and stakeholders.</li><li>Analyze data and user feedback to identify trends, insights, and opportunities for growth.</li><li>Conduct A/B testing and other experiments to continuously improve acquisition efforts.</li><li>Monitor and report on key performance metrics, making data-driven decisions to optimize performance.</li></ul><li>Own Gusto.com and underlying technology platforms required for continuous updates and experimentation.</li><li>Drive the product development process from concept to launch, ensuring timely delivery of high-quality products that delight customers and result in significant and measurable business impact. </li><li>Stay current with industry trends, competitive landscape, and best practices in acquisition and growth marketing.<br/></li></ul><strong>Here’s What We're Looking For<br/><br/></strong><ul><li>8+ years of product management experience driving product adoption and business growth.</li><li>Strategic Leadership: Define clear roadmap, align long-term strategies, thinking broadly beyond signups, consider top-of-funnel strategies and downstream impact.</li><li>Cross-functional Collaboration: Lead across departments, including EPD, Revenue, Marketing and Sales while valuing team input, cultivate an environment where opinions matter.</li><li>Data and Hypothesis-Driven: You know how to expertly leverage qualitative and quantitative data to develop and execute experiments and A/B tests that are optimized for learning. You can measure the business impact of your work and tie it back to company goals.</li><li>Systems and Infrastructure Thinking: You enjoy complex challenges and navigate them deftly. You have a wealth of frameworks and mental models that you rely on to unpack problems and arrive at elegant solutions.</li><li>Objective Learning: You get more excited when you’re wrong than when you’re right. You optimize for learning, and love peeling back the layers. Your favorite questions are “why” and “why not”.</li><li>Passion: You love the problems Gusto’s solving for business owners and their employees, and you’re excited to continuously solve them better and better.</li><li>Marketing: Deep familiarity of demand generation marketing practices. Experience leading demand generation in a marketing role is a plus but not a requirement.<br/><br/></li></ul>Our cash compensation amount for this role is targeted at $181,000 to $223,000 in Denver &amp; most major metro locations, and $212,000 to $262,000 for San Francisco, New York, &amp; Seattle. Final offer amounts are determined by multiple factors including candidate location, experience and expertise and may vary from the amounts listed above.<br/><br/>Gusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately <strong>2-3 days </strong>per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto's subsidiary, whose physical office is in Scottsdale.<br/><br/>Note: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.<br/><br/>When approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.<br/><br/>Our customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.<br/><br/>Gusto is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Gusto considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Gusto is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you require assistance in filling out a Gusto job application, please reach out to candidate-accommodations@gusto.com.", "responsibilities": "<ul><li>Develop a deep understanding of the customer’s lifecycle and develop and implement a comprehensive acquisition strategy to drive traffic and sign-ups across various channels, including SEO, SEM, social media, email marketing, and partnerships.</li><li>Partner with Engineering, Design, Data Science (EPDD) and Marketing to solve complex cross-functional opportunities related to growing product adoption.</li><ul><li>Set goals and strategy for your domain then translate it into a roadmap, milestones, and requirements. Collaboratively to drive alignment and excitement with your cross-functional partners and stakeholders.</li><li>Analyze data and user feedback to identify trends, insights, and opportunities for growth.</li><li>Conduct A/B testing and other experiments to continuously improve acquisition efforts.</li><li>Monitor and report on key performance metrics, making data-driven decisions to optimize performance.</li></ul><li>Own Gusto.com and underlying technology platforms required for continuous updates and experimentation.</li><li>Drive the product development process from concept to launch, ensuring timely delivery of high-quality products that delight customers and result in significant and measurable business impact. </li><li>Stay current with industry trends, competitive landscape, and best practices in acquisition and growth marketing.<br/></li></ul>", "qualifications": {"required": "8+ years of product management experience driving product adoption and business growth.", "preferred": "Strategic Leadership: Define clear roadmap, align long-term strategies, thinking broadly beyond signups, consider top-of-funnel strategies and downstream impact.\nCross-functional Collaboration: Lead across departments, including EPD, Revenue, Marketing and Sales while valuing team input, cultivate an environment where opinions matter.\nData and Hypothesis-Driven: You know how to expertly leverage qualitative and quantitative data to develop and execute experiments and A/B tests that are optimized for learning. You can measure the business impact of your work and tie it back to company goals.\nSystems and Infrastructure Thinking: You enjoy complex challenges and navigate them deftly. You have a wealth of frameworks and mental models that you rely on to unpack problems and arrive at elegant solutions.\nObjective Learning: You get more excited when you’re wrong than when you’re right. You optimize for learning, and love peeling back the layers. Your favorite questions are “why” and “why not”.\nPassion: You love the problems Gusto’s solving for business owners and their employees, and you’re excited to continuously solve them better and better.\nMarketing: Deep familiarity of demand generation marketing practices. Experience leading demand generation in a marketing role is a plus but not a requirement."}, "skills": ["Product Management", "Business Growth", "Strategic Leadership", "Cross-functional Collaboration", "Data Analysis", "A/B Testing", "Experimentation", "Systems Thinking", "Infrastructure Thinking", "Objective Learning", "Demand Generation Marketing"], "postedDate": "1 week ago", "benefits": "Our cash compensation amount for this role is targeted at $181,000 to $223,000 in Denver &amp; most major metro locations, and $212,000 to $262,000 for San Francisco, New York, &amp; Seattle. Final offer amounts are determined by multiple factors including candidate location, experience and expertise and may vary from the amounts listed above.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980589110"}