{"jobTitle": "Chief Executive Officer - USA", "company": {"name": "Edenspiekermann", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Analyst and Finance", "industry": "Software Development", "description": "Your mission<br/><br/><ul><li>Drive US Market Growth: Lead the development and execution of a strategic business development plan for the US market, focusing on leveraging design consultancy and technology-driven solutions to win new business.</li><li>Secure Revenue &amp; Manage Pipeline: Manage the entire sales process, from lead generation and qualification to successful deal closure, to achieve ambitious annual new business revenue targets and ensure a robust sales pipeline to fuel consistent revenue growth.</li><li>Build Strategic Partnerships: Cultivate strong relationships with key clients to expand Edenspiekermann’s market presence and enhance our service offerings.</li><li>Champion Collaboration &amp; Growth: Foster close collaboration with the leadership team in Germany to align on business growth initiatives and provide strategic support.</li><li>Elevate Brand &amp; Thought Leadership: Contribute to marketing strategies and actively participate in thought leadership activities to increase brand awareness and demonstrate Edenspiekermann’s value proposition in the US market.<br/><br/></li></ul>Your profile<br/><br/><ul><li>Must have: Several years of recent experience as a sales manager in a design consultancy, digital agency or as custom software development partner</li><li>Extensive knowledge of the US market and the digital industry</li><li>Strong sales and leadership skills</li><li>Strong communication skills and persuasiveness</li><li>Excellent negotiation and presentation skills</li><li>Strong strategic thinking and leadership skills, with the ability to inspire and mobilize teams</li><li>Eager to engage in consultative sales of new services, with a proven track record of exceeding targets</li><li>Intercultural competence and experience in working with international teams</li><li>English language skills at native speaker level</li><li>US citizenship</li><li>Based in Los Angeles, San Francisco or New York City<br/><br/></li></ul>Why us?<br/><br/><ul><li>Unplug and Recharge: 11 Paid Holidays + Generous Time Off: Because you deserve a break. We offer a minimum of 20 vacation days.</li><li>Healthy You, Happy You: We've got you covered with medical, dental, and vision plans to keep you feeling your best.</li><li>Work-Life Harmony: Hybrid Hustle: Strike the perfect balance with our hybrid work model. Enjoy 2 days of in-office collaboration and 3 days of working from home.</li><li>Commute with Confidence: We offer commuter benefits to ease the financial burden (and stress) of getting to the office.</li><li>Bonus Potential: Sales &amp; Biz Dev Rockstars Only: If you crush your goals, you'll be rewarded with an incentive bonus program!<br/><br/></li></ul><strong>About Us<br/><br/></strong><strong>Who we are <br/><br/></strong>As an ambitious design consultancy we collaborate with our clients and see our work together as a partnership. We aim for high quality standards while staying humble. We are unconventional. Sometimes a detour is the fastest way to the goal. We are constantly striving to improve. We leave our comfort zones and grow together as a team and individuals because we support each other. And also we have a lot of fun together and give everyone the chance to contribute to our vibrant team culture. Everyone’s input is valid and appreciated.<br/><br/><strong>How We Work<br/><br/></strong>Our interaction designers work in agile and interdisciplinary teams on websites and platforms for major brands as well as for startups. Our teams combine conceptual thinking, a sophisticated understanding of design and a deep knowledge of web and app development to develop a digital product or service with a user-centric approach. In doing so, we advise and coach our clients' teams to provide the best customer experience for their customers.<br/><br/><strong>We’re looking forward to hearing from you!<br/><br/></strong>One more thing, never fear to apply initiative. We understand: a lack of confidence can sometimes keep us from applying for a job. But guess what?! There is no such thing as the perfect applicant. That's why we encourage you to apply to us.", "postedDate": "1 month ago", "benefits": "Unplug and Recharge: 11 Paid Holidays + Generous Time Off: Because you deserve a break. We offer a minimum of 20 vacation days.\nHealthy You, Happy You: We've got you covered with medical, dental, and vision plans to keep you feeling your best.\nWork-Life Harmony: Hybrid Hustle: Strike the perfect balance with our hybrid work model. Enjoy 2 days of in-office collaboration and 3 days of working from home.\nCommute with Confidence: We offer commuter benefits to ease the financial burden (and stress) of getting to the office.\nBonus Potential: Sales &amp; Biz Dev Rockstars Only: If you crush your goals, you'll be rewarded with an incentive bonus program!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3980195324"}