{"jobTitle": "Store Manager - Santa Monica", "company": {"name": "Pandora", "industry": "Retail Luxury Goods and Jewelry", "size": "27,000 employees", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$36.00/hr - $41.50/hr", "currency": "USD"}, "jobFunction": "Sales, General Business, and Customer Service", "industry": "Retail Luxury Goods and Jewelry", "description": "As the largest jewellery brand in the world, we give a voice to millions of people’s loves every day. Our beautiful products empower people all around the world to express themselves. We are proud to be part of their stories and the most important moments in their lives. Where original thinking is welcomed, and can turn into positive impact in a heartbeat, we can dream big, dare to act, and deliver with care and passion. At Pandora you can each craft far more than just an incredible career. The Store Manager will be the ultimate Pandora Fan. As the Store Manager, you will fully immerse yourself in our brand, culture, product whilst taking immense pride in delivering exceptional customer experiences. This role offers the exciting opportunity to spend quality time on the sales floor, engaging with customers and working alongside your team to drive sales. As the Store Manager, you will coach and manage a team of Assistant Store Manager, Sales Leads and Sales Associates.", "responsibilities": "Embrace the store culture filled with passion for our brand, where team members shine as extraordinary brand ambassadors. Dare to exceed individual and store sales goals by building a genuine connection with our fans. Embrace the opportunities and soar beyond commercial targets and key performance indicators (KPIs) expectations, setting new records and achieving remarkable success. Create unforgettable shopping moments that exceed expectations, by displaying excellent product knowledge and building brand loyalty. Dream to coach and inspire the sales team, fostering accountability for individual and the store performance. Provide real-time feedback and guidance to empower the team in achieving their KPI goals. Craft loyal fans by authentically engaging and fostering lasting connections beyond transactions. Build your network and inspire to bring the best talent into Pandora across seasonal and core hiring including Assistant Store Manager, Sales Associates and Sales Leads. Partner with the Divisional Sales Manager and Human Resource team to identify and resolve any performance issues and policy violations. Utilize your brilliance across talent, brand, operations, and fan experience, guaranteeing the timely implementation of visual merchandising directives, efficient operational processes, and continuous talent development. All other duties as assigned.", "qualifications": {"required": "You can demonstrate you’re a results-orientated leader with at least 3-5 years of experience as a Store Manager in a high-performance selling environment. You have developed a sense of Care in your communication skills both written and verbal. You know how to charm and captivate an audience with the ability to connect with people at all levels of the organization. Your business acumen is sharper than a diamond, coupled with your analytical thinking that can show and deliver positive results. You're a talent magnet, skilled in recruiting, retaining, and developing exceptional teams. Succession planning and internal mobility. Knowledge of general computer software (Microsoft Office 365 Suite) and retail point of sale systems. You are at least 18 years or older and can provide proof of identity and eligibility to work. Dream and embrace adventure! A flexible work schedule that includes nights, weekends, and holidays is all part of the excitement. This can include standing for extended periods, ability to lift 50+ pounds and timely arrival to work.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "We Dare! We offer robust compensation package including base + bonus’s, a 401K plan to help you secure your financial future. We Care! Pandora offers extensive benefits including: Medical, Dental, Vision, Short/Long Term Disability, Basic Life and AD&D, anniversary gift cards and product discounts! We Dream! Pandora is fostering growth and crafting opportunities to support the business needs which learning and development programs, continuous feedback, LinkedIn learning, tuition reimbursement and more. We Deliver! PTO Package including: Vacation, Personal, Sick, Birthday, Celebration days and Paid Holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980667882"}