{"jobTitle": "Design Consultant", "company": {"name": "Bassett Furniture Industries, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 135,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Furniture and Home Furnishings Manufacturing", "description": "<strong>Bassett Furniture – Design Sales Opportunity <br/><br/></strong>Do you love interior design? Do you have an eye for color and fashion?<br/><br/>Would you like to help customers see their dream rooms become a reality?<br/><br/>If you are a positive and motivated professional with a passion for design, possess exceptional selling skills, and a love for building customer relationships, then Bassett Furniture has the opportunity for you!<br/><br/><strong>Job Description<br/><br/></strong>Our Bassett Design Consultants are responsible for building meaningful and long-term customer relationships. They have comprehensive knowledge ranging from furniture construction to design trends. They use “relationship selling” techniques through interior design consultations and makeovers to maximize selling opportunities. Our design consultants take joy in the design process!<br/><br/><strong>Job Qualifications<br/><br/></strong><ul><li> Passion for design</li><li> Highly driven to meet or exceed sales goals</li><li> Discern and coordinate colors and textures</li><li> Excellent communication and interpersonal skills</li><li> Friendly outgoing personality</li><li> Positive outlook</li><li> Self-motivated to clientele</li><li> Computer proficiency</li><li> Desire to learn</li><li> Proven track record of success in sales</li><li> Polished image</li><li> Career-minded professionalism</li><li> Ability to listen and translate customer wants into design choices<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li> Willingness to work weekends and holidays.</li><li> Desire to work in a commissioned sales environment.</li><li> Dedicated to being a supportive team member.</li><li> Capable of thriving in a varied paced retail environment.</li><li> Ability to drive to customers’ residences and businesses for makeovers.</li><li> Adept at conducting virtual appointments and live chats.</li><li> Creating, presenting, and selling product and design solutions.</li><li> Engaging customers to determine their needs according to taste, lifestyle, and investment range.<br/><br/></li></ul><strong> Training <br/><br/></strong>The Bassett Brand is brought to life by the people who shape the customers’ experience. Our training programs are designed to help each associate create a meaningful career at Bassett.<br/><br/>As part of our in-depth training program, you’ll learn: product knowledge, sales techniques, design skills, and how to build a base of loyal clients. You’ll do this though comprehensive on-line classes, videos, hands-on activities, and one-on-one coaching. We provide continuing opportunities to learn throughout your career at Bassett.<br/><br/>Our most successful sales people have a creative personality and passion for design. Bassett offers Interior Design certification training. Through our one-on-one coaching and educational development, we will help you build relationships with customers to help them reflect their own personal sense of style. We’ll also show you how to effectively use our complimentary design service as a powerful tool for developing customer relationships and providing opportunity for increased sales.<br/><br/><strong> Opportunity <br/><br/></strong>With our generous commission-based compensation plan, your income is limited only by the amount of effort you apply. In addition to your commission compensation (paid on written business), there are other bonus opportunities. The potential income for our experienced Bassett Design Consultants averages $70,000-$105,000/year. With our corporate top writers making up to $135,000/year.<br/><br/><strong>Benefits<br/><br/></strong><ul><li> Paid training</li><li> Health/Dental/Vision coverage</li><li> Disability</li><li> Life Insurance</li><li> 401(k) plan</li><li> Tuition assistance</li><li> Paid time off</li><li> Generous Employee Discounts</li><li> Work in a State-of-the Art Showroom</li><li> Opportunity for growth and advancement<br/><br/></li></ul><strong> What sets Bassett apart? <br/><br/></strong>Bassett’s blend of style, comfort and value has been trusted for more than a century (since 1902!) and makes it one of the most recognizable furniture brands in America. We’ve taken our craftsmanship and built a reputation of quality custom furniture. We are passionate about developing fashionable and innovative furnishings at a great value, as well as offering a number of exceptional services to meet customers’ needs. We are proud of our long-standing heritage but, at the same time, squarely focused on innovating furniture retailing in the next 100 years.<br/><br/>Take steps now towards building a meaningful career with a growing company. Apply to join the design team at Bassett today!<br/><br/><em> Bassett Furniture Industries is an equal opportunity and affirmative action employer and does not discriminate against any applicant for employment because of race, color, religion, sex, national origin, disability, age, veterans status or other protected category. Bassett is dedicated to ensuring that qualified applicants are employed and that employees are treated consistently during employment, without regard to their race, color, religion, sex, national origin, disability, age, veterans status or other protected category. <br/><br/></em><em> EEO/AA-M/F/V/D <br/><br/></em><em> IND1 #ZR # </em> LI-RS1", "responsibilities": "Our Bassett Design Consultants are responsible for building meaningful and long-term customer relationships. They have comprehensive knowledge ranging from furniture construction to design trends. They use “relationship selling” techniques through interior design consultations and makeovers to maximize selling opportunities. Our design consultants take joy in the design process!", "qualifications": {"required": "Passion for design, Highly driven to meet or exceed sales goals, Discern and coordinate colors and textures, Excellent communication and interpersonal skills, Friendly outgoing personality, Positive outlook, Self-motivated to clientele, Computer proficiency, Desire to learn, Proven track record of success in sales, Polished image, Career-minded professionalism, Ability to listen and translate customer wants into design choices", "preferred": "Willingness to work weekends and holidays, Desire to work in a commissioned sales environment, Dedicated to being a supportive team member, Capable of thriving in a varied paced retail environment, Ability to drive to customers’ residences and businesses for makeovers, Adept at conducting virtual appointments and live chats, Creating, presenting, and selling product and design solutions, Engaging customers to determine their needs according to taste, lifestyle, and investment range"}, "skills": ["Interior Design", "Sales", "Customer Service", "Communication", "Design", "Relationship Building", "Product Knowledge", "Fashion", "Color Coordination", "Texture Coordination"], "postedDate": "1 week ago", "benefits": "<ul><li> Paid training</li><li> Health/Dental/Vision coverage</li><li> Disability</li><li> Life Insurance</li><li> 401(k) plan</li><li> Tuition assistance</li><li> Paid time off</li><li> Generous Employee Discounts</li><li> Work in a State-of-the Art Showroom</li><li> Opportunity for growth and advancement<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980697269"}