{"jobTitle": "Regional Director of Sales - Western US", "company": {"name": "ePac Flexible Packaging", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$120,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "ePac Flexible Packaging has locations across the United States, Canada, Europe, Africa, Southeast Asia, and Australia. Built on break-through digital printing, ePac is at the crossroads of advanced technology and manufacturing. ePac’s mission is to provide consumer packaged goods companies the ability to compete with large brands with great packaging. Our customers are predominantly small and medium-sized CPGs, many of whom are focused on creating natural and innovative products for their consumers. Since opening our first manufacturing facility in 2016, our mission has been clear – to help small brands obtain big brand presence, give back to the communities we serve and contribute to the creation of a more sustainable, circular economy.<br/><br/><strong>ePac Flexibles offers a generous benefits package that includes:<br/><br/></strong><ul><li>3 Medical Options</li><li>Dental</li><li>Vision</li><li>Employer paid Short and Long term disability</li><li>401K with employer match</li><li>120 hours Paid Time off</li><li>10 paid holidays</li><li>and more!<br/><br/></li></ul>The salary range for this full-time position ranges from $120,000 - $130,000 base depending on skills and experience.<br/><br/><strong>Summary Of Position<br/><br/></strong>The Regional Director of Sales (West) will report to the Head of Sales. This position will be responsible for leading ePac’s Regional Sales Executives and Account Managers, focused on the small to medium sized customer segments throughout the Western United States. This role is crucial in ensuring ePac’s West Region is exceeding sales goals while providing the highest level of customer service in the flexible packaging industry. A high level of proficiency within Salesforce CRM is an integral function of this role. This role will provide key reports and frequent updates for the Director of Revenue Operations and Executive team. This role will drive communication and core initiatives across the Western region.<br/><br/><strong>Essential Functions And Responsibilities<br/><br/></strong><ul><li>Sales Leadership. Provide strategic direction and leadership to a team of 12+ sales representatives throughout the Western United States, fostering a culture of accountability and achievement. Motivate and inspire team members to meet and exceed sales targets. . Frequent travel for customer meetings and sales activities. Will hold weekly one on ones and conduct monthly business reviews</li><li>Salesforce CRM Management: Oversee the use and adoption of Salesforce CRM &amp; CRM Analytics. Utilize reports and dashboards to measure performance, deliver forecasts, and ensure standards compliance. Conduct weekly reviews with salespeople using salesforce data. Audit and enforce proper utilization of salesforce within the sales team. Monitor key performance indicators (KPIs) and track sales metrics to inform strategic decisions</li><li>Sales Support: Build better communication between Sales Support Personnel, Pre-press Personnel and the Sales team, including troubleshooting issues, coordinating with other departments, and ensuring that all relevant parties have the tools and resources they need to succeed</li><li>Training and Development: Develop and deliver training programs in collaboration with the Head of Training and Director of Sales Operations for new and existing sales team members. Foster a culture of continuous learning and improvement. Provide one-on-one coaching and mentorship to support professional growth and performance improvement</li><li>Sales Strategy Implementation: Assist in the development and execution of sales strategies and initiatives. Align sales operations with overall business objectives and ensure the team is working towards common goals. Analyze sales data to identify trends, opportunities, and areas for improvement. Use data-driven insights to develop strategies that drive sales growth and improve customer satisfaction</li><li>Customer Relationship Management: Support the sales team in managing customer relationships, resolving issues, and ensuring high levels of customer satisfaction. Work closely with the Sales Support Personnel to maintain strong customer communication and service</li><li>Forecasting and Planning: Drive all regional sales forecasting and planning activities</li><li>Accountability: Will execute upon strategic objectives and enforce KPIs, as provided by the Head of Sales<br/><br/></li></ul><strong>JOB KNOWLEDGE, SKILLS &amp; ABILITIES<br/><br/></strong><ul><li>Market and industry knowledge - Possess a deep understanding of the market and industry - knowledge of competitors, market trends, customer needs, and emerging opportunities</li><li>Leadership and team management - Possess exceptional leadership skills with ability to motivate and inspire the sales team, set clear goals and expectations, and provide guidance and support. This includes coaching / training and having the ability to simplify complex matters in a manner for all team members to understand visions. Must also be able to work alongside operations team to find and drive efficiencies across the Region</li><li>Excellent communication skills: Must have ability to communicate effectively with internal teams, communicate sales targets and objectives, and build relationships with clients and stakeholders</li><li>Strong analytical, organizational and problem-solving skills: Must possess the ability to analyze sales data, identify trends, and make data-driven decisions. Ability to identify and address potential issues or challenges that may arise in the sales process. A proactive approach to problem solving, aiming to prevent issues rather than simply cure problems after they occur is a must. In addition - a disciplined, structured approach to work, demonstrating organizational skills in planning, documenting, and keeping to agreed schedules, combined with the ability to respond to evolving objectives and work in an agile delivery environment is necessary for success</li><li>Customer relationship management: Building and maintaining strong relationships with clients is vital for success. This involves understanding customer needs, providing exceptional customer service, and developing strategies to enhance customer satisfaction and loyalty</li><li>Negotiation and closing skills - Must possess excellent negotiation skills and be able to close deals effectively. This includes the ability to identify and address customer objections, negotiate pricing and terms, and secure profitable contracts</li><li>Technology proficiency: Must be proficient in using sales software, CRM systems, and other tools to streamline sales processes, track performance, and analyze data</li><li>Adaptability and resilience: Must be able to adapt to changing market conditions, overcome obstacles, and remain resilient in the face of setbacks<br/><br/></li></ul><strong>EXPERIENCE AND EDUCATION<br/><br/></strong><ul><li>Bachelor's degree in Business, Sales, Marketing, or a related field</li><li>Flexible packaging experience required</li><li>10+ years of sales leadership experience required</li><li>Has managed teams exceeding 10 people</li><li>Has managed at least $50M in annual revenue</li><li>Proficiency in Salesforce CRM is required</li><li>Strong analytical skills and experience with sales analytics and reporting</li><li>Excellent communication and interpersonal skills</li><li>Ability to work independently and manage multiple priorities in a fast-paced environment</li><li>Strong problem-solving skills and attention to detail</li><li>Experience working with small to medium-sized businesses is preferred<br/><br/></li></ul><strong>WORK ENVIRONMENT<br/><br/></strong><ul><li>A remote office or home setting with frequent travel over 25% to facilities and meetings<br/><br/></li></ul><strong>Other<br/><br/></strong>This job description is not intended to be all inclusive, and employees will also perform other reasonable related business duties as assigned by management. The company reserves the right to revise or change job duties as needed. This job description does not constitute a written or implied contract of employment.<br/><br/>ePac is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. EEO Poster<br/><br/>Powered by JazzHR<br/><br/>Xd1L25ay3w", "responsibilities": "The Regional Director of Sales (West) will report to the Head of Sales. This position will be responsible for leading ePac’s Regional Sales Executives and Account Managers, focused on the small to medium sized customer segments throughout the Western United States. This role is crucial in ensuring ePac’s West Region is exceeding sales goals while providing the highest level of customer service in the flexible packaging industry. A high level of proficiency within Salesforce CRM is an integral function of this role. This role will provide key reports and frequent updates for the Director of Revenue Operations and Executive team. This role will drive communication and core initiatives across the Western region.<br/><br/><strong>Essential Functions And Responsibilities<br/><br/></strong><ul><li>Sales Leadership. Provide strategic direction and leadership to a team of 12+ sales representatives throughout the Western United States, fostering a culture of accountability and achievement. Motivate and inspire team members to meet and exceed sales targets. . Frequent travel for customer meetings and sales activities. Will hold weekly one on ones and conduct monthly business reviews</li><li>Salesforce CRM Management: Oversee the use and adoption of Salesforce CRM &amp; CRM Analytics. Utilize reports and dashboards to measure performance, deliver forecasts, and ensure standards compliance. Conduct weekly reviews with salespeople using salesforce data. Audit and enforce proper utilization of salesforce within the sales team. Monitor key performance indicators (KPIs) and track sales metrics to inform strategic decisions</li><li>Sales Support: Build better communication between Sales Support Personnel, Pre-press Personnel and the Sales team, including troubleshooting issues, coordinating with other departments, and ensuring that all relevant parties have the tools and resources they need to succeed</li><li>Training and Development: Develop and deliver training programs in collaboration with the Head of Training and Director of Sales Operations for new and existing sales team members. Foster a culture of continuous learning and improvement. Provide one-on-one coaching and mentorship to support professional growth and performance improvement</li><li>Sales Strategy Implementation: Assist in the development and execution of sales strategies and initiatives. Align sales operations with overall business objectives and ensure the team is working towards common goals. Analyze sales data to identify trends, opportunities, and areas for improvement. Use data-driven insights to develop strategies that drive sales growth and improve customer satisfaction</li><li>Customer Relationship Management: Support the sales team in managing customer relationships, resolving issues, and ensuring high levels of customer satisfaction. Work closely with the Sales Support Personnel to maintain strong customer communication and service</li><li>Forecasting and Planning: Drive all regional sales forecasting and planning activities</li><li>Accountability: Will execute upon strategic objectives and enforce KPIs, as provided by the Head of Sales<br/><br/></li></ul>", "qualifications": {"required": "Market and industry knowledge - Possess a deep understanding of the market and industry - knowledge of competitors, market trends, customer needs, and emerging opportunities<br/>Leadership and team management - Possess exceptional leadership skills with ability to motivate and inspire the sales team, set clear goals and expectations, and provide guidance and support. This includes coaching / training and having the ability to simplify complex matters in a manner for all team members to understand visions. Must also be able to work alongside operations team to find and drive efficiencies across the Region<br/>Excellent communication skills: Must have ability to communicate effectively with internal teams, communicate sales targets and objectives, and build relationships with clients and stakeholders<br/>Strong analytical, organizational and problem-solving skills: Must possess the ability to analyze sales data, identify trends, and make data-driven decisions. Ability to identify and address potential issues or challenges that may arise in the sales process. A proactive approach to problem solving, aiming to prevent issues rather than simply cure problems after they occur is a must. In addition - a disciplined, structured approach to work, demonstrating organizational skills in planning, documenting, and keeping to agreed schedules, combined with the ability to respond to evolving objectives and work in an agile delivery environment is necessary for success<br/>Customer relationship management: Building and maintaining strong relationships with clients is vital for success. This involves understanding customer needs, providing exceptional customer service, and developing strategies to enhance customer satisfaction and loyalty<br/>Negotiation and closing skills - Must possess excellent negotiation skills and be able to close deals effectively. This includes the ability to identify and address customer objections, negotiate pricing and terms, and secure profitable contracts<br/>Technology proficiency: Must be proficient in using sales software, CRM systems, and other tools to streamline sales processes, track performance, and analyze data<br/>Adaptability and resilience: Must be able to adapt to changing market conditions, overcome obstacles, and remain resilient in the face of setbacks<br/><br/>Flexible packaging experience required<br/>10+ years of sales leadership experience required<br/>Has managed teams exceeding 10 people<br/>Has managed at least $50M in annual revenue<br/>Proficiency in Salesforce CRM is required<br/>Strong analytical skills and experience with sales analytics and reporting<br/>Excellent communication and interpersonal skills<br/>Ability to work independently and manage multiple priorities in a fast-paced environment<br/>Strong problem-solving skills and attention to detail", "preferred": "Bachelor's degree in Business, Sales, Marketing, or a related field<br/>Experience working with small to medium-sized businesses is preferred<br/><br/>"}, "skills": ["Salesforce", "Sales Leadership", "CRM", "Sales Support", "Training and Development", "Sales Strategy Implementation", "Customer Relationship Management", "Forecasting and Planning", "Market and industry knowledge", "Leadership and team management", "Communication", "Analytical", "Organizational", "Problem-solving", "Customer relationship management", "Negotiation", "Closing", "Technology proficiency", "Adaptability", "Resilience", "Flexible packaging"], "postedDate": "1 month ago", "benefits": "ePac Flexibles offers a generous benefits package that includes:<br/><br/>\n<ul><li>3 Medical Options</li><li>Dental</li><li>Vision</li><li>Employer paid Short and Long term disability</li><li>401K with employer match</li><li>120 hours Paid Time off</li><li>10 paid holidays</li><li>and more!<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3980532184"}