{"jobTitle": "Sales Supervisor: Ring Concierge (Fine Jewelry)", "company": {"name": "Leap", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$21.00/hr - $28.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Ring Concierge  is a rapidly growing female-founded fine jewelry company specializing in bespoke bridal rings and fine jewelry. We are seeking a dedicated and experienced Selling Supervisor to play a pivotal role in delivering a luxury selling experience and driving sales performance within our Century City boutique opening September 2024. As a member of the store leadership team, the Selling Supervisor will lead by example, setting high standards for service excellence and driving KPI achievement, while also supporting back-of-house operations to ensure the smooth and efficient functioning of the store. The ideal candidate has the ability to multi-task and stay organized in a fast-paced environment.<br/><br/>Responsibilities:<ul><li>Create an elevated luxury selling experience for clients, ensuring every interaction reflects the sophistication and prestige of our brand.</li><li>Lead by example in driving sales and achieving KPIs, inspiring and motivating sales associates to achieve and exceed targets through exceptional service and selling techniques.</li><li>Foster a culture of client-centricity and clienteling among the sales team, cultivating strong relationships with clients and leveraging customer information to personalize the shopping experience.</li><li>Perform opening and closing duties as needed, ensuring the boutique is prepared for daily operations and adhering to security protocols and procedures.</li><li>Support back-of-house operations, including inventory management, cycle counts, and stock replenishment, to maintain accurate inventory levels and a well-organized store environment.</li><li>Assist in training and coaching sales associates on product knowledge, selling techniques, and brand standards, providing ongoing support and guidance to enhance performance.</li><li>Collaborate with the management team to implement strategies for driving sales and achieving store goals, offering insights and recommendations based on observations and customer feedback.</li><li>Maintain a strong presence on the sales floor, actively engaging with clients, resolving any customer concerns or escalations with professionalism and grace.</li><li>Stay informed about industry trends, competitor offerings, and market insights to effectively position our brand and products within the luxury jewelry market.</li><li>Adhere to people safety policies and procedures to maintain a safe work environment.</li><li>Perform work in accordance with applicable policies, procedures, and laws or regulations.</li></ul>About You:If you are a results-driven sales professional with a passion for luxury retail and a commitment to excellence, we invite you to apply for the Selling Supervisor position at Ring Concierge. Join us in shaping unforgettable experiences and elevating the world of Fine Jewelry for our discerning clientele.Requirements:<ul><li>2 years previous experience in luxury retail sales, with a proven track record of success in a leadership role managing teams, driving sales performance and achieving KPIs.</li><li>Passion for delivering exceptional client experiences and a strong commitment to building long-term relationships with clients through clienteling efforts.</li><li>Demonstrated leadership skills with the ability to motivate and inspire a team to achieve goals and expectations.</li><li>Strong organizational skills with the ability to multitask and prioritize in a fast-paced environment.</li><li>Excellent communication and interpersonal skills, with the ability to interact confidently with clients and team members at all levels.</li><li>Detail-oriented with a focus on accuracy and efficiency in back-of-house operations.</li><li>Adherence to Ring Concierge’s dress code policy; business casual.</li><li>Must be legally authorized to work in the country in which the store is located.</li><li>Must be 18 years of age or older.</li><li>Willing to work in an environment with bright lights.</li><li>Able to move through a store for most of a shift to help clients and accomplish work.</li><li>Willing to move boxes weighing up to 30 lbs (13.6 kg).</li></ul>Measures of Success:<ul><li>Drive sales goals through Key Performance Indicators: Conversion, Average Order Value (AOV) and Units Per Transaction (UPT)</li><li>Clienteling: Client Outreach, Networking NPS (net promoter score)</li><li>Third Party Secret Shop Ratings</li><li>Ability to accomplish tasks + meet deadlines effectively</li></ul><u>About Leap:<br/></u>Leap is building the world's largest network of branded retail stores – powered by data, technology, and scale. Leap's platform enables brands to deploy stores that work in concert with ecommerce more rapidly and at significantly reduced cost and risk. Brand stores powered by Leap bring modern brands to life with compelling, immersive customer experience and operations driven and informed by millions of data points. Learn more about Leap's platform, and brand stores like Ring Concierge powered by Leap, at http://leapinc.com.<br/><br/>Leap Perks:<ul><li>Employee discount + wardrobe allotment for participating Leap brands</li><li>Commission eligible</li><li>401K</li><li>Accrued PTO for those eligible (blackout periods apply)</li><li>Medical, Dental &amp; Vision benefits (must avg 32hrs+/wk)</li><li>Employee Assistance Program</li></ul>Salary: $21/hr - $28/hr (DOE)<em><em>Please note that personal data may be shared with a third party for recruiting purposes. Further information regarding Leap's Privacy Policy and CCPA can be found on ourwebsite.<br/><br/></em></em><span><span><span><span><span><span><span>In order to achieve our mission, we need to work hard to create a diverse community of Leapers to support the brand and customers we serve and help us all grow and thrive individually and as a team. Our differences make our organization special and are paramount to our culture. Your age, skin color, beliefs, sexual orientation, nationality, disability, parental status, vet status, gender identity are valued.</span></span></span></span></span></span></span>", "responsibilities": "Create an elevated luxury selling experience for clients, ensuring every interaction reflects the sophistication and prestige of our brand.Lead by example in driving sales and achieving KPIs, inspiring and motivating sales associates to achieve and exceed targets through exceptional service and selling techniques.Foster a culture of client-centricity and clienteling among the sales team, cultivating strong relationships with clients and leveraging customer information to personalize the shopping experience.Perform opening and closing duties as needed, ensuring the boutique is prepared for daily operations and adhering to security protocols and procedures.Support back-of-house operations, including inventory management, cycle counts, and stock replenishment, to maintain accurate inventory levels and a well-organized store environment.Assist in training and coaching sales associates on product knowledge, selling techniques, and brand standards, providing ongoing support and guidance to enhance performance.Collaborate with the management team to implement strategies for driving sales and achieving store goals, offering insights and recommendations based on observations and customer feedback.Maintain a strong presence on the sales floor, actively engaging with clients, resolving any customer concerns or escalations with professionalism and grace.Stay informed about industry trends, competitor offerings, and market insights to effectively position our brand and products within the luxury jewelry market.Adhere to people safety policies and procedures to maintain a safe work environment.Perform work in accordance with applicable policies, procedures, and laws or regulations.", "qualifications": {"required": "2 years previous experience in luxury retail sales, with a proven track record of success in a leadership role managing teams, driving sales performance and achieving KPIs.Passion for delivering exceptional client experiences and a strong commitment to building long-term relationships with clients through clienteling efforts.Demonstrated leadership skills with the ability to motivate and inspire a team to achieve goals and expectations.Strong organizational skills with the ability to multitask and prioritize in a fast-paced environment.Excellent communication and interpersonal skills, with the ability to interact confidently with clients and team members at all levels.Detail-oriented with a focus on accuracy and efficiency in back-of-house operations.Adherence to Ring Concierge’s dress code policy; business casual.Must be legally authorized to work in the country in which the store is located.Must be 18 years of age or older.Willing to work in an environment with bright lights.Able to move through a store for most of a shift to help clients and accomplish work.Willing to move boxes weighing up to 30 lbs (13.6 kg)."}, "skills": [], "postedDate": "1 month ago", "benefits": "Employee discount + wardrobe allotment for participating Leap brandsCommission eligible401KAccrued PTO for those eligible (blackout periods apply)Medical, Dental &amp; Vision benefits (must avg 32hrs+/wk)Employee Assistance Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980462700"}