{"jobTitle": "Human Resources Generalist", "company": {"name": "Diasorin", "location": "Cypress, CA", "industry": "Biotechnology Research"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Biotechnology Research", "description": "Diasorin is a global leader in diagnostic solutions, pushing the boundaries of science and technology to create cutting-edge tools that improve healthcare worldwide. With a legacy spanning over 50 years, we've earned our reputation for excellence by developing innovative diagnostic assays and instruments that are trusted by healthcare providers around the world.<br/><br/><em>Our broad offering of diagnostic tests and Licensed Technology solutions, made available thanks to ongoing investments in research, positions us as the player with the widest range of specialty solutions in the sector and identifies us as the \"Diagnostics Specialist.\"<br/><br/></em><strong><em>Why Join Diasorin?<br/><br/></em></strong><ul><li>Impactful Work: When you join Diasorin, you become part of a team that's dedicated to improving lives. Your contributions will directly impact patient care, making a meaningful difference in the world. </li><li>Global Reach &amp; Innovation: Our work transcends borders. Joining Diasorin means collaborating with colleagues from all over the world, expanding your horizons, and contributing to global healthcare solutions at the forefront of the diagnostic industry. <br/><br/></li></ul><em>Diverse and Inclusive Culture: We believe in the strength of diversity, and our inclusive culture reflects this commitment. We value your unique perspective and offer a supportive, collaborative environment where everyone can thrive.<br/><br/></em><em>Join Our Team: If you're passionate about innovation, diversity, and making a positive impact on healthcare, Diasorin is the place for you. We're looking for passionate and talented individuals who are ready to embrace new challenges and drive healthcare solutions forward.<br/><br/></em><em>Are you ready to be part of a dynamic team that's shaping the future of diagnostics? Join Diasorin and become a catalyst for change in the world of healthcare. Apply today and be a part of our exciting journey toward a healthier, more connected world. Together, we can make an impact!<br/><br/></em>Human Resources Generalist<br/><br/><strong>Job Posting<br/><br/></strong>Company is committed to diversity and inclusion. We are an equal opportunity employer including veterans and people with disabilities.<br/><br/><strong>A Brief Overview<br/><br/></strong>The Human Resources Generalist will contribute to the delivery of HR programs and initiatives to enable the achievement of business objectives and providing support to employees and managers.<br/><br/>They will support the HR department in ensuring smooth and efficient business operations, and will have both administrative and strategic responsibilities.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Assist in developing and executing HR procedures and policies, providing guidance and interpretation for business operations</li><li>Advise and partner with managers and employees on HR processes, policies and resources</li><li>Supports employees and managers, as a first line of contact, on all aspects of HR including pay, benefits, leaves of absences, performance management, employee relations &amp; engagement, escalating to the appropriate HR resource/COE as necessary</li><li>Creates supporting documentation of employee changes; maintains and files electronic personnel records, updates HRIS and other HR records</li><li>Partnering with the Talent Development team, responsible for ensuring that new hire onboarding and employee offboarding is seamless, including assisting leaders with onboarding checklist, coordinating new hire orientation and paperwork, assisting leaders with exit checklist, conducting exit interviews and providing offboarding paperwork.</li><li>Investigate low risk Employee Relations issues, complaints, and conflicts in the workplace including maintaining appropriate documentation and follow-up.</li><li>Partner closely with Talent Acquisition and hiring managers in support of recruitment efforts for exempt and non-exempt personnel and temporary employees; including participation in recruiting strategy meetings, interviews, and debriefs.</li><li>Partner with the HR Systems and Compliance team to prepare reports/data in multiple systems including maintenance of organizational charts</li><li>Assist with communication, engagement, and change management</li><li>Proactively identify areas for improvement within assigned current processes</li><li>Perform assignments where trust, discretion, and accuracy are required, while maintaining confidential data with utmost scrutiny, judgment, and care</li><li>Assist and support with HR and Site administrative tasks and projects as needed and assigned<br/><br/></li></ul><strong>Education Qualifications<br/><br/></strong><ul><li>Bachelor's Degree with a minimum 3+ years Human Resources experience required<br/><br/></li></ul><strong>Experience Qualifications<br/><br/></strong><ul><li>Experience working with HRIS a preferred</li><li>Experience working within HR systems such as Ceridian Dayforce, ADP WFN, and SAP SuccessFactors. required<br/><br/></li></ul><strong>Training And Skills<br/><br/></strong><ul><li>Working knowledge of employment law and employee relations practices</li><li>Proven ability to operate within a matrix organization across multiple site locations</li><li>Exhibits high degree of professionalism and confidentiality in handling extremely sensitive information using considerable tact, diplomacy, discretion and judgment</li><li>Strong customer service focus, with a high level of responsiveness</li><li>Drive to achieve results, demonstrating agility, a sense of urgency and ability to prioritize</li><li>Gets things done and follows through on tasks and deadlines</li><li>Advanced knowledge of Microsoft Office Suite<br/><br/></li></ul><strong>Standard Physical Demands<br/><br/></strong><ul><li>Remain in a stationary position - Frequently</li><li>Moves in and around the workplace for purposes of accessing office equipment, meeting with others, etc. - Occasionally</li><li>Work is performed in an office and/or at home - Frequently<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong><ul><li>10%<br/><br/></li></ul><strong>What We Offer<br/><br/></strong>Receive a competitive salary $82,000-$97,000 annual salary and benefits package as you grow your career at Diasorin. Join our team and discover how your work can impact the lives of people all over the world.<br/><br/><em>Diasorin is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status, and will not be discriminated against on the basis of disability.<br/><br/></em><em>In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and Canada and to complete the required employment eligibility verification document form upon hire.<br/><br/></em><em>Diasorin is committed to providing reasonable accommodations for qualified individuals with disabilities. If you are a US or Canada candidate and require assistance or accommodation during the application process, please contact the North America Talent Acquisition Team at hrtalent@diasorin.com or 1-800-328-1482 to request an accommodation.<br/><br/></em><em>The above job description is intended to describe the general content, identify the essential functions, and set forth the requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or requirements.<br/><br/></em><em>Diasorin reserves the right to modify or amend this job posting as needed to comply with local laws and regulations.<br/><br/></em><em>Please note that offers of employment at Diasorin may be contingent upon successful completion of a pre-employment background check and drug screen, subject to applicable laws and regulations.<br/><br/></em><em>This position is not eligible for partnership with a third-party search firm vendor without expressed, written consent from the Diasorin Human Resources Department.</em>", "responsibilities": "<ul><li>Assist in developing and executing HR procedures and policies, providing guidance and interpretation for business operations</li><li>Advise and partner with managers and employees on HR processes, policies and resources</li><li>Supports employees and managers, as a first line of contact, on all aspects of HR including pay, benefits, leaves of absences, performance management, employee relations &amp; engagement, escalating to the appropriate HR resource/COE as necessary</li><li>Creates supporting documentation of employee changes; maintains and files electronic personnel records, updates HRIS and other HR records</li><li>Partnering with the Talent Development team, responsible for ensuring that new hire onboarding and employee offboarding is seamless, including assisting leaders with onboarding checklist, coordinating new hire orientation and paperwork, assisting leaders with exit checklist, conducting exit interviews and providing offboarding paperwork.</li><li>Investigate low risk Employee Relations issues, complaints, and conflicts in the workplace including maintaining appropriate documentation and follow-up.</li><li>Partner closely with Talent Acquisition and hiring managers in support of recruitment efforts for exempt and non-exempt personnel and temporary employees; including participation in recruiting strategy meetings, interviews, and debriefs.</li><li>Partner with the HR Systems and Compliance team to prepare reports/data in multiple systems including maintenance of organizational charts</li><li>Assist with communication, engagement, and change management</li><li>Proactively identify areas for improvement within assigned current processes</li><li>Perform assignments where trust, discretion, and accuracy are required, while maintaining confidential data with utmost scrutiny, judgment, and care</li><li>Assist and support with HR and Site administrative tasks and projects as needed and assigned<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's Degree with a minimum 3+ years Human Resources experience required<br/><br/>Experience working within HR systems such as Ceridian Dayforce, ADP WFN, and SAP SuccessFactors. required<br/><br/>", "preferred": "Experience working with HRIS a preferred"}, "skills": ["employment law", "employee relations", "HRIS", "Ceridian Dayforce", "ADP WFN", "SAP SuccessFactors", "Microsoft Office Suite"], "postedDate": "1 week ago", "benefits": "Receive a competitive salary $82,000-$97,000 annual salary and benefits package as you grow your career at Diasorin.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980484937"}