{"jobTitle": "Hospital Sales Representative", "company": {"name": "GSI", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Medical Equipment Manufacturing", "description": "<strong>Job Title: Diagnostics Hospital Sales Representative</strong><p>Global leading innovator in the field of Diagnostics committed to improving patient care and outcomes through advanced diagnostic solutions. The industry-leading products are used globally by healthcare professionals in hospitals, laboratories, and clinics to make informed medical decisions. Seeking a dynamic and experienced Diagnostics Hospital Sales Representative to join the team. The ideal candidate will be responsible for promoting and selling Diagnostics capital equipment to (existing and new accounts) hospitals and healthcare institutions. This role requires a strategic thinker with a proven track record in sales and an in-depth understanding of the healthcare industry.</p><p><br/></p><p><strong>Responsibilities</strong></p><ul><li>Sales &amp; Promotion: Promote and sell to hospitals and healthcare facilities. Achieve and exceed sales targets.</li><li>Responsible for gaining access and presenting to Administration, C-Suite executives and Supply Chain within major IDNs, hospitals, private practices, and EMS</li><li>Relationship Management: Establish and maintain strong relationships with healthcare professionals, including lab managers, physicians, and hospital administrators.</li><li>Market Analysis: Monitor and analyze market trends and competitor activities to identify opportunities for growth and new business acquisition.</li><li>Product Demonstration: Conduct product demonstrations and presentations to healthcare professionals.</li><li>Training &amp; Education: Provide training and support to healthcare staff on the use of IVD products.</li><li>Reporting: Maintain accurate records of all sales activities and prepare regular sales reports for management review.</li><li>Compliance: Ensure compliance with all regulatory bodies and company policies.</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>Bachelor’s degree in Life Sciences, Business Administration, or related field.</li><li>Minimum of 3 years of sales experience in the medical devices or diagnostics industry.</li><li>Strong understanding of hospital and healthcare environments.</li><li>Proven track record of meeting or exceeding sales targets.</li><li>Excellent interpersonal and communication skills.</li><li>Ability to travel as needed.</li></ul><p><br/></p><p><strong>Benefits</strong></p><p>- Aggressive Competitive salary plus commission.</p><p>- Health, dental, and vision insurance.</p><p>- Retirement plan options / 401K</p><p>- Paid time off and holidays.</p><p>- Continuous training and professional development opportunities.</p>", "postedDate": "4 weeks ago", "skills": ["Sales", "Healthcare", "Medical Devices", "Diagnostics", "Relationship Management", "Market Analysis", "Product Demonstration", "Training", "Reporting", "Compliance"], "benefits": "- Aggressive Competitive salary plus commission.\n- Health, dental, and vision insurance.\n- Retirement plan options / 401K\n- Paid time off and holidays.\n- Continuous training and professional development opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980280153"}