{"jobTitle": "Sr. Strategic Finance Analyst", "company": {"name": "InStride", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance and Sales", "industry": "Education Administration Programs", "description": "At InStride, it’s simple.<br/><br/>We believe the more you invest in your people, the more skilled they become, and the better your organization performs.<br/><br/>Our mission to bring career-aligned, debt-free education to employers and their workforce has created pathways for our Learners to accelerate their careers with 2,800+ learning options.<br/><br/>Our teams are tied together by a recognition of how impactful education can be for one’s career, livelihood and community. Our commitment to the success of our Learners is what drives us. To get a better feel for our culture, watch more here.<br/><br/>Candidates must be located in one of the following states to be considered eligible for employment: AZ, AR, CA, CO, CT, FL, GA, IL, IN, KS, LA, MA, MD, MI, MO, NC, NH, NJ, NV, NY, OH, OR, TX, VA, WA, WI.<br/><br/><strong>Who you are: <br/><br/></strong>InStride is looking for a Sr. Strategic Finance Analyst to join our dynamic Finance team that can scale with our emerging, high growth company! In this role you will leverage deep financial analysis to support key strategic decisions, influencing the company’s development and success. Your responsibilities include conducting detailed financial forecasting, modeling, and analysis to project future scenarios and inform leadership decisions. As an expert in financial narratives, you will transform complex data into actionable insights and clear narratives to drive informed decision-making across the organization. Your work will ensure that strategic initiatives are financially viable and aligned with our long-term goals. This role is essential for a dynamic professional who thrives in a fast-paced environment and is committed to excellence in strategic financial planning.<br/><br/><strong>Skills we’d love to see you show off:<br/><br/></strong><ul><li>Financial analysis expertise: Proven ability to conduct detailed financial forecasting, modeling, and analysis to support strategic decision-making and project future scenarios. </li><li>Technical proficiency: Experienced in using ERP, FP&amp;A, Analytics, CRM systems, with a preference for experience with NetSuite, Salesforce.com, and Tableau. </li><li>Client relationship management: Demonstrated experience in leading or supporting client relationships and providing decision support (ROI, NPV, benchmarking). </li><li>Communication expertise: Strong written, verbal, and interpersonal communication skills, with the ability to distill complex issues into clear, structured frameworks. </li><li>Problem-solving skills: Ability to identify and enthusiastically seek solutions to problems, regardless of their nature, and turn challenges into opportunities. </li><li>Collaboration and teamwork: Proven ability to work in a collaborative, team-centric environment and effectively engage with stakeholders at all levels. </li><li>Experience with financial principles: Validated knowledge of financial and accounting principles to ensure strategic initiatives are financially viable. </li><li>Curiosity and analytical mindset: A curiosity and aim to thoroughly analyze issues and come forward with clear recommendations for moving forward. <br/><br/><br/></li></ul><strong>What we're looking for</strong><strong>:<br/><br/></strong><ul><li>4+ years of finance experience, preferably in a high-growth technology company or consulting firm</li><li>Prior experience working for a private-equity backed company</li><li>Proven track record of achievement and delivering impactful results</li><li>Strong background in financial analysis with strong problem-solving skills</li><li>Consistent track record to distill issues into simple, structured frameworks that can be clearly communicated to key leaders and partners inside and outside of the company</li><li>Experience leading or supporting client relationships</li><li>A curiosity and aim to thoroughly analyze issues and to come forward with clear recommendations for moving forward</li><li>Strong communication skills, including the ability to communicate effectively with individuals at all levels of InStride and client organizations</li><li>Proven track record in a fast-paced environment</li><li>Ability to identify and enthusiastically seek problems regardless of the nature of the issue or the work required to get the job done</li><li>Validated knowledge of financial / accounting principles</li><li>Ability to work in a collaborative and team-centric organization</li><li>Experience working in key systems to help improve and automate the finance function (ERP, FP&amp;A, Analytics, CRM, etc.)</li><li>Prior experience with NetSuite, Salesforce.com, and/or Tableau is a plus<br/><br/><br/></li></ul><strong>How you will create impact</strong><strong>:<br/><br/></strong><ul><li>Provide comprehensive financial analysis to support strategic decision-making across the company, ensuring alignment with long-term objectives</li><li>Support customer success in providing client account projections, ROI analysis, and other analytical support required to sustain and grow Corporate Partnerships</li><li>Develop and refine detailed financial models that forecast and analyze functional impacts to predict future performance</li><li>Work closely with senior management and various stakeholders to gather insights and align financial plans with business strategy</li><li>Lead the analysis of business initiatives, presenting insights and recommendations to support executive decision-making processes</li><li>Develop and monitor key performance indicators to drive business success, providing regular insights and strategic recommendations</li><li>Engage in special projects, providing analytical frameworks and conducting deep dives on important strategic initiatives</li><li>Provide decision support (return on investment, NPV, benchmarking, etc.) to clients as required to help support program development and expansion</li><li>Identify client trends and offer solutions to mitigate negative trends and (or) accelerate positive ones<br/><br/><br/></li></ul>Target base compensation amount for this role outlined below. Final offer amounts are determined by multiple factors including candidate experience and expertise and may vary from the amounts shown below.<br/><br/>$100,000—$115,000 USD<br/><br/>We are looking for someone who is not only technically skilled, but also enthusiastic about making a meaningful impact. If this description resonates with you, we're excited about the possibility of having you on our team. As a skills-driven employer, we encourage you to apply if there is a skill-fit, even in the absence of years of experience.<br/><br/><strong>Don’t meet every single requirement?</strong> Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At InStride we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role, but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this role!<br/><br/><strong>Benefits @ InStride <br/><br/></strong>As an organization that champions investing in people, it’s critical we walk the talk. That’s why InStride employees are eligible to enroll in 2,800+ online certificate and degree programs through our <strong>Step Forward program</strong>. Unlike traditional tuition reimbursement programs, InStride covers your tuition upfront, regardless of your course of study, degree type, or school - eligible to employees starting Day 1.<br/><br/>This role is also eligible for the following benefits:<br/><br/><ul><li>401(k) plan with company match </li><li>Flexible vacation policy</li><li>Paid family leave</li><li>Best-in-class health care benefits</li><li>And more!<br/><br/><br/></li></ul><strong>InStride Diversity and Inclusion Statement<br/><br/></strong>At InStride, we foster a culture of belonging, we support authenticity and intersectionality, and we embrace and appreciate our differences. We do this by building a diverse pipeline of talent and ensuring equitable access to opportunities, information and leadership. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/>If you have a disability or special need that requires accommodation, please let your recruiter know.<br/><br/><strong>Policies &amp; Disclosure <br/><br/></strong>Effective November 1, 2021, all new hires must be fully vaccinated against the COVID-19 virus unless they have been granted a reasonable accommodation. If you are offered employment, this requirement must be met by your date of hire, unless a reasonable accommodation is approved by the People &amp; Talent team in writing.<br/><br/>For questions on how we use personal information of job applicants, please refer to InStride's Job Applicant Privacy Policy.<br/><br/><em>Beware of recruiting scams. InStride does not require a financial transaction or any financial account information to be eligible for employment. If you receive a message purporting to be from InStride asking you for a financial transaction, your financial account information, or any other sensitive information, please do not respond and let us know immediately at </em><em>recruiting@instride.com</em><em>.<br/><br/></em><strong>About InStride<br/><br/></strong>InStride is a tech-enabled services company that is pioneering new approaches to workforce education solutions with a mission of driving meaningful social and business outcomes by unlocking access to life-changing education. In collaboration with quality academic institutions, we enable employers to provide career-aligned, debt-free education through a personalized, digital platform and a consultative service model. To learn more, visit: https://www.instride.com/", "responsibilities": "Provide comprehensive financial analysis to support strategic decision-making across the company, ensuring alignment with long-term objectives\nSupport customer success in providing client account projections, ROI analysis, and other analytical support required to sustain and grow Corporate Partnerships\nDevelop and refine detailed financial models that forecast and analyze functional impacts to predict future performance\nWork closely with senior management and various stakeholders to gather insights and align financial plans with business strategy\nLead the analysis of business initiatives, presenting insights and recommendations to support executive decision-making processes\nDevelop and monitor key performance indicators to drive business success, providing regular insights and strategic recommendations\nEngage in special projects, providing analytical frameworks and conducting deep dives on important strategic initiatives\nProvide decision support (return on investment, NPV, benchmarking, etc.) to clients as required to help support program development and expansion\nIdentify client trends and offer solutions to mitigate negative trends and (or) accelerate positive ones", "qualifications": {"required": "4+ years of finance experience, preferably in a high-growth technology company or consulting firm\nPrior experience working for a private-equity backed company\nProven track record of achievement and delivering impactful results\nStrong background in financial analysis with strong problem-solving skills\nConsistent track record to distill issues into simple, structured frameworks that can be clearly communicated to key leaders and partners inside and outside of the company\nExperience leading or supporting client relationships\nA curiosity and aim to thoroughly analyze issues and to come forward with clear recommendations for moving forward\nStrong communication skills, including the ability to communicate effectively with individuals at all levels of InStride and client organizations\nProven track record in a fast-paced environment\nAbility to identify and enthusiastically seek problems regardless of the nature of the issue or the work required to get the job done\nValidated knowledge of financial / accounting principles\nAbility to work in a collaborative and team-centric organization\nExperience working in key systems to help improve and automate the finance function (ERP, FP&amp;A, Analytics, CRM, etc.)", "preferred": "Prior experience with NetSuite, Salesforce.com, and/or Tableau is a plus"}, "skills": ["Financial Analysis", "ERP", "FP&A", "Analytics", "CRM", "NetSuite", "Salesforce.com", "Tableau", "Client Relationship Management", "Communication", "Problem Solving", "Collaboration", "Teamwork", "Financial Principles", "Curiosity", "Analytical Mindset"], "postedDate": "1 week ago", "benefits": "401(k) plan with company match \nFlexible vacation policy\nPaid family leave\nBest-in-class health care benefits\nAnd more!", "remoteWork": "No", "salary": {"amount": "100,000—$115,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3980088759"}