{"jobTitle": "Concierge Driver (Part Time)", "company": {"name": "710 Labs", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00/hour + Tips", "currency": "USD"}, "jobFunction": "Other", "industry": "Consumer Goods", "description": "710 Labs is an award-winning multi-state cannabis brand obsessed with making the richest flavored, organic, small batch cannabis on the planet. We are the OGs that hand select and hunt exotic cultivars from the most renowned breeders. We collaborate with artists such as Richard Prince, LSD World Peace, Astral Oracles, The Elder Statesman and Camp High among others for exclusive accessories and product drops.\n\nAt 710 Labs, our mission is simple: to disrupt the industry through obsessive quality. We believe in quality over everything – quality people, quality thinking, quality expression, quality of life. We believe in open communication and genuine collaboration where everyone has a voice. We rise together as a team and as an industry.\n\nWe are seeking passionate individuals to represent us as we deliver our products to our customers. We pride ourselves on quality and experience - this individual should embody those traits as well. Please note, this is a **part-time** position.\n\n**Essential Duties & Responsibilities**\n\n<ul><li>Provide consistent and best in class customer experience </li><li>Complete deliveries from 710 Labs’ facility to customers </li><li>Complete delivery and pick-up paperwork promptly and accurately, ensuring all orders are accounted for and all paperwork is scanned into the system </li><li>Utilize smartphone applications and other required systems to navigate to and deliver assigned orders in a timely, accurate and safe manner </li><li>Able to follow standard operating policy and safety procedures </li><li>Maintain a positive work environment conducive to trust and respect </li><li>Maintain logs of packages delivered </li><li>Maintain ongoing communication with the dispatcher <br/><br/><br/></li></ul>**Qualifications**\n\n<ul><li>Ability to pass all required reference and background checks required by the company and mandated by the State of California and Los Angeles County for cannabis industry employees </li><li>Must have a valid drivers' license and meet the requirements of the Company's Motor Vehicle Policy </li><li>Reliable vehicle with up-to-date registration and insurance, meeting all state-required coverage limits </li><li>Must be able to carry/lift various products from 35 -50 lbs. and sit for extended periods of time. </li><li>Strong time management and customer service skills <br/><br/><br/></li></ul>**Compensation & Benefits**\n\n<ul><li>Pay range: $20.00/hour + Tips</li><li>Mileage reimbursement</li><li>Employee discount on our products<br/><br/><br/></li></ul>The Company is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.", "responsibilities": "Provide consistent and best in class customer experience Complete deliveries from 710 Labs’ facility to customers Complete delivery and pick-up paperwork promptly and accurately, ensuring all orders are accounted for and all paperwork is scanned into the system Utilize smartphone applications and other required systems to navigate to and deliver assigned orders in a timely, accurate and safe manner Able to follow standard operating policy and safety procedures Maintain a positive work environment conducive to trust and respect Maintain logs of packages delivered Maintain ongoing communication with the dispatcher", "qualifications": {"required": "Ability to pass all required reference and background checks required by the company and mandated by the State of California and Los Angeles County for cannabis industry employees Must have a valid drivers' license and meet the requirements of the Company's Motor Vehicle Policy Reliable vehicle with up-to-date registration and insurance, meeting all state-required coverage limits Must be able to carry/lift various products from 35 -50 lbs. and sit for extended periods of time. Strong time management and customer service skills", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Pay range: $20.00/hour + Tips Mileage reimbursement Employee discount on our products", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980804095"}