{"jobTitle": "Housing Navigator -161-8 (4506)", "company": {"name": "PATH ", "industry": "Non-profit Organizations", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "23.24 to $28.28 per hour", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Non-profit Organizations", "description": "<strong>WHY WORK FOR US?<br/><br/></strong>We are mission and values driven and your contributions will make a difference. We make a positive difference in people's lives and help an average of 23 people per week to find a place to live.<br/><br/>If you join us, you will be able to advocate for change while also working with influential people who effect changes in policy and devote time to issues of racial and social justice. We prioritize your work/life balance and provide various scheduling options in addition to generous time off, health, and wellness benefits and we're committed to helping you reach your potential by providing opportunities for professional growth across the state.<br/><br/><strong>JR 4506<br/><br/></strong><strong>Housing Navigator<br/><br/></strong><strong>Los Angeles, CA 90004<br/><br/></strong><strong>Salary: </strong>$23.24 to $28.28 per hour<br/><br/><strong>Pay Frequency: </strong>24 Pay Periods Per Year<br/><br/><strong>Full Time<br/><br/></strong><strong>Non-Exempt<br/><br/>Driving Required<br/><br/></strong>PATH is seeking candidates passionate about helping others make a positive change in their lives to join our <strong>Housing Navigation Services</strong> Team as the <strong>Housing Navigator</strong> at the <strong>Los Angeles Location</strong>.<br/><br/><strong>About Path<br/><br/></strong>Since its foundation in 1984, PATH (People Assisting The Homeless) has pioneered bold and effective approaches to assist people experiencing homelessness. PATH operates services throughout California, connecting our clients to a comprehensive continuum of homelessness prevention, street outreach, employment preparation and placement assistance, individualized case management, supportive services, interim housing, and permanent supportive housing.<br/><br/><strong>About The Job<br/><br/></strong>As part of the TEAM NAME, the JOB TITLE performs ONE SENTENCE POSITION DESCRIPTION. Position Responsibilities include:<br/><br/><ul><li>Conducts intake and individualized needs assessment for all clients and collaborates to develop Individualized Service Plan (ISP) that addresses housing goals, maintaining/increasing income and other personal goals identified by the client including medical, mental health, substance use, financial resources, vocational, and social support needs. </li><li>Provides referrals, linkages, information, and support to resources that help clients to achieve their ISP goals</li><li>Completes program specific assessments (e.g. VI-SPDAT)</li><li>Evaluates strengths and challenges to addressing short term and long-term goals, conducts a 90-day review with the client after initial intake</li><li>Maintains documentation standards as required by the Program and PATH policies, including completing case file notes in a timely manner and maintains a complete, accurate, and current client file with all required documents</li><li>Maintains confidentiality of client files per HIPAA and all applicable guidelines<br/><br/></li></ul><strong>What You Bring<br/><br/></strong>We’re looking for candidates with:<br/><br/><ul><li>Analytical Skills and Attention to Detail: Gather and interpret data, identifying trends, patterns, and insights to inform decision-making. Ability to consistently produce high-quality work, ensuring accuracy and precision in all tasks. </li><li>Collaboration and Teamwork: Work effectively with others, seeking out and building positive working relationships with colleagues, participants, and stakeholders. Work effectively with others, contributing to team goals and recognizing the strengths and contributions of others. </li><li>Communication: Convey information clearly and effectively (both verbally and in writing) to individuals and groups in a manner that informs, engages and maintains their attention. </li><li>Creativity and Initiative: Take action and make decisions without being prompted, demonstrating a proactive approach to work and a willingness to take on additional responsibilities. Think outside the box, generating innovative solutions to problems or challenges. </li><li>Critical Thinking and Problem Solving: Analyze and evaluate information and situations, identify key issues, consider alternatives, and make logical decisions based on sound reasoning that will achieve the desired outcome. </li><li>Ethics and Boundaries: Maintain ethical and professional standards, demonstrating honesty, integrity, and a commitment to doing the right thing in all situations while maintaining professional boundaries. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Two (2) years of experience in healthcare, case management, homeless services or working with vulnerable populations or a related field. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>All levels of education and experience are welcome. <br/><br/></li></ul><strong>Mandatory Requirements<br/><br/></strong>Regardless of qualifications, candidates must: <br/><br/><ul><li>Have employment eligibility verification</li><li>Have or be able and willing to obtain CPR/First Aid training</li><li>Successfully complete the following as a condition of hire:</li><ul><li>Tuberculosis Test</li><li>Background Screening</li><li>Drug Test<br/></li></ul></ul><strong>DRIVING<br/><br/></strong>Driving is an <strong>essential function</strong> of this position. To meet the employment requirements for this role, all candidates must:<br/><br/><ul><li>Have reliable transportation</li><li>A valid driver’s license</li><li>Proof of insurance and ownership for personal vehicles used during work duties</li><li>The ability to qualify for PATH's insurance coverage<br/><br/></li></ul><strong>EMPLOYMENT ELIGIBILITY<br/><br/></strong>Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa.<br/><br/><strong>FLEXIBLE WORK<br/><br/></strong>We are a California employer. Therefore, all regular and customary work must be performed within the state. Approval for work outside of the office, does not establish approval for work to be conducted outside of California.<br/><br/><strong>What We Offer<br/><br/></strong>In addition to a rewarding work environment, we offer our employees a competitive benefits package that includes medical, dental and vision coverage, vacation and sick time, paid holidays, and a retirement plan.<br/><br/><strong>READY TO MAKE A DIFFERENCE THROUGH ACTION?<br/><br/></strong>If this position sounds like a fit, please submit your application today. <strong>A resume is required.<br/><br/></strong><em>PATH provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, PATH complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.<br/><br/></em><em>PATH will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.<br/><br/></em><em>PATH is dedicated to racial and social justice by centering equity in our service delivery and maintaining a diverse and inclusive work environment for the communities we serve. We seek awareness and insight from witnessing the stories of our clients and learning from the experiences of our staff to ensure impactful systems change. If people are empowered, they can bring their authentic, whole selves to work and when people feel like they belong, they can become part of a unified effort of ending homelessness for all.</em>", "responsibilities": "As part of the TEAM NAME, the JOB TITLE performs ONE SENTENCE POSITION DESCRIPTION. Position Responsibilities include:<br/><br/><ul><li>Conducts intake and individualized needs assessment for all clients and collaborates to develop Individualized Service Plan (ISP) that addresses housing goals, maintaining/increasing income and other personal goals identified by the client including medical, mental health, substance use, financial resources, vocational, and social support needs. </li><li>Provides referrals, linkages, information, and support to resources that help clients to achieve their ISP goals</li><li>Completes program specific assessments (e.g. VI-SPDAT)</li><li>Evaluates strengths and challenges to addressing short term and long-term goals, conducts a 90-day review with the client after initial intake</li><li>Maintains documentation standards as required by the Program and PATH policies, including completing case file notes in a timely manner and maintains a complete, accurate, and current client file with all required documents</li><li>Maintains confidentiality of client files per HIPAA and all applicable guidelines<br/><br/></li></ul>", "qualifications": {"required": "All levels of education and experience are welcome. <br/><br/>", "preferred": "Two (2) years of experience in healthcare, case management, homeless services or working with vulnerable populations or a related field. <br/><br/>"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "In addition to a rewarding work environment, we offer our employees a competitive benefits package that includes medical, dental and vision coverage, vacation and sick time, paid holidays, and a retirement plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980692713"}