{"jobTitle": "Terminal Refresh - Design Manager", "company": {"name": "Cordoba Corporation", "industry": "Civil Engineering", "size": "Not specified", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$115,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Civil Engineering", "description": "Cordoba Corporation is a leading engineering and design firm based in California. We are seeking a Terminal Refresh - Design Manager to support the Aviation Team. The Terminal Refresh /CTA West Station Design Manager establishes and monitors procedures for engineering review activities to ensure they are done according to best practices and the design standards identified in the Contracts. The Terminal Refresh - Design Manager shall oversee design support management, scope of work management, design review and approval, permitting, agency coordination support, and building information modelling (BIM) coordination. The Terminal Refresh - Design Manager supports the Terminal Refresh Project Manager in providing oversight of the tenants/design-builders designs including architectural, structural, mechanical electrical plumbing (MEP), civil, utilities, and IT disciplines per client standards. The Terminal Refresh - Design Manager oversees the various design activities of the Terminal project.", "responsibilities": "Overseeing the review and approval of technical documents (DRT process), Lending expertise to manage comment resolution, Facilitating meetings and be the technical liaison between the Developers/Design-Builders and TDIP Subject Matter Expert teams, Working with the Terminal Refresh Project Manager in defining, reviewing and/or approving design requirements, responsibilities and program consistency, Providing guidance to the Terminal Refresh Project Manager should design requirements contained in the project documents not be clearly defined, Providing technical review of changes to scope of work for each project, Establishing submittal approval procedures and ensure uniformity of review approach, Auditing project team comments and designer responses, Monitoring compliance with architectural and engineering guidelines for the Terminal Refresh project ensuring consistency and quality in design, Monitoring permitting information and the permitting process required by the design team, Supporting the Terminal Refresh project manager to ensure design reviews are completed on time and within budget, Developing and maintaining the Terminal Refresh project scope tracker to verify that all scope elements are accounted for and have been or will be assigned to a project, Providing guidance related to the functional requirements contained in the technical specifications or other project documents supplied by client, Monitoring BIM productions of all designers and contractors according to client BIM Standards, the BIM Execution Plan, and needs of the Terminal Refresh project, Acting as technical liaison for the design review processes and comment resolution in coordination with the project manager and the Design Review Team (DRT), Providing technical support and coordination between the Terminal Refresh project team and other TDIP project teams for program consistency across all disciplines, Providing technical Support for adjacent our Aviation client's projects as required to ensure accurate interface, Providing technical coordination for project consistency across all disciplines, Preparing and reviewing briefings, meeting agendas, and supporting materials for various meetings including Board presentations, Steering Committee meeting, Stakeholder outreach, and other TDIP meetings.", "qualifications": {"required": "Bachelor’s or master’s degree in architecture, Engineering, and/or related field required, Professionally licensed Architect and/or Engineer preferred", "preferred": "10 years or more experience in managing the design of large, complex building projects, utilities and infrastructure improvements, preferably on airport projects, Design management of complex aviation improvements experience required, Experience managing a team of design professionals, Experience with projects more than $100 million in value, Experience with various delivery methods, including Design-Bid-Build, Design+CMAR and Design/Build, Proven ability to perform in a management capacity, Excellent written and oral communication skills and a thorough knowledge of industry practices and regulations, Must have a self-starter attitude with proactive, results-oriented focus; and willing and capable to assume additional responsibilities, Must be able to interface with a variety of people with different technical levels and educational backgrounds, Must be detail oriented and highly organized."}, "skills": ["Proficient in Microsoft Office Suite and Bluebeam", "Familiarity with Project Management Information Systems", "Ability to work in CAD or REVIT a plus"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "We offer multiple medical and dental insurance plans, as well as vision insurance. Plans are subsidized for both employees and dependents with coverage effective the first month after hire. Additionally, Cordoba provides employees with paid AD&D and life insurance, a 401k with an industry leading employer match, generous vacation and sick leave accruals, 9 paid holidays, and other forms of paid time off. We also offer flexible spending accounts (FSA’s) including medical care reimbursement, dependent care reimbursement, and commuter benefit plans. Employees are also eligible for our employee assistance program and well-being benefits that include stress management, nutrition, and financial well-being.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3980050334"}