{"jobTitle": "Health Market Leader II", "company": {"name": "CannonDesign", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "156,640.00/yr - $195,800.00/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Architecture and Planning", "description": "If you think your skills, experience and aspirations make you a good match for this position, we encourage you to apply.<br/><br/><strong>About The Role<br/><br/></strong>Your role is focused on providing leadership of the Health market within one or more offices of CannonDesign. This includes being responsible for developing and leading high-performance diverse teams focused on the development and implementation of the office or regional Market Business Plan..  You will contribute to the success of the firm including the areas of business development and client engagement, client, and team leadership, mentoring of our people, and advancing the quality of work. You will be accountable to integrate our range of design services, managing our processes and delivering solid financial performance for the market. Importantly, you will be an ambassador of our brand, championing Living-Centered Design and bringing our Firm's purpose - to help people continuously flourish - to life in every touchpoint you have with our clients.<br/><br/><strong>Here's What You'll Do<br/><br/></strong>In this role you will focus most of your time on activities that support the growth and impact of the market, including external brand opportunities. Secondly, you will focus your time on client and team leadership responsibilities engaged directly on projects.<br/><br/>Areas of Focus<br/><br/><ul><li>Market Leadership: Responsible for advancing strategic initiatives and client pursuit discussions and strategies. Working with Office and other Market Leadership, you will lead the development of the market business plan. This plan will outline strategies and actionable items that advance client engagement and development, market differentiation and team building/leadership to foster the growth of the market in concert with firm-wide goals. You will participate and engage with other health market leaders in ways to improve our practice globally. </li><li>Top Line Development: Work with Client Leaders and other firm-wide resources to focus on growing the top line of the market by identifying and actively pursuing new target clients as well as nurturing existing client relationships. You will seek to differentiate CannonDesign in the marketplace and promote the full range of our integrated design services, supporting the advancement of Living-Centered Design in all phases of client engagement. In this role you will be accountable for the overall top line results of the market and have a personal goal of achieving top line success of $3.0M per year in net signed fees. </li><li>Client and Team Leadership: Lead by example. Demonstrate commitment to our clients by undertaking the work in an active way on select client project opportunities. Serve as a client leader and/or subject matter expert where appropriate. </li><li>Understand the Market: Identify future market trends and opportunities for growth and advancement of the market. Demonstrate a high level of knowledge of the market, including “Best Practices,” and evidence-based and research-based design. </li><li>Bottom Line Success: Collaborate with the Office Practice Leader, Business Practice Leader, and Client Leaders to ensure that the business plan bottom line initiatives are successfully implemented. Achieve a minimum of 10% firm profitability level for the market each year. </li><li>Staff Development: Assess, mentor and coach, and recruit staff to build a high-performance team, and to develop future leaders within your market. Take ownership for the growth of a diverse and inclusive team. Assist in establishing an environment that encourages leadership, integrity, humility, respect, and responsibility, along with collaboration, experimentation, innovation, creativity and entrepreneurship. <br/><br/></li></ul><strong>Here's What You'll Need<br/><br/></strong><ul><li>Bachelor degree in a relevant field required. </li><li>Current Registration/Licensure in Architecture, Interior Design or Engineering preferred. </li><li>Additional certifications and/or training relevant to this role are preferred. </li><li>Must have a minimum of 15 years of experience with a proven track record of strategic growth, market and team leadership, and business development success in the Health Market. </li><li>Strong presentations skills are essential. </li><li>Exceptional client and people leadership skills required. </li><li>Strong business acumen and proven ability to create and execute strategy is needed. </li><li>Professional acumen and maturity demonstrated by the ability to communicate authentically and respectfully is essential. </li><li>Ability to inspire, motivate and develop high-performing, accountable teams. </li><li>Must be able to demonstrate sound judgement and a sound approach regarding risk management and mitigation. </li><li>Some travel required.  <br/><br/></li></ul><strong>About Working Here<br/><br/></strong><ul><li>We are relentless in our pursuit of client adoration (not simply satisfaction). Consistent delivery of the best service is what we are about. </li><li>We are committed to ensuring our practice is equitable for all employees, representative of the communities around us – and focused on the future of design. We advocate for equity, diversity, and inclusion efforts through the leadership of our DEI Council, Employee Resource Groups and other community advocacy initiatives. </li><li>We’re about communication and transparency here. If you want to talk to someone about an idea you have, or a challenge that needs addressing, we’re ready for you. <br/><br/></li></ul>The salary range for this position is $156,640 to $195,800 annually. This salary range is the range we believe is the anticipated range of possible base compensation at the timing of the posting. We may ultimately pay more or less than the anticipated salary range for the position. Employees may be eligible for discretionary bonuses. We offer a full benefit package including medical, dental and vision coverage and flexible spending account options and voluntary insurances. We have paid time off, flex-time summer hours, remote work options and a 401k plan and employee perk programs. For a general overview of our benefits, please visit our careers page at https://www.cannondesign.com/careers/benefits. Actual compensation may vary from posting based on geographic location, work experience, education and/or skill level.<br/><br/><em>Please note that candidates can only apply to our positions on our company Careers site. It's not uncommon for scammers to create positions that look legitimate on other sites; never enter your information or apply for CannonDesign positions on any platform. Should an issue arise that you feel we should be aware of, please contact us. Please provide your resume and portfolio when applying.<br/><br/></em>As a condition of employment, all employees are expected to complete mandatory training, including compliance training, within required timeframes and adhere to our internal policies and our Code of Conduct.<br/><br/>CannonDesign recognizes the value of diversity in our workforce. We are committed to equal opportunity. We consider all qualified employment applicants without regard to race, religion, color, gender, age, national origin, sexual orientation, gender identity, partnership status, protected veteran status, disability, or any other status protected by federal, state, or local law. Individuals who hold legal work authorization applicable to employment at CannonDesign in the United States will be considered without regard to citizenship/alienage.", "responsibilities": "Your role is focused on providing leadership of the Health market within one or more offices of CannonDesign. This includes being responsible for developing and leading high-performance diverse teams focused on the development and implementation of the office or regional Market Business Plan..  You will contribute to the success of the firm including the areas of business development and client engagement, client, and team leadership, mentoring of our people, and advancing the quality of work. You will be accountable to integrate our range of design services, managing our processes and delivering solid financial performance for the market. Importantly, you will be an ambassador of our brand, championing Living-Centered Design and bringing our Firm's purpose - to help people continuously flourish - to life in every touchpoint you have with our clients.", "qualifications": {"required": "Bachelor degree in a relevant field required. \nCurrent Registration/Licensure in Architecture, Interior Design or Engineering preferred. \nAdditional certifications and/or training relevant to this role are preferred. \nMust have a minimum of 15 years of experience with a proven track record of strategic growth, market and team leadership, and business development success in the Health Market. \nStrong presentations skills are essential. \nExceptional client and people leadership skills required. \nStrong business acumen and proven ability to create and execute strategy is needed. \nProfessional acumen and maturity demonstrated by the ability to communicate authentically and respectfully is essential. \nAbility to inspire, motivate and develop high-performing, accountable teams. \nMust be able to demonstrate sound judgement and a sound approach regarding risk management and mitigation. \nSome travel required.  ", "preferred": "Current Registration/Licensure in Architecture, Interior Design or Engineering preferred. \nAdditional certifications and/or training relevant to this role are preferred."}, "skills": ["Leadership", "Business Development", "Client Engagement", "Team Leadership", "Mentoring", "Design Services", "Financial Performance", "Brand Management", "Living-Centered Design", "Client Management", "Market Research", "Strategic Planning", "Presentation Skills", "Business Acumen", "Risk Management", "Communication", "Team Building", "Staff Development", "Diversity and Inclusion"], "postedDate": "1 month ago", "benefits": "The salary range for this position is $156,640 to $195,800 annually. This salary range is the range we believe is the anticipated range of possible base compensation at the timing of the posting. We may ultimately pay more or less than the anticipated salary range for the position. Employees may be eligible for discretionary bonuses. We offer a full benefit package including medical, dental and vision coverage and flexible spending account options and voluntary insurances. We have paid time off, flex-time summer hours, remote work options and a 401k plan and employee perk programs. For a general overview of our benefits, please visit our careers page at https://www.cannondesign.com/careers/benefits. Actual compensation may vary from posting based on geographic location, work experience, education and/or skill level.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3980233459"}