{"jobTitle": "Accounts Payable Clerk", "company": {"name": "Valley Power Systems", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Truck Transportation", "description": "Job Details<br/><br/><strong>Description<br/><br/></strong><strong>Position Overview:<br/><br/></strong>Perform accounting and clerical tasks related to the efficient maintenance and processing of accounts payable transactions.<br/><br/><strong><strong>Principal Duties And Responsibilities (Essential Functions)</strong>:<br/><br/></strong><ul><li>Pays vendors by monitoring discount opportunities; scheduling and preparing checks; resolving purchase orders, contracts, invoices, or payment discrepancies and documentation; insuring credit is received for outstanding memos; issuing stop-payments or purchase order amendments.</li><li>Maintains all accounts payable reports, spreadsheets and corporate accounts payable files.</li><li>Reconciles processed work by verifying entries and comparing system reports to balances.</li><li>Charges expenses to accounts and cost centers by analyzing invoice/expense reports; recording entries.</li><li>Maintains accounting ledgers by verifying and posting account transactions.</li><li>Verifies vendor accounts by reconciling monthly statements and related transactions.</li><li>Coding invoices.</li><li>Prepare and process checks for multi companies.</li><li>Update and maintain vendor database.</li><li>Able to process and enter 200-300 invoices per week.</li><li>Ability to process and follow-up on rush items.</li><li>Reviews all invoices for appropriate documentation and approval prior to payment.</li><li>Prints and obtains signatures on all accounts payable checks.</li><li>Distributes signed checks as required.</li><li>Assists in monthly closings.</li><li>Prepares analysis of accounts, as required.</li><li>Performs coping and filing.</li><li>Ability to establish and maintain effective working relationships with vendors and employees. .<br/><br/></li></ul><strong><strong>Qualifications &amp; Skills:<br/><br/></strong></strong><ul><li>Solid understanding of basic bookkeeping and accounting payable principles.</li><li>Ability to prioritize and to multi-task in a fast paced environment.</li><li>Ability to handle confidential information in a discreet and professional manner.</li><li>Excellent oral and written communication skills.</li><li>Excellent organizational and analytical skills.</li><li>Proficient with MS Word, Excel and 10 key.</li><li>Data entry experienced.</li><li>Customer service orientation and negotiation skills.<br/><br/></li></ul><strong><strong>Education &amp; Experience:<br/><br/></strong></strong><ul><li>High school diploma or an equivalent combination of education and/or experience.</li><li>Bachelor’s degree in Finance, Accounting or Business Administration preferred.</li><li>Prior experience in Accounts Payable – minimum 1 year<br/><br/></li></ul><strong><strong>Physical Requirements:<br/><br/></strong></strong>While performing the duties of this job the employee is regulatory required to stand, walk, sit, use hands and fingers, handle or feel, reach with hands and arms, grasp, hold and manipulate office equipment and talk and hear. The employee is occasionally required to carry up to 15 pounds alone. The employee may occasionally be required to balance or climb short distances. Specific vision ability required by this job includes close vision, color vision, peripheral vision, depth perception and ability to adjust focus with or without ocular aides<br/><br/><strong><strong>Other Criteria:<br/><br/></strong></strong><ul><li>Complies with Company policies and procedures.</li><li>Performs job safely with respect to others, property and to individual safety.</li><li>Works effectively with others in the Company to encourage teamwork and productivity.<br/><br/></li></ul><strong><strong>Physical Requirements:<br/><br/></strong></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/><ul><li>While performing the duties of this job, the employee is frequently required to use hands to finger, handle or feel; reach with hands and arms; and talk or hear.</li><li>The employee occasionally is required to stand; walk;</li><li>The employee is frequently required to sit or balance.</li><li>The employee may occasionally lift and/or move objects up to 50 pounds.</li><li>Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.<br/><br/></li></ul><strong>EEO Statement<br/><br/></strong>Valley Power Systems, Inc and Its Families of Companies, provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "postedDate": "1 month ago", "skills": ["MS Word", "Excel", "10 key", "Data entry", "Customer service", "Negotiation"], "url": "https://www.linkedin.com/jobs/view/3980565675"}