{"jobTitle": "Asset Renewal Construction Manager - Education", "company": {"name": "Cordoba Corporation", "industry": "Civil Engineering", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$180,000.00/yr - $190,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Civil Engineering", "description": "Cordoba Corporation is a leading engineering and design firm based in California. We are seeking a Asset Renewal Construction Manager to support the Education Sector. The Asset Renewal Construction Manager shall provide direction and management for the assigned project and ensure on-schedule completion within or below budget in accordance with contractual obligations. The Asset Renewal Construction Manager will be focused on planning and defining program goals and devising methods to accomplish them, developing in-depth knowledge of owner objectives, contract terms, and airport policies. The Asset Renewal Construction Manager is responsible for planning, directing, supervising and controlling the execution of all technical, fiscal, and administrative aspects of the project.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Working with team members and airport management to develop budgets, schedules, and plans for the various elements of a project </li><li> Provide review and initial approval of the tenant acquisition submittal packages prior to official submittal in order to determine accuracy and completeness and compliance to our Aviation client's CDD requirements. Monitor the development of the acquisition process to ensure adequate review time in accordance with the component acquisition submittal schedule as approved by BOAC action. </li><li> Provide initial draft of NTP letters and support documents including supplemental conditions as may be necessary for clarification of project conditions and all other supporting documentation as requested by Program Executive. </li><li> Facilitate coordinating the execution of design related Request for Building Modifications. </li><li> Lead the review and approval of exemption requests as may be required to amend design documents. Accept, reject, or mitigate these requests as may be appropriate. </li><li> Facilitate execution of vertical transportation design modification requests as required for agency approvals. </li><li> Facilitate the draft of acceptance letter as required by the lease, on behalf of the Program Executive. </li><li> Hold preconstruction meeting to facilitate the proper start of the project. </li><li> Coordinate with Airport departments to facilitate goals and objectives for administrative, technical, engineering through closeout functions. </li><li> Managing project scope to meet or exceed project goals and objectives </li><li> Maintaining documentation on the approved scope of work for the project to include all related agreements, authorizations, reports, drawings and specifications. This documentation shall include narratives for all scopes of work as well as a coordinated CAD representation including all projects for key disciplines </li><li> Coordination with the Design Manager who will be managing the design process during design and construction including resolution of technical design issues, issuing design non-compliances, issuing field non-conformances, timely processing of RFI’s, coordinating shop drawing reviews, participation in and approval of factory and site acceptance tests, coordinating material approvals, coordinating mock up approvals, providing reports, drawings and specification interpretation, participation in testing and commissioning activities, managing the punch list process and other activities as required to ensure the design process supports the project goals </li><li> Coordination with the Design Manager who will be managing the Design Review Team (DRT) design review process for assigned project(s) through all phases of design including significant design changes during construction </li><li> Monitoring of permitting information and the permitting process required of the design team and contractor </li><li> Becoming thoroughly familiar with required contractual obligations and technical aspects of all facilities to be erected </li><li> Enforce program requirements explicit to the Design and Construction Handbook in effect at the time of the tenant lease and contract. Track pending revisions and liaise with stakeholders to enact Exemption Requests serving potential benefit, accordingly. Enforce supplemental Design Guidelines as may come into effect or are in effect from time to time. </li><li> Liaise with stakeholders while enforcing IT Design Guidelines as this document and subsequent IT requirements may change from the date of the program inception and the date of the Design Construction Handbook. This challenge is further increased by the fact that some information technologies and special systems technology procurement packages tend to be performance based or design build systems with a dynamic set of performance criteria as well as security criteria that are not defined. It is incumbent upon the project manager to strike a balance with the tenant and airport stakeholders in order to successfully facilitate closure to design, execution and commissioning of these systems. </li><li> Thoroughly understand the agreements and amendments between the design professionals and/or contractors and our Aviation client in terms of legal and performance requirements including acquisition delivery schedules, component delivery dates, pending notices including NTP or any BOAC action requiring the support of the project manager. </li><li> Anticipate and identify and resolve any program conflicts related to design, construction, operations, commissioning, safety and security. Actively liaise with Airport Operations, Facilities Maintenance &amp; Utilities, CDD, Planning, IMT, Shutdown Control Center (SCC), Airport Police Division (APD), and Inspection. </li><li> Facilitate ASR and USR meetings with Airport Operations to review short- and long-term detailed execution plans with contractors ahead of SCC application. </li><li> Create submittal register to establish the document to be reviewed by our Aviation client's Subject Matter Experts as a part of the submittal review process. </li><li> Create the RFI review process to establish processing flow and documentation. </li><li> Manage process flow of the submittal and RFI process. </li><li> Maintain and monitor project and program schedule files. Distribute updated schedule files and provide notifications as may be required for integrated elements including initiating of mitigating actions as may be required. </li><li> Ensuring all work is being performed with and inspected to the latest versions of plans and specifications including approved changes, submittals, and RFI’s </li><li> Working with designer, contractor and stakeholders to develop the overall planning of construction activities and identifying critical milestones and priorities </li><li> Keeping alert to possible problem areas and taking preventative action to ensure critical milestones are met for each phase of the project </li><li> Ensuring the use of safe and sound construction practices </li><li> Preparing reports summarizing progress of construction activities for senior management </li><li> Reviewing change proposals for contractual compliance and alignment with fair market value </li><li> Preparing a monthly risk report </li><li> Monitoring adherence to the quality assurance/quality control plan, and other documents as required and promoting excellence on the project through the application of quality assurance processes </li><li> Enforcing the program requirements for all areas of the project and monitoring the draft and final deliverables for adherence to these criteria </li><li> Reviewing pay applications to ensure proper verification of completed work and compliance with contract requirements </li><li> Working with the key project individual to devise and execute action plans to rectify potential cost overruns or delays, or to accommodate significant changes to the scope of work </li><li> Assuring that current and timely change orders are documented and administered properly </li><li> Participating in all necessary coordination meeting with the designer, contractor, and stakeholders <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Professional Experience Level/Other Qualifications:<br/><br/></strong><ul><li> 15 years or more experience, preferably on airport projects </li><li> Experience with projects more than $50 million in value. </li><li> Experience with various delivery methods, including Design-Bid-Build, Design+CMAR and Design/Build </li><li> Proven ability to perform in a project management capacity </li><li> Excellent written and oral communication skills and a thorough knowledge of industry practices and regulations </li><li> Must have a self-starter attitude with proactive, results-oriented focus; and willing and capable to assume additional responsibilities </li><li> Must be able to interface with a variety of people with different technical levels and educational backgrounds </li><li> Must be detail oriented and highly organized <br/><br/></li></ul><strong>Education/Training:<br/><br/></strong><ul><li> Bachelor’s degree in Architecture, Aviation, Business, Engineering, Construction Management, Planning or other related technical field required </li><li> Master's degree preferred </li><li> Relevant professional licensure and/or certification are strongly preferred. Certifications may include AAAE, LEED, PE, PMP, AICP, etc. <br/><br/></li></ul><strong>Software:<br/><br/></strong><ul><li> Proficient in Microsoft Office Suite and Bluebeam </li><li> Familiarity with Project Management Information Systems </li><li> Ability to work in CAD or REVIT a plus <br/><br/></li></ul>Salary Range: $180K to $190K per year.<br/><br/>Location: Los Angeles, CA. This role is 100 percent onsite.<br/><br/><strong>Our Company<br/><br/></strong><strong>Cordoba Corporation: Building Excellence in Infrastructure<br/><br/></strong>Cordoba Corporation, a nationally recognized civil engineering, construction management, program management, and planning firm, has a proven track record of success. Our expertise spans diverse sectors, including education and facilities, transportation, water, and energy. Through close collaboration with our clients, we have consistently delivered complex, high-impact infrastructure projects across California, demonstrating our stability and growth potential.<br/><br/>National Recognition - Cordoba’s efforts have garnered national acclaim. Engineering News-Record (ENR) has consistently ranked us as a “top 100 construction management firm” and a “top 50 program management firm.” Additionally, ENR recognized Cordoba as a “top 100 design firm” in California in 2018. Our business model emphasizes efficiency, fostering a dynamic work environment. We approach projects with multifaceted strategies, ensuring successful outcomes.<br/><br/>Statewide Presence—With headquarters in Los Angeles, Cordoba maintains a solid presence statewide. Our offices extend to San Francisco, Sacramento, San Ramon, Chatsworth, Santa Ana, Ontario, and San Diego.<br/><br/><strong>Cordoba Corporation: Enhancing Employee Well-Being!<br/><br/></strong>At Cordoba Corporation, we value our employees and their well-being. That's why we offer a comprehensive range of benefits and perks. We provide multiple medical and dental insurance plans, as well as vision insurance, all of which are subsidized for both employees and dependents.  Our benefits package also includes employer-paid AD&amp;D and life insurance, a 401k with an industry-leading employer match, generous vacation and sick leave accruals, 9 paid holidays, and other forms of paid time off.  We also offer flexible spending accounts (FSA’s) including medical care reimbursement, dependent care reimbursement, and commuter benefit plans. In addition, employees are eligible for our employee assistance program and well-being benefits that include stress management, nutrition, and financial well-being. We believe that by taking care of our employees, we can all thrive together.<br/><br/>Cordoba Corporation is committed to providing equal employment opportunities and promoting diversity and inclusion. We welcome applicants from all backgrounds, regardless of race, color, religion, sex, national origin, age, disability, or genetics. We believe a diverse and inclusive workforce is essential for our success, and we value and respect every individual's unique contribution.<br/><br/>Harassment-Free Workplace: We strictly prohibit workplace harassment based on any factor, including race, gender, sexual orientation, or disability. Cordoba is committed to fostering a healthy and happy lifestyle for our employees within and beyond the workplace.<br/><br/>For inquiries or accommodation, please get in touch with our HR Department at (213) 895-0224.<br/><br/>Join Cordoba Corporation and be part of shaping California’s future!<br/><br/>", "responsibilities": "Working with team members and airport management to develop budgets, schedules, and plans for the various elements of a project Provide review and initial approval of the tenant acquisition submittal packages prior to official submittal in order to determine accuracy and completeness and compliance to our Aviation client's CDD requirements. Monitor the development of the acquisition process to ensure adequate review time in accordance with the component acquisition submittal schedule as approved by BOAC action. Provide initial draft of NTP letters and support documents including supplemental conditions as may be necessary for clarification of project conditions and all other supporting documentation as requested by Program Executive. Facilitate coordinating the execution of design related Request for Building Modifications. Lead the review and approval of exemption requests as may be required to amend design documents. Accept, reject, or mitigate these requests as may be appropriate. Facilitate execution of vertical transportation design modification requests as required for agency approvals. Facilitate the draft of acceptance letter as required by the lease, on behalf of the Program Executive. Hold preconstruction meeting to facilitate the proper start of the project. Coordinate with Airport departments to facilitate goals and objectives for administrative, technical, engineering through closeout functions. Managing project scope to meet or exceed project goals and objectives Maintaining documentation on the approved scope of work for the project to include all related agreements, authorizations, reports, drawings and specifications. This documentation shall include narratives for all scopes of work as well as a coordinated CAD representation including all projects for key disciplines Coordination with the Design Manager who will be managing the design process during design and construction including resolution of technical design issues, issuing design non-compliances, issuing field non-conformances, timely processing of RFI’s, coordinating shop drawing reviews, participation in and approval of factory and site acceptance tests, coordinating material approvals, coordinating mock up approvals, providing reports, drawings and specification interpretation, participation in testing and commissioning activities, managing the punch list process and other activities as required to ensure the design process supports the project goals Coordination with the Design Manager who will be managing the Design Review Team (DRT) design review process for assigned project(s) through all phases of design including significant design changes during construction Monitoring of permitting information and the permitting process required of the design team and contractor Becoming thoroughly familiar with required contractual obligations and technical aspects of all facilities to be erected Enforce program requirements explicit to the Design and Construction Handbook in effect at the time of the tenant lease and contract. Track pending revisions and liaise with stakeholders to enact Exemption Requests serving potential benefit, accordingly. Enforce supplemental Design Guidelines as may come into effect or are in effect from time to time. Liaise with stakeholders while enforcing IT Design Guidelines as this document and subsequent IT requirements may change from the date of the program inception and the date of the Design Construction Handbook. This challenge is further increased by the fact that some information technologies and special systems technology procurement packages tend to be performance based or design build systems with a dynamic set of performance criteria as well as security criteria that are not defined. It is incumbent upon the project manager to strike a balance with the tenant and airport stakeholders in order to successfully facilitate closure to design, execution and commissioning of these systems. Thoroughly understand the agreements and amendments between the design professionals and/or contractors and our Aviation client in terms of legal and performance requirements including acquisition delivery schedules, component delivery dates, pending notices including NTP or any BOAC action requiring the support of the project manager. Anticipate and identify and resolve any program conflicts related to design, construction, operations, commissioning, safety and security. Actively liaise with Airport Operations, Facilities Maintenance &amp; Utilities, CDD, Planning, IMT, Shutdown Control Center (SCC), Airport Police Division (APD), and Inspection. Facilitate ASR and USR meetings with Airport Operations to review short- and long-term detailed execution plans with contractors ahead of SCC application. Create submittal register to establish the document to be reviewed by our Aviation client's Subject Matter Experts as a part of the submittal review process. Create the RFI review process to establish processing flow and documentation. Manage process flow of the submittal and RFI process. Maintain and monitor project and program schedule files. Distribute updated schedule files and provide notifications as may be required for integrated elements including initiating of mitigating actions as may be required. Ensuring all work is being performed with and inspected to the latest versions of plans and specifications including approved changes, submittals, and RFI’s Working with designer, contractor and stakeholders to develop the overall planning of construction activities and identifying critical milestones and priorities Keeping alert to possible problem areas and taking preventative action to ensure critical milestones are met for each phase of the project Ensuring the use of safe and sound construction practices Preparing reports summarizing progress of construction activities for senior management Reviewing change proposals for contractual compliance and alignment with fair market value Preparing a monthly risk report Monitoring adherence to the quality assurance/quality control plan, and other documents as required and promoting excellence on the project through the application of quality assurance processes Enforcing the program requirements for all areas of the project and monitoring the draft and final deliverables for adherence to these criteria Reviewing pay applications to ensure proper verification of completed work and compliance with contract requirements Working with the key project individual to devise and execute action plans to rectify potential cost overruns or delays, or to accommodate significant changes to the scope of work Assuring that current and timely change orders are documented and administered properly Participating in all necessary coordination meeting with the designer, contractor, and stakeholders", "qualifications": {"required": "15 years or more experience, preferably on airport projects Experience with projects more than $50 million in value. Experience with various delivery methods, including Design-Bid-Build, Design+CMAR and Design/Build Proven ability to perform in a project management capacity Excellent written and oral communication skills and a thorough knowledge of industry practices and regulations Must have a self-starter attitude with proactive, results-oriented focus; and willing and capable to assume additional responsibilities Must be able to interface with a variety of people with different technical levels and educational backgrounds Must be detail oriented and highly organized", "preferred": "Bachelor’s degree in Architecture, Aviation, Business, Engineering, Construction Management, Planning or other related technical field required Master's degree preferred Relevant professional licensure and/or certification are strongly preferred. Certifications may include AAAE, LEED, PE, PMP, AICP, etc."}, "skills": ["Microsoft Office Suite", "Bluebeam", "Project Management Information Systems", "CAD", "REVIT"], "postedDate": "1 month ago", "benefits": "Cordoba Corporation, a nationally recognized civil engineering, construction management, program management, and planning firm, has a proven track record of success. Our expertise spans diverse sectors, including education and facilities, transportation, water, and energy. Through close collaboration with our clients, we have consistently delivered complex, high-impact infrastructure projects across California, demonstrating our stability and growth potential.<br/><br/>National Recognition - Cordoba’s efforts have garnered national acclaim. Engineering News-Record (ENR) has consistently ranked us as a “top 100 construction management firm” and a “top 50 program management firm.” Additionally, ENR recognized Cordoba as a “top 100 design firm” in California in 2018. Our business model emphasizes efficiency, fostering a dynamic work environment. We approach projects with multifaceted strategies, ensuring successful outcomes.<br/><br/>Statewide Presence—With headquarters in Los Angeles, Cordoba maintains a solid presence statewide. Our offices extend to San Francisco, Sacramento, San Ramon, Chatsworth, Santa Ana, Ontario, and San Diego.<br/><br/><strong>Cordoba Corporation: Enhancing Employee Well-Being!<br/><br/></strong>At Cordoba Corporation, we value our employees and their well-being. That's why we offer a comprehensive range of benefits and perks. We provide multiple medical and dental insurance plans, as well as vision insurance, all of which are subsidized for both employees and dependents.  Our benefits package also includes employer-paid AD&amp;D and life insurance, a 401k with an industry-leading employer match, generous vacation and sick leave accruals, 9 paid holidays, and other forms of paid time off.  We also offer flexible spending accounts (FSA’s) including medical care reimbursement, dependent care reimbursement, and commuter benefit plans. In addition, employees are eligible for our employee assistance program and well-being benefits that include stress management, nutrition, and financial well-being. We believe that by taking care of our employees, we can all thrive together.<br/><br/>Cordoba Corporation is committed to providing equal employment opportunities and promoting diversity and inclusion. We welcome applicants from all backgrounds, regardless of race, color, religion, sex, national origin, age, disability, or genetics. We believe a diverse and inclusive workforce is essential for our success, and we value and respect every individual's unique contribution.<br/><br/>Harassment-Free Workplace: We strictly prohibit workplace harassment based on any factor, including race, gender, sexual orientation, or disability. Cordoba is committed to fostering a healthy and happy lifestyle for our employees within and beyond the workplace.<br/><br/>For inquiries or accommodation, please get in touch with our HR Department at (213) 895-0224.<br/><br/>Join Cordoba Corporation and be part of shaping California’s future!<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980049603"}