{"jobTitle": "Safety and Security Manager", "company": {"name": "Imagine", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "102,630 to $128,370/yearly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Advertising Services", "description": "At Imagine we go beyond print to help our clients deliver game-changing visual communications from concept to delivery that set the standard for our industry. The first step in this process is hiring great employees! Our innovative teams are the most committed, highly experienced artisans in the business. We are committed to delivering high-quality marketing solutions, in every environment and campaign, helping our clients capture the heart, minds, and loyalty of their customers. For more than 30 years, The Imagine Group has established itself as one of the most influential and innovative visual communications companies in the industry. Join us and let’s Imagine a better way together.<br/><br/><strong>Midnight Oil (moagency.com),</strong> strategically located in \"the heart of Hollywood\" in Burbank, CA, is an extraordinary creative, and specialty print production partner to the majority of theatrical and streaming studios, with relationships often measured in terms of decades, not years. We uniquely and conveniently combine our Studio and Print Production capabilities all under one roof in our 120,000 square feet facility, with an Amtrak stop and the Burbank Airport directly across the street. However, our “secret sauce” is simply our people … we have the best, most passionate, most capable team of 125 motivated employees who always delivers exceptional solutions to our clients as we aren't satisfied being anything short of the best. Generally speaking, we shape creative ideas by making them better and bringing them to life in virtually any media format, on-time, and to the highest standards of quality. And, we do things the right way as our culture of mutual respect, transparency, collaboration, and a strong commitment to diversity and inclusion makes MO a great place to work.<br/><br/><strong>Position Summary</strong>: The Safety &amp; Security Manager is responsible for developing, implementing, and overseeing all safety initiatives, programs, and protocols. The incumbent will ensure compliance with safety regulations and lead the creation of a safe working environment as well as a secure facility.<br/><br/><strong>This is an onsite role out of our Burbank, CA office.<br/><br/></strong><strong>Essential Functions and Responsibilities:<br/><br/></strong><ul><li>Manages, plans, and implements programs to reduce or eliminate occupational injuries, illnesses, deaths, and financial losses.</li><li>Develops accident-prevention and loss-control systems and programs for incorporation into operational policies of organization.</li><li>Manages and coordinates safety activities, through subordinate supervisory personnel, to ensure implementation of safety activities throughout organization.</li><li> Identifies and appraises conditions that could produce accidents and financial losses and evaluates potential extent of injuries resulting from accidents.</li><li>Maintains liaison with outside organizations, such as fire departments, mutual aid societies, and rescue teams to assure information exchange and mutual assistance.</li><li>Devises methods to evaluate safety programs and conducts or directs evaluations.</li><li>Instill a safety culture that drives awareness and injury prevention at every level.</li><li>Ensure contractors are trained and comply on security and safety policies.</li><li>Assists and manages Environmental Safety tasks.</li><li>Manage building service providers.</li><li>Other duties as assigned.<br/><br/></li></ul><strong>Mandatory Qualifications:<br/><br/></strong><ul><li>Experience in CALOSHA and EHS is required.</li><li>Change agent to support the optimization of our fulfillment methods</li><li>Effective leader with the ability to coordinate cross-functional teams to accomplish objectives in a fast-paced, high-growth, and diverse environment.</li><li>Excellent communication skills with ability to interact with a diverse population ranging from front-line staff to senior management.<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Preferred 7+ years minimum managing the Safety function in a manufacturing environment.</li><li>Dynamic, Hands-on, and results-oriented, with positive attitude and solid work ethic.</li><li>Associate degree or 5+ years of related experience preferred.</li><li>Bilingual or multilingual proficiency in any language (including ASL) preferred<br/><br/></li></ul><strong>Physical Requirements:<br/><br/></strong><ul><li>Ability to lift, push and pull up to 50 lbs.</li><li>Ability to visually inspect all work for defects and distinguish colors.</li><li>Frequent reaching, bending, climbing, kneeling, crouching, and stooping.</li><li>Manual dexterity for repetitive work.</li><li>Frequent walking and standing.</li><li>Chemicals: Exposure to chemicals found in a production environment.</li><li>Travel: N/A<br/><br/></li></ul>The national pay range for this role is $102,630 to $128,370/yearly. The pay range may be slightly lower or higher based on the geographic location. The actual pay offered may vary based upon, but not limited to education, skills, experience, proficiency, performance, shift, and location. In addition to base salary, depending on the role, the total compensation package may also include participation in a bonus, commission, or incentive program. Imagine offers benefits including medical, dental, and vision coverage, paid time off, disability insurance, 401(k) with match, life insurance and other voluntary supplemental insurance coverages, plus tuition assistance, caregiver leave, adoption assistance, and employer/partner discounts.<br/><br/>Imagine is an equal opportunity employer and does not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Diversity and Inclusion are not just a checked box, it is a critical part of our commitment to deliver innovative solutions to our clients and provide a great place to work for our entire Imagine family. We are focused on building a diverse and inclusive workforce. If you are excited about this role but do not meet 100% of the qualifications listed above, we encourage you to apply.<br/><br/>", "responsibilities": "The Safety &amp; Security Manager is responsible for developing, implementing, and overseeing all safety initiatives, programs, and protocols. The incumbent will ensure compliance with safety regulations and lead the creation of a safe working environment as well as a secure facility.<br/><br/><strong>This is an onsite role out of our Burbank, CA office.<br/><br/></strong><strong>Essential Functions and Responsibilities:<br/><br/></strong><ul><li>Manages, plans, and implements programs to reduce or eliminate occupational injuries, illnesses, deaths, and financial losses.</li><li>Develops accident-prevention and loss-control systems and programs for incorporation into operational policies of organization.</li><li>Manages and coordinates safety activities, through subordinate supervisory personnel, to ensure implementation of safety activities throughout organization.</li><li> Identifies and appraises conditions that could produce accidents and financial losses and evaluates potential extent of injuries resulting from accidents.</li><li>Maintains liaison with outside organizations, such as fire departments, mutual aid societies, and rescue teams to assure information exchange and mutual assistance.</li><li>Devises methods to evaluate safety programs and conducts or directs evaluations.</li><li>Instill a safety culture that drives awareness and injury prevention at every level.</li><li>Ensure contractors are trained and comply on security and safety policies.</li><li>Assists and manages Environmental Safety tasks.</li><li>Manage building service providers.</li><li>Other duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Experience in CALOSHA and EHS is required.\nChange agent to support the optimization of our fulfillment methods\nEffective leader with the ability to coordinate cross-functional teams to accomplish objectives in a fast-paced, high-growth, and diverse environment.\nExcellent communication skills with ability to interact with a diverse population ranging from front-line staff to senior management.<br/><br/>", "preferred": "Preferred 7+ years minimum managing the Safety function in a manufacturing environment.\nDynamic, Hands-on, and results-oriented, with positive attitude and solid work ethic.\nAssociate degree or 5+ years of related experience preferred.\nBilingual or multilingual proficiency in any language (including ASL) preferred<br/><br/>"}, "skills": ["CALOSHA", "EHS", "Safety", "Security", "Management", "Leadership", "Communication", "Manufacturing"], "postedDate": "1 day ago", "benefits": "Imagine offers benefits including medical, dental, and vision coverage, paid time off, disability insurance, 401(k) with match, life insurance and other voluntary supplemental insurance coverages, plus tuition assistance, caregiver leave, adoption assistance, and employer/partner discounts.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980679688"}