{"jobTitle": "Global Client Solutions Manager - Team Amazon - Los Angeles", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "60,000.00 - 80,000.00", "currency": "USD"}, "jobFunction": "Advertising and Marketing", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>About TikTok<br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>About the Team <br/>Our Global Agency &amp; Accounts team works with leading multinational partners to deliver innovative technology solutions and ser as a strategic and consultative partner.  The team plays a critical role in establishing and leading partnerships to develop TikTok solutions that build businesses and brands across our integrated suite of products. <br/><br/>About The Role<br/>The Global Client Solutions Manager (CSM) will work closely with the sales team to provide support and expertise in meeting client objectives and providing best in class customer service to internal and external clients. This team member will work across multiple lines of business within the Amazon portfolio and collaborate closely with cross-functional teams in the org, including Sales Ops, Product, Measurement, and Creative Solutions.  <br/>The CSM will be responsible for negotiating, managing, and optimizing complex opportunities spanning the full marketing funnel.  They will use data and analytics to build consultative solutions for our clients. They will establish and strengthen key client relationships with a focus on driving revenue, advertiser education &amp; advertiser satisfaction. Success in this position requires a passion for delivering best in class client service, ability to navigate cross-functional programs and projects, and skill in on-the-ground execution.  <br/><br/>Responsibilities:<br/>- Partner with Brand Partnerships Managers and the Team Lead to manage and grow relationships with our advertisers<br/>- Spearhead the development and implementation of plans, measurement solutions, and reporting across both performance campaigns and custom programs/sponsorships<br/>- Manage inventory booking and presale pipeline, reporting, and opportunity accuracy in CRM platform<br/>- Recommend optimization strategies and monitor implementation and execution to exceed KPIs and advance learning agendas<br/>- Identify and present insights on product usage and aggregated data to accelerate client business and drive incremental revenue growth through upsell conversations <br/>- Build trusted relationships as an external product consultant educating partners on new TikTok features, product solutions, and best practices to scale industry knowledge and drive education<br/>- Demonstrate a proactive approach to troubleshooting and problem solving through proper escalation channels <br/><br/>Qualifications<br/><br/>Minimum qualifications:<br/>- 3+ years of experience in account management/media services roles in digital marketing or ad tech.  Experience in an auction environment is a plus<br/>- Excellent communication and collaboration skills across multiple businesses, cross-functional teams, and geographies<br/>- Strong project management skills.  Experience prioritizing and managing tasks within a fast-paced environment. Comfortable running status meetings, managing action items, and keeping everyone updated on status of all associated projects/programs. Able to manage the expectations of internal and external stakeholders<br/>- Track record of supporting revenue goals<br/>- Ability to analyze data and identify insights using datasets from our Ads Manager platform and Brand Lift Studies<br/>- Experience diagnosing and solving technical problems with product and engineering teams<br/><br/>Preferred qualifications:<br/>- Passion for data and technology - leverage data to drive strategy and measure success; comfort with technology to understand what drives product adoption and influence the product roadmap<br/>- Comfortable working in a startup culture: Demonstrates flexibility and is quick to adapt to changes<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $60000 - $80000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Partner with Brand Partnerships Managers and the Team Lead to manage and grow relationships with our advertisers\n- Spearhead the development and implementation of plans, measurement solutions, and reporting across both performance campaigns and custom programs/sponsorships\n- Manage inventory booking and presale pipeline, reporting, and opportunity accuracy in CRM platform\n- Recommend optimization strategies and monitor implementation and execution to exceed KPIs and advance learning agendas\n- Identify and present insights on product usage and aggregated data to accelerate client business and drive incremental revenue growth through upsell conversations \n- Build trusted relationships as an external product consultant educating partners on new TikTok features, product solutions, and best practices to scale industry knowledge and drive education\n- Demonstrate a proactive approach to troubleshooting and problem solving through proper escalation channels ", "qualifications": {"required": "- 3+ years of experience in account management/media services roles in digital marketing or ad tech.  Experience in an auction environment is a plus\n- Excellent communication and collaboration skills across multiple businesses, cross-functional teams, and geographies\n- Strong project management skills.  Experience prioritizing and managing tasks within a fast-paced environment. Comfortable running status meetings, managing action items, and keeping everyone updated on status of all associated projects/programs. Able to manage the expectations of internal and external stakeholders\n- Track record of supporting revenue goals\n- Ability to analyze data and identify insights using datasets from our Ads Manager platform and Brand Lift Studies\n- Experience diagnosing and solving technical problems with product and engineering teams", "preferred": "- Passion for data and technology - leverage data to drive strategy and measure success; comfort with technology to understand what drives product adoption and influence the product roadmap\n- Comfortable working in a startup culture: Demonstrates flexibility and is quick to adapt to changes"}, "skills": [], "postedDate": "1 week ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980504209"}