{"jobTitle": "LA GTM Manager", "company": {"name": "Pickle", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Must be located in Los Angeles and open to a hybrid (partially in-office / working from home) working environment. Please apply by emailing alexandra@shoponpickle.com and include the following:\n\n- Share 1-3 (max) bullets on why you think you're a standout applicant for this role\n- Share 1-2 (max) bullets summarizing a GTM initiative you're most proud of and the impact it drove (we love metrics!)\n- Share your Pickle username and your favorite app feature\n\nPickle is a rental marketplace that aims to monetize the billions of underutilized assets sitting in consumers closets and brands inventory. Users can easily tap into shared closets within their community through flexible and/or on-demand delivery options. Our goal is to provide affordable and convenient access to quality items exactly when our users need them. We are starting with P2P clothing/accessories and expanding to other categories.\n\nWe are looking for a market leader to drive expansion and growth in the LA market. LA is our second launch market, after NYC. We've launched it from 0 to 1 and are looking for someone to own scaling it from 1 to 100.\n\nWe are looking for someone deeply understands the LA landscape and target Pickle demographic within LA. This candidate is someone who is passionate about Pickle, scaling communities, driving GTM strategies, and executing on growth initiatives. They will be integral to setting the strategy for our organic and paid marketing initiatives in the LA market. They will be responsible for overseeing and managing marketing campaigns, community events, and strategic partnerships. They must be proficient in data analysis to monitor and measure the success of the LA market growth on both the supply and demand sides of the marketplace.", "responsibilities": "Lead the execution of our Los Angeles growth initiatives on both the demand and supply sides of the marketplace. Analyze and report on the performance the Los Angeles market including transaction growth, supply growth, user growth, customer conversion, and local market engagement. Build and nurture a thriving community of renters and lenders in LA, including driving brand loyalty and expanding pool of top renters and lenders; you should have in-depth knowledge of our LA user base and be able to identify strong users as candidates our brand ambassador program. Develop and execute comprehensive marketing strategies to drive brand awareness, user acquisition, and engagement in LA. Drive word-of-mouth marketing initiatives, leveraging user-generated content and community engagement. Drive customer conversion: monitor new user behaviour and rental request volume; nurture new users to their first successful rental (we're big on \"do things that don't scale\" and once they work, finding ways to operationalize them to scale). User centric-mindset: actively gets in the weeds to understand the operations of the LA market and leverages data to identify areas of improvement to either execute upon directly or to inform cross-functional teams (eg product). Collaborate with cross-functional teams to align marketing strategies with business goals and product launches. Be our internal expert on Los Angeles community, culture, and demographic behaviors. You'll help us operationalize and playbook key initiatives to help facilitate new market launches.", "qualifications": {"required": "5-8 years experience in Strategy & Operations, Growth Ops, GTM, RGM, with at least 2+ years in a GTM, Market Lead, and/or Market Launcher role. Highly cross-functional team player who is eager to not only lead the strategy, but also participate in execution. Proven track record of successfully managing and scaling user/customer acquisition in new markets. Strong analytical skills, with the ability to interpret data and make informed decisions. Experience working with lean startup budgets, driving user acquisition from largely organic efforts, supplemented by a small paid portfolio. Results-driven with a extremely high ownership mindset; you set aggressive goals and have proven ability to follow through and deliver results. Creative thinker with a passion for fashion and circularity. Excellent communication, organization and accountability (our head office and your manager are based in NYC; we're looking for someone who we can strongly rely on to execute in-market). Strong interpersonal skills (you'll be interacting with users and partners on a daily basis - not only do we need you to be in the weeds on the metrics and Ops but we also need our user base to love you as the face of our LA market). Experience in a startup or fast-paced environment.", "preferred": "Experience driving user acquisition for peer-to-peer marketplaces or app-centric e-commerce businesses."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Competitive compensation and equity. Health, dental, vision insurance options. Pickle credits for our employees, we love when the team uses Pickle! Fun team events and company parties. Company offsites.", "remoteWork": "Hybrid (partially in-office / working from home)", "url": "https://www.linkedin.com/jobs/view/3980454891"}