{"jobTitle": "BUSINESS SYSTEMS ANALYST / DATA ANALYST", "company": {"name": "City of Riverside", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "The City of Riverside is accepting applications for the position of Business Systems Analyst to fill one (1) vacancy in the Human Resources Department. The eligibility list established may be used to fill the current and/or upcoming vacancies within this classification for up to six (6) months.<br/><br/>The Business Systems Analyst position in the Human Resources Department will report under the administrative direction of the Business Systems Manager, in the Human Resources Information System (HRIS) Division. This position will primarily work to develop, build, and implement data dashboards and reports from multiple HR/Finance systems; maintain Sharepoint PowerApps/PowerAutomation tools; serve as a member of project teams; manage projects; and perform other related work as required<br/><br/>Under general supervision, a Business Systems Analyst will perform a variety of professional, technical and analytical duties in the areas of systems analysis and testing, system troubleshooting and business policies and procedures review; assist in the implementation of complex computer systems for various Departments; provide user support and to assist in additional system module implementation including vendor upgrades; provide highly responsible assistance to higher level management staff; and will perform related duties as assigned.<br/><br/>Work Performed<br/><br/>Typical duties may include, but are not limited to, the following:<br/><br/><ul><li>Perform complex system testing, user documentation and implementation of added systems features.</li><li>Perform system analysis for large and complex projects; test and recommend system solutions.</li><li>Communicate with, and provide highly responsible support to, system users.</li><li>Perform procedural audits on business systems of large scope and complexity; identify areas to be considered for improved efficiency.</li><li>Analyze and troubleshoot complex system problems/solutions.</li><li>Define and conduct necessary advanced user system training.</li><li>Prepare and design complex and technical system generated reports.<br/><br/></li></ul>Qualifications<br/><br/>Education: Equivalent to a Bachelors degree from an accredited college or university with major work in business administration, finance, or closely related field. Up to two years of additional qualifying experience may substitute for the required education.<br/><br/>Experience: Two years of responsible experience in automated system implementation.<br/><br/>Highly Desired Qualifications<br/><br/><ul><li>Experience with dashboard creation, KPIs, metrics, report writing, database/systems support - PowerBI, Tableau, other closely related systems; knowledge of SQL and database relationship</li><li>Experience with Learning Management Systems (LMS), Talent Management Systems (TMS), Enterprise Resource Planning (ERP) or other large-scale enterprise level systems</li><li>Experience with Modern Sharepoint Development: PowerAutomate, PowerApps <br/><br/></li></ul>Necessary Special Requirement:<br/><br/>Possession of an appropriate, valid class \"C\" California Motor Vehicle Operator's License.<br/><br/>Selection Process<br/><br/>Documents Required At The Time Of Application<br/><br/><ul><li> Completed Employment Application</li><li> Completed Supplemental Questionnaire<br/><br/></li></ul> FOR GENERAL INFORMATION ON COMPLETING YOUR ON-LINE APPLICATION, CLICK HERE: (  Application Guide). <br/><br/>The selection process will begin with an employment application package screening, with the best qualified candidates being invited to participate further in the assessment process. This process may include any combination of written, performance, and oral assessments to evaluate job-related education, experience, knowledge, skills, and abilities. Those who successfully complete the selection process will be placed on the eligibility list for this classification.<br/><br/>Important Information On Scheduling Assessments<br/><br/>If you are selected to move forward in the assessment process, you may be required to self-schedule your appointment. You will be notified via email of your status and provided with self-scheduling instructions. Please check your email regularly following the closing date of this recruitment.<br/><br/>Positions that require, or may require, a California Commercial Driver’s License are considered Safety Sensitive and are monitored by the U.S. Department of Transportation. Any candidate being considered for a Safety Sensitive position must submit authorization forms to the City immediately upon request to begin the pre-employment process.<br/><br/>It is the responsibility of candidates with a disability requiring accommodation in the assessment process to contact the Human Resources Department in writing to request such accommodation prior to the closing date of this recruitment.<br/><br/>Appointment may be subject to the successful completion of a pre-employment background investigation, drug screen, and/or medical/ physical examination .<br/><br/> NOTE  : The City reserves the right to modify selection devices and test instruments in accordance with accepted legal, ethical, and professional standards. Candidates may reapply when there is a posting to establish an eligibility list.<br/><br/>Educational Requirements<br/><br/>Proof of education listed in your application will be requested at the time of conditional offer. Acceptable documentation consists of transcripts or degree, if applicable, by the accredited U.S. college or university.<br/><br/>Education obtained outside the United States (US) require one of the following options:<br/><br/>An equivalency statement from an evaluation company certified by the National Association of Credential Evaluation Services (NACES) at http://www.naces.org/members.html or the Association of International Credential Evaluators Inc. (AICE) at http://aice-eval.org/members/ . An advanced-level degree from an accredited US college or university.<br/><br/> All applicants will be notified via e-mail or telephone of their application status and the assessment dates/times/locations after the closing date of this announcement. <br/><br/> THE PROVISIONS OF THIS JOB ANNOUNCEMENT DO NOT CONSTITUTE AN EXPRESSED OR IMPLIED CONTRACT. <br/><br/>Level II includes Senior Management, Management and Professional classifications (Exempt).<br/><br/>The City offers an attractive benefits package, the central provisions of which are as follows:<br/><br/><ul><li>Retirement for Classic Members - For employees hired after 1/1/2013 who are CLASSIC MEMBERS of California Public Employees' Retirement System (CalPERS) or a reciprocal agency as of 12/31/12 and have not been separated from service from such agency for six months or more, the retirement benefit shall be 2.7 % @ age 55; 3 year final compensation. The required employee contribution is 8%.The City does not participate in Social Security; thus, employees do not bear this additional 6.2% expense. </li><li>Retirement for New Members - For employees hired 1/1/2013 or later and who ARE NOT a member of the California Public Employees' Retirement System (CalPERS) or a reciprocal agency as of 12/31/12, or those who have been separated from a public agency which contracts with CalPERS or a reciprocal agency for six months or more, the retirement benefit shall be 2% at age 62; 3 year final compensation.The required employee contribution is 50% of the normal cost. And is subject to change per CalPERS every fiscal year. The City does not participate in Social Security; thus, employees do not bear this additional 6.2% expense. </li><li>Health Insurance - The City offers six health insurance plans and contributes up to $1,516 per month for HMO plans (family coverage). </li><li>Dental Insurance - The City provides three dental insurance plans and contributes up to $45 per month. </li><li>Vision Insurance - The City provides vision coverage through Vision Service Plan (VSP) for employees and their dependents that are enrolled in medical coverage. </li><li>Life Insurance - The City provides and pays for term life insurance with accidental death and dismemberment equal to two times the annual salary rounded to the next highest $1,000 (up to $700k) plus AD&amp;D. Additional Life Insurance is available and voluntary for employee and eligible dependents (up to $300k). </li><li>Deferred Compensation - The City contributes $100 per month with a minimum employee contribution of $12.50 per check.Participation in the deferred compensation plan is optional. </li><li>Leave Benefits - Includes all the typical vacation leave, sick leave, bereavement leave, and holiday benefits. </li><li>Flexible Spending Account - The City offers a Health Care and Dependent Care Flexible Spending Plan for optional participation. </li><li>Long Term Disability - The City offers optional enrollment in the Long Term Disability Plan. </li><li>LegalEase Plan - Optional legal services plan for employees and eligible dependents. </li><li>Critical Illness Plan - Optional critical illness insurance plan for employees and eligible dependents. </li><li>Vacation Accrual - 0-9 yrs. = 144 hrs., 10+ yrs. = 184 hrs. </li><li>Administrative Leave - 64 hrs per fiscal year. <br/><br/></li></ul>For additional benefits information, please visit the following website: https://www.riversideca.gov/human/employee-hub/benefits/about-1<br/><br/>For part-time, benefitted positions the insurance and other benefits (leave accruals, holidays, etc.) are pro-rated based on ½ or ¾ time status.<br/><br/>Closing Date/Time: 8/18/2024 11:59 PM Pacific", "responsibilities": "Perform complex system testing, user documentation and implementation of added systems features.Perform system analysis for large and complex projects; test and recommend system solutions.Communicate with, and provide highly responsible support to, system users.Perform procedural audits on business systems of large scope and complexity; identify areas to be considered for improved efficiency.Analyze and troubleshoot complex system problems/solutions.Define and conduct necessary advanced user system training.Prepare and design complex and technical system generated reports.", "qualifications": {"required": "Equivalent to a Bachelors degree from an accredited college or university with major work in business administration, finance, or closely related field. Up to two years of additional qualifying experience may substitute for the required education.<br/><br/>Two years of responsible experience in automated system implementation.", "preferred": "Experience with dashboard creation, KPIs, metrics, report writing, database/systems support - PowerBI, Tableau, other closely related systems; knowledge of SQL and database relationshipExperience with Learning Management Systems (LMS), Talent Management Systems (TMS), Enterprise Resource Planning (ERP) or other large-scale enterprise level systemsExperience with Modern Sharepoint Development: PowerAutomate, PowerApps"}, "skills": ["PowerBI", "Tableau", "SQL", "database", "PowerApps", "PowerAutomate", "Sharepoint", "LMS", "TMS", "ERP"], "postedDate": "1 month ago", "benefits": "The City offers an attractive benefits package, the central provisions of which are as follows:<br/><br/><ul><li>Retirement for Classic Members - For employees hired after 1/1/2013 who are CLASSIC MEMBERS of California Public Employees' Retirement System (CalPERS) or a reciprocal agency as of 12/31/12 and have not been separated from service from such agency for six months or more, the retirement benefit shall be 2.7 % @ age 55; 3 year final compensation. The required employee contribution is 8%.The City does not participate in Social Security; thus, employees do not bear this additional 6.2% expense. </li><li>Retirement for New Members - For employees hired 1/1/2013 or later and who ARE NOT a member of the California Public Employees' Retirement System (CalPERS) or a reciprocal agency as of 12/31/12, or those who have been separated from a public agency which contracts with CalPERS or a reciprocal agency for six months or more, the retirement benefit shall be 2% at age 62; 3 year final compensation.The required employee contribution is 50% of the normal cost. And is subject to change per CalPERS every fiscal year. The City does not participate in Social Security; thus, employees do not bear this additional 6.2% expense. </li><li>Health Insurance - The City offers six health insurance plans and contributes up to $1,516 per month for HMO plans (family coverage). </li><li>Dental Insurance - The City provides three dental insurance plans and contributes up to $45 per month. </li><li>Vision Insurance - The City provides vision coverage through Vision Service Plan (VSP) for employees and their dependents that are enrolled in medical coverage. </li><li>Life Insurance - The City provides and pays for term life insurance with accidental death and dismemberment equal to two times the annual salary rounded to the next highest $1,000 (up to $700k) plus AD&amp;D. Additional Life Insurance is available and voluntary for employee and eligible dependents (up to $300k). </li><li>Deferred Compensation - The City contributes $100 per month with a minimum employee contribution of $12.50 per check.Participation in the deferred compensation plan is optional. </li><li>Leave Benefits - Includes all the typical vacation leave, sick leave, bereavement leave, and holiday benefits. </li><li>Flexible Spending Account - The City offers a Health Care and Dependent Care Flexible Spending Plan for optional participation. </li><li>Long Term Disability - The City offers optional enrollment in the Long Term Disability Plan. </li><li>LegalEase Plan - Optional legal services plan for employees and eligible dependents. </li><li>Critical Illness Plan - Optional critical illness insurance plan for employees and eligible dependents. </li><li>Vacation Accrual - 0-9 yrs. = 144 hrs., 10+ yrs. = 184 hrs. </li><li>Administrative Leave - 64 hrs per fiscal year. <br/><br/></li></ul>For additional benefits information, please visit the following website: https://www.riversideca.gov/human/employee-hub/benefits/about-1<br/><br/>For part-time, benefitted positions the insurance and other benefits (leave accruals, holidays, etc.) are pro-rated based on ½ or ¾ time status.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980280656"}