{"jobTitle": "Senior Production Planner", "company": {"name": "Relativity Space", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "101,000.00/yr - 129,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Company Overview<br/><br/></strong>At Relativity Space, we have two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. Both contribute to our long-term vision of creating humanity’s industrial base on Mars, paving the way for interplanetary life to expand the possibilities of the human experience. This journey begins right here on Earth – where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity, thanks to our iterative approach that accelerates design, testing, and development while minimizing costs. While our groundbreaking research and development in 3D printing pushes the boundaries of large-scale additive manufacturing.<br/><br/>Your journey with us is more than just a job – it’s an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate, creative individuals. Join us on this extraordinary journey, as we work together to transform our vision into reality.<br/><br/><strong>About The Team<br/><br/></strong>The engine manufacturing department's mission is to product high performing products &amp; manufacturing systems by continuously innovating on cost, quality, and lead time. Through cross-functional collaboration, high levels of accountability, and a focus on safety we support the Terran R program. We are responsible for providing design feedback on new hardware iterations, developing new manufacturing methods and systems, and ultimately building engine and vehicle hardware for testing prior to our first launch. Our team's highlights from the last 6 months include the MDC of the first Aeon-R engine, completing thousands of hours of PBF printing, building and testing over 50 valves of 26 different iterations, and implementing large scale process improvements along the way.<br/><br/><strong>About The Role<br/><br/></strong>Your primary role will include leading integrated scheduling and resource planning, developing and maintaining production schedule and performing schedule baseline change control, collecting and tracking performance and, conducting critical path and variance analyses. You will also provide visibility, status, and regular reviews on schedule performance. You will be expected to resource load, analyze, and optimize production planning schedules to meet required dates while collaborating with design, manufacturing and supply chain counterparts to status critical procurements and impact to schedule, while performing “what if” scenarios, and helping to develop recovery plans.<br/><br/><ul><li>Develop schedules and plans involving both internal resources, partner team resources, and external vendor resources.</li><li>Work with other production planners in other work centers to align on priorities for your product line(s) and collectively respond to changes when they arise.</li><li>Production demand planning duties, to provide actionable insights and drive improved schedule performance for our team.</li><li>Provide meaningful metrics and data to help demonstrate where data collection, measurement and analysis can be valuable in informing strategic decisions regarding resource allocation and planning.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>Bachelor’s degree in Finance, Business, Engineering or Project Management</li><li>4+ years of experience with large project controls, project planning and IMS; Proficiency with resource loaded schedules using Smartsheet, MS Project, or comparable software</li><li>Strong computer skills (MS Excel, MS Project, Smartsheet)</li><li>Demonstrated experience managing high complexity projects, showcasing strong attention to detail<br/><br/></li></ul><strong>Nice To Haves But Not Required<br/><br/></strong><ul><li>2+ years working with broad/deep scheduling and planning</li><li>Previous experience in manufacturing, defense, or aerospace <br/><br/></li></ul><strong>Relativity Space offers competitive salary and equity, a generous vacation policy, </strong><strong>an annual </strong><strong>L&amp;D stipend and more! <br/><br/></strong><strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></strong>At Relativity Space, we are committed to transparency and fairness in our compensation practices. Actual compensation will be determined based on experience, qualifications, and other job-related factors.<br/><br/><strong>Compensation is only one part of our total rewards package. Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more! To see some of the benefits &amp; perks we offer, please visit here.<br/><br/></strong><strong>Hiring Range<br/><br/></strong>$101,000—$129,000 USD", "responsibilities": "Your primary role will include leading integrated scheduling and resource planning, developing and maintaining production schedule and performing schedule baseline change control, collecting and tracking performance and, conducting critical path and variance analyses. You will also provide visibility, status, and regular reviews on schedule performance. You will be expected to resource load, analyze, and optimize production planning schedules to meet required dates while collaborating with design, manufacturing and supply chain counterparts to status critical procurements and impact to schedule, while performing “what if” scenarios, and helping to develop recovery plans.<br/><br/><ul><li>Develop schedules and plans involving both internal resources, partner team resources, and external vendor resources.</li><li>Work with other production planners in other work centers to align on priorities for your product line(s) and collectively respond to changes when they arise.</li><li>Production demand planning duties, to provide actionable insights and drive improved schedule performance for our team.</li><li>Provide meaningful metrics and data to help demonstrate where data collection, measurement and analysis can be valuable in informing strategic decisions regarding resource allocation and planning.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Finance, Business, Engineering or Project Management\n4+ years of experience with large project controls, project planning and IMS; Proficiency with resource loaded schedules using Smartsheet, MS Project, or comparable software\nStrong computer skills (MS Excel, MS Project, Smartsheet)\nDemonstrated experience managing high complexity projects, showcasing strong attention to detail<br/><br/>", "preferred": "2+ years working with broad/deep scheduling and planning\nPrevious experience in manufacturing, defense, or aerospace <br/><br/>"}, "skills": ["Smartsheet", "MS Project", "MS Excel", "Project Management", "Project Controls", "Resource Planning", "Scheduling", "Production Planning", "Demand Planning", "Manufacturing", "Aerospace", "Defense"], "postedDate": "1 week ago", "benefits": "Relativity Space offers competitive salary and equity, a generous vacation policy, an annual L&D stipend and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980476632"}