{"jobTitle": "Product Merchandiser", "company": {"name": "TravisMathew", "location": "Huntington Beach, CA"}, "location": "Huntington Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,200.00/yr - $112,800.00/yr", "currency": "USD"}, "jobFunction": "Design and Product Management", "industry": "Retail Apparel and Fashion", "description": "TravisMathew is a premium apparel brand that exists because we seized an opportunity—and we’re inviting you to take yours. Back in 2007, we saw there weren’t many companies whose clothing bridged the gap between performance and lifestyle, so we created our own. Inspired by the sun, surf, and sand of Southern California, we became a leading innovator in lifestyle performance apparel by making clothes for real life—plus working with premium wholesalers, building a leading e-commerce business, and opening retail stores around the world. We invite you to join team TravisMathew.<br/><br/>JOB OVERVIEW<br/>The Product Merchandiser is responsible for the product direction and management of designated product lines. This individual will work closely with the Sr. Product Merchandiser to develop a line and assortment that represents TravisMathew and is aligned with the merchandise strategy. The Product Merchandiser will maintain the brand vision and execute best in class product offerings from inception through completion. <br/><br/>ROLES AND RESPONSIBILITIES<br/><ul><li>Act as the primary point of contact for communication and partnership with the Nordstrom team, managing relationships and coordinating initiatives for all Nordstrom SMUs.</li><li>Create, maintain, and update all ranking files, including researching and incorporating comp data as necessary. This person will serve as the information hub between all cross functional partners and ensure the rankings and product is shared with teammates throughout the process.</li><li>Provide comprehensive support for capsule launches, including proto notes, merch board updates, pre-SMS notes, one sheets, lab dip requests, recap meetings, and serve as the information hub between cross functional partners.</li><li>Review market research and internal reports to anticipate product trends and marketing strategies. While also supporting weekly and monthly selling reports providing insightful summaries of performance metrics and identifying areas for improvement.</li><li>Take ownership of footwear rankings, conducting analysis and implementing strategies to optimize performance.</li><li>Create product descriptions while maintaining accurate and compelling product information across all DTC channels, while also providing product accuracy notes to all images provided for both DTC &amp; Nordstrom</li><li>Assist in creating and formatting presentations, ensuring consistency and professionalism in all materials. While also presenting the product findings in critical checkpoints in the calendar</li></ul><br/>Qualifications <br/><ul><li>Proficient in Microsoft Applications (i.e., Excel, PowerPoint, Word)</li><li>Proficient in Adobe Illustrator</li><li>Experience with PLM, Centric preferred</li><li>Strong analytical skills with proficiency in Excel and data analysis tools</li><li>Excellent communication and interpersonal skills</li><li>Ability to multitask and prioritize in a fast-paced environment</li><li>Detail-oriented with a proactive and solution-focused mindset. Ability to manage multiple projects simultaneously</li><li>Strong organization, attention to detail, and follow up skills</li><li>Ability to work effectively and collaboratively with cross functional teams and stake holders</li><li>A team player who is focused on quality of finished product</li></ul><br/>EDUCATION AND EXPERIENCE<br/><ul><li>Bachelor’s Degree in Business, Marketing, Merchandising or related field</li><li>Minimum 3 years’ experience in a product merchandising capacity</li></ul><br/>PHYSICAL REQUIREMENTS / WORK ENVIRONMENT (if applicable)<br/><ul><li>Work is performed in a designated professional office workstation and environment.</li><li>Responsibilities will require an onsite presence</li></ul>", "responsibilities": "The Product Merchandiser is responsible for the product direction and management of designated product lines. This individual will work closely with the Sr. Product Merchandiser to develop a line and assortment that represents TravisMathew and is aligned with the merchandise strategy. The Product Merchandiser will maintain the brand vision and execute best in class product offerings from inception through completion. <br/><br/>ROLES AND RESPONSIBILITIES<br/><ul><li>Act as the primary point of contact for communication and partnership with the Nordstrom team, managing relationships and coordinating initiatives for all Nordstrom SMUs.</li><li>Create, maintain, and update all ranking files, including researching and incorporating comp data as necessary. This person will serve as the information hub between all cross functional partners and ensure the rankings and product is shared with teammates throughout the process.</li><li>Provide comprehensive support for capsule launches, including proto notes, merch board updates, pre-SMS notes, one sheets, lab dip requests, recap meetings, and serve as the information hub between cross functional partners.</li><li>Review market research and internal reports to anticipate product trends and marketing strategies. While also supporting weekly and monthly selling reports providing insightful summaries of performance metrics and identifying areas for improvement.</li><li>Take ownership of footwear rankings, conducting analysis and implementing strategies to optimize performance.</li><li>Create product descriptions while maintaining accurate and compelling product information across all DTC channels, while also providing product accuracy notes to all images provided for both DTC &amp; Nordstrom</li><li>Assist in creating and formatting presentations, ensuring consistency and professionalism in all materials. While also presenting the product findings in critical checkpoints in the calendar</li></ul>", "qualifications": {"required": "Proficient in Microsoft Applications (i.e., Excel, PowerPoint, Word), Proficient in Adobe Illustrator, Experience with PLM, Centric preferred, Strong analytical skills with proficiency in Excel and data analysis tools, Excellent communication and interpersonal skills, Ability to multitask and prioritize in a fast-paced environment, Detail-oriented with a proactive and solution-focused mindset. Ability to manage multiple projects simultaneously, Strong organization, attention to detail, and follow up skills, Ability to work effectively and collaboratively with cross functional teams and stake holders, A team player who is focused on quality of finished product", "preferred": "Bachelor’s Degree in Business, Marketing, Merchandising or related field, Minimum 3 years’ experience in a product merchandising capacity"}, "skills": ["Microsoft Applications", "Excel", "PowerPoint", "Word", "Adobe Illustrator", "PLM", "Centric", "Analytical Skills", "Communication", "Interpersonal Skills", "Multitasking", "Prioritization", "Detail-Oriented", "Problem Solving", "Organization", "Follow Up", "Teamwork"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981860241"}