{"jobTitle": "Store Manager - Yorba Linda", "company": {"name": "Peet's Coffee", "industry": "Food and Beverage Services", "size": "51-200 employees", "location": "Yorba Linda, CA"}, "location": "Yorba Linda, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60,000.00 - $75,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Manufacturing, Food and Beverage Services, and Retail", "description": "Peet’s is currently seeking passionate Store Managers. The Store Manager is an inspirational leader who expands and deepens that unwavering commitment to mastery by ensuring unequaled quality and service. The Store Manager drives growth through ownership and authenticity while developing our future leaders.", "responsibilities": "Promotes a culture of authenticity, respect, dignity and integrity. Facilitates change and empowers employees to grow. Inspires a shared purpose and engagement. Models a passion and commitment to continued success. Effectively utilizes tools and has a strong sense of ownership to drive results. Has an unwavering commitment to quality in store operations and the customer experience. Champions the ongoing spirit of development and professional growth across their team. Creates a culture that attracts, retains and develops the highest quality Assistant Store Managers, Shift Leaders, Baristas and Team Members.", "qualifications": {"required": "Have a minimum of three years’ experience as a Manager for high quality food service or retail provider. with superior customer service standards and/or related experience and training. Consistently demonstrate performance that embodies Peet’s Vision, Mission and Values. Carry a friendly, energetic, personable demeanor and have a passion for great customer service, with a customer-first and quality-focused mentality. Carry themselves professionally, be agile and maintain composure in a fast-paced environment. Have strong time-management and delegation skills. Possess good problem-solving skills and sound judgment. Have the ability to perform various physical tasks during the work shift.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Starting hourly pay, based on a 40 hour work week, between $60,000- $75,000.00 per year. 401(k) plan, with generous matching. Full medical, dental and vision insurance. Employee Assistance Program including mental health resources for all employees. Tuition scholarship opportunities through Oregon State University E Campus to any of the 95+ OSU degrees offered as well as Online Career Educational Programs, through LinkedIn Learning. Opportunities for growth and advancement. Paid vacation, holidays and sick leave. Bonus program - paid monthly. Pay adjustments may be awarded in conjunction with strong employee performance documented by the performance evaluation process, role changes or market conditions. Free coffee and fresh baked goods as well as an employee discount.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981323816"}