{"jobTitle": "Marketing & Business Development Senior Manager", "company": {"name": "JM Eagle", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Plastics Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Role Overview:</strong> As the Marketing &amp; Business Development Senior Manager, you will play a pivotal role in shaping our marketing strategies, fostering government relations, and driving business development initiatives. Reporting directly to the Vice President of Sales, you will lead a team to execute comprehensive marketing campaigns, build relationships with key stakeholders, and navigate government regulations to ensure our continued success.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Innovative Marketing Strategies:</li><ul><li>Develop and implement cutting-edge marketing strategies and campaigns based on robust data analysis. </li><li>Identify and leverage effective marketing channels to deliver compelling product messages to our target audience. </li></ul><li>Government Relations:</li><ul><li>Oversee research and relationship building with local governments, municipalities, engineering organizations, and water departments. </li><li>Navigate vendor applications and requirements for accepted building materials, ensuring compliance with regulations. </li></ul><li>Market Research and Analysis:</li><ul><li>Conduct in-depth research on clients, prospects, competitors, and industries to identify market conditions and new business opportunities. </li><li>Stay abreast of changes in governmental policies and assess their impact on the company's future. </li></ul><li>Team Leadership:</li><ul><li>Provide direction and management to assigned staff, ensuring timely response to marketing material requests. </li><li>Collaborate with the business development and marketing teams to coordinate efforts seamlessly. </li></ul><li>Digital Media Strategy:</li><ul><li>Oversee the creation and management of a robust digital media strategy to enhance our online presence. </li></ul><li>Stakeholder Relations:</li><ul><li>Build and maintain trust relationships with stakeholders, business partners, and regulators. </li><li>Liaise with the creative team and other departments to create branded promotional materials. <br/></li></ul></ul><strong>Requirements:<br/><br/></strong><ul><li>Bachelor’s degree in Marketing, Lobbying, or Business Development. </li><li>10 years of related experience, including a minimum of 5 years in upper management. </li><li>Strong knowledge of government regulations related to forms, permits, and applications in the specified industry. </li><li>Proven track record of successful marketing leadership and business development. </li><li>Exceptional analytical and strategic thinking skills. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage.<br/><br/>JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach. JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.<br/><br/>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage. JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach. JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3981867240"}