{"jobTitle": "Account Executive - Key Accounts (Target)", "company": {"name": "Speedo", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "<strong>Account Executive - Key Accounts (Target)</strong><br/>\n<br/>\n<strong>Incumbent should reside near our Corporate office in Cypress, California or in the Minneapolis, MN area. </strong><br/>\n<br/>\n<br/>\n<strong>WE ARE SPEEDO</strong><br/>\n<br/>\nThe world's leading swimwear brand, Speedo is passionate about life in and around the water. The brand's heritage of innovation derives from its leadership in competitive swimming, where more Olympic Gold Medals have been won in Speedo than any other brand. Unmatched in performance, fit and feel, we are also America’s #1 goggle brand.<br/>\n<br/>\nFrom the first splash, to every stroke, the genuine love and excitement we have working with the water is what creates exciting and meaningful relationships.<br/>\n<br/>\nSpeedo is not where we work, but is who we are.<br/>\n<br/>\nIt’s watching a baby in the pool for the first time or our athletes make history. What we do is sacred to us and our connection to the rest of water lovers around the world. Driven by the challenge, not the glory. At Speedo, it is never enough to be good at what you do; you have to love what you do.<br/>\n<br/>\n<strong>Speedo is a part of the Pentland Brands Limited Family. </strong><br/>\n<br/>\nWe are Pentland Brands, a global family business bringing some of the most loved active and footwear brands to millions of people around the world.<br/>\n<br/>\nWe own Speedo, Berghaus, Canterbury of New Zealand, Endura, Mitre, ellesse, Red or Dead and we’re the UK licensee for Kickers and have a joint venture partnership for Lacoste footwear. Our products are available in over 190 countries and are sold either directly by Group companies or are represented by licensees and distributors.<br/>\n<br/>\nAll our brands have their own unique identities and every one of them is powered by Pentland. We have more than 1,200 employees worldwide and we’re always on the lookout for talented, enthusiastic people to help shape our future.<br/>\n<br/>\nWe celebrate differences and give everyone the freedom to innovate and develop, be it through creative working environments or learning opportunities. Our brands are there in the moments that matter - being there for more people, in more of those moments, drives everything we do.<br/>\n<br/>\nAt Pentland, we’re guided by four principles, we use these to make sure we’re not only doing a great job, but we’re doing it in the right way:<br/>\n<ul><li>is a team game</li><li>clarity and courage</li><li>as standard</li><li>good conscience</li></ul><br/>\n<br/>\nWe believe in building brands for the world to love, generation after generation. Your potential is our potential and together we can build and grow brands that last.<br/>\n<br/>\n<strong>KEY PURPOSE: </strong><br/>\nAs a Speedo Account Executive, you are responsible for supporting and implementing growth strategies that help Speedo and other Pentland brands to drive sales, achieve EBIT goals, and nurture a mutually profitable business relationship at Target.<br/>\n<br/>\n<strong>PRIMARY RESPONSIBILITIES: </strong><br/>\n<ul><li>Support and help drive all GTM and account management functions by taking a strategic, data driven, and consumer-first approach to achieve our shared sales &amp; profitability goals.</li><li>Partner with sales leader to enhance customer relationships by understanding the customer’s needs, their overall business, and build out plans &amp; product assortments to grow sales.</li><li>Collaborate with Speedo planning teams and Target Inventory Analysts on weekly PO transmission and allocation management, while also internally working with Speedo COPs and warehouse partners on PO processing to ensure on-time shipment.</li><li>Manage current &amp; future month order book. Collaborate with Speedo COPs team to ensure accuracy and proper flow of information across internal cross-functional teams (demand planning, production, Logistics/operations, etc.) and externally with the Target partners. Confirm delivery dates, style information, and order styles adjustments are accurate and up to date.</li><li>Work closely with sales leadership and merchandising partners with line plan development and maintenance (style detail, pricing, casepack, factory, etc.).</li><li>Lead organization of digital assets and handoff, support external item setup and maintenance teams.</li><li>Continued monitoring of brand presence on retailer’s sites, ensuring a seamless, easy to navigate experience.</li><li>Partner with business insights and internal planning teams to analyze weekly &amp; monthly performance to build &amp; maximize sales opportunities.</li><li>Partner with sales leadership on day-to-day functions and help manage internal and external communication on business performance and needs.</li><li>Help collaborate with internal Marketing Team &amp; Target Roundel team to develop marketing strategies to support the sales initiatives.</li><li>Assist Merchandise Leads in sample management &amp; in-office mock-up of Target spaces.</li><li>Achieve channel specific and overall Speedo North America sales revenue and profitability goals.</li><li>Build long term, mutually profitable partnerships with Target buying &amp; planning teams, Roundel team, and 3rd party partners – JLBuchanan and Bluebird Group.</li><li>Scheduling &amp; managing travel, expense budgets, &amp; achieve key benchmarks in go-to-market calendar.</li></ul><br/>\n<br/>\n<strong>QUALIFICATIONS &amp; EXPERIENCE: </strong><br/>\n<ul><li>Ability to work independently, keen attention to detail, and driven to succeed.</li><li>Manage a fast-paced schedule, consistently reprioritizing tasks, and executing them with precise attention to detail, staying one step ahead.</li><li>Strong written and verbal communication skills, and ability to build strong relationships.</li><li>Advanced in Microsoft Excel, PowerPoint, and Outlook.</li><li>Ability to analyze, organize, and integrate information into clear and concise presentations.</li><li>Bachelor’s Degree preferred.</li><li>Minimum 5+ years retail or wholesale work experience, at or with Target highly preferred</li><li>Desire to learn and grow.</li><li>Travel is required occasionally, about 4 times/year.</li></ul><br/>\n<br/>\nPay Range: $90,000 - $120,000 annually<br/>\nBase pay is a portion of our total compensation package and determined within a range that allows growth and development within your role. Your base pay will be determined based on experience, skills and qualifications.<br/>\n<br/>\nSpeedo and Pentland Brands are an equal opportunity employer and considers all applicants for employment on the basis of their individual capabilities and qualifications, consistent with applicable law and without regard to race, color, sex, gender identity or expression, age, religion, creed, national origin, citizenship status, sexual orientation, genetic information, physical or mental disability, military status or any other characteristic protected under federal, state or local law. In addition to complying with all applicable laws, we have a strong corporate commitment to inclusion, diversity and to ensuring that all current and future associates are compensated solely on job-related factors such as skill, ability, educational background, work quality, experience and potential. To achieve these goals, applicants are asked not to disclose salary history information.", "responsibilities": "Support and help drive all GTM and account management functions by taking a strategic, data driven, and consumer-first approach to achieve our shared sales & profitability goals.\nPartner with sales leader to enhance customer relationships by understanding the customer’s needs, their overall business, and build out plans & product assortments to grow sales.\nCollaborate with Speedo planning teams and Target Inventory Analysts on weekly PO transmission and allocation management, while also internally working with Speedo COPs and warehouse partners on PO processing to ensure on-time shipment.\nManage current & future month order book. Collaborate with Speedo COPs team to ensure accuracy and proper flow of information across internal cross-functional teams (demand planning, production, Logistics/operations, etc.) and externally with the Target partners. Confirm delivery dates, style information, and order styles adjustments are accurate and up to date.\nWork closely with sales leadership and merchandising partners with line plan development and maintenance (style detail, pricing, casepack, factory, etc.).\nLead organization of digital assets and handoff, support external item setup and maintenance teams.\nContinued monitoring of brand presence on retailer’s sites, ensuring a seamless, easy to navigate experience.\nPartner with business insights and internal planning teams to analyze weekly & monthly performance to build & maximize sales opportunities.\nPartner with sales leadership on day-to-day functions and help manage internal and external communication on business performance and needs.\nHelp collaborate with internal Marketing Team & Target Roundel team to develop marketing strategies to support the sales initiatives.\nAssist Merchandise Leads in sample management & in-office mock-up of Target spaces.\nAchieve channel specific and overall Speedo North America sales revenue and profitability goals.\nBuild long term, mutually profitable partnerships with Target buying & planning teams, Roundel team, and 3rd party partners – JLBuchanan and Bluebird Group.\nScheduling & managing travel, expense budgets, & achieve key benchmarks in go-to-market calendar.", "qualifications": {"required": "Ability to work independently, keen attention to detail, and driven to succeed.\nManage a fast-paced schedule, consistently reprioritizing tasks, and executing them with precise attention to detail, staying one step ahead.\nStrong written and verbal communication skills, and ability to build strong relationships.\nAdvanced in Microsoft Excel, PowerPoint, and Outlook.\nAbility to analyze, organize, and integrate information into clear and concise presentations.\nMinimum 5+ years retail or wholesale work experience, at or with Target highly preferred\nDesire to learn and grow.\nTravel is required occasionally, about 4 times/year.", "preferred": "Bachelor’s Degree"}, "skills": ["Microsoft Excel", "PowerPoint", "Outlook", "Retail", "Wholesale", "Sales", "Account Management", "Customer Relationship Management", "Data Analysis", "Marketing", "Communication", "Relationship Building", "Time Management", "Organization", "Problem Solving", "Teamwork", "Leadership", "Strategic Thinking", "Consumer Insights", "Product Development", "Inventory Management", "Logistics", "Operations", "Digital Assets", "Marketing Strategy", "Presentation Skills", "Travel"], "postedDate": "4 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981841408"}