{"jobTitle": "Assistant Store Manager", "company": {"name": "SEPHORA", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Customer Service", "industry": "Retail Apparel and Fashion", "description": "Assistant Store Manager - Beverly Hills, Beverly Drive, CA\n\nAbout the Company: At Sephora, our people are the driving force behind our success. We believe that the best way to bring top-notch beauty products, services, tools, and experiences to our clients is by finding, training, and engaging the absolute best talent in the industry. Our teams invest heavily in our talent, both at our corporate headquarters and in Sephora stores. We strongly believe (and our actions prove it!) that our people are our best asset, and we work every day to arm them with the knowledge and tools not just to get the job done, but to feel inspired and fearless while doing it.\n\nAbout the Role: As an Assistant Store Manager, you will be responsible for supporting the Store Manager in overseeing the entire store operations, ensuring a high level of client service, and driving sales. You will assist in leading a team of dedicated associates, fostering a positive work environment that encourages growth and development.", "responsibilities": "Supporting Store Operations and Sales: Assist the Store Manager in overseeing daily store operations, ensuring a smooth and efficient client experience. Help develop and implement strategies to drive store sales and increase profitability. Assist in coordinating and overseeing sales and profitability, performance, service, and operations. Team Leadership and Development: Assist in leading, coaching, and motivating a team of associates to meet or exceed sales targets. Conduct performance appraisals, manage employee development and provide ongoing feedback. Support the leadership team, ensuring effective collaboration and achievement of store goals. Client Satisfaction and Service: Ensure high levels of client satisfaction through excellent service. Handle client complaints and provide appropriate solutions. Support client loyalty programs and services to ensure client loyalty and engagement. Store Standards and Compliance: Maintain outstanding store condition and visual merchandising standards. Ensure compliance with company policies and procedures to maintain a safe and efficient work environment. Uphold Sephora brand excellence in-store, ensuring a consistent and high-quality client experience. Resource Management: Assist in managing inventory levels to ensure product availability. Support the Store Manager in allocating resources and handling staffing, ensuring optimal productivity and performance.", "qualifications": {"required": "Proven successful experience as a retail assistant manager. 5 years of experience managing a high volume, complex retail, or hospitality setting (+$8M) leadership skills and business acumen needed. Client management. Strong organizational skills. Excellent communication and interpersonal skills. A knack for attracting, identifying, and inspiring employees.", "preferred": "Not specified"}, "skills": ["Retail Management", "Customer Service", "Team Leadership", "Sales Strategy", "Inventory Management"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Paid paternity leave", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3981850642"}