{"jobTitle": "Partner Operations Manager (POM)", "company": {"name": "Meta", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "105,000.00/yr - 152,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "The Metaverse Content Partnerships and BD team is in need of a Partner Operations Manager to support our partners broadly across the team on operational tasks related to contract onboarding, payment support, marketing approvals and task management for deeper partner engagements.The Partner Operations Manager will report into the Director, Content Partnerships and will provide support beyond Metaverse Content Partnerships' managed partner set (MPS), enabling our team to scale our coverage to more partners and products (including Avatar, Quest Apps and AR content). This creates an opportunity for our team to increase overall scope and ability to execute on Reality Lab product priorities.The Partner Operations Manager role will provide support for multiple product organizations, including the Metaverse (Content, Avatars, Horizon), MR/VR (2D Apps) and AR (Wearables).<br/><br/>Partner Operations Manager (POM) Responsibilities:<br/><br/><ul><li>Partner Onboarding: For all deals outside of the Content Org, the POM will handle partner onboarding into Meta internal tools, including Supplier Onboarding, Third-Party Assessments and coordinating non-disclosure agreements.</li><li>Deal Execution: Where needed, the POM will work with BD &amp; Legal to ensure proper execution of agreements.</li><li>Payments: Where needed, support end-to-end process of partner payments, including creating Purchase Orders and validating invoices.</li><li>Project Management: Help track and communicate project status and progress.</li><li>Task Management: Handle operational tasks and service partner asks that are beyond RL Products and not covered by another partner team.</li><li>Marketing Approvals: Work with Partners, PMM, and Marcomm to procure partner approval for inclusion in Meta marketing campaigns.</li><li>Partner Engagement Support: Support SPMs in providing cross-functional visibility into partner deal execution meetings (e.g. communicating and tracking follow-ups) and coordinating demos and other logistics for larger engagements.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>5+ years of program or project management experience</li><li>Experience in go-to-market planning and execution</li><li>Experience managing multiple projects simultaneously and tracking deliverables</li><li>Experience initiating and driving projects to completion with minimal guidance</li><li>Experience solving complex problems<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Strong communication skills with a focus on being clear, simple, and direct</li><li>Strong technical understanding of internal tools</li><li>Experience managing competing asks and making tough prioritization decisions</li><li>Strong understanding of partner needs and preferences, and translate between internal and external stakeholders<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$105,000/year to $152,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Partner Onboarding: For all deals outside of the Content Org, the POM will handle partner onboarding into Meta internal tools, including Supplier Onboarding, Third-Party Assessments and coordinating non-disclosure agreements.\nDeal Execution: Where needed, the POM will work with BD &amp; Legal to ensure proper execution of agreements.\nPayments: Where needed, support end-to-end process of partner payments, including creating Purchase Orders and validating invoices.\nProject Management: Help track and communicate project status and progress.\nTask Management: Handle operational tasks and service partner asks that are beyond RL Products and not covered by another partner team.\nMarketing Approvals: Work with Partners, PMM, and Marcomm to procure partner approval for inclusion in Meta marketing campaigns.\nPartner Engagement Support: Support SPMs in providing cross-functional visibility into partner deal execution meetings (e.g. communicating and tracking follow-ups) and coordinating demos and other logistics for larger engagements.", "qualifications": {"required": "5+ years of program or project management experience\nExperience in go-to-market planning and execution\nExperience managing multiple projects simultaneously and tracking deliverables\nExperience initiating and driving projects to completion with minimal guidance\nExperience solving complex problems", "preferred": "Strong communication skills with a focus on being clear, simple, and direct\nStrong technical understanding of internal tools\nExperience managing competing asks and making tough prioritization decisions\nStrong understanding of partner needs and preferences, and translate between internal and external stakeholders"}, "skills": [], "postedDate": "1 week ago", "benefits": "$105,000/year to $152,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3981205665"}