{"jobTitle": "Public Relations Coordinator", "company": {"name": "Halara", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "40,000.00/yr - 78,000.00/yr", "currency": "USD"}, "jobFunction": "Public Relations and Writing/Editing", "industry": "Retail Apparel and Fashion", "description": "About Halara\nHalara is an innovative athleisure brand that infuses activewear into everyday apparel, made for what moves you. We apply performance fabric and functionality to designs that adapt to every aspect of your life. Powered by an innovative production model that minimizes waste, we update our styles, fabrics, colors and even lengths based on your feedback.\nWhat you wear should work for you. We believe clothing should not limit movement, comfort, or self-expression. Live without limitations. Live for what moves you.\n\nJoin Our Global Branding Family\nPicture a team filled with awesome marketers to PR representatives, creative directors, video editors, photographers, social media strategists, and copywriters – that’s us, Halara's Global Branding Division. We make it our mission to keep Halara's brand image consistent across the globe. Whether our consumers are in California, Berlin, or Mexico City, we work hard to ensure our brand identity, messaging, and experience resonate universally. We're the ones developing global branding strategies, building our products' robust brand identities, enhancing customer engagement and loyalty, and contributing to the company's long-term success. Being a part of our team means thriving in a cross-cultural environment. It's all about effective teamwork and smooth communication, even across different time zones. And of course, keeping up speed with quick deadlines is key to our collective success.\n\nKey Responsibilities:\n-Managing PR agency relationships, tracking the media outlet pitches and deliverables between different agency partners based on their core competencies \n-Review agency partner media & influencer pitches to ensure brand-alignment, consistent storytelling opportunities and effective brand-reach\n-Participate in brainstorming sessions to ideate media events, offline activations, influencer partnerships and press opportunities \n-Participate in meetings with growth marketing teams (ads, influencer), to identify opportunities to collaborate and amplify cross-functional projects in the media \n-Develop and distribute press releases and media alerts.\n-Develop and manage gifting quality control strategy for editors and influencers\n-Write Linkedin posts to cover offline events, media coverage and key brand moments\n-Implement Search Engine Optimization (SEO), Metadata, Keyword Search, etc., to maximize copy reach for LinkedIn posts\n-Research and document media coverage and track metrics.\n-Develop positive relationships with communications agencies, events agencies and media\n-Assist with the organization and execution of various events.\n\nQualifications:\n-Bachelor's degree in Communications, Public Relations, Marketing, or related field required;\n-3-5 years of experience in PR, influencer marketing, or communication\n-Strong cross-functional collaboration skills and ability to work across multiple teams\n-Excellent written and verbal communication skills\n-Experience with stakeholder management, including agencies, employees, media, and influencers;\n-Deep understanding of social media landscape, influencer strategy and content creation;\n-Analytical mindset with the ability to measure and report on the success of communications initiatives;\n-Strong attention to detail and ability to execute on tactical initiatives quickly and efficiently.", "responsibilities": "-Managing PR agency relationships, tracking the media outlet pitches and deliverables between different agency partners based on their core competencies \n-Review agency partner media & influencer pitches to ensure brand-alignment, consistent storytelling opportunities and effective brand-reach\n-Participate in brainstorming sessions to ideate media events, offline activations, influencer partnerships and press opportunities \n-Participate in meetings with growth marketing teams (ads, influencer), to identify opportunities to collaborate and amplify cross-functional projects in the media \n-Develop and distribute press releases and media alerts.\n-Develop and manage gifting quality control strategy for editors and influencers\n-Write Linkedin posts to cover offline events, media coverage and key brand moments\n-Implement Search Engine Optimization (SEO), Metadata, Keyword Search, etc., to maximize copy reach for LinkedIn posts\n-Research and document media coverage and track metrics.\n-Develop positive relationships with communications agencies, events agencies and media\n-Assist with the organization and execution of various events.", "qualifications": {"required": "Bachelor's degree in Communications, Public Relations, Marketing, or related field required;\n-3-5 years of experience in PR, influencer marketing, or communication\n-Strong cross-functional collaboration skills and ability to work across multiple teams\n-Excellent written and verbal communication skills\n-Experience with stakeholder management, including agencies, employees, media, and influencers;\n-Deep understanding of social media landscape, influencer strategy and content creation;\n-Analytical mindset with the ability to measure and report on the success of communications initiatives;\n-Strong attention to detail and ability to execute on tactical initiatives quickly and efficiently.", "preferred": ""}, "skills": ["PR", "Influencer Marketing", "Communication", "Cross-functional Collaboration", "Stakeholder Management", "Social Media", "Content Creation", "Analytical Skills", "Attention to Detail", "Execution"], "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3981683750"}