{"jobTitle": "Human Resources Director, Manufacturing", "company": {"name": "Ignite Human Capital", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "We are looking for an experienced Human Resources Director to ensure that all human resources (HR) operations are carried on smoothly and effectively. You will be responsible for developing HR strategies and providing sound advice to senior management on all related subjects.<br/><br/>An HR Director must be an experienced professional with deep knowledge of all matters concerning HR departments. You should be able to manage programs and lead staff while also possessing a strong strategic mindset.<br/><br/>The goal is to ensure that all HR needs of the company are being met and are aligned with all business objectives.<br/><br/>Responsibilities<br/><br/> <ul><li>Develop corporate plans for a variety of HR matters such as compensation, benefits, health and safety etc</li><li>Act to support the human factor in the company by devising strategies for performance evaluation, staffing, training and development etc</li><li>Oversee all HR initiatives, systems and tactics</li><li>Supervise the work of HR personnel and provide guidance</li><li>Serve as the point of contact for employment relations and communicate with labor unions</li><li>Monitor adherence to internal policies and legal standards</li><li>Deal with grievances and violations invoking disciplinary action when required</li><li>Anticipate and resolve litigation risks</li><li>Report to senior management by analyzing data and using HR metrics<br/><br/></li></ul>Requirements And Skills<br/><br/> <ul><li>Proven experience as HR Director</li><li>Full understanding of the way an organization operates to meet its objectives</li><li>Excellent knowledge of employment legislation and regulations</li><li>Thorough knowledge of human resource management principles and best practices</li><li>A business acumen partnered with attention to the human element</li><li>Knowledge of data analysis and reporting</li><li>Excellent organizational and leadership skills</li><li>Outstanding communication and interpersonal skills</li><li>Diligent and firm with high ethical standards</li><li>BSc/BA in human resources, business administration or relevant field; MSc/MA in human resources will be a plus</li><li>Bilingual -English &amp; Spanish Needed<br/><br/></li></ul>Powered by JazzHR<br/><br/>PnLz2L0ky8", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3981018295"}