{"jobTitle": "Freight Forwarder Export Coordinator", "company": {"name": "Rock-it Cargo", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "28-30", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Rock-It Cargo has been an award-winning global leader within the entertainment logistics industry for over forty years, providing unrivaled experience and expertise in planning and moving shows and events from clubs to stadiums for cutting edge musical, theatrical and experiential productions. With 300+ employees across 28 offices worldwide, Rock-It handles some of the world’s biggest concerts, festivals, and sporting events for many high-profile clients across the music & sports industries. Rock-It Cargo is the premier freight forwarder for all live events, and works hand-in-hand with clients to make the greatest shows and events possible across the world.<br/><br/>The full-time <strong>Freight Forwarder Export Coordinator</strong> will work from our Los Angeles, CA (90045) office, and assist the Rock-It Cargo Central Operations team with arranging domestic and international transportation for a variety of live performance touring projects. You will be instrumental in the success of our clients’ events. The Freight Forwarder Export Coordinator will strategically identify &amp; book the best routes for each project, prepare and review necessary documentation for the shipments, manage key deadlines to keep projects on track, and cultivate lasting client and vendor relationships. In this role, you will work side-by-side with seasoned operations leaders, deepen your expertise across all types of shipments (air, trucking, and ocean) and projects, and build a strong foundation from which to grow your career in the industry.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Assist the operations department in researching best routes and making bookings for domestic and international freight shipments</li><li>Coordinate domestic and international import/export shipments via all modes of transport: air, trucking and ocean</li><li>Review client manifests and prepare transportation documents</li><li>Cultivate and maintain customer and vendor relationships</li><li>Work closely with carriers, shippers, and consignees to ensure deadlines are met</li><li>Other duties related to client projects, as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>1-2 years of Freight Forwarding experience; experience with live event import/export operations is a plus</li><li>Associate’s or Bachelor’s degree or equivalent industry or military experience</li><li>Basic freight forwarder knowledge; proficiency with air exports is a plus</li><li>An excellent strategic mind – the ideal candidate will be able to expertly prioritize competing responsibilities, meticulously organize multiple complex projects, apply a sharp attention to detail to all work, and handle time-sensitive issues while remaining cool under pressure</li><li>Excellent customer service &amp; vendor relationship management skills</li><li>Comfort with basic Excel functions, and a general ability to learn new software programs quickly</li><li>Flexibility to travel and participate in on-call rotations</li><li>Ability to pass a security background check<br/><br/></li></ul><strong>Benefits &amp; Perks<br/><br/></strong><ul><li>18 paid vacation days per year to start, plus 2 floating holidays and 6 days of paid sick leave per year</li><li>11 paid holidays per year</li><li>Comprehensive medical, dental, and vision plans, plus HSA funding and a 401(k) match</li><li>Generous paid parental leave for all parents</li><li>Employer-Funded Basic Life, AD&amp;D, Short-Term Disability, and Long-Term Disability Insurance</li><li>Continuing Education Reimbursement / Charitable Donation Matching</li><li>The opportunity to work with the best in Live Event, Sports, Film, and Entertainment Logistics</li><li>Eligible for free tickets to client events, when available</li><li>Fantastic culture with regular company events, including birthday lunches, sports games, volunteer activities, and more<br/><br/></li></ul><strong>Don’t meet every single requirement?</strong> Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Rock-It Cargo, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role but your experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.<br/><br/>Rock-It Cargo is committed to the full inclusion of all qualified individuals. As part of this commitment, Rock-It Cargo will ensure that persons with disabilities are provided reasonable accommodations for the hiring process. If reasonable accommodation is needed, please contact hiring@rockitcargo.com<br/><br/>Rock-It Cargo provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status. In addition to federal law requirements, Rock-It Cargo complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company operates. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. Rock-It Cargo expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status.<br/><br/><strong>Job Type/ Industries</strong>: Full-time, Non-Exempt / Logistics, Freight-Forwarding<br/><br/><strong>Location</strong>: Los Angeles, CA (90045), On-site<br/><br/><strong>Salary:</strong> $28-30/hourly<br/><br/><strong>Application Instructions<br/><br/></strong>To apply, please submit resume and cover letter detailing why you want to work at Rock-it Cargo and why you believe you would be a good fit for the position", "responsibilities": "Assist the operations department in researching best routes and making bookings for domestic and international freight shipments\nCoordinate domestic and international import/export shipments via all modes of transport: air, trucking and ocean\nReview client manifests and prepare transportation documents\nCultivate and maintain customer and vendor relationships\nWork closely with carriers, shippers, and consignees to ensure deadlines are met\nOther duties related to client projects, as assigned", "qualifications": {"required": "1-2 years of Freight Forwarding experience; experience with live event import/export operations is a plus\nAssociate’s or Bachelor’s degree or equivalent industry or military experience\nBasic freight forwarder knowledge; proficiency with air exports is a plus\nAn excellent strategic mind – the ideal candidate will be able to expertly prioritize competing responsibilities, meticulously organize multiple complex projects, apply a sharp attention to detail to all work, and handle time-sensitive issues while remaining cool under pressure\nExcellent customer service &amp; vendor relationship management skills\nComfort with basic Excel functions, and a general ability to learn new software programs quickly\nFlexibility to travel and participate in on-call rotations\nAbility to pass a security background check", "preferred": ""}, "skills": ["Freight Forwarding", "Logistics", "Customer Service", "Vendor Management", "Excel"], "postedDate": "1 month ago", "benefits": "18 paid vacation days per year to start, plus 2 floating holidays and 6 days of paid sick leave per year\n11 paid holidays per year\nComprehensive medical, dental, and vision plans, plus HSA funding and a 401(k) match\nGenerous paid parental leave for all parents\nEmployer-Funded Basic Life, AD&amp;D, Short-Term Disability, and Long-Term Disability Insurance\nContinuing Education Reimbursement / Charitable Donation Matching\nThe opportunity to work with the best in Live Event, Sports, Film, and Entertainment Logistics\nEligible for free tickets to client events, when available\nFantastic culture with regular company events, including birthday lunches, sports games, volunteer activities, and more", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981545072"}