{"jobTitle": "Clinic Director, Surgery", "company": {"name": "Morgan Consulting Resources, Inc. - Healthcare Executive Search", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$154,900.00/yr - $415,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative, Strategy/Planning, and Management", "industry": "Hospitals and Health Care and Public Health", "description": "<strong>Morgan Consulting Resources, Inc.</strong> has been retained to conduct the search for the <strong>Clinic Director, Surgery </strong>for <strong>UCLA Health</strong>. This is a fantastic opportunity to join one of the most comprehensive and advanced health care systems in the world.", "responsibilities": "Oversee clinical operations including meeting the requirements for compliance, patient satisfaction, patient safety, and quality and supervision of staff in accordance with UCLA Health policies and procedures and applicable regulatory requirements.", "qualifications": {"required": "Master’s degree (Business Administration, Health Care Administration, Public Health or related field) or combination of education and relevant experience. Healthcare managerial experience. Strategic leadership, planning, and change management skills. Ability to demonstrate a high level of diplomacy in persuading and influencing a wide variety of people at various levels to achieve results. Previous demonstrated expertise in managing patient services and nursing staffing in an environment with a high volume of patient visits. Strong knowledge of industry standards and/or regulatory requirements. Demonstrated ability to identify and analyze all pertinent information/data to make and communicate decisions to meet the unit’s current and future needs. Ability to establish a culture of integrity within their unit and with those external to the units. Skill in setting priorities, which accurately reflect the relative importance of job responsibilities. Ability to establish and maintain productive working relationships with faculty, residents, medical students, and staff from various social, cultural, and economic backgrounds. Ability to interact diplomatically and sympathetically with a patient population in varying degrees of health.", "preferred": "Working knowledge of research-oriented patient care systems. Advanced financial expertise in budget planning and financial forecasting in healthcare.Knowledge of EPIC EHR."}, "skills": [], "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981847680"}