{"jobTitle": "Demand Planner / Purchasing Supervisor", "company": {"name": "TM Cobb / Haley Bros", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$26.00/hr - $35.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Transportation, Logistics, Supply Chain and Storage, and Architecture and Planning", "description": "<strong>Essential Duties and Responsibilities:</strong><br/><br/>The Demand Planner / Purchasing Supervisor is responsible for overseeing and managing aspects of the demand planning and purchasing processes. This role requires a detail-oriented individual with strong analytical skills to forecast demand accurately, manage inventory levels, and ensure the timely procurement of materials. The ideal candidate will have experience in supply chain management, excellent communication skills, and the ability to work collaboratively with various departments to meet company objectives. The main objective of this role is to provide robust Demand Planning insights across various departments and product lines, enhancing our forecasts and inventory recommendations to add an extra layer of intelligence to our purchasing strategies.<br/><br/><strong>Demand Planning Duties:</strong><br/><br/><ol><li>Develop and maintain accurate demand forecasts using historical data, market trends, and sales input.</li><li>Conduct regular demand planning meetings to communicate forecast changes and inventory strategies.</li><li>Collecting data from internal and external sources on factors known to affect demand.</li><li>Analyzing sales, stock, and other data statistics.</li><li>Reviewing historical sales trends.</li><li>Modeling the data to present historical sales and forecast future demand.</li><li>Strategize and develop a platform to present for Sales and Operational Planning meetings.</li><li>Prepare and present demand planning reports to senior management.</li><li>Analyze and interpret sales trends, market dynamics, and customer insights to anticipate demand fluctuations.</li><li>Create and maintain demand planning reports and KPIs to track forecast accuracy and identify areas for improvement.</li><li>Develop, automate and improve current purchasing tools.</li><li>Develop a supplier score card metric and keep maintained with the help of the Purchasing Team.</li></ol><br/><br/><strong>Inventory Management:</strong><br/><br/><ol><li>Develop inventory strategies to balance supply and demand while minimizing excess stock and stockouts.</li><li>Monitor inventory levels and coordinate with the Purchasing Team and Manufacturing Team to ensure timely replenishment of stock.</li><li>Conduct regular inventory audits and reconcile discrepancies.</li><li>Implement and maintain inventory management systems and tools.</li><li>Monitor inventory levels to ensure alignment with forecasted demand, avoiding stockouts, overstock situations, and preparing for seasonality.</li></ol><br/><br/><strong>Purchasing Supervision:</strong><br/><br/><ol><li>Maintain strong relationships with suppliers to ensure the best pricing, quality, and delivery terms.</li><li>Evaluate supplier performance and address any issues related to quality, delivery, or cost.</li><li>Ensure compliance with company policies and procedures in all purchasing activities.</li><li>Supervise the purchasing team, providing guidance and support to achieve departmental goals.</li><li>Develop a supplier score card and metric and keep maintained with the help of the Purchasing Team.</li></ol><br/><br/><strong>Cross-Functional Collaboration:</strong><br/><br/><ol><li>Participate in cross-functional meetings to provide insights and updates on demand planning and purchasing activities.</li><li>Support new product development initiatives by providing input on demand forecasts and procurement requirements.</li></ol><br/><br/><strong>Education and/or Work Experience Requirements:</strong><br/> <ul><li>Strong Excel Skills. Understanding of Vlookup, Sumifs, Power Query, IF Nest, Match Lookup and PowerBi.</li><li>Looking for a minimum of 4 years' work experience within Purchasing, Material Planning, and/or Demand Planning.</li><li>Must have excellent interpersonal skills.</li><li>Must be detail oriented.</li><li>Strong analytical, problem solving and organizational skills.</li><li>Microsoft Teams experience is a plus.</li></ul>", "responsibilities": "The Demand Planner / Purchasing Supervisor is responsible for overseeing and managing aspects of the demand planning and purchasing processes. This role requires a detail-oriented individual with strong analytical skills to forecast demand accurately, manage inventory levels, and ensure the timely procurement of materials. The ideal candidate will have experience in supply chain management, excellent communication skills, and the ability to work collaboratively with various departments to meet company objectives. The main objective of this role is to provide robust Demand Planning insights across various departments and product lines, enhancing our forecasts and inventory recommendations to add an extra layer of intelligence to our purchasing strategies.", "qualifications": {"required": "Strong Excel Skills. Understanding of Vlookup, Sumifs, Power Query, IF Nest, Match Lookup and PowerBi. Looking for a minimum of 4 years' work experience within Purchasing, Material Planning, and/or Demand Planning. Must have excellent interpersonal skills. Must be detail oriented. Strong analytical, problem solving and organizational skills. Microsoft Teams experience is a plus.", "preferred": ""}, "skills": ["Excel", "Supply Chain Management", "Demand Planning", "Purchasing", "Inventory Management", "Analytical Skills", "Communication Skills", "Problem Solving", "Microsoft Teams"], "postedDate": "1 month ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981867315"}