{"jobTitle": "Director, PSR Operations - Colton, CA", "company": {"name": "Kinder Morgan, Inc.", "industry": "Oil and Gas", "size": "Large", "location": "Bloomington, CA"}, "location": "Colton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$157,000.00/yr - $236,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Oil and Gas", "description": "Position Description\n\nPrimary purpose: \nThe Director of Operations is responsible for the overall performance of the Pacific Southern Region, including safety performance, pipeline and facilities operations and maintenance, regulatory compliance, budget preparation and stewardship, personnel matters, union contract administration, training compliance, technical and engineering project oversight, and federal/state/public liaison. The Director acts as Incident Commander in the event of an emergency.\n\nEssential duties and responsibilities:\n- Coordinates and manages the performance of direct reports, including Operations Managers, Pipeline Maintenance Managers, Corrosion Engineers, Project Specialists, and support personnel, to safely and efficiently operate and maintain the pipelines and all associated facilities.\n- Maintains an up-to-date working knowledge of regulatory and company operating requirements and coordinates activities with regulatory agencies, other company departments, customers, the public, and Senior Management.\n- Acts as Incident Commander and Qualified Individual for any emergency responses and as regional Emergency Response Team leader. Coordinates emergency response activities in conjunction with the Crisis Management Team. Activates and coordinates the Crisis Support Team if necessary. May act as the KM spokesperson to the media in the event of an emergency with media coverage.\n- Directs region’s performance to meet or exceed all safety, budgetary, and regulatory compliance requirements and ensures alignment with corporate goals, including KM’s Operational Excellence initiative.\n- Servers as Steering Committee leader of the regional Operations Review Committee; ensures alignment with corporate objectives.\n- Oversees field operation and maintenance coordination with Products Movement, Engineering, Business Development, EH&S and Finance Departments.\n- Ensures overall environmental compliance for the region. Has authority to obtain all resources necessary to minimize environmental impact during a hazardous product release.\n- Ensures consistent application of the Union working agreement for represented facilities, including performance management, discipline, grievances, and work practices.\n- Develops and stewards manager/employee development to meet changing staffing needs for all areas.\n- Coordinates prepares or maintains various reports, records, diagrams, and other documents concerning maintenance and operations, expense management, safety and regulatory compliance, and employee administrative issues.\n- Ensures all regional employees are familiar with manuals, policies/procedures, and technical standards.\n- Promotes and stewards regional operations & maintenance budgets. Oversees and administers approved budgets.\n- Actively promotes all corporate and HR initiatives and ensures compliance with all recruiting and promotional opportunities and the discipline process. \n- Consistently maintain and demonstrate a high regard for personal safety and the safety of company assets, employees, and the general public.", "responsibilities": "Coordinates and manages the performance of direct reports, including Operations Managers, Pipeline Maintenance Managers, Corrosion Engineers, Project Specialists, and support personnel, to safely and efficiently operate and maintain the pipelines and all associated facilities.", "qualifications": {"required": "Bachelor’s degree in Business Management, Engineering, or related discipline, or equivalent professional experience. A minimum of 10 years of thorough working experience/knowledge in pipeline and liquid/chemical terminal operations, including storage tank operations, harbor facilities, loading rack operation, pump and motor operation, SCADA control systems, basic hydraulics, and flow control systems, regulatory compliance standards, union contract administration, and emergency response/ incident command.", "preferred": "Masters in Business Administration desired."}, "skills": ["Leadership", "Management and supervisory principles and practices", "Proficiency with computer applications, including Microsoft Excel, Word, Project, and Outlook", "Strong verbal and written communication skills", "Problem-solving and decision-making skills", "Organizational skills", "Initiative and self-motivation"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "health care benefits including medical, prescription drug, dental, and vision coverage; Flexible and Health Spending Accounts; Life and Accidental Death and Disability insurance; Supplemental Life and Accidental Death and Disability insurance for employee and dependents; retirement benefits including a 401(k) with employer and employee contributions and a company-funded pension plan; paid time off; paid parental bonding leave; paid holidays; a flexible work schedule and many voluntary benefit plans.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3981620759"}