{"jobTitle": "Administrative Assistant", "company": {"name": "The Law Offices of Stephenson, Acquisto & Colman", "industry": "Legal Services", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Legal Services", "description": "<strong>Summary/Objective<br/><br/></strong>Job Description<br/><br/>Law Offices of Stephenson, Acquisto &amp; Colman, a specialty health care law firm, is seeking to fill an Administrative Assistant position.<br/><br/><strong>Essential Functions<br/><br/></strong>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Responsibilities</strong>:<br/><br/><ul><li>Under the direct supervision of the Managing Partner, the Administrative Assistant provides general administrative and office support. </li><li>Maintaining agendas, calendaring and setting of meetings, following up with any pending items as needed. </li><li>Taking meeting minutes in a thorough and clear manner. </li><li>Involvement in preparing client reports. </li><li>Coordinating travel arrangements. </li><li>Communication with clients in writing, by telephone and over virtual platforms. </li><li>Clerical duties as needed. <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Strong interpersonal, verbal, and written communication skills. Ensures that verbal and written communication is clear and concise. </li><li>A self-starter with an ability to work independently and in a team environment. </li><li>Ability to work in a fast-paced environment and detail oriented. <br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Time Management skills</li><li>Highly organized</li><li>Attention to detail</li><li>Proficient in Microsoft Office and Computer Literacy</li><li>Personal Effectiveness/Credibility</li><li>Proactive/Resourceful Problem Solving<br/><br/></li></ul><strong>Supervisory Responsibility<br/><br/></strong>This position has no supervisory responsibilities.<br/><br/><strong>Work Environment<br/><br/></strong>This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.<br/><br/><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/>While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands and fingers to handle or feel; and reach with hands and arms.<br/><br/><strong>Position Type/Expected Hours of Work<br/><br/></strong>Some flexibility in hours is allowed, but the employee must be available during the “core” work hours of 7:00 a.m. to 4:00 p.m.<br/><br/><strong>Preferred Education And Experience<br/><br/></strong><ul><li> College degree. </li><li> One to Two years of admin experience. </li><li> Training or experience in computer applications. <br/><br/></li></ul><strong>Other Duties<br/><br/></strong>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.<br/><br/>Job Type: Full-time<br/><br/>Pay: $20.00 per hour<br/><br/>Benefits:<br/><br/><ul><li>401(k)</li><li>Dental insurance</li><li>Health insurance</li><li>Paid time off</li><li>Vision insurance<br/><br/></li></ul>Schedule:<br/><br/><ul><li>8 hour shift</li><li>Monday to Friday<br/><br/></li></ul>Location:<br/><br/><ul><li>California (Required)<br/><br/></li></ul>Work Location: Remote<br/><br/><strong>Company Description<br/><br/></strong>Law Offices of Stephenson, Acquisto &amp; Colman has worked for both government agencies and large insurance companies for the past 35 years. This experience gives our clients an edge in their litigation efforts.<br/><br/>The law firm’s full-time professional team includes attorneys, nurses and physicians. The firm staff has extensive experience in all areas of law related to healthcare matters. SAC’s partners have more than 100 combined years of legal experience while establishing strong working relationships within all areas of the healthcare industry.<br/><br/>Law Offices of Stephenson, Acquisto &amp; Colman has worked for both government agencies and large insurance companies for the past 35 years. This experience gives our clients an edge in their litigation efforts. The law firm’s full-time professional team includes attorneys, nurses and physicians. The firm staff has extensive experience in all areas of law related to healthcare matters. SAC’s partners have more than 100 combined years of legal experience while establishing strong working relationships within all areas of the healthcare industry.", "responsibilities": "Under the direct supervision of the Managing Partner, the Administrative Assistant provides general administrative and office support. Maintaining agendas, calendaring and setting of meetings, following up with any pending items as needed. Taking meeting minutes in a thorough and clear manner. Involvement in preparing client reports. Coordinating travel arrangements. Communication with clients in writing, by telephone and over virtual platforms. Clerical duties as needed.", "qualifications": {"required": "Strong interpersonal, verbal, and written communication skills. Ensures that verbal and written communication is clear and concise. A self-starter with an ability to work independently and in a team environment. Ability to work in a fast-paced environment and detail oriented.", "preferred": "Time Management skills Highly organized Attention to detail Proficient in Microsoft Office and Computer Literacy Personal Effectiveness/Credibility Proactive/Resourceful Problem Solving"}, "skills": ["Communication", "Microsoft Office", "Time Management", "Problem Solving"], "postedDate": "4 weeks ago", "benefits": "401(k) Dental insurance Health insurance Paid time off Vision insurance", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3981802156"}