{"jobTitle": "Ecommerce Visual Merchandising Coordinator", "company": {"name": "Reformation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>Who We Are:<br/><br/></strong>Founded in 2009, Reformation is a revolutionary lifestyle brand that proves fashion and sustainability can coexist. We combine stylish, vintage-inspired designs with sustainable practices, releasing limited-edition collections for individuals who want to look beautiful and live sustainably. Setting an example for the industry, Reformation remains at the forefront of innovation in sustainable fashion—running the first sustainable factory in Los Angeles, using deadstock and eco fabrics, tracking and sharing the environmental impact of every product, and investing in the people who make this revolution possible. The brand has also established itself as a pioneer in retail innovation, developing an in-store tech concept that brings the best of its online experience to its physical doors.<br/><br/>We are a future focused organization committed to the belief that the problems facing our planet and society can be solved through innovation, common sense and education. Being naked is the #1 most sustainable option. We're #2.<br/><br/>Here at Ref, we put people first. We know that you can't innovate and do cool stuff without having everyone on board. So we work to create a culture where everyone feels like they belong and where their voices are truly valued. We build an inclusive culture together and make a real impact along the way.<br/><br/><strong>Ecommerce Visual Merchandising Coordinator<br/><br/></strong>The Ecommerce Visual Merchandising Coordinator, a member of the Ecommerce Strategy &amp; Operations team, is responsible for maintaining the visual merchandising across the site and bringing the product strategy to life. This role plays a key part in supporting daily Ecommerce operations by executing data-driven merchandising strategies to create a seamless and compelling experience for our customers. The role combines an understanding of analytics, shopper journeys, visual merchandising, and product performance. This role is highly collaborative and partners with a variety of cross-functional teams in a fast-paced environment.<br/><br/><strong>What You'll Do:<br/><br/></strong><li>Maintain strong visual merchandising across Reformation.com to bring the brand to life and represent the full product assortment</li><ul><li>Manage the featured merchandise and product highlights in key categories to accomplish strategic category growth targets</li><li>Support the maintenance of curated site edits around relevant shopping interests and visual filters that support product priorities and aid the customer shopping journey</li><li>Utilize both data and creative insights to create a seamless and compelling customer experience</li><li>Define the items in a given category by utilizing product attribution, and execute against it with categorization rules</li></ul><li>Utilize data and develop insights to improve and optimize merchandising across the site</li><ul><li>Analyze sales and site metrics to identify opportunities for increasing revenue, page views, and conversion </li><li>Demonstrate a strong understanding of Ecom KPIs and product performance: Revenue, conversion, AOV, SKU count, top performers, and inventory depth</li><li>Analyze CLP and product performance and draw customer and behavioral insights to drive engagement and share learnings with cross-functional teams with a focus on improvement and change recommendations</li><li>Perform analysis of go-live performance, share findings with cross-functional teams, and update visual merchandising accordingly</li><li>Collaborate with cross-functional partners</li><ul><li>Support the feedback loop on product and category performance with Merchandising and Product Operations</li><li>Partner with the Paid Marketing and Lifecycle teams to ensure products featured on ad campaigns and marketing emails are effectively merchandised</li><li>Partner with the Brand Marketing team to identify merchandising opportunities to support key product initiatives based on customer demand<br/></li></ul></ul><strong>What You'll Need:<br/><br/></strong><ul><li>BA/BS degree required in business, economics, marketing, merchandising, or a related field </li><li>1-2 years of Ecommerce or merchandising experience</li><li>A strong attention to detail</li><li>Entrepreneurial, creative, and scrappy mindset</li><li>Proficiency in MS Excel and Google Suite</li><li>Familiarity with Salesforce Business Manager is a plus, but not mandatory<br/><br/></li></ul><strong>Who You Are:<br/><br/></strong><ul><li>You have an eye for detail, and you are known to execute, analyze, refine, and repeat</li><li>You love being hands-on and solving problems - you don't see this as a task; it's a passion</li><li>You thrive in a fast-paced, results-oriented environment</li><li>You have strong organization and communication skills</li><li>You own your work, take initiative, and have the ability to prioritize multiple projects</li><li>You're the type of team member who is willing to pick up slack and do the unglamorous tasks to help grow the company</li><li>You are both data-driven and aesthetically-driven<br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong><ul><li>Health, vision, and dental insurance for eligible employees</li><li>Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees</li><li>Mission based company + casual and entrepreneurial work environment </li><li>Clothing discount, dog-friendly office, company events + parties and much more </li><li>401K with company match <br/><br/></li></ul><em>The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status<br/><br/></em><em>Notice at Collection- Privacy Notice for California Candidates</em>", "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "postedDate": "1 month ago", "skills": ["Salesforce Business Manager", "Google Suite", "MS Excel", "Ecommerce", "Merchandising", "Data Analysis", "Customer Insights", "Visual Merchandising", "Product Performance", "Communication", "Organization", "Problem Solving", "Teamwork", "Initiative", "Prioritization"], "url": "https://www.linkedin.com/jobs/view/3981615242"}