{"jobTitle": "Product Manager / Operational Transformation", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "76,128.00-137,030.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE<br/><br/>Ranked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California.<br/><br/>Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children.<br/><br/>The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation.<br/><br/>Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding.<br/><br/><strong>It’s Work That Matters.<br/><br/></strong><strong>Overview<br/><br/></strong><strong>PLEASE NOTE: </strong>This position is a remote position, however, a primary residence in California is required prior to starting at CHLA. All applicants that reside outside of California must be willing to relocate.<br/><br/><strong>Purpose Statement/Position Summary:</strong> Children’s Hospital Los Angeles (CHLA) is on a multi-year digital transformation strategy to improve the quality, effectiveness and convenience of care delivery, through the creation and delivery of innovative digital products. Under the direction of the VP, Chief Digital &amp; Transformation Officer, the Digital Products team will innovate and develop new products and deliver them to patients, families and other end-users through multiple channels. These products are aligned with key strategic enterprise priorities for CHLA. The Product Manager is responsible for managing the product roadmap for digital products, from ideation to implementation. The Product Manager defines customer and business requirements, enabling cross-functional teams to develop solutions efficiently. The Product Manager ensures products align with enterprise strategic priorities, defines key metrics for product success, prioritizes product features, conducts market research to evaluate best practices, evaluates product performance and determines improvements, maintains relationships with vendors and ultimately owns the product. The Product Manager will partner with key internal stakeholders (e.g. Information Services, Legal, Risk, Marketing &amp; Communications) and external stakeholders (e.g. technology vendors) to build, develop and deploy digital products. This job plays a critical role representing the customer’s voice throughout the product development lifecycle. This role will establish and evangelize the vision and strategy for assigned digital products, clearly articulate the “why” behind the products, and own their digital product roadmap. Will bridge technology, business, and customer needs to create remarkable digital experiences that solve customer’s problems, drive business value, and produce desired outcomes. Will be responsible to define the product’s fundamental value proposition, outline the vision and execution plan, gain alignment and support from key strategic partners and stakeholders, and oversee execution of that vision. The Product Manager uses Agile, Design Thinking and Lean methodologies, as needed, to effectively manage product development and deployment.<br/><br/><strong>Minimum Qualifications/Work Experience:</strong> 3 years of professional experience in a hospital environment and/or healthcare product management environment.<br/><br/><strong>Education/Licensure/Certification:</strong> Bachelor’s Degree in STEM or related field. Master of Business Administration, Healthcare Management, Public Health or Product Development.<br/><br/><strong>Pay Scale Information<br/><br/></strong>$76,128.00-$137,030.00<br/><br/>CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.<br/><br/>Children's Hospital Los Angeles (CHLA) is a leader in pediatric and adolescent health both here and across the globe. As a premier Magnet teaching hospital, you’ll find an environment that’s alive with learning, rooted in care and compassion, and home to thought leadership and unwavering support. CHLA is dedicated to creating hope and building healthier futures - for our patients, as well as for you and your career!<br/><br/>CHLA has been affiliated with the Keck School of Medicine of the University of Southern California since 1932.<br/><br/>At Children’s Hospital Los Angeles, our work matters. And so do each and every one of our valued team members. CHLA is an Equal Employment Opportunity employer. We consider qualified applicants for all positions without regard to race, color, religion, creed, national origin, sex, gender identity, age, physical or mental disability, sexual orientation, marital status, veteran or military status, genetic information or any other legally protected basis under federal, state or local laws, regulations or ordinances. We will also consider for employment qualified applicants with criminal history, in a manner consistent with the requirements of state and local laws, including the LA City Fair Chance Ordinance and SF Fair Chance Ordinance.<br/><br/>Qualified Applicants with disabilities are entitled to reasonable accommodation under the California Fair Employment and Housing Act and the Americans with Disabilities Act. Please contact CHLA Human Resources if you need assistance completing the application process.<br/><br/>Diversity inspires innovation. Our experiences, perspectives and backgrounds allow us to better serve our patients and create a strong community at CHLA.<br/><br/>Operational Transformation", "responsibilities": "The Product Manager is responsible for managing the product roadmap for digital products, from ideation to implementation. The Product Manager defines customer and business requirements, enabling cross-functional teams to develop solutions efficiently. The Product Manager ensures products align with enterprise strategic priorities, defines key metrics for product success, prioritizes product features, conducts market research to evaluate best practices, evaluates product performance and determines improvements, maintains relationships with vendors and ultimately owns the product. The Product Manager will partner with key internal stakeholders (e.g. Information Services, Legal, Risk, Marketing &amp; Communications) and external stakeholders (e.g. technology vendors) to build, develop and deploy digital products. This job plays a critical role representing the customer’s voice throughout the product development lifecycle. This role will establish and evangelize the vision and strategy for assigned digital products, clearly articulate the “why” behind the products, and own their digital product roadmap. Will bridge technology, business, and customer needs to create remarkable digital experiences that solve customer’s problems, drive business value, and produce desired outcomes. Will be responsible to define the product’s fundamental value proposition, outline the vision and execution plan, gain alignment and support from key strategic partners and stakeholders, and oversee execution of that vision. The Product Manager uses Agile, Design Thinking and Lean methodologies, as needed, to effectively manage product development and deployment.", "qualifications": {"required": "3 years of professional experience in a hospital environment and/or healthcare product management environment.", "preferred": "Bachelor’s Degree in STEM or related field. Master of Business Administration, Healthcare Management, Public Health or Product Development."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3981532668"}