{"jobTitle": "Technical Project Manager - LA", "company": {"name": "Eleven Recruiting", "industry": "Financial Services", "size": "Not specified", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Mid-Senior Level", "salary": {"amount": "$80.00/hr - $100.00/hr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Financial Services", "description": "We are supporting our client, a premier global investment firm, in seeking a hands-on Technical Project Manager for their office in El Segundo, CA. We are looking for a dedicated Technical Project Manager to lead agile methodologies and drive successful project execution. The ideal candidate will have proven skills in independently managing the entire project lifecycle, collaborating with business and software engineers, and consistently delivering high-quality solutions on time.", "responsibilities": "Lead cross-disciplinary teams to support, expand, and enhance business, operations, and technology initiatives. Conduct daily stand-ups and manage regular project tracking through weekly cadences. Track projects, analyze data, and create templates within Jira. Manage project budgets, prioritize tasks, and ensure efficient project execution. Shift resources to address higher needs and priorities. Develop and maintain executive dashboards, process documentation, and templates. Coordinate the development of user manuals, training materials, and documentation for system turnover to clients. Establish and execute effective project communication plans. Regularly meet with, build, and present decks to, and provide reports to C-suite executives and high net-worth individuals. Facilitate change requests, assessing their impacts on schedule and budget. Identify and develop new opportunities with clients, ensuring customer satisfaction during and after project transition. Conduct post-project evaluations to identify successful and unsuccessful elements.", "qualifications": {"required": "5+ years of experience in Financial Services, focusing on technical project management. Proven experience in data analysis, interpreting complex datasets to drive decision-making. Experience in building workflows and managing projects involving microservices and API integration. PMP certification is a plus. Ability to lead diverse teams and manage multiple mid to large-size projects. Strong understanding of formal project management methodologies. Skilled in budget management and shifting resources to address higher priorities. Excellent problem-solving abilities and capable of working under tight deadlines. Exceptional communication and stakeholder management skills. Experience in building and presenting decks to C-suite executives and high net-worth individuals. An innovative mindset focused on continuous improvement and keeping up with industry trends.", "preferred": "SQL for database management, Power BI for data visualization, Python for scripting and automation."}, "skills": ["Project Management", "Agile Methodologies", "Data Analysis", "Jira", "Budget Management", "Stakeholder Management", "Communication", "Problem Solving"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3981929590"}