{"jobTitle": "Remote Travel Coordinator", "company": {"name": "NEVER ENDING TRAVELS", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "A Remote Travel Coordinator business opportunity offers an excellent chance to provide a valuable service to different organizations and businesses while enjoying the freedom to work from anywhere. You would be responsible for planning and organizing business travel, bookings, and accommodations for your clients.<br/><br/><ul><li>Your duties would include making all necessary arrangements, such as researching and reserving flights, ground transportation, lodging, and other travel-related services</li><li>You would also be responsible for managing expenses, tracking reimbursements and providing support to travelers while they are on the road</li><li>Issue airline tickets, vouchers and other travel documents</li><li>Provide customers with travel advice and information about local attractions</li><li>Respond to customer inquiries and troubleshoot any travel issues</li><li>Stay up to date with industry news and developments</li><li>Ensure customer needs are met in a timely and satisfactory manner</li><li>Keep current on all forms of payment accepted by the agency</li><li>Work with external vendors to secure lowest prices and special deals for customers</li><li>Ensure customer satisfaction through effective communication and follow-up<br/><br/></li></ul>Key Qualities:<br/><br/><ul><li>Good communication and customer service skills</li><li>Excellent organizational skills</li><li>Familiarity with booking systems and software</li><li>Knowledge of applicable industry rules, regulations, and requirements</li><li>Attentiveness to customers' desires, questions, and needs</li><li>Ability to handle multiple tasks and maintain attention to detail</li><li>Ability to take initiative and anticipate customer needs as needed<br/><br/></li></ul><strong>With this remote opportunity, you would have the flexibility to work your own hours. You mustbe able to work independently and be comfortable using a variety of software programs, and comfortable working remotely.<br/><br/></strong>Powered by JazzHR<br/><br/>yoyevaDrR6", "postedDate": "1 month ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3981541058"}