{"jobTitle": "Lead Community Health Associate", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "31.98/hr - 49.57/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong>We are seeking a dedicated Health professional with a strong background in community-based outreach and research to join our team. This role will involve building coalitions, managing large-scale programs to improve education and screening, and conducting program evaluation to ensure the success and impact of initiatives.<br/><br/>The Community Outreach and Engagement (COE) Lead Community Health Associate (CHA) conducts outreach with Asian, Pacific Islander, Black, Latinx and other underserved communities in Los Angeles and surrounding areas in an effort to implement cancer education and screening programs, community-based participatory research and build partnerships, and support our Community Advisory Board activities. This lead position will report to the Director of Community Outreach and Engagement and work closely with the COE Program Administrator on day to day activities and interface with investigators in the CRCHE. They/He/She will be responsible for disseminating cancer information, collaborating with clinics/FQHCs to increase cancer screening and improve the uptake of evidence-based interventions in organizations to enhance current screening activities to benefit marginalized communities with disparities. In addition, he/she/they will be responsible for data collection, digital materials development for approval, manage community grantee relationships that are assigned to them and will represent the COE in community settings.<br/><br/>He/she/they will also collaborate with colleagues and experts to conduct trainings in the community and supervise volunteers, interns and staff as needed. They will support implementation of community-based participatory research which usually includes outreach activities such as recruitment, training, surveys, and CAB development. This position will provide feedback to the director(s), principal investigators, clinicians and researchers, and administrators on community priorities, needs and barriers on a regular basis to help catalyze the development of research projects and needed community programs. In addition, the Lead CHA will promote participation in research and clinical trials for underrepresented and underserved populations.<br/><br/><strong>Primary Duties And Responsibilities<br/><br/></strong><ul><li>Developing and managing partnerships that run community health worker and navigator programs within the designated geographic areas and specific communities to improve awareness of the need for screening.</li><li>Establish and expand relationships with Federally Qualified Health Centers to increase cancer screening among populations with disparities and offer evaluation support to measure impact. This includes establishing feasibility for mobile cancer screening and implementing pilot programs to improve cancer screening, in particular lung cancer. </li><li>Work closely with FQHCs to develop strategies to improve minority participation in research and clinical trials.</li><li>Collaborating on large-scale screening and research programs with community partners</li><li>Conducting presentations and writing publications related to cancer education for the community.</li><li>Leading interns, volunteers/community health workers and staff as necessary.</li><li>Conducting evaluations and assessments of community outreach events and community-based research projects.</li><li>Developing and managing relationships with key community organizations, stakeholders, including supporting the Cancer Research Center for Health Equity</li><li>Implementation of cancer education programs at the neighborhood-level (e.g. Korea town, East Los Angeles, South Los Angeles and other areas identified as priorities by the COE leadership or CRCHE leadership)</li><li>Participation in community events, conferences, health fairs and other community activities to represent Community Outreach and Engagement and promoting our programs.</li><li>Supporting regular communications activities related to cancer in the community and with partners. For example, working in the social media space and creating news stories</li><li>Developing and testing cancer education materials and messages for cultural competency. </li><li>Leading all aspects of event management . </li><li>Act as point person for event set up (securing space, transporting materials, ordering food, etc.)</li><li>Regularly promote participation in research and clinical trials and provide feedback to research team on barriers to access</li><li>Participating in recurring meetings with community outreach staff, community partners and reviewing progress within the scope of work. Participating in research related meetings on behalf of COE. </li><li>Participation in research faculty meetings supporting develop of grant proposals and pilot research projects.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong><strong>Requirements:<br/><br/></strong></strong><ul><li>Bachelor's Degree required. MS in Public Health or related field preferred.</li><li>3-5 years of experience in community-based research and outreach</li><li>Proven track record in managing large-scale programs and conducting evaluations</li><li>Strong understanding of research methodologies and community-based programming</li><li>Prior experience in nonprofit work, preferably in a director role</li><li>Experience with other cancer centers is a significant plus<br/><br/></li></ul>#Jobs-Indeed<br/><br/><strong>Req ID</strong> : 3903<br/><br/><strong>Working Title</strong> : Lead Community Health Associate<br/><br/><strong>Department</strong> : Cancer - Research Center Health Equity<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Community Engagement<br/><br/><strong>Job Specialty</strong> : Community Engagement<br/><br/><strong>Overtime Status</strong> : EXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $31.98 - $49.57", "responsibilities": "Developing and managing partnerships that run community health worker and navigator programs within the designated geographic areas and specific communities to improve awareness of the need for screening. Establish and expand relationships with Federally Qualified Health Centers to increase cancer screening among populations with disparities and offer evaluation support to measure impact. This includes establishing feasibility for mobile cancer screening and implementing pilot programs to improve cancer screening, in particular lung cancer. Work closely with FQHCs to develop strategies to improve minority participation in research and clinical trials. Collaborating on large-scale screening and research programs with community partners Conducting presentations and writing publications related to cancer education for the community. Leading interns, volunteers/community health workers and staff as necessary. Conducting evaluations and assessments of community outreach events and community-based research projects. Developing and managing relationships with key community organizations, stakeholders, including supporting the Cancer Research Center for Health Equity Implementation of cancer education programs at the neighborhood-level (e.g. Korea town, East Los Angeles, South Los Angeles and other areas identified as priorities by the COE leadership or CRCHE leadership) Participation in community events, conferences, health fairs and other community activities to represent Community Outreach and Engagement and promoting our programs. Supporting regular communications activities related to cancer in the community and with partners. For example, working in the social media space and creating news stories Developing and testing cancer education materials and messages for cultural competency. Leading all aspects of event management . Act as point person for event set up (securing space, transporting materials, ordering food, etc.) Regularly promote participation in research and clinical trials and provide feedback to research team on barriers to access Participating in recurring meetings with community outreach staff, community partners and reviewing progress within the scope of work. Participating in research related meetings on behalf of COE. Participation in research faculty meetings supporting develop of grant proposals and pilot research projects.", "qualifications": {"required": "Bachelor's Degree required. MS in Public Health or related field preferred. 3-5 years of experience in community-based research and outreach Proven track record in managing large-scale programs and conducting evaluations Strong understanding of research methodologies and community-based programming Prior experience in nonprofit work, preferably in a director role Experience with other cancer centers is a significant plus", "preferred": ""}, "skills": ["Community Outreach", "Research", "Program Management", "Evaluation", "Nonprofit"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3981857410"}