{"jobTitle": "Supervisor, Lab Operations / Core Lab / Evenings", "company": {"name": "Children's Hospital Los Angeles (CHLA)", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "99,424.00/yr - 178,963.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "NATIONAL LEADERS IN PEDIATRIC CARE<br/><br/>Ranked among the top 10 pediatric hospitals in the nation, Children’s Hospital Los Angeles (CHLA) provides the best care for kids in California.<br/><br/>Here world-class experts in medicine, education and research work together to deliver family-centered care half a million times each year. From primary to complex critical care, more than 350 programs and services are offered, each one specially designed for children.<br/><br/>The CHLA of the future is brighter than can be imagined. Investments in technology, research and innovation will create care that is personal, convenient and empowering. Our scientists will work with clinical experts to take laboratory discoveries and create treatments that are a perfect match for every patient. And together, CHLA team members will turn health care into health transformation.<br/><br/>Join a hospital where the work you do will matter—to you, to your colleagues, and above all, to our patients and families. The work will be challenging, but always rewarding.<br/><br/>It’s Work That Matters.<br/><br/>Overview<br/><br/>Purpose Statement/Position Summary: In coordination with Section Managers and technical specialists, the Operation Supervisor has direct responsibility for the supervision of daily activities in Department of Pathology and Laboratory Medicine. In this capacity, the Supervisor ensures appropriate and high quality service by scheduling staff, assigning work, assisting with quality control programs, improving procedures and processes, and solving technical problem. Performs all job duties with sensitivity and attention to the age and developmental issues of the patient population(s) served. We are seeking a highly skilled and experienced Clinical Laboratory Scientist (CLS) to join our team responsible for performing laboratory tests for inpatient, outpatient, outreach, and ED patients during evening and night shifts. The role includes preventive maintenance of equipment and analyzers, calibration of chemistry tests, and providing the highest level of service to caregivers and patients. Effective communication and interaction with hospital staff, nurses, physicians, other sections, couriers, and outreach teams are crucial.<br/><br/>Key Responsibilities<br/><br/><ul><li>Perform laboratory tests in Chemistry, Hematology, and Coagulation.</li><li>Maintain and calibrate laboratory equipment and analyzers.</li><li>Ensure the delivery of high-quality services to caregivers and patients.</li><li>Communicate effectively with hospital staff, including nurses and physicians.</li><li>Conduct preventive maintenance and manage equipment functionality.</li><li>Adhere to and implement laboratory quality assurance protocols as per CAP/CLIA standards.</li><li>Perform staff scheduling and provide coverage for evening, night, weekend, and holiday shifts.</li><li>Conduct staff competencies and performance evaluations.</li><li>Handle proficiency testing and exception investigation and reporting.</li><li>Participate in CAP inspections and method validation.<br/><br/></li></ul>Minimum Qualifications/Work Experience: 5+ year’s clinical laboratory experience in a Core Laboratory setting (Chemistry, Hematology, Coagulation) highly preferred. Prefer experience in a lead or supervisory role.<br/><br/><ul><li>General knowledge of all areas of the clinical lab including phlebotomy.</li><li>Working knowledge of basic office software, LIS and/or HIS computer systems.</li><li>Experience in scheduling &amp; training.</li><li>Proficient in Microsoft Office, including Word, Excel, PowerPoint, and TEAMS, as well as DocuSign and Microsoft Outlook.</li><li>Strong communication skills and the ability to sort, filter, query, and analyze data.</li><li>Experience in writing laboratory procedures and conducting laboratory assays.</li><li>In-depth knowledge of Quality Control and Quality Assurance processes (CLIA and CAP).</li><li>Ability to perform method validation and prepare for CAP inspections.</li><li>Strong work ethic and adherence to policies and procedures.</li><li>Polite and professional demeanor, serving as a role model to the staff.<br/><br/></li></ul>People Skills<br/><br/><ul><li>Effective communication with staff, holding them accountable.</li><li>Ability to counsel and resolve conflicts.</li><li>Conduct performance evaluations and technical competencies.</li><li>Excellent attendance record and a role model for others.</li><li>Willingness to cover shifts or organize staff coverage when needed.</li><li>Ability to escalate issues to Core Lab Administrators.</li><li>Positive attitude and strong communication skills.<br/><br/></li></ul>Education/Licensure/Certification: Bachelor’s degree in a clinical lab science, medical technology or related science required.<br/><br/><ul><li>Professional involvement such as membership on committees, publication of papers and presentation of conferences preferred.</li><li>A valid California CLS License (ASCP certification preferred).<br/><br/></li></ul>Pay Scale Information<br/><br/>$99,424.00-$178,963.00<br/><br/>CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.<br/><br/>Children's Hospital Los Angeles (CHLA) is a leader in pediatric and adolescent health both here and across the globe. As a premier Magnet teaching hospital, you’ll find an environment that’s alive with learning, rooted in care and compassion, and home to thought leadership and unwavering support. CHLA is dedicated to creating hope and building healthier futures - for our patients, as well as for you and your career!<br/><br/>CHLA has been affiliated with the Keck School of Medicine of the University of Southern California since 1932.<br/><br/>At Children’s Hospital Los Angeles, our work matters. And so do each and every one of our valued team members. CHLA is an Equal Employment Opportunity employer. We consider qualified applicants for all positions without regard to race, color, religion, creed, national origin, sex, gender identity, age, physical or mental disability, sexual orientation, marital status, veteran or military status, genetic information or any other legally protected basis under federal, state or local laws, regulations or ordinances. We will also consider for employment qualified applicants with criminal history, in a manner consistent with the requirements of state and local laws, including the LA City Fair Chance Ordinance and SF Fair Chance Ordinance.<br/><br/>Qualified Applicants with disabilities are entitled to reasonable accommodation under the California Fair Employment and Housing Act and the Americans with Disabilities Act. Please contact CHLA Human Resources if you need assistance completing the application process.<br/><br/>Diversity inspires innovation. Our experiences, perspectives and backgrounds allow us to better serve our patients and create a strong community at CHLA.<br/><br/>Core Lab", "responsibilities": "<ul><li>Perform laboratory tests in Chemistry, Hematology, and Coagulation.</li><li>Maintain and calibrate laboratory equipment and analyzers.</li><li>Ensure the delivery of high-quality services to caregivers and patients.</li><li>Communicate effectively with hospital staff, including nurses and physicians.</li><li>Conduct preventive maintenance and manage equipment functionality.</li><li>Adhere to and implement laboratory quality assurance protocols as per CAP/CLIA standards.</li><li>Perform staff scheduling and provide coverage for evening, night, weekend, and holiday shifts.</li><li>Conduct staff competencies and performance evaluations.</li><li>Handle proficiency testing and exception investigation and reporting.</li><li>Participate in CAP inspections and method validation.<br/><br/></li></ul>", "qualifications": {"required": "5+ year’s clinical laboratory experience in a Core Laboratory setting (Chemistry, Hematology, Coagulation) highly preferred. Prefer experience in a lead or supervisory role.<br/><br/><ul><li>General knowledge of all areas of the clinical lab including phlebotomy.</li><li>Working knowledge of basic office software, LIS and/or HIS computer systems.</li><li>Experience in scheduling &amp; training.</li><li>Proficient in Microsoft Office, including Word, Excel, PowerPoint, and TEAMS, as well as DocuSign and Microsoft Outlook.</li><li>Strong communication skills and the ability to sort, filter, query, and analyze data.</li><li>Experience in writing laboratory procedures and conducting laboratory assays.</li><li>In-depth knowledge of Quality Control and Quality Assurance processes (CLIA and CAP).</li><li>Ability to perform method validation and prepare for CAP inspections.</li><li>Strong work ethic and adherence to policies and procedures.</li><li>Polite and professional demeanor, serving as a role model to the staff.<br/><br/></li></ul>", "preferred": "<ul><li>Professional involvement such as membership on committees, publication of papers and presentation of conferences preferred.</li><li>A valid California CLS License (ASCP certification preferred).<br/><br/></li></ul>"}, "skills": ["Chemistry", "Hematology", "Coagulation", "Quality Control", "Quality Assurance", "CAP", "CLIA", "Microsoft Office", "Word", "Excel", "PowerPoint", "TEAMS", "DocuSign", "Microsoft Outlook", "Scheduling", "Training", "Communication", "Data Analysis", "Laboratory Procedures", "Method Validation", "CAP Inspections", "Phlebotomy", "LIS", "HIS"], "postedDate": "1 week ago", "benefits": "CHLA values the contribution each Team Member brings to our organization. Final determination of a successful candidate’s starting pay will vary based on a number of factors, including, but not limited to education and experience within the job or the industry. The pay scale listed for this position is generally for candidates that meet the specified qualifications and requirements listed on this specific job description. Additional pay may be determined for those candidates that exceed these specified qualifications and requirements. We provide a competitive compensation package that recognizes your experience, credentials, and education alongside a robust benefits program to meet your needs. CHLA looks forward to introducing you to our world-class organization where we create hope and build healthier futures.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981928344"}