{"jobTitle": "Art Director, (Sports & Entertainment Motion Design) - CW Network - Burbank, CA", "company": {"name": "Nexstar Media Group, Inc.", "industry": "Broadcast Media Production and Distribution"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Broadcast Media Production and Distribution", "description": "The CW is both a top broadcast TV network in the U.S. and a fast-growing, ad-supported streaming service. With a network that reaches 100% of U.S. television households and a streaming footprint on all major platforms, The CW reaches audiences at scale on both linear and digital television. The CW streaming service is available for free to consumers and is home to the latest episodes and seasons of The CW’s primetime programming, live streaming of CW Sports content, and a library of entertaining film and television content for on-demand viewing. The CW is 75%-owned by Nexstar Media Group, Inc. (NASDAQ: NXST), a leading diversified media company and 25%-owned by Warner Bros. and CBS.<br/><br/><strong>The Job:<br/><br/></strong>The CW Television Network is seeking a hands-on <strong>Art Director (Sports &amp; Entertainment Motion Design), </strong>to join the Brand Creative team. This role will be responsible for the execution of creative from concept boards to final animation. An ideal candidate will have proven experience managing multiple projects and the ability to work collaboratively and independently while producing best in class creative in a fast-paced television network or streaming environment.<br/><br/><strong>The Daily:<br/><br/></strong><ul><li> Report directly to the Creative Director of Motion Design</li><li> A solid grasp of motion design principles and execution</li><li> Provide design and animation expertise in the production of Linear, Social, Branded, Integrated, Sizzle &amp; Sports Graphics</li><li> Foster a collaborative and creative team environment, working with team members to push boundaries and achieve creative excellence</li><li> Ensure the concepting, execution and delivery of high-quality, high-performing, on-brand, and visually compelling motion graphics, ensuring they align with brand guidelines and creative briefs</li><li> Interface &amp; collaborate with stakeholders across all departments including Design, Marketing, Producers, Editors, Copywriters and Facility to asses graphic needs and execution</li><li> Maintain the consistency of brand identity across all platforms and channels<br/><br/></li></ul><strong>The Essentials:<br/><br/></strong><ul><li> MUST BE A HANDS-ON MOTION GRAPHICS ANIMATOR AND DESIGNER WITH A PORTFOLIO/REEL THAT REFLECTS THIS.</li><li> A strong understanding of brand design as it relates to motion graphics, streaming and social media</li><li> Phenomenal ability to work with type (typesetting, leading &amp; kerning), color theory, layout, and logo design</li><li> 7+ years of experience in motion graphics DESIGN and animation preferably at a streaming, broadcast or cable network, or creative agency</li><li> 7+ years experience collaborating with a Motion Graphics team at all levels</li><li> Extremely proficient with motion graphic and creative tools including: Adobe Creative Cloud (Photoshop, Illustrator, After Effects and Premiere), Cinema 4D/Redshift a huge plus</li><li> Proficient with management software like Microsoft Office, Wrike and Frame.i.o.</li><li> Highly skilled at pitching to various internal and external stakeholders</li><li> Ability to develop best in class design concepts and execute creative materials</li><li> Stay on top of industry trends and emerging technologies in motion design</li><li> A talent for wearing multiple brand hats and switching easily between properties</li><li> Excellent communication and interpersonal skills</li><li> Deadline-driven and ability to work in a competitive environment<br/><br/></li></ul><strong>The Compensation:<br/><br/></strong>$120 - $135/yr commensurate with experience and skill levels.", "responsibilities": "The CW Television Network is seeking a hands-on Art Director (Sports &amp; Entertainment Motion Design), to join the Brand Creative team. This role will be responsible for the execution of creative from concept boards to final animation. An ideal candidate will have proven experience managing multiple projects and the ability to work collaboratively and independently while producing best in class creative in a fast-paced television network or streaming environment.<br/><br/>The Daily:<br/><br/><ul><li> Report directly to the Creative Director of Motion Design</li><li> A solid grasp of motion design principles and execution</li><li> Provide design and animation expertise in the production of Linear, Social, Branded, Integrated, Sizzle &amp; Sports Graphics</li><li> Foster a collaborative and creative team environment, working with team members to push boundaries and achieve creative excellence</li><li> Ensure the concepting, execution and delivery of high-quality, high-performing, on-brand, and visually compelling motion graphics, ensuring they align with brand guidelines and creative briefs</li><li> Interface &amp; collaborate with stakeholders across all departments including Design, Marketing, Producers, Editors, Copywriters and Facility to asses graphic needs and execution</li><li> Maintain the consistency of brand identity across all platforms and channels<br/><br/></li></ul>", "qualifications": {"required": "MUST BE A HANDS-ON MOTION GRAPHICS ANIMATOR AND DESIGNER WITH A PORTFOLIO/REEL THAT REFLECTS THIS.<br/>A strong understanding of brand design as it relates to motion graphics, streaming and social media<br/>Phenomenal ability to work with type (typesetting, leading &amp; kerning), color theory, layout, and logo design<br/>7+ years of experience in motion graphics DESIGN and animation preferably at a streaming, broadcast or cable network, or creative agency<br/>7+ years experience collaborating with a Motion Graphics team at all levels<br/>Extremely proficient with motion graphic and creative tools including: Adobe Creative Cloud (Photoshop, Illustrator, After Effects and Premiere), Cinema 4D/Redshift a huge plus<br/>Proficient with management software like Microsoft Office, Wrike and Frame.i.o.<br/>Highly skilled at pitching to various internal and external stakeholders<br/>Ability to develop best in class design concepts and execute creative materials<br/>Stay on top of industry trends and emerging technologies in motion design<br/>A talent for wearing multiple brand hats and switching easily between properties<br/>Excellent communication and interpersonal skills<br/>Deadline-driven and ability to work in a competitive environment<br/><br/>", "preferred": ""}, "skills": ["Motion Graphics", "Animation", "Adobe Creative Cloud", "Photoshop", "Illustrator", "After Effects", "Premiere", "Cinema 4D", "Redshift", "Microsoft Office", "Wrike", "Frame.i.o."], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981010697"}