{"jobTitle": "Client Service Representative -Fully Remote", "company": {"name": "AO Globe Life", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "Are you ready to revolutionize your work-life balance while achieving remarkable success? Join our fully virtual and work-from-home team, where you can earn an extraordinary income without compromising precious family moments. Embrace the freedom to choose your working hours, tailored to the needs of YOU and your loved ones. We are seeking vibrant individuals with a passion for assisting both existing and potential clients within our esteemed organization. As a valued team member, you will engage with multiple clients throughout the day, delivering unparalleled service and demonstrating in-depth product knowledge. Preferred Skills:<br/><br/><ul><li> Harness excellent communication skills, including active listening and effective problem-solving.<br/><br/></li></ul>problem-solving.<br/><br/><ul><li> Embrace a learning mindset, readily adapting and adjusting to new situations</li><li> Thrive both independently and as part of a collaborative team</li><li> Exhibit a tenacious work ethic and an unwavering drive for success<br/><br/></li></ul>What awaits you in this thrilling opportunity:<br/><br/><ul><li> Experience the liberating flexibility of a personalized schedule, complemented by weekly pay.<br/><br/></li></ul>by weekly pay.<br/><br/><ul><li> Enjoy the convenience of a 100% remote position, eliminating commutes and offering a truly flexible lifestyle.<br/><br/></li></ul>offering a truly flexible lifestyle.<br/><br/><ul><li> Participate in weekly training led by top industry leaders, expanding your knowledge and refining your skills.<br/><br/></li></ul>knowledge and refining your skills.<br/><br/><ul><li> Safeguard your future with comprehensive life insurance coverage</li><li> Benefit from health insurance reimbursement, prioritizing your well-being</li><li> Leverage industry-leading resources and cutting-edge technology to excel in your role.<br/><br/></li></ul>your role.<br/><br/>Join us in prioritizing community wellness! As a result, all interviews will be conducted via Zoom video conferencing, ensuring the safety and comfort of all applicants.<br/><br/>Ignite your career today as a Virtual Insurance Specialist!<br/><br/>Powered by JazzHR<br/><br/>LXDB1bUn2x", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3981433006"}