{"jobTitle": "Social Media Manager", "company": {"name": "Summer Fridays", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "<strong>JOB TITLE</strong>: Social Media Manager<p><br/></p><p><strong>REPORTS TO</strong>: Director of Brand Marketing</p><p><br/></p><p><strong>DEPARTMENT</strong>: Marketing </p><p><br/></p><p><strong>OVERVIEW</strong></p><p>Our social team is growing! We are hiring a Social Media Manager to lead our social team and help deepen the connection with our Summer Fridays community. Reporting to the Director of Brand Marketing, this role will be responsible for leading and executing a comprehensive, best-in-class social strategy across the brand’s social channels. </p><p><br/></p><p>The ideal candidate will love all things social, community, beauty and data. They will be fully immersed in the social landscape, understand algorithm nuances and best practices for creating engaging and on-brand content.. This individual will be responsible for tracking trends, managing Summer Fridays Instagram and TikTok social calendar and continuing to optimize overall performance. </p><p><br/></p><p><strong>RESPONSIBILITIES</strong></p><ul><li>Lead day-to-day channel management from ideation to execution; including mapping out all content calendars, creating social briefs, scheduling and maintaining an organized social calendar across platforms. </li><li>Write and edit copy for all social channels, ensuring a consistent brand voice throughout.</li><li>Responsible for real-time and in-person social support and community engagement during brand events — including but not limited to pop-ups, influencer events, etc. </li><li>Manage all data platforms including Dash Hudson and Tribe Dynamics, using analytics to inform ongoing improvements to channel and content performance, along with providing social media reports to the wider Marketing team.</li><li>Plan and schedule all social content including weekends and holidays (as needed) to maintain social presence and foster community. </li><li>Work closely with the Director of Brand Marketing and Social + Community Coordinator to strengthen community connection through both digital and in-person moments.</li><li>Support Social + Community Coordinator with community questions, comments and direct messages daily across platforms.</li><li> Collaborate with the Customer Care team, sharing key questions and inquiries from our community to provide feedback and share to upper management as needed.</li><li>Lead ongoing initiatives to gather community feedback on new product development and existing product input. </li><li> Assist with ad hoc marketing projects including marketing photo shoots, community management, brand events, etc.</li></ul><p><br/></p><p><strong>REQUIREMENTS</strong></p><ul><li> 5+  years’ experience in social media or community management. Beauty and start up experience is a plus!</li><li> Passion for skincare, beauty and building community</li><li>Exceptional organizational and time management skills</li><li> Must be comfortable on camera and filming content</li><li>Understands Google Suite including Slides, Sheets, etc. Adobe Suite/Figma experience is a plus! </li><li>Works well cross-functionally and experience with CX is a plus!</li><li>Experience with Dash Hudson or previous social data tracking platforms</li><li> Eager, can-do positive attitude </li><li>Self-starter—able to execute upon multiple projects and against tight deadlines </li><li>Ability to think outside of the box and create unique social and marketing strategies </li><li>Collaborative, open minded and able to thrive in a fast-paced startup environment </li><li>Must be available for two days in-office in Los Angeles</li><li>Must be based in Los Angeles</li></ul>", "postedDate": "4 weeks ago", "skills": ["Social Media", "Community Management", "Skincare", "Beauty", "Data", "Instagram", "TikTok", "Dash Hudson", "Tribe Dynamics", "Google Suite", "Adobe Suite", "Figma", "CX"], "url": "https://www.linkedin.com/jobs/view/3981613072"}