{"jobTitle": "Account Coordinator - LA", "company": {"name": "Acast", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000 - 55,000/year", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Online Audio and Video Media", "description": "Since 2014, Acast has been creating the world’s most valuable podcast marketplace, building<br/><br/>the technology which connects podcast creators, advertisers and listeners.<br/><br/>Its marketplace spans more than 125,000 podcasts, 2,700 advertisers and c.1 billion quarterly listens.<br/><br/>Crucially, those listens are monetized wherever they happen - across any podcasting app or<br/><br/>other listening platform.<br/><br/>The company operates worldwide and is headquartered in Stockholm, Sweden. Acast is listed on the Nasdaq First North Premier Growth Market ( ACAST.ST ).<br/><br/><strong>About The Role<br/><br/></strong>We are looking for a driven, energetic and passionate Account Coordinator to enter the rapidly growing podcast industry and join our dynamic Sales &amp; Brand Partnerships team in Los Angeles. The Account Coordinator will be responsible for shaping media strategies in collaboration with Account Managers, and in doing so liaising with our talented podcasters on brand approvals and sponsorship reads, planning materials for advertisers, processing insertion orders and campaign assets, as well as the delivery and the success of campaigns.<br/><br/><ul><li> In this role, you will assist Account Managers and Account Directors in developing media solutions for clients, with a high degree of attention to detail and confidence in Excel and Keynote.</li><li> Working closely with content, ad operations, and finance, you ensure smooth campaign delivery.</li><li> Adding campaign data to NetSuite and other CRM systems.</li><li> Work with Acast's talented podcasters to manage and monetise their inventory.</li><li> You will also work together with the Account Managers to compile post-campaign reporting and insights that will drive renewals.<br/><br/><br/></li></ul>This is a full-time, salaried role. The compensation range for the role is $50,000 - $55,000/year + bonus.<br/><br/><strong>Who You Are<br/><br/></strong><ul><li> Some podcast/media industry experience or relevant college degree.</li><li> An enthusiastic doer with a great passion for podcasts, brand storytelling, and advertising, you are highly productive, detail-oriented, and enthusiastic.</li><li> You are also willing to collaborate across markets to achieve our collective goals.</li><li> Being able to work independently at times and to be a self-starter is also essential.</li><li> Your positive attitude and eagerness to learn and grow enables you to manage multiple campaigns simultaneously with a high level of attention to detail.</li><li> Excellent written and verbal communication skills.</li><li> Passionate about entering the media sales industry and learning everything about it.<br/><br/><br/></li></ul><strong>Where you will be<br/><br/></strong>Most of our teams are hybrids with some members co-located in offices and some working remotely. With a remote first way of working we want you to feel productive regardless of work location!<br/><br/>For this role, you can be based in LA.<br/><br/>$50,000 - $55,000 a year<br/><br/>Acast is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, gender, sexual orientation, religion, ethnicity, national origin or any of the other wonderful characteristics that make us different.<br/><br/>Culture is our number one priority as a business. We believe people come first, and we work every day to enable autonomy, continuous improvement and bring out the best in people. We’re global and have remote teams, so it’s even more important that we strive for an open, inclusive and caring environment where everyone feels visible and welcome. We consider ourselves a modern organization driven by strong values to create the best, most fulfilling and nurturing culture.<br/><br/>We very much look forward to finding the next great person to join our cause!", "responsibilities": "The Account Coordinator will be responsible for shaping media strategies in collaboration with Account Managers, and in doing so liaising with our talented podcasters on brand approvals and sponsorship reads, planning materials for advertisers, processing insertion orders and campaign assets, as well as the delivery and the success of campaigns.", "qualifications": {"required": "Some podcast/media industry experience or relevant college degree.", "preferred": "An enthusiastic doer with a great passion for podcasts, brand storytelling, and advertising, you are highly productive, detail-oriented, and enthusiastic. You are also willing to collaborate across markets to achieve our collective goals. Being able to work independently at times and to be a self-starter is also essential. Your positive attitude and eagerness to learn and grow enables you to manage multiple campaigns simultaneously with a high level of attention to detail. Excellent written and verbal communication skills. Passionate about entering the media sales industry and learning everything about it."}, "skills": ["Podcast", "Media", "Excel", "Keynote", "CRM", "NetSuite", "Campaign Management", "Media Strategy", "Brand Storytelling", "Advertising", "Collaboration", "Self-Starter", "Communication"], "postedDate": "1 month ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3981300422"}