{"jobTitle": "District Sales Manager", "company": {"name": "Hamdan Resources", "industry": "Internet Publishing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Our client is actively looking for a District Sales Manager to develop new business through sales in a specific geographic area and conduct training to demonstrate the value associated with Sumitomo products with OEM's, Distribution, Users, and Consultants. Essential Functions (other duties may be assigned): Increase sales volume in the district via sales calls and other promotional activities, including: Distributor training, technical presentations, proposals, and market research tools. Strategically develop a plan to increase sales at current and new accounts that are aligned with Sumitomo's corporate strategy for growth. Follow-up on sales activities, e.g., quotes, orders, deliveries, and returns. Perform time management assessments including scheduling, e-mail, voice mail, and reports. Manage all current and new business channels within sales territory. Minimum Qualifications: Bachelor’s Degree in Business or Engineering, or equivalent experience. Five (5) years of outside sales experience. Business to Business (B2B) is required. Three (3) years of sales experience in the mechanical power transmission market (i.e. Industrial Gear Boxes, Variable Speed Drives - Mechanical & Electrical, Industrial Electric Motors). Demonstrated track record of sales success, exceeding quotas and surpassing expectations, with demonstrated revenue retention and growth. Must be proactive, outgoing, self-motivated and self-directed with a strong record of sales/market planning, client development, and follow through and overcoming barriers to sales. Strong written and oral communication skills required. Ability to adapt to audience and project competence and confidence when speaking to range of audiences and groups. Demonstrated technical proficiency in strategic selling disciplines. Working knowledge of Microsoft Windows, Salesforce, and Office (Word, Excel, and PowerPoint). Must be able to perform a considerable amount of travel (50-75%). Any additional essential skills and/or knowledge as shown in the HRIS Career & Education > Skills section for incumbents holding this job title. Hamdan Resources, LLC is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer (EEO/AA), making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. Citizenship and/or authorization to work within the U.S.is required for most positions. Powered by JazzHR", "responsibilities": "Increase sales volume in the district via sales calls and other promotional activities, including: Distributor training, technical presentations, proposals, and market research tools. Strategically develop a plan to increase sales at current and new accounts that are aligned with Sumitomo's corporate strategy for growth. Follow-up on sales activities, e.g., quotes, orders, deliveries, and returns. Perform time management assessments including scheduling, e-mail, voice mail, and reports. Manage all current and new business channels within sales territory.", "qualifications": {"required": "Bachelor’s Degree in Business or Engineering, or equivalent experience. Five (5) years of outside sales experience. Business to Business (B2B) is required. Three (3) years of sales experience in the mechanical power transmission market (i.e. Industrial Gear Boxes, Variable Speed Drives - Mechanical & Electrical, Industrial Electric Motors).", "preferred": "Strong written and oral communication skills required. Ability to adapt to audience and project competence and confidence when speaking to range of audiences and groups."}, "skills": ["Sales", "Business Development", "Client Development", "Market Planning", "Communication", "Salesforce", "Microsoft Office"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3981016508"}