{"jobTitle": "Supply Planner", "company": {"name": "TravisMathew", "location": "Huntington Beach, CA"}, "location": "Huntington Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "64,500.00/yr - 96,700.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing, Management, and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "TravisMathew is a premium apparel brand that exists because we seized an opportunity—and we’re inviting you to take yours. Back in 2007, we saw there weren’t many companies whose clothing bridged the gap between performance and lifestyle, so we created our own. Inspired by the sun, surf, and sand of Southern California, we became a leading innovator in lifestyle performance apparel by making clothes for real life—plus working with premium wholesalers, building a leading e-commerce business, and opening retail stores around the world. We invite you to join team TravisMathew.\n\nThe Supply Planner is responsible for supporting integrated supply planning activities across the organization. This individual will review, identify, and mitigate any near-term and long-range imbalances of supply and demand using quantitative analysis and data-based decision making. Additionally, the Supply Planner is responsible for supporting the management of lead times and variability to ensure supply availability to meet and exceed service, revenue and profitability objectives.\n\nROLES AND RESPONSIBILITIES\n\n* Review, identify and mitigate constrained supply requirements within a horizontal supply chain to support cost, inventory and service objectives\n* Participate in high impact weekly operations planning activities focused on identifying and mitigating demand x supply misalignments to ensure on time performance\n* Troubleshoot key performance indicators, plan vs. actual to ensure end-to-end supply chain execution and performance, escalating gaps for decision making\n* Collaborate cross functionally on supply risk mitigation, supporting the development of collaborative action plans to support service, revenue, and profit objectives\n* Perform quantitative analysis and reporting using data-based perspectives to influence decision making\n* Perform integrated capacity modeling within supply chain, reviewing seasonal demand signals against available supply (capacity), determining actual capability stated vs. demonstrated\n\nTECHNICAL COMPETENCIES (Knowledge, Skills & Abilities)\n\n* Highly proficient in Microsoft Applications (i.e., Excel, PowerPoint, Word)\n* Highly proficient in Microsoft Excel modeling\n* Proficient in SAP or equivalent ERP with a focus on integrated planning\n* APICS CPIM / CSCP (or other if appropriate), preferred\n* Ability to work effectively and collaboratively with cross-functional teams and stakeholders\n* Ability to articulate and clearly communicate complex problems and solutions in a simple, logical and impactful manner\n* Deadline-driven with a strong sense of urgency\n* Strong quantitative skills with the ability to analyze data / detail\n* Strong planning and communication skills\n\nEDUCATION AND EXPERIENCE\n\n* Bachelor’s Degree in Economics, quantitative disciplines, supply chain or related field\n* Minimum 3 years’ relevant experience within and a Sales and Operations Planning (S&OP) environment\n\nPHYSICAL REQUIREMENTS / WORK ENVIRONMENT (if applicable)\n\n* Work is performed in a designated professional office workstation and environment.\n* Extensive use of office equipment to include computer, calculator, copier, fax, and other business-related machines and software.", "responsibilities": "The Supply Planner is responsible for supporting integrated supply planning activities across the organization. This individual will review, identify, and mitigate any near-term and long-range imbalances of supply and demand using quantitative analysis and data-based decision making. Additionally, the Supply Planner is responsible for supporting the management of lead times and variability to ensure supply availability to meet and exceed service, revenue and profitability objectives.", "qualifications": {"required": "Highly proficient in Microsoft Applications (i.e., Excel, PowerPoint, Word), Highly proficient in Microsoft Excel modeling, Proficient in SAP or equivalent ERP with a focus on integrated planning, Ability to work effectively and collaboratively with cross-functional teams and stakeholders, Ability to articulate and clearly communicate complex problems and solutions in a simple, logical and impactful manner, Deadline-driven with a strong sense of urgency, Strong quantitative skills with the ability to analyze data / detail, Strong planning and communication skills", "preferred": "APICS CPIM / CSCP (or other if appropriate), Bachelor’s Degree in Economics, quantitative disciplines, supply chain or related field, Minimum 3 years’ relevant experience within and a Sales and Operations Planning (S&OP) environment"}, "skills": ["Microsoft Excel", "SAP", "Supply Chain Management", "Data Analysis", "Communication", "Problem Solving", "Planning", "Collaboration"], "postedDate": "4 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981855351"}