{"jobTitle": "Quality Assurance Manager", "company": {"name": "DENSO", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "112,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Motor Vehicle Manufacturing", "description": "<strong>Job Description<br/><br/></strong>The Quality Assurance Manager will be responsible for managing the development of new products and suppliers. This includes strict adherence to DENSO's new product introduction process. Candidate will lead Quality Engineering Team and oversee project management, supplier and product development, onsite audits, inspections and testing. Must be willing to travel domestically and internationally to lead supplier audits. Also supports with the development of associates, as well as activities involving associate counseling, evaluating work performance and assisting in skill development.<br/><br/>Requires travel up to 25% of the time - domestic and international<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Manages, develops and maintains Supplier Quality and pertinent ISO standards. </li><li>Maintains relationships and directly interacts with suppliers to address and resolve quality issues, including traveling to the supplier’s location as necessary to audit their processes to ensure DENSO quality standards are met, document and facilitate improvement measures, facilitate the closure of issues and emphasize the DENSO quality image. </li><li>Develops and manages the process to establish and approve new suppliers; including, but not limited to, review and assessment of readiness (SRR), assuring education and training on DENSO quality standards, and the resolution of any issues. </li><li>Coordinates and collaborates with Procurement, Engineering, Receiving, Repack and Packaging departments on internal and supplier quality issues and makes decisions towards resolution. </li><li>Collaborates with senior management to develop goals, objectives and measures for assigned area in light of overall department, division and organization strategy. Responsible, along with senior management, for the development of short-and-long range plans for assigned area. </li><li>Plans, assigns, schedules, direct, reviews and approves completed work by the quality engineering staff. Supports supplier quality associates in meeting customer requirements. </li><li>Assists in the development of and monitors the budget for assigned area. Provides input into staffing proposals. <br/><br/></li></ul><strong>Minimum Level Of Education And Training Required<br/><br/></strong><ul><li>Requires a Bachelor’s degree in electrical or mechanical engineering or related field. </li><li>Requires 10+ years of relevant experience, or an equivalent level of education and experience. </li><li>2+ years of leadership experience is preferred. </li><li>Previous automotive experience is preferred. <br/><br/></li></ul><strong>Minimum Level Of Knowledge And Skills Required<br/><br/></strong><ul><li>Strong knowledge of engineering theories, processes and terms </li><li>Strong knowledge of ISO and other quality standards </li><li>Excellent written and verbal communication skills. Must be a skillful presenter that can interpret information based on a general knowledge of the organization, its products and procedures, and provide an independent explanation and discussion based on the technical or complex nature of the materials being discussed </li><li>Excellent customer service skills with an ability to approach every business relationship partnership </li><li>Excellent negotiation skills. Ability to resolve difficult or complicated situations that are often sensitive in nature. Recognizes and applies subtle cues in anticipating customers’ needs and potential next steps. Takes strong stand without indicating disrespect and seeks positive outcomes </li><li>Advanced level of experience using Microsoft Word, PowerPoint and Excel </li><li>Knowledge of database or analytical software such as Access </li><li>Analytical skills to interpret potentially conflicting data </li><li>Familiarity with project management software </li><li>Strong organizational and time management skills </li><li>Ability to develop department and team G&amp;Os </li><li>People management<br/><br/></li></ul><strong>Benefits Summary<br/><br/></strong><ul><li>Health, Dental, Vision, Prescription Drug plans </li><li>Life and Accidental Death &amp; Dismemberment Insurance </li><li>Flexible Spending Account </li><li>Employee Assistance Program </li><li>401K with 4% company match </li><li>Bonus Program </li><li>Wellness Program </li><li>Onsite Fitness Center (vary by location)</li><li>Tuition Reimbursement </li><li>Career Development and Ongoing Training </li><li>Paid holidays and vacation </li><li>Cafeteria and food markets (vary by location) </li><li>Volunteer opportunities </li><li>Employee recognition (employee and milestone events) <br/><br/></li></ul>Annual Salary: $112,000-$140,000", "responsibilities": "The Quality Assurance Manager will be responsible for managing the development of new products and suppliers. This includes strict adherence to DENSO's new product introduction process. Candidate will lead Quality Engineering Team and oversee project management, supplier and product development, onsite audits, inspections and testing. Must be willing to travel domestically and internationally to lead supplier audits. Also supports with the development of associates, as well as activities involving associate counseling, evaluating work performance and assisting in skill development.", "qualifications": {"required": "Requires a Bachelor’s degree in electrical or mechanical engineering or related field. Requires 10+ years of relevant experience, or an equivalent level of education and experience. 2+ years of leadership experience is preferred. Previous automotive experience is preferred.", "preferred": "Requires a Bachelor’s degree in electrical or mechanical engineering or related field. Requires 10+ years of relevant experience, or an equivalent level of education and experience. 2+ years of leadership experience is preferred. Previous automotive experience is preferred."}, "skills": ["ISO", "Quality Assurance", "Supplier Quality", "Project Management", "Microsoft Word", "PowerPoint", "Excel", "Access", "Analytical Skills", "Time Management", "People Management"], "postedDate": "3 days ago", "benefits": "Health, Dental, Vision, Prescription Drug plans Life and Accidental Death &amp; Dismemberment Insurance Flexible Spending Account Employee Assistance Program 401K with 4% company match Bonus Program Wellness Program Onsite Fitness Center (vary by location) Tuition Reimbursement Career Development and Ongoing Training Paid holidays and vacation Cafeteria and food markets (vary by location) Volunteer opportunities Employee recognition (employee and milestone events)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982270958"}