{"jobTitle": "Planner", "company": {"name": "AECOM", "location": "Orange, CA", "industry": "Architecture and Planning, Civil Engineering, and Construction"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "58,000.00 - 68,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Architecture and Planning, Civil Engineering, and Construction", "description": "Work with Us. Change the World.\nAt AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations.\nThere has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of over 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world.\nWe're one global team driven by our common purpose to deliver a better world. Join us.\nAECOM is actively seeking an Urban Planner for employment in the Orange, California office to support the delivering of Master Planning products for military installations. This position is geared towards physical planning and not policy planning.\nThis position is expected to begin in July 2024 .\nThe responsibilities of this position include, but are not limited to:\nSupports planning studies and reports for new and updated plans, programs, and regulations.\nReviews or assists in the review of development proposals and site plans for conformance with codes, plans, and regulations.\nPrepares and presents detailed reports on development proposals to government bodies.\nCollects a variety of statistical data and prepares reports and maps on topics, such as census information, land use, transportation tax base data, and occupancy rates.\nAssists in evaluating re-zonings, ordinance amendments, site plans, special use permits, variances, and other proposals.\nCoordinates community review of public and private development projects.\nProvides information to the public regarding development regulations.\nAssists in resolving citizen and customer issues.\nUnder direct supervision, conducts field evaluations and assessments.\nBachelor's degree in planning, Architecture, Landscape Architecture, or related experience in planning-related work or demonstrated equivalency of experience.\nAbility to travel\nDue to the nature of this work, US citizenship is required\nRelated intern and/or professional experience.\nPositive outlook and can-do attitude approach to tasks and teamwork.\nExceptional writing, research, analysis, and communication skills.\nExcellent time management skills and ability to balance priorities.\nEffective problem-solving and analytical skills.\nEfficient and organized worker with a high level of attention to detail.\nAbility to work independently as well as in multi-disciplinary teams.\nApt at developing creative and innovative graphics and project layouts.\nFollows guidance well with little oversight.\nProficient with Microsoft Word, Excel, PowerPoint, ArcGIS, Adobe InDesign, Illustrator, AutoCAD5\nRelocation assistance is not available for this position.\nSponsorship for US employment authorization is not available now or in the future for this position.\nOffered compensation will be based on location and individual qualifications. The expected range is $58,000.00 - $68,000.00.\nAECOM is proud to offer a comprehensive benefits program to meet the diverse needs of our employees. Depending on your employment status, AECOM benefits may include medical, dental, vision, life, AD&D, disability benefits, paid time off, leaves of absence, voluntary benefits, perks, U.S. and global well-being programs, employee assistance program, business travel insurance, service recognition awards, retirement savings plan, and employee stock purchase plan.\nAECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $14.4 billion in fiscal year 2023. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM.\nYou will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed.\nYou will help us foster a culture of equity, diversity and inclusion – a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients.\nAECOM provides a wide array of compensation and benefits programs to meet the diverse needs of our employees and their families. We also provide a robust global well-being program. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too.\nJoin us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours.\nAll your information will be kept confidential according to EEO guidelines.", "responsibilities": "Supports planning studies and reports for new and updated plans, programs, and regulations.\nReviews or assists in the review of development proposals and site plans for conformance with codes, plans, and regulations.\nPrepares and presents detailed reports on development proposals to government bodies.\nCollects a variety of statistical data and prepares reports and maps on topics, such as census information, land use, transportation tax base data, and occupancy rates.\nAssists in evaluating re-zonings, ordinance amendments, site plans, special use permits, variances, and other proposals.\nCoordinates community review of public and private development projects.\nProvides information to the public regarding development regulations.\nAssists in resolving citizen and customer issues.\nUnder direct supervision, conducts field evaluations and assessments.", "qualifications": {"required": "Bachelor's degree in planning, Architecture, Landscape Architecture, or related experience in planning-related work or demonstrated equivalency of experience.\nAbility to travel\nDue to the nature of this work, US citizenship is required", "preferred": "Related intern and/or professional experience.\nPositive outlook and can-do attitude approach to tasks and teamwork.\nExceptional writing, research, analysis, and communication skills.\nExcellent time management skills and ability to balance priorities.\nEffective problem-solving and analytical skills.\nEfficient and organized worker with a high level of attention to detail.\nAbility to work independently as well as in multi-disciplinary teams.\nApt at developing creative and innovative graphics and project layouts.\nFollows guidance well with little oversight.\nProficient with Microsoft Word, Excel, PowerPoint, ArcGIS, Adobe InDesign, Illustrator, AutoCAD5"}, "skills": ["Planning", "Architecture", "Landscape Architecture", "Microsoft Word", "Excel", "PowerPoint", "ArcGIS", "Adobe InDesign", "Illustrator", "AutoCAD"], "postedDate": "1 month ago", "benefits": "AECOM is proud to offer a comprehensive benefits program to meet the diverse needs of our employees. Depending on your employment status, AECOM benefits may include medical, dental, vision, life, AD&D, disability benefits, paid time off, leaves of absence, voluntary benefits, perks, U.S. and global well-being programs, employee assistance program, business travel insurance, service recognition awards, retirement savings plan, and employee stock purchase plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982891542"}