{"jobTitle": "Account Manager Associate, Large Client Sales", "company": {"name": "Google", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "69,000.00/yr - $104,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>Chicago, IL, USA; Atlanta, GA, USA; Los Angeles, CA, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>Experience in sales, digital marketing, or digital advertising through full time roles, internships, or relevant coursework.</li><li>Ability to communicate in English fluently in order to interact in this customer-facing sales role.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience working with Google Ads, managing advertising, and media campaigns.</li><li>Ability to work towards strategic goals in a fast-paced environment.</li><li>Excellent client service, relationship building, organizational, investigative, problem-solving, and influencing skills.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.<br/><br/>As an Account Manager Associate, you will be part of the Google Americas Sales Associate Program. Through this program, Google develops Sales Associates in specific product and business training and executive access/exposure over a fixed period of time. You will move across different Google advertising Sales teams and roles, serving as media account managers for short-term assignments to help cover team member extended leaves. Upon completion of the program, you will transition into permanent Account Manager roles or other positions at Google. You will work in a team-focused environment, managing relationships with clients, and work with your manager to find a permanent role post program.<br/><br/>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.<br/><br/>The US base salary range for this full-time position is $69,000-$104,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Take responsibility for the account management of clients on sales team.</li><li>Craft and deliver solutions to customers to achieve their business objectives and drive business growth for Google, with some guidance.</li><li>Partner with customers and help drive customer relationships in order to work towards mutual business objectives. Make contributions to building, growing, and the maintenance of customer portfolios to help manage customers and drive high-impact and long-lasting relationships.</li><li>Provide campaign updates, troubleshoot client challenges, and deliver customer training in all Google tools.</li><li>Travel up to 20% to work with clients or teams.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Take responsibility for the account management of clients on sales team.</li><li>Craft and deliver solutions to customers to achieve their business objectives and drive business growth for Google, with some guidance.</li><li>Partner with customers and help drive customer relationships in order to work towards mutual business objectives. Make contributions to building, growing, and the maintenance of customer portfolios to help manage customers and drive high-impact and long-lasting relationships.</li><li>Provide campaign updates, troubleshoot client challenges, and deliver customer training in all Google tools.</li><li>Travel up to 20% to work with clients or teams.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.Experience in sales, digital marketing, or digital advertising through full time roles, internships, or relevant coursework.Ability to communicate in English fluently in order to interact in this customer-facing sales role.", "preferred": "Experience working with Google Ads, managing advertising, and media campaigns.Ability to work towards strategic goals in a fast-paced environment.Excellent client service, relationship building, organizational, investigative, problem-solving, and influencing skills."}, "skills": [], "postedDate": "5 days ago", "benefits": "bonus + equity + benefits", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3982757060"}