{"jobTitle": "Director of Campus Operations", "company": {"name": "The Webb Schools", "location": "Claremont, CA"}, "location": "Claremont, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "130,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Education", "description": "The Webb Schools is pleased to work with DRG to conduct this search.  Read the full Opportunity Statement HERE.  Opportunities and Challenges  The Director of Campus Operations will be the newest member of the highly collaborative and productive leadership team. This group leads with a growth and an excellence-oriented mindset in their approach to keeping Webb a beautiful, safe, creative, and inspiring academic institution that has the highly relational and homey feel unique to boarding schools.  The next Director will bring effective leadership and honed interpersonal skills to manage personnel in collaborative teams, foresee and solve problems as they arise, and communicate across the Webb community. In addition to prioritizing building and repairing trusted relationships, the Director will benefit by evaluating current systems and pursuing adjustments and efficiencies to processes as needed. A key area of examination is the transparency and prioritization in planning and executing renovations and upgrades in the dorms, faculty residences, and other spaces around campus.  As a boarding school, with a 100-year-old historic campus set in Southern California’s increasingly fire prone foothills and containing the Alf Museum—a fully functional and renowned paleontology museum—managing Webb’s operations mimics the complexity of a small city. It will be imperative for the new Director to establish strong relationships with all stakeholders in order to understand the complete picture and bring a strategic lens to caring for Webb’s current infrastructure and envisioning what is possible in the future.  Webb operates from a fiscally conservative philosophy, and the Director of Campus Operations will need to be similarly diligent about resources while still bringing creativity, attention to detail, and an eye for beauty to all things on the campus. A successful director will be able to balance the preservation and maintenance of Webb’s historic presence while also supporting opportunities for new construction and innovative ideas for use of spaces.  A hospitality mindset, attention to detail, and leading with transparency and timely communication will set the Director up to be a fantastic addition to the Webb team. The faculty and staff will be looking to this director to set the standard of mutual respect for the operations team, outside vendors and contractors, and the faculty and staff.  The Position: Director of Campus Operations  The Director of Campus Operations is responsible for ensuring Webb’s operations reflect its excellence and support its educational programs. The Director oversees campus operations, including dining services, maintenance and housekeeping, security, and technology services. The Director manages relationships with outside vendors and is involved in advancing Webb’s campus master plan with an eye toward financial and environmental sustainability. The ideal Director is an experienced manager and systems thinker with broad knowledge of operations, an eye to detail, keen problem-solving abilities, and strong collaboration and communication skills. The Director demonstrates the ability to lead change, innovate, and build and sustain high trust working relationships with multiple constituents and across departments.  The Director of Campus Operations reports to the Head of School and is a member of the Senior Leadership Team. The Director supervises operational managers, including the Director of Food Services, the Director of Facilities, the Director of Technology, the Director of Security &amp; Special Operations, and the Operations Coordinator and oversees vendor relationships in related areas. The Director collaborates closely with other administrators, faculty, and staff to ensure transparent and timely communication and effective functioning of school operations.  Key Responsibilities  Leadership &amp; Collaboration  Serve as a member of the Senior Leadership Team, collaboratively working to ensure the success of the School’s annual operating plans and progress in achieving its long-term strategic vision  Collaborate with the Dean of Faculty, Dean of Students, and Assistant Head of School to ensure good communication with campus residents  Lead Webb’s sustainability team, ensuring campus operations are environmentally responsible and all constituents are engaged in supporting a sustainable campus footprint  Oversee campus master planning processes, including collaboration with various stakeholder groups and outside experts  As a member of the Capital Project Team, work closely with the CFO, the Board of Trustees, and members of the senior leadership team to support the development of campus projects  Conduct research, analysis, and forecasts as needed  Operations Management  Direct all aspects of facilities planning and development, facilities use, maintenance, operations, construction, modernization, and cleaning  Provide daily operational facilities oversight and campus maintenance year-round  Oversee security and safety systems, including emergency training and response  Oversee dining services and campus catering, including the Stockdale café  Oversee all purchasing of Webb merchandise and campus furniture  Oversee information technology services  Develop and oversee operational budgets, in collaboration with the CFO.  Ensure that all activities and operations are carried out in compliance with local, state, and federal regulations and laws governing business operations  Ensure timely communications regarding campus operations to relevant stakeholders  Plan, organize, execute, and manage operation and construction projects  Provide set up and operational support for evening and weekend projects, programs, and events  Community Participation  Serve as the staff liaison for assigned Board Committees and prepare and present materials for Board work  Promote the development of the operations team, with ongoing educational and professional development, including participating in industry association events  Attend and support major school events and activities  Publicly represent the school in a positive and proactive way, collaborating with other local institutions, neighbors, and public officials  Communicate effectively with diverse populations; demonstrate an interest in diversity, equity, inclusion, and belonging work  Contributes to the delivery of the mission, vision, and values of the school community  Desired Qualifications and Qualities  Education, Experience, and skills  Bachelor’s degree plus at least ten years successful facilities and operations experience and five years supervisory experience  Master’s degree or additional degrees/certifications in relevant areas preferred  Project management, construction or facilities maintenance, and vendor management experience  Adept with technology including Microsoft Office and comfortable learning new systems  Excellent verbal and written communication, and strong analytical skills  Proven success at working collaboratively and efficiently on a creative, diverse, and goal-oriented team  Ability to respond to and resolve nighttime, holiday, and weekend emergencies  Experience caring for a campus and up-to-date on best practices  Personal Characteristics  Self-motivated, ability to navigate competing demands and projects, and excellent work habits  Demonstrates inclusive and equitable practices to ensure that all members of the community feel a sense of belonging  High standards of ethics, moral character, and professionalism, and serves as a positive role model  Works effectively as a team member and develops professional and productive relationships with colleagues  Understands boundaries and embraces responsibility for the care of students in loco parentis  Promotes a trust-based community by keeping appropriate confidences  Manages time effectively and meets deadlines and commitments  Communicates and responds to all school communications in a timely manner  Exhibits flexibility and adaptability to change as needed  Humility and a keen sense of humor  Benefits and Compensation  The salary range for this position is $130,000–$150,000.  Webb offers:  Generous low-cost medical for employees and eligible family members 90% covered by Webb  Flexible spending accounts for health and dependent care  Tuition remission for children enrolled at Webb  Life and long-term disability  6–10% school contribution to TIAA 403(b) based on tenure  Generous professional development support  Application Requirements and Search Process  DRG is conducting this search on behalf of Webb. Interested candidates should submit, as soon as possible, materials including the following:  A cover letter indicating why they are particularly interested in and qualified for the position.  A current resume.  The names, email addresses, and telephone numbers of five references, to include the relationship with the references. (We will obtain permission from candidates, at the finalist stage, before contacting references.)  Application Status: Accepting Applications  Start Date: Fall 2024  This position description is based upon material provided by The Webb Schools, an equal opportunity employer committed to providing equal employment opportunities and who does not discriminate based on perceived or actual race, color, national or ethnic origin, religion, sex, pregnancy (or any related conditions), age, marital status, military or veteran status, medical condition, gender/identity/expression, sexual orientation, or any other characteristic protected by state or federal law.", "responsibilities": "Serve as a member of the Senior Leadership Team, collaboratively working to ensure the success of the School’s annual operating plans and progress in achieving its long-term strategic vision\nCollaborate with the Dean of Faculty, Dean of Students, and Assistant Head of School to ensure good communication with campus residents\nLead Webb’s sustainability team, ensuring campus operations are environmentally responsible and all constituents are engaged in supporting a sustainable campus footprint\nOversee campus master planning processes, including collaboration with various stakeholder groups and outside experts\nAs a member of the Capital Project Team, work closely with the CFO, the Board of Trustees, and members of the senior leadership team to support the development of campus projects\nConduct research, analysis, and forecasts as needed\nDirect all aspects of facilities planning and development, facilities use, maintenance, operations, construction, modernization, and cleaning\nProvide daily operational facilities oversight and campus maintenance year-round\nOversee security and safety systems, including emergency training and response\nOversee dining services and campus catering, including the Stockdale café\nOversee all purchasing of Webb merchandise and campus furniture\nOversee information technology services\nDevelop and oversee operational budgets, in collaboration with the CFO.\nEnsure that all activities and operations are carried out in compliance with local, state, and federal regulations and laws governing business operations\nEnsure timely communications regarding campus operations to relevant stakeholders\nPlan, organize, execute, and manage operation and construction projects\nProvide set up and operational support for evening and weekend projects, programs, and events\nServe as the staff liaison for assigned Board Committees and prepare and present materials for Board work\nPromote the development of the operations team, with ongoing educational and professional development, including participating in industry association events\nAttend and support major school events and activities\nPublicly represent the school in a positive and proactive way, collaborating with other local institutions, neighbors, and public officials\nCommunicate effectively with diverse populations; demonstrate an interest in diversity, equity, inclusion, and belonging work\nContributes to the delivery of the mission, vision, and values of the school community", "qualifications": {"required": "Bachelor’s degree plus at least ten years successful facilities and operations experience and five years supervisory experience\nProject management, construction or facilities maintenance, and vendor management experience\nAdept with technology including Microsoft Office and comfortable learning new systems\nExcellent verbal and written communication, and strong analytical skills\nProven success at working collaboratively and efficiently on a creative, diverse, and goal-oriented team\nAbility to respond to and resolve nighttime, holiday, and weekend emergencies\nExperience caring for a campus and up-to-date on best practices", "preferred": "Master’s degree or additional degrees/certifications in relevant areas preferred"}, "skills": ["Microsoft Office", "Project Management", "Construction", "Facilities Maintenance", "Vendor Management", "Communication", "Analytical Skills", "Teamwork", "Leadership", "Problem Solving", "Sustainability", "Budgeting", "Compliance", "Emergency Response", "Campus Operations", "Hospitality", "Diversity", "Equity", "Inclusion", "Belonging"], "postedDate": "4 weeks ago", "benefits": "Generous low-cost medical for employees and eligible family members 90% covered by Webb\nFlexible spending accounts for health and dependent care\nTuition remission for children enrolled at Webb\nLife and long-term disability\n6–10% school contribution to TIAA 403(b) based on tenure\nGenerous professional development support", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982243239"}