{"jobTitle": "Director of Planning & Allocation", "company": {"name": "True Classic", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00 - $170,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Retail Apparel and Fashion", "description": "<strong>Position Overview<br/><br/></strong><strong>Classification</strong>: Full Time, exempt<br/><br/><strong>Location</strong>: Remote<br/><br/><strong>Department</strong>: Demand Planning<br/><br/><strong>Reports to:</strong> Head of Product<br/><br/>We are seeking an exceptional Director of Planning &amp; Allocation to lead our planning and inventory strategy. In this role, you will be responsible for ensuring optimal product availability, managing inventory effectively, and driving innovative solutions in forecasting and allocation to support the company's financial goals, enhance the operational efficiency, and improve overall inventory.<br/><br/>All of True Classic's roles are global and omni-channel, leading designated areas of accountability across all product categories, countries, and different sales &amp; marketing channels. This means you will have the opportunity to impact our operations worldwide, ensuring a cohesive strategy that aligns with our overall business objectives and drives success across various markets and platforms.<br/><br/><strong>Key Areas of Accountability<br/><br/></strong><ul><li> Team Leadership: Hire, develop, and motivate a high-performing team, including internal members and external partners. Foster a collaborative environment and achieve business goals.</li><li> Planning &amp; Inventory Strategy: Develop strategic plans at the department, class, and product levels to align with company financial objectives and merchandising strategies across all channels and marketplaces. Optimize inventory through planning, buying, and managing assortment breadth and depth across channels and warehouse to achieve sales goals while minimizing inventory liability.</li><li> Sales Forecasting: Conduct in-season forecasting to meet or exceed key performance indicators, including sales, margins, and inventory health, balances, aging turns, and weeks of supply.</li><li> Inventory Management and Allocation: Oversee inventory management and allocation to ensure optimal stock levels and efficient distribution across channels. Collaborate with operations and channel owners on inventory optimization by warehouse and lead inventory rebalancing efforts according to sales forecasts.</li><li> Promotional and Markdown Analysis: Lead and implement pricing and promotional markdown strategies to drive revenue, manage inventory effectively, and support just-in-time investments for key programs. Conduct monthly OTB reviews and adjust inventory strategies to support timely investments and support key programs.</li><li> Forecasting Tech Solutions and Innovation: Evaluate and integrate advanced technology and business intelligence tools to enhance forecasting accuracy and inventory management. Strategize and develop tools and dashboards to support workflow execution and drive KPIs.<br/><br/></li></ul><strong>Cross-Functional Collaboration<br/><br/></strong><ul><li>Merchandising: Collaborate on aligning inventory with product launches and seasonal trends. Ensure product availability meets merchandising strategies and promotional plans. </li><li>Production and Sourcing: Work closely to coordinate inventory with production schedules and sourcing strategies. Optimize supply chain efficiency and address any sourcing issues impacting inventory levels. </li><li>Finance: Partner on inventory budgeting and financial planning to manage costs and meet financial targets. Align inventory investment with financial goals and performance metrics. </li><li>Operations and Logistics: Coordinate to ensure efficient inventory flow and fulfillment processes. Alsign inventory levels with operational capabilities and optimize warehouse and distribution operations. </li><li>Business Intelligence: Utilize BI tools to analyze data and inform forecasting and allocation decisions. Develop insights and recommendations based on performance metrics and trends. </li><li>Tech: Collaborate with IT to implement and refine technology solutions for forecasting and inventory management. Support the development and deployment of tools and systems to enhance operational efficiency. <br/><br/></li></ul><strong>Qualification Requirements<br/><br/></strong><ul><li>Bachelor's degree required.</li><li>10-15 years of experience in merchandise planning and multi-location allocation within vertical specialty retail.</li><li>Proven experience in leadership roles with team management and growth capabilities.</li><li>Demonstrated track record in managing large-scale businesses to achieve financial targets. <br/><br/></li></ul><strong>Technical Skills<br/><br/></strong><ul><li>Advanced proficiency in Excel and Google Suite</li><li>Strong skills in tool building, visualizations, and innovation </li><li>Excellent written and verbal communication, presentation, and interpersonal skills.</li><li>Expertise in omni-channel and e-commerce direct business models. </li><li>Advanced skills in retail math, including markup, margin planning, selling, and inventory productivity measures. </li><li>Comfortable operating both strategically and tactically, from high level overview to detailed execution. <br/><br/></li></ul><strong>Soft Skills<br/><br/></strong><ul><li>Ability to influence and maintain productive cross-functional relationships. </li><li>Highly organized, detail-oriented, and analytical with a focus on execution and process improvement. </li><li>Motivated by working in a fast-paced, collaborative environment with flexibility in functional roles. </li><li>Continuous learner, curious, and open to new perspectives, with a proactive approach to change and challenges. <br/><br/></li></ul><strong>Preferences<br/><br/></strong><ul><li>MBA degree preferred.</li><li>Experience in the apparel industry.</li><li>Background in wholesale planning.<br/><br/></li></ul><strong>Company Overview<br/><br/></strong>True Classic launched in late 2019 and has grown to become one of the hottest direct-to-consumer men's apparel brands, continuing to experience rapid growth despite changes to digital advertising and the macroeconomic environment. We are on a mission to empower over 100M people worldwide to look good and feel good by the end of 2034 and are guided by six core values to chart our path to success:<br/><br/><ul><li>Move the Needle </li><ul><li>We are obsessed with driving tangible business results.</li><li>We constantly refocus our efforts and eliminate busy work to drive measurable impact.</li><li>We embrace simplicity, automation, and technology to amplify our force.</li></ul><li>Harness Grit </li><ul><li>We are ambitious and persevere through challenges with a relentless spirit.</li><li>We're optimistic about the future and our glass is half full.</li><li>We are self-motivated, resourceful, and determined to make a difference.</li></ul><li>Go Fast ⚡</li><ul><li>We are nimble, open-minded, and seek the fastest path to success.</li><li>We remove barriers, eliminate friction, and move at the speed of light.</li><li>We believe that “done is better than perfect” and fail forward to make progress.</li></ul><li>Execute as a Pro </li><ul><li>We are curious and leverage data &amp; insights to move in the right direction. </li><li>We are doers, embody an owner's mentality, and strive to get 1% better every day.</li><li>We work systematically to produce consistent results &amp; get our projects done right.</li></ul><li>Be Creative </li><ul><li>We are first-principles thinkers and develop bold ideas to challenge the status quo.</li><li>We are innovators at heart &amp; believe that ingenuity is often the solution.</li><li>We solve problems resourcefully and think outside the box.</li></ul><li>Lead with Empathy </li><ul><li>We obsess over our customers to consistently over-deliver.</li><li>We are inclusive, appreciative, and supportive of our employees &amp; partners.</li><li>We put ourselves in others' shoes and seek to deeply understand their perspective.<br/></li></ul></ul><strong>Work Environment<br/><br/></strong>This is a remote position, allowing you to work from the comfort of your home or any location with reliable internet access within the United States. You will spend extended periods at a computer, so a comfortable and ergonomic workspace is essential. We provide the necessary tools and support to ensure a productive and collaborative virtual work experience. Additionally, the company holds quarterly all-hands meetings in California, which you would be expected to travel to and attend in person.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>$150,000-$170,000</li><li>Unlimited Sick Days &amp; PTO</li><li>Company paid medical, dental, and vision PPO insurance (Anthem Gold PPO)</li><li>401k plan with 3% company match</li><li>Monthly $200 stipend for home office expenses</li><li>Free $1,000 worth of True Classic merchandise every year</li><li>Free Employee Assistance Program<br/><br/></li></ul>Our mission is to empower everyone to show up as their best self. We are dedicated to creating a community where creativity, curiosity, and innovation thrive; and that starts with welcoming diverse voices to our team. We believe that everyone should feel confident being exactly who they are, which is why we're committed to being an equal opportunity employer. We celebrate and support differences in race, religion, color, national origin, gender, sexual orientation, gender identity, age, veteran status, and abilities. If you need assistance or an accommodation due to a disability, please reach out to Human Resources.<br/><br/><em>Please note that the duties and responsibilities outlined in this job description are intended to describe the general nature and level of work performed by employees assigned to this position. It is not an exhaustive list of all responsibilities, duties, and skills required for the role. Additional tasks and responsibilities may be assigned as needed to meet business needs.</em>", "responsibilities": "<strong>Key Areas of Accountability<br/><br/></strong><ul><li> Team Leadership: Hire, develop, and motivate a high-performing team, including internal members and external partners. Foster a collaborative environment and achieve business goals.</li><li> Planning &amp; Inventory Strategy: Develop strategic plans at the department, class, and product levels to align with company financial objectives and merchandising strategies across all channels and marketplaces. Optimize inventory through planning, buying, and managing assortment breadth and depth across channels and warehouse to achieve sales goals while minimizing inventory liability.</li><li> Sales Forecasting: Conduct in-season forecasting to meet or exceed key performance indicators, including sales, margins, and inventory health, balances, aging turns, and weeks of supply.</li><li> Inventory Management and Allocation: Oversee inventory management and allocation to ensure optimal stock levels and efficient distribution across channels. Collaborate with operations and channel owners on inventory optimization by warehouse and lead inventory rebalancing efforts according to sales forecasts.</li><li> Promotional and Markdown Analysis: Lead and implement pricing and promotional markdown strategies to drive revenue, manage inventory effectively, and support just-in-time investments for key programs. Conduct monthly OTB reviews and adjust inventory strategies to support timely investments and support key programs.</li><li> Forecasting Tech Solutions and Innovation: Evaluate and integrate advanced technology and business intelligence tools to enhance forecasting accuracy and inventory management. Strategize and develop tools and dashboards to support workflow execution and drive KPIs.<br/><br/></li></ul><strong>Cross-Functional Collaboration<br/><br/></strong><ul><li>Merchandising: Collaborate on aligning inventory with product launches and seasonal trends. Ensure product availability meets merchandising strategies and promotional plans. </li><li>Production and Sourcing: Work closely to coordinate inventory with production schedules and sourcing strategies. Optimize supply chain efficiency and address any sourcing issues impacting inventory levels. </li><li>Finance: Partner on inventory budgeting and financial planning to manage costs and meet financial targets. Align inventory investment with financial goals and performance metrics. </li><li>Operations and Logistics: Coordinate to ensure efficient inventory flow and fulfillment processes. Alsign inventory levels with operational capabilities and optimize warehouse and distribution operations. </li><li>Business Intelligence: Utilize BI tools to analyze data and inform forecasting and allocation decisions. Develop insights and recommendations based on performance metrics and trends. </li><li>Tech: Collaborate with IT to implement and refine technology solutions for forecasting and inventory management. Support the development and deployment of tools and systems to enhance operational efficiency. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree required.\n10-15 years of experience in merchandise planning and multi-location allocation within vertical specialty retail.\nProven experience in leadership roles with team management and growth capabilities.\nDemonstrated track record in managing large-scale businesses to achieve financial targets. ", "preferred": "MBA degree preferred.\nExperience in the apparel industry.\nBackground in wholesale planning."}, "skills": ["Excel", "Google Suite", "Tool Building", "Visualizations", "Innovation", "Communication", "Presentation", "Interpersonal Skills", "Omni-channel", "E-commerce", "Retail Math", "Markup", "Margin Planning", "Selling", "Inventory Productivity Measures", "Strategic Thinking", "Tactical Execution", "Cross-functional Collaboration", "Influence", "Relationship Building", "Organization", "Detail-oriented", "Analytical", "Execution", "Process Improvement", "Fast-paced Environment", "Collaboration", "Flexibility", "Continuous Learning", "Curiosity", "New Perspectives", "Proactive Approach", "Change Management", "Challenge Handling"], "postedDate": "1 month ago", "benefits": "$150,000-$170,000\nUnlimited Sick Days &amp; PTO\nCompany paid medical, dental, and vision PPO insurance (Anthem Gold PPO)\n401k plan with 3% company match\nMonthly $200 stipend for home office expenses\nFree $1,000 worth of True Classic merchandise every year\nFree Employee Assistance Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982399076"}