{"jobTitle": "FRONT OFFICE MANAGER", "company": {"name": "Twenty Four Seven Hotels", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Real Estate", "description": "Our Residence Inn Manhattan Beach is currently seeking an experienced, knowledgeable and independent-working Front Office Manager to lead the Front Office Team up to brand standards and Owner expectations. As part of the property team you will help us “ craft inspired workplaces that enable all Associates to deliver kick-ass guest experiences and maximize investor returns ”! This could be the perfect opportunity to advance your career with a growing and exciting hotel management company!<br/><br/>Position Responsibilities<br/><br/>\n<ul><li>Management of day to day Front Office and Breakfast Operations</li><li>Ability to maintain guest confidence through prompt and courteous communication with guests and associates</li><li>Execute highest quality of service to guests at all times</li><li>Complete scheduling for the department(s)</li><li>Assist in managing aspects of P&amp;L by controlling costs and achieving budgeted CPOR</li><li>Monitor labor productivity</li><li>Participate in property MOD Program as needed</li><li>Train department in all duties and empowerment needed to reach top performance levels</li><li>Support the sales efforts of the hotel and in generating revenue opportunities<br/><br/></li></ul>Education And Experience<br/><br/>\n<ul><li>Successful Front Office hotel management experience is a must</li><li>Systems experience within the Marriott Brands is required, Residence Inn experience is preferred</li><li>Must be able to work weekend and evenings</li><li>Must be highly motivated, self-directed, with strong initiative and desire for achievement</li><li>Exceptional guest service skills required</li><li>Must possess strong computer skills</li><li>Excellent communication and presentations skills required<br/><br/></li></ul>Our Perks<br/><br/>Highly competitive salary<br/><br/>Medical, Dental, Vision, Ancillary Benefits, 401K<br/><br/>Paid Time Off, Paid Sick Time<br/><br/>Job Training, Opportunity for Advancement<br/><br/>Associate Referral Program, Hotel Discounts<br/><br/>And now – Daily Pay!<br/><br/>#HCareers<br/><br/>About Us<br/><br/>24seven Hotels is a premium-branded lifestyle and select-service -focused hotel management company that believes better is always possible—for our investors, our partners, our associates and our guests. We operate in a sweet spot—large enough to be well-resourced and effective; small and specialized enough to offer accessibility and expertise in operations, investment and development. As a company, we value one-on-one relationships above all else. Whether you’re an associate, a partner or an investor/owner, we’re here for you—day in and day out. E nsuring our associates are able to successfully grow in their careers, and our owners are able to successfully grow their investment.<br/><br/>Our hotel brand partners include Marriott, Hilton, Hyatt, IHG and Choice.<br/><br/>For more information on Twenty Four Seven Hotels, visit www.247hotels.com . Instagram: @247hotels Facebook: @247hotels<br/><br/>Twenty Four Seven Hotels is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. Twenty Four Seven Hotels does not discriminate on the basis of disability, veteran status or any other basis protected under federal, state or local laws.<br/><br/>Notice To California Applicants<br/><br/>The California Privacy Rights Act requires that applicants be informed that Twenty Four Seven Hotels will collect certain personal information during the application process. Personal information collected may include each applicant’s real name, email address, postal address, and similar identifiers. Additionally, Twenty Four Seven Hotels may collect professional and employment-related information, and education information. Twenty Four Seven Hotels does not collect sensitive personal information during the application process.<br/><br/>Twenty Four Seven Hotels will use the personal information collected to contact and communicate with applicants, and to assess each applicant’s qualifications for the job(s) to which they apply. Twenty Four Seven Hotels may also use and share Personal Information as reference checks are conducted. Twenty Four Seven Hotels may also share certain Personal Information provided by applicants to service providers who are engaged by Twenty Four Seven Hotels to conduct criminal background checks. The Personal Information collected will be retained at least two years from the time an application is submitted, and may be retained as long as seven years after termination of employment for applicants who are employed by the Company. Twenty Four Seven Hotels does not sell Personal Information provided by applicants.<br/><br/>Applicants have the right to request that Personal Information collected by Twenty Four Seven Hotels during the application process be deleted or to request that inaccurate Personal Information be corrected by submitting the request in writing to Twenty Four Seven Hotels, 520 Newport Center Drive #520, Newport Beach, Ca 92660, or by contacting the People Resources and Development Department by dialing 949-734-6400.", "responsibilities": "Management of day to day Front Office and Breakfast Operations\nAbility to maintain guest confidence through prompt and courteous communication with guests and associates\nExecute highest quality of service to guests at all times\nComplete scheduling for the department(s)\nAssist in managing aspects of P&amp;L by controlling costs and achieving budgeted CPOR\nMonitor labor productivity\nParticipate in property MOD Program as needed\nTrain department in all duties and empowerment needed to reach top performance levels\nSupport the sales efforts of the hotel and in generating revenue opportunities", "qualifications": {"required": "Successful Front Office hotel management experience is a must\nSystems experience within the Marriott Brands is required, Residence Inn experience is preferred\nMust be able to work weekend and evenings\nMust be highly motivated, self-directed, with strong initiative and desire for achievement\nExceptional guest service skills required\nMust possess strong computer skills\nExcellent communication and presentations skills required"}, "skills": [], "postedDate": "1 month ago", "benefits": "Highly competitive salary\nMedical, Dental, Vision, Ancillary Benefits, 401K\nPaid Time Off, Paid Sick Time\nJob Training, Opportunity for Advancement\nAssociate Referral Program, Hotel Discounts\nAnd now – Daily Pay!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982660809"}