{"jobTitle": "Front Desk Receptionist (Part-Time)", "company": {"name": "Los Angeles Capital Management LLC", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Administrative, Customer Service, and General Business", "industry": "Financial Services", "description": "<strong>Receptionist (Part-Time, ~20 hours per week)</strong><br/><br/><strong>About the Firm</strong><br/><br/><strong><em>Firm Mission</em></strong><br/><strong><em>“Achieving Client Success through Research and Technology”</em></strong><br/><br/>Los Angeles Capital, the “Firm”, is a global equity manager of assets for leading institutions around the world. The Firm is recognized as a pioneer in dynamic equity management, utilizing proprietary technology to engineer equity portfolios that adapt to today’s equity market. The Firm’s senior investment professionals have worked together for three decades developing models for measuring and forecasting return and risk of global equity securities. The Firm manages approximately $31 billion as of December 1, 2023, across a wide variety of public equity strategies designed to meet institutional client return and risk objectives. The Firm has been ranked for seven years in a row by Pensions and Investments as one of the “Best Places to Work in Money Management.” The Firm’s working environment places a strong focus on teamwork and values work-life balance. The Firm offers a competitive compensation package that includes health care plans, 401(k), and top-tier benefits. The Firm is 100% employee-owned through a holding company structure and seeks to retain and motivate employees’ long term. Los Angeles Capital firmly believes the quality and commitment of the individuals are vital to the success of the Firm, ensuring that client expectations are exceeded.<br/><br/><strong>Position Overview</strong><br/>Reporting to the Director of Human Resources, the Receptionist will facilitate and maintain all general office duties, as well as help individuals with projects when necessary. The ideal candidate will have a professional demeanor and be able to multi-task. The ability to speak professionally to clients when answering the phone or greeting them in the office, is essential.<br/><br/><strong>Key Job Responsibilities</strong><ul><li>Greet visitors in a professional manner</li><li>Answer phones in a professional and efficient manner</li><li>Keep the office orderly and efficient to help increase productivity of all employees</li><li>Maintain updated internal phone lists</li><li>Maintain main calendar to ensure all meetings and attendees are properly recorded</li><li>Handle all mailing responsibilities e.g., sending and receiving deliveries from UPS, FedEx, etc.</li><li>Order office supplies for individual employees and keep a stock of general items available in the copy room</li><li>Prepare conference rooms for meetings with clients</li><li>Order coffee supplies</li><li>Order and stock the kitchen each week and arrange all the food supplies in an orderly fashion</li><li>Handle building key card and parking transponder orders for new hires and maintain for existing employees</li><li>Communicate with building security for visitors, building facilities, and as needed</li><li>Record and maintain office expenses</li><li>Receive, sort, and distribute the incoming mail</li><li>Receive, stamp and ensure timing handling of outgoing mail </li><li>Assist with internal and external events and activities</li><li>Assist the HR department with onboarding and offboard processes</li><li>Assist with other HR functions, as needed</li><li>Assist with accounting functions such as AR and AP, as needed</li></ul><br/><br/><strong>Skills and Knowledge Required</strong><ul><li>Minimum of 3 years reception experience, preferably in a financial services firm</li><li>Experience working in a business environment</li><li>Highly proficient in Microsoft Office applications</li><li>Outgoing, inquisitive and engaging</li><li>Organized and proactive</li><li>Clear written and verbal communication skills</li><li>Excellent team player who is willing to go the extra mile</li><li>Ability to work with deadlines to fulfill job duties, projects requirements, and goals</li></ul><br/><br/><strong>Skills and Knowledge Desired</strong><ul><li>Bachelor’s Degree</li><li>Notary license</li></ul><br/><br/>This is a part-time, onsite position based in Los Angeles, CA requiring attendance on Tuesdays and Wednesdays.<br/><br/><br/><strong>Apply today! </strong><br/><br/>Los Angeles Capital is an SEC registered investment adviser and required to track certain political contributions under rule 206(4)-5. Therefore, you will be required to disclose your prior political contributions.<br/><br/><br/><strong><em>Los Angeles Capital is an Affirmative Action/Equal Opportunity Employer committed to providing employment opportunity without regard to an individual’s race, color, religion, age, gender, gender identity, sexual orientation, national origin, ancestry, marital status, medical condition, genetic information, veteran status or disability. </em></strong><br/><br/><em>For more information about the company, please refer to our website at www.lacapm.com.</em><br/><br/><strong>Personnel/Applicant Privacy Notice</strong><br/>Los Angeles Capital is committed to safeguarding the privacy of our personnel and job applicants. Los Angeles Capital does not “sell” (as that term is defined in the CCPA) your personal information. Please see the privacy notice for details: https://lacapm.com/files/9H6wltimZGhE/california-personnel-and-job-applicant-privacy-notice.pdf.", "responsibilities": "Greet visitors in a professional manner\nAnswer phones in a professional and efficient manner\nKeep the office orderly and efficient to help increase productivity of all employees\nMaintain updated internal phone lists\nMaintain main calendar to ensure all meetings and attendees are properly recorded\nHandle all mailing responsibilities e.g., sending and receiving deliveries from UPS, FedEx, etc.\nOrder office supplies for individual employees and keep a stock of general items available in the copy room\nPrepare conference rooms for meetings with clients\nOrder coffee supplies\nOrder and stock the kitchen each week and arrange all the food supplies in an orderly fashion\nHandle building key card and parking transponder orders for new hires and maintain for existing employees\nCommunicate with building security for visitors, building facilities, and as needed\nRecord and maintain office expenses\nReceive, sort, and distribute the incoming mail\nReceive, stamp and ensure timing handling of outgoing mail \nAssist with internal and external events and activities\nAssist the HR department with onboarding and offboard processes\nAssist with other HR functions, as needed\nAssist with accounting functions such as AR and AP, as needed", "qualifications": {"required": "Minimum of 3 years reception experience, preferably in a financial services firm\nExperience working in a business environment\nHighly proficient in Microsoft Office applications\nOutgoing, inquisitive and engaging\nOrganized and proactive\nClear written and verbal communication skills\nExcellent team player who is willing to go the extra mile\nAbility to work with deadlines to fulfill job duties, projects requirements, and goals", "preferred": "Bachelor’s Degree\nNotary license"}, "skills": ["Microsoft Office"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982212663"}