{"jobTitle": "Associate, Ads Product Marketing", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. At Netflix, the Ads Product Marketing Team specializes in bringing our Ad products to the B2B Advertising marketplace, globally. Product Marketing has a key role in both product development and go-to-market strategies. You will work collaboratively and cross-functionally with key stakeholders to articulate market requirements and frameworks for the Product team and define the product narrative. Our goal is to deliver products that meet (and exceed) the market’s needs and position them in a unique, compelling way that highlights the advantages that only Netflix can deliver. We are seeking a passionate, curious, and collaborative Ads Product Marketer to join our growing Ads Product Marketing team. You will have the opportunity to be a key player in taking our Ads business to the next level as we announce building our own ad tech and the acceleration of Programmatic. You will play a supportive role to Managers on GTM launch work and other project work, particularly in extending strategies and launches to apply to EMEA, LATAM and APAC regions. There is also opportunity to drive individual projects forward with support from a Manager on the team. Additionally, you will contribute to broader business tactics and pursue learning and development opportunities to consistently grow and evolve as a Netflix marketer and leader. This position is based in Los Angeles, CA, and reports to the Head of Ads Product Marketing. Key Responsibilities<br/><br/><ul><li>Support the definition and development of go-to-market efforts across new ad product solutions,&amp; enhance existing offerings in close partnership with cross-functional stakeholders (product commercialization, ad product, research, sales, UX, measurement, policy, etc)</li><li>Be a trusted partner to both the product and sales teams, and work closely with your team members in driving projects forward </li><li>Support the team in identifying and executing marketing needs to support ad products in each region (UCAN, LATAM, EMEA and APAC)</li><li>Collaborate and assist in creating materials, demos, assets, etc) that bring solutions to life in a succinct and exciting way</li><li>Work across teams to align on and roll out ad solutions in tentpole events (eg, CES,Upfront, Cannes)</li><li>Collaborate cross-functionally (Comms, Ad Product, Marketing) to ensure a consistent ads narrative.</li><li>Collaborate with Research teams to include audience and industry insights that caninform the development of new ad solution offerings and their positioning in market. <br/><br/></li></ul>What We’re Looking For<br/><br/><ul><li>3-5+ years experience in product marketing within the digital advertising and/or B2B Advertising space</li><li>Experience in partnering cross-functionally on product strategy, product </li><li>Strong ability to communicate and ability to project manage independently. Ability to partner with technical teams like Product. legal, policy and comms/ and other marketing team members on projects including product launch moments</li><li>Excellent communication and storytelling skills, with comfort in understanding research data</li><li>Ability to collaborate in an environment that values team culture and inclusiveness.</li><li>Excel at teamwork and have an ability to execute on near-term business priorities while simultaneously with building a long-term strategy for ad product marketing</li><li>Strong project management, planning, and organizational skills, including the ability to handle multiple projects simultaneously and to deliver work under tight timelines.</li><li>High-level understanding of product growth and developing strategic roadmaps</li><li>A strong attention to detail and eye towards using the 80/20 rule to address problems.</li><li>Knowledge of the ad-supported streaming space and and ad tech ecosystem</li><li>Programmatic experience a plus<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $70,000 - $245,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "jobFunction": "Other", "industry": "Entertainment Providers", "postedDate": "1 week ago", "skills": ["Product Marketing", "Digital Advertising", "B2B Advertising", "Product Strategy", "Project Management", "Communication", "Storytelling", "Research Data", "Teamwork", "Business Priorities", "Strategic Roadmaps", "Attention to Detail", "Ad-supported Streaming", "Ad Tech Ecosystem", "Programmatic"], "url": "https://www.linkedin.com/jobs/view/3982464581"}