{"jobTitle": "Language Production Manager, English Dubbing", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "160,000.00/yr - 360,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The Opportunity Netflix is the world’s leading internet entertainment service, with over 220 million memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. The Netflix Dubbing Production team is responsible for getting those amazing programs to our growing international audience. Centered around dubbing/VO production, a great team environment, and cutting-edge technology, this group is critical to Netflix’s ability to provide the best localized experience of our great content. With this international expansion, the preservation of creative intent in the production of a localized experience is of utmost importance, what a great time to join Netflix! As a Language Production Manager, English Dubbing, you will be responsible for how members experience English-dubbed audio, ensuring Netflix customers across the globe get the highest-quality experience from our localized audio assets. As we continue to add support for new languages and expand our global membership, providing best-in-class localized content is critical to our success. The Role The Language Production Manager, English Dubbing, will be the main liaison between the Netflix Dubbing team and local dubbing studios, not only overseeing the production of select titles in their respective language(s) but also ensuring a healthy production pipeline among our Dubbing vendors. The ideal candidate is an organized, strategic thinker who thrives in managing a multitude of tasks while safeguarding all title-level requirements. You will be working on Netflix's growing catalog to manage long-form project progress, creative and quality control, and the launch of all dubbed assets. Managing end-to-end dubbing includes working closely with internal and external partners to direct and/or influence outcomes even amidst ambiguity. This is a demanding and fast-moving position that requires someone who can maintain a holistic approach while getting as tactical as necessary to deliver the content. Applicants must work across all components of Dubbing alongside in-territory teams to produce high-quality global audio assets in their language. Responsibilities<br/><br/><ul><li>Be the leading voice of dubbing production and accessibility assets in the respective dubbing market. This team will manage multiple large-scale dubbing projects (long-form and short-form dubbing as well as accessibility assets) across a wide range of English partners and languages for Netflix original titles.</li><li>Be the leading voice of dubbing production and accessibility assets in the respective dubbing market.</li><li>Define standards for excellence and general creative guidelines for the respective territory/country. </li><li>Analyze content language trends/ performance to identify and solve localization challenges in collaboration with the Title Managers on select titles.</li><li>Build and leverage strong relationships with the talent community in the respective territory/country. Maintain and grow existing talent databases.</li><li>Collaborate with Dubbing Partners on dubbing talent casting and mix review on select titles, whilst enforcing adherence to creative guidelines on all dubbed titles. Influence and streamline dubbing production operations by looking for efficiency and innovative opportunities (budget awareness, scheduling, etc).</li><li>Working closely with Global Resource Strategy to regularly evaluate vendor strategy in the territory through data and expertise.</li><li>Accommodate and/or provide risk assessment for any special upstream localization requests in the territory. Address, resolve, and escalate issues and concerns as needed.</li><li>Closely monitor activities of actors unions/guilds that could influence pricing and general market behavior.</li><li>Initiate, support, and collaborate with cross-functional partners on Inclusion and diversity initiatives to ensure our strategy is consistent across the organization.</li><li>Be sensitive to the local competitive landscape in the respective market.</li><li>Have a working knowledge of the dubbing contracts and local best practices between talent and Netflix’s dubbing vendors.</li><li>Closely monitoring of activities of competitors' landscapes that could influence dubbing capacity and general market behavior.<br/><br/></li></ul><strong>Innovation<br/><br/></strong><ul><li>Be a subject matter expert in the Netflix tooling ecosystem to ensure adoption by our dubbing vendors.</li><li>Stay updated on how technology is impacting the dubbing process across the industry and consider ways to integrate these advancements into our workflow as the company develops its strategy.</li><li>The subject matter expert for dubbing production workflows within their language covers the detection, transformation, and adaptation processes and supports the Dubbing Strategy and Innovation roadmap.</li><li>Participate in the tests, and quality control of SV (for AD, lip sync, and VO, core assets roll-out, machine translation testing, etc.)<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>A minimum of 5-10 years of dubbing title/language management experience (creative/operations, respectively).</li><li>Ability to inspire trust and team-building skills while creating professional representation on behalf of Netflix.</li><li>Curiosity and interest in innovation and the ability to adapt to new technologies and processes.</li><li>Provide innovative thinking around scalable solutions and workflows, constantly questioning existing systems and looking for a better way.</li><li>Strong understanding of the creative process and the ability to communicate effectively with creative partners and cross-functional teams.</li><li>Highly analytical and able to get to the root cause of a problem; able to creatively figure out a solution or propose changes to existing workflows as required.</li><li>A strong understanding of Dubbing workflows and pipelines, including real-time workflows and the creative nature of the business.</li><li>Ability to handle a fast-paced environment, executing titles at various points of production (from development through delivery).</li><li>Contribute to the company's culture of curiosity and self-disciplined proactive responsibility as part of the Dubbing team.</li><li>Adept at writing, facilitating, and presenting analyses.</li><li>Bachelor's degree preferred and/or equivalent, relevant work experience.</li><li>Fluency in English is mandatory, and proficiency in another language is beneficial.<br/><br/></li></ul><strong>How This Role Adds Value<br/><br/></strong><ul><li>Manages Ambiguity.</li><li>Business Insight.</li><li>Collaborates.</li><li>Communicates Effectively.</li><li>Courage.</li><li>Decision Quality.</li><li>Interpersonal Savvy.</li><li>Build Networks.</li><li>Resourcefulness.</li><li>Situational Adaptability.</li><li>Balances Stakeholders.</li><li>Strategic Mindset.<br/><br/></li></ul>Who we work with: Main Partners<br/><br/><ul><li>Dubbing Title Management.</li><li>Globalization.</li><li>Marketing/PR.</li><li>Business and Legal Affairs.</li><li>Public Policy.</li><li>Finance Strategy and Analysis.</li><li>Dubbing Strategy and Innovation.</li><li>Product Discovery &amp; Promotion.</li><li>Production Technology &amp; Operations.</li><li>Finance Procurement Operations.</li><li>Content.</li><li>Dubbing Global Resource Strategy.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $360,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "<ul><li>Be the leading voice of dubbing production and accessibility assets in the respective dubbing market. This team will manage multiple large-scale dubbing projects (long-form and short-form dubbing as well as accessibility assets) across a wide range of English partners and languages for Netflix original titles.</li><li>Be the leading voice of dubbing production and accessibility assets in the respective dubbing market.</li><li>Define standards for excellence and general creative guidelines for the respective territory/country. </li><li>Analyze content language trends/ performance to identify and solve localization challenges in collaboration with the Title Managers on select titles.</li><li>Build and leverage strong relationships with the talent community in the respective territory/country. Maintain and grow existing talent databases.</li><li>Collaborate with Dubbing Partners on dubbing talent casting and mix review on select titles, whilst enforcing adherence to creative guidelines on all dubbed titles. Influence and streamline dubbing production operations by looking for efficiency and innovative opportunities (budget awareness, scheduling, etc).</li><li>Working closely with Global Resource Strategy to regularly evaluate vendor strategy in the territory through data and expertise.</li><li>Accommodate and/or provide risk assessment for any special upstream localization requests in the territory. Address, resolve, and escalate issues and concerns as needed.</li><li>Closely monitor activities of actors unions/guilds that could influence pricing and general market behavior.</li><li>Initiate, support, and collaborate with cross-functional partners on Inclusion and diversity initiatives to ensure our strategy is consistent across the organization.</li><li>Be sensitive to the local competitive landscape in the respective market.</li><li>Have a working knowledge of the dubbing contracts and local best practices between talent and Netflix’s dubbing vendors.</li><li>Closely monitoring of activities of competitors' landscapes that could influence dubbing capacity and general market behavior.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>A minimum of 5-10 years of dubbing title/language management experience (creative/operations, respectively).</li><li>Ability to inspire trust and team-building skills while creating professional representation on behalf of Netflix.</li><li>Curiosity and interest in innovation and the ability to adapt to new technologies and processes.</li><li>Provide innovative thinking around scalable solutions and workflows, constantly questioning existing systems and looking for a better way.</li><li>Strong understanding of the creative process and the ability to communicate effectively with creative partners and cross-functional teams.</li><li>Highly analytical and able to get to the root cause of a problem; able to creatively figure out a solution or propose changes to existing workflows as required.</li><li>A strong understanding of Dubbing workflows and pipelines, including real-time workflows and the creative nature of the business.</li><li>Ability to handle a fast-paced environment, executing titles at various points of production (from development through delivery).</li><li>Contribute to the company's culture of curiosity and self-disciplined proactive responsibility as part of the Dubbing team.</li><li>Adept at writing, facilitating, and presenting analyses.</li><li>Bachelor's degree preferred and/or equivalent, relevant work experience.</li><li>Fluency in English is mandatory, and proficiency in another language is beneficial.<br/><br/></li></ul>", "preferred": null}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3982464590"}