{"jobTitle": "Manager, Sports Publicity", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$160,000.00 - $320,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is seeking a Manager, Sports Publicity to spearhead publicity campaigns for its sports and nonfiction series, with a primary focus on the US market. This role is an individual contributor position and reports to the Director of Series Publicity, who oversees a team of publicists dedicated to Sports, Nonfiction, and Comedy series. The Manager of Sports Publicity will be part of a seasoned group of professionals based in the Los Angeles office.<br/><br/>As the Manager, you play a key role in strategizing, executing, and managing publicity campaigns for our sports and nonfiction series titles. You will collaborate with cross-functional partners spanning across content/programming, marketing, social, product and beyond to bring innovative campaigns to life. You are passionate about sports in the live, documentary and league follow space and have a deep understanding of the press and social landscape. You understand the audience and how they consume sports, and have a proven track record working first-hand on the development and execution of high-profile sport campaigns. Your innovative spirit enables you to conceive and actualize creative ideas that leave a lasting impression on the cultural zeitgeist.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Leverage multiple earned media channels, including broadcast, print, online, and new media.</li><li>Work closely with producers, athletes/ talent, and production company partners during production up to and beyond launch.</li><li>Create cultural moments and innovative high-impact campaigns, explore new tactics for promoting series, and be able to communicate different facets of their campaigns to executives, producers, talent, and talent representatives.</li><li>Pitch media and creative; innovate and secure press opportunities; cover set visits; and help plan and work junkets.</li><li>Coordinate requests and initiatives from international territories and will help prioritize what is important and vital to accomplish.</li><li>Formulate and manage a budget, and give visibility into their work successfully.</li><li>Support awards campaign from strategy and submission process for their shows.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>BA/BS and 7+ of entertainment experience in-house at a league, sports brand, agency, studio, network, or journalism setting.</li><li>Experience managing agencies on projects; has established relationships with key sports media, and building and maintaining connections with key journalists and social media influencers.</li><li>Strong media relationships at traditional and emerging entertainment, consumer, trade, and business outlets across broadcast, print, online and digital.</li><li>Thinks strategically and avoids relying on basic PR tactics by innovating and redefining campaign approaches.</li><li>Comfortable multitasking and working at a fast pace with high-volume tasks; thrives in an entrepreneurial environment characterized by ambiguity.</li><li>Clear, direct, and candid communication style; strong written and verbal skills.</li><li>Avidly consume sports entertainment and are passionate and curious about the growing global entertainment landscape.<br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>A strong business acumen and experience working at a global company.</li><li>Open to self-assessment and continuous improvement.</li><li>Handles sensitive issues with tact and diplomacy, including delivering bad news.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $320,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Leverage multiple earned media channels, including broadcast, print, online, and new media.\nWork closely with producers, athletes/ talent, and production company partners during production up to and beyond launch.\nCreate cultural moments and innovative high-impact campaigns, explore new tactics for promoting series, and be able to communicate different facets of their campaigns to executives, producers, talent, and talent representatives.\nPitch media and creative; innovate and secure press opportunities; cover set visits; and help plan and work junkets.\nCoordinate requests and initiatives from international territories and will help prioritize what is important and vital to accomplish.\nFormulate and manage a budget, and give visibility into their work successfully.\nSupport awards campaign from strategy and submission process for their shows.", "qualifications": {"required": "BA/BS and 7+ of entertainment experience in-house at a league, sports brand, agency, studio, network, or journalism setting.\nExperience managing agencies on projects; has established relationships with key sports media, and building and maintaining connections with key journalists and social media influencers.\nStrong media relationships at traditional and emerging entertainment, consumer, trade, and business outlets across broadcast, print, online and digital.\nThinks strategically and avoids relying on basic PR tactics by innovating and redefining campaign approaches.\nComfortable multitasking and working at a fast pace with high-volume tasks; thrives in an entrepreneurial environment characterized by ambiguity.\nClear, direct, and candid communication style; strong written and verbal skills.\nAvidly consume sports entertainment and are passionate and curious about the growing global entertainment landscape.", "preferred": "A strong business acumen and experience working at a global company.\nOpen to self-assessment and continuous improvement.\nHandles sensitive issues with tact and diplomacy, including delivering bad news."}, "skills": [], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982466042"}