{"jobTitle": "Assoc Analyst, Data - Remote - CA", "company": {"name": "Molina Healthcare", "location": "Long Beach, CA", "industry": "Hospitals and Health Care"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "16.23 - 35.17", "currency": "HOURLY"}, "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><ul><li>The candidates must reside in CA****<br/><br/></li></ul><strong>Job Summary<br/><br/></strong>Designs and implements processes and solutions associated with a wide variety of data sets used for data/text mining, analysis, modeling, and predicting to enable informed business decisions. Gains insight into key business problems and deliverables by applying statistical analysis techniques to examine structured and unstructured data from multiple disparate sources. Collaborates across departments and with customers to define requirements and understand business problems. Uses advanced mathematical, statistical, querying, and reporting methods to develop solutions. Develops information tools, algorithms, dashboards, and queries to monitor and improve business performance. Creates solutions from initial concept to fully tested production and communicates results to a broad range of audiences. Effectively uses current and emerging technologies.<br/><br/><strong>Knowledge/Skills/Abilities<br/><br/></strong><ul><li>Analyze, review, and load documents to support department operations.</li><li>Maintains reconciliation and production reports for department.</li><li>Prepares reports and analysis as needed.</li><li>Supports ad hoc reporting requests for department staff as needed.</li><li>Identifies any inadequacies within the existing process, strategizes and designs improvements where possible.</li><li>Performs other duties as assigned by department leadership.</li><li>Must have member movement or PCP reassignment or Enrollment and Provider termination experience.</li><li>Must have intermediate level MS Excel experience,</li><li>Familiarity with Enrollment and Managed Healthcare experience is required.</li><li>Must be able to research and analyze data, exposure or knowledge is SQL is highly preferred.</li><li>Experience with QNXT is preferred.<br/><br/></li></ul>Required soft skill include but are not limited to :<br/><br/><ul><li>Excellent communication</li><li>Possess a team player attitude</li><li>Ability to work in a diverse environment.</li><li>Must be flexible and willing to learn new skills.<br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><strong>Required Education<br/><br/></strong>HS Diploma or GED<br/><br/><strong>Required Experience<br/><br/></strong>0-1 year<br/><br/><strong>Preferred Education<br/><br/></strong>Associate degree or equivalent combination of education and experience<br/><br/><strong>Preferred Experience<br/><br/></strong>1-3 years<br/><br/>To all current Molina employees: If you are interested in applying for this position, please apply through the intranet job listing.<br/><br/>Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V<br/><br/>Pay Range: $16.23 - $35.17 / HOURLY<br/><br/><ul><li>Actual compensation may vary from posting based on geographic location, work experience, education and/or skill level.</li></ul>", "responsibilities": "Analyze, review, and load documents to support department operations. Maintains reconciliation and production reports for department. Prepares reports and analysis as needed. Supports ad hoc reporting requests for department staff as needed. Identifies any inadequacies within the existing process, strategizes and designs improvements where possible. Performs other duties as assigned by department leadership. Must have member movement or PCP reassignment or Enrollment and Provider termination experience. Must have intermediate level MS Excel experience, Familiarity with Enrollment and Managed Healthcare experience is required. Must be able to research and analyze data, exposure or knowledge is SQL is highly preferred. Experience with QNXT is preferred.", "qualifications": {"required": "HS Diploma or GED, 0-1 year experience", "preferred": "Associate degree or equivalent combination of education and experience, 1-3 years experience"}, "skills": ["Data Analysis", "SQL", "Excel", "Reporting", "Communication", "Teamwork"], "postedDate": "3 weeks ago", "benefits": "Molina Healthcare offers a competitive benefits and compensation package.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982055862"}