{"jobTitle": "ESG Controller", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "310,000.00/yr - 830,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The role location is flexible between our California-based office locations (Los Gatos or Los Angeles). Although we can be flexible on a hybrid working model, we are not offering a fully remote work option for this role. Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries, enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. Members can play, pause, and resume watching, all without commercials or commitments. It's an amazing time to join Netflix as we continue shaping the future of global entertainment, bringing new stories to millions of people worldwide. Visit our culture memo and long-term view to learn more. The successful candidate will be well-versed in existing global regulatory ESG reporting requirements, and a thought leader as we strategically navigate this evolving landscape. You’ll be hands-on as well as strategic, with deep expertise in regulatory reporting and internal controls and in building and improving robust processes that will scale to meet both our current and future challenges. You will collaborate exhaustively with our Finance, IR, Legal, Public Policy, and subject matter teams covering E, S, and G, across the globe to ensure we remain well coordinated and meet all of our ESG regulatory reporting requirements. This position is at the Director level and will report to the VP, Chief Accounting Officer. Responsibilities:<br/><br/><ul><li>Monitors the evolving global regulatory ESG reporting landscape and orchestrates various stakeholders in evolving our strategy to meet all requirements; stays apprised of voluntary ESG reporting developments so as to ensure consistency in what Netflix reports externally</li><li>Evaluate and determine the applicability of new reporting regulations globally (and at the legal entity level) based on deterministic thresholds (e.g. materiality, corporate size, etc.)</li><li>Builds our capabilities in terms of people, processes, internal controls and systems (including the evaluation of reporting software workflows) to meet all mandatory ESG reporting requirements globally</li><li>Assists teams in building and/or optimizing data and process flows, ultimately implementing SOX-like controls across the end-to-end business processes from data sources through disclosures</li><li>Develops and operationalizes standardized policies and processes with regard to sustainability reporting (e.g., materiality assessments, disclosure controls and procedures, estimation approaches)</li><li>Coordinates limited and reasonable assurance over ESG disclosures, with external accounting firms, where required</li><li>Coordinates mandatory ESG-related reporting, in partnership with Finance, IR, Legal, Policy, Finance, Statutory, and subject matter experts (e.g. Sustainability for E, Inclusion for S, etc) across the globe to ensure we remain well coordinated and meet all of our regulatory reporting requirements</li><li>Supports and coordinates with teams managing our voluntary ESG reporting to ensure we’re working in a synergistic manner </li><li>Builds and leads a global dream team that will support all ESG reporting and other activities</li><li>Trains key employee groups on reporting processes, controls, need/value of reporting. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>10+ years of experience in a combination of ESG reporting, accounting and financial reporting, internal controls, risk management, data management, or related fields.</li><li>Experience in working with ESG reporting standards and frameworks such as GRI, SASB, TCFD, etc;</li><li>Experience in building and improving well-controlled (SOX compliant) processes leveraging technology that scales globally;</li><li>Experience in building and leading high-performing and diverse global teams; </li><li>Strong understanding of ESG issues and willingness to keep up-to-date with the latest ESG guidelines and developments;</li><li>Proven track record in managing multiple projects and consistently meeting deadlines;</li><li>Strong business acumen, communication, presentation, and interpersonal skills; </li><li>High level of critical and logical thinking and comfort with ambiguity; </li><li>Incredible attention to detail and ownership of business outcomes.</li><li>A Master's degree in Business, Accounting, Finance, or a related field is a plus; </li><li>Big 4 experience and/or media &amp; entertainment exposure are pluses; </li><li>Relevant professional certifications such as CPA, CFA, Certified Sustainability Practitioner (CSP), Greenhouse Gas Management Institute diploma, or equivalent are a plus.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $310,000 - $830,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The successful candidate will be well-versed in existing global regulatory ESG reporting requirements, and a thought leader as we strategically navigate this evolving landscape. You’ll be hands-on as well as strategic, with deep expertise in regulatory reporting and internal controls and in building and improving robust processes that will scale to meet both our current and future challenges. You will collaborate exhaustively with our Finance, IR, Legal, Public Policy, and subject matter teams covering E, S, and G, across the globe to ensure we remain well coordinated and meet all of our ESG regulatory reporting requirements. This position is at the Director level and will report to the VP, Chief Accounting Officer. Responsibilities:<br/><br/><ul><li>Monitors the evolving global regulatory ESG reporting landscape and orchestrates various stakeholders in evolving our strategy to meet all requirements; stays apprised of voluntary ESG reporting developments so as to ensure consistency in what Netflix reports externally</li><li>Evaluate and determine the applicability of new reporting regulations globally (and at the legal entity level) based on deterministic thresholds (e.g. materiality, corporate size, etc.)</li><li>Builds our capabilities in terms of people, processes, internal controls and systems (including the evaluation of reporting software workflows) to meet all mandatory ESG reporting requirements globally</li><li>Assists teams in building and/or optimizing data and process flows, ultimately implementing SOX-like controls across the end-to-end business processes from data sources through disclosures</li><li>Develops and operationalizes standardized policies and processes with regard to sustainability reporting (e.g., materiality assessments, disclosure controls and procedures, estimation approaches)</li><li>Coordinates limited and reasonable assurance over ESG disclosures, with external accounting firms, where required</li><li>Coordinates mandatory ESG-related reporting, in partnership with Finance, IR, Legal, Policy, Finance, Statutory, and subject matter experts (e.g. Sustainability for E, Inclusion for S, etc) across the globe to ensure we remain well coordinated and meet all of our regulatory reporting requirements</li><li>Supports and coordinates with teams managing our voluntary ESG reporting to ensure we’re working in a synergistic manner </li><li>Builds and leads a global dream team that will support all ESG reporting and other activities</li><li>Trains key employee groups on reporting processes, controls, need/value of reporting. <br/><br/></li></ul>", "qualifications": {"required": "10+ years of experience in a combination of ESG reporting, accounting and financial reporting, internal controls, risk management, data management, or related fields.\nExperience in working with ESG reporting standards and frameworks such as GRI, SASB, TCFD, etc;\nExperience in building and improving well-controlled (SOX compliant) processes leveraging technology that scales globally;\nExperience in building and leading high-performing and diverse global teams; \nStrong understanding of ESG issues and willingness to keep up-to-date with the latest ESG guidelines and developments;\nProven track record in managing multiple projects and consistently meeting deadlines;\nStrong business acumen, communication, presentation, and interpersonal skills; \nHigh level of critical and logical thinking and comfort with ambiguity; \nIncredible attention to detail and ownership of business outcomes.", "preferred": "A Master's degree in Business, Accounting, Finance, or a related field is a plus; \nBig 4 experience and/or media & entertainment exposure are pluses; \nRelevant professional certifications such as CPA, CFA, Certified Sustainability Practitioner (CSP), Greenhouse Gas Management Institute diploma, or equivalent are a plus.<br/><br/>"}, "skills": [], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982464582"}