{"jobTitle": "Manager, Investor Relations & Corporate Research", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "160,000.00/yr - 470,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>Netflix is the world's leading streaming entertainment service with more than 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Netflix aspires to “entertain the world” and reach an even larger audience with its stories. The Investor Relations team works across the company to fully understand all aspects of our business, monitor the entertainment industry and competitors, and build strategic relationships with our investors. Senior leadership depends heavily on this team to inform important business decisions and communications with our shareholders. We collaborate closely with several teams across the business daily (e.g., functional and corporate strategy and planning teams, corporate development, etc.). Candidates are required to be highly analytical, critical thinkers, and effective communicators. Ideal candidates will have a proven track record of performing comprehensive analyses independently and proactively. Candidates must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results, collaborate effectively with colleagues, and exhibit the highest standards of integrity and ethics. This role will report to the VP of Investor Relations and is based in our Los Angeles office. Responsibilities:<br/><br/><ul><li>Creating materials to support our investor relations activities (e.g. earnings prep, investor meetings, and engagements) and helping to evolve our external metrics.</li><li>Building financial models and conducting detailed industry, company, and competitive analyses.</li><li>Actively monitoring our public and private competitive peers (e.g. SEC filings, investor day materials, etc.) to understand strategies and report on key developments.</li><li>Developing a deep understanding of external industry and internal company trends and competitive strategies.</li><li>Creating insightful presentations and well-written memos that summarize analyses and present them to senior business leaders such as the CFO, head of IR, etc.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5+ years of sell-side, buy-side, or investing experience or strategy roles; other highly analytical backgrounds are encouraged to apply. Prior Wall Street/equity investing experience would be highly valuable.</li><li>Strong financial modeling skills and extensive experience conducting quantitative and qualitative analysis as well as an understanding of public company financial filings and disclosure.</li><li>Strong written and verbal communication/presentation skills with a track record of presenting complex analyses to executives/senior management clearly and concisely.</li><li>Expertise in the media industry (having worked in a studio, production company, agency, distributor, or industry coverage) is a strong plus though not required.</li><li>Strong intellectual curiosity.</li><li>Very strong project management, planning, and organization skills, including the ability to handle multiple projects simultaneously in a fast-paced environment and to deliver work under a tight timeline.</li><li>Exceptional proficiency with Google Workspace, MS Excel &amp; PowerPoint and financial data software like CapIQ; working knowledge of statistics and analysis packages.</li><li>Bachelor's degree in finance, economics, mathematics, statistics or other relevant fields that demonstrates an aptitude for both quantitative and critical thinking.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $470,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "<ul><li>Creating materials to support our investor relations activities (e.g. earnings prep, investor meetings, and engagements) and helping to evolve our external metrics.</li><li>Building financial models and conducting detailed industry, company, and competitive analyses.</li><li>Actively monitoring our public and private competitive peers (e.g. SEC filings, investor day materials, etc.) to understand strategies and report on key developments.</li><li>Developing a deep understanding of external industry and internal company trends and competitive strategies.</li><li>Creating insightful presentations and well-written memos that summarize analyses and present them to senior business leaders such as the CFO, head of IR, etc.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of sell-side, buy-side, or investing experience or strategy roles; other highly analytical backgrounds are encouraged to apply. Prior Wall Street/equity investing experience would be highly valuable.", "preferred": "Strong financial modeling skills and extensive experience conducting quantitative and qualitative analysis as well as an understanding of public company financial filings and disclosure."}, "skills": ["Financial Modeling", "Quantitative Analysis", "Qualitative Analysis", "Public Company Financial Filings", "Media Industry", "Project Management", "Planning", "Organization", "Google Workspace", "MS Excel", "PowerPoint", "Financial Data Software", "Statistics", "Analysis Packages"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982463647"}