{"jobTitle": "Senior Digital Analyst", "company": {"name": "VML", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Advertising and Marketing", "industry": "Advertising Services", "description": "Who we are:\nAt VML, we are a beacon of innovation and growth in an ever-evolving world. Our heritage is built upon a century of combined expertise, where creativity meets technology, and diverse perspectives ignite inspiration. With the merger of VMLY&R and VML, we have forged a new path as a growth partner that is part creative agency, part consultancy, and part technology powerhouse.\n\nOur global family now encompasses over 30,000 employees across 150+ offices in 64 markets, each contributing to a culture that values connection, belonging, and the power of differences. Our expertise spans the entire customer journey, offering deep insights in communications, commerce, consultancy, CRM, CX, data, production, and technology. We deliver end-to-end solutions that result in revolutionary work.\n\nWho we are looking for:\nVML is seeking a Senior Digital Analyst with a background in data, business marketing and strategic analysis. To be successful in this role, you must be able to thrive in a creative environment where collaboration, client service, intelligence and humor are a must. We work with a national client base in a wide array of industries. We provide keen insights based on data analysis that help brands improve their online business. The core of this role revolves around extracting data, compiling reports and creating insightful presentations, but there will be many opportunities to work on a variety of projects. \n\nWhat you’ll do:\n\n* Execute | Manage and update new and recurring client reports delivered in a hybrid of Excel and PowerPoint.\n* Process | Leverage client’s Adobe Analytics instance to create ad hoc, recurring and deep-dive reporting.\n* Support | Support data collection requirement documentation and measurement planning, including UAT validation. Support troubleshooting tracking issues using web browser debugging tools.\n* Analyze | Create insightful analysis that tell the story through data. Audit client data and develop, maintain, and improve documentation for common team processes and best practices.\n* Collaborate | Work directly with Strategy, Creative and Media teams on their reporting and analysis requests, as well as with clients on test & learn projects including A/B and multivariate testing.\n\nWho you are:\n\n* A builder | Entrepreneurial attitude coupled with strong business acumen. Offer proactive solutions and ensure successful progression without guidance. Identify business and marketing problems, industry drivers, competitive landscapes, and trends and apply insights to enable clients to compete efficiently.\n* Motivated | Has a sense of urgency and is an adaptive self-starter with the ability to work across different initiatives. Has a high bar for quality, takes ownership and drives accountability across the organization. \n* Team Player | Our team is close-knit and supportive and we’re working with a lot of unknowns – you must champion team environments that are comfortable and encouraging.\n* Excellent Communicator | Excellent written and verbal communication skills. The ability to intake simple and complex problems, listen, find the appropriate solutions, and teach to internal and external teams why your solutions will work and why they continue to work (or need adapting) once implemented.\n* Ego-less  | We all wear the hats that need wearing; it’s a mentality that makes us successful. \n\nWhat you’ll need:\n\n* All-around talent, you can think through a complex business problem and solve it.\n* Minimum of 4 years of professional experience reporting and analyzing digital marketing efforts as they relate to the profitable acquisition of new customers and existing customers.\n* Minimum of 3 years of experience analyzing data, drawing conclusions and making recommendations.\n* Minimum of 3 years of experience working with site analytics raw data (Adobe Analytics)\n* Deep understanding of Adobe Analytics, including data collection and validation familiarity. Certification preferred, though not required.\n* Consulting experience is a plus, though not required.\n* Strong understanding of the concepts, terminology, and measurement issues in Web/Digital Analytics.\n* Ability to manage multiple projects concurrently.\n* Able to effectively communicate complex ideas to diverse audiences.\n* Quantitative related degree (e.g. science, engineering, finance, statistics, or related field) or strong quantitative training a plus.\n\nVML is an equal opportunity employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability, or other protected group status. We believe in creating a dynamic work environment that values diversity and inclusion and strives to recruit a diverse slate of candidates to help us achieve that goal.\n\nAt VML, we are committed to fostering an all-inclusive work environment that is both rewarding and career-forward. Our Inclusion, Equity & Belonging initiatives, alongside the VML Foundation, reflect our dedication to giving back and making a positive impact in our communities and beyond. Our people are the heartbeat of our organization—creators, doers, innovators, makers, and thinkers—who drive not just marketing, but meaningful experiences that resonate in every action and interaction. \n\nVML is a WPP Agency. For more information, please visit our website, and follow VML on our social channels via Instagram, LinkedIn, and X<u>.</u> \n\nWhen you click \"Submit Application\", this will send any information you add below to VML. Before you do this, we think it's a good idea to read through our Recruitment Privacy Policy. California residents should read our California Recruitment Privacy Notice. This explains what we do with your personal data when you apply for a role with us, and, how you can update the information you have provided us with or how to remove it.", "postedDate": "1 month ago", "skills": ["Adobe Analytics", "Data Analysis", "Digital Marketing", "Excel", "PowerPoint", "Reporting", "Strategic Analysis"], "url": "https://www.linkedin.com/jobs/view/3982050198"}