{"jobTitle": "Sr. Manager, HR Business Partner", "company": {"name": "Skyryse", "industry": "Technology, Information and Internet", "size": "51-200 employees", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000 - $250,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Technology, Information and Internet", "description": "Our mission at Skyryse is nothing less than a new era in flight, where fatalities are nearly zero, piloting any aircraft is simple and safe, and the sky is accessible to all. SkyOS, our industry-first universal operating system for flight, provides any airplane or helicopter with a fly-by-wire flight management solution that significantly reduces the complexity of flying. Skyryse One, our first production aircraft powered by SkyOS, was unveiled in 2024 and features the simplest, safest, and most intuitive flight controls in general aviation.\n\nSkyryse is looking to hire an experienced client facing Sr. Manager, HR Business Partner who has a strength in Learning & Development, Employee Engagement and Employee Relations. You’ll partner with Business Leaders, Talent Acquisition and HR Operations to craft and execute strategies for how we staff, onboard, develop, empower, retain and prioritize work. You must have recently led strategic HR projects to successful completion, thrive in a fast-paced start-up environment, be a gritty self-starter, and adept at problem-solving complex people issues. You will consult and influence the design and delivery of HR solutions across a broad spectrum of HR disciplines, including but not limited to Learning & Development, Employee Engagement, Employee Relations and Performance Management.", "responsibilities": "Deliver both strategic and tactical HR support and programs to employees and people leaders, including but not limited to, learning and development, employee engagement, employee relations and performance management. Resolve complex employee relation issues, and proactively prevent future ones. Coach and advise people leaders, with special emphasis on new people manager. Lead initiatives related to employee engagement and manager effectiveness; including the administration of surveys, analyzing results, work with leaders on action planning, and lead the survey task force to present and implement solutions. Design and facilitate workshops, training programs, and team-building activities that promote employee development, engagement and collaboration. Support the administration of the performance management, talent planning, and career pathing exercises, providing insights and analysis to people leaders. Support change management initiatives, including internal communication planning and execution, to ensure smooth implementation of organizational changes. Manage or assist with ad hoc HR duties in-line with a fast moving and dynamic tech start-up.", "qualifications": {"required": "Bachelor’s degree in Degree in HR Management, Organizational Design, IO Psychology, or related field. 8+ years Human Resources experience in fast moving, fast pivoting, start-up environments. Proficient at coaching people leaders and individual contributors, and resolving complex employee relations matters. Proficient at creating and writing bespoke HR documents, letters, and company-wide emails. Proficient at conducting group facilitation and supporting training program rollouts. Proficient utilizing and running reports in a modern HRIS system such as UKG. Strong working knowledge of CA employment law. Skilled with Microsoft Office and/or Google Suite applications. Exhibit strong attention to detail and active listening skills. Excellent communication skills - written, spoken, and presentations to executive and staff audiences. Foster positive working relationships across all organizational levels and departments. Ability to effectively handle multiple priorities, organize workload and meet start-up paced deadlines. High degree of integrity and confidentiality.", "preferred": "Expertise in the following areas preferred: Learning & Development, Employee Engagement Survey Administration, Employee Relations and Performance Management. Master’s degree in an HR related discipline. A combination of Fortune 500 HR best practices experience and recent technology start-up company experience with a Founder CEO. Strong business acumen, some non-HR business experience. Solid working knowledge of compensation practices. Experience scaling a workforce."}, "skills": ["Learning & Development", "Employee Engagement", "Employee Relations", "Performance Management", "Coaching", "Problem-solving", "Communication", "HRIS systems", "Microsoft Office", "Google Suite"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The opportunity to change the world through improving aviation safety and accessibility. Valuable stock option plan. Heavily subsidized medical, dental and vision plans. Full-time employees are eligible for 20 days of paid time off (PTO) and 5 sick days annually. PTO and sick days must be used in accordance with Company policy. A company with an ambitious vision, a dynamic work environment, and a team of smart, motivated, and fun to work-with colleagues!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3982283510"}