{"jobTitle": "Receptionist", "company": {"name": "Airport Marina Ford", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Retail", "description": "<strong>Position Title:</strong> Receptionist<br/><br/><strong>Department:</strong> Administration<br/><br/><strong>FLSA Status:</strong> Non-Exempt<br/><br/><strong>Position Summary:</strong> Provides general office support with a variety of clerical activities and related tasks. The receptionist will be responsible for answering incoming calls, directing calls to appropriate associates, mail distribution, flow of correspondence, requisition of supplies as well as additional clerical duties.<br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li>Answers incoming calls and directs the caller to the appropriate person, if asked for by name, or department.</li><li>Communicates with callers in a professional, courteous and efficient manner, minimizing the time a caller is put on hold. Informs caller if there is no answer, requesting if they would like voice mail.</li><li>Takes messages, if requested by the caller, including full name, time of call, reason for call and return number. Communicate messages to the appropriate party in a timely manner. </li><li>For general inquiries, provides callers with information such as company address, directions to the company location, company fax numbers, company website, and other related information.</li><li>Updates and distributes company telephone roster.</li><li>Greets and directs visitors to the company.</li><li>Provides callers with information such as company address, directions to the company location, company fax numbers, company website, and other related information.</li><li>Receives, sorts and forwards incoming mail. Maintains and routes publications.</li><li>Coordinates the pick-up and delivery of express mail services (FedEx, UPS, etc.)</li><li>May also assist with other related clerical duties such as photocopying, faxing, filing and collating.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Education &amp; Experience<br/><br/></strong>High school diploma or general education degree (GED); or six months to one year related experience and/or training; or equivalent combination of education and experience.<br/><br/><strong>Language Skills<br/><br/></strong>Ability to read and interpret documents such as procedure manuals. Ability to write routine reports and correspondence. Ability to effectively present information in one-on-one and small group situations to patients, employees and the general public.<br/><br/><strong>Mathematical Skills<br/><br/></strong>Ability to calculate figures and amounts such as discounts, interest, commissions, percentages. Ability to apply concepts such as fractions, percentages, ratios and proportions to practical situations.<br/><br/><strong>Other Skills &amp; Abilities<br/><br/></strong>Skill and ability to operate a computer. Skill and ability to organize and prioritize work. Skill and ability to meet deadlines and operate office equipment. Skill and ability to use company software.<br/><br/><strong>Reasoning Ability<br/><br/></strong>Ability to apply common sense understanding to carry out instructions furnished in written or oral form. Ability to deal with problems involving several concrete variables in standardized situations.<br/><br/><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is regularly required to sit, use hands to finger, handle, or feel and use a computer. The employee frequently is required to talk, hear and reach with hands and arms. The employee must occasionally lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision and the ability to adjust focus.<br/><br/><strong>Work Environment<br/><br/></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is regularly exposed to a computer monitor. The noise level in the work environment is usually quiet.<br/><br/><em>THE ABOVE DECLARATIONS ARE NOT INTENDED TO BE AN “ALL-INCLUSIVE” LIST OF THE DUTIES AND RESPONSIBILITIES OF THE JOB DESCRIBED OR OF THE SKILLS AND ABILITIES REQUIRED TO PERFORM THE JOB. RATHER, THEY ARE INTENDED ONLY TO DESCRIBE THE GENERAL REQUIREMENTS OF THE JOB.<br/><br/></em><em>______________________________ ________________<br/><br/></em><em>Signature (Employee) Date<br/><br/></em><em> ______________________________ ________________<br/><br/></em><em>Signature (Supervisor) Date</em>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3982658307"}