{"jobTitle": "Lease Administrator", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00/yr - 240,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>This is an opportunity to be a part of a globally growing company. This position will focus on overseeing the UCAN and LATAM lease portfolio of 6 million square feet and report to the Senior Manager, Lease Management and Reporting. This role will require three days in office (Tuesday - Thursday) and can be based out of our Los Angeles or Los Gatos, CA offices. Responsibilities include:<br/><br/><ul><li>Resolve day-to-day issues and questions from landlords, providers, and stakeholders</li><li>Perform accurate and detailed reconciliations of rent accounts to ensure compliance with lease terms</li><li>Manage and update internal trackers and run reports for the team</li><li>Supporting Real Estate manager in tracking transaction status and inquiries from x-functional partners</li><li>Onboard new vendors into the payment system</li><li>Document filing for all real estate legal and finance matters</li><li>Work closely with the legal and finance teams</li><li>Contribute to the team’s ongoing effort to develop efficient leasing and accounting procedures</li><li>Assist with lease negotiations </li><li>Ensure 100% data integrity such that lease documents are interpreted, abstracted into the system</li><li>Manage the system of record and work with the third-party system provider </li><li>Ongoing verification and abstraction of lease information and appropriate updating of the database</li><li>Responsible for the organization and maintenance of physical documents for all types of leases </li><li>Manage collection of tenant allowances due from landlords</li><li>Research and prepare comparative and financial analysis of real estate matters</li><li>Monitor, prepare, and distribute real estate Key Date reports</li><li>Provide lease financial obligation for company reporting purposes</li><li>Assist with other Real Estate projects as needed</li><li>Draft lease correspondence and notices, address and resolve landlord/tenant payment issues, and monitor leases/amendments for rent start-up, operating expense changes, changes in ownership, alteration consent, and lease terminations<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>Minimum of 5 years of experience with Corporate, Studios, and Retail leases</li><li>Experienced with global leases focused on UCAN and LATAM region</li><li>Excellent interpersonal and communication skills</li><li>Ability to work proactively, independently, and reliably under tight time frames in a fast-paced environment</li><li>High level of organization, detail orientation, and ability to time-manage across multiple deadlines</li><li>Willingness to tackle matters outside the area of expertise</li><li>Experienced with tools: Lease System (Sequentra), Workday, Smartsheet, and GSuite</li><li>BA or BS or equivalent/Paralegal Certificate</li><li>Licensed Notary</li><li>Experience with database/records management</li><li>Negotiating experience, attention to detail, and strong interpersonal skills required</li><li>Proven financial, analytical, and creative problem-solving skills<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $240,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "This is an opportunity to be a part of a globally growing company. This position will focus on overseeing the UCAN and LATAM lease portfolio of 6 million square feet and report to the Senior Manager, Lease Management and Reporting. This role will require three days in office (Tuesday - Thursday) and can be based out of our Los Angeles or Los Gatos, CA offices. Responsibilities include:<br/><br/><ul><li>Resolve day-to-day issues and questions from landlords, providers, and stakeholders</li><li>Perform accurate and detailed reconciliations of rent accounts to ensure compliance with lease terms</li><li>Manage and update internal trackers and run reports for the team</li><li>Supporting Real Estate manager in tracking transaction status and inquiries from x-functional partners</li><li>Onboard new vendors into the payment system</li><li>Document filing for all real estate legal and finance matters</li><li>Work closely with the legal and finance teams</li><li>Contribute to the team’s ongoing effort to develop efficient leasing and accounting procedures</li><li>Assist with lease negotiations </li><li>Ensure 100% data integrity such that lease documents are interpreted, abstracted into the system</li><li>Manage the system of record and work with the third-party system provider </li><li>Ongoing verification and abstraction of lease information and appropriate updating of the database</li><li>Responsible for the organization and maintenance of physical documents for all types of leases </li><li>Manage collection of tenant allowances due from landlords</li><li>Research and prepare comparative and financial analysis of real estate matters</li><li>Monitor, prepare, and distribute real estate Key Date reports</li><li>Provide lease financial obligation for company reporting purposes</li><li>Assist with other Real Estate projects as needed</li><li>Draft lease correspondence and notices, address and resolve landlord/tenant payment issues, and monitor leases/amendments for rent start-up, operating expense changes, changes in ownership, alteration consent, and lease terminations<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 5 years of experience with Corporate, Studios, and Retail leases, Experienced with global leases focused on UCAN and LATAM region, Excellent interpersonal and communication skills, Ability to work proactively, independently, and reliably under tight time frames in a fast-paced environment, High level of organization, detail orientation, and ability to time-manage across multiple deadlines, Willingness to tackle matters outside the area of expertise, Experienced with tools: Lease System (Sequentra), Workday, Smartsheet, and GSuite, BA or BS or equivalent/Paralegal Certificate, Licensed Notary, Experience with database/records management, Negotiating experience, attention to detail, and strong interpersonal skills required, Proven financial, analytical, and creative problem-solving skills<br/><br/>", "preferred": ""}, "skills": ["Lease System (Sequentra)", "Workday", "Smartsheet", "GSuite", "Negotiating", "Interpersonal Skills", "Financial Analysis", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982459915"}