{"jobTitle": "Director of Operations", "company": {"name": "EVONA", "location": "Hawthorne, CA", "industry": "Defense and Space Manufacturing"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management", "industry": "Defense and Space Manufacturing", "description": "Our space client is seeking a dedicated Director of Operations to oversee and manage all operational activities within their production facility. This leadership role is crucial for driving efficiency, fostering a culture of continuous improvement, and ensuring compliance with industry standards and regulations.", "responsibilities": "Collaborate with executive management to develop and execute strategic plans. Drive operational excellence through process alignment with business goals and continuous improvement initiatives. Oversee production and testing processes, resource allocation, and capacity planning. Ensure efficient use of personnel, equipment, and facilities. Implement and uphold quality control measures to meet industry standards such as AS9100. Lead and mentor cross-functional teams, fostering a strong community spirit. Manage team objectives, training, and development. Identify opportunities for process improvements and cost reductions. Develop and execute a vision and strategy aligned with company objectives. Act as a liaison between various functional groups, ensuring alignment with U.S. and international branches. Enhance operational roles in achieving business goals, including budget planning, CAPEX, purchasing, and inventory management. Support customer service by providing reliable delivery information and participating in customer visits. Identify and resolve process, material, equipment, and skill inefficiencies. Ensure compliance with all relevant laws, regulations, and guidelines. Develop and implement safety procedures and strategies. Allocate and manage resources, including task assignments to production and quality teams.", "qualifications": {"required": "Bachelor's degree in a related field with a minimum of 10+ years of experience, including 6+ years in managerial roles. Proven leadership ability in diverse environments. Strong interpersonal and communication skills. Experience in a complex manufacturing setting is preferred. Excellent organizational skills and attention to detail. Effective time management and deadline adherence. Strong analytical and critical thinking skills. Familiarity with 5S and Lean Manufacturing principles. Thorough understanding of raw materials, production processes, quality control, cost management, and manufacturing techniques.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982870228"}