{"jobTitle": "Junior Human Resources Business Partner – Law Firm – Los Angeles", "company": {"name": "Elliott Scott HR", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Human Resources Services", "description": "We're partnering with a global law firm to help them find a Human Capital Business Partner for their offices in LA. We are looking for a true operational partner for the HR leaders, someone who can translate strategies into actionable plans.\n\nGlobal, high performing organization\nHuge potential for growth and learning\nBased in Los Angeles (Hybrid)\n\nAs an integral part of the Human Capital & Talent team, you will be responsible for handling the entire employee lifecycle, serving as a key point of contact for employees across multiple locations on benefits, PTO policy, and timekeeping-related questions.\n\nYou’ll play an important role in supporting HR leaders across global and practice offices with performance optimization efforts, coordinating and managing complex employee relations matters.\n\nTo be successful in this role, you must demonstrate comprehensive knowledge of the HR function, be agile and proactive, and exhibit the ability to work in a team environment with a best-in-class customer service focus.\n\nAdditionally, you should have a fair understanding and knowledge of California employment laws in order to ensure that projects, programs, and processes are in compliance.\n\nIn Addition, You Must Have:\nA Bachelor’s Degree or equivalent; a minimum of four (4) years of relevant experience may be considered in place of a degree\nAt least three (3) years of experience as a Human Resources Generalist within legal or professional services firms\nProven experience advising, guiding, and supporting key stakeholders within a global matrixed organization.\nStrong communication skills, both written and verbal\n\nCompensation: $80,000- $100,000/year base + Bonus + benefits\n\nFor further details please contact Shagun Sharma on ss@elliottscotthr.com\n\nJob code SS/17741\n\nPersonal data collected will be used for recruitment purposes only.\n\nBy applying for this position, you consent to the collection, use and disclosure of your personal data to Elliott Scott HR Recruitment Ltd. and all relevant third parties for the purpose of processing your application for this job position. You understand and acknowledge that your personal data will be processed in accordance with our Privacy Policy \nhttps://www.elliottscotthr.com/privacy-policy\n\nPlease note that only short-listed candidates will be contacted.", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3982060491"}