{"jobTitle": "Senior Business Development Manager - Consumer Products (California)", "company": {"name": "Burns & McDonnell", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00-350,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Construction", "description": "At Burns & McDonnell's Consumer Products team, we put people first – ours and our Clients’. We help our consumer product clients improve lives and make the world a better place, by transforming their toughest manufacturing problems into opportunities for their trusted brands! From the soaps that clean your skin to the detergents that clean your clothes, these are the products that cater to our most basic human needs of health, hygiene, and self-care. With our team, you have the opportunity to deliver excellence on manufacturing design/build projects, for world-class companies that are household names in a consistently growing and evergreen market. Together, we will be the most sought-after design-builder in this industry.<br/><br/>Our broad sub-segments include: Personal Care, Beauty, Home Care, Nutraceuticals, Fine/Specialty Chemicals, Consumer Packaging, and Paper.<br/><br/><ul><li>Reflect and inspire passion for the market.</li><li>Manage all national business development activities for the business lane, in alignment with overall national consumer products business strategy.</li><li>Create, lead and support national growth opportunities in the Consumer Products market. Develop and increase customer awareness of Burns &amp; McDonnell's value and capabilities by continually contacting new clients and maintaining existing client relations.</li><li>Forecast and manage sales pipeline and client portfolio diversity.</li><li>Collect, Maintain and leverage market intelligence, competitor analysis and pursuit best practices.</li><li>Identify and Qualify potential clients and build strategic relationships across their organization at all levels, including the highest possible strategic/business authority/decision-making level.</li><li>Manage client-focused strategies and action plans that respond to client challenges and create a competitive advantage for the firm to obtain the work successfully.</li><li>Manage business development teams in key opening and middle game activities, including conducting market research, analyzing clients and competitors, and collaborating to develop value propositions and pre-Request For Proposal (RFP) collateral.</li><li>Support client-focused account and project leadership through project completion, in their quest for successful execution.</li><li>Review and approve trendsetting ideas by collecting internal best practices across silos, researching industry and related events, publications, and announcements; tracking individual contributors and accomplishments.</li><li>Screen/locate high-value business deals by contacting potential partners, analyzing market strategies, deal requirements, risks, potential, and financials; evaluating options; resolving internal priorities; recommending equity investments.</li><li>Close new business deals by coordinating requirements, having a clear understanding of partners' needs/positions, developing and negotiating contracts, and integrating contract requirements with business operations.</li><li>Position the execution teams for success in all business deals.</li><li>Protect the organization's value by keeping information confidential.</li><li>Inspire and manage new, non-traditional and compelling solutions to a customer's stated project scope of work to differentiate Burns &amp; McDonnell.</li><li>Identify synergies internal to the Burns &amp; McDonnell organization in other GFS Business Lanes, BMcD Global Practices and Regional Offices. Develop relationships to leverage one another's skills, abilities, and client contacts to further the sales/marketing effort in GFS.</li><li>Support ongoing sales/marketing initiatives with other BMcD organizations.</li><li>Responsible for communicating regularly with National Consumer Products Business Lead, Regional Office leadership, other Business Development Leads and Project Managers.</li><li>Contribute to the annual marketing and sales planning process.</li><li>Commit to personal sales and marketing goals, and develop a plan to achieve goals.</li><li>Prepare and present workload and monthly financial reports to national consumer products leadership, a global practice and/or regional management and applicable project managers.</li><li>Attract, recruit, develop, train, and retain high-caliber talent.</li><li>Responsible for collaborating with business development managers, business line lead, project managers, and proposal production staff on proposals to secure work for the staff.</li><li>Responsible for overall QA/QC process adherence.</li><li>Ensure compliance with company and site safety policies.</li><li>Responsible for diversity initiatives where applicable.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor Degree in engineering, architecture, construction or related degree from an accredited program and 13 years related professional experience in marketing, business development or sales promotion environment required, experience in the A/E/C industry preferred.</li><li>Must demonstrate excellent oral and written communication skills, strong interpersonal skills, and the ability to clearly and effectively present complex information to all levels of employees, management, and clients.</li><li>Must have advanced knowledge in the use of basic computer software (i.e., Microsoft Word, Excel, PowerPoint)</li><li>Previous experience developing and delivering training presentations related to proposal communications, proposal strategies, business development and/or pursuit strategies.<br/><br/></li></ul><strong>Compensation<br/><br/></strong>$170,000.00-350,000.00 Annually<br/><br/>The expected compensation range for this position is displayed in compliance with all local/state regulations. The expected compensation range for this position is based on a number of factors, including but not limited to: individual education, qualifications, prior work experience and work location. The total annual compensation package will consist of a base salary and eligibility to participate in our discretionary year-end incentive bonus program.<br/><br/><strong>Benefits<br/><br/></strong>Our extensive benefits package takes care of you so that you can focus on doing great work. From insurance and disability to time off and wellness programs, we provide the tools to meet your needs. As part of being 100% employee-owned, eligible employees participate in our Employee Stock Ownership Plan (ESOP) in addition to our 401(k) retirement program. For more information, please visit the Benefits &amp; Wellness page.<br/><br/>This job posting will remain open a minimum of 72 hours and on an ongoing basis until filled<br/><br/>EEO/Minorities/Females/Disabled/Veterans<br/><br/><strong>Job</strong> Business Development/Sales<br/><br/><strong>Primary Location</strong> US-CA-Brea<br/><br/><strong>Other Locations</strong> US-CA-Walnut Creek, US-CA-Los Angeles<br/><br/><strong>Schedule:</strong> Full-time<br/><br/><strong>Travel:</strong> Yes, 50 % of the Time<br/><br/><strong>Req ID:</strong> 241908<br/><br/><strong>Job Hire Type</strong> Experienced #GFS N/A<br/><br/>", "responsibilities": "Reflect and inspire passion for the market. Manage all national business development activities for the business lane, in alignment with overall national consumer products business strategy. Create, lead and support national growth opportunities in the Consumer Products market. Develop and increase customer awareness of Burns &amp; McDonnell's value and capabilities by continually contacting new clients and maintaining existing client relations. Forecast and manage sales pipeline and client portfolio diversity. Collect, Maintain and leverage market intelligence, competitor analysis and pursuit best practices. Identify and Qualify potential clients and build strategic relationships across their organization at all levels, including the highest possible strategic/business authority/decision-making level. Manage client-focused strategies and action plans that respond to client challenges and create a competitive advantage for the firm to obtain the work successfully. Manage business development teams in key opening and middle game activities, including conducting market research, analyzing clients and competitors, and collaborating to develop value propositions and pre-Request For Proposal (RFP) collateral. Support client-focused account and project leadership through project completion, in their quest for successful execution. Review and approve trendsetting ideas by collecting internal best practices across silos, researching industry and related events, publications, and announcements; tracking individual contributors and accomplishments. Screen/locate high-value business deals by contacting potential partners, analyzing market strategies, deal requirements, risks, potential, and financials; evaluating options; resolving internal priorities; recommending equity investments. Close new business deals by coordinating requirements, having a clear understanding of partners' needs/positions, developing and negotiating contracts, and integrating contract requirements with business operations. Position the execution teams for success in all business deals. Protect the organization's value by keeping information confidential. Inspire and manage new, non-traditional and compelling solutions to a customer's stated project scope of work to differentiate Burns &amp; McDonnell. Identify synergies internal to the Burns &amp; McDonnell organization in other GFS Business Lanes, BMcD Global Practices and Regional Offices. Develop relationships to leverage one another's skills, abilities, and client contacts to further the sales/marketing effort in GFS. Support ongoing sales/marketing initiatives with other BMcD organizations. Responsible for communicating regularly with National Consumer Products Business Lead, Regional Office leadership, other Business Development Leads and Project Managers. Contribute to the annual marketing and sales planning process. Commit to personal sales and marketing goals, and develop a plan to achieve goals. Prepare and present workload and monthly financial reports to national consumer products leadership, a global practice and/or regional management and applicable project managers. Attract, recruit, develop, train, and retain high-caliber talent. Responsible for collaborating with business development managers, business line lead, project managers, and proposal production staff on proposals to secure work for the staff. Responsible for overall QA/QC process adherence. Ensure compliance with company and site safety policies. Responsible for diversity initiatives where applicable.", "qualifications": {"required": "Bachelor Degree in engineering, architecture, construction or related degree from an accredited program and 13 years related professional experience in marketing, business development or sales promotion environment required, experience in the A/E/C industry preferred. Must demonstrate excellent oral and written communication skills, strong interpersonal skills, and the ability to clearly and effectively present complex information to all levels of employees, management, and clients. Must have advanced knowledge in the use of basic computer software (i.e., Microsoft Word, Excel, PowerPoint) Previous experience developing and delivering training presentations related to proposal communications, proposal strategies, business development and/or pursuit strategies.", "preferred": ""}, "skills": [], "postedDate": "6 days ago", "benefits": "Our extensive benefits package takes care of you so that you can focus on doing great work. From insurance and disability to time off and wellness programs, we provide the tools to meet your needs. As part of being 100% employee-owned, eligible employees participate in our Employee Stock Ownership Plan (ESOP) in addition to our 401(k) retirement program. For more information, please visit the Benefits &amp; Wellness page.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982700793"}