{"jobTitle": "Data Analyst", "company": {"name": "Careismatic Brands, Inc.", "location": "Los Angeles Metropolitan Area", "industry": "Retail Apparel and Fashion and Apparel Manufacturing"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "70,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Strategy/Planning", "industry": "Retail Apparel and Fashion and Apparel Manufacturing", "description": "<strong>Data Analyst (Master Data Management)</strong><p>Sherman Oaks, CA</p><p><br/></p><p><br/></p><p>We are Careismatic Brands Inc., the global leader in medical apparel, footwear, and accessories. We have an outstanding opportunity for a Data Analyst to turn data into information, information into insight and insight into business decisions.</p><p><br/></p><p><br/></p><p>The Master Data Management team at Careismatic Brands is responsible for monitoring the process of creating and maintaining a single master record for each person, place, and thing in a business. MDM helps ensure the reliability of data coming from different data sources in different formats.</p><p><br/></p><p>This is a full-time role based in our corporate office in Sherman Oaks, CA.</p><p><br/></p><p><strong>Salary Range</strong>: $70,000-$75,000</p><p><br/></p><p><strong>Physical Demands &amp; Work Environment</strong></p><p>The physical demands described here are representative of those that must be met by a Team Member to successfully perform the essential functions for this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the functions.</p><p>Hybrid role in our corporate office in Sherman Oaks.</p><p><br/></p><p><strong>What Your Day Looks Like</strong></p><ul><li>Perform regular audits of product attributes to ensure records are complete and precisely managed.</li><li>Designs and develops a framework for global Master Data standardization and governance, including owning process flows and standard definitions for governance across a variety of cross-functional systems and processes.</li><li>Assist with loading and maintenance of pricing across multiple brands.</li><li>Work collaboratively with Sales, Merchandising, Marketing, and Sales Operations to govern and maintain immaculate systematic information.</li><li>Collaborate with cross-functional teams to identify opportunities for process improvement, recommend system modifications, and develop policies for data governance.</li><li>Help troubleshoot master data-related issues regarding B2B and DTC websites.</li><li>Extract and share data from the proper system(s) as requested.</li><li>Monitoring brand sites to ensure information accuracy and proper visibility for the products.</li><li>Other responsibilities may be assigned as needed.</li></ul><p><br/></p><p><strong>What We’re Looking For</strong></p><ul><li>BA/BS degree in Business, Business Administration, Statistics or related fields.</li><li>Proven ability to analyze data and deliver actionable insights.</li><li>Ability to create strong partnerships with key internal partners including Sales, Merchandising, Supply Chain, Production, Operations, Marketing, IT, and Customer Service.</li><li>Analytical thinking and problem-solving skills, with acute attention to detail, accuracy and accountability balanced with sound business judgment and decision-making skills.</li><li>Positive and go-getter team player, who can also work independently, with the ability to troubleshoot and work in a fast-moving and multi-tasking environment with numerous deadlines and across multiple cross-functional partners and seasons.</li><li>Data driven mindset to identify improvement opportunities and implement sustainable solutions.</li><li>Highly detail oriented with effective communication skills, both written and verbal.</li><li>Experience with ERP and PLM systems.</li><li>Highly Proficient with Microsoft Excel.</li><li>Demonstrated proficiency in Microsoft Office applications.</li><li>Experience presenting in group settings.</li></ul><p><br/></p><p><strong>What’s In It For You</strong></p><ul><li>401(k)</li><li>Dental insurance</li><li>Employee discount</li><li>Flexible spending account</li><li>Health insurance</li><li>Life insurance</li><li>Attractive Paid time off</li><li>Vision insurance</li></ul><p><br/></p><p><br/></p><p>At Careismatic Brands, we believe in the power of care. It’s the force that drives and inspires us, inside our company and out in the world. It’s why we strive to maintain a diverse and inclusive organization – an ever-evolving imperative - where everyone feels respected, valued, and empowered to bring their ideas and perspectives forward.</p><p><br/></p><p>Careismatic embraces the differences that make our organization unique. We are strengthened by diversity in all its forms – including but not limited to race, religion, ethnicity, age, national origin, gender identity, and sexual orientation.</p><p></p>", "responsibilities": "Perform regular audits of product attributes to ensure records are complete and precisely managed. Designs and develops a framework for global Master Data standardization and governance, including owning process flows and standard definitions for governance across a variety of cross-functional systems and processes. Assist with loading and maintenance of pricing across multiple brands. Work collaboratively with Sales, Merchandising, Marketing, and Sales Operations to govern and maintain immaculate systematic information. Collaborate with cross-functional teams to identify opportunities for process improvement, recommend system modifications, and develop policies for data governance. Help troubleshoot master data-related issues regarding B2B and DTC websites. Extract and share data from the proper system(s) as requested. Monitoring brand sites to ensure information accuracy and proper visibility for the products. Other responsibilities may be assigned as needed.", "qualifications": {"required": "BA/BS degree in Business, Business Administration, Statistics or related fields. Proven ability to analyze data and deliver actionable insights. Ability to create strong partnerships with key internal partners including Sales, Merchandising, Supply Chain, Production, Operations, Marketing, IT, and Customer Service. Analytical thinking and problem-solving skills, with acute attention to detail, accuracy and accountability balanced with sound business judgment and decision-making skills. Positive and go-getter team player, who can also work independently, with the ability to troubleshoot and work in a fast-moving and multi-tasking environment with numerous deadlines and across multiple cross-functional partners and seasons. Data driven mindset to identify improvement opportunities and implement sustainable solutions. Highly detail oriented with effective communication skills, both written and verbal. Experience with ERP and PLM systems. Highly Proficient with Microsoft Excel. Demonstrated proficiency in Microsoft Office applications. Experience presenting in group settings.", "preferred": ""}, "skills": ["Data Analysis", "Master Data Management", "ERP", "PLM", "Microsoft Excel", "Microsoft Office"], "postedDate": "4 weeks ago", "benefits": "401(k), Dental insurance, Employee discount, Flexible spending account, Health insurance, Life insurance, Attractive Paid time off, Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982284434"}