{"jobTitle": "Software Engineer (L4) - CKG", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00/yr - 720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is the world's leading internet streaming service with over 250 million members in 190 countries. Our members enjoy a wide variety of streamed videos per day, using over 1000 types of devices, generating more than a third of downstream Internet traffic in North America. The Content Knowledge Graph team within Data Science &amp; Engineering equips scientists, engineers, and business executives with a global understanding of the entertainment industry “on &amp; off-service”. Our flagship product, Netflix KG (“Hitch”), a data and analytics foundational layer, is a data pillar for 100s of diverse use cases across Netflix: from enabling content and marketing business executives to make better data-driven decisions to equipping AI/ML scientists with signals that power billions of daily predictions, to providing key inputs to engineering teams building business-critical applications. Hitch is a foundation for innovation that is helping to fuel Netflix’s long-term growth. We are looking for a Full Stack Software Engineer to own and scale our online data systems while supporting high-visibility data pipelines and products. As part of this team, you will work on a diverse tech stack to build insightful tools, apps, services, and libraries that describe the entities, interactions, and usage patterns across the Netflix Knowledge Graph. You will collaborate closely with other Data Engineers, Machine Learning Engineers, Scientists, and business analysts to build scalable access patterns for them. Who you are:<br/><br/><ul><li>You would consider yourself a full-stack developer. You have experience in both backend and frontend development for a good part of your career and expertise in owning and maintaining backend services.</li><li>You are proficient in designing, building, and operating API layers that support various front-end user experiences. Experience with GraphQL and Node.js is a big plus.</li><li>API and SDK development: You have built, maintained, evolved, and/or sunset a variety of APIs and libraries/SDKs.</li><li>You are proficient in working with Javascript, React, or other similar technologies. Proficiency in Python or Java is a big plus.</li><li>Comfortable with SQL and using big data technologies (e.g. Hive, Presto, Spark, Iceberg, etc) on medium to large-scale data.</li><li>You are willing to learn and own all areas of the software lifecycle: design, development, test, deployment, operation, and support.</li><li>Conceptually familiar or interested in learning graph technologies (e.g. databases, data models, query languages)</li><li>You have strong communication skills and can collaborate with cross-functional team members and partners on projects that drive high-impact outcomes</li><li>Excited about learning new business domains, demonstrating excellence, and growing your career <br/><br/></li></ul><strong>What You Will Do<br/><br/></strong><ul><li>Work cross-functionally to build new services, tools, and data models to develop easy-to-use data access patterns for knowledge graphs.</li><li>Building intuitive user interfaces backed by data in offline systems and APIs</li><li>Evaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.</li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolve.</li><li>Understand business requirements and provide tools that empower teams to innovate on top of the Netflix KG</li><li>Join a stunning team with diverse skill sets (data engineering, machine learning, analytical engineering and software engineering), partnering closely with data science, analytics, and business counterparts<br/><br/></li></ul>Netflix offers amazing co-workers, new technology, fascinating analytical and technical challenges, and a Freedom &amp; Responsibility Culture that's truly outstanding. It’s worth learning more: http://jobs.netflix.com/culture Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000 Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Work cross-functionally to build new services, tools, and data models to develop easy-to-use data access patterns for knowledge graphs.\nBuilding intuitive user interfaces backed by data in offline systems and APIs\nEvaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.\nRegularly learn new systems and tools as the Netflix platform and ecosystem evolve.\nUnderstand business requirements and provide tools that empower teams to innovate on top of the Netflix KG\nJoin a stunning team with diverse skill sets (data engineering, machine learning, analytical engineering and software engineering), partnering closely with data science, analytics, and business counterparts", "qualifications": {"required": "You would consider yourself a full-stack developer. You have experience in both backend and frontend development for a good part of your career and expertise in owning and maintaining backend services.\nYou are proficient in designing, building, and operating API layers that support various front-end user experiences. Experience with GraphQL and Node.js is a big plus.\nAPI and SDK development: You have built, maintained, evolved, and/or sunset a variety of APIs and libraries/SDKs.\nYou are proficient in working with Javascript, React, or other similar technologies. Proficiency in Python or Java is a big plus.\nComfortable with SQL and using big data technologies (e.g. Hive, Presto, Spark, Iceberg, etc) on medium to large-scale data.\nYou are willing to learn and own all areas of the software lifecycle: design, development, test, deployment, operation, and support.\nConceptually familiar or interested in learning graph technologies (e.g. databases, data models, query languages)\nYou have strong communication skills and can collaborate with cross-functional team members and partners on projects that drive high-impact outcomes\nExcited about learning new business domains, demonstrating excellence, and growing your career"}, "skills": ["GraphQL", "Node.js", "Javascript", "React", "Python", "Java", "SQL", "Hive", "Presto", "Spark", "Iceberg"], "postedDate": "1 week ago", "benefits": "Netflix offers amazing co-workers, new technology, fascinating analytical and technical challenges, and a Freedom &amp; Responsibility Culture that's truly outstanding. It’s worth learning more: http://jobs.netflix.com/culture Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000 Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982463645"}