{"jobTitle": "Citrix Engineer", "company": {"name": "Arctiq", "industry": "IT Services and IT Consulting and Software Development", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$100,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Information Technology and Engineering", "industry": "IT Services and IT Consulting and Software Development", "description": "This role is fully remote, but person needs to be located within Southern California. The Citrix Engineer will be responsible for the operational support and internal project initiatives involving a 24/7 Citrix Environment. The candidate will be responsible for providing maintenance, support, and enhancements to the Citrix environment – including management of infrastructure servers, appliances and updating all published business critical applications and virtual desktops as directed. Advanced knowledge of CVAD, AppLayering [ELM] Provisioning Services, WEM, StoreFront, NetScaler, FAS, CA, Director, VMWare, Windows/Citrix Profile Management, Windows Server OS, PowerShell, Active Directory, and Group Policies are key to this role. Said candidate must possess excellent communication, documentation, self-learning skills and the ability to manage assignments independently.", "responsibilities": "Operational support and internal project initiatives involving a 24/7 Citrix Environment. Maintenance, support, and enhancements to the Citrix environment – including management of infrastructure servers, appliances and updating all published business critical applications and virtual desktops as directed.", "qualifications": {"required": "Bachelor’s degree in a relevant field preferred, will consider relevant work experience in lieu of education. 5+ years of previous experience in a similar role preferred. Previous experience and/or ability to work in a highly secured environment. CCA-V & CCP-V certifications are required for this position. NetScaler [AppDS] certifications and CCE-V are a plus.", "preferred": "Experience with the following Citrix Technologies: CVAD 7.x, AppLayering [ELM], WEM, UPM, PVS, MCS, Licensing, FAS, StoreFront, FAS, NetScaler [ADC], including Gateway, Load Balancing, GSLB, Authentication Profiles, MFA configuration. ADM, Director and Reporting. Experience with VMWare vCenter Server and ESXi virtualization technology. Experience with MS Certificate Authority [CA], Active Directory, GPOs, DNS, and DHCP. In-depth functional knowledge of varying versions of Windows Server and Workstation OS. Experience with PowerShell. Strong organizational, time management, and communication skills. Application support experience. Strong technical background and ability to work with peer engineers, and other key stakeholders. Ability to be flexible, versatile and adaptable in day-to-day activities. Ability to express ideas concisely and clearly, orally and in writing. Ability to create, read, analyze and interpret applicable technical documentation & system reports. Ability to prioritize and escalate problems. Perform on-call duties and be flexible for occasion requirement to work after hours or weekends to perform tasks that cannot be done during business hours is required. In a rare case a visit to datacenter will be required."}, "skills": ["CVAD", "AppLayering", "WEM", "StoreFront", "NetScaler", "FAS", "PowerShell", "Active Directory", "Group Policies", "VMWare", "Windows Server OS"], "postedDate": "1 month ago", "applicationDeadline": "No longer accepting applications", "benefits": "Arctiq is an equal-opportunity employer. If you need any accommodations or adjustments throughout the interview process and beyond, please let us know. We celebrate our inclusive work environment and welcome members of all backgrounds and perspectives to apply.", "remoteWork": "Fully remote, but must be located within Southern California.", "url": "https://www.linkedin.com/jobs/view/3982262073"}