{"jobTitle": "Artist Royalties Analyst", "company": {"name": "The Walt Disney Company", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Entertainment Providers", "description": "<em>Disney Music Group (DMG) is the music hub for TWDC, encompassing all aspects of music commercialization and marketing: recorded music (Walt Disney Records and Hollywood Records), Disney Music Publishing, and Disney Concerts. DMG distributes music both physically and digitally, and also licenses music throughout the world in various forms of media including television, print, gaming, and consumer products.<br/><br/></em><strong>Job Summary:<br/><br/></strong>Disney Music Group is currently seeking an Artist Royalties Analyst for DMG’s Recorded Music Royalties team. This role will focus primarily on DMG’s catalog releases, and will be involved in all aspects of artist royalties, including interpreting agreements for recorded music participants (e.g., artists and producers), reviewing and updating existing set-ups, preparing accurate and timely royalty statements, requesting payments, clearing accruals, calculating union obligations, responding to internal and external inquiries.<br/><br/><strong>Responsibilities and Duties of the Role:<br/><br/><br/></strong><ul><li>Review recording participant information and contract database to determine if royalty obligations exist. Update systems as needed.</li><li>Review recording and producer agreements, deal memos, etc. in order to identify and enter royalty rates and terms into DMG’s royalty system, meeting monthly deadlines</li><li>Prepare and review quarterly and semi-annual statements, meeting contractual deadlines</li><li>Respond to inquiries from internal and external stakeholders</li><li>Special projects<br/><br/><br/></li></ul><strong>Required Education, Experience/Skills/Training:<br/><br/><br/></strong><ul><li>0 – 2+ years’ Artist royalties experience</li><li>Proficiency in Microsoft Office Suite (Outlook, Powerpoint, Word) required</li><li>Knowledge of Excel required (Pivot Tables, V-lookups, etc.)</li><li>Strong math skills</li><li>Detail-oriented, with high level of accuracy</li><li>Demonstrate ability to prioritize effectively and appropriately</li><li>Manage multiple projects at any given time while meeting deadlines consistently</li><li>Strong organizational and follow-through skills</li><li>Effective communicator, both verbally and written</li><li>Positive attitude and the ability to be proactive, resourceful and flexible</li><li>Strong people skills, including the ability to work effectively individually and as part of a team<br/><br/><br/></li></ul>The hiring range for this position in CA is $63,386.00-$85,000.00 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "responsibilities": "Disney Music Group is currently seeking an Artist Royalties Analyst for DMG’s Recorded Music Royalties team. This role will focus primarily on DMG’s catalog releases, and will be involved in all aspects of artist royalties, including interpreting agreements for recorded music participants (e.g., artists and producers), reviewing and updating existing set-ups, preparing accurate and timely royalty statements, requesting payments, clearing accruals, calculating union obligations, responding to internal and external inquiries.", "qualifications": {"required": "0 – 2+ years’ Artist royalties experience, Proficiency in Microsoft Office Suite (Outlook, Powerpoint, Word) required, Knowledge of Excel required (Pivot Tables, V-lookups, etc.), Strong math skills, Detail-oriented, with high level of accuracy, Demonstrate ability to prioritize effectively and appropriately, Manage multiple projects at any given time while meeting deadlines consistently, Strong organizational and follow-through skills, Effective communicator, both verbally and written, Positive attitude and the ability to be proactive, resourceful and flexible, Strong people skills, including the ability to work effectively individually and as part of a team"}, "skills": ["Microsoft Office", "Excel", "Pivot Tables", "V-lookups", "Communication", "Problem Solving"], "postedDate": "6 days ago", "salary": {"amount": "63,386.00-85,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982751837"}