{"jobTitle": "Sr. Manager, HR Business Partner (Corporate Functions)", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA", "industry": "Entertainment Providers"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "130,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Entertainment Providers", "description": "We’re Sony Pictures Entertainment<br/><br/>We are a proudly independent studio in the business of creativity, making some of the most beloved film and television works for every platform in the world. Along with our sister companies, we make movies, television, music and games that engage billions of people, connecting creators and audiences around the globe.<br/><br/>The Impact You’ll Make<br/><br/>We are looking for a strategic and thoughtful Sr. Manager, People &amp; Organization (HR) Business Partner to collaborate with our Corporate teams, primarily within our Operations and Technology groups. Our Operations teams, in particular, include a mix of both union and non-union employees.<br/><br/>You should have a passion for influencing people strategy and building collaborative relationships across multiple levels of leaders and employees. You are curious, proactive and demonstrate a combination of strong business acumen and HR experience to develop and execute on initiatives that attract, cultivate and retain the breadth of talent required to drive business success. You excel at balancing multiple priorities and thrive in a growth environment where the work that you do directly impacts employee experience.<br/><br/>Responsibilities<br/><br/>Reporting to the Executive Director, P&amp;O Business Partner, you will partner closely with Corporate leaders to provide thought leadership and hands on partnership.<br/><br/><ul><li>Develop deep relationships with leaders and employees to become their trusted advisor on organizational and people-related strategy and execution</li><li>Coach all levels of managers on people strategy, including organizational design, career development, coaching, recognition, performance management, etc.</li><li>Achieve a deep understanding of the business strategy, goals and objectives and support organizational change by developing and implementing appropriate change management plans</li><li>Act as a strategic and tactical partner to business leaders as it relates to key initiatives (e.g., workforce planning)</li><li>Partner with Corporate Business Partners, leaders and our Learning &amp; Development team to design development programs in support of organizational objectives, including current and future skill needs, leadership capabilities, coaching, high potential development and offsites</li><li>Contribute to the development, iteration and roll-out of key HR programs (e.g., talent and compensation planning) and processes and use data to help the business make informed decision about its strategies </li><li>Keep business leaders and employees informed; develop messaging, determine mechanisms for communication; promote organizational culture in employee communications</li><li>Develop close partnerships with key stakeholders to deliver integrated solutions, such as with Talent Acquisition to identify key talent segments and pivotal roles</li><li>Find innovative ways for leaders and employees to improve work relationships, build morale, increase productivity and efficiency<br/><br/></li></ul>Required Qualifications<br/><br/><ul><li>Minimum of 5 years of HRBP experience, ideally for a multi-functional, multi-line-of-business organization</li><li>Strong knowledge and experience partnering with key HR centers of excellence, including Talent Acquisition, Benefits, Compensation, Learning &amp; Development, Employee Relations, and Diversity &amp; Inclusion</li><li>Exceptional client relationship management skills and demonstrated experience in developing consultative relationships, including the ability to influence decision makers</li><li>Knowledge of employment and labor law</li><li>Excellent written and verbal communication skills</li><li>Strong program development and project management skills; demonstrated ability to prioritize and meet deadlines</li><li>Detail oriented and excellent follow-through skills</li><li>Strong ethics and integrity, including the ability to maintain the highest degree of confidentiality and handle sensitive information and materials<br/><br/></li></ul>Key competencies needed to be successful in this role<br/><br/><ul><li>Growth mindset</li><li>Instills trust</li><li>Action oriented</li><li>Sound decision quality</li><li>Accountability</li><li>Strong collaboration and conflict management</li><li>Customer focus<br/><br/></li></ul>The anticipated base salary for this position is $130,000 to $150,000. This role may also qualify for annual incentive and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.<br/><br/>To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "responsibilities": "Reporting to the Executive Director, P&amp;O Business Partner, you will partner closely with Corporate leaders to provide thought leadership and hands on partnership.<br/><br/><ul><li>Develop deep relationships with leaders and employees to become their trusted advisor on organizational and people-related strategy and execution</li><li>Coach all levels of managers on people strategy, including organizational design, career development, coaching, recognition, performance management, etc.</li><li>Achieve a deep understanding of the business strategy, goals and objectives and support organizational change by developing and implementing appropriate change management plans</li><li>Act as a strategic and tactical partner to business leaders as it relates to key initiatives (e.g., workforce planning)</li><li>Partner with Corporate Business Partners, leaders and our Learning &amp; Development team to design development programs in support of organizational objectives, including current and future skill needs, leadership capabilities, coaching, high potential development and offsites</li><li>Contribute to the development, iteration and roll-out of key HR programs (e.g., talent and compensation planning) and processes and use data to help the business make informed decision about its strategies </li><li>Keep business leaders and employees informed; develop messaging, determine mechanisms for communication; promote organizational culture in employee communications</li><li>Develop close partnerships with key stakeholders to deliver integrated solutions, such as with Talent Acquisition to identify key talent segments and pivotal roles</li><li>Find innovative ways for leaders and employees to improve work relationships, build morale, increase productivity and efficiency<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 5 years of HRBP experience, ideally for a multi-functional, multi-line-of-business organization, Strong knowledge and experience partnering with key HR centers of excellence, including Talent Acquisition, Benefits, Compensation, Learning &amp; Development, Employee Relations, and Diversity &amp; Inclusion, Exceptional client relationship management skills and demonstrated experience in developing consultative relationships, including the ability to influence decision makers, Knowledge of employment and labor law, Excellent written and verbal communication skills, Strong program development and project management skills; demonstrated ability to prioritize and meet deadlines, Detail oriented and excellent follow-through skills, Strong ethics and integrity, including the ability to maintain the highest degree of confidentiality and handle sensitive information and materials<br/><br/>", "preferred": "Growth mindset, Instills trust, Action oriented, Sound decision quality, Accountability, Strong collaboration and conflict management, Customer focus<br/><br/>"}, "skills": ["HRBP", "Talent Acquisition", "Benefits", "Compensation", "Learning & Development", "Employee Relations", "Diversity & Inclusion", "Client Relationship Management", "Consultative Relationships", "Influence", "Employment Law", "Labor Law", "Communication", "Program Development", "Project Management", "Prioritization", "Deadlines", "Detail Oriented", "Follow-Through", "Ethics", "Integrity", "Confidentiality", "Growth Mindset", "Trust", "Action Oriented", "Decision Quality", "Accountability", "Collaboration", "Conflict Management", "Customer Focus"], "postedDate": "1 week ago", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982976875"}