{"jobTitle": "Retail Sales Associate (Temp) Golden West College Bookstore", "company": {"name": "Barnes & Noble College", "location": "Huntington Beach, CA"}, "location": "Huntington Beach, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "<strong>Introduction <br/><br/></strong>Our campus stores serve as a vibrant hub of college life and learning. We believe in creating retail and learning experiences that engage students, support faculty, and build alumni loyalty. Together, our teams and stores work to elevate lives through education.<br/><br/><strong>Overview<br/><br/></strong>You can enhance your success by joining our dynamic team today! As a <strong>Campus Retail Associate </strong>you will provide superior customer service to our customers and support store leaders in all facets of retail operations to ensure the store is operating at optimal performance.<br/><br/><strong> Perks <br/><br/></strong><ul><li> Flexible Scheduling </li><li> Sick time accrual from date of hire </li><li> Generous employee discount – including course materials &amp; textbooks </li><li> Management Development Program Opportunities </li><li> The opportunity to add valuable, transferrable experience and skills to your resume <br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><strong>Expectations:<br/><br/></strong><ul><li> Assist with processing sales transactions involving cash, credit, or financial aid payments. </li><li> Provide a friendly atmosphere by greeting customers and focusing on their positive experience throughout their visit. </li><li> Take initiative to support store operations including operating equipment and cash register while ensuring speed of service and accurate transactions. </li><li> Keep the store looking fresh by shelving, arranging, cleaning, and organizing products or space within the store. </li><li>Temporary positions require availability to work on a weekly basis for a period of 90 days or less with occasional weekends, and flexibility in scheduling for opening, midday, or closing shifts.<br/><br/></li></ul><strong>Physical Demands:<br/><br/></strong><ul><li>Frequent movement within the store to access various departments, areas, and/or products.</li><li>Ability to remain in a stationary position for extended periods.</li><li>Frequent lifting.</li><li>Occasional reaching, stooping, kneeling, crouching, and climbing ladders.<br/><br/></li></ul><strong>California Pay Transparency Information (Only applicable in California stores):<br/><br/></strong>Pay: Temporary Bookseller pay rate: $16.00/hr.<br/><br/><strong>Benefits available include:<br/><br/></strong><ul><li>Employee Discount</li><li>Paid sick time (accrued based on time worked)</li><li>Eligibility to participate in a 401k (after the completion of 1000 hours worked in a 12 month period)</li><li>Commuter Benefits<br/><br/></li></ul>Eligibility for each plan may Include a waiting period and may require the employee to enroll during a stated eligibility period.<br/><br/><strong>COVID-19 Considerations:<br/><br/></strong>Our stores comply with all applicable federal, state and local requirements and/or recommendations regarding social distancing and sanitizing. In accordance with individual campus requirements, positions may require confirmation of vaccination. The use of face masks throughout the day and while on campus may also be expected or required.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Candidates must be a minimum of 18 years of age to be considered for temporary employment. </li><li> Confident and comfortable engaging customers to deliver an elevated experience. </li><li> An outstanding attitude with the willingness to learn and the capability to excel in a fast-paced, team environment. </li><li> Basic math, keyboarding, and data entry skills. </li><li> Flexible availability throughout the academic year including peak periods. <br/><br/></li></ul><strong> EEO Statement <br/><br/></strong><strong>Barnes &amp; Noble College is an Equal Employment Opportunity and Affirmative Action Employer committed to diversity in the workplace. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</strong>", "responsibilities": "Assist with processing sales transactions involving cash, credit, or financial aid payments. Provide a friendly atmosphere by greeting customers and focusing on their positive experience throughout their visit. Take initiative to support store operations including operating equipment and cash register while ensuring speed of service and accurate transactions. Keep the store looking fresh by shelving, arranging, cleaning, and organizing products or space within the store. Temporary positions require availability to work on a weekly basis for a period of 90 days or less with occasional weekends, and flexibility in scheduling for opening, midday, or closing shifts.", "qualifications": {"required": "Candidates must be a minimum of 18 years of age to be considered for temporary employment. Confident and comfortable engaging customers to deliver an elevated experience. An outstanding attitude with the willingness to learn and the capability to excel in a fast-paced, team environment. Basic math, keyboarding, and data entry skills. Flexible availability throughout the academic year including peak periods."}, "skills": [], "postedDate": "1 day ago", "benefits": "Flexible Scheduling Sick time accrual from date of hire Generous employee discount – including course materials &amp; textbooks Management Development Program Opportunities The opportunity to add valuable, transferrable experience and skills to your resume Employee Discount Paid sick time (accrued based on time worked) Eligibility to participate in a 401k (after the completion of 1000 hours worked in a 12 month period) Commuter Benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982570165"}