{"jobTitle": "Sr. Production Planner", "company": {"name": "ESI Motion", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Production and Quality Assurance", "industry": "Defense and Space Manufacturing", "description": "The Senior Production Planner plays a pivotal role in orchestrating the production activities within a dynamic, fast-paced environment. This individual oversees the seamless transition from engineering to production, meticulously crafting work schedules and ensuring the availability of resources to meet stringent deadlines. Collaborating closely with program management, engineering, procurement, quality assurance, and shipping teams, the Senior Production Planner drives forward the production process while maintaining the highest standards of efficiency and quality.\n<br/>\nThe ideal candidate will have a high school diploma with 8+ years’ experience in a high-tech manufacturing environment or an Associate’s degree in Electrical Engineering or other related Engineering discipline (GPA > 3.2), and 3+ years recent experience in hands-on development.\n<br/>\n**The Production Planner will:**\n<ul><li>Drives best practices for material scheduling and planning through strong knowledge and utilization of MRP system functions</li><li>Supports manufacturing and other departments to maintain efficient operations, high delivery standards and to promote customer goodwill</li><li>Partner with other leaders of the organization on strategic projects to support new and ongoing business operations</li><li>Drive, track, and manage all material movement and help eliminate obstacles that prevent the steady flow of hardware to the floor</li><li>Develop and implement improved information and reporting systems for materials management</li><li>Communicate regularly with manufacturing leadership, program leadership, functional leadership, and support personnel</li><li>Drive, track, and manage all material movement and help eliminate obstacles that prevent the steady flow of hardware to the floor</li><li>Collaborate with engineering to gain deep insights into the build process for highly technical prototype and production products.</li><li>Develop, manage, and finalize sub-assembly and final assembly work orders (WOs), ensuring alignment with production objectives and schedules.</li><li>Load Bills of Materials (BOMs) into the production system and oversee setup procedures to facilitate smooth production operations.</li><li>Utilize production systems and spreadsheets to meticulously craft, update, and maintain the production schedule, ensuring optimal resource allocation and workflow management.</li><li>Forecast material requirements and liaise with procurement teams to ensure timely acquisition of necessary components and supplies.</li><li>Act as a pivotal liaison between production and various departments, ensuring seamless communication and coordination across all stages of the production process.</li><li>Maintain a proactive approach to workload management, consistently ensuring that production activities are efficiently queued up and executed.</li><li>Monitor production progress closely, identifying and swiftly resolving any delays or issues through expedited material shipments or strategic revisions to the production schedule.</li><li>Provide support to the quality engineering team by facilitating production inspections and implementing quality assurance measures as required.</li><li>Regularly update management on the status of work in progress, material availability, and potential production challenges, offering strategic insights to optimize production outcomes.</li></ul>\n<br/>\n**Candidate should be able to demonstrate knowledge in:**\n<ul><li>Proficiency in basic electrical and mechanical manufacturing processes, with a comprehensive understanding of electrical components such as integrated circuits, capacitors, and resistors.</li><li>Demonstrated expertise in reading and interpreting Bills of Materials (BOMs) and build instructions to develop comprehensive work order instructions for production.</li><li>Ensure work orders, part kits, build instructions, tools and other material are complete and ready for sub and final assembly</li><li>Configuration and quality management</li><li>Engineering Change Orders (ECO)</li><li>Inventory software system, preferably InFlow</li><li>Production planning and management system</li><li>PCVA Board Assembly</li><li>Electromechanical components</li><li>**Aerospace or Military standards knowledge a plus**</li></ul>\n<br/>\n**In addition, the ideal candidate will have:**\n<ul><li>Excellent analytical and problem-solving skills</li><li>A hands-on, “get it done” attitude</li><li>Strong communication and leadership ability</li><li>Ability to work collaboratively with other departments</li><li>Creativity and self-motivation to solve unique and complex technical problems</li><li>Desire to lead teams and be promoted to higher levels of responsibility</li><li>Knowledge of Microsoft products including Windows 7, Word, Excel, etc.</li><li>Excellent oral and written English skills</li><li>U.S. citizen or resident status</li></ul>\n<br/>\nAs part of the ESI Motion's commitment to this overall process as an Equal Employment Opportunity (“EEO”) Employer, we will ensure all aspects of employment, including recruitment, selection, job assignment, training, compensation, benefits, discipline, promotion, transfer, layoff, and termination processes remain free of illegal discrimination based upon race, color, religion, sex, sexual orientation, gender identity, national origin, disability, and protected veteran status. ESI Motion ensures all employment decisions are based only on valid job requirements.", "responsibilities": "The Senior Production Planner plays a pivotal role in orchestrating the production activities within a dynamic, fast-paced environment. This individual oversees the seamless transition from engineering to production, meticulously crafting work schedules and ensuring the availability of resources to meet stringent deadlines. Collaborating closely with program management, engineering, procurement, quality assurance, and shipping teams, the Senior Production Planner drives forward the production process while maintaining the highest standards of efficiency and quality.", "qualifications": {"required": "The ideal candidate will have a high school diploma with 8+ years’ experience in a high-tech manufacturing environment or an Associate’s degree in Electrical Engineering or other related Engineering discipline (GPA > 3.2), and 3+ years recent experience in hands-on development.", "preferred": "Aerospace or Military standards knowledge a plus"}, "skills": ["MRP", "Production Planning", "Materials Management", "Work Order Management", "Bill of Materials (BOM)", "Production Scheduling", "Material Forecasting", "Procurement", "Quality Assurance", "Electrical Manufacturing", "Mechanical Manufacturing", "Electromechanical Components", "PCVA Board Assembly", "Inventory Software", "Production Planning and Management System", "Engineering Change Orders (ECO)", "Microsoft Products", "Communication", "Leadership", "Problem Solving", "Teamwork", "Self-Motivation", "Analytical Skills"], "postedDate": "4 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982229148"}