{"jobTitle": "Executive Assistant", "company": {"name": "Solomon Page", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "25.00 - 27.50", "currency": "USD"}, "jobFunction": "Administrative, General Business, and Other", "industry": "Entertainment Providers", "description": "Our client is seeking an Executive Assistant to join their team! This individual will play an integral role supporting two senior VPs by providing high-level administrative support for company leaders to ensure they can efficiently accomplish critical tasks and company initiatives. They organize executive communications to quickly access essential information without sorting through low-priority items. The Executive Assistant will establish working relationships with high-level executives and contribute to the organization's overall efficiency. This position will be directly supporting both the SVP of Brand Strategy, as well as the SVP – Creative Service and Content Operations. This position is hybrid and based out the Burbank office.", "responsibilities": "Act as the point of contact among executives, employees, clients, and other external partners to manage information flow promptly and accurately.\nProvide administrative assistance, such as writing and editing e-mails, drafting memos, and preparing communications on the Executive's behalf\nSubmit VP(s) expense reports and keep track to ensure department expense reports are approved.\nMaintain comprehensive and accurate records\nPerform minor accounting duties\nAnswer phone calls in a polite and professional manner\nWelcome visitors and identifying the purpose of their visit before directing them to the appropriate department\nPlace office supply orders for the department(s) as needed\nTo keep projects on time and on budget, the Executive Assistant works on all levels with constant communication of shifting priorities and evolving schedules. The role requires knowledge of each team's inner workings. The Executive Assistant is a self-starter that takes the initiative to anticipate the department's needs.\nFacilitate new employee on-boarding protocols (ordering equipment through WB Technology, assisting with badge procurement, etc.) under the direction of the internal System Operations team\nWork with VP on Brand Integration grids and tracking schedules\nCoordinate and support VP on international initiatives\nManage Photo production schedule and grids\nCreate PowerPoint white pages for large-scale projects\nPlan and arrange appointments for a wide variety of project-specific and team-related needs\nThis role requires strong written, verbal, and organizational skills\nConfidentiality, and the ability to keep\nBoth senior leaders desks are very busy so need someone who can support being pulled in a number of different directions", "qualifications": {"required": "3-5 years of experience performing the main duties as listed on this job description\nAbility to handle a high volume of complex projects and tasks for multiple people and departments while maintaining composure and managing competing priorities – demonstrated through previous experience\nMust have experience working with standard office software (Microsoft Office, etc)\nMust have an interest in scripted production processes and prior experience in physical production (corporate or on the show side)\nExcellent written and verbal communication skills\nStrong time-management skills and an ability to organize and coordinate multiple concurrent projects\nFlexible team player, willing to adapt to changes and unafraid of challenges\nExcellent written and verbal communication skills\nStrong time-management skills and an ability to organize and coordinate multiple concurrent projects\nFlexible team player, willing to adapt to changes and unafraid of challenges\nAbility to maintain confidentiality of information related to the company and its employees\n​​​​​​​Must have an interest in scripted production processes and prior experience in physical productionMust display effective communication skills, both written and verbal\nMust be organized, thorough and able to efficiently multi-task\nMust demonstrate the ability to prioritize, meet deadlines, make decisions, and take initiative\nMust be a team player and able to collaborate across multiple divisions\nStrong organizational skills and attention to detail required\nAbility to handle a high volume of complex projects and tasks for multiple people and departments while maintaining composure and managing competing priorities.\nMust possess solid organization, meeting management, effective time management, and excellent verbal and written communication skills\nHigh School diploma or equivalent required", "preferred": "Bachelor’s degree in related field strongly preferred"}, "skills": ["Microsoft Office", "Production", "Communication", "Time Management", "Organization"], "postedDate": "4 weeks ago", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982050437"}