{"jobTitle": "Sourcing Manager", "company": {"name": "Pair Eyewear", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00 - $135,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "At Pair Eyewear, we’re building the largest global eyecare company in the world focused on bringing personalization to the end to end eyecare experience, starting with your glasses. We’ve developed the first personalized eyewear brand where glasses can be an extension of your personality, mood, and interests. With funding from leading venture capitalists in the consumer space, partnerships in the entertainment, sports, and fashion arenas, and a team of passionate individuals, we’re on a mission to completely revolutionize the eyewear industry. We’re excited that we already have the support of Good Morning America, The Today Show, Oprah Magazine, CNN, and Forbes helping us share our story.<br/><br/>Pair is looking for a Sourcing Manager to build a sourcing team while fostering a culture of excellence focused on continuous improvement. This role will report to our Senior Director of Sourcing and Quality and be responsible for achieving our supplier engagement initiatives to create a robust and effective supply chain. Your work will be critical in transforming our eyewear products into market-leading, innovative offerings that delight our customers. You will partner with and have the support of team members in product development, quality, and operations.<br/><br/><strong>What You’ll Do:<br/><br/></strong><ul><li>Conduct comprehensive supplier evaluations and quarterly business reviews to measure performance and compliance.</li><li>Develop and nurture vendors with high expectations to establish a supplier matrix that mitigates risk and aligns with the long-term needs of the business.</li><li>Achieve margin goals by leading cost negotiations and product development initiatives in collaboration with cross-functional partners and senior executives.</li><li>Develop a deep understanding of the factors driving quality, cost, and delivery for the assigned areas.</li><li>Analyze data to facilitate purposeful decision-making and drive continuous improvement in sourcing strategies.</li><li>Streamline communication, approval processes, and production planning to reduce time from design to launch.<br/><br/></li></ul><strong>Who You Are: <br/><br/></strong><ul><li>Expert in negotiating contracts, pricing, and terms with suppliers to ensure optimal cost savings and favorable conditions.</li><li>Proficient in building and maintaining long-term, collaborative relationships with suppliers, ensuring high-quality and consistent supply.</li><li>Able to assess supplier performance, analyze spend data, and make informed decisions based on comprehensive evaluations.</li><li>Committed to fostering a culture of innovation, continuously seeking opportunities to improve sourcing processes and product quality.</li><li>Communicate effectively with cross-functional teams and external partners, ensuring seamless coordination and execution of sourcing activities.<br/><br/></li></ul><strong>Need to Have: <br/><br/></strong><ul><li>At least 6 years of experience in sourcing or procurement, preferably in the optical or the consumer products industry.</li><li>Extensive experience with manufacturing processes, particularly in Asia.</li><li>Proven track record of successfully negotiating and implementing contracts.<br/><br/></li></ul><strong>Nice to Have: <br/><br/></strong><ul><li>Experience in the optical industry, particularly with frame manufacturing.</li><li>Fluency in Mandarin.<br/><br/></li></ul><strong>Some Perks and Benefits of Working At Pair:<br/><br/></strong><ul><li>Health, vision and dental insurance</li><li>Unlimited PTO</li><li>Competitive salaries with equity opportunities</li><li>Retirement savings plan options</li><li>Free eyewear (plus discounts for family and friends)<br/><br/></li></ul>At Pair, we carefully consider a wide range of factors when determining compensation. These considerations can cause your compensation to vary. The pay range for this position is expected to be between $120,000 - $135,000 and will depend on your skills, qualifications, and experience. Additionally, this role might be eligible for discretionary short-term and long-term incentives. We encourage all interested candidates to apply.<br/><br/>Pair is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of actual or perceived age, ancestry, citizenship, color, disability, familial status, family responsibilities, gender identity/expression, genetic information, marital status, matriculation, national origin, personal appearance, political affiliation, pregnancy or related condition (including breastfeeding), race, religion, sex, sexual orientation, socioeconomic status, veteran status, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.", "responsibilities": "Build a sourcing team while fostering a culture of excellence focused on continuous improvement. Achieve supplier engagement initiatives to create a robust and effective supply chain. Transform our eyewear products into market-leading, innovative offerings that delight our customers. Partner with and have the support of team members in product development, quality, and operations.", "qualifications": {"required": "At least 6 years of experience in sourcing or procurement, preferably in the optical or the consumer products industry. Extensive experience with manufacturing processes, particularly in Asia. Proven track record of successfully negotiating and implementing contracts.", "preferred": "Experience in the optical industry, particularly with frame manufacturing. Fluency in Mandarin."}, "skills": ["Negotiation", "Procurement", "Supply Chain Management", "Supplier Management", "Manufacturing", "Cost Negotiation", "Contract Management", "Product Development", "Data Analysis", "Communication", "Relationship Building", "Optical Industry", "Mandarin"], "postedDate": "1 week ago", "benefits": "Health, vision and dental insurance, Unlimited PTO, Competitive salaries with equity opportunities, Retirement savings plan options, Free eyewear (plus discounts for family and friends)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982709864"}