{"jobTitle": "Analytics Engineer (L5) - Finance", "company": {"name": "Netflix", "location": "Los Gatos, CA", "industry": "Entertainment Providers"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$170,000 - $720,000"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>As Netflix's business grows, financial data is becoming increasingly mission critical. Netflix’s financial footprint is expanding with complexity due to its global scale, product innovations and business model evolvements. The Finance Data Science and Engineering team is part of the centralized Data and Insights organization, supporting the office of our Chief Financial Officer. The team’s core mission is to enable our business partners to access key financial data efficiently and provide insights to drive revenue growth and expense optimization.<br/><br/>The team is looking to add a Senior Analytics Engineer, who will work collaboratively with cross-functional partners including Finance, FP&amp;A, Data Engineering, Product, and Engineering teams to build insights and tools that help the company make better data-driven decisions.<br/><br/>To learn more about analytics engineering at Netflix, read here. Visit our culture deck and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.<br/><br/><strong>In This Role, You Will<br/><br/></strong><ul><li>Partner closely with Finance leads to identify strategic, high-impact analytical problems and innovative ways to solve them with data.</li><li>Conduct statistical analyses and modeling, exploratory analysis, and metric development to uncover data insights and inform key decisions.</li><li>Deliver data insights and drive for adoption through tools (e.g. dashboards, self-serve reporting), memos and presentations.</li><li>Develop scalable data pipelines to collect, clean, and analyze data from various sources; prototype, and productionize metrics and models.</li><li>Facilitate data ownership and accountability by closely partnering with data engineering, product, and engineering partners to improve data robustness.<br/><br/></li></ul><strong>To Be Successful In This Role, You Are/have<br/><br/></strong><ul><li>Highly effective in engaging with diverse stakeholders and adept at cultivating strong partnerships.</li><li>Strategic-minded, impact-driven, and capable of incorporating larger business context into data questions and product development.</li><li>A background in statistics, math, data science, or a similar quantitative field, with strong statistical skills and intuition.</li><li>High proficiency in statistical programming, Python preferred.</li><li>High proficiency in scripting with SQL, extracting large sets of data, and designing ETL flows.</li><li>Experienced with developing data tools, memos, and presentations to deliver data and insights to stakeholders.</li><li>Past experience in solving problems in Finance or other business-facing areas is a plus.</li><li>A passionate learner who is eager to learn and apply a broad set of data techniques.</li><li>A self-starter who thrives under a high level of ambiguity and autonomy.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <strong>here.<br/><br/></strong>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "Partner closely with Finance leads to identify strategic, high-impact analytical problems and innovative ways to solve them with data.\nConduct statistical analyses and modeling, exploratory analysis, and metric development to uncover data insights and inform key decisions.\nDeliver data insights and drive for adoption through tools (e.g. dashboards, self-serve reporting), memos and presentations.\nDevelop scalable data pipelines to collect, clean, and analyze data from various sources; prototype, and productionize metrics and models.\nFacilitate data ownership and accountability by closely partnering with data engineering, product, and engineering partners to improve data robustness.", "qualifications": {"required": "Highly effective in engaging with diverse stakeholders and adept at cultivating strong partnerships.\nStrategic-minded, impact-driven, and capable of incorporating larger business context into data questions and product development.\nA background in statistics, math, data science, or a similar quantitative field, with strong statistical skills and intuition.\nHigh proficiency in statistical programming, Python preferred.\nHigh proficiency in scripting with SQL, extracting large sets of data, and designing ETL flows.\nExperienced with developing data tools, memos, and presentations to deliver data and insights to stakeholders.\nPast experience in solving problems in Finance or other business-facing areas is a plus.\nA passionate learner who is eager to learn and apply a broad set of data techniques.\nA self-starter who thrives under a high level of ambiguity and autonomy."}, "skills": ["Data Engineering", "Data Science", "Python", "SQL", "ETL", "Statistics", "Finance", "Analytics"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982463644"}