{"jobTitle": "Account Executive", "company": {"name": "StimLabs", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$95,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "In this role, you are responsible for establishing and maintaining customer relationships, and educating customers on product features, distinctions, and utilization. You'll represent StimLabs, LLC in sales calls and achieving sales goals for products in your territory. As Territory Sales Manager, you are expected to execute the selling cycle in a manner that is concise, professional, ethical and persuasive and leads the customer to action. You are also responsible for administrative duties, such as maintaining customer records, preparing reports, following up on orders, attending sales meetings and trade shows, and training.<br/><br/><strong>RESPONSIBILTIES<br/><br/><br/></strong><ul><li>Establish and maintain customer relationships </li><li>Represent StimLabs in sales calls and negotiations and achieve established sales goals for products in assigned territory </li><li>Effective sales process execution to include new business opportunities, lead generation, and competitive account conversions</li><li>Effective management of sales pipeline. Document opportunities and closed business through the use of the StimLabs indicated CRM software</li><li>Develop new and/or expand business with existing customers through introduction of new products, presenting product information, explaining product features and distinctions, and so forth </li><li>Development of effective customer relations within assigned territory in order to ensure satisfaction and service, and promote needs awareness </li><li>Identify and resolve customer problems through contact with customer service department</li><li>Maintain a variety of contacts within StimLabs to gather and exchange information related to sales goals and results, product availability and pricing, marketing strategies and plans, status of orders, and so forth </li><li>Responsible for sales administration activities such as completing sales plans, maintaining customer records, preparing routine expense, sales, and activity reports, assisting with special projects, analyzing individual customer product mix and sales volume, and processing orders </li><li>Responsible for obtaining and maintaining up to date records and medical credentials required by the hospitals in the territory</li><li>Reporting any potential complaints about product efficacy, performance, or other deficiencies to Quality in a timely manner and assisting with investigations as needed</li><li>Assisting with inventory management including performance of inventory verification at customer location as requested by Operations Management</li><li>Participating in field corrective actions (e.g. recall or market withdrawal) as needed<br/><br/><br/><br/></li></ul><strong>Other Requirments<br/><br/></strong><ul><li>Ability to travel domestically and within assigned region often involving overnight stays</li><li>Consultative selling and closing skills</li><li>Ability to build consultative relationships with advanced practice clinicians (physicians, NP’s, nurses), supply chain partners and end users to influence product choice decisions</li><li>Ability to work with a diverse range of customers</li><li>Demonstrated ability to promote concepts and ideas to create customer demand</li><li>Excellent presentation, interpersonal, written and verbal skills</li><li>Ability to engage audiences<br/><br/><br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor's Degree</li><li>Experience in medical industry may be considered in lieu of a Bachelor’s degree</li><li>Demonstrated business to business sales experience; experience in medical device is strongly preferred</li><li>Knowledge of sales and a high level of communication and negotiation skills <br/><br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Advanced wound care experience in both the acute care market and wound care clinics</li><li>Live and have experience selling in the assigned territory; exceptions may be made for specific territories at the discretion of the Company</li><li>Evidence of top sales achievement with experience in multi-level account management<br/><br/><br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Salary: $95k + Commission<br/><br/><br/><br/></li></ul>StimLabs was founded in 2015 with a desire to advance the state of regenerative medicine. In pursuit of this goal, StimLabs has gathered exceptional scientific and clinical minds to develop and commercialize new bioactive technologies. While current technologies in medical devices, pharmaceuticals, and tissue banking provide useful products, StimLabs believes in the untapped synergy at the intersection of these independent domains. In the first steps towards this vision, StimLabs has launched a suite of next-generation amniotic-derived products. The success of these initial offerings has created a foundation on which StimLabs will continue building the future of regenerative medicine.<br/><br/>Salary + Commission", "responsibilities": "Establish and maintain customer relationships, Represent StimLabs in sales calls and negotiations and achieve established sales goals for products in assigned territory, Effective sales process execution to include new business opportunities, lead generation, and competitive account conversions, Effective management of sales pipeline. Document opportunities and closed business through the use of the StimLabs indicated CRM software, Develop new and/or expand business with existing customers through introduction of new products, presenting product information, explaining product features and distinctions, and so forth, Development of effective customer relations within assigned territory in order to ensure satisfaction and service, and promote needs awareness, Identify and resolve customer problems through contact with customer service department, Maintain a variety of contacts within StimLabs to gather and exchange information related to sales goals and results, product availability and pricing, marketing strategies and plans, status of orders, and so forth, Responsible for sales administration activities such as completing sales plans, maintaining customer records, preparing routine expense, sales, and activity reports, assisting with special projects, analyzing individual customer product mix and sales volume, and processing orders, Responsible for obtaining and maintaining up to date records and medical credentials required by the hospitals in the territory, Reporting any potential complaints about product efficacy, performance, or other deficiencies to Quality in a timely manner and assisting with investigations as needed, Assisting with inventory management including performance of inventory verification at customer location as requested by Operations Management, Participating in field corrective actions (e.g. recall or market withdrawal) as needed", "qualifications": {"required": "Bachelor's Degree, Experience in medical industry may be considered in lieu of a Bachelor’s degree, Demonstrated business to business sales experience; experience in medical device is strongly preferred, Knowledge of sales and a high level of communication and negotiation skills", "preferred": "Advanced wound care experience in both the acute care market and wound care clinics, Live and have experience selling in the assigned territory; exceptions may be made for specific territories at the discretion of the Company, Evidence of top sales achievement with experience in multi-level account management"}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982244555"}