{"jobTitle": "Merchandise Manager", "company": {"name": "Ulta Beauty", "location": "Northridge, CA"}, "location": "Northridge, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "22.00 - 30.00", "currency": "USD"}, "jobFunction": "Sales and Management", "industry": "Consumer Services, Personal Care Product Manufacturing, and Retail", "description": "<strong>Overview<br/><br/></strong><strong>Experience</strong> a place of energy, passion, and excitement. A place where the joy of discovery and uncommon artistry blend to create exhilarating buying experiences—for true beauty enthusiasts. At Ulta Beauty, we’re transforming the world one shade, one lash, one cut at a time. Because beauty is powerful.<br/><br/>If you seek <strong>greater purpose</strong>—a place of vision, mission, and lived values—where voices are heard, contributions valued and recognized and growth opportunities abound, consider Ulta Beauty. Nowhere else are the possibilities quite this beautiful.<br/><br/><strong>General Summary &amp; Scope<br/><br/></strong>The Merchandise Manager (MM) is responsible for leading through Ulta Beauty’s mission, vision, and values and contributing to a high-performing team that consistently delivers top-line sales growth for the store. The MM reports to the Operations Manager (OM). The MM guides a team of Task Associates and is accountable for supporting the operations of a retail store, including, but not limited to, the shipment process, replenishment, omni-channel, price changes, and markdowns. This leader drives the store’s business through a focus on performance (sales, inventory results, and operational compliance), people (training and development), and process (standard operating procedures and compliance standards). This position requires a passion for operational excellence, a drive for results, and the ability to quickly and efficiently lead through unforeseen complexity.<br/><br/><strong>PRINCIPAL DUTIES &amp; RESPONSIBILITIES</strong> (*Essential Job Functions)<br/><br/>The MM is a champion of Ulta Beauty’s mission, vision, and values, and should demonstrate them skillfully and consistently by performing the following duties and responsibilities of the position (as well as all other projects/duties as assigned):<br/><br/><strong>Performance<br/><br/></strong><ul><li>Promote a culture of accountability to meet or exceed the store’s goals related to retail and service sales, guest loyalty (including credit), payroll, omni-channel, and retail shrink as set by Ulta Beauty for the store.</li><li>Drive company profitability through operational excellence, top-line sales growth, and expense control.</li><li>Leverage store forecast and payroll budgets to support with store scheduling needs and communicate the needs to the GM to maximize productivity, achieve sales and payroll goals, and complete workload (e.g., omni-channel, shipment, replenishment, markdowns, and price changes) on time, and within the payroll budget.</li><li>Review, analyze, and react to Ulta Beauty’s financial and operational reporting, including store visit and audit results, regularly and in a timely manner.</li><li>Leverage company programs, tools, and resources to drive improvements to meet Ulta Beauty’s goals for the store.</li><li>Perform makeup applications, skincare analysis, and product demonstrations with guests to drive sales and guest service experience.</li><li>Take the initiative to stay informed regarding new and existing industry trends, products, and services during work time, and be knowledgeable about the ingredients and benefits of these trends, products, and services to better serve guests.</li><li>Maintain prompt, regular attendance as the MM and hold store associates accountable to the Ulta Beauty attendance policy.<br/><br/></li></ul><strong>People<br/><br/></strong><ul><li>Attract, hire, and retain a diverse team of top talent.</li><li>Build a highly engaged team that embodies the Ulta Beauty brand through effective collaboration, open and honest communication, and prioritization of work.</li><li>Create an inclusive environment that inspires and encourages the growth and engagement of associates.</li><li>Support all aspects of associate professional development, including training, providing individualized competency-based feedback and coaching, succession planning, and individual development plans to enable continuous development and drive sales performance.</li><li>Regularly participate in ongoing training, including brand and category education, to enable continuous professional development and drive sales performance.</li><li>Model a culture of operational excellence by leading by example, sharing best practices, establishing priorities, and providing support.</li><li>Execute the Guest Engagement Leader program flawlessly through business ownership, associate coaching, and leading a helpful and friendly guest experience to drive business results across all Annual Performance Goals (APGs) metrics for the store.<br/><br/></li></ul><strong>Process<br/><br/></strong><ul><li>Be knowledgeable of and ensure compliance with Ulta Beauty’s policies, procedures, and standards.</li><li>Adhere to and enforce Ulta Beauty’s dress code.</li><li>Use the company’s scheduling tool as directed to adjust schedules and manage attendance in-the-moment during manager-on-duty shifts to ensure accurate schedules and reporting.</li><li>Use the company’s task management tool as directed to prioritize and execute store workload, including product and marketing resets, pricing updates, inventory related tasks, cleaning, and replenishment.</li><li>Ensure the execution of all operational focuses inclusive of shipment, replenishment, omni-channel, price changes, and markdowns.</li><li>Protect company assets and minimize loss by ensuring all store standards and operating procedures are met, including workplace safety, inventory control, cash management and loss prevention.</li><li>Execute day-to-day inventory control processes (e.g., known theft, damages, hazardous waste, inventory adjustments, product returns) and complete theft reporting as necessary.</li><li>Support continuous improvement by influencing the adoption of company initiatives and technology, communicating expectations, and ensuring the execution of all store tasks.</li><li>Utilize company programs, tools, and resources to drive store improvements.</li><li>Regularly communicate and provide feedback to field leadership on business trends and opportunities, events, operational challenges, merchandise needs, and competitive landscape for their store.<br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><strong>Education<br/><br/></strong><ul><li>High school diploma is preferred<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>1-2+ years of fast-paced, retail management, or other relevant work experience</li><li>Financial management: success with driving top-line sales, interpreting reporting data, managing payroll budgets, and controlling expense.</li><li>Retail management: proven ability with monitoring inventory levels, achieving operational excellence, driving a service culture, and executing merchandising directives.</li><li>Leadership management: experience with attracting, developing, and motivating top talent, swiftly adapting to change and leading others through the change-curve, developing collaborative relationships with others, and leading and influencing a team.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Proficient with basic technology (e.g., Point of Sale system, Microsoft Office programs, and Apple devices)</li><li>Excellent written and verbal communication</li><li>Strong collaboration and interpersonal skills</li><li>Strong organizational skills to manage multiple tasks</li><li>Ability to react under pressure, use good judgment in ambiguous situations, and be flexible/adaptable<br/><br/></li></ul><strong>Special Position Requirements<br/><br/></strong><ul><li>Work a flexible, full-time schedule to include days, evenings, weekends, and holidays</li><li>Must be able to work shifts beginning at 5:00 a.m.</li><li>Must be available to work shifts on Sundays and Mondays<br/><br/></li></ul><strong>WORKING CONDITIONS<br/><br/></strong><ul><li>Continuous mobility throughout the store during shift</li><li>Continuous and/or frequent bending, pulling, pushing, crouching, stooping, reaching, and twisting during shift</li><li>Continuous coordination and manipulation of objects during shift</li><li>Frequent lifting and/or moving up to 40 lbs. during shift</li><li>Frequent use of a computer, telephonic devices, and related office supplies<br/><br/></li></ul>If an associate has a disability that prevents them from performing an essential function of the job, the Company will engage in the interactive process with the associate to determine whether there is a reasonable accommodation that will enable the associate to perform the essential functions of the job.<br/><br/>The pay range for this position is $22.00 - $30.00 / Hour with the opportunity for eligible associates to earn additional compensation pursuant to the Company’s bonus plan. Exact pay will be based on factors including, but not limited to relevant education, qualifications, certifications, experience, level, shift, geographic location, and business and organizational needs. Full-time positions are eligible for paid time off, health, dental, vision, life and disability benefits. Part-time positions are eligible for dental, vision, life, and disability benefits. For additional information concerning our benefits, visit our Benefits and Career Development page: https://careers.ulta.com/careers/about-us/benefits-and-career-development<br/><br/><strong>About<br/><br/></strong>At <strong>Ulta Beauty</strong> (NASDAQ: ULTA), <em><strong>the possibilities are beautiful</strong></em>. Ulta Beauty is the largest North American beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. We bring possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring—hair, skin, brow, and make-up services.<br/><br/><em>We will consider for employment all qualified applicants, including those with arrest records, conviction records, or other criminal histories, in a manner consistent with the requirements of any applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York City Fair Chance Act.</em>", "responsibilities": "The MM is a champion of Ulta Beauty’s mission, vision, and values, and should demonstrate them skillfully and consistently by performing the following duties and responsibilities of the position (as well as all other projects/duties as assigned):<br/><br/><strong>Performance<br/><br/></strong><ul><li>Promote a culture of accountability to meet or exceed the store’s goals related to retail and service sales, guest loyalty (including credit), payroll, omni-channel, and retail shrink as set by Ulta Beauty for the store.</li><li>Drive company profitability through operational excellence, top-line sales growth, and expense control.</li><li>Leverage store forecast and payroll budgets to support with store scheduling needs and communicate the needs to the GM to maximize productivity, achieve sales and payroll goals, and complete workload (e.g., omni-channel, shipment, replenishment, markdowns, and price changes) on time, and within the payroll budget.</li><li>Review, analyze, and react to Ulta Beauty’s financial and operational reporting, including store visit and audit results, regularly and in a timely manner.</li><li>Leverage company programs, tools, and resources to drive improvements to meet Ulta Beauty’s goals for the store.</li><li>Perform makeup applications, skincare analysis, and product demonstrations with guests to drive sales and guest service experience.</li><li>Take the initiative to stay informed regarding new and existing industry trends, products, and services during work time, and be knowledgeable about the ingredients and benefits of these trends, products, and services to better serve guests.</li><li>Maintain prompt, regular attendance as the MM and hold store associates accountable to the Ulta Beauty attendance policy.<br/><br/></li></ul><strong>People<br/><br/></strong><ul><li>Attract, hire, and retain a diverse team of top talent.</li><li>Build a highly engaged team that embodies the Ulta Beauty brand through effective collaboration, open and honest communication, and prioritization of work.</li><li>Create an inclusive environment that inspires and encourages the growth and engagement of associates.</li><li>Support all aspects of associate professional development, including training, providing individualized competency-based feedback and coaching, succession planning, and individual development plans to enable continuous development and drive sales performance.</li><li>Regularly participate in ongoing training, including brand and category education, to enable continuous professional development and drive sales performance.</li><li>Model a culture of operational excellence by leading by example, sharing best practices, establishing priorities, and providing support.</li><li>Execute the Guest Engagement Leader program flawlessly through business ownership, associate coaching, and leading a helpful and friendly guest experience to drive business results across all Annual Performance Goals (APGs) metrics for the store.<br/><br/></li></ul><strong>Process<br/><br/></strong><ul><li>Be knowledgeable of and ensure compliance with Ulta Beauty’s policies, procedures, and standards.</li><li>Adhere to and enforce Ulta Beauty’s dress code.</li><li>Use the company’s scheduling tool as directed to adjust schedules and manage attendance in-the-moment during manager-on-duty shifts to ensure accurate schedules and reporting.</li><li>Use the company’s task management tool as directed to prioritize and execute store workload, including product and marketing resets, pricing updates, inventory related tasks, cleaning, and replenishment.</li><li>Ensure the execution of all operational focuses inclusive of shipment, replenishment, omni-channel, price changes, and markdowns.</li><li>Protect company assets and minimize loss by ensuring all store standards and operating procedures are met, including workplace safety, inventory control, cash management and loss prevention.</li><li>Execute day-to-day inventory control processes (e.g., known theft, damages, hazardous waste, inventory adjustments, product returns) and complete theft reporting as necessary.</li><li>Support continuous improvement by influencing the adoption of company initiatives and technology, communicating expectations, and ensuring the execution of all store tasks.</li><li>Utilize company programs, tools, and resources to drive store improvements.</li><li>Regularly communicate and provide feedback to field leadership on business trends and opportunities, events, operational challenges, merchandise needs, and competitive landscape for their store.<br/><br/></li></ul>", "qualifications": {"required": "1-2+ years of fast-paced, retail management, or other relevant work experience\nFinancial management: success with driving top-line sales, interpreting reporting data, managing payroll budgets, and controlling expense.\nRetail management: proven ability with monitoring inventory levels, achieving operational excellence, driving a service culture, and executing merchandising directives.\nLeadership management: experience with attracting, developing, and motivating top talent, swiftly adapting to change and leading others through the change-curve, developing collaborative relationships with others, and leading and influencing a team.", "preferred": "High school diploma is preferred"}, "skills": ["Point of Sale system", "Microsoft Office programs", "Apple devices", "written and verbal communication", "collaboration", "interpersonal skills", "organizational skills"], "postedDate": "1 week ago", "benefits": "Full-time positions are eligible for paid time off, health, dental, vision, life and disability benefits. Part-time positions are eligible for dental, vision, life, and disability benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982686215"}