{"jobTitle": "Sr. Community Manager", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>THE JOB: We’re looking for an experienced and highly skilled Senior Community Manager to lay the foundation for helping us build deeply engaged player communities for Cloud Games streamed directly to our members' TVs. In this role, you will be responsible for developing strategies and maintaining a healthy community of players within Netflix's unique social ecosystem, which drives member joy and engagement. The right candidate will be intimately familiar with building early development communities from the ground up, developing the foundational advocates we need to drive explosive player growth after launch. You will leverage your deep knowledge of grassroots community building to help us drive early Beta experiences; Developing social channels, acquiring players, executing playtesting, gathering feedback, and building relationships with content creators. You will leverage your experiences in launching new games to collaborate closely with Netflix partners, developing strong relationships that will amplify our voice, and build joyful relationships with players around the world. THE TEAM: ISX’s mission is to empower small teams of exceptional developers to build breakout hits, leveraging innovative gameplay married with beloved IPs and served seamlessly within the Netflix streaming ecosystem. You will join the group of developers who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with. Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. Responsibilities<br/><br/><ul><li>Voice of the Player: Identifies meaningful community feedback and trends, and tactfully represents their voice to our development teams. </li><li>Build, foster &amp; grow safe communities: Develops online communities across multiple channels (Discord, Reddit, X, TikTok, etc) that are inclusive, respectful, and promote strong engagement with our games.</li><li>Drives early community playtesting: Partners with development team(s) to plan and execute early community playtesting roadmaps for games in Alpha &amp; Beta. Develops methods to acquire new players, hosts playtest events, and collects early player feedback. </li><li>Owns content creator strategy: Builds strong player advocacy for our games by developing and maintaining healthy relationships with content creators, influencers, fan sites and more. </li><li>Develop &amp; execute social campaigns: Create player joy &amp; conversations through a consistent stream of social content including text, images, videos, live streaming, events, and more.</li><li>Partner with Netflix communications &amp; marketing: Cultivates a strong relationship with partner groups within Netflix in order to identify and deliver on game launches, marketing campaigns, product collaborations, and cross channel opportunities both virtually and in person. <br/><br/></li></ul>The Ideal Candidate<br/><br/><ul><li>7+ years of experience creating, growing, and maintaining thriving game communities</li><li>Excellent written and verbal communication skills </li><li>Strong track record of planning and executing early Beta community play-testing events</li><li>Deep experience in working with content creators, influencers, and social media advocates</li><li>Proven ability to create best in class external external-facing content</li><li>Strong track record of creating and protecting inclusive, safe, and welcoming community spaces.</li><li>Has shipped at least one game at scale in partnership with publishing, marketing &amp; comms <br/><br/></li></ul>Bonus Skills<br/><br/><ul><li>Pre-existing relationships with key community members, content creators, influencers &amp; more</li><li>Prior background in Marketing, Publishing, PR or Communications </li><li>Prior background in creating content as a player (Content creator, influencer, fan sites, etc)</li><li>Technical experience in game operations (Build deployment, troubleshooting player issues, etc) </li><li>Experience leading &amp; managing other community professionals<br/><br/></li></ul>Required Application Materials<br/><br/><ul><li>Resume</li><li>Portfolio of communities you’ve played a key role in, social channels you’ve run that demonstrate how you create and build community<br/><br/></li></ul>Location<br/><br/><ul><li>Orange County or Los Angeles preferred</li><li>Will consider remote applicants who are willing to travel for work-related events<br/><br/></li></ul>Compensation: Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000-$600,000 Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "jobFunction": "Other", "industry": "Entertainment Providers", "salary": {"amount": "100,000.00 - 600,000.00", "currency": "USD"}, "skills": ["Community Management", "Social Media", "Game Development", "Content Creation", "Player Engagement", "Community Building", "Playtesting", "Influencer Marketing", "Social Media Marketing", "Communication", "Marketing", "Publishing", "PR", "Game Operations"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982461791"}