{"jobTitle": "Jr. Social Media Manager", "company": {"name": "Digital Media Management", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$16.83/hr - $24.04/hr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Digital Media Management (DMM), a Keywords Studios company, is a full-service social media agency that specializes in 360 campaigns for the entertainment, games, and consumer brands industries. DMM creates groundbreaking social-first marketing campaigns rooted in innovative strategy, and provides clients with community management, creative, video production, influencer, talent, and performance marketing capabilities. We are looking for a Jr. Social Media Manager to join our fun and growing TV & streaming division. The Jr. Social Media Manager will oversee the social accounts for our entertainment brand clients. You will be responsible for creating and managing innovative and engaging social media campaigns. You have experience developing social strategies, building out content calendars, conceptualizing the social creatives, copywriting, and engaging with audiences on social media channels.", "responsibilities": "Oversee editorial calendars and content rollouts, Publish content to all social media channels, Social listening for your assigned titles, Produce regular reports on social sentiment, Facilitate community management on all social media channels, Write creative copy and adjust voice/tone from project to project, Participate in brainstorms for various campaigns across the company", "qualifications": {"required": "Experience working within the social media space, preferably within an agency environment, Experience working across social campaigns in entertainment or TV, Content creation across social platforms like Instagram Story, TikTok, etc, Strong copywriting skills and ability to master in-world voice and tones, Excellent interpersonal and client communication/presentation skills", "preferred": ""}, "skills": ["Social Media Management", "Content Creation", "Copywriting", "Community Management", "Social Strategy"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "DMM pays 100% of the cost for employee medical, dental, and vision premiums, as well as covers 40% of dependent premium costs, Employer paid life insurance, A tax-advantaged health savings account (HSA), A 401(k) plan that provides employees with automatic enrollment at 3% of your salary with a full employer match of your first 3% contribution, all fully vested, Paid family leave, Open PTO: DMM offers unlimited vacation, 10 sick days & 5 mental health days, DMM Fridays: Employees have the opportunity to sign off early and kick-start their weekends at 2pm on Fridays, DEI specific training focused on preventing discrimination and harassment in the workplace, ERGs focusing on diverse perspectives across DMM to promote diversity, inclusion, and shared experiences, Generous donation match to non-profits of interest to our employees, Extensive onboarding that includes working with multiple departments to learn the DMM way, Frequent trainings on the latest tools and trends and how to optimize them for our clients.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3982310161"}