{"jobTitle": "Program Manager, Health Plan Operations (Remote in CA)", "company": {"name": "Molina Healthcare", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "66,560.00/yr - $129,589.63/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>This position will offer remote work flexibility, but the candidate hired for this role must reside in the state of California. Medicaid and Medicare health care experience and experience working with Providers and/or Provider data is highly desirable. <br/><br/></strong><strong>Job Summary<br/><br/></strong>Responsible for internal business projects and programs involving department or cross-functional teams of subject matter experts, delivering products through the design process to completion. Plans and directs schedules as well as project budgets. Monitors the project from inception through delivery. May engage and oversee the work of external vendors. Assigns, directs and monitors system analysis and program staff. These positions' primary focus is project/program management.<br/><br/><strong>Job Duties<br/><br/></strong><ul><li>Active collaborator with people who are responsible for internal business projects and programs involving department or cross-functional teams of subject matter experts, delivering products through the design process to completion.</li><li>Plans and directs schedules as well as project budgets.</li><li>Monitors the project from inception through delivery.</li><li>May engage and oversee the work of external vendors.</li><li>Focuses on process improvement, organizational change management, program management and other processes relative to the business.</li><li>Leads and manages team in planning and executing business programs.</li><li>Serves as the subject matter expert in the functional area and leads programs to meet critical needs.</li><li>Communicates and collaborates with customers to analyze and transform needs and goals into functional requirements. Delivers the appropriate artifacts as needed.</li><li>Works with operational leaders within the business to provide recommendations on opportunities for process improvements.</li><li>Creates business requirements documents, test plans, requirements traceability matrix, user training materials and other related documentations.</li><li>Generate and distribute standard reports on schedule<br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><strong>REQUIRED EDUCATION</strong>:<br/><br/>Bachelor's Degree or equivalent combination of education and experience.<br/><br/><strong>Required Experience/Knowledge, Skills &amp; Abilities<br/><br/></strong><ul><li>3-5 years of Program and/or Project management experience.</li><li>Operational Process Improvement experience.</li><li>Healthcare experience.</li><li>Experience with Microsoft Project and Visio.</li><li>Excellent presentation and communication skills.</li><li>Experience partnering with different levels of leadership across the organization.<br/><br/></li></ul><strong>Preferred Education<br/><br/></strong>Graduate Degree or equivalent combination of education and experience.<br/><br/><strong>Preferred Experience<br/><br/></strong><ul><li> 5-7 years of Program and/or Project management experience.</li><li> Managed Care experience.</li><li> Experience working in a cross functional highly matrixed organization.<br/><br/></li></ul><strong>Preferred License, Certification, Association<br/><br/></strong><ul><li> PMP, Six Sigma Green Belt, Six Sigma Black Belt Certification and/or comparable coursework desired.<br/><br/></li></ul>To all current Molina employees: If you are interested in applying for this position, please apply through the intranet job listing.<br/><br/>Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V.<br/><br/>Pay Range: $66,560 - $129,589.63 / ANNUAL<br/><br/><ul><li>Actual compensation may vary from posting based on geographic location, work experience, education and/or skill level.</li></ul>", "responsibilities": "Active collaborator with people who are responsible for internal business projects and programs involving department or cross-functional teams of subject matter experts, delivering products through the design process to completion. Plans and directs schedules as well as project budgets. Monitors the project from inception through delivery. May engage and oversee the work of external vendors. Focuses on process improvement, organizational change management, program management and other processes relative to the business. Leads and manages team in planning and executing business programs. Serves as the subject matter expert in the functional area and leads programs to meet critical needs. Communicates and collaborates with customers to analyze and transform needs and goals into functional requirements. Delivers the appropriate artifacts as needed. Works with operational leaders within the business to provide recommendations on opportunities for process improvements. Creates business requirements documents, test plans, requirements traceability matrix, user training materials and other related documentations. Generate and distribute standard reports on schedule", "qualifications": {"required": "3-5 years of Program and/or Project management experience. Operational Process Improvement experience. Healthcare experience. Experience with Microsoft Project and Visio. Excellent presentation and communication skills. Experience partnering with different levels of leadership across the organization.", "preferred": "Graduate Degree or equivalent combination of education and experience. 5-7 years of Program and/or Project management experience. Managed Care experience. Experience working in a cross functional highly matrixed organization. PMP, Six Sigma Green Belt, Six Sigma Black Belt Certification and/or comparable coursework desired."}, "skills": ["Program Management", "Project Management", "Process Improvement", "Healthcare", "Microsoft Project", "Visio", "Presentation Skills", "Communication Skills", "Leadership"], "postedDate": "1 month ago", "benefits": "Molina Healthcare offers a competitive benefits and compensation package.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982059274"}