{"jobTitle": "Employee Relations Business Partner", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "143,000.00/yr - 205,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Technology, Information and Internet", "description": "The Meta Global Employee Relations team is a trusted partner to the very core of our business, our People. At Meta Global Employee Relations, we redefine the individual experience with empathy, inclusion and respect. We are truly there in the moments that matter. If you are an Employee Relations expert with deep experience in coaching, handling complex performance and complaint casework, and you have a passion for finding creative solutions to enhance processes along the way, then you'll thrive in our fast paced and collaborative environment. Join a world-class team of employee relations professionals with a knack for problem solving, risk assessment and care in handling interpersonal and other employee relations matters to ensure fair, objective and consistent outcomes. Partner both hands-on and strategically with critical cross functional partners, people managers and employees through performance management and workplace conflict issues to cultivate an innovative, high-performing, and inclusive culture. At Meta Employee Relations, we take pride in continuing to enhance the individual experience through everyday interactions but also in continuing to bring creative and effective ideas and solutions at a global scale. Join us!<br/><br/>Employee Relations Business Partner Responsibilities:<br/><br/><ul><li>Design and deliver targeted solutions with a high degree of focus on scale and growth, including conflict resolution and mediation, strategic planning on people policies and processes and change management</li><li>Provide strategic Employee Relations support, business partnership, thought partnership, and coaching to all levels of the organization</li><li>Proactively assess team and manager development needs, make recommendations, and implement appropriate solutions</li><li>Triage employee relations casework, identifies potential solutions to address different case types and actions appropriately using guidelines</li><li>Provide rigorous data analysis and reporting solutions based on business needs, highlighting key trends in employee relations to actively drive proactive solutions to minimize reactive work</li><li>Help balance risk, taking into account employee, business and company perspectives</li><li>Help design and facilitate Manager Training based on data analysis</li><li>Integrate and partner with HR colleagues in the HR Business Partner, Legal, Investigations, Learning &amp; Development, and HR Programs teams to implement solutions and help scale the business</li><li>Partner closely with regional HR partners on global strategy and execution</li><li>Plan, execute, and evaluates complex assignments that have an impact in region or with the clients supported</li><li>Participate and lead projects as an integral member of the extended HR community and influence others within the organization</li><li>Build collaborative and productive working relationships</li><li>Lead with integrity, respect, high personal standards and build personal credibility</li><li>Builds internal community (e.g. supports others, shows respect, acts as an ally, onboards new hires, connects people, collaborates well, drives inclusion)</li><li>Actively involved in interviewing and on-boarding new employees<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>8+ years experience in an Employee Relations, HR Business Partner or equivalent role</li><li>Demonstrates solid judgment and experience assessing risk relative to the business</li><li>Effective communication and critical thinking skills</li><li>Demonstrates empathy and experience driving inclusion work</li><li>Demonstrates project management and change management experience</li><li>Demonstrated experience learning and thriving in a constantly changing environment and to cultivate relationships across teams</li><li>Experience using data to identify insights that drive action</li><li>Experience helping global and/or matrixed organizations scale</li><li>Demonstrated experience in influencing and strategically solve problems</li><li>Consulting, coaching and facilitation skills</li><li>Proven experience leading, growing, and scaling experienced HR professionals<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>BA/BS degree<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$143,000/year to $205,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "The Meta Global Employee Relations team is a trusted partner to the very core of our business, our People. At Meta Global Employee Relations, we redefine the individual experience with empathy, inclusion and respect. We are truly there in the moments that matter. If you are an Employee Relations expert with deep experience in coaching, handling complex performance and complaint casework, and you have a passion for finding creative solutions to enhance processes along the way, then you'll thrive in our fast paced and collaborative environment. Join a world-class team of employee relations professionals with a knack for problem solving, risk assessment and care in handling interpersonal and other employee relations matters to ensure fair, objective and consistent outcomes. Partner both hands-on and strategically with critical cross functional partners, people managers and employees through performance management and workplace conflict issues to cultivate an innovative, high-performing, and inclusive culture. At Meta Employee Relations, we take pride in continuing to enhance the individual experience through everyday interactions but also in continuing to bring creative and effective ideas and solutions at a global scale. Join us!<br/><br/>Employee Relations Business Partner Responsibilities:<br/><br/><ul><li>Design and deliver targeted solutions with a high degree of focus on scale and growth, including conflict resolution and mediation, strategic planning on people policies and processes and change management</li><li>Provide strategic Employee Relations support, business partnership, thought partnership, and coaching to all levels of the organization</li><li>Proactively assess team and manager development needs, make recommendations, and implement appropriate solutions</li><li>Triage employee relations casework, identifies potential solutions to address different case types and actions appropriately using guidelines</li><li>Provide rigorous data analysis and reporting solutions based on business needs, highlighting key trends in employee relations to actively drive proactive solutions to minimize reactive work</li><li>Help balance risk, taking into account employee, business and company perspectives</li><li>Help design and facilitate Manager Training based on data analysis</li><li>Integrate and partner with HR colleagues in the HR Business Partner, Legal, Investigations, Learning &amp; Development, and HR Programs teams to implement solutions and help scale the business</li><li>Partner closely with regional HR partners on global strategy and execution</li><li>Plan, execute, and evaluates complex assignments that have an impact in region or with the clients supported</li><li>Participate and lead projects as an integral member of the extended HR community and influence others within the organization</li><li>Build collaborative and productive working relationships</li><li>Lead with integrity, respect, high personal standards and build personal credibility</li><li>Builds internal community (e.g. supports others, shows respect, acts as an ally, onboards new hires, connects people, collaborates well, drives inclusion)</li><li>Actively involved in interviewing and on-boarding new employees<br/><br/></li></ul>", "qualifications": {"required": "8+ years experience in an Employee Relations, HR Business Partner or equivalent role, Demonstrates solid judgment and experience assessing risk relative to the business, Effective communication and critical thinking skills, Demonstrates empathy and experience driving inclusion work, Demonstrates project management and change management experience, Demonstrated experience learning and thriving in a constantly changing environment and to cultivate relationships across teams, Experience using data to identify insights that drive action, Experience helping global and/or matrixed organizations scale, Demonstrated experience in influencing and strategically solve problems, Consulting, coaching and facilitation skills, Proven experience leading, growing, and scaling experienced HR professionals", "preferred": "BA/BS degree"}, "skills": ["Employee Relations", "HR Business Partner", "Risk Assessment", "Conflict Resolution", "Strategic Planning", "Change Management", "Data Analysis", "Project Management", "Coaching", "Facilitation", "Leadership", "Team Building", "Inclusion"], "postedDate": "1 week ago", "benefits": "$143,000/year to $205,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982447413"}