{"jobTitle": "Senior Negotiator/Buyer, Programmatic", "company": {"name": "Publicis Media", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing", "industry": "Advertising Services", "description": "Publicis Media harnesses the power of modern media through global agency brands CJ, Performics, Publicis Collective, Publicis Health Media, Spark Foundry, Starcom and Zenith. A key business solution of Publicis Groupe ([Euronext Paris FR0000130577, CAC 40], Publicis Media’s digital-first, data-driven global practices deliver client value and drive growth in a platform-powered world. It is present in more than sixty countries with over 23,000 employees worldwide.<br/><br/>\n<strong>Job Description<br/><br/></strong><p><strong>Overview:</strong><br/>Negotiate, purchase, maintain, and steward National Video media buys</p><p><strong> </strong></p><p><strong>Role Objectives:</strong></p><ul><li>Oversee, train and mentor Assistant Negotiators</li><li>Mentor media trainees within the group</li><li>Negotiate and purchase National Video scatter/upfront activity</li><li>Maintain current knowledge of marketplace conditions through network meetings and trade publications</li><li>Project delivery for inventory against relevant target demographics</li><li>Steward media schedules adhering to each client’s buying guidelines</li><li>Help oversee timeline and execution of added value opportunities</li><li>Maintain confirmation of purchase, schedules, budgets, and reconciliation of network billing</li><li>Monitor performance of buys using current rating information. Secure makegoods and/or audience deficiency units for under delivery</li><li>Contribute to post-analysis reports</li><li>Meet all due dates for buys, post analyses, and assigned projects; help team set up project deadlines to achieve all timelines</li><li>Communicate regularly with salespeople and negotiate to maintain or improve the integrity of the buys as they are stewarded</li><li>Advise supervisors of marketplace conditions, special opportunities, and potential schedule interruptions</li><li>Assist in development of cost per points, competitive checks and group projects<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>B.A. or B.S. in Marketing, Advertising or related field</li><li>Agency experience highly preferred</li><li>2-4 years of experience working in a national media investment buying environment</li><li>Experience negotiating TV dayparts and online video</li><li>Strong negotiating and presenting skills</li><li>Excellent communication, organizational and analytical skills</li><li>Detail-oriented, able to multi-task and work well under tight deadlines in a fast-paced environment</li><li>Proficiency in MS Word, Excel and PowerPoint.  Experience with Media Ocean software (DDS, MBOX) preferred<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><p>All your information will be kept confidential according to EEO guidelines.</p><p>Compensation Range: $46,500.00 - $68,500.00 annually. This is the pay range the Company believes it will pay for this position at the time of this posting. Consistent with applicable law, compensation will be determined based on the skills, qualifications, and experience of the applicant along with the requirements of the position, and the Company reserves the right to modify this pay range at any time. For this role, the Company will offer medical coverage, dental, vision, disability, 401k, and paid time off. The Company anticipates the application deadline for this job posting will be 09/04/2024.</p>", "responsibilities": "Negotiate, purchase, maintain, and steward National Video media buys", "qualifications": {"required": "B.A. or B.S. in Marketing, Advertising or related field\nAgency experience highly preferred\n2-4 years of experience working in a national media investment buying environment\nExperience negotiating TV dayparts and online video\nStrong negotiating and presenting skills\nExcellent communication, organizational and analytical skills\nDetail-oriented, able to multi-task and work well under tight deadlines in a fast-paced environment\nProficiency in MS Word, Excel and PowerPoint.  Experience with Media Ocean software (DDS, MBOX) preferred", "preferred": ""}, "skills": ["MS Word", "Excel", "PowerPoint", "Media Ocean", "Negotiation", "Presentation", "Communication", "Organization", "Analysis"], "postedDate": "4 weeks ago", "benefits": "medical coverage, dental, vision, disability, 401k, and paid time off.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982294532"}