{"jobTitle": "Director, Culinary Operations", "company": {"name": "Universal Studios Hollywood", "industry": "Entertainment", "size": "Not specified", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$120,000-$150,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment", "description": "The Director of Culinary Operations reports directly to the VP of Culinary and Executive Chef and is responsible for two main pillars: Culinary Production and Culinary Park Operations. In this role, you will work with department leadership in planning, implementing, and supporting new food and beverage initiatives, lead culinary teams in planning, training, and daily execution, and serve as a culinary expert who provides leadership and sets standards for culinary excellence.", "responsibilities": "Develop and mentor senior chefs. Creates training opportunities for chefs and managers through manufacturers and vendor resources and shares/promotes internal best practices. Conducts food tastings and evaluates food presentations. Establishes food specifications. Directs sustainability initiatives throughout the property. Fluent understanding of restaurant & food service P&L’s (labor & food & beverage costs), financial metrics & venue budgets. Research and stay current with all culinary trends. Address any issues regarding food quality, taste, and presentation promptly and work with Chefs and operation managers to take appropriate action. Provide culinary guidance and support to Chefs and Operations Managers. Ability to collaborate with other departments, proactively identify problems/opportunities, and take ownership of deadlines and deliverables. Collaborate with Operations Team to manage supply chain challenges and opportunities. Provide vision for ongoing culinary development. Conduct regular quality checks to ensure adherence to established recipes and standards. Ensure compliance with all local, state, and federal laws regarding food quality, safety, labor, employment, Union guidelines, and Company policies and procedures. Collaborate with the Chefs and Operations Team to ensure that the correct training materials are in place and used as intended. Partner with the Quality Assurance department to ensure that the highest safe food handling practices are met. Train and develop teams to understand the importance of food safety. Responsible for performance evaluations, disciplinary recommendations, succession planning, and management development to meet needs. Maintain or exceed weekly budgeted variable operation profit by controlling cost of goods & variable labor. Standardize recipes, portion sizes, and presentation techniques to maintain consistent quality across all venues. Monitor and control food costs by implementing effective inventory management, portion control, and waste reduction strategies. Conduct training programs and workshops for Culinary Team Members to enhance their culinary skills, drive retention and engagement, and maintain consistent cooking techniques. Foster a positive and creative work environment the encourages creativity, teamwork, and professional growth. Creates strategic plans to optimize venue profits while maintaining high food quality, food safety, and cleanliness standards. Effectively builds a cohesive team while demonstrating organizational, planning, delegation, mentoring, and coaching skills. Develop and foster open communication and healthy working relationships with all support partners, between business units and company departments. Provides visionary leadership and management of the culinary Research and development process from product creation through implementation. Staying current on developing trends in the restaurant industry and being able to apply trending ingredients and flavors that support relevant Guest demographics. Identifying and introducing new culinary techniques.", "qualifications": {"required": "Minimum of 12 years of progressive experience in culinary services. A Culinary Arts degree is preferred. A food manager certificate is required. Advanced knowledge and understanding of the culinary arts. Advanced time management and organization. In-depth knowledge of federal, state, and local food handling regulations. Comfortable training, directing, and supervising. Excellent verbal and written communication skills. Proficient in Microsoft Outlook, Word, Excel, and PowerPoint. Ability to work during holidays, days, nights, and weekends.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3982310273"}