{"jobTitle": "Director, Business Development", "company": {"name": "Paradies Lagardère", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Business Development", "industry": "Retail", "description": "This position is responsible for increasing the number of partner RFPs within assigned territory, ultimately resulting in increasing Paradies businesses, and developing and executing Paradies’ growth strategy. This position will work closely with other Paradies teams, primarily the business development team and field operations teams, to plan and execute a growth plan. The position is also responsible for contract negotiation and contract renewals. This is a remote West Coast position.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Accountable for new and existing business growth through consultative sales strategy, development and execution and is most specifically focused on new business development. </li><li>Work with business, technology and operations stakeholders to develop Paradies roadmaps for bringing this intelligent and ever evolving airport retail to market. </li><li>Anticipate, understand and communicate emerging marketing trends and technologies that will enhance effectiveness of the platform. </li><li>Develop and evolve list of target prospects and create relationships with key technical decision makers at the VP and C-level and all other appropriate levels. An existing network of senior relationships at key brands and retailers will be a strong asset. </li><li>Manage sales pipeline, forecasting revenues, provide regular activity reports to management. </li><li>Manage and maintain all client contacts and pipeline in Salesforce.com </li><li>Evaluate competitive landscape to continually enhance product offerings and provide input on product solutions to management. </li><li>Proven ability to capture client’s business challenges and create concise and accurate opportunity briefs. </li><li>Demonstrate an understanding and passion around the promise and opportunity that data and insight-driven marketing presents. <br/><br/></li></ul><strong>Education<br/><br/></strong><strong>Job Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree in Business Management or higher. <br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>Tenacious and hard-working, self –starter, self-motivated, and able to work effectively with little supervision </li><li>Passionate about brands and loyalty </li><li>Continuous learner, curious, stays one step ahead of the client, and trusted advisor </li><li>Charismatic, well presented and articulate </li><li>Comfortable working independently and working remotely with support/delivery team and leadership </li><li>Collaborative team player </li><li>Strong integrity, always striving for excellence </li><li>Interest or experience with public speaking <br/><br/></li></ul><strong><strong>Physical Requirement <br/><br/></strong></strong><ul><li>Sitting for long periods of time<br/><br/></li></ul><strong>Travel Required<br/><br/></strong><ul><li>Yes<br/><br/></li></ul>", "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982859764"}