{"jobTitle": "Retail Operations Manager", "company": {"name": "Goodwill Southern California", "industry": "Non-profit Organizations"}, "location": "Upland, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "17.75/hr - 17.75/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Non-profit Organizations", "description": "Goodwill is one of the leading non-profit brands in the world and one of the largest non-profits in Southern California. We are a rapidly evolving organization and yet we have never been more focused on our Mission, on our people, and on our future. It’s always a GOOD day in SoCal!<br/><br/>The Retail Operations Manager is responsible for the efficient operation of a Retail Store, Boutique or Attended Donation Center (ADC), with accountability for the operation functions. The Retail Operations Manager leads team to achieve established goals for sales, production, customer service, payroll, safety and expense control and closely collaborates with Site Manager to achieve standards and goals.<br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li>Performs manager on duty activities as assigned by Site Manager. Including opening and closing, managerial operations of a cash register; trains, leads and encourages Ambassadors to meet goals, providing training and guidance while maintaining established company standard operating procedures (SOP). </li><li>Provide excellent service, engages with each Ambassador, customer and donor, while presenting a friendly and cooperative attitude. Role models, communicates and coaches our Mission and RISE (Respect, Integrity, Service and Integrity) Values to our Ambassadors, customers and donors.</li><li>Ensure a safe work environment by maintaining a clean and safe environment by following all established company standard operating policies and procedures and exercises caution in work related activities. </li><li>Adheres, coaches and trains Ambassadors on de-escalation practices regarding the public and proper procedures for loss prevention situations. </li><li>Identifies and communicates concerns, contacting the District Manager for guidance when the Site Manager is not available.</li><li>Supervisory responsibilities include; training Ambassadors; planning, assigning, scheduling and directing work; providing input on performance appraisals; recognizing, developing Ambassadors; addressing complaints and resolving problems. Follows up on all assigned projects. Gives corrective feedback under direction of the Site Manager.</li><li>Monitors and maintains salesfloor, production area, structural, electrical, store equipment, landscaping, housekeeping, loss prevention and safety to company standards. </li><li>Buying: Trains, evaluates and coaches Ambassadors to process donated goods meeting quantity, quality and key performance indicator (KPI) business goals, following established SOPs and guidelines.</li><li>Ecommerce: Trains, evaluates and coaches Ambassadors to identify and process ecommerce collectables and other items, luxury brands and books, to meet goals and established SOPs and guidelines.</li><li>Donations: Ensures accurate capture of donor information, proper sorting of goods and maintaining safety according to established SOPs and guidelines. </li><li>Backroom: Ensuring proper procedures are followed to maintain backroom compliance including, transferring goods, Kaizen, hazmat, supply storage, purchased product, safety and truck swaps.</li><li>Work flexible shifts; including nights, weekends, holidays and overtime when needed. May be required to work at a nearby location.<br/><br/></li></ul><strong>Education &amp; Experience<br/><br/></strong><ul><li>1-3 years of supervisory experience in a customer focused management role. </li><li>High school diploma or general education degree (GED) required. College degree helpful.</li><li>Ability to multitask projects of varying scope and complexity with minimum supervision.</li><li>Ability to share Goodwill’s purpose with the public and ask for monetary donations and customer/donor information.</li><li>Bilingual in Spanish helpful.</li><li>Must be proficient in using computers and other technology necessary to complete the activities assigned.</li><li>Must be proficient in Microsoft Outlook, completing surveys using electronic platforms in order to complete daily tasks. </li><li>Strong Communication, training, developing and people skills.</li><li>Demonstrated success with process accountability and multi-tasking.</li><li>Ability to handle confidential information. </li><li>Punctual and dependable attendance.</li><li>Free from alcohol and drug abuse.</li><li>Understands the basic philosophy of Goodwill and participates fully in carrying out its mission.</li><li>Adheres to Goodwill’s values of Respect, Integrity, Service, &amp; Excellence.</li><li>Clear screening processes which include: Background and Drug Screening.<br/><br/></li></ul>Goodwill Industries in Southern California is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability or protected veteran status. If you'd like more information about your EEO rights as an applicant under the law, please click here: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf<br/><br/>Goodwill gives preferential consideration to persons with barriers to employment. Persons with disabilities are encouraged to apply.<br/><br/>Equal Employment Opportunity<br/><br/>Goodwill is committed to a policy of equal employment opportunity for applicants and employees.<br/><br/>Employment decisions will comply with all applicable laws prohibiting discrimination in employment including Title VII of the Civil Rights Act of 1964, the Age Discrimination Employment Act of 1967, the Americans with Disabilities Act of 1990, the Immigration and Nationality Act, and any other characteristic protected by federal or state law.<br/><br/>Nondiscrimination on the Basis of Disabilities<br/><br/>In furtherance of our commitment to end discrimination against qualified disabled individuals, and in accordance with the provisions of Section 504 of the Rehabilitation Act of 1973, the Americans with Disabilities Act, and all regulations properly issued thereunder to protect the rights of qualified disabled persons, it is Goodwill's policy that no program or activity administered by it shall exclude from participation, deny benefits to or subject to discrimination any individual solely by reason of his or her disability. Equal employment opportunity will be extended to qualified disabled persons in all aspects of the employer-employee relationship, including recruitment, hiring, upgrading, training, promotion, transfer, discipline, layoff, recall and termination. We further affirm that we will provide reasonable accommodation to the known physical or mental limitations of an otherwise qualified disabled employee or applicant.<br/><br/>It is the policy of Goodwill to provide reasonable accommodations for qualified persons with disabilities who are employees or applicants for employment. If you need assistance for accommodations to interview because of a disability, please notify the Human Resources Department.<br/><br/>Employment opportunities will not be denied to anyone because of the need to make reasonable accommodations for a disability.", "responsibilities": "The Retail Operations Manager is responsible for the efficient operation of a Retail Store, Boutique or Attended Donation Center (ADC), with accountability for the operation functions. The Retail Operations Manager leads team to achieve established goals for sales, production, customer service, payroll, safety and expense control and closely collaborates with Site Manager to achieve standards and goals.", "qualifications": {"required": "1-3 years of supervisory experience in a customer focused management role. \nHigh school diploma or general education degree (GED) required. College degree helpful.\nAbility to multitask projects of varying scope and complexity with minimum supervision.\nAbility to share Goodwill’s purpose with the public and ask for monetary donations and customer/donor information.\nBilingual in Spanish helpful.\nMust be proficient in using computers and other technology necessary to complete the activities assigned.\nMust be proficient in Microsoft Outlook, completing surveys using electronic platforms in order to complete daily tasks. \nStrong Communication, training, developing and people skills.\nDemonstrated success with process accountability and multi-tasking.\nAbility to handle confidential information. \nPunctual and dependable attendance.\nFree from alcohol and drug abuse.\nUnderstands the basic philosophy of Goodwill and participates fully in carrying out its mission.\nAdheres to Goodwill’s values of Respect, Integrity, Service, &amp; Excellence.\nClear screening processes which include: Background and Drug Screening.", "preferred": ""}, "skills": ["Customer Service", "Management", "Training", "Sales", "Teamwork", "Communication", "Microsoft Outlook", "Process Improvement", "Loss Prevention", "Safety", "Supervisory Experience", "Cash Handling", "Inventory Management", "Retail Operations", "Standard Operating Procedures (SOPs)"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982405982"}