{"jobTitle": "Data Engineer (L5) - Content Machine Learning", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00/yr - 720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is the world's leading internet streaming service with over 250 million members in 190 countries. Our members enjoy a wide variety of streamed videos per day, using over 1000 types of devices, generating more than a third of downstream Internet traffic in North America. The Content Knowledge Graph team within Data Science &amp; Engineering equips scientists, engineers, and business executives with a global understanding of the entertainment industry “on &amp; off-service”. Our flagship product, Netflix KG (“Hitch”), a data and analytics foundational layer, is a data pillar for 100s of diverse use cases across Netflix: from enabling content and marketing business executives to make better data-driven decisions to equipping AI/ML scientists with signals that power billions of daily predictions, to providing key inputs to engineering teams building business-critical applications. Hitch is a foundation for innovation that is helping to fuel Netflix’s long-term growth.<br/><br/>We are looking for a Data Engineer with a background in Machine Learning to own and scale our data systems while supporting high-visibility data pipelines and products. As part of this team, you will work on a diverse tech stack to build insightful, scalable, and robust data systems and machine learning models that create and describe the entities, interactions, and usage patterns across the Netflix Knowledge Graph. You will collaborate closely with other Machine Learning Engineers and Scientists to build scalable graphs and then leverage graph data in ML predictive models.<br/><br/>The ideal candidate will have a strong background in distributed data processing and can demonstrate strong data intuition and end-to-end ownership of our systems - from data collection and processing to running ML systems in production.<br/><br/><strong>Who You Are<br/><br/></strong><ul><li>Passionate about data systems: build reliable and trustworthy web-scale data products </li><li>Highly proficient in at least one of the programming languages (e.g. Python, Java, or Scala) with at least 4 years of software/data engineering experience</li><li>Comfortable with SQL and using big data technologies (e.g. Hive, Presto, Spark, Iceberg, etc) on medium to large-scale data.</li><li>Familiarity with machine learning libraries TensorFlow, PyTorch, JAX, or Keras</li><li>Experience working in machine learning or natural language processing domains. Some experience in implementing and productionizing models in large-scale industrial settings is a plus. </li><li>Conceptually familiar or interested in learning graph technologies (e.g. databases, data models, query languages, graph machine learning)</li><li>You have strong communication skills and can collaborate with cross-functional team members and partners on projects that drive high-impact outcomes</li><li>Excited about learning new business domains, demonstrating excellence, and growing your career <br/><br/></li></ul><strong>What You Will Do<br/><br/></strong><ul><li>Engineer efficient, adaptable, and scalable data pipelines to process structured and unstructured data </li><li>Leverage ML techniques for information extraction, building knowledge graphs with the information, and leveraging graph ML to power business insights.</li><li>Build robust data quality systems using best-in-the-class data and ML techniques enabling the team and partners to deliver more business value</li><li>Develop a deep understanding of the Netflix Data Science &amp; Engineering ecosystem and related business domains </li><li>Understand business requirements and provide data that empowers teams to innovate on top of the Netflix KG</li><li>Join a stunning team of data and machine learning engineers with diverse skill sets, partnering closely with data science, analytics, and business counterparts<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Engineer efficient, adaptable, and scalable data pipelines to process structured and unstructured data \nLeverage ML techniques for information extraction, building knowledge graphs with the information, and leveraging graph ML to power business insights.\nBuild robust data quality systems using best-in-the-class data and ML techniques enabling the team and partners to deliver more business value\nDevelop a deep understanding of the Netflix Data Science &amp; Engineering ecosystem and related business domains \nUnderstand business requirements and provide data that empowers teams to innovate on top of the Netflix KG\nJoin a stunning team of data and machine learning engineers with diverse skill sets, partnering closely with data science, analytics, and business counterparts", "qualifications": {"required": "Highly proficient in at least one of the programming languages (e.g. Python, Java, or Scala) with at least 4 years of software/data engineering experience\nComfortable with SQL and using big data technologies (e.g. Hive, Presto, Spark, Iceberg, etc) on medium to large-scale data.\nFamiliarity with machine learning libraries TensorFlow, PyTorch, JAX, or Keras\nExperience working in machine learning or natural language processing domains. Some experience in implementing and productionizing models in large-scale industrial settings is a plus. \nConceptually familiar or interested in learning graph technologies (e.g. databases, data models, query languages, graph machine learning)\nYou have strong communication skills and can collaborate with cross-functional team members and partners on projects that drive high-impact outcomes\nExcited about learning new business domains, demonstrating excellence, and growing your career"}, "skills": ["Python", "Java", "Scala", "SQL", "Hive", "Presto", "Spark", "Iceberg", "TensorFlow", "PyTorch", "JAX", "Keras", "Machine Learning", "Natural Language Processing", "Graph Technologies"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982466038"}