{"jobTitle": "Business Analyst", "company": {"name": "Motion Recruitment", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$53.00/hr - $55.00/hr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Staffing and Recruiting", "description": "Our client, a leading healthcare organization dedicated to advancing patient care and safety, is looking for a contract Business Analyst. This is fully remote role. Contract Duration: 4-Months. Required Skills & Experience: Bachelors Degree preferred and/or 10+ years of experience in Accounts Payable, ERP (PeopleSoft/Oracle); Coupa preferred. PeopleSoft, Coupa, Excel.", "responsibilities": "Advises and recommends areas of program planning, business requirements management, budget execution and program coordination. Prepares needs assessment. Validates resource requirements and develops cost estimate models. Conducts and coordinates financial, product, market, operational, and related research to support strategic and business planning within the various departments and programs of the client group. Interprets, evaluates, and interrelates research data, and develops integrated business analyses and projections for incorporation into strategic decision-making. Plans and coordinates the development of primary and secondary market research studies in support of strategic planning and specific marketing initiatives, as required, and presents findings of studies to client committees. Provides consultative, advisory, technical, and staff support, as appropriate. Ability to use survey and market research methodologies, systems, and techniques.", "qualifications": {"required": "Bachelors Degree preferred and/or 10+ years of experience in Accounts Payable, ERP (PeopleSoft/Oracle); Coupa preferred.", "preferred": ""}, "skills": ["PeopleSoft", "Coupa", "Excel"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Fully remote", "url": "https://www.linkedin.com/jobs/view/3982520769"}