{"jobTitle": "Director and Medical Management SME", "company": {"name": "COPE Health Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00 - $180,000.00", "currency": "USD"}, "jobFunction": "Consulting", "industry": "Business Consulting and Services, Hospitals and Health Care, and Public Health", "description": "The Director and Medical Management Subject Matter Expert (SME) will report to the Principal & EVP of Medical Management and will work closely with firm leadership to manage and support consulting engagements and business development opportunities – particularly those related to payer or provider medical management areas including care management, UM and UR.", "responsibilities": "The Director must be able to effectively manage major engagements, business development projects and team members while maintaining excellent client rapport and developing value-add content to support client engagements. The successful candidate must have in-depth knowledge of the health care environment and market issues at the federal, state and local level.", "qualifications": {"required": "Valid Registered Nursing (RN) license in the state of practice (CA preferred)., 5 - 10 years of experience in consulting and/or related operations in a health care setting, Prior experience in at least two of the following areas strongly preferred:, Care model redesign for providers and payers, Care Management / Medical Management Care Models, Population health management within value based payment models, Quality assurance and performance improvement, Regulatory compliance (Medicare, Special Needs Plans, Medicaid, etc.), Health plan accreditation (NCQA, URAC, etc.), Other clinically-related operations in MSOs, ACOs, IPAs, Medicare Direct Contracting, Clinically Integrated Networks, Centers of Excellence, health plans and other clinical settings, Behavioral Health care models, Strong communication and interpersonal skills; experience in managing senior key stakeholder relationships, A strong understanding of the health care industry and its current trajectory, High level of proficiency in Excel and other Microsoft Office programs, Skills related to effective project management, including strong work ethic, attention to detail, time management, ability to prioritize, problem solving, flexibility and willingness to learn, Open to traveling up to 80% (e.g., Monday – Thursday), Flexibility to work evenings and weekends as necessary, Ability to work effectively on multiple projects with a team in a fast-paced environment", "preferred": ""}, "skills": ["Care Management", "Medical Management", "Population Health", "Quality Assurance", "Regulatory Compliance", "Health Plan Accreditation", "Project Management", "Excel", "Microsoft Office"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "As a firm passionate about health care, we’re deeply committed to the health and wellness of our own team members. We offer comprehensive, affordable insurance plans for our team and their families, and a host of other unique benefits, such as a yearly stipend for wellness-related activities, and a paid parental leave program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982246446"}