{"jobTitle": "Legal Counsel", "company": {"name": "POP MART", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90.00/yr - $110.00/yr", "currency": "USD"}, "jobFunction": "Legal, Consulting, and Research", "industry": "Entertainment Providers, Retail, and Retail Apparel and Fashion", "description": "<strong><u>Legal Counsel</u></strong><br/><br/><strong>Los Angeles, CA(On-site)</strong><br/><br/>POP MART, founded in 2010 (SEHK: 9992), is a market-leading entertainment company and a global champion of designer toy culture. Through global artist development, IP operations, designer toy culture evangelism, and strategic investments, we have built an integrated platform covering the entire designer toy value chain, allowing artists to focus solely on their craft and giving stage to talent from all over the world. With 4,000+ employees worldwide, POP MART has successfully set foot in more than 23 countries and regions, serving a diverse audience of cultural pioneers and art fans.<br/><br/><strong>Job Overview</strong><br/>We are in search of a <strong>Legal Counsel </strong>to join our newly setup US office in Los Angeles. The person will be a key member of our legal team, responsible for providing legal support and advice to various departments within the company. This position requires strong legal research and analytical skills, as well as excellent communication abilities to effectively collaborate with internal teams.<br/><br/><strong>What You Will Achieve</strong><br/><ul><li>Draft, review, negotiate, and finalize contracts, agreements, and other legal documents related to POP MART’s retail business operation, including but not limited to leases, construction agreements, promotion agreements. Organize contract approval matrix and manage the contract archive.</li><li>Conduct legal research and manage legal risks in relation to POP MART’s business, including but not limited to data protection regulations, industry trends, labor laws, advertisement and customer protection requirements.</li><li>Liaise with external legal counsel and government agencies to ensure smooth operations and compliance with legal obligations.</li><li>Collaborate with cross-functional teams to understand business needs and provide practical legal solutions.</li><li>Assist headquarters(HQ) legal team with legal affairs in relation with auditor’s audition, adjustment of shareholding structure, M&amp;A and other legal matters HQ legal team assigned from time to time.</li><li>Participate in legal training sessions to enhance the legal knowledge and skills of internal teams.</li></ul><br/><br/><strong> What You Will Need</strong><br/><ul><li>Bachelor's degree or above in Law, LLM or JD is a preference, and pass the bar exam in at least one state.</li><li>Have obtained legal qualification with a minimum of 3-5 years of relevant legal experience, legal counsel experience for retail business is a preference.</li><li>Strong legal research and analytical skills, with the ability to independently complete projects, interpret and apply complex legal provisions.</li><li>Solid understanding of contract law, commercial law, and relevant industry regulations.</li><li>Proficient in legal software and technology tools, as well as Microsoft Office suite.</li><li>Native speak in English, and it would be better to have other foreign language skills.</li><li>Ability to work independently and take ownership of assigned tasks.</li><li>Creative thinker with the ability to provide innovative legal solutions to complex problems.</li><li>Positive attitude and results-oriented approach, with a strong commitment to the company's values and mission.</li></ul><br/><br/><strong>What We Offer</strong><br/><ul><li>Market-competitive packages: we provide 401k, health insurance, PTO leave, paid sick leave, and family leave, etc.</li><li>Opportunities to learn and lead: we provide on-the-job training to ensure employees are equipped with the most up-to-date skill sets and knowledge</li><li>Career development: we work with you to advance your career through short-term assignments, and new experiences, etc.</li></ul><br/><br/><br/>*POP MART is committed to equal pay initiatives and will not ask candidates for their current or past salary.<br/>**As an Equal Opportunity Employer, POP MART does not discriminate against applicants or employees because of race, color, creed, religion, sex, national origin, veteran status, disability, age, citizenship, marital or domestic/civil partnership status, sexual orientation, gender identity or expression or because of any other status or condition protected by applicable federal, state or local law.", "responsibilities": "Draft, review, negotiate, and finalize contracts, agreements, and other legal documents related to POP MART’s retail business operation, including but not limited to leases, construction agreements, promotion agreements. Organize contract approval matrix and manage the contract archive.\nConduct legal research and manage legal risks in relation to POP MART’s business, including but not limited to data protection regulations, industry trends, labor laws, advertisement and customer protection requirements.\nLiaise with external legal counsel and government agencies to ensure smooth operations and compliance with legal obligations.\nCollaborate with cross-functional teams to understand business needs and provide practical legal solutions.\nAssist headquarters(HQ) legal team with legal affairs in relation with auditor’s audition, adjustment of shareholding structure, M&amp;A and other legal matters HQ legal team assigned from time to time.\nParticipate in legal training sessions to enhance the legal knowledge and skills of internal teams.", "qualifications": {"required": "Bachelor's degree or above in Law, LLM or JD is a preference, and pass the bar exam in at least one state.\nHave obtained legal qualification with a minimum of 3-5 years of relevant legal experience, legal counsel experience for retail business is a preference.\nStrong legal research and analytical skills, with the ability to independently complete projects, interpret and apply complex legal provisions.\nSolid understanding of contract law, commercial law, and relevant industry regulations.\nProficient in legal software and technology tools, as well as Microsoft Office suite.\nNative speak in English, and it would be better to have other foreign language skills.\nAbility to work independently and take ownership of assigned tasks.\nCreative thinker with the ability to provide innovative legal solutions to complex problems.\nPositive attitude and results-oriented approach, with a strong commitment to the company's values and mission."}, "skills": ["Legal Research", "Contract Negotiation", "Commercial Law", "Legal Compliance", "Legal Writing"], "postedDate": "4 weeks ago", "benefits": "Market-competitive packages: we provide 401k, health insurance, PTO leave, paid sick leave, and family leave, etc.\nOpportunities to learn and lead: we provide on-the-job training to ensure employees are equipped with the most up-to-date skill sets and knowledge\nCareer development: we work with you to advance your career through short-term assignments, and new experiences, etc.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982294845"}