{"jobTitle": "DSD Inventory Specialist", "company": {"name": "Mondelēz International", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Regular", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing, Food and Beverage Services, and Manufacturing", "description": "<strong>Job Description<br/><br/></strong><strong>Are You Ready to Make It Happen at Mondelēz International?<br/><br/></strong><strong>Join our Mission to Lead the Future of Snacking. Make It Possible.<br/><br/></strong>You will execute warehouse operations in term of service, cost, health and safety, quality, food defense, sustainability, legal requirements and policies compliance. You will also work collaboratively with key internal and external (third-party logistics vendors) business partners to ensure effective management, timely solutions and execution. You will also be responsible for activities such as inventory management (iDoc management, stock reconciliation), interfaces monitoring, track and trace, claims management, invoice management, compliance execution (HSE, quality, risk management), tenders support, third-party performance management, pallets management.<br/><br/><strong>How You Will Contribute<br/><br/></strong>You will:<br/><br/><ul><li>Review and analyze stock inaccuracies and guarantee accurate stock alignment between SAP and the warehouse management system based on available information among stakeholders. Analyze and verify capacity utilization, performance and KPI monitoring, and introduce corrective measures in case of missing KPIs and the need to reduce additional capacity</li><li>Work with our service providers to ensure the delivery of our trading partners in terms of punctuality and completeness, taking into account quality and HACCP guidelines</li><li>Monitor inbound, outbound, co-packing, warehousing and distribution activities to ensure shelf-life monitoring and management, supports reduction of write offs and constantly looks for opportunities to improve productivities</li><li>Conduct project-related and ad hoc tasks, in particular in connection with continuous improvement projects and tenders and peak management</li><li>Build and provide full-cost analysis (yearly budget), risks and opportunities<br/><br/><br/></li></ul><strong>What You Will Bring<br/><br/></strong>A desire to drive your future and accelerate your career and the following experience and knowledge:<br/><br/><ul><li>Experience with Microsoft applications, especially highly experienced with excel</li><li>Enjoys team work</li><li>Experience in logistics operations, procurement or supply chain function in general as an asset</li><li>Analytical thinking</li><li>Good knowledge of ERP, preferably SAP R3<br/><br/><br/></li></ul><strong>More About This Role<br/><br/></strong><strong>What you need to know about this position:<br/><br/></strong><ul><li>Somone who is looking for next steps in their career<br/><br/><br/></li></ul><strong>What extra ingredients you will bring:<br/><br/></strong><ul><li>Has worked with SAP/ERP systems.<br/><br/><br/></li></ul><strong>Education / Certifications:<br/><br/></strong>Bachelor's degree is preferred<br/><br/><strong>Travel requirements:<br/><br/></strong>Less than 10%<br/><br/><strong>Work schedule:<br/><br/></strong>Hours will be flexible and can change on a weekly basis<br/><br/>Within Country Relocation support available and for candidates voluntarily moving internationally some minimal support is offered through our Volunteer International Transfer Policy<br/><br/><strong>Business Unit Summary<br/><br/></strong>The United States is the largest market in the Mondelēz International family with a significant employee and manufacturing footprint. Here, we produce our well-loved household favorites to provide our consumers with the right snack, at the right moment, made the right way. We have corporate offices, sales, manufacturing and distribution locations throughout the U.S. to ensure our iconic brands—including <em>Oreo</em> and <em>Chips Ahoy!</em> cookies, <em>Ritz</em>, <em>Wheat Thins</em> and <em>Triscuit</em> crackers, and <em>Swedish Fish</em> and <em>Sour Patch</em> <em>Kids</em> confectionery products —are close at hand for our consumers across the country.<br/><br/>Mondelēz Global LLC is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected Veteran status, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Applicants who require accommodation to participate in the job application process may contact 847-943-5460 for assistance.<br/><br/><strong>Job Type<br/><br/></strong>Regular<br/><br/>Warehousing &amp; Logistics Operations Management<br/><br/>Customer Service &amp; Logistics", "responsibilities": "You will execute warehouse operations in term of service, cost, health and safety, quality, food defense, sustainability, legal requirements and policies compliance. You will also work collaboratively with key internal and external (third-party logistics vendors) business partners to ensure effective management, timely solutions and execution. You will also be responsible for activities such as inventory management (iDoc management, stock reconciliation), interfaces monitoring, track and trace, claims management, invoice management, compliance execution (HSE, quality, risk management), tenders support, third-party performance management, pallets management.", "qualifications": {"required": "Experience with Microsoft applications, especially highly experienced with excel, Enjoys team work, Experience in logistics operations, procurement or supply chain function in general as an asset, Analytical thinking, Good knowledge of ERP, preferably SAP R3", "preferred": "Bachelor's degree"}, "skills": ["Microsoft Applications", "Excel", "SAP", "ERP", "Logistics", "Procurement", "Supply Chain", "Analytical Thinking", "Teamwork"], "postedDate": "1 week ago", "benefits": "Mondelēz Global LLC is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected Veteran status, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Applicants who require accommodation to participate in the job application process may contact 847-943-5460 for assistance.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3982569113"}