{"jobTitle": "Operations Coordinator", "company": {"name": "KBR, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "<strong>Title<br/><br/></strong>Operations Coordinator<br/><br/><strong>Belong, Connect, Grow, with KBR! <br/><br/></strong><strong>Program Summary<br/><br/></strong>KBR’s Global Asset Management (GAM) group provides comprehensive manufacturing and supply chain solutions globally, serving both commercial and government clients. With a wide range of services including Government Property Management, Production Maintenance, and Equipment Tracking, GAM is dedicated to ensuring excellence in every aspect of the supply chain and asset management process. This commitment ensures the seamless operation of our clients' enterprises across diverse locations.<br/><br/><strong>Job Summary<br/><br/></strong>The Asset Management Operations Coordinator is responsible for handling routine assignments and developing essential job skills related to Government and Honeywell Special Test Equipment (STE), Special Tooling, and Equipment Asset management. This role includes actively implementing asset management policies and procedures to maintain approved business systems that comply with government, customer, and contractual requirements, as well as Aerospace policies and procedures. The operations coordinator will adhere to specific contract objectives, deliverables, outcome metrics, and monthly KPI performance, which include receipts, issues, transfers, physical inventory, identification, records, and close-outs. You will also receive property against receiving documents, issue assets/materials as requested, document traceability characteristics, support property audits, and collaborate with management on special projects. If you are ready to contribute to our team's success and thrive in a dynamic environment, apply today!<br/><br/><strong>Roles And Responsibilities<br/><br/></strong><ul><li>Carry out routine assignments and build core job skills with Government and Honeywell Special Test Equipment.</li><li>Assist with DCMA audits, internal network audits, customer audits, and the scheduling and tracking of physical inventories, support property objectives, work plans, and delivery schedules.</li><li>Facilitate and ensure execution of corrective action and CAMP plans.</li><li>Maintain records of government and engineering property, collect data and create metrics, process cost and no-cost transfers, plan and coordinate physical inventories, and support internal and external customers with audits and information requests.</li><li>Aid in tracking and compiling metric data and Property Management Self-Assessment data related to asset management. </li><li>Support cross functional teams to ensure adherence to Asset/Material Compliance Practices, Policies and Standards.</li><li>Collaborate with site stakeholders to implement asset process changes affecting cross-functional groups, coordinate daily logistical operations, inventory control, and ensure accurate inventory and timely delivery of goods.</li><li>Organize and expedite the flow of material, parts and assemblies.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Must be a US Citizen</li><li>Bachelor’s Degree, along with 1 year of relevant experience.</li><ul><li>In lieu of formal education, 5 years of directly related experience.</li></ul><li>Ability to obtain National Property Management Certification within 1 year of employment.<br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Experience with SAP </li><li>Knowledge and understanding of Configuration of Bill of Material (BOM)<br/><br/></li></ul>California: $33.69/Hour - Exempt position<br/><br/><strong>KBR Benefits<br/><br/></strong>KBR offers a selection of competitive lifestyle benefits which could include 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.<br/><br/><strong>Inclusion and Diversity at KBR <br/><br/></strong>At KBR, we are passionate about our people, sustainability, and our Zero Harm culture. These inform all that we do and are at the heart of our commitment to, and ongoing journey toward being a more inclusive and diverse company. That commitment is central to our team of team’s philosophy and fosters an environment of real collaboration across cultures and locations. Our individual differences and perspectives bring enhanced value to our teams and help us develop solutions for the most challenging problems. We understand that by embracing those differences and working together, we are more innovative, more resilient.<br/><br/>KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.<br/><br/><strong>R2091886</strong>", "responsibilities": "<ul><li>Carry out routine assignments and build core job skills with Government and Honeywell Special Test Equipment.</li><li>Assist with DCMA audits, internal network audits, customer audits, and the scheduling and tracking of physical inventories, support property objectives, work plans, and delivery schedules.</li><li>Facilitate and ensure execution of corrective action and CAMP plans.</li><li>Maintain records of government and engineering property, collect data and create metrics, process cost and no-cost transfers, plan and coordinate physical inventories, and support internal and external customers with audits and information requests.</li><li>Aid in tracking and compiling metric data and Property Management Self-Assessment data related to asset management. </li><li>Support cross functional teams to ensure adherence to Asset/Material Compliance Practices, Policies and Standards.</li><li>Collaborate with site stakeholders to implement asset process changes affecting cross-functional groups, coordinate daily logistical operations, inventory control, and ensure accurate inventory and timely delivery of goods.</li><li>Organize and expedite the flow of material, parts and assemblies.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Must be a US Citizen</li><li>Bachelor’s Degree, along with 1 year of relevant experience.</li><ul><li>In lieu of formal education, 5 years of directly related experience.</li></ul><li>Ability to obtain National Property Management Certification within 1 year of employment.<br/></li></ul>", "preferred": "<ul><li>Experience with SAP </li><li>Knowledge and understanding of Configuration of Bill of Material (BOM)<br/><br/></li></ul>"}, "skills": ["SAP", "Government Property Management", "Production Maintenance", "Equipment Tracking", "Asset Management", "DCMA audits", "internal network audits", "customer audits", "physical inventories", "corrective action", "CAMP plans", "Cost and No-Cost Transfers", "Inventory Control", "Logistical Operations", "Material Flow", "Parts and Assemblies", "National Property Management Certification"], "postedDate": "4 weeks ago", "benefits": "KBR offers a selection of competitive lifestyle benefits which could include 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982521890"}