{"jobTitle": "Director of Space & Assortment Planning", "company": {"name": "Northgate Market", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "industry": "Retail Groceries", "jobFunction": "Business Development and Sales", "description": "Our first store opened on January 2nd, 1980, in Anaheim, CA and since then we have grown to 40+ stores in 4 counties: Los Angeles, Orange, San Diego, and the Inland Empire. We offer our customers a full-service supermarket with a large meat department, bakery, tortilleria and prepared foods in addition to a sizeable section of domestic and imported Latin American grocery goods to provide a Mexican homeland experience. We are always looking for great people to join as a member of the Northgate Family. We look for enthusiastic people with the potential and desire to grow with us. We strive to create a great work environment that is positive and fun; where people have meaningful work, where individuals have a sense of belonging and feel appreciated, valued and secure. If you are passionate about food, are customer focused, team oriented, and want to be a part of our family, we invite you to apply! We offer flexible schedules, opportunities for growth, and 20% discount for you and one other family member in your household for most purchases made at Northgate. To learn more, please visit www.northgatemarkets.com<br/><br/><strong>JOB SUMMARY: </strong>Create and own the company strategy surrounding effective space planning and ongoing management. Work collaboratively with Category Sales Teams to determine best shelf space and item assortment strategies that support Northgate’s go-to-market strategy. Builds and manages a team of analysts and field execution teams to execute these plans on a timely basis. Works with Fresh Teams to determine item and category efficiencies and related space allocations to provide consultation on best utilization of space and effectiveness. Champions Northgate’s strategies alongside Sales Leaders with Vendor/Supplier Partners.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>The essential duties and responsibilities of this position include, but are not limited to, the following:<br/><br/><ul><li>Determines best technology systems and related processes that will deliver an optimized shelf strategy and assortment management.</li><li>Creates, owns and supports the company planogram development through developing an annual defined category review process and execution.</li><li>Works with key Vendor Partner/Suppliers to determine and quantify primary business opportunities and key drivers as they pertain to space and assortment.</li><li>Works in a highly collaborative manner with Category Sales Teams to consult on best space and assortment.</li><li>Creatively resolves unforeseen space crisis using available facilities and monetary resources.</li><li>Adaptively resolves coordination problems, meeting construction deadlines and prevents potential cost overruns.</li><li>Keeps current on industry trends and technology pertaining to space allocation and assortment management.</li><li>Develops, leads and mentors a team as a high performing unit.</li><li>Co-manages all funding and budgets to execute timely and effective resets that satisfies company and Vendor/Partner requirements.</li><li>Executes store plans through high collaboration with internal company partners including Construction, Maintenance, Field Merchandising and Operations departments.<br/><br/></li></ul><strong>Education/Experience<br/><br/></strong><strong>REQUIREMENTS AND CONDITIONS</strong><strong>:<br/><br/></strong><ul><li>College Degree preferred or 10+ year’s experience in Grocery Space Planning and Assortment Management.</li><li>Retail Management Certificate Program graduates preferred but not mandatory.<br/><br/></li></ul><strong>Certificates/Licenses/Registrations <br/><br/></strong><ul><li>(None required). <br/><br/></li></ul><strong>Skills Required<br/><br/></strong><ul><li>Demonstrated experience using planogram and assortment optimization software.</li><li>Able to interpret sales and profit analysis related to item and category performance.</li><li>Working knowledge of syndicated data and applications.</li><li>Advanced computer skills with proficiency in MS Office Applications.</li><li>Must possess demonstrated knowledge of the principles of accounting, budgeting and cost analysis.</li><li>Ability to effectively read and interpret store layout and fixture plans and specifications.</li><li>Must possess outstanding verbal and written communication skills.</li><li>Must possess demonstrated analytical skills and techniques.</li><li>Must possess keen critical and innovative thinking skills.</li><li>Must possess strong and creative organizational and decision-making skills.</li><li>Strong merchandising and planogram development skills.</li><li>Ability to adapt to changing demands, priorities, circumstances and directions.<br/><br/></li></ul><strong>Physical Demands and Work Conditions<br/><br/></strong><strong>Requirements<br/><br/></strong>The physical demands and work conditions described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Some requirements may be modified to accommodate individuals with disabilities:<br/><br/><ul><li> While performing the duties of this job, the employee is regularly required to sit, stand, and use the hands to handle, finger, or feel objects, tools or controls.</li><li> The employee must occasionally exert or lift up to 40 pounds carrying boxes of records and forms and frequently exert or lift moderate amounts of weight.</li><li> Successful performance requires specific vision abilities that include close vision and the ability to adjust focus.</li><li> The job requires the ability to travel within our marketplace regularly.<br/><br/></li></ul><strong>IMPORTANT DISCLAIMER NOTICE<br/><br/></strong>The job duties, elements, responsibilities, skills, functions, experience, educational factors, and the requirements and conditions listed in this job description are representative only and not exhaustive of the tasks that an employee may be required to perform. The Employer reserves the right to revise this job description at any time and to require employees to perform other tasks as circumstances or conditions of its business or the work environment change.<br/><br/>Truck drivers must be able to pass a standard drug test and qualify as being “drug‑free” under the legal and medical guidelines permitted by the Drug‑Free Workplace Act of 1988.” All other employees not subject to the U.S. Department of Transportation drug and alcohol rules and comparable state laws, must be able to pass a pre-employment drug test, which will not screen for non-psychoactive cannabis metabolites.<br/><br/><strong>Northgate Markets is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br/><br/><strong>Your Right to Work</strong> – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br/><br/>Northgate Markets will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the California Fair Employment and Housing Act (Ban the Box Law).", "responsibilities": "The essential duties and responsibilities of this position include, but are not limited to, the following:<br/><br/><ul><li>Determines best technology systems and related processes that will deliver an optimized shelf strategy and assortment management.</li><li>Creates, owns and supports the company planogram development through developing an annual defined category review process and execution.</li><li>Works with key Vendor Partner/Suppliers to determine and quantify primary business opportunities and key drivers as they pertain to space and assortment.</li><li>Works in a highly collaborative manner with Category Sales Teams to consult on best space and assortment.</li><li>Creatively resolves unforeseen space crisis using available facilities and monetary resources.</li><li>Adaptively resolves coordination problems, meeting construction deadlines and prevents potential cost overruns.</li><li>Keeps current on industry trends and technology pertaining to space allocation and assortment management.</li><li>Develops, leads and mentors a team as a high performing unit.</li><li>Co-manages all funding and budgets to execute timely and effective resets that satisfies company and Vendor/Partner requirements.</li><li>Executes store plans through high collaboration with internal company partners including Construction, Maintenance, Field Merchandising and Operations departments.<br/><br/></li></ul>", "qualifications": {"required": "College Degree preferred or 10+ year’s experience in Grocery Space Planning and Assortment Management.", "preferred": "Retail Management Certificate Program graduates preferred but not mandatory."}, "skills": ["Planogram", "Assortment Optimization", "Sales Analysis", "Profit Analysis", "Syndicated Data", "MS Office", "Accounting", "Budgeting", "Cost Analysis", "Store Layout", "Fixture Plans", "Communication", "Analytical Skills", "Critical Thinking", "Innovative Thinking", "Organizational Skills", "Decision-Making", "Merchandising", "Planogram Development", "Adaptability"], "postedDate": "1 month ago", "url": "https://www.linkedin.com/jobs/view/3982616171"}