{"jobTitle": "Senior Manager, Production Operations (Internal Studios)", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$160,000.00 - $610,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is building a new internal game studio to incubate and build games to maximize the player value of the Netflix Games platform. This role will be a key owner for a variety of initiatives and projects from production to business operations - we’ll work together to generate a backlog and tackle them in priority order. You will report to the Director of Development for Internal Studios and work closely with the Internal Studios program management team to execute priority initiatives on behalf of Internal Studios. This may include deep dives on specific studios or products or portfolio-wide initiatives. An example of a key initiative will be producing prototypes using pieces of technology within the Netflix ecosystem to deliver novel experiences for players, which can then be leveraged for game teams. The successful candidate will have experience managing or leading multiple products through their full lifecycle - from ideation to live service, and have a history of successfully delivering games with a focus on player value with teams of varying sizes. They will have a deep stack of ‘seen that, done that,’ and be able to bring a deep toolkit of solutions yet retain the flexibility to tailor solutions to the team’s requirements. You’ll be joining a leadership team who aspires to create ideal conditions for game developers to do their best work, and work with leaders to prioritize and execute on key projects. The Internal Studios group is a small, scrappy team with big ambitions, and an obsession to create memorable game moments that leave players telling their own stories for years to come. We’re looking for strong allies who care deeply about the experiences they create - those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. Now is an amazing time to join Netflix Game Studio as we seek to entertain our hundreds of millions of members in a really new way. Responsibilities<br/><br/><ul><li>Deliver - As part of the Internal Studios production team, this role will be accountable for building and executing a program for the production and delivery of experimental (pilot) projects that are outside the scope of other game teams.</li><li>Execute - Gather requirements, understand constraints, define acceptance criteria and be able to deliver a credible execution plan and deliver value against priority problems. Especially valuable is a desire to deliver ‘slices’ of incremental value to iterate and take on feedback. (This role will have a large number of ad-hoc projects, and will require the successful candidate to take an ill-defined problem space, define it better, come up with a plan for victory for alignment and then execute.)<br/><br/></li></ul>Requirements Ideal requirements Location Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $610,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.<br/><br/><ul><li> These projects could be Operations-based or Production-based.</li><li>Lead - The role will require the ability to establish and hold a vision, and then convince people (with both direct and indirect authority) to help on the mission.</li><li>Collaborate - This role will involve collaborating with stakeholders and teams with their own priorities. Strong communication and collaboration skills will be needed for the candidate to be successful in creating alignment and hitting the goal.</li><li>Advise - Drawing on the depth of experience from multiple cycles of game development, the successful candidate would be able to spot problem areas from far away, and advise teams and stakeholders on them. Helping the internal leadership group and development teams assess the risk and take commensurate action is a key value of this position</li><li>Advocate - As with any large organization, there are many teams with competing priorities. The successful candidate will be able to internally evaluate whether or not something needs to be prioritized, and then be able to successfully influence other teams to support, even without direct authority. However, escalation is also warranted for cases where the candidate feels that this is a fight worth fighting.</li><li>Report - Surface impediments and barriers where needed while working directly to break down hindrances for development teams.</li><li>10+ years of experience in producing multiple games for their full lifespan (prototype to sunset), ideally for PC, Mobile, and console platforms. (No seriously, you need a lot of experience and a lot of product cycles to be successful in this role)</li><li>History of successfully delivering products to players on multiple platforms and across multiple teams, including data-informed live operations and player support</li><li>Deep empathy and understanding on what it means to be a player and a developer - likely because they walk daily in those shoes.</li><li>Experience in sourcing and managing outsourcers and co-dev partners</li><li>Differing roles in production, across small and large studios and small/large projects.</li><li>Los Angeles preferred but remote OK (±3 Time Zones of California)<br/><br/></li></ul>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "<ul><li>Deliver - As part of the Internal Studios production team, this role will be accountable for building and executing a program for the production and delivery of experimental (pilot) projects that are outside the scope of other game teams.</li><li>Execute - Gather requirements, understand constraints, define acceptance criteria and be able to deliver a credible execution plan and deliver value against priority problems. Especially valuable is a desire to deliver ‘slices’ of incremental value to iterate and take on feedback. (This role will have a large number of ad-hoc projects, and will require the successful candidate to take an ill-defined problem space, define it better, come up with a plan for victory for alignment and then execute.)<br/><br/></li></ul>", "qualifications": {"required": "10+ years of experience in producing multiple games for their full lifespan (prototype to sunset), ideally for PC, Mobile, and console platforms. (No seriously, you need a lot of experience and a lot of product cycles to be successful in this role)\nHistory of successfully delivering products to players on multiple platforms and across multiple teams, including data-informed live operations and player support\nDeep empathy and understanding on what it means to be a player and a developer - likely because they walk daily in those shoes.\nExperience in sourcing and managing outsourcers and co-dev partners\nDiffering roles in production, across small and large studios and small/large projects.", "preferred": "Los Angeles preferred but remote OK (±3 Time Zones of California)"}, "skills": [], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix has a unique culture and environment. Learn more here.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982464609"}