{"jobTitle": "Sales Associate, Part-Time - Santa Monica", "company": {"name": "Reformation", "industry": "Technology, Information and Internet"}, "location": "Santa Monica, CA", "jobType": "Part-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Founded in 2009, Reformation is a revolutionary lifestyle brand that proves fashion and sustainability can coexist. We combine stylish, vintage-inspired designs with sustainable practices, releasing limited-edition collections for individuals who want to look beautiful and live sustainably. Setting an example for the industry, Reformation remains at the forefront of innovation in sustainable fashion—running the first sustainable factory in Los Angeles, using deadstock and eco fabrics, tracking and sharing the environmental impact of every product, and investing in the people who make this revolution possible. The brand has also established itself as a pioneer in retail innovation, developing an in-store tech concept that brings the best of its online experience to its physical doors.<br/><br/>We are a future focused organization committed to the belief that the problems facing our planet and society can be solved through innovation, common sense and education. Being naked is the #1 most sustainable option. We're #2.<br/><br/>Here at Ref, we put people first. We know that you can't innovate and do cool stuff without having everyone on board. So we work to create a culture where everyone feels like they belong and where their voices are truly valued. We build an inclusive culture together and make a real impact along the way.<br/><br/><strong>Sales Associate:<br/><br/></strong>No position at Reformation is about the status quo, every team member is passionate about building a company rooted in excellence. Obsessed with customers and sustainability we use tech to create a unique interaction between our customers, employees, and the Reformation brand. The Associate will execute all efforts required to achieve individual sales goals.<br/><br/>Reporting to the Store Manager, essential responsibilities include but are not limited to:<br/><br/><strong>What You'll Do:<br/><br/></strong><ul><li>Consistently meet and exceed sales goals.</li><li>Assist in clientele generation through customer engagement.</li><li>Contribute to an in-store experience for customers that both surprises and delights them. </li><li>Deliver and foster a culture of an excellent client experience through a customer first mindset to build long term loyal client relationships.</li><li>Deliver an elevated client experience acting as a brand ambassador - embody brand values, engage customers on the brand and share the stories of Reformation with a focus on educating on sustainability. </li><li>Maintain extraordinary customer experience feedback and scoring on service evaluation through NPS.</li><li>Understand the need for consistent inventory accuracy and controls in store. </li><li>Contribute to Loss Prevention in all areas of the business.</li><li>Uphold time and attendance policy.</li><li>Ensure the selling floor reflects the brand and concept standards at all times.</li><li>Share your deep knowledge about our product with genuine enthusiasm.</li><li>Communicate product feedback based on customer feedback so we can continuously make our product and merchandising better.</li><li>Help ensure that the store environment is inspiring and our product is easily accessible.</li><li>Understand the core values and culture of Reformation and reflect these in all efforts.</li><li>Maintain and uphold a professional, healthy, and productive work environment. <br/><br/></li></ul><strong>What you'll bring:<br/><br/></strong><ul><li>Experience working with a sales or retail organization and/or operationally intensive business.</li><li>Ability to work in a fast-paced setting.</li><li>Strong interpersonal skills and the ability to interact effectively with diverse personalities </li><li>Driven approach to take on new challenges with the self-motivation for your work and career <br/><br/></li></ul>Part Time, Hourly<br/><br/><ul><li>Available to work a minimum of 20 hours per week</li><li>Available to work a minimum of 3 days per week, weekends included</li><li>Able to work flexible schedule (days, nights, weekends, &amp; holidays if required to meet the needs of the business)<br/><br/></li></ul><em>The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status<br/><br/></em><em>Notice at Collection- Privacy Notice for California Candidates</em>", "responsibilities": "Consistently meet and exceed sales goals. Assist in clientele generation through customer engagement. Contribute to an in-store experience for customers that both surprises and delights them. Deliver and foster a culture of an excellent client experience through a customer first mindset to build long term loyal client relationships. Deliver an elevated client experience acting as a brand ambassador - embody brand values, engage customers on the brand and share the stories of Reformation with a focus on educating on sustainability. Maintain extraordinary customer experience feedback and scoring on service evaluation through NPS. Understand the need for consistent inventory accuracy and controls in store. Contribute to Loss Prevention in all areas of the business. Uphold time and attendance policy. Ensure the selling floor reflects the brand and concept standards at all times. Share your deep knowledge about our product with genuine enthusiasm. Communicate product feedback based on customer feedback so we can continuously make our product and merchandising better. Help ensure that the store environment is inspiring and our product is easily accessible. Understand the core values and culture of Reformation and reflect these in all efforts. Maintain and uphold a professional, healthy, and productive work environment.", "qualifications": {"required": "Experience working with a sales or retail organization and/or operationally intensive business. Ability to work in a fast-paced setting. Strong interpersonal skills and the ability to interact effectively with diverse personalities Driven approach to take on new challenges with the self-motivation for your work and career"}, "skills": [], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982642054"}