{"jobTitle": "Buyer, Sr.", "company": {"name": "AeroVironment", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Defense and Space Manufacturing", "description": "The Sr. Buyer performs procurement duties related to the purchasing of services, supplies and equipment in accordance to policies and regulations. In this role, one reviews and analyzes purchase requisitions as well as coordinates purchasing activities with manufacturing, planning and engineering departments to acquire inventory in a cost effective and timely manner. The Senior Buyer will process purchase requisitions, purchase change orders and requests for quotes to suppliers. Participates in maximizing the procurement teams' changes, part parameters; quote table maintenance, supplier database information, error report analysis, and part number/supplier code information.<br/><br/><strong>Position Responsibilities<br/><br/></strong><ul><li>Monitors the cost, schedule and scope of assigned subcontracts to negotiate terms and pricing for increasingly larger, complex and difficult materials &amp; services.</li><li>Develops new supply sources where vendors and suppliers are no longer competitive</li><li>Manages and develops supplier relationships to reduce costs, improve &amp; maintain quality, and ensure on-time delivery of purchased materials</li><li>Negotiates terms and pricing for increasingly larger, complex and difficult materials and services. Writes and completes RFQ/RFP package</li><li>Work with finance to resolve Accounting discrepancies in a timely manner, Work on procurement/material projects as assigned by the Supply Chain Manager</li><li>Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors.</li><li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results</li><li>Determines methods and procedures on new assignments and may coordinate activities of other personnel (Team Lead).</li><li>Other duties as assigned<br/><br/></li></ul><strong>Basic Qualifications (Required Skills &amp; Experience)<br/><br/></strong><ul><li>Bachelor's degree in Finance, Business, or Accounting or APICS or ISM certification is required or equivalent combination of experience and education</li><li>Certification for purchasing or supply chain professionals required</li><li>8 - 12 years of relevant experience</li><li>Proven experience in various processes as it relates to assigned commodity, i.e. CNC, injection molding, etc.</li><li>Has technical knowledge regarding manufacturing processes of an assigned commodity and demonstrates experience with purchasing practices and processes in manufacturing and engineering environments</li><li>Possesses understanding of commercial and FAR/DFAR Procurement rules, regulations and laws</li><li>Ability to negotiate terms and pricing for materials and services is critical</li><li>Proven understanding and intermediate usage of computerized MRP / ERP systems</li><li>Demonstrates effective problem-solving, mathematical, time management, interpersonal and communication skills</li><li>Proficient in MS Office Suite (Word, Access, PowerPoint, Excel)<br/><br/></li></ul><strong>Preferred Qualifications (Desired Skills &amp; Experience)<br/><br/></strong><ul><li>Oracle experience strongly preferred</li><li>APICS or ISM certification preferred</li><li>Demonstrates ability to read and interpret technical drawings / specifications.</li><li>Has effective problem-solving, mathematical, time management, interpersonal and communication skills; Demonstrates proficiency using MS Office Suite (Word, Access, PowerPoint, Excel)</li><li>Having wide-ranging experience, uses professional concepts and company objectives to resolve complex issues in creative and effective ways</li><li>Highly organized and strong coordination skills to meet deadlines</li><li>Able to excel in a fast-paced, deadline-driven environment, where small teams share a broad variety of duties</li><li>Displays strong initiative and drive to accomplish goals and meet company objectives</li><li>Takes ownership and responsibility for current and past work products</li><li>Is committed to learning from mistakes and driven to improve and enhance performance of oneself, others, and the company<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Ability to work in an office environment (Constant)</li><li>Regularly required to, stand, sit; talk, hear, and use hands and fingers to operate a computer and telephone keyboard<br/><br/></li></ul><strong>The Salary Range For This Role Is<br/><br/></strong>$88,000 - $124,740<br/><br/>AeroVironment considers several factors when extending an offer, including but not limited to, the location, the role and associated responsibilities, a candidate’s work experience, education/training, and key skills.<br/><br/><strong>ITAR Requirement<br/><br/></strong><em>T</em>his position requires access to information that is subject to compliance with the International Traffic Arms Regulations (“ITAR”) and/or the Export Administration Regulations (“EAR”). In order to comply with the requirements of the ITAR and/or the EAR, applicants must qualify as a U.S. person under the ITAR and the EAR, or a person to be approved for an export license by the governing agency whose technology comes under its jurisdiction. Please understand that any job offer that requires approval of an export license will be conditional on AeroVironment’s determination that it will be able to obtain an export license in a time frame consistent with AeroVironment’s business requirements. A “U.S. person” according to the ITAR definition is a U.S. citizen, U.S. lawful permanent resident (green card holder), or protected individual such as a refugee or asylee. See 22 CFR<br/><br/><ul><li>120.15. Some positions will require current U.S. Citizenship due to contract requirements. <br/><br/></li></ul><strong>Benefits</strong>: AV offers an excellent benefits package including medical, dental vision, 401K with company matching, a 9/80 work schedule and a paid holiday shutdown. For more information about our company benefit offerings please visit: http://www.avinc.com/myavbenefits.<br/><br/>We also encourage you to review our company website at http://www.avinc.com to learn more about us.<br/><br/>Principals only need apply. NO agencies please.<br/><br/><strong>Who We Are<br/><br/></strong>Based in California, AeroVironment (AVAV) is a global leader in unmanned aircraft systems (UAS) and tactical missile systems. Founded in 1971 by celebrated physicist and engineer, Dr. Paul MacCready, we’ve been at the leading edge of technical innovation for more than 45 years. Be a part of the team that developed the world’s most widely used military drones and created the first submarine-launched reconnaissance drone, and has seven innovative vehicles that are part of the Smithsonian Institution’s permanent collection in Washington, DC.<br/><br/>Join us today in developing the next generation of small UAS and tactical missile systems that will deliver more actionable intelligence to our customers so they can proceed with certainty – and succeed.<br/><br/><strong>What We Do<br/><br/></strong>Building on a history of technological innovation, AeroVironment designs, develops, produces, and supports an advanced portfolio of unmanned aircraft systems (UAS) and tactical missile systems. Agencies of the U.S. Department of Defense and allied military services use the company’s hand-launched UAS to provide situational awareness to tactical operating units through real-time, airborne reconnaissance, surveillance, and target acquisition.<br/><br/><em>We are proud to be an EEO/AA Equal Opportunity Employer, including disability/veterans. AeroVironment, Inc. is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Qualified applicants will receive fair and impartial consideration without regard to race, sex, color, religion, national origin, age, disability, protected veteran status, genetic data, sexual orientation, gender identity or other legally protected status.<br/><br/></em><strong>ITAR</strong>", "responsibilities": "<ul><li>Monitors the cost, schedule and scope of assigned subcontracts to negotiate terms and pricing for increasingly larger, complex and difficult materials &amp; services.</li><li>Develops new supply sources where vendors and suppliers are no longer competitive</li><li>Manages and develops supplier relationships to reduce costs, improve &amp; maintain quality, and ensure on-time delivery of purchased materials</li><li>Negotiates terms and pricing for increasingly larger, complex and difficult materials and services. Writes and completes RFQ/RFP package</li><li>Work with finance to resolve Accounting discrepancies in a timely manner, Work on procurement/material projects as assigned by the Supply Chain Manager</li><li>Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors.</li><li>Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results</li><li>Determines methods and procedures on new assignments and may coordinate activities of other personnel (Team Lead).</li><li>Other duties as assigned<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Finance, Business, or Accounting or APICS or ISM certification is required or equivalent combination of experience and education\nCertification for purchasing or supply chain professionals required\n8 - 12 years of relevant experience\nProven experience in various processes as it relates to assigned commodity, i.e. CNC, injection molding, etc.\nHas technical knowledge regarding manufacturing processes of an assigned commodity and demonstrates experience with purchasing practices and processes in manufacturing and engineering environments\nPossesses understanding of commercial and FAR/DFAR Procurement rules, regulations and laws\nAbility to negotiate terms and pricing for materials and services is critical\nProven understanding and intermediate usage of computerized MRP / ERP systems\nDemonstrates effective problem-solving, mathematical, time management, interpersonal and communication skills\nProficient in MS Office Suite (Word, Access, PowerPoint, Excel)<br/><br/>", "preferred": "Oracle experience strongly preferred\nAPICS or ISM certification preferred\nDemonstrates ability to read and interpret technical drawings / specifications.\nHas effective problem-solving, mathematical, time management, interpersonal and communication skills; Demonstrates proficiency using MS Office Suite (Word, Access, PowerPoint, Excel)\nHaving wide-ranging experience, uses professional concepts and company objectives to resolve complex issues in creative and effective ways\nHighly organized and strong coordination skills to meet deadlines\nAble to excel in a fast-paced, deadline-driven environment, where small teams share a broad variety of duties\nDisplays strong initiative and drive to accomplish goals and meet company objectives\nTakes ownership and responsibility for current and past work products\nIs committed to learning from mistakes and driven to improve and enhance performance of oneself, others, and the company<br/><br/>"}, "skills": ["MRP", "ERP", "Negotiation", "Procurement", "Supply Chain", "Purchasing", "FAR", "DFAR", "Microsoft Office", "Excel", "PowerPoint", "Word", "Access", "Oracle"], "postedDate": "1 week ago", "benefits": "AV offers an excellent benefits package including medical, dental vision, 401K with company matching, a 9/80 work schedule and a paid holiday shutdown. For more information about our company benefit offerings please visit: http://www.avinc.com/myavbenefits.", "remoteWork": "No", "salary": {"amount": "88,000.00 - 124,740.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3982534635"}