{"jobTitle": "VP, Marketing", "company": {"name": "ghd", "industry": "Retail", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$225,000.00/yr - $250,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Retail", "description": "Iconic British brand ghd, is a global leader in high end professional hair styling tools and the UK’s #1 recommended styling brand. Loved by stylists and consumers, loved by press and influencers, and loved by the people that work for the brand! Merging science and innovation, with luxury beauty and style; ghd pioneers new technologies and beautiful designs to create the most technically advanced hair tools in the world. A trusted and loved brand, ghd sells over 3 million tools every year and 5 iconic ghd products are sold every minute. The award-winning ghd tools are used by 200,000 stylists around the world and sold in 30+ countries and more than 45,000 premium salons. Renowned for their professionally endorsed game changing innovation and superior performance, at ghd we are on a mission to transform the lives of women via the power of a good hair day!", "responsibilities": "● Drive Brand Awareness, Reach, and Product Penetration.\n● Build and develop a high-performing marketing team, fostering a culture of collaboration, courage, creativity, connection, and commitment to achieve business objectives.\n● Create and implement strategic marketing plans to drive profitability, increase brand awareness, styler penetration and market share, while maintaining brand image consistency globally.\n● Be the brand leader and category management champion with an always on strategy and implementation on flat irons and wet-to-dry.\n● Be the brand connection for the interactions with Global Senior Management.\n● Develop and execute ghd’s North America brand strategy across premium retail, professional, social media/influencers, and digital channels, ensuring consistency and alignment with global brand standards. Drive brand-building initiatives and performance marketing strategies, focusing on media planning, optimization across all the funnel: from awareness to conversion with a focus on optimizing KPI metrics and ROI.\n● Develop and manage performance marketing campaigns across various digital platforms (e.g., Google Ads, Facebook Ads, Instagram Ads, TikTok Ads)\n● Implement and oversee robust analytics frameworks to track marketing performance and consumer purchase funnel behavior using these insights to continuously refine and improve marketing efforts.\n● Collaborate with key functional partners to develop strategic initiatives aimed at driving sales growth – particularly with performance marketing and ecommerce to drive reach and efficiencies. Ensure the management of the media planning agency is a joint responsibility.\n● Represent the brand cross-functionally and in North America.\n● Plan, execute and measure success - within the global framework - the brand and product campaigns, leading a 360 degree go to market including: retailers onboarding, channel roll-out, demonstration, performance marketing, VM, etc… Always ensuring excellence in execution.\n● Provide detailed directions for each channel and its associated assets, including timing, key messages, and consistency in messaging\n● Lead research initiatives to gather key industry, consumer, and cultural insights, applying findings to inform strategic planning and campaign creation processes.\n● Establish key performance metrics for marketing programs, providing regular reports, sentiment analysis, and in-depth post-campaign performance analysis to derive actionable insights for future investments.\n● Ensure ghd brand identity, messaging, and tone of voice are consistently represented across all marketing touchpoints, aligning with global brand guidelines and regional market dynamics.\n● Drive brand-building initiatives and performance marketing strategies, focusing on media planning, optimization across all the funnel: from awareness to conversion with clear metrics on CR and ROI.\n● Direct and oversee agency relationships, particularly in media planning and execution, ensuring effective performance evaluation and alignment with strategic goals.\n● Evaluate existing agency partnerships for effectiveness and alignment with business goals; identify gaps in capabilities and performance. Source and onboard new agencies as needed to meet evolving business requirements. Manage smooth transitions between agencies to ensure continuity of marketing efforts and minimal disruption to ongoing campaigns.", "qualifications": {"required": "12+ years of marketing leadership experience at an agency or high-growth consumer brand with strong knowledge in creating brand awareness, delivering operational excellence", "preferred": "Mastery in social media, influencer marketing and performance marketing (e.g. media planning, asset optimization and KPIs measurement) with ability to prioritize media spend based on priorities."}, "skills": ["Strategic Leadership", "Team Management", "Brand Awareness", "Performance Marketing", "Market Analysis", "Agency Management", "Digital Marketing", "Ecommerce", "CRM", "Budgeting", "P&L Management"], "postedDate": "1 month ago", "applicationDeadline": "No longer accepting applications", "benefits": "● Medical, Dental and Vision Insurance Premium is covered 100% by ghd North America for employees and 100% for dependents\n● Life, LTD (Long term disability) and AD&D (Accidental Death & Dismemberment) is covered 100% by GHD North America\n● Personal days on your birthday and work anniversary\n● Office closed Christmas-New Year\n● Hybrid Work Model\n● Summer Fridays\n● Wellness/Fitness Reimbursement\n● Cell phone Reimbursement\n● Gratis and 50% off ghd product discount and 30% off all Wella and OPI products\n● Quarterly employee activities to foster a company values\n● Team participation in charity initiatives to benefit Breast Cancer Awareness, Research and Recovery", "remoteWork": "Hybrid (3 days in office, 2 days WFH)", "url": "https://www.linkedin.com/jobs/view/3982271612"}