{"jobTitle": "Hollister Co. - Stock Associate, Los Cerritos", "company": {"name": "Abercrombie & Fitch Co.", "industry": "Retail and Apparel & Fashion", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Customer Service", "industry": "Retail and Apparel & Fashion", "description": "Abercrombie & Fitch Co. (NYSE: ANF) is a leading, global specialty retailer of apparel and accessories for men, women and kids through five renowned brands. The iconic Abercrombie & Fitch brand was born in 1892 and aims to make every day feel as exceptional as the start of a long weekend. abercrombie kids sees the world through kids’ eyes, where play is life and every day is an opportunity to be anything and better anything. The Hollister brand believes in liberating the spirit of an endless summer inside everyone and making teens feel celebrated and comfortable in their own skin. Gilly Hicks, offering intimates, loungewear and sleepwear, is designed to invite everyone to embrace who they are underneath it all. Social Tourist, the creative vision of Hollister and social media personalities, Dixie and Charli D’Amelio, offers trend forward apparel that allows teens to experiment with their style, while exploring the duality of who they are both on social media and in real life.<br/><br/>The brands share a commitment to offering products of enduring quality and exceptional comfort that allow consumers around the world to express their own individuality and style. Abercrombie & Fitch Co. operates approximately 730 stores under these brands across North America, Europe, Asia and the Middle East, as well as the e-commerce sites www.abercrombie.com, www.abercrombiekids.com, www.hollisterco.com, www.gillyhicks.com, and www.socialtourist.com.<br/><br/><strong>Job Description<br/><br/></strong>The Stock Associate maintains effectiveness of merchandise flow, filling and presentation standards throughout the store and stock. Stock Associates typically work three to four shifts per week on average, each shift being about four to five hours, but may work more or less depending on the time of year and needs of the business. Stock Associates may be required to work most Saturdays and some Sundays, and during the weeks of peak holiday seasons.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Customer Experience</li><li>Store Presentation and Sales Floor</li><li>Stockroom</li><li>Communication</li><li>Asset Protection and Shrink</li><li>Policies and Procedures</li><li>Training and Development <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>What it Takes<br/><br/></strong><ul><li>Adaptability / Flexibility</li><li>Applied Learning</li><li>Attention to Detail</li><li>Multi-Tasking</li><li>Work Ethic<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong>What You’ll Get<br/><br/></strong>As an Abercrombie & Fitch Co. (A&F Co.) associate, you’ll be eligible to participate in a variety of benefit programs designed to fit you and your lifestyle. A&amp;F is committed to providing simple, competitive, and comprehensive benefits that align with our Company’s culture and values, but most importantly – with you!<br/><br/><ul><li>Merchandise Discount</li><li>Flexible Schedule</li><li>Opportunities for Career Advancement</li><li>Opportunity to Become a Brand Affiliate</li><li>Training and Development</li><li>A Global Team of People Who'll Celebrate you for Being YOU<br/><br/></li></ul><strong>The starting rate for this position is $15.50 per hour (i.e., the recruiting pay range for this position is $15.50 - $15.50 per hour). The starting rate and range may be modified in the future.<br/><br/></strong>SEE WHAT IT’S LIKE TO #WORKATHCO - FOLLOW US ON INSTAGRAM @LIFEATANF<br/><br/>Abercrombie & Fitch Co. is an Equal Opportunity/Affirmative Action employer", "responsibilities": "The Stock Associate maintains effectiveness of merchandise flow, filling and presentation standards throughout the store and stock. Stock Associates typically work three to four shifts per week on average, each shift being about four to five hours, but may work more or less depending on the time of year and needs of the business. Stock Associates may be required to work most Saturdays and some Sundays, and during the weeks of peak holiday seasons.", "qualifications": {"required": "Adaptability / Flexibility, Applied Learning, Attention to Detail, Multi-Tasking, Work Ethic"}, "skills": [], "postedDate": "1 week ago", "benefits": "Merchandise Discount, Flexible Schedule, Opportunities for Career Advancement, Opportunity to Become a Brand Affiliate, Training and Development, A Global Team of People Who'll Celebrate you for Being YOU", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982187426"}