{"jobTitle": "Executive Assistant, Amazon Kids+", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00/yr - $107,100.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development", "description": "<strong>Description<br/><br/></strong>Are you interested in kid’s products and looking to join the exciting world of Amazon Devices? Do you strive to be on a team of pioneers who are working hard to bring new devices to surprise and delight our customers? If so, the Amazon Kids &amp; Kids+ team is looking for you! We are seeking an individual who has great attention to detail, solid organizational skills, and the ability to meet tight deadlines while juggling multiple critical requests across teams. The ideal candidate will be an experienced planner with the demonstrated ability to respond effectively and efficiently while maintaining flexibility, composure.<br/><br/>The individual in this role must understand business priorities, demonstrate the ability to proactively anticipate needs and drive improvements to build capacity for the leadership team. A high level of integrity and discretion in handling confidential information as well as professionalism in dealing with senior executives inside and outside of the company is critical. The successful candidate will possess the ability to complete complex tasks quickly with little guidance, react with appropriate urgency to situations that require a quick turnaround, and take effective action without having to know the whole picture. The ideal candidate must be able to work successfully in a team environment and build effective working relationships inside and outside the group.<br/><br/>Key job responsibilities<br/><br/>Management of complex calendar and scheduling to support teams in multiple locations in multiple time zones<br/><br/>Ability to look around corners and anticipate needs or areas for improvement<br/><br/>Act as a trusted business partner to Director and management<br/><br/>Manage domestic and international travel and expense reports.<br/><br/>Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)<br/><br/>Management of team space, including moves and re-configurations<br/><br/>Work closely with the leadership team, recruiting and other Executive Assistants to provide support to the organization<br/><br/>Have fun at work and help others do the same<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 2+ years of senior level leadership support, or 1+ years of Amazon experience</li><li> High school or equivalent diploma</li><li> Experience with Microsoft Office products and applications</li><li> Experience with executive level calendar management<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars</li><li> Experience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2707911", "responsibilities": "Management of complex calendar and scheduling to support teams in multiple locations in multiple time zones<br/><br/>Ability to look around corners and anticipate needs or areas for improvement<br/><br/>Act as a trusted business partner to Director and management<br/><br/>Manage domestic and international travel and expense reports.<br/><br/>Organize, execute, and assist with team activities (staff meeting agendas, all-hands meetings, off-sites, and team social events)<br/><br/>Management of team space, including moves and re-configurations<br/><br/>Work closely with the leadership team, recruiting and other Executive Assistants to provide support to the organization<br/><br/>Have fun at work and help others do the same", "qualifications": {"required": "2+ years of senior level leadership support, or 1+ years of Amazon experience\nHigh school or equivalent diploma\nExperience with Microsoft Office products and applications\nExperience with executive level calendar management", "preferred": "Experience in a fast-paced, high-tech company\nExperience managing multiple calendars\nExperience prioritizing and handling multiple assignments at any given time while maintaining commitment to deadlines"}, "skills": ["Microsoft Office", "Calendar Management", "Travel Management", "Expense Reports", "Team Coordination", "Executive Support"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982902635"}