{"jobTitle": "Psychiatric Mental Health Nurse Practitioner (PMHNP) - Remote", "company": {"name": "RemoteWorker CA", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Job Title: Remote Psychiatric Mental Health Nurse Practitioner (PMHNP)<br/><br/>Job Summary<br/><br/>We are seeking a skilled and compassionate Remote Psychiatric Mental Health Nurse Practitioner (PMHNP) to join our healthcare team. The PMHNP will be responsible for providing remote psychiatric evaluations, medication management, and therapy to patients with mental health disorders. The ideal candidate should have excellent communication skills, be able to work independently and collaboratively, and have a passion for helping patients achieve their mental health goals.<br/><br/>Key Responsibilities<br/><br/><ul><li> Conduct remote psychiatric evaluations for patients with mental health disorders</li><li> Prescribe and manage medications</li><li> Provide individual and group therapy sessions</li><li> Collaborate with other healthcare professionals, including physicians, therapists, and social workers</li><li> Maintain accurate and up-to-date medical records</li><li> Participate in ongoing professional development and education<br/><br/></li></ul>Requirements<br/><br/>Requirements:<br/><br/><ul><li> Active and unrestricted PMHNP license</li><li> Master's or Doctoral degree in nursing</li><li> Ability to work independently and as part of a team</li><li> Excellent communication and interpersonal skills</li><li> Strong organizational and time management abilities</li><li> Experience with telehealth or remote healthcare preferred<br/><br/></li></ul>Benefits<br/><br/>We offer flex scheduling (set your own availability), guaranteed payment for last-minute cancellations and no-shows.", "responsibilities": "Conduct remote psychiatric evaluations for patients with mental health disorders, Prescribe and manage medications, Provide individual and group therapy sessions, Collaborate with other healthcare professionals, including physicians, therapists, and social workers, Maintain accurate and up-to-date medical records, Participate in ongoing professional development and education", "qualifications": {"required": "Active and unrestricted PMHNP license, Master's or Doctoral degree in nursing, Ability to work independently and as part of a team, Excellent communication and interpersonal skills, Strong organizational and time management abilities, Experience with telehealth or remote healthcare preferred"}, "skills": [], "postedDate": "1 month ago", "benefits": "We offer flex scheduling (set your own availability), guaranteed payment for last-minute cancellations and no-shows.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982469081"}