{"jobTitle": "Workplace Operations Specialist", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00 - 190,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. As we expand globally, we continue to look for the best and brightest talent to help us scale. Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team. We are looking for a Workplace Operations Specialist who is organized, flexible, and enthusiastic for both the practical and creative elements of strategic Workplace Operations. This position reports to the Workplace Operations Manager and provides the opportunity to scale and shape Netflix’s workplace operations while working collaboratively with stakeholders from across the company. A successful candidate will be passionate, self-motivated, proactive, quick-thinking, flexible, and able to pivot when necessary. The ability to juggle multiple, diverse responsibilities with a strong emphasis on organization and unwavering attention to detail is always required. This is a demanding and fast-moving position that requires someone who is proactive, a positive thinker, and able to exercise good judgment and communication. Responsibilities:<br/><br/><ul><li>Supports the team in executing all Preventative Maintenance procedures on time and implements best practice processes to increase efficiency.</li><li>Manages daily work requests and maintains corrective/preventative maintenance work records for internal and third-party vendors across various locations.</li><li>Provides prompt responses to requests and issues from facility occupants, managing work order maintenance tickets efficiently.</li><li>Conducts regular facility inspections and audits to ensure compliance and optimal functioning.</li><li>Supports the integration and operation of network systems such as HVAC automation, Fire Life Safety (FLS), and additional integrated systems.</li><li>Assists in resolving critical infrastructure issues, managing day-to-day operations during disruptions, assessing root causes, and developing remediation methods.</li><li>Ensures exceptional onboarding experiences for new hires, assisting with training, vendor scheduling, and daily task execution.</li><li>Participates in new design construction walks, new system training, documentation, and collaborative efforts between Workplace Operations and Design and Construction teams.</li><li>Develops good partner relationships and addresses service needs.</li><li>Assists in implementing site-specific programs, procedures, and systems to ensure regulatory compliance and the protection of employees and the environment.</li><li>Collaborates with the Global Environmental Health and Safety team to ensure adherence to health and safety standards and industry codes.</li><li>Works closely with functional partners, assisting with Mechanical, Electrical, and Plumbing tasks/projects, including Security, Events, Audio Visual Team, IT Team, Food &amp; Beverage Team, Moves &amp; Add’s Team, Logistics, Transportation, Design &amp; Construction, and Workplace Experience Teams.</li><li>Takes the lead on self-initiated projects and generates comprehensive reports.</li><li>Produces Building/Energy Management System reports, highlighting real-time and historical trends such as temperature, humidity, and system status to identify anomalies.</li><li>Identifies problem trends and ensures troubleshooting efforts to determine root causes.</li><li>Performs other duties as assigned or requested by the Operations Manager.</li><li>Provides and processes Tenant Alteration Requests as per Landlord requirements.</li><li>Works with coordinators to assign Zendesk tickets to technicians</li><li>Ability to manage schedule and shift changes for technicians.</li><li>This role is based in the Los Angeles, Hollywood, and Burbank areas. It will require you to travel to different locations as part of your responsibilities. We're looking for someone who is able and willing to commute to various sites as needed for this role.<br/><br/></li></ul>Qualifications / Requirements:<br/><br/><ul><li>BOMI/BOMA certification is preferred</li><li>Type L License is a plus</li><li>608 EPA Certification required</li><li>Experience with Building Management Systems (BMS) and Building Automation Systems (BAS)</li><li>Exceptional organizational skills with a strong ability to follow through on tasks</li><li>Proficiency in critical infrastructure, including mechanical, electrical, plumbing, and fire life safety systems</li><li>Basic understanding of Computerized Maintenance Management Systems (CMMS), preferably Maximo</li><li>Ability to guide and influence vendor teams effectively</li><li>Excellent time management skills with a proven track record of on-time project delivery</li><li>Proficiency in G-Suite applications</li><li>Willingness to support team members in meeting deadlines and goals</li><li>Flexible working hours required due to the 24/7 operation (Working Days Tuesday - Saturday Shift)</li><li>Availability for On Call and emergency situations as needed<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $190,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Supports the team in executing all Preventative Maintenance procedures on time and implements best practice processes to increase efficiency.\nManages daily work requests and maintains corrective/preventative maintenance work records for internal and third-party vendors across various locations.\nProvides prompt responses to requests and issues from facility occupants, managing work order maintenance tickets efficiently.\nConducts regular facility inspections and audits to ensure compliance and optimal functioning.\nSupports the integration and operation of network systems such as HVAC automation, Fire Life Safety (FLS), and additional integrated systems.\nAssists in resolving critical infrastructure issues, managing day-to-day operations during disruptions, assessing root causes, and developing remediation methods.\nEnsures exceptional onboarding experiences for new hires, assisting with training, vendor scheduling, and daily task execution.\nParticipates in new design construction walks, new system training, documentation, and collaborative efforts between Workplace Operations and Design and Construction teams.\nDevelops good partner relationships and addresses service needs.\nAssists in implementing site-specific programs, procedures, and systems to ensure regulatory compliance and the protection of employees and the environment.\nCollaborates with the Global Environmental Health and Safety team to ensure adherence to health and safety standards and industry codes.\nWorks closely with functional partners, assisting with Mechanical, Electrical, and Plumbing tasks/projects, including Security, Events, Audio Visual Team, IT Team, Food & Beverage Team, Moves & Add’s Team, Logistics, Transportation, Design & Construction, and Workplace Experience Teams.\nTakes the lead on self-initiated projects and generates comprehensive reports.\nProduces Building/Energy Management System reports, highlighting real-time and historical trends such as temperature, humidity, and system status to identify anomalies.\nIdentifies problem trends and ensures troubleshooting efforts to determine root causes.\nPerforms other duties as assigned or requested by the Operations Manager.\nProvides and processes Tenant Alteration Requests as per Landlord requirements.\nWorks with coordinators to assign Zendesk tickets to technicians\nAbility to manage schedule and shift changes for technicians.\nThis role is based in the Los Angeles, Hollywood, and Burbank areas. It will require you to travel to different locations as part of your responsibilities. We're looking for someone who is able and willing to commute to various sites as needed for this role.", "qualifications": {"preferred": "BOMI/BOMA certification is preferred\nType L License is a plus", "required": "608 EPA Certification required\nExperience with Building Management Systems (BMS) and Building Automation Systems (BAS)\nExceptional organizational skills with a strong ability to follow through on tasks\nProficiency in critical infrastructure, including mechanical, electrical, plumbing, and fire life safety systems\nBasic understanding of Computerized Maintenance Management Systems (CMMS), preferably Maximo\nAbility to guide and influence vendor teams effectively\nExcellent time management skills with a proven track record of on-time project delivery\nProficiency in G-Suite applications\nWillingness to support team members in meeting deadlines and goals\nFlexible working hours required due to the 24/7 operation (Working Days Tuesday - Saturday Shift)\nAvailability for On Call and emergency situations as needed"}, "skills": ["Preventative Maintenance", "Building Management Systems", "Building Automation Systems", "Critical Infrastructure", "Computerized Maintenance Management Systems", "Vendor Management", "Time Management", "G-Suite", "Teamwork", "Troubleshooting", "Zendesk"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982464586"}