{"jobTitle": "Director of Supply Chain", "company": {"name": "Enclave Search Group", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Director of Supply Chain (Aerospace)\n\nDepartment: Supply Chain & Materials\n\nReports To: Vice President, Supply Chain\n\nJob Summary\n\n- Responsible for commodity management, strategic sourcing, operational purchasing, materials planning, indirect purchasing, sub-contract management and supplier development for Company products world-wide.\n- Leads the development and execution of Global Supply Management sourcing strategies, policies, tactics and objectives for all applicable global commodities that are linked with the subsidiaries, business and manufacturing strategies.\n- Responsible for developing and implementing supply chain best practices to enhance the supply chain performance and improve profitability of the business.\n- Responsible for developing commodity & supply strategies for Company which will ensure the supply of quality material and continually drive for the lowest total landed cost.\n\nEssential Duties and Responsibilities\n\n- Develops, plans, organizes and implements global contracting and procurement strategies and programs to increase operational efficiency and profitability\n- Builds a new supplier development team and develops new sources in best cost countries in alignment with new product and program requirements.\n- Responsible for developing and implementing supply chain best practices to enhance customer service and improve profitability in integrated materials management.\n- Develops new strategic direct and indirect suppliers to increase capacity for Company while reducing costs\n- Implement programs and practices to assure the supply chain infrastructure is suitable to the scope and size of new programs. Conducts Supplier Production Readiness and risk assessments\n- Leads and manages a large team of buyers, project managers, expeditors, commodity managers and supplier development managers to ensure uninterrupted supply of quality materials to our organization while meeting annual cost out goals\n- Categorizes the required vendor spend, to be managed via Long Term Agreements, to manage risk, liability and to optimize Total Landed Cost.\n- Orchestrates the supplier performance evaluation process, determining and taking corrective action, as results require\n- Designs, and leads contract and pricing negotiations with direct and indirect suppliers\n- Drive analytics and disposition of slow moving inventory.\n- Analyze inventories to lead projects to increase inventory turns, reduce waste, and optimize customer service levels.\n- Develops standardized systems and controls for procurement including RFP documentation, work authorization, purchase orders and supplier schedules and LTAs\n- Develops and manages relationships with domestic and international suppliers and sub-contractors\n- Manages raw material inventory turns, receipts, Days payable outstanding and purchase price variance\n- Forecasts inventory and indirect purchase receipts as inputs to the SIOP and Cash Management processes\n- Creates a sub contract management strategy to increase the product scope of work Company can bid on in future programs. Manages the flow down of customer contracts and requirements to the supply base.\n- The SCM director will be setting up automated replenishment processes with direct material suppliers and outside process vendors including supplier schedules and consignment programs.\n- This job description is not all inclusive of all duties. Other duties may be assigned.", "responsibilities": "Responsible for commodity management, strategic sourcing, operational purchasing, materials planning, indirect purchasing, sub-contract management and supplier development for Company products world-wide.", "qualifications": {"required": "MBA or equivalent graduate degree. Minimum of 10 years of managerial experience in Supply Chain Management and or Materials Management. ISM or APICS Certification preferred.", "preferred": "Refined presentation skills to and effective communication skills with executives. Exceptional negotiation skills within a matrixed environment with experience negotiating major contracts. Ability to effectively present information to medium and large groups including suppliers and customers. Exceptional interpersonal skills. Strong analytical skills to prepare cost out and make vs buy analysis. Excellent verbal and written communication skills."}, "skills": ["Commodity management", "Strategic sourcing", "Operational purchasing", "Materials planning", "Indirect purchasing", "Sub-contract management", "Supplier development", "Negotiation skills", "Analytical skills", "Communication skills"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3983762829"}