{"jobTitle": "Part Time Retail Sales Associate - South Coast Plaza - Costa Mesa, CA", "company": {"name": "Casper", "industry": "Retail", "size": "51-200 employees", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Part Time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$15.00/hr - $17.36/hr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Retail", "description": "Looking for a job to get you out of bed? At Casper, our mission is to awaken the potential of a well-rested world. We believe that better sleep makes for better living. We design products and experiences to help you dream your way to a better life! Casper’s Retail story began in 2017 with The Casper Wake-Up. Alongside its success, Casper opened 15 pop-up shops across the U.S. After an exciting beginning with Retail, Casper opened its first permanent store in NYC in 2018, we’ve reached over 70 retail locations and are growing! We are deeply committed to building a diverse and inclusive workforce so that we represent all those who dream big equally.", "responsibilities": "Provide exceptional service to every person that walks through our doors, Follow up with customers through clienteling and e-mail correspondence, Help Casper maintain a healthy sales pipeline by collecting guest contact information and inviting individuals to trial our products, Maintain the highest level of product knowledge and expertise, Maintain the visual integrity of the space, Create and process in-store sales, Process and receive inventory replenishments, Assist with setting up and executing community programs and events, Record and relay recurring customer feedback and insights to internal teams such as tech, marketing, design, and product in order to constantly improve the customer experience.", "qualifications": {"required": "Excellent communicator with a passion for people, Strong written and oral communication skills, Effective and expedient problem-solver with a meticulous attention to detail, Passion for Casper's core mission and values, Positive attitude and feels there is no task too small, Self-starter; entrepreneurial disposition, Eager to be at the frontline of a fast-paced and growing brand, Must understand and appreciate experiential retail, Ability to lift 50 lbs. and be on your feet all day, Mac and Google suite proficiency is a plus.", "preferred": ""}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Employee Discount to use on whatever you like! (with a few exceptions), Salary to pay your bills and a potential bonus for some splurging, Gifted Bedding after tenure milestones, Paid Sick Time, Incentivized Referral Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983782750"}