{"jobTitle": "Area Trainer, Los Angeles", "company": {"name": "Charlotte Tilbury Beauty", "industry": "Technology, Information and Internet", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Technology, Information and Internet", "description": "Founded by British makeup artist and beauty entrepreneur Charlotte Tilbury MBE in 2013, Charlotte Tilbury Beauty has revolutionised the face of the global beauty industry by de-coding makeup applications for everyone, everywhere, with an easy-to-use, easy-to-choose, easy-to-gift range. Today, Charlotte Tilbury Beauty continues to break records across countries, channels, and categories and to scale at pace.<br/><br/>Over the last 10 years, Charlotte Tilbury Beauty has experienced exceptional growth and is one of the most talked about brands in the beauty industry and beyond. It has become a global sensation across 50 markets (and growing), with over 2,300 employees globally who are part of the Dream Team making the magic happen.<br/><br/>Today, Charlotte Tilbury Beauty is a truly global business, delivering market-leading growth, innovative retail and product launches fuelled by industry-leading tech — all with an internal culture of embracing challenges, disruptive thinking, winning together, and sharing the magic. The energy behind the bran­d is infectious, and as we grow, we are always looking for extraordinary talent who want to be part of this our success and help drive our limitless ambitions.<br/><br/>The Role<br/><br/>The Area Trainer (AT) delivers the core education initiatives to field and retail employees. The AT helps to develop, instruct, educate and demonstrate the Charlotte Tilbury core values, makeup artistry, product knowledge, social acumen and our M.A.G.I.C service experience. They support healthy sell-through and maintenance of key franchises by overseeing the delivery of relevant and on-time core education &amp; event initiatives. They are responsible for ensuring a consistent Charlotte Tilbury brand experience that meets/exceeds company sales and service standards. This will be accomplished with leading on-boarding, seasonal trainings, new launch trainings, retail account trainings, in-store development, and special events. The position requires that the individual also manage company assets and expenses.<br/><br/>Location<br/><br/>Open to candidates located in Los Angeles, California.<br/><br/>Role Accountabilities<br/><br/>Ensure Educational &amp; Sales objectives are met by<br/><br/><ul><li>Delivers seasonal territory objectives, priorities, and goals (seasonal launches, new account openings, and special events.)</li><li>Executes seasonal education plan in stores. Owns preparation and follow-up</li><li>Ensures strong follow-up action plans for all training moments</li><li>Works in tandem with retail partners to coordinate scheduling of all basic, seasonal, promotional, event, and in-store education</li><li>Provides feedback on counter team, sales team and brand expert performance</li><li>Implements all Charlotte Tilbury education and training initiatives to achieve desired business results</li><li>Monitors training needs of assigned market to plan and lead all trainings</li><li>Responsible for educating retail accounts and brand experts to improve sell through &amp; sales volume</li><li>Build strong relationships with store teams to ensure optimum brand partnership and awareness</li><li>Drive social strategy through regular participation in internal and external Social Media channels (Instagram, TikTok, etc.)</li><li>Drives the execution of the Learning Management System platform including completion rates, retention checks &amp; KPI reporting</li><li>Lead by example in the execution of all KPIs, service, sales, professionalism and personal image</li><li>Assessing and communicating the effectiveness on training initiatives to Regional Education Manager</li><li>Evaluating training needs and conducting in-store support and in-store trainings based on the needs of the business<br/><br/></li></ul>Employee Development<br/><br/><ul><li>Create and maintain an atmosphere in store geared to achieving sales goals</li><li>Ensure staff delivers consistent, excellent service in accordance with the Charlotte Tilbury standards</li><li>Observe and provide collaborative, hands on feedback to teams on makeup ability, service and selling skills</li><li>Oversee and conduct certifications in a timely manner for all Charlotte Tilbury employees prioritized by door volume</li><li>Ensure lucrative and competitive sell through of new launch and hero products through in store training on product knowledge and technique</li><li>Follow up on all core trainings in store providing feedback, partnership with the Account Executive and Account Coordinator and side by side leadership to yield results</li><li>Assist field team in implementing measures to reduce and minimize staff turnover<br/><br/></li></ul>Financial Accountabilities<br/><br/><ul><li>Ensure the timely submission and accuracy of company credit card expenses, expense reports and company-owned asset forms</li><li>Responsibility in reporting and maintaining personal and training budget within fiscal year<br/><br/></li></ul>Reporting Relationships  Reporting to the Regional Education &amp; Events, Manager - West<br/><br/>Requirements<br/><br/>Key Selection Criteria<br/><br/><ul><li>An ability to lead and provide guidance to a set team while managing multiple priorities</li><li>A proven history in adult learning and instructional training</li><li>Ability to travel 75%</li><li>Ability to travel to New York Fashion Week twice a year</li><li>Must be able to create winning partnerships with retailers</li><li>Advanced customer service, artistry, social media, and public speaking skills</li><li>Experience with multiple retailers, including Nordstrom and Sephora</li><li>Ability to manage and lead high-volume activity</li><li>Ability to work independently with integrity and efficiently in a fast-paced environment</li><li>Intermediate skills in MS Office, including MS Word, Excel, and Outlook</li><li>Excellent communicator, both written and oral<br/><br/></li></ul>Benefits<br/><br/>Base Salary Range  $80,000.00 - $85,000.00<br/><br/>Company Benefits<br/><br/><ul><li>Generous staff discount to use on all products</li><li>Access to Tilbury Treats - our very own rewards platform allowing you to save money and gain ‘money can't buy' discounts on anything from gym memberships to cinema tickets</li><li>Medical, dental, and vision benefits</li><li>Commuter Benefits (Pre-tax)</li><li>Flex Spending Account (FSA)</li><li>Employee Assistance Program (EAP)</li><li>401(k) with Company match</li><li>Paid Time Off</li><li>Birthday PTO</li><li>Charlotte Tilbury, in good faith, believes that this posted range of compensation is the accurate range for this role at the time of this posting**<br/><br/></li></ul>At Charlotte Tilbury Beauty, our mission is to empower everybody in the world to be the most beautiful version of themselves. We celebrate and support this by encouraging and hiring people with diverse backgrounds, cultures, voices, beliefs, and perspectives into our growing global workforce. By doing so, we better serve our communities, customers, employees - and the candidates that take part in our recruitment process.<br/><br/>If you want to learn more about life at Charlotte Tilbury Beauty please follow our LinkedIn page!", "responsibilities": "The Area Trainer (AT) delivers the core education initiatives to field and retail employees. The AT helps to develop, instruct, educate and demonstrate the Charlotte Tilbury core values, makeup artistry, product knowledge, social acumen and our M.A.G.I.C service experience. They support healthy sell-through and maintenance of key franchises by overseeing the delivery of relevant and on-time core education &amp; event initiatives. They are responsible for ensuring a consistent Charlotte Tilbury brand experience that meets/exceeds company sales and service standards. This will be accomplished with leading on-boarding, seasonal trainings, new launch trainings, retail account trainings, in-store development, and special events. The position requires that the individual also manage company assets and expenses.", "qualifications": {"required": "An ability to lead and provide guidance to a set team while managing multiple priorities, A proven history in adult learning and instructional training, Ability to travel 75%, Ability to travel to New York Fashion Week twice a year, Must be able to create winning partnerships with retailers, Advanced customer service, artistry, social media, and public speaking skills, Experience with multiple retailers, including Nordstrom and Sephora, Ability to manage and lead high-volume activity, Ability to work independently with integrity and efficiently in a fast-paced environment, Intermediate skills in MS Office, including MS Word, Excel, and Outlook, Excellent communicator, both written and oral"}, "skills": ["Customer Service", "Retail", "Training", "Public Speaking", "Social Media", "Makeup Artistry", "Adult Learning", "Instructional Design", "Microsoft Office", "Communication"], "postedDate": "1 week ago", "benefits": "Generous staff discount to use on all products, Access to Tilbury Treats - our very own rewards platform allowing you to save money and gain ‘money can't buy' discounts on anything from gym memberships to cinema tickets, Medical, dental, and vision benefits, Commuter Benefits (Pre-tax), Flex Spending Account (FSA), Employee Assistance Program (EAP), 401(k) with Company match, Paid Time Off, Birthday PTO", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983173917"}