{"jobTitle": "Receptionist", "company": {"name": "Randstad USA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Temporary", "employmentType": "Temporary", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Join our growing team at the top food manufacturer in Van Nuys,CA! We’re seeking a friendly, organized receptionist who loves creating a warm welcome for visitors and ensuring smooth office operations. If you have excellent communication skills and a passion for customer service, we want to hear from you!<br/><br/>salary: $18.99 - $19 per hour<br/><br/>shift: First<br/><br/>work hours: 7 AM - 3:30 PM<br/><br/>education: No Degree Required<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provides Front Lobby reception coverage to include greeting guest, visitors, and vendors.</li><li>Directs incoming calls to appropriate party takes messages when needed.</li><li>Assists walk-in applicants by providing Company employment website.</li><li>Ensures guests/visitors are registered for visit, provides Company-required documents to facilitate plant tours for HACCP/GMP compliance.</li><li>Organizes incoming office supplies and checks inventory as needed.</li><li>Prepares packages for shipment via UPS or USPS; processes labeling and other documentation via website.</li><li>Schedules individual or group conference calls and/or conference room requests</li><li>Control employee locker distribution</li><li>Assists Human Resources department with presentation materials, organizing , postings and</li><li>distribution of payroll checkAssist HR with communication within scope at the appropriate level of confidentiality</li><li>Organize skills for maintaining HR filing</li><li>Schedules individual or group conference calls and/or room requests</li><li>Performs other duties or special projects as required<br/><br/></li></ul><strong>The Essential Functions Of This Role Include<br/><br/></strong><ul><li>working in a smoke free environment</li><li>standing for 4 hours at one time</li><li>working up to 2 hrs of overtime per week<br/><br/></li></ul>Skills<br/><br/><ul><li>Receptionist Duties</li><li>Answering Phones</li><li>Clerical Work</li><li>Greeting Customers</li><li>Multi-tasking</li><li>Administrative Duties</li><li>Microsoft Office<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Years of experience: 1 year</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.<br/><br/>Qualified applicants in San Francisco with criminal histories will be considered for employment in accordance with the San Francisco Fair Chance Ordinance.<br/><br/>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "Provides Front Lobby reception coverage to include greeting guest, visitors, and vendors.Directs incoming calls to appropriate party takes messages when needed.Assists walk-in applicants by providing Company employment website.Ensures guests/visitors are registered for visit, provides Company-required documents to facilitate plant tours for HACCP/GMP compliance.Organizes incoming office supplies and checks inventory as needed.Prepares packages for shipment via UPS or USPS; processes labeling and other documentation via website.Schedules individual or group conference calls and/or conference room requestsControl employee locker distributionAssists Human Resources department with presentation materials, organizing , postings anddistribution of payroll checkAssist HR with communication within scope at the appropriate level of confidentialityOrganize skills for maintaining HR filingSchedules individual or group conference calls and/or room requestsPerforms other duties or special projects as required", "qualifications": {"required": "Years of experience: 1 yearExperience level: Experienced"}, "skills": ["Receptionist Duties", "Answering Phones", "Clerical Work", "Greeting Customers", "Multi-tasking", "Administrative Duties", "Microsoft Office"], "postedDate": "3 weeks ago", "salary": {"amount": "18.99 - $19", "currency": "USD"}, "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983326721"}