{"jobTitle": "Receptionist", "company": {"name": "The Barry Law Firm", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Law Practice", "description": "The Barry Law Firm, a premier consumer advocacy law firm located in West Los Angeles, is seeking an experienced legal receptionist ASAP! Successful candidates will have recent experience greeting/assisting clients and answering and handling incoming calls for a fast paced law firm or business. The successful candidate will be able to maintain utmost professionalism and willingness to assist clients as well as the firm’s lawyers, paralegals and legal administrative assistants.<br/><br/><strong>JOB DUTIES AND RESPONSIBILITIES:<br/><br/></strong><ul><li>Greet all visitors and employees to the firm;</li><li>Answer and direct all incoming telephone calls made to the firm ensuring communication at a professional level;</li><li>Receive, scan and distribute mail and other daily correspondence;</li><li>Understand firm culture and expectations with respect to greeting clients and other visitors to the firm;</li><li>Maintain proper visitor and guest security procedures as laid out by the firm;</li><li>Monitor whereabouts of attorney's and staff in order to appropriately handle telephone calls, visitors and/or questions;</li><li>Maintain professional appearance and cleanliness of firm lobby;</li><li>Perform light hospitality when necessary (e.g., coffee, water, order food, drinks, etc.);</li><li>Assist with various projects for other employees (e.g., filing, document preparation, organizational projects, etc.) as needed. <br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>High school diploma required (Associate Degree or Bachelor's Degree preferred);</li><li>Three (3) years of related business experience preferred;</li><li>Strong preference for administrative and switchboard experience particularly in a law firm/legal environment;</li><li>Fluency in Spanish a plus.</li></ul>", "responsibilities": "Greet all visitors and employees to the firm; Answer and direct all incoming telephone calls made to the firm ensuring communication at a professional level; Receive, scan and distribute mail and other daily correspondence; Understand firm culture and expectations with respect to greeting clients and other visitors to the firm; Maintain proper visitor and guest security procedures as laid out by the firm; Monitor whereabouts of attorney's and staff in order to appropriately handle telephone calls, visitors and/or questions; Maintain professional appearance and cleanliness of firm lobby; Perform light hospitality when necessary (e.g., coffee, water, order food, drinks, etc.); Assist with various projects for other employees (e.g., filing, document preparation, organizational projects, etc.) as needed.", "qualifications": {"required": "High school diploma required (Associate Degree or Bachelor's Degree preferred); Three (3) years of related business experience preferred; Strong preference for administrative and switchboard experience particularly in a law firm/legal environment; Fluency in Spanish a plus.", "preferred": "Associate Degree or Bachelor's Degree"}, "skills": ["Spanish"], "postedDate": "4 weeks ago", "url": "https://www.linkedin.com/jobs/view/3983997830"}