{"jobTitle": "Employee Relations Specialist (Southern CA) - Behavioral Health 901 (Remote Position With 25% Travel)", "company": {"name": "Telecare Corporation", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Mental Health Care", "description": "This is a remote position with 25% travel throughout the Southern CA region***<br/><br/>Telecare's mission is to deliver excellent and effective behavioral health services that engage individuals in recovering their health, hopes, and dreams. Telecare continues to advance cultural diversity, humility, equity, and inclusion at all levels of our organization by hiring mental health peers, BIPOC, LGBTQIA+, veterans, and all belief systems.<br/><br/><strong>Full Time; AM 8:30am-5pm; Monday - Friday<br/><br/></strong>Target hiring salary range is around $70K - $87K annually. Telecare applies geographic differentials to its pay ranges. The pay range assigned to this role will be based on the geographic location from which the role is performed. Starting pay is commensurate with relevant experience above the minimum requirements.<br/><br/><strong>Position Summary<br/><br/></strong>The Employee Relations Specialist is responsible for engaging with employees and leaders to ensure an equitable, inclusive, and respectful experience for all employees. This includes responding to employee concerns, conducting workplace investigations, managing medical accommodations, ensuring compliance with company policies, regulations, and work rules. This position handles a wide range of complex and highly sensitive employment situations and must maintain confidentiality and engage with employees at all levels of the organization.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li> Demonstrate the Telecare mission, purpose, values and beliefs in everyday language and contact with the internal and external stakeholders</li><li> Conduct complex and sensitive workplace investigations which includes identifying the appropriate investigation strategies, communicating findings, and providing recommendations for employment action.</li><li> Handle a wide range of complex and highly sensitive employment issues.</li><li> Analyze HR metrics to identify trends and develop action plans.</li><li> Manage accommodations related to disabilities and leave of absences.</li><li> Partner with third party leave administration to respond to questions and address concerns.</li><li> Provide recommendations for policy updates.</li><li> Remain tactful, calm, and professional in adversarial situations.</li><li> Respond to employee complaints and assist leaders with responding to union grievances.</li><li> Assist legal with gathering information to respond to lawsuits and agency claims.</li><li> Interpret policies, procedures, and Collective Bargaining Agreements to ensure consistent application.</li><li> Provide updates and training on policies, procedures, and work rules to employees and leaders.</li><li> Participates in union negotiations and collect all necessary data to prepare for bargaining.</li><li> Provide guidance and direction to leaders on performance improvement matters.</li><li> Utilize and maintain database to track complaints, investigations, and union grievances.</li><li> Exercise independent judgement and perform work with minimal guidance.</li><li> Open availability and flexibility to work according to the needs of the business<br/><br/></li></ul>Duties and responsibilities may be added, deleted and/or changed at the discretion of management.<br/><br/><strong>Position requires driving own personal vehicle for company business such as trainings, offsite meetings, etc.<br/><br/></strong><strong>Qualifications<br/><br/></strong><strong>Required: <br/><br/></strong><ul><li> BA/BS degree in Human Resources or related field and five (5) years' experience as a Human Resource Generalist with one (1) year of labor relations experience.</li><li> Thorough understanding of employment and HR related laws, regulations, policies, principles, concepts, and practices.</li><li> Excellent oral and written communication skills.</li><li> Ability to effectively organize work and proficiency in Microsoft Word and Excel</li><li> Ability to work at a high level of autonomy to manage multiple ongoing issues and complex employee relations matters with minimum supervision.</li><li> A valid California Driver's License and a driving record acceptable to Telecare's insurers</li><li> Out of state travel</li><li> Applicant must be fingerprinted and receive clearance from the Department of Justice</li><li> Must be at least 18 years of age</li><li> All opportunities at Telecare are contingent upon successful completion and receipt of acceptable results of the applicable post-offer physical examination, 2-step PPD test for tuberculosis, acceptable criminal background clearances, excluded party sanctions, and degree or license verification. Position requires driving, valid driver license, a motor vehicle clearance and proof of auto insurance is required at time of employment and must be maintained throughout employment. Additional regulatory, contractual or local requirements may apply<br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li> Human Resource Certification (PHR, SPHR, SHRM-CP, SHRM-SCP</li><li> Previous experience providing Human Resources support for a health care organization<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li> Excellent fact finding and investigative skills</li><li> Ability to analyze data, trends, and insights to identify the root cause of issues</li><li> Proficiency in using Microsoft Word and Excel<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong>The physical demands here are representative of those that must be met by an employee to successfully perform the essential functions of this job.<br/><br/>The employee is frequently required to walk, stand, sit, twist, bend, and occasionally required squat, kneel, crawl, and climb , as well as to frequently, twist, reach and do simple and power grasping and lift and carry items weighing 25 pounds or less. The position requires manual deviation, repetition and dexterity and to occasionally drive and be exposed to uneven walking ground. Visual requirements include computers and books exposure.<br/><br/><strong>EOE AA M/F/V/Disability<br/><br/></strong>If job posting references any sign-on bonus internal applicants and applicants employed with Telecare in the previous 12 months would not be eligible.", "responsibilities": "The Employee Relations Specialist is responsible for engaging with employees and leaders to ensure an equitable, inclusive, and respectful experience for all employees. This includes responding to employee concerns, conducting workplace investigations, managing medical accommodations, ensuring compliance with company policies, regulations, and work rules. This position handles a wide range of complex and highly sensitive employment situations and must maintain confidentiality and engage with employees at all levels of the organization.", "qualifications": {"required": "BA/BS degree in Human Resources or related field and five (5) years' experience as a Human Resource Generalist with one (1) year of labor relations experience.\nThorough understanding of employment and HR related laws, regulations, policies, principles, concepts, and practices.\nExcellent oral and written communication skills.\nAbility to effectively organize work and proficiency in Microsoft Word and Excel\nAbility to work at a high level of autonomy to manage multiple ongoing issues and complex employee relations matters with minimum supervision.\nA valid California Driver's License and a driving record acceptable to Telecare's insurers\nOut of state travel\nApplicant must be fingerprinted and receive clearance from the Department of Justice\nMust be at least 18 years of age\nAll opportunities at Telecare are contingent upon successful completion and receipt of acceptable results of the applicable post-offer physical examination, 2-step PPD test for tuberculosis, acceptable criminal background clearances, excluded party sanctions, and degree or license verification. Position requires driving, valid driver license, a motor vehicle clearance and proof of auto insurance is required at time of employment and must be maintained throughout employment. Additional regulatory, contractual or local requirements may apply", "preferred": "Human Resource Certification (PHR, SPHR, SHRM-CP, SHRM-SCP\nPrevious experience providing Human Resources support for a health care organization"}, "skills": ["Microsoft Word", "Microsoft Excel", "Fact Finding", "Investigation", "Data Analysis", "Trend Analysis", "Insights", "Root Cause Analysis"], "postedDate": "4 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983211394"}