{"jobTitle": "Manager, Security Operations", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "100,000.00/yr - 350,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. The Opportunity The Manager, Security Operations, will be responsible for enhancing physical security capabilities across Netflix select sites in the US and Canada Region (UCAN) - primarily on the East Coast. This includes strengthening relationships with local / State / Federal law enforcement agencies, optimizing security preparedness and response and overseeing physical security operations. You will be empowered to make things happen and have a natural inclination to work within a high performance culture that is fast paced, dynamic and self-directed. This position will report to the Director of Security Operations, UCAN and will be based in our New York office on a hybrid in-office schedule (3-4 days in office). Responsibilities:<br/><br/><ul><li>Manage Netflix security operations, including programs, strategic services, and projects that minimize business risk exposure across multiple locations in UCAN</li><li>Serve as an autonomous leader that drives innovation and ensures highest level of execution under an ever - changing environment </li><li>Drive physical security programs, projects, and initiatives effectively including budget management, vendor management, and quality control and analyze the local security environment to identify emerging security trends that may impact the company</li><li>Oversee management of contract security provider including service level agreements, key performance indicators, deployment and ensure appropriate solutions are in pace to minimize business risk exposure</li><li>Develop, implement and rehearse emergency response and crisis management plans </li><li>Lead and present security education awareness training programs</li><li>Liaise with existing landlord contract security and surrounding property owners</li><li>Develop and maintain guard post orders, response procedures, and best practices</li><li>Stay up-to-date on the local security environment and identify emerging security trends that may impact the company</li><li>Analyze and investigate threats and security incidents impacting employees and offices</li><li>Collect, analyze and report security metrics (incident and performance based) that demonstrate security’s impact and risk reduction</li><li>Draft timely and accurate situation reports and written briefings for senior leadership</li><li>Collaborate with other Netflix Security teams (GSOC, Systems, etc.) to advise on requirements for and implementation of physical and technical security systems at corporate locations</li><li>Implement security requirements to support special events during employee and public-facing events to ensure appropriate levels of security coverage</li><li>Liaise with local law enforcement authorities</li><li>Partner with internal stakeholders and business unite to ensure the team is focused on what is best for Netflix and deliver on our priorities </li><li>Travel regionally and internationally as required (approximately 25%)<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Experience in managing a security operations program for a high visibility, multinational, corporation in the US or Canada. </li><li>Bachelor’s degree in Business, Emergency Management, Security, or related field, with at least 10 years of experience (combined public/private sector experience considered) in security operations with increasing scope, responsibility and complexity at a multinational company; relevant security certifications (ex. CPP) a plus. </li><li>Experience in managing security vendors, including union and non-union contracts. </li><li>Experience in different work environments, with an understanding of how to operate best in a diverse and inclusive workplace. </li><li>Knowledge and experience in RFP/RFI process, including new vendor onboarding. </li><li>Experience in program development with delivery accountability.</li><li>Foundational understanding of collection and analysis of security metrics to inform decisions, including conducting risk and vulnerability assessments and operational security design/planning</li><li>Proven track record of strong cross functional relations </li><li>Capable of adapting to and leaning in to risk</li><li>Can work independently with a DIY mentality and drive results in a nimble environment</li><li>Experience working with production, media/entertainment, or content creation a plus<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $350,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. The Opportunity The Manager, Security Operations, will be responsible for enhancing physical security capabilities across Netflix select sites in the US and Canada Region (UCAN) - primarily on the East Coast. This includes strengthening relationships with local / State / Federal law enforcement agencies, optimizing security preparedness and response and overseeing physical security operations. You will be empowered to make things happen and have a natural inclination to work within a high performance culture that is fast paced, dynamic and self-directed. This position will report to the Director of Security Operations, UCAN and will be based in our New York office on a hybrid in-office schedule (3-4 days in office). Responsibilities:<br/><br/><ul><li>Manage Netflix security operations, including programs, strategic services, and projects that minimize business risk exposure across multiple locations in UCAN</li><li>Serve as an autonomous leader that drives innovation and ensures highest level of execution under an ever - changing environment </li><li>Drive physical security programs, projects, and initiatives effectively including budget management, vendor management, and quality control and analyze the local security environment to identify emerging security trends that may impact the company</li><li>Oversee management of contract security provider including service level agreements, key performance indicators, deployment and ensure appropriate solutions are in pace to minimize business risk exposure</li><li>Develop, implement and rehearse emergency response and crisis management plans </li><li>Lead and present security education awareness training programs</li><li>Liaise with existing landlord contract security and surrounding property owners</li><li>Develop and maintain guard post orders, response procedures, and best practices</li><li>Stay up-to-date on the local security environment and identify emerging security trends that may impact the company</li><li>Analyze and investigate threats and security incidents impacting employees and offices</li><li>Collect, analyze and report security metrics (incident and performance based) that demonstrate security’s impact and risk reduction</li><li>Draft timely and accurate situation reports and written briefings for senior leadership</li><li>Collaborate with other Netflix Security teams (GSOC, Systems, etc.) to advise on requirements for and implementation of physical and technical security systems at corporate locations</li><li>Implement security requirements to support special events during employee and public-facing events to ensure appropriate levels of security coverage</li><li>Liaise with local law enforcement authorities</li><li>Partner with internal stakeholders and business unite to ensure the team is focused on what is best for Netflix and deliver on our priorities </li><li>Travel regionally and internationally as required (approximately 25%)<br/><br/></li></ul>", "qualifications": {"required": "Experience in managing a security operations program for a high visibility, multinational, corporation in the US or Canada. <br/>Bachelor’s degree in Business, Emergency Management, Security, or related field, with at least 10 years of experience (combined public/private sector experience considered) in security operations with increasing scope, responsibility and complexity at a multinational company; relevant security certifications (ex. CPP) a plus. <br/>Experience in managing security vendors, including union and non-union contracts. <br/>Experience in different work environments, with an understanding of how to operate best in a diverse and inclusive workplace. <br/>Knowledge and experience in RFP/RFI process, including new vendor onboarding. <br/>Experience in program development with delivery accountability.<br/>Foundational understanding of collection and analysis of security metrics to inform decisions, including conducting risk and vulnerability assessments and operational security design/planning<br/>Proven track record of strong cross functional relations <br/>Capable of adapting to and leaning in to risk<br/>Can work independently with a DIY mentality and drive results in a nimble environment<br/>Experience working with production, media/entertainment, or content creation a plus<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983494690"}