{"jobTitle": "Director of Product Management - Ad Product, Strategy & Analysis", "company": {"name": "Warner Bros. Discovery", "industry": "Entertainment Providers", "size": "Large", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$167,020.00 - $310,180.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Entertainment Providers", "description": "Welcome to Warner Bros. Discovery… the stuff dreams are made of. Who We Are… When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next… From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive. Your New Role... We are seeking a Director, Product Management, to lead strategy & analysis for our Ad Product team. You will lead a team of Product Managers responsible for managing the delivery & efficacy of the ad-supported strategy and driving product area storytelling across the streaming business. You will have significant impact and influence on the future success of the ad-supported streaming business through evaluating effectiveness of our approach to revenue optimization and its impacts on the customer experience, identifying new areas for opportunity, assessing the competitive landscape, and reading out on strategic initiatives and the health of the business overall. The Director will play a pivotal role in driving the long-term strategy across the greater Global Product & Design org as well as stakeholder groups including Engineering, Sales, Finance, Growth & Retention, Marketing, Content Strategy, Analytics, and executive leadership. The ideal candidate will have strong knowledge of the streaming advertising landscape and an appetite for analytics, data, problem-solving, and a passion for WBD’s mission. They will consistently advocate on behalf of the customer, leveraging data, customer feedback, and innovative thinking to evolve our strategy, balancing a user first mindset with revenue opportunities. They will communicate effectively, both in writing and verbally, and comfortable reading out to executive leadership regularly. They will build effective and productive relationships by fostering trust and communicating clearly. They will be organized, have a bias to act quickly, enjoy diving into details and data, and identify/enhance opportunities to partner on larger cross-functional goals. They will also be bold & comfortable advising product leadership on what can be improved, what the team needs to thrive, and how/why/when our revenue optimization strategy comes to life. Your Role Accountabilities... Evaluate the efficiency & effectiveness of our overall ad-supported strategy, identifying new areas of opportunity for enhancement & reading out on the health of business. Ensure campaign management & delivery is operating optimally; indicating and troubleshooting areas of inconsistency and raising risk. Identify meaningful and required metrics needed to assess the health of the business region by region; ensuring those requirements are executed globally. Drive competitive analysis and research initiatives to keep a pulse on industry standards and growth opportunities. Communicate and mobilize partners & stakeholders around initiatives identified to drive our ad-supported strategy. Proactively ideate on the ad experience, leveraging user feedback and engagement data to identify opportunities to improve habituality, retention and revenue generation of ad-supported users. Influence sales, ad operations, growth, marketing, data, finance, design, engineering, research and analytics as we identify new product features and enhancements. Explore new areas of opportunities to drive value and growth goals forward and coordinate with key stakeholders to prioritize and lead the changes. Monitor existing metrics, develop and propose new metrics, and work across the organization to ensure we are tracking KPIs and OKRs. Communicate vision, strategy, objectives and KPIs for new features with ability to influence and inspire cross-functional teams. Showcase pro-active and creative product thinking with interest in understanding user challenges in an evolving environment. Qualifications & Experience... 10+ years of experience in managing digital product initiatives and related experience as an ad technologist. 3+ years leading a team of product managers or similar management experience. Extensive knowledge of the advertising technology ecosystem - technology intermediaries, measurement and targeting vendors. Experience chartering and executing against a strategy. Knowledgeable about privacy and compliance regulations affecting the advertising environment. Solution-oriented thinker with the ability to ask the right questions about data. Experience writing requirements for digital products and features and the ability to execute those requirements with development teams. Technical aptitude to evolve features to positively affect the outcome of the user and advertiser experience. Ability to adapt rapidly in a fast-moving environment with shifting priorities. Responding to changes in direction quickly and intelligently. Possess the drive to enhance knowledge of systems, products, and industry continually. Must be self-motivated and accountable. Strong written and verbal communication skills are required. Proficiency in Excel and PowerPoint. Detail-oriented and organized. Comfort in presenting to large audiences. Collaborative in nature. How We Get Things Done… This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview. Championing Inclusion at WBD Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law. If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com. In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $167,020.00 - $310,180.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "Evaluate the efficiency & effectiveness of our overall ad-supported strategy, identifying new areas of opportunity for enhancement & reading out on the health of business. Ensure campaign management & delivery is operating optimally; indicating and troubleshooting areas of inconsistency and raising risk. Identify meaningful and required metrics needed to assess the health of the business region by region; ensuring those requirements are executed globally. Drive competitive analysis and research initiatives to keep a pulse on industry standards and growth opportunities. Communicate and mobilize partners & stakeholders around initiatives identified to drive our ad-supported strategy. Proactively ideate on the ad experience, leveraging user feedback and engagement data to identify opportunities to improve habituality, retention and revenue generation of ad-supported users. Influence sales, ad operations, growth, marketing, data, finance, design, engineering, research and analytics as we identify new product features and enhancements. Explore new areas of opportunities to drive value and growth goals forward and coordinate with key stakeholders to prioritize and lead the changes. Monitor existing metrics, develop and propose new metrics, and work across the organization to ensure we are tracking KPIs and OKRs. Communicate vision, strategy, objectives and KPIs for new features with ability to influence and inspire cross-functional teams. Showcase pro-active and creative product thinking with interest in understanding user challenges in an evolving environment.", "qualifications": {"required": "10+ years of experience in managing digital product initiatives and related experience as an ad technologist. 3+ years leading a team of product managers or similar management experience. Extensive knowledge of the advertising technology ecosystem - technology intermediaries, measurement and targeting vendors. Experience chartering and executing against a strategy. Knowledgeable about privacy and compliance regulations affecting the advertising environment. Solution-oriented thinker with the ability to ask the right questions about data. Experience writing requirements for digital products and features and the ability to execute those requirements with development teams. Technical aptitude to evolve features to positively affect the outcome of the user and advertiser experience. Ability to adapt rapidly in a fast-moving environment with shifting priorities. Responding to changes in direction quickly and intelligently. Possess the drive to enhance knowledge of systems, products, and industry continually. Must be self-motivated and accountable. Strong written and verbal communication skills are required. Proficiency in Excel and PowerPoint. Detail-oriented and organized. Comfort in presenting to large audiences. Collaborative in nature.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3983326286"}