{"jobTitle": "Counsel, Marketing Legal", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$250,000 - $530,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>THE OPPORTUNITY: The Netflix Marketing Legal team is seeking an experienced, talented and passionate lawyer to join our team in providing legal support across Netflix’s Marketing, Publicity, Communications and Marketing Partnerships teams. KEY RESPONSIBILITIES: In this role, the successful candidate will work closely with other members of the Marketing legal team as well as cross functional legal and business teams, including Advertising, Consumer Products, Intellectual Property, Business and Legal Affairs, Labor, Privacy, Employment and Product Legal, to support the marketing and promotion of Netflix’s content and its service. Responsibilities will include: drafting and negotiating marketing and marketing production-related agreements including MSAs/SOWs, PSAs, co-promotion, integration, sponsorship / partnership agreements, participant releases, talent/influencer agreements, event/venue agreements, licensing and promotion agreements; creating/managing/updating templates; preparing promotional terms and conditions including official rules for sweepstakes/contests; advising on marketing campaigns and activations including risk assessment and clearances; conducting rights analysis for licensor, talent and third party rights and approvals; providing advice on compliance with laws and regulatory matters; and preparing memos and guidance documents and conducting trainings as necessary to help increase legal acumen across teams. This is a great opportunity for a marketing or advertising attorney to impart, hone and further develop specialized industry knowledge as part of our growing team (the Marketing Legal team is part of a larger Marketing, Advertising and Consumer Products/Experiences team). This role is based in either Los Angeles, CA or New York, NY and reports into the Head of Marketing Legal UCAN. The ideal candidate will be intellectually curious, demonstrate great initiative, and be excited and inspired by the Netflix culture. WHAT WE’RE LOOKING FOR:<br/><br/><ul><li>5+ years of relevant experience as a lawyer, ideally including experience working in marketing and/or advertising, partnerships and promotions. Entertainment experience is also a plus.</li><li>Ability to work autonomously and reliably within tight timeframes in a fast-paced, high-performance environment.</li><li>Exceptional interpersonal and communication skills (both oral and written)</li><li>Strong analytical capabilities and ability to exercise sound judgment in the absence of perfect information</li><li>Ability to take initiative to identify and solve problems in a business-friendly and solutions-oriented manner</li><li>Ability to think strategically, commercially and practically</li><li>Excellent organizational and time management skills with an ability to multitask, prioritize and meet deadlines</li><li>High degree of professional ethics and integrity</li><li>Flexibility to work across various projects and teams<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $250,000 - $530,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The Netflix Marketing Legal team is seeking an experienced, talented and passionate lawyer to join our team in providing legal support across Netflix’s Marketing, Publicity, Communications and Marketing Partnerships teams. KEY RESPONSIBILITIES: In this role, the successful candidate will work closely with other members of the Marketing legal team as well as cross functional legal and business teams, including Advertising, Consumer Products, Intellectual Property, Business and Legal Affairs, Labor, Privacy, Employment and Product Legal, to support the marketing and promotion of Netflix’s content and its service. Responsibilities will include: drafting and negotiating marketing and marketing production-related agreements including MSAs/SOWs, PSAs, co-promotion, integration, sponsorship / partnership agreements, participant releases, talent/influencer agreements, event/venue agreements, licensing and promotion agreements; creating/managing/updating templates; preparing promotional terms and conditions including official rules for sweepstakes/contests; advising on marketing campaigns and activations including risk assessment and clearances; conducting rights analysis for licensor, talent and third party rights and approvals; providing advice on compliance with laws and regulatory matters; and preparing memos and guidance documents and conducting trainings as necessary to help increase legal acumen across teams.", "qualifications": {"required": "5+ years of relevant experience as a lawyer, ideally including experience working in marketing and/or advertising, partnerships and promotions. Entertainment experience is also a plus.\nAbility to work autonomously and reliably within tight timeframes in a fast-paced, high-performance environment.\nExceptional interpersonal and communication skills (both oral and written)\nStrong analytical capabilities and ability to exercise sound judgment in the absence of perfect information\nAbility to take initiative to identify and solve problems in a business-friendly and solutions-oriented manner\nAbility to think strategically, commercially and practically\nExcellent organizational and time management skills with an ability to multitask, prioritize and meet deadlines\nHigh degree of professional ethics and integrity\nFlexibility to work across various projects and teams"}, "skills": [], "postedDate": "1 week ago", "benefits": "Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $250,000 - $530,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983492947"}