{"jobTitle": "Financial Health Strategy Manager", "company": {"name": "U.S. Bank", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "145,180.00/yr - 187,880.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Banking", "description": "At U.S. Bank, we’re on a journey to do our best. Helping the customers and businesses we serve to make better and smarter financial decisions and enabling the communities we support to grow and succeed. We believe it takes all of us to bring our shared ambition to life, and each person is unique in their potential. A career with U.S. Bank gives you a wide, ever-growing range of opportunities to discover what makes you thrive at every stage of your career. Try new things, learn new skills and discover what you excel at—all from Day One.<br/><br/><strong>Job Description<br/><br/></strong>The Financial Health Strategy Manager position is responsible for leading financial health initiatives that meet the business and social objectives of U.S. Bank’s social impact and diversity, equity and inclusion strategy. They will evaluate, recommend and implement strategic initiatives that support greater financial wellness and close persistent and historic gaps in economic outcomes.<br/><br/>They will work across the U.S. Bank enterprise and work collaboratively with senior leaders across the organization to implement workstreams that advance our reputation and strategic growth pillar, “Most Trusted Choice”.<br/><br/>Key objectives of this role include:<br/><br/>Strategy and governance:<br/><br/><ul><li>Support the development of financial inclusion and wellbeing strategy and vision at U.S. Bank</li><li>Maintain strong relationships within the industry, government and NGOs and other external stakeholders to understand how the overall landscape is evolving, and how U.S. Bank’s strategy should evolve with it</li><li>Identify, gather, maintain, and analyze internal financial health metrics. Implement processes for tracking and monitoring U.S. Bank’s progress against financial inclusion and health</li><li>Benchmark performance against peers and making recommendations to improve the company’s performance across financial health ratings and rankings,</li><li>Develop and share insights into the financial health needs of consumers and communities to enable U.S. Bank to design improved solutions, inform policy and innovate (in partnership with CX)</li><li>Collaborate with risk management and compliance teams to identify financial health related risks.</li><li>Ensure effective governance, coordination and execution of financial health programs across the organization. Provide leadership to define, get buy-in and execute strategies to advance U.S. Bank’s financial inclusion and wellness goals and ambitions.<br/><br/><br/></li></ul>Initiative Management:<br/><br/><ul><li>Translate strategy into actionable plans/initiatives across multiple departments and business lines at U.S. Bank</li><li>Design and manage programs and initiatives that complement existing line of business efforts, aimed at creating improved financial inclusion and health of our employees, communities and clients. Includes but not limited to philanthropy, corporate sponsorships and partnerships</li><li>Influence the product development roadmap and prioritization to deliver on vision, including new products and solutions to help employees, community and clients to strengthen their financial health (in partnership with business lines and enabling functions)<br/><br/><br/></li></ul>Stakeholder Engagement and Brand/Reputation Management:<br/><br/><ul><li>Clearly articulate U.S. Bank financial health strategy to stakeholders and create approach that advances brand and reputation of U.S. Bank</li><li>Engage with internal and external stakeholders, including executives, regulators, investors, clients, and industry groups. Represent the bank at industry events and conference, enhancing our brand and thought leadership in financial health.</li><li>Collect and analyze stakeholder inquiries, trends, and identify emerging opportunities. Develop and coordinate U.S. Banks company responses and communication on key issues across multiple business lines, ensuring compliance with relevant reporting frameworks, and best practices in data collection, analysis and disclosure.</li><li>Partner with communications team to advance brand/reputation of U.S. Bank’s efforts in financial health</li><li>Develop presentation materials, talking points, benchmarking, and analysis on topics for engagement with internal and external stakeholders and for disclosure reporting<br/><br/><br/></li></ul><strong>Preferred Skills/Experience<br/><br/></strong><ul><li> Expert knowledge/ experience in financial inclusion, or financial health</li><li> Experience in financial institutions, banking sector</li><li> Bachelor's or Master's degree, or relevant work experience</li><li> Typically 10 or more years of banking or other relevant work experience and three or more years of management experience</li><li> Well-developed leadership abilities and strategic management skills</li><li> Thorough knowledge of the current business or regulatory environment and the ability to anticipate changes</li><li> Effective verbal and written communication skills</li><li> Well-developed analytical, decision-making and problem-solving skills</li><li> Considerable tact, diplomacy and people skills<br/><br/><br/></li></ul>If there’s anything we can do to accommodate a disability during any portion of the application or hiring process, please refer to our disability accommodations for applicants.<br/><br/><strong>Benefits:<br/><br/></strong>Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours):<br/><br/><ul><li>Healthcare (medical, dental, vision)</li><li>Basic term and optional term life insurance</li><li>Short-term and long-term disability</li><li>Pregnancy disability and parental leave</li><li>401(k) and employer-funded retirement plan</li><li>Paid vacation (from two to five weeks depending on salary grade and tenure)</li><li>Up to 11 paid holiday opportunities</li><li>Adoption assistance</li><li>Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law<br/><br/><br/></li></ul><strong>EEO is the Law<br/><br/></strong>U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors. Applicants can learn more about the company’s status as an equal opportunity employer by viewing the federal <strong>KNOW YOUR RIGHTS</strong> EEO poster.<br/><br/><strong>E-Verify<br/><br/></strong>U.S. Bank participates in the U.S. Department of Homeland Security E-Verify program in all facilities located in the United States and certain U.S. territories. The E-Verify program is an Internet-based employment eligibility verification system operated by the U.S. Citizenship and Immigration Services. Learn more about the E-Verify program.<br/><br/>The salary range reflects figures based on the primary location, which is listed first. The actual range for the role may differ based on the location of the role. In addition to salary, U.S. Bank offers a comprehensive benefits package, including incentive and recognition programs, equity stock purchase 401(k) contribution and pension (all benefits are subject to eligibility requirements). Pay Range: $145,180.00 - $170,800.00 - $187,880.00<br/><br/>U.S. Bank will consider qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance.<br/><br/>Job postings typically remain open for approximately 20 days of the posting date listed above, however the job posting may be closed earlier should it be determined the position is no longer required due to business need. Job postings in areas with a high volume of applicants, such as customer service, contact center, and Financial Crimes investigations, remain open for approximately 5 days of the posting listed date.", "responsibilities": "The Financial Health Strategy Manager position is responsible for leading financial health initiatives that meet the business and social objectives of U.S. Bank’s social impact and diversity, equity and inclusion strategy. They will evaluate, recommend and implement strategic initiatives that support greater financial wellness and close persistent and historic gaps in economic outcomes.<br/><br/>They will work across the U.S. Bank enterprise and work collaboratively with senior leaders across the organization to implement workstreams that advance our reputation and strategic growth pillar, “Most Trusted Choice”.<br/><br/>Key objectives of this role include:<br/><br/>Strategy and governance:<br/><br/><ul><li>Support the development of financial inclusion and wellbeing strategy and vision at U.S. Bank</li><li>Maintain strong relationships within the industry, government and NGOs and other external stakeholders to understand how the overall landscape is evolving, and how U.S. Bank’s strategy should evolve with it</li><li>Identify, gather, maintain, and analyze internal financial health metrics. Implement processes for tracking and monitoring U.S. Bank’s progress against financial inclusion and health</li><li>Benchmark performance against peers and making recommendations to improve the company’s performance across financial health ratings and rankings,</li><li>Develop and share insights into the financial health needs of consumers and communities to enable U.S. Bank to design improved solutions, inform policy and innovate (in partnership with CX)</li><li>Collaborate with risk management and compliance teams to identify financial health related risks.</li><li>Ensure effective governance, coordination and execution of financial health programs across the organization. Provide leadership to define, get buy-in and execute strategies to advance U.S. Bank’s financial inclusion and wellness goals and ambitions.<br/><br/><br/></li></ul>Initiative Management:<br/><br/><ul><li>Translate strategy into actionable plans/initiatives across multiple departments and business lines at U.S. Bank</li><li>Design and manage programs and initiatives that complement existing line of business efforts, aimed at creating improved financial inclusion and health of our employees, communities and clients. Includes but not limited to philanthropy, corporate sponsorships and partnerships</li><li>Influence the product development roadmap and prioritization to deliver on vision, including new products and solutions to help employees, community and clients to strengthen their financial health (in partnership with business lines and enabling functions)<br/><br/><br/></li></ul>Stakeholder Engagement and Brand/Reputation Management:<br/><br/><ul><li>Clearly articulate U.S. Bank financial health strategy to stakeholders and create approach that advances brand and reputation of U.S. Bank</li><li>Engage with internal and external stakeholders, including executives, regulators, investors, clients, and industry groups. Represent the bank at industry events and conference, enhancing our brand and thought leadership in financial health.</li><li>Collect and analyze stakeholder inquiries, trends, and identify emerging opportunities. Develop and coordinate U.S. Banks company responses and communication on key issues across multiple business lines, ensuring compliance with relevant reporting frameworks, and best practices in data collection, analysis and disclosure.</li><li>Partner with communications team to advance brand/reputation of U.S. Bank’s efforts in financial health</li><li>Develop presentation materials, talking points, benchmarking, and analysis on topics for engagement with internal and external stakeholders and for disclosure reporting<br/><br/><br/></li></ul>", "qualifications": {"preferred": "Expert knowledge/ experience in financial inclusion, or financial health, Experience in financial institutions, banking sector, Bachelor's or Master's degree, or relevant work experience, Typically 10 or more years of banking or other relevant work experience and three or more years of management experience, Well-developed leadership abilities and strategic management skills, Thorough knowledge of the current business or regulatory environment and the ability to anticipate changes, Effective verbal and written communication skills, Well-developed analytical, decision-making and problem-solving skills, Considerable tact, diplomacy and people skills", "required": ""}, "skills": [], "postedDate": "6 days ago", "benefits": "Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours):<br/><br/><ul><li>Healthcare (medical, dental, vision)</li><li>Basic term and optional term life insurance</li><li>Short-term and long-term disability</li><li>Pregnancy disability and parental leave</li><li>401(k) and employer-funded retirement plan</li><li>Paid vacation (from two to five weeks depending on salary grade and tenure)</li><li>Up to 11 paid holiday opportunities</li><li>Adoption assistance</li><li>Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law<br/><br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983325622"}