{"jobTitle": "Production Director, Games Studio (Blue)", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$220,000.00 - $900,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>We’re looking for a Production Director to drive the product development of a brand-new AAA multiplatform game, in partnership with the core leadership team. As Production Director, you will be among the leaders of one of Netflix’s first generation of internally developed original games. You will develop and execute the production plan - how we structure, build, launch and run the game and its operations, blending our creative aspirations with our desire to innovate in how games are built. The right candidate will bring industry-leading expertise in managing and launching high-quality, deeply engaging games, along with attention to detail, structured thinking and flexibility. Proven experience communicating and influencing across all development disciplines and support departments is integral to success in this role. You will build a team of production experts, all in service of our primary goal of creating an amazing game. We're building the foundation for a small, but ambitious team of creators. We’re looking for leaders who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with. If you are someone with a bias towards action and are energized by the learning that comes with bold experimentation at an agile pace, we’d love to hear from you! As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. Now is an amazing time to join Netflix as we seek to entertain the world. We have over 270 million paid members in over 190 countries, and we won’t stop there. Responsibilities Include<br/><br/><ul><li>Task Management in partnership with department leads - prioritization, scheduling, communication and day-to-day management</li><li>Resource Management - estimation, load balancing, planning / road-mapping</li><li>Process development and iteration on production pathways</li><li>Day to day tasking/scheduling requiring hands-on expertise with Jira and Confluence. Knowledge of plug-ins and best practices to enable smooth workflow for distributed teams.</li><li>Coordination with partner teams within Netflix on shared development priorities</li><li>Management of internal and external releases, coordinating across multiple stakeholders</li><li>Hiring, mentorship, and management of a small team of production experts</li><li>Adapting our production process to support all phases of development from initial prototyping and concepting through release and sustained operation at scale</li><li>Actively contributing to the studio culture, modeling behavior, monitoring team health and evolving culture in a way that’s aligned with our core values as we grow</li><li>Collaborate with the rest of the leadership team to create our development strategy, build a plan, execute on key initiatives, measure our progress and iterate throughout the project.<br/><br/></li></ul>The Ideal Candidate<br/><br/><ul><li>At least 10 years of production experience, including 5+ years of experience managing direct reports in a senior leadership role, with multiple shipped high-quality, large-scale multi-platform games</li><li>Experience supporting a live service game from development planning to delivery of content and features post-launch</li><li>Excellent communication skills grounded in authenticity, intention and curiosity</li><li>Experience with all phases of game development from concept through release and post-launch</li><li>Well-developed skills and judgment for assessing and balancing competing factors like quality, scope, cost, risk and time</li><li>Passion for creating structure and organization out of chaos; A desire to build systems to support creativity and innovation</li><li>Demonstrable track record for providing and accepting feedback; Established strong partnerships with creative and technical leadership, with the ability to influence decision-making through discussion and engagement, rather than authority</li><li>Gets excited by learning new skills, dashing to pitch in, even if this means flexing beyond this role’s core responsibilities if it can help us win</li><li>Passion for playing, incubating, building, and shipping video games<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $220,000 - $900,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "<ul><li>Task Management in partnership with department leads - prioritization, scheduling, communication and day-to-day management</li><li>Resource Management - estimation, load balancing, planning / road-mapping</li><li>Process development and iteration on production pathways</li><li>Day to day tasking/scheduling requiring hands-on expertise with Jira and Confluence. Knowledge of plug-ins and best practices to enable smooth workflow for distributed teams.</li><li>Coordination with partner teams within Netflix on shared development priorities</li><li>Management of internal and external releases, coordinating across multiple stakeholders</li><li>Hiring, mentorship, and management of a small team of production experts</li><li>Adapting our production process to support all phases of development from initial prototyping and concepting through release and sustained operation at scale</li><li>Actively contributing to the studio culture, modeling behavior, monitoring team health and evolving culture in a way that’s aligned with our core values as we grow</li><li>Collaborate with the rest of the leadership team to create our development strategy, build a plan, execute on key initiatives, measure our progress and iterate throughout the project.<br/><br/></li></ul>", "qualifications": {"required": "At least 10 years of production experience, including 5+ years of experience managing direct reports in a senior leadership role, with multiple shipped high-quality, large-scale multi-platform games", "preferred": "Experience supporting a live service game from development planning to delivery of content and features post-launch, Excellent communication skills grounded in authenticity, intention and curiosity, Experience with all phases of game development from concept through release and post-launch, Well-developed skills and judgment for assessing and balancing competing factors like quality, scope, cost, risk and time, Passion for creating structure and organization out of chaos; A desire to build systems to support creativity and innovation, Demonstrable track record for providing and accepting feedback; Established strong partnerships with creative and technical leadership, with the ability to influence decision-making through discussion and engagement, rather than authority, Gets excited by learning new skills, dashing to pitch in, even if this means flexing beyond this role’s core responsibilities if it can help us win, Passion for playing, incubating, building, and shipping video games"}, "skills": ["Jira", "Confluence", "Game Development", "Production Management", "Leadership"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983494696"}