{"jobTitle": "Product Marketing Manager - Rx Channels", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "158,000.00/yr - 223,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "At Meta Reality Labs, we build tools that help people feel connected anytime, anywhere. We’re on a mission to build the next computing platform by putting people at the center of emerging hardware and software technologies, whether on the go with wearables and augmented reality, in the home or at work, or fully immersed in alternate virtual reality worlds.The Meta Reality Labs Product Marketing organization leads inbound product marketing, product launch strategy, and in-market business growth. The Product Marketing team influences early stage product development and roadmaps, creates go-to-market plans, supports in-market growth of the ecosystem, and provides direction for future investments.We're looking for an experienced Consumer Product Marketing Manager, specializing in prescription optical products and channels, to join our growing product marketing team and support a global audience. You will be responsible for influencing product strategies and positioning for target audiences, driving go-to-market efforts and prescription smart glasses distribution strategy, and working cross functionally with partners throughout the company. A successful candidate will have in-depth experience in the prescription optical industry, prescription regulatory and compliance considerations, analytics, consumer insights, and product commercialization in B2C contexts.<br/><br/>Product Marketing Manager - Rx Channels Responsibilities:<br/><br/><ul><li>Work with internal and external partners to optimize the prescription smart glasses customer experience and drive product adoption</li><li>Create go-to-market (GTM) strategy to drive product adoption &amp; engagement</li><li>Work with Channel Strategy and Sales teams to identify opportunities for Rx smart glasses distribution</li><li>Identify market strategy and target audiences, develop product positioning, pricing, and placement, inform forecasting with data and insights, and collaborate across cross-functional teams (marketing, sales, communications, partnerships, etc.) to achieve launch goals</li><li>Influence product development and support a case for business investment by synthesizing, analyzing, and implementing learnings from customer feedback sources (e.g. in-market feedback, industry reports, competitive assessments, customer research, alpha/beta tests, etc) to strengthen outcomes for product-market-fit</li><li>Manage prescription data &amp; analytics with internal and external partners, and uncover actionable insights to drive access and adoption in existing and new channels</li><li>Serve as the subject matter expert on prescription wearer and channel needs and mindsets</li><li>Manage prescription product claims, content and pricing in B2C and B2B contexts and for wearers with and without insurance<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>5+ years of experience in product marketing, product management, management consulting, business strategy in vision correction and/or eye health fields</li><li>Experience with prescription and health data regulations and compliance</li><li>Experience building partnerships with Product Management and cross-functional teams, and shaping product roadmaps and go-to-market strategies</li><li>Experience analyzing data, and translating to insights that support product development and go to market strategies</li><li>Experience leading implementation of complex product or service offerings</li><li>Experience working with technical partners to translate between technical and consumer languages</li><li>Experience collaborating with external vendors and partners</li><li>Bachelor's degree<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience working independently and adapting in a fast-paced, entrepreneurial, and fluid environment, identifying and escalating issues early and often</li><li>Experience balancing creative and analytical thinking, putting forth best-in-class execution within a measurable and data-driven framework</li><li>Experience working with consumer electronics channels and retailers</li><li>MS/MBA degree<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$158,000/year to $223,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Work with internal and external partners to optimize the prescription smart glasses customer experience and drive product adoption\nCreate go-to-market (GTM) strategy to drive product adoption & engagement\nWork with Channel Strategy and Sales teams to identify opportunities for Rx smart glasses distribution\nIdentify market strategy and target audiences, develop product positioning, pricing, and placement, inform forecasting with data and insights, and collaborate across cross-functional teams (marketing, sales, communications, partnerships, etc.) to achieve launch goals\nInfluence product development and support a case for business investment by synthesizing, analyzing, and implementing learnings from customer feedback sources (e.g. in-market feedback, industry reports, competitive assessments, customer research, alpha/beta tests, etc) to strengthen outcomes for product-market-fit\nManage prescription data & analytics with internal and external partners, and uncover actionable insights to drive access and adoption in existing and new channels\nServe as the subject matter expert on prescription wearer and channel needs and mindsets\nManage prescription product claims, content and pricing in B2C and B2B contexts and for wearers with and without insurance", "qualifications": {"required": "5+ years of experience in product marketing, product management, management consulting, business strategy in vision correction and/or eye health fields\nExperience with prescription and health data regulations and compliance\nExperience building partnerships with Product Management and cross-functional teams, and shaping product roadmaps and go-to-market strategies\nExperience analyzing data, and translating to insights that support product development and go to market strategies\nExperience leading implementation of complex product or service offerings\nExperience working with technical partners to translate between technical and consumer languages\nExperience collaborating with external vendors and partners\nBachelor's degree", "preferred": "Experience working independently and adapting in a fast-paced, entrepreneurial, and fluid environment, identifying and escalating issues early and often\nExperience balancing creative and analytical thinking, putting forth best-in-class execution within a measurable and data-driven framework\nExperience working with consumer electronics channels and retailers\nMS/MBA degree"}, "skills": ["Product Marketing", "Product Management", "Management Consulting", "Business Strategy", "Vision Correction", "Eye Health", "Prescription Data", "Health Data Regulations", "Compliance", "Partnerships", "Product Roadmaps", "Go-to-Market Strategies", "Data Analysis", "Insights", "Product Development", "Service Offerings", "Technical Partners", "Consumer Languages", "External Vendors", "Consumer Electronics Channels", "Retailers", "MS", "MBA"], "postedDate": "1 week ago", "benefits": "$158,000/year to $223,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983761695"}