{"jobTitle": "Manager, Influencer Relations and Events - Smashbox", "company": {"name": "Smashbox Cosmetics", "industry": "Personal Care Product Manufacturing", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "85,000.00/yr - 139,600.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Personal Care Product Manufacturing", "description": "Smashbox Cosmetics knows camera-ready beauty. Born out of Smashbox Studios in Los Angeles—the modern-day image factory where countless iconic celebrity and fashion images have been shot—we are a fast-growing, prestige cosmetics brand with domestic and international presence. Staying true to our L.A. studio roots, we are creative and trendsetting, yet laidback and accessible.<br/><br/><strong>Position Objective<br/><br/></strong>Reinvigorate Smashbox legacy and return business profitability through a high-impact, consumer-first earned-driven strategy across multiple key brand priorities. Elevate the brand’s cultural currency to drive relevance and inspired advocacy, maximizing earned investments to ensure brand’s sustainable recovery.<br/><br/>The Manager, Influencer &amp; PR oversees the global strategy and day-to-day execution of earned/paid influencer campaigns for the brand, with a North America focus and regional relevance. The role is responsible for managing key external partners, including but not limited to PR agencies, Influencer agencies, and Influencer Marketing platforms as part of end-to-end campaigns for NPL and Non-Stop. This position connects the brand to pop culture’s most influential talent, collaborations, partnerships, and conversations. This further includes development and leadership of communication strategies, maintaining strong media relations, and working with internal and external stakeholders to advance the brand’s reputation.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>PR and media relations<br/><br/></strong><ul><li> Own the relationship with the PR agency to drive EMV through NPL and always on brand storytelling, including assets and press releases.</li><li> Lead and distribute PR toolkits to each region with materials including key messaging, sample pitch letters, press releases, photography, event guidelines and influencer activation to support affiliate-level strategy execution.</li><li> Drive Earned Media plans execution, and lead Influencers and Brand Ambassadors strategy and day to day management.</li><li> Lead and drive the Micro Influencers program, including ratings and reviews.</li><li> Lead and present regular reports and suggest strategy adjustments to senior leadership based on analysis and data.</li><li> Compile trends and discover new opportunities for brand, media, and platform partnerships and recommend to senior leaders.<br/><br/></li></ul><strong>Global Brand Partnerships and Collaborations<br/><br/></strong><ul><li> Collaborate and lead PR agency and collective partnerships when it comes to events, influencers, community, co-creation with other brands.</li><li> Manage the relationships with influencers to ensure they become evangelists of the brand.</li><li> Work with cross functional partners to lead direction and execute against plans.<br/><br/></li></ul><strong>Strong relationships with media contacts, both new and long-standing <br/><br/></strong><ul><li> Work with regions to create a collective of VIP/Tastemaker/Key Opinion Leaders (KOL’s) that can be tapped into to drive organic content, attend brand events and serve as unofficial ambassadors and serve as liaison between these individuals and the brand.</li><li> Deliver product and brand information PR Agency through press releases, samplings, media inquiries and interviews.</li><li> Build strong PR for Smashbox as a leading make-up brand within the beauty industry through publications like WWD.</li><li> Address public concerns and social responsibility related to brand in a timely and proactive manner.<br/><br/></li></ul><strong>Leverage key insights gleaned from a refined analytics practice to inform decisions <br/><br/></strong><ul><li> Manage Quarterly KPI reports and 360 campaign reporting.</li><li> Manage analytics usage throughout the function accomplish strategic goals.</li><li> Leverage data to inform decision-making for strategy development and adjustments as necessary.</li><li> Lead team to track platform engagement and effectiveness through appropriate analytical tools.<br/><br/></li></ul><strong>Supporting the development of content strategy and execute brand story telling that builds brand love<br/><br/></strong><ul><li> Oversee and support the Director of CE in the execution of the marketing calendar for all PR and influencer related activations.</li><li> Remain relentlessly up to date on emerging and future trends across all relevant industries to identify and grow business opportunities.</li><li> Lead the development of PR &amp; Influencer playbooks for regions that is comprehensive and enables them to launch local marketing strategies.<br/><br/></li></ul><strong>Finance and Budget Management<br/><br/></strong><ul><li> Execute against allocated and assigned budget investment priorities based upon key departmental objectives.<br/><br/></li></ul><strong>Platform and partnership management that supports strategy <br/><br/></strong><ul><li> Support cataloging of existing and potential influencers.</li><li> Collaborate with Product Marketing, E-Commerce and Consumer Marketing teams in paid platform content, activities and strategy.</li><li> Manage schedule to ensure timely press releases and events.</li><li> Support affiliates in developing local partnership strategies.</li><li> Prepare report on ROI for all platform and influencer programs and recommend changes or additions to PR strategy.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Qualifications:<br/><br/></strong><ul><li> Minimum 5 years of PR, Influencer management as well as brand events organization.</li><li> Passion, energy, and enthusiasm for social media and expertise of all social platforms.</li><li> Experience, love and knowledge of beauty landscape and beauty specific social media is a plus.<br/><br/></li></ul><strong>Expert understa</strong><strong>nding</strong><strong> of the social ecosystem and how brands should participate in an authentic way<br/><br/></strong><ul><li> Sophisticated sense of creativity paired with strong communication skills, balanced with the ability to quantify data and analyze performance and results, balancing left brain/right brain capabilities.</li><li> Current with pop culture, entertainment news and industry trends.</li><li> Ability to successfully organize, prioritize and manage multiple projects under strict deadlines.</li><li> A passion for working in a fast-paced environment with high level of teamwork.</li><li> Strategic and creative thinker who can proactively problem solve.<br/><br/></li></ul>The anticipated base salary range for this position is $85,000 to $139,600. Exact salary depends on several factors such as experience, skills, education, and budget. Salary range may vary based on geographic location. In addition to base salary, this position is eligible for participation in a highly competitive bonus program with possibility for overachievement based on performance and company results as well as participation in the share incentive plan.<br/><br/>In addition, The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life, and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.<br/><br/><strong>Job:</strong> Marketing<br/><br/><strong>Primary Location:</strong> Americas-US-CA-Culver City<br/><br/><strong>Job Type:</strong> Standard<br/><br/><strong>Schedule:</strong> Full-time<br/><br/><strong>Shift:</strong> 1st (Day) Shift<br/><br/><strong>Job Number:</strong> 249752<br/><br/>We are an equal opportunity employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. It is Company's policy not to discriminate against any employee or applicant for employment on the basis of race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth and related medical conditions), gender identity or gender expression (including transgender status), sexual orientation, marital status, military service and veteran status, physical or mental disability, protected medical condition as defined by applicable state or local law, genetic information, or any other characteristic protected by applicable federal, state, or local laws and ordinances. The Company will endeavor to provide a reasonable accommodation consistent with the law to otherwise qualified employees and prospective employees with a disability and to employees and prospective employees with needs related to their religious observance or practices. Should you wish to apply for this position or any other position with the Company and you believe you require assistance to complete an application or participate in an interview, please contact USApplicantAccommodations@Estee.com.", "responsibilities": "<strong>PR and media relations<br/><br/></strong><ul><li> Own the relationship with the PR agency to drive EMV through NPL and always on brand storytelling, including assets and press releases.</li><li> Lead and distribute PR toolkits to each region with materials including key messaging, sample pitch letters, press releases, photography, event guidelines and influencer activation to support affiliate-level strategy execution.</li><li> Drive Earned Media plans execution, and lead Influencers and Brand Ambassadors strategy and day to day management.</li><li> Lead and drive the Micro Influencers program, including ratings and reviews.</li><li> Lead and present regular reports and suggest strategy adjustments to senior leadership based on analysis and data.</li><li> Compile trends and discover new opportunities for brand, media, and platform partnerships and recommend to senior leaders.<br/><br/></li></ul><strong>Global Brand Partnerships and Collaborations<br/><br/></strong><ul><li> Collaborate and lead PR agency and collective partnerships when it comes to events, influencers, community, co-creation with other brands.</li><li> Manage the relationships with influencers to ensure they become evangelists of the brand.</li><li> Work with cross functional partners to lead direction and execute against plans.<br/><br/></li></ul><strong>Strong relationships with media contacts, both new and long-standing <br/><br/></strong><ul><li> Work with regions to create a collective of VIP/Tastemaker/Key Opinion Leaders (KOL’s) that can be tapped into to drive organic content, attend brand events and serve as unofficial ambassadors and serve as liaison between these individuals and the brand.</li><li> Deliver product and brand information PR Agency through press releases, samplings, media inquiries and interviews.</li><li> Build strong PR for Smashbox as a leading make-up brand within the beauty industry through publications like WWD.</li><li> Address public concerns and social responsibility related to brand in a timely and proactive manner.<br/><br/></li></ul><strong>Leverage key insights gleaned from a refined analytics practice to inform decisions <br/><br/></strong><ul><li> Manage Quarterly KPI reports and 360 campaign reporting.</li><li> Manage analytics usage throughout the function accomplish strategic goals.</li><li> Leverage data to inform decision-making for strategy development and adjustments as necessary.</li><li> Lead team to track platform engagement and effectiveness through appropriate analytical tools.<br/><br/></li></ul><strong>Supporting the development of content strategy and execute brand story telling that builds brand love<br/><br/></strong><ul><li> Oversee and support the Director of CE in the execution of the marketing calendar for all PR and influencer related activations.</li><li> Remain relentlessly up to date on emerging and future trends across all relevant industries to identify and grow business opportunities.</li><li> Lead the development of PR &amp; Influencer playbooks for regions that is comprehensive and enables them to launch local marketing strategies.<br/><br/></li></ul><strong>Finance and Budget Management<br/><br/></strong><ul><li> Execute against allocated and assigned budget investment priorities based upon key departmental objectives.<br/><br/></li></ul><strong>Platform and partnership management that supports strategy <br/><br/></strong><ul><li> Support cataloging of existing and potential influencers.</li><li> Collaborate with Product Marketing, E-Commerce and Consumer Marketing teams in paid platform content, activities and strategy.</li><li> Manage schedule to ensure timely press releases and events.</li><li> Support affiliates in developing local partnership strategies.</li><li> Prepare report on ROI for all platform and influencer programs and recommend changes or additions to PR strategy.<br/><br/></li></ul>", "qualifications": {"required": "Minimum 5 years of PR, Influencer management as well as brand events organization.<br/>Passion, energy, and enthusiasm for social media and expertise of all social platforms.<br/>Experience, love and knowledge of beauty landscape and beauty specific social media is a plus.<br/><br/>Expert understa\n\nding of the social ecosystem and how brands should participate in an authentic way<br/><br/><ul><li> Sophisticated sense of creativity paired with strong communication skills, balanced with the ability to quantify data and analyze performance and results, balancing left brain/right brain capabilities.</li><li> Current with pop culture, entertainment news and industry trends.</li><li> Ability to successfully organize, prioritize and manage multiple projects under strict deadlines.</li><li> A passion for working in a fast-paced environment with high level of teamwork.</li><li> Strategic and creative thinker who can proactively problem solve.<br/><br/></li></ul>"}, "skills": ["PR", "Influencer Management", "Brand Events", "Social Media", "Beauty", "Analytics", "Communication", "Problem Solving", "Teamwork"], "postedDate": "3 weeks ago", "benefits": "In addition to base salary, this position is eligible for participation in a highly competitive bonus program with possibility for overachievement based on performance and company results as well as participation in the share incentive plan.<br/><br/>In addition, The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life, and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983081541"}