{"jobTitle": "Executive Assistant/Paralegal (Sports & Entertainment)", "company": {"name": "Adams & Martin Group", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$30.00/hr - $40.00/hr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Legal Services", "description": "Seeking an experienced Legal Executive Assistant/ Paralegal to support the Chief administrative officer for LA's number one sports and entertainment agency that represents A-list actors, sport athletes, producers, directors. This is a very high level position supporting the number 2 of the entire sports and entertainment agencies. We can not disclose the name until we interview, please only apply if you meet the requirements.\nRequirements:\n1. 5 years + of experience as a legal EA/ Paralegal would be a plus!\n2. Strong Calendar management for the C-Level executive. \n3. Handle travel arrangements, expense reports, billing.\n4. It's a plus if you can E-file legal documents.\n5. Go-getter that understands and anticipates needs instead of waiting for instructions. (Independent role)\nHybrid schedule M-Thursday on-site and remote on Friday's.\nHours: 8AM-5:00 PM or 9:00AM-6:00PM\nLocation: Century City and parking is covered. \n\n*All qualified applicants will receive consideration for employment without regard to* *race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status.* *We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.*", "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983346025"}