{"jobTitle": "Sr. Manager, Operations", "company": {"name": "A.P. Moller - Maersk", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Landside Asset Management includes jobs that deploy and retire physical land transportation assets (e.g. truck, rail). They are responsible for delivering operational excellence in the lifecycle management of our assets so we can deliver on the promise to our customers in the most cost-efficient way. Responsibilities include: ensuring safe and efficient operation of vehicles, minimizing downtime and safety risks. Management stream includes those who primarily lead people for whom they have employee lifecycle responsibilities including hire/fire decisions, coaching/mentoring, coordination of tasks, appraising performance, pay reviews, and developing for future assignments. The management responsibilities are in addition to job specific accountabilities for objectives such as setting direction and developing business & operational areas, developing policies & practices, and implementing business plans. The planning horizon can vary from short to long term dependent on the career stage and goal achievement is typically accomplished through performance of direct and/or indirect reports. Progression within this stream reflects acquisition of broad technical expertise, business and industry knowledge, and process and people leadership capabilities. A colleague at this level has in-depth knowledge and experience in a functional area. The colleague routinely applies subject matter knowledge to solve common business issues operating within practices and procedures covered by precedents or well-defined policies. A colleague at this level handles most situations independently, receives minimal guidance, but will seek advice, guidance and support on more complex or non-routine topcis. The colleague understands the overall nature of the business and the interdependencies between own and other functions. Leaders at this level are accountable for performance and results in teams of less experienced professionals, frontline workers and admins, and will adapt departmental plans and priorities to address resource and operational challenges.<br/><br/>Maersk is committed to a diverse and inclusive workplace, and we embrace different styles of thinking. Maersk is an equal opportunities employer and welcomes applicants without regard to race, colour, gender, sex, age, religion, creed, national origin, ancestry, citizenship, marital status, sexual orientation, physical or mental disability, medical condition, pregnancy or parental leave, veteran status, gender identity, genetic information, or any other characteristic protected by applicable law. We will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.<br/><br/>We are happy to support your need for any adjustments during the application and hiring process. If you need special assistance or an accommodation to use our website, apply for a position, or to perform a job, please contact us by emailing accommodationrequests@maersk.com.", "postedDate": "1 day ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3983415378"}