{"jobTitle": "Client Partnership Assistant Manager", "company": {"name": "Saatchi & Saatchi (We Are Saatchi)", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$46,000.00 - $68,500.00", "currency": "USD"}, "jobFunction": "Advertising", "industry": "Advertising Services", "description": "At Saatchi we believe in creating ideas that can live anywhere. And we believe that when we work as a team, nothing is impossible. We strive to bring out the best in each other and in ourselves and expect applicants to understand the value of close collaboration. We also believe that creating transformational work requires initiative, an entrepreneurial spirit and a bold commitment to achieving measurable results and business success for the Clients we service.<br/><br/>\n\n<strong>Job Description<br/><br/></strong><p>As Client Partnership Assistant Manager on the Brand &amp; Design team, you are key support for delivery of the executions, products, or deliverables to which you are assigned. With oversight from your manager, you will be responsible for internal logistics, schedules, and timing of deliverables for assigned tasks or outputs. This also includes connecting resources internally to ensure on-time delivery to clients. </p><p>Success for this position is measured by, but not limited to, understanding agency processes, eagerness to continually learn and grow in the position, manage multiple projects successfully to completion, and demonstrate strong organizational skills.</p><p>Ideal candidates will be self-driven, organized, offer strong verbal and written communication skills, excellent time management skills, the ability to multi-task and effectively partner and collaborate across teams.</p><p><strong><u>Responsibilities include, but are not limited to:</u></strong></p><ul><li>Support the management of internal workflow, including internal and external routing and feedback distribution, preparing assets for distribution, developing and maintaining schedules, serve as key internal lead for client meeting preparation, and documentation and distribution of meeting decisions and next steps.</li><li>Directly oversee project maintenance, including folder and file organization and archiving.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><p><strong><u>We are looking for candidates with the following background and capabilities:</u></strong></p><ul><li>1-2 years of client service or project management experience in an ad agency, or related field, managing projects across multiple media, including digital, video, social, print, large-scale website maintenance, application or digital product initiatives. Previous vehicle or similar scale client experience preferred.</li><li>Experience developing collaborative relationships with colleagues and clients. Confident supporting recommendations and ideas driven by business context and creative opportunity. Demonstrate strong client service techniques, including documentation of feedback, solicitation of viewpoints, anticipation of questions or challenges.  </li><li>Exposure to multidisciplinary campaigns or large-scale projects from project brief through delivery, including experience with client management, scheduling, budget management, and best practices within production. Ability to support multiple streams of work concurrently while meeting deadlines and maintaining proper documentation.</li><li>Knowledge of Microsoft Office 365, Google Docs, PowerPoint, Keynote, Acrobat Professional, Smartsheet, PM related workflow and reporting tools.</li></ul><p><strong><u>We prioritize attributes and soft skills, including:</u></strong></p><ul><li>Eager to learn, achieve, take initiative, and maintain an incredibly high level of detail.</li><li>Maintain focus under pressure, keep a positive and collaborative yet confident demeanor and quickly facilitate others involvement when necessary.</li><li>Communicate internally and externally, across multiple levels, with clarity, honesty and integrity while demonstrating exceptional verbal and on-screen presentation skills.</li><li>Expects of self and others high standards for work and behavior; accountable, assertive and dependable. Strong attention to detail and able to prioritize tasks and manage time effectively.</li><li>Desire to remain current in industry topics by seeking constant learning opportunities and improvement.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong><p>All your information will be kept confidential according to EEO guidelines.</p><p><em>Compensation Range: $46,000.00 - $68,500.00 annually. This is the pay range the Company believes it will pay for this position at the time of this posting. Consistent with applicable law, compensation will be determined based on the skills, qualifications, and experience of the applicant along with the requirements of the position, and the Company reserves the right to modify this pay range at any time. For this role, the Company will offer medical coverage, dental, vision, disability, 401k, and paid time off. </em>The Company anticipates the application deadline for this job posting will be 08/20/2024.</p>", "responsibilities": "Support the management of internal workflow, including internal and external routing and feedback distribution, preparing assets for distribution, developing and maintaining schedules, serve as key internal lead for client meeting preparation, and documentation and distribution of meeting decisions and next steps.Directly oversee project maintenance, including folder and file organization and archiving.", "qualifications": {"required": "1-2 years of client service or project management experience in an ad agency, or related field, managing projects across multiple media, including digital, video, social, print, large-scale website maintenance, application or digital product initiatives. Previous vehicle or similar scale client experience preferred.Experience developing collaborative relationships with colleagues and clients. Confident supporting recommendations and ideas driven by business context and creative opportunity. Demonstrate strong client service techniques, including documentation of feedback, solicitation of viewpoints, anticipation of questions or challenges.  Exposure to multidisciplinary campaigns or large-scale projects from project brief through delivery, including experience with client management, scheduling, budget management, and best practices within production. Ability to support multiple streams of work concurrently while meeting deadlines and maintaining proper documentation.Knowledge of Microsoft Office 365, Google Docs, PowerPoint, Keynote, Acrobat Professional, Smartsheet, PM related workflow and reporting tools.", "preferred": "Eager to learn, achieve, take initiative, and maintain an incredibly high level of detail.Maintain focus under pressure, keep a positive and collaborative yet confident demeanor and quickly facilitate others involvement when necessary.Communicate internally and externally, across multiple levels, with clarity, honesty and integrity while demonstrating exceptional verbal and on-screen presentation skills.Expects of self and others high standards for work and behavior; accountable, assertive and dependable. Strong attention to detail and able to prioritize tasks and manage time effectively.Desire to remain current in industry topics by seeking constant learning opportunities and improvement."}, "skills": ["Client Service", "Project Management", "Digital", "Video", "Social", "Print", "Website Maintenance", "Application", "Digital Product Initiatives", "Client Management", "Scheduling", "Budget Management", "Production", "Microsoft Office 365", "Google Docs", "PowerPoint", "Keynote", "Acrobat Professional", "Smartsheet", "PM", "Workflow", "Reporting Tools"], "postedDate": "1 month ago", "applicationDeadline": "08/20/2024", "benefits": "medical coverage, dental, vision, disability, 401k, and paid time off", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983443265"}