{"jobTitle": "Associate Planner", "company": {"name": "SPT Labtech", "location": "Covina, CA"}, "location": "Covina, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Manufacturing", "industry": "Biotechnology Research", "description": "SPT Labtech is a global supplier of innovative lab automation products for the life science markets. Our solutions save time and material costs and simplify complex operations. We are natural innovators. We create, design and manufacture high quality, robust and innovative automated laboratory equipment for academic, pharmaceutical and biotechnology research.<br/><br/><strong>The Associate Planner</strong> is responsible for ensuring that all materials and goods required for production go to the right place. The Associate Planner will work closely with the Sr. Master Planner to ensure everything runs smoothly. Overseeing daily work orders and material requests for both the Apricot and BML lines. Duties include communicating with Customer Service, Supply Chain, Production, Quality Control, and Shipping/Receiving. Representatives are also responsible for compiling data and value-added service information.<br/><br/><strong>Position Responsibilities:<br/><br/></strong><ul><li>Receipt and processing of incoming Work Orders</li><li>Create and deliver Material Requests and Purchase Requisitions to the Supply Chain department to support the production schedule</li><li>Establish and track work-in-progress (WIP) schedules to ensure products meet delivery and quality standards</li><li>Provide day-to-day updates on open orders</li><li>Answer Customer Support, Supply Chain, and Production questions on product status</li><li>Manage Manufacturer and Build Orders with the Machine Shop to ensure parts are on schedule</li><li>Work with Quality Control to arrange priorities of products flowing through the department</li><li>Work with Shipping and Receiving to ensure ordered products are delivered to the correct departments<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>High school diploma</li><li>2+ years of experience</li><li>Proficient keyboard and computer skills, including functional knowledge of Excel and MS Word, or equivalent spreadsheet and word processing applications. MRP experience a plus</li><li>Numerate and accurate, particularly in relation to data integrity</li><li>Possess a positive attitude, sensitivity to internal customers' needs, enthusiasm and exceptional listening skills</li><li>Excellent analytical and process flow optimization skills allowing for basic trouble shooting</li><li>Excellent time management skills</li><li>Ability to multitask</li><li>Able to coordinate and mitigate diverse types of planning situations</li><li>Other duties as assigned. <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>401(k)</li><li>Dental insurance</li><li>Health insurance</li><li>Life insurance</li><li>Paid time off</li><li>Vision insurance<br/><br/></li></ul>Our company culture supports diversity and is inclusive of all regardless of race, ethnicity, gender, gender identity, sexual orientation, physical ability, or family status, and we endeavor to support our employees' needs to the best of our abilit", "responsibilities": "The Associate Planner is responsible for ensuring that all materials and goods required for production go to the right place. The Associate Planner will work closely with the Sr. Master Planner to ensure everything runs smoothly. Overseeing daily work orders and material requests for both the Apricot and BML lines. Duties include communicating with Customer Service, Supply Chain, Production, Quality Control, and Shipping/Receiving. Representatives are also responsible for compiling data and value-added service information.", "qualifications": {"required": "High school diploma, 2+ years of experience, Proficient keyboard and computer skills, including functional knowledge of Excel and MS Word, or equivalent spreadsheet and word processing applications. MRP experience a plus, Numerate and accurate, particularly in relation to data integrity, Possess a positive attitude, sensitivity to internal customers' needs, enthusiasm and exceptional listening skills, Excellent analytical and process flow optimization skills allowing for basic trouble shooting, Excellent time management skills, Ability to multitask, Able to coordinate and mitigate diverse types of planning situations, Other duties as assigned.", "preferred": ""}, "skills": ["Excel", "MS Word", "MRP"], "postedDate": "1 month ago", "benefits": "401(k), Dental insurance, Health insurance, Life insurance, Paid time off, Vision insurance", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983583553"}