{"jobTitle": "VP, Global Procurement & Vendor Management", "company": {"name": "Pacific Life", "location": "Newport Beach, CA", "industry": "Insurance"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Purchasing and Supply Chain", "industry": "Insurance", "description": "Providing for loved ones, planning rewarding retirements, saving enough for whatever lies ahead – our policyholders count on us to be there when it matters most. It’s a big ask, but it’s one that we have the power to deliver when we work together. We collaborate and innovate – pushing one another to transform not just Pacific Life, but the entire industry for the better. Why? Because it’s the right thing to do. Pacific Life is more than a job, it’s a career with purpose. It’s a career where you have the support, balance, and resources to make a positive impact on the future – including your own.<br/><br/>We’re actively seeking a talented VP, Global Procurement and Vendor Management to join our Corporate Division. This role is on-site or hybrid in our state-of-the-art Newport Beach headquarters.<br/><br/>As a VP, Global Procurement And Vendor Management, You’ll Move Pacific Life, And Your Career, Forward Through Strategic Leadership Managing The Procurement &amp; Vendor Management And Third Party Risk Management Global Functions, Reporting Into a SVP Under The CFO. You Will Have Overall Accountability In The Following Areas<br/><br/><ul><li>Develop and execute the vision of the Procurement/Vendor Management/Third Party Risk Management (TPRM) Global Strategy.</li><li>Manage all strategy initiatives across the enterprise including Sourcing/Category Management, Vendor Management, Contract Management, TPRM and Procurement Operations.</li><li>Collaborate and partner with business partners and their vendors to continuously assess future state business needs. </li><li>Establish standard processes, policies, controls, governance, and performance management which aligns with PL’s objective to boost customer service to internal partners/key stakeholder in the organization.</li><li>Lead a high-performance culture and ensure proper implementation of leading edge procurement /vendor management capabilities.<br/><br/></li></ul><strong>The Experience You Bring<br/><br/></strong><ul><li>Bachelor’s Degree, MBA or advanced degree preferred</li><li>Knowledge of and proficiency in ERP and Procurement system</li><li>10+ yrs of relevant experience in finance industry with at least 5+ yrs of people management</li><li>Global mindset of sourcing and procurement processes across all functions (sourcing, contract management, vendor management, procurement, TPRM)</li><li>Strategic and organizational agility with strong project management skills</li><li>Willing to take on new assignments and opportunities that stretch skills.</li><li>Ability to motivate and influence others inside and outside of own organizational hierarchy</li><li>Ability to build relationships and work effectively with internal customers of PL and their management</li><li>Ability to deal with change and ambiguity effectively<br/><br/></li></ul>You can be who you are.<br/><br/>People come first here. We’re committed to a diverse, equitable and inclusive workforce. Learn more about how we create a welcoming work environment through Diversity, Equity, and Inclusion at www.pacificlife.com. What’s life like at Pacific Life? Visit Instagram.com/lifeatpacificlife.<br/><br/>Benefits start Day 1.<br/><br/>Your wellbeing is important. We’re committed to providing flexible benefits that you can tailor to meet your needs. Whether you are focusing on your physical, financial, emotional, or social wellbeing, we’ve got you covered.<br/><br/><ul><li> Prioritization of your health and well-being including Medical, Dental, Vision, and a Wellbeing Reimbursement Account that can be used on yourself or your eligible dependents</li><li> Generous paid time off options including Paid Time Off, Holiday Schedules, and Financial Planning Time Off</li><li> Paid Parental Leave as well as an Adoption Assistance Program</li><li> Competitive 401k savings plan with company match and an additional contribution regardless of participation<br/><br/></li></ul><strong>Base Pay Range<br/><br/></strong>The base pay range noted represents the company’s good faith minimum and maximum range for this role at the time of posting. The actual compensation offered to a candidate will be dependent upon several factors, including but not limited to experience, qualifications and geographic location. Also, most employees are eligible for additional incentive pay.<br/><br/><strong>Your Benefits Start Day 1<br/><br/></strong>Your wellbeing is important to Pacific Life, and we’re committed to providing you with flexible benefits that you can tailor to meet your needs. Whether you are focusing on your physical, financial, emotional, or social wellbeing, we’ve got you covered.<br/><br/><ul><li>Prioritization of your health and well-being including Medical, Dental, Vision, and Wellbeing Reimbursement Account that can be used on yourself or your eligible dependents</li><li>Generous paid time off options including: Paid Time Off, Holiday Schedules, and Financial Planning Time Off </li><li>Paid Parental Leave as well as an Adoption Assistance Program</li><li>Competitive 401k savings plan with company match and an additional contribution regardless of participation<br/><br/></li></ul><strong>EEO Statement<br/><br/></strong><em>Pacific Life Insurance Company is an Equal Opportunity /Affirmative Action Employer, M/F/D/V. If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our career center as a result of your disability. To request an accommodation, contact a Human Resources Representative at Pacific Life Insurance Company.<br/><br/></em>", "responsibilities": "As a VP, Global Procurement And Vendor Management, You’ll Move Pacific Life, And Your Career, Forward Through Strategic Leadership Managing The Procurement &amp; Vendor Management And Third Party Risk Management Global Functions, Reporting Into a SVP Under The CFO. You Will Have Overall Accountability In The Following Areas<br/><br/><ul><li>Develop and execute the vision of the Procurement/Vendor Management/Third Party Risk Management (TPRM) Global Strategy.</li><li>Manage all strategy initiatives across the enterprise including Sourcing/Category Management, Vendor Management, Contract Management, TPRM and Procurement Operations.</li><li>Collaborate and partner with business partners and their vendors to continuously assess future state business needs. </li><li>Establish standard processes, policies, controls, governance, and performance management which aligns with PL’s objective to boost customer service to internal partners/key stakeholder in the organization.</li><li>Lead a high-performance culture and ensure proper implementation of leading edge procurement /vendor management capabilities.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree, MBA or advanced degree preferred\nKnowledge of and proficiency in ERP and Procurement system\n10+ yrs of relevant experience in finance industry with at least 5+ yrs of people management\nGlobal mindset of sourcing and procurement processes across all functions (sourcing, contract management, vendor management, procurement, TPRM)\nStrategic and organizational agility with strong project management skills\nWilling to take on new assignments and opportunities that stretch skills.\nAbility to motivate and influence others inside and outside of own organizational hierarchy\nAbility to build relationships and work effectively with internal customers of PL and their management\nAbility to deal with change and ambiguity effectively<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "Your wellbeing is important. We’re committed to providing flexible benefits that you can tailor to meet your needs. Whether you are focusing on your physical, financial, emotional, or social wellbeing, we’ve got you covered.<br/><br/><ul><li> Prioritization of your health and well-being including Medical, Dental, Vision, and a Wellbeing Reimbursement Account that can be used on yourself or your eligible dependents</li><li> Generous paid time off options including Paid Time Off, Holiday Schedules, and Financial Planning Time Off</li><li> Paid Parental Leave as well as an Adoption Assistance Program</li><li> Competitive 401k savings plan with company match and an additional contribution regardless of participation<br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983429990"}