{"jobTitle": "Measurement Analyst, Campaign Effectiveness", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$70,000 - $420,000"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>Responsibilities<br/><br/></strong>Netflix is one of the world's leading streaming entertainment services with over 231 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and mobile games across a wide variety of genres and languages. Members can play, pause and resume watching as they want, anytime, anywhere, and can change their plans at any time. The core Advertising team is charged with building a new, best-in-class ads organization to establish Netflix as the premiere platform for advertiser partners, and to drive advertising revenue. The measurement team is responsible for building audience insights and measurement solutions from the ground up, partnering closely with data science, consumer insights, product, and sales to understand core customer needs and develop both foundational and innovative solutions. In this role, you will:<br/><br/><ul><li>Focus on causal test and learn solutions e.g. Brand Effectiveness, Incremental lift (online sales, offline-sales, in-store foot traffic, etc.).</li><li>Manage day-to-day effectiveness study execution process with 3rd party vendors from end-to-end e.g. sales request, vendor intake, survey drafting (if applicable), analysis, report creation, and presentation.</li><li>Synthesize measurement output and tell a comprehensive story.</li><li>Support Manager of Campaign Effectiveness on advertiser and category-specific learning agendas &amp; playbooks for Netflix.</li><li>Consult with sales and advertiser clients on KPIs and make measurement recommendations that will help optimize their media plans on Netflix.</li><li>Develop case studies from ongoing and completed analyses.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>4-6 years in media measurement at a streaming, digital, or TV company.</li><li>Dual TV/Video and digital experience is a plus.</li><li>Expertise in effectiveness or causal measurement such as Incremental lift, Brand lift, Geo lift, Matched Market testing, Multi-Cell testing, A/B testing.</li><li>Self-starter with expertise in managing large-scale, complex projects.</li><li>Strong knowledge of the advertising landscape, across all kinds of media channels and methods of buying.</li><li>Loves to get into the weeds and can see the big picture.</li><li>Open to innovating, challenging assumptions and implementing better approaches.</li><li>Knowledge of quantitative and qualitative methodologies.</li><li>Understanding of the consumer’s voice and how to turn that into actionable insights.</li><li>A strong business partner to other cross-functional teams and a leader who can prioritize multiple projects.</li><li>Collaborates effectively and embraces differing perspectives and experiences to make better decisions.</li><li>Experienced and at ease with diverse cultures and working in international environments.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $70,000 - $420,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3983498001"}