{"jobTitle": "Restaurant Manager - Popeyes #11855 - Westminster, CA", "company": {"name": "Denco Family, Inc.", "location": "Westminster, CA"}, "location": "Westminster, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "Are you ready to take your management career to the next level with Popeyes, the world's most flavorful chicken restaurant? We are on the lookout for enthusiastic and dedicated Restaurant Managers to lead our dynamic teams and serve up the bold flavors that have made Popeyes famous. We are looking for an organized and goal-oriented Restaurant Manager to oversee the running of our Popeyes restaurant located in Westminster, CA. This position will profitably operate the restaurant within the practice and procedures established by company operations. Having sole charge responsibility for the restaurant. <br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li>Promotes Company Mission, Vision and Core Values.</li><li>Willingly assists others without being asked.</li><li>Prepares and interprets financial and operational reports and schedules, analyzes data and develops solutions to ensure operating goals are achieved.</li><li>Directs restaurant operations with responsibility for guest service, brand standards execution and employee training.</li><li>Achieves controllable profit and flow thru goals by overseeing all controllable costs and taking the appropriate corrective action to achieve the desired result.</li><li>Ensures timely implementation, training and ongoing execution of all corporate initiatives and marketing promotions.</li><li>Develops Assistant Managers, shift leaders, and other hourly employees through corporate training programs, individual development plans and assignments; provides coaching and constructive feedback to employees as needed.</li><li>Ensures all equipment and facilities are in compliance with Brand Standards and all government regulations and takes corrective action when required.</li><li>Attracts, hires, onboards and retains the best hourly talent to meet staffing requirements and guest service standards.</li><li>Proactively handles employee relations issues and deviations from Brand Standards; involves the AM and Human Resources Manager as appropriate to resolve issues.</li><li>Develops and executes the local store marketing plan to build relationships with civic, business, school, and professional organizations to drive sales and guest counts.</li><li>Monitors that proper security procedures are in place to protect employees, guests and company assets .</li><li>Enforces sanitary practices for food handling, general cleanliness and maintenance of kitchen, dining areas and restrooms.</li><li>Works to create and maintain an enjoyable and respectful environment for our guests and employees.</li><li>Maintains compliance with all employer’s employment policies and Brand Standards to include all state, local and federal regulations.</li><li>Follows management cash handling, inventory and other operational procedures as outlined by the employer. </li><li>Maintains &amp; implements a strong commitment to guest satisfaction.</li><li>Responsible for maintaining all hourly personnel files in accordance with federal, state and local law.</li><li>Completes all other tasks and duties as assigned.</li><li>Other duties may be assigned to meet business needs.<br/><br/></li></ul><strong>Employee Benefits<br/><br/></strong><ul><li>We offer 401k, Medical, Dental and Vision insurance to full-time employees.</li><li>Employee Discount - receive a 50% discount on meals during your shifts.</li><li>FREE Beverages - receive free soft drinks, tea and water during your shifts.</li><li>FREE Uniform - receive a brand-new uniform at orientation.</li><li>Company-wide discount - receive a 25% discount at over 40 company-affiliated restaurants!</li><li>Flexible Schedules - we’ll work with you because employee work/life balance matters!</li><li>Employee Referral Bonus - refer a friend and get paid!</li><li>Employee Assistance Program - receive confidential, personal, &amp; web-based support on a variety of important topics such as stress management, dependent care, nutrition, legal &amp; finances.</li><li>Advancement - On-the-job skills training to prepare employees for upward mobility opportunities. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum of 2 years experience in restaurant, hospitality or retail management, additional operations and/or leadership experience strongly preferred.</li><li>Associate’s or Bachelor’s degree preferred or equivalent combination of education and experience. </li><li>Ability to work a minimum of 55 hours a week.</li><li>Food Safety Manager certification required.</li><li>Strong organizational skills with excellent oral and written communication skills and the ability to communicate with all levels of the organization.</li><li>Ability to communicate effectively, both orally and in writing, in the English language.</li><li>Possesses basic math skills (add, subtract, multiply, divide).</li><li>Places a value on diversity and shows respect for others.</li><li>Proven ability to problem solve and handle high stress situations. </li><li>Ability to interpret financial statements and understand contributing factors .</li><li>Must be able to perform job duties of every position.</li><li>Must be prepared to multitask in accordance with the demands of the business.</li><li>Ability to identify and anticipate opportunities and implement corrective action steps.</li><li>Ability to work weekends, holidays, and evenings.</li><li>Has reliable transportation in order to meet banking obligations.</li><li>Must be capable of exerting up to 100 pounds of force occasionally, and/or up to 50 pounds of force frequently, and/or up to 20 pounds of force constantly to move objects.<br/><br/></li></ul><strong>Physical Demands Of The Job<br/><br/></strong><ul><li>Consistently carries products/boxes and miscellaneous weighing no more than 70 pounds.</li><li>Occasionally climbs ladders to roof to check A/C exhaust fan.</li><li>Consistently operates registers, calculator, Norand, Fastfax, mail and product.</li><li>Consistently handles product preparation.</li><li>Consistently hears to communicate with employees, customers and suppliers.</li><li>Consistently kneels to utilize proper lifting procedures and to open safe.</li><li>Consistently lifts for product preparation, stocking and inventory.</li><li>Consistently pushes to open and close doors to store and storage shed and office as well as cooler and freezers.</li><li>Consistently reaches for product preparation and serving customers and for training.</li><li>Consistently sees during all activities.</li><li>Rarely sits during the preparation of reports and bank deposits.</li><li>Frequently stands during serving customers and training.</li><li>Frequently stoops to pick up supplies and trash.</li><li>Consistently talks to employees, customers, suppliers and company representatives.<br/><br/></li></ul><strong>This job description is intended to describe the general nature and level of work being performed by the employees assigned to this position. It is not intended to be an exhaustive list of all duties, responsibilities or tasks which may be required to be performed in this position. Employer may amend, change, or modify the responsibilities and duties of this position to meet business needs as necessary. This job description does not constitute a contract for employment and may be changed at the discretion of the employer with or without notice.<br/><br/></strong><strong>Denco Family, Inc is an Equal Opportunity/Affirmative Action Employer. As an Equal Opportunity Employer, we do not discriminate on the basis of age, race, sex, sexual orientation, gender identity, gender expression, color, religion, national origin, disability, genetic information, or any other status protected by federal, state or local law.</strong>", "responsibilities": "Promotes Company Mission, Vision and Core Values. Willingly assists others without being asked. Prepares and interprets financial and operational reports and schedules, analyzes data and develops solutions to ensure operating goals are achieved. Directs restaurant operations with responsibility for guest service, brand standards execution and employee training. Achieves controllable profit and flow thru goals by overseeing all controllable costs and taking the appropriate corrective action to achieve the desired result. Ensures timely implementation, training and ongoing execution of all corporate initiatives and marketing promotions. Develops Assistant Managers, shift leaders, and other hourly employees through corporate training programs, individual development plans and assignments; provides coaching and constructive feedback to employees as needed. Ensures all equipment and facilities are in compliance with Brand Standards and all government regulations and takes corrective action when required. Attracts, hires, onboards and retains the best hourly talent to meet staffing requirements and guest service standards. Proactively handles employee relations issues and deviations from Brand Standards; involves the AM and Human Resources Manager as appropriate to resolve issues. Develops and executes the local store marketing plan to build relationships with civic, business, school, and professional organizations to drive sales and guest counts. Monitors that proper security procedures are in place to protect employees, guests and company assets . Enforces sanitary practices for food handling, general cleanliness and maintenance of kitchen, dining areas and restrooms. Works to create and maintain an enjoyable and respectful environment for our guests and employees. Maintains compliance with all employer’s employment policies and Brand Standards to include all state, local and federal regulations. Follows management cash handling, inventory and other operational procedures as outlined by the employer.  Maintains &amp; implements a strong commitment to guest satisfaction. Responsible for maintaining all hourly personnel files in accordance with federal, state and local law. Completes all other tasks and duties as assigned. Other duties may be assigned to meet business needs.", "qualifications": {"required": "Minimum of 2 years experience in restaurant, hospitality or retail management, additional operations and/or leadership experience strongly preferred. Ability to work a minimum of 55 hours a week. Food Safety Manager certification required. Strong organizational skills with excellent oral and written communication skills and the ability to communicate with all levels of the organization. Ability to communicate effectively, both orally and in writing, in the English language. Possesses basic math skills (add, subtract, multiply, divide). Places a value on diversity and shows respect for others. Proven ability to problem solve and handle high stress situations.  Ability to interpret financial statements and understand contributing factors . Must be able to perform job duties of every position. Must be prepared to multitask in accordance with the demands of the business. Ability to identify and anticipate opportunities and implement corrective action steps. Ability to work weekends, holidays, and evenings. Has reliable transportation in order to meet banking obligations. Must be capable of exerting up to 100 pounds of force occasionally, and/or up to 50 pounds of force frequently, and/or up to 20 pounds of force constantly to move objects.", "preferred": "Associate’s or Bachelor’s degree preferred or equivalent combination of education and experience."}, "skills": [], "postedDate": "1 month ago", "benefits": "We offer 401k, Medical, Dental and Vision insurance to full-time employees. Employee Discount - receive a 50% discount on meals during your shifts. FREE Beverages - receive free soft drinks, tea and water during your shifts. FREE Uniform - receive a brand-new uniform at orientation. Company-wide discount - receive a 25% discount at over 40 company-affiliated restaurants! Flexible Schedules - we’ll work with you because employee work/life balance matters! Employee Referral Bonus - refer a friend and get paid! Employee Assistance Program - receive confidential, personal, &amp; web-based support on a variety of important topics such as stress management, dependent care, nutrition, legal &amp; finances. Advancement - On-the-job skills training to prepare employees for upward mobility opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983243965"}