{"jobTitle": "Warehouse Associate", "company": {"name": "Galls", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Public Safety", "description": "Galls, LLC is the largest and fastest growing supplier of uniforms and equipment to public safety professionals with a national presence in more than 80 locations across the nation. With over 50 years in the industry, it is easy to see why. We are PROUD to Serve America’s public safety professionals by providing the broadest selection of uniforms, equipment and solutions combined with great customer service.<br/><br/><strong>Job Summary<br/><br/></strong>As a Warehouse Associate at Galls, you will be responsible for all aspects of Inbound/Outbound functions to assure product is received and put away in the warehouse so that all received orders can be filled timely and accurately while maintaining the warehouse in a safe and orderly fashion.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Receive product, count and sort merchandise by location, product number, and description </li><li>Store merchandise on shelves, according to identifying information such as style, size, color, or type of material </li><li>Replenish active locations with product to assure order can be fulfilled timely </li><li>Print and sort pick tickets according to designated area of the warehouse to fulfill orders and match up with packing list and carton shipping label </li><li>Construct boxes according to size required for order and place appropriate documentation and label on/in box and place on conveyor line for fulfillment of orders </li><li>Utilize tools available (RF Gun and/or Pick Pack Sheet) to efficiently pick customer orders for shipment while assuring correct item and quantity is picked </li><li>Audit (random) complete orders to assure 100% quality </li><li>Maintain a clean, neat, and orderly work area </li><li>Conduct operations in a manner that promotes safety. Comply with company, OSHA, and other applicable regulations to assure a safe workplace </li><li>Actively seek to develop process/quality improvements and communicate them to leadership </li><li>Work as a team to accomplish all productivity goals efficiently and accurately </li><li>Other duties may be assigned <br/><br/></li></ul><strong>What You Bring<br/><br/></strong><ul><li>Prior experience working in warehouse setting strongly desired </li><li>Basic computer skills, experience with MS Excel and Warehouse Management Systems (WMS) preferred </li><li>Ability to read, write, speak, and understand English to understand and execute instructions for daily tasks and to read orders accurately </li><li>Proactive problem-solving skills, and ability to complete basic math to include adding, subtracting, multiplying, and dividing </li><li>Highly organized and strong attention to accuracy and detail </li><li>Ability to work in a fast-paced environment and meet daily productivity standards </li><li>Radio Frequency (RF) Gun Experience preferred </li><li>Ability to work overtime during work week and weekends, while complying with Galls attendance policy </li><li>Capable of standing and walking for extended periods of time, work in a non-climate-controlled environment, and lift up to 60lbs, with or without reasonable accommodation <br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Excellent medical/dental and vision coverage— Eligible 1st day of the month after start date </li><li>401(k) retirement plan with company contribution (because you will retire someday) </li><li>Flexible benefits—choose what you like, ignore the rest </li><li>Generous employee discount </li><li>Vacation and Personal Time </li><li>Paid Holidays </li><li>Tuition reimbursement </li><li>Daily Pay; up to 50% of your pay <br/><br/></li></ul><em>Galls is an EEO/AA/Minorities/Female/Disabled/Veterans Employer. If you need accommodation for any part of the employment process because of a medical condition or disability, please call Human Resources at 859-266-7227 with the nature of your accommodation request and include the Galls location and the title of the job opening.</em>", "responsibilities": "As a Warehouse Associate at Galls, you will be responsible for all aspects of Inbound/Outbound functions to assure product is received and put away in the warehouse so that all received orders can be filled timely and accurately while maintaining the warehouse in a safe and orderly fashion.", "qualifications": {"required": "Prior experience working in warehouse setting strongly desired, Basic computer skills, experience with MS Excel and Warehouse Management Systems (WMS) preferred, Ability to read, write, speak, and understand English to understand and execute instructions for daily tasks and to read orders accurately, Proactive problem-solving skills, and ability to complete basic math to include adding, subtracting, multiplying, and dividing, Highly organized and strong attention to accuracy and detail, Ability to work in a fast-paced environment and meet daily productivity standards, Radio Frequency (RF) Gun Experience preferred, Ability to work overtime during work week and weekends, while complying with Galls attendance policy, Capable of standing and walking for extended periods of time, work in a non-climate-controlled environment, and lift up to 60lbs, with or without reasonable accommodation", "preferred": "Basic computer skills, experience with MS Excel and Warehouse Management Systems (WMS) preferred, Radio Frequency (RF) Gun Experience preferred"}, "skills": ["Warehouse", "MS Excel", "WMS", "Problem Solving", "RF Gun"], "postedDate": "1 month ago", "benefits": "Excellent medical/dental and vision coverage— Eligible 1st day of the month after start date, 401(k) retirement plan with company contribution (because you will retire someday), Flexible benefits—choose what you like, ignore the rest, Generous employee discount, Vacation and Personal Time, Paid Holidays, Tuition reimbursement, Daily Pay; up to 50% of your pay", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983196340"}