{"jobTitle": "Human Resources Business Partner-David Geffen School of Medicine", "company": {"name": "UCLA Health", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care and Higher Education"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "109,600.00/yr - 202,200.00/yr", "currency": "USD"}, "jobFunction": "Strategy/Planning", "industry": "Hospitals and Health Care and Higher Education", "description": "In this role, you will be responsible for supporting business strategy and results within their business unit(s) through the execution of talent management and workforce strategies. As our HR Business Partner, you will assess and anticipate HR-related needs and communicate proactively with department leadership and central HR. Working in partnership with department leadership, you will provide innovative and customer-focused solutions to advance departmental goals and objectives and increase overall organizational effectiveness. You will leverage partnerships with central HR services to promote process efficiency across business lines.", "responsibilities": "In this role, you will also participate in the accountability, goal setting, and objectives of a Staff Human Resources team, providing guidance and consultation to assigned business units and team members.", "qualifications": {"required": "At least 5 years experience in Business and HR Consultation, Organizational Effectiveness, and HR Administration. Demonstrated experience as an HR Business Partner strongly preferred Experience with Microsoft Office required, experience with UC Path/Peoplesoft, Project Management or CRM software preferred. Demonstrated knowledge of human resources concepts, employment practices, employee/labor relations, salary administration, recruitment, training, and other areas of human resources. Demonstrated analytical skills to conduct analysis, develop recommendations, and resolve organizational issues. Demonstrated ability to effectively prioritize and manage divergent needs in a large, matrixed environment. Strong analytical skills with the ability to develop high level reports and conduct data analysis. Demonstrated ability to work collaboratively with department and organization leaders and interpersonal skills to inform and consult with senior level leaders. Strong project management and change management skills.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Vision insurance, Dental insurance, Pension plan, Paid maternity leave, Paid paternity leave, Commuter benefits, Tuition assistance, Disability insurance, Medical insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983081898"}