{"jobTitle": "Dealer Relations Manager", "company": {"name": "BizzyCar", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Customer Service", "industry": "Technology, Information and Internet", "description": "Ideal Candidate\nAs a Dealer Relations Manager for BizzyCar, you will be the key driver of our company's success by managing and growing relationships with automotive dealerships. You will ensure our dealership partners effectively use our cutting-edge software solutions, thereby improving their operational efficiency and profitability. You have practical experience, a comprehensive understanding, and strong working knowledge of how an automotive dealership runs day to day. You continually strive to meet or exceed expectations in all aspects of your role, from servicing our partners to proactively contributing and collaborating with the team and dealerships. Your role encompasses product implementation, training, and continuous support, all while fostering strong, long-lasting relationships with dealership management teams. This position involves substantial travel in your defined region and nationally as needed.\nKey Responsibilities:\nCustomer Relationship Management:\n* Serve as the primary point of contact for dealership partners, managing day-to-day relationships and championing the adoption of our software\n* Build and maintain strong relationships across all dealership departments, including sales, service, and store management- Dealer Principlas and General Managers\n* Ensure a best-in-class customer experience through comprehensive onboarding, account maintenance, and proactive issue resolution\n* Conduct regular performance visits to dealerships, providing ongoing training and support\n* Responsible for day-to-day dealer relationship management and champion the adoption and ongoing use of the company product in the dealerships\nProduct Implementation and Support:\n* Execute launch planning, manage product implementation, and deliver initial and ongoing training tailored to dealership needs\n* Ensure that product changes, new features, and releases are communicated and implemented in a timely manner\n* Utilize in-depth knowledge of our software platform to strategically implement processes within dealerships\nSales and Revenue Management:\n* Drive adoption of our software solutions to enhance dealership operations, including service efficiency, consumer satisfaction, and service retention\n* Manage the dealer's renewal process and offer expanded product offerings\n* Identify opportunities for upselling additional features, services, or product packages to existing dealership partners, ensuring they are aware of the full range of solutions available to enhance their operations\n* Support sales efforts by understanding and communicating product benefits to dealership staff\n* Encourage and incentivize dealer partners to refer potential new customers, leveraging positive relationships and success stories\nPerformance and Reporting:\n* Regularly assess and manage the performance of assigned accounts using Hubspot and other CRM tools\n* Prepare presentations and support dealer training sessions\n* Conduct tailored quarterly business reviews\n* Proactively manage customer health and take immediate action to address at-risk accounts\n* Responsible for the retention, revenue and renewal of multiple accounts\n \nRequirements\n \nIdeal Candidate Qualifications: \nEducation and Experience:\n* Bachelor's degree in Business, Management, Marketing, or a related field preferred\n* 3-5 years of professional experience in sales, marketing, or customer service within an automotive retail environment\n* Over 5 years of experience in a franchise dealership or with large-scale integrated solution software sales to automotive franchise dealerships\n \nSkills and Competencies:\n* Proficient with CRM tools such as Hubspot, and adept with technology including Word, Excel, PowerPoint, Zoom, LinkedIn, etc\n* Strong business and financial acumen with the ability to quickly develop product knowledge and articulate its impact on dealership departments\n* Excellent communication skills, both verbal and written, with a knack for building rapport and developing meaningful relationships\n* Demonstrated ability to think quickly on your feet, handle ambiguity, and find win-win solutions\n* Possess an in-depth understanding of our software platform functionality, related services and an overview of the technical functionality. Leverage this knowledge to strategically implement processes and work with executive management, fixed ops management and other various departments within the dealership on appropriate usage\n* Self-motivated, resilient, detail-oriented, and comfortable working in a fast-paced startup environment\n* Negotiate effectively, finding the win-win solution to problems\n* Proactively solicit feedback, ask clarifying questions and resolve issues in a non-confrontational way\n* Experience working in a startup environment is highly preferred\n \nOther Requirements:\n* Ability to travel 75-100% within the region and nationally, including overnight stays\n* Valid driver's license required\n* Willingness to work extended hours and be on-call as needed\n \nJoin our team to make a significant impact on the automotive dealership industry through innovative software solutions, while advancing your career in a dynamic and supportive environment.\n \nBenefits\n \nWe value our employees' time and efforts. Our commitment to your success is enhanced by our competitive compensation and benefits package including paid time off, medical, dental, 401k, vision and equity benefits and future growth opportunities within the company. Plus, we work to maintain the best possible environment for our employees, where people can learn and grow with the company. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. To learn more about our company please visit: www.BizzyCar.com.\n\nABOUT BizzyCar\nBizzyCar is a B2B SaaS company that develops software for automotive dealers in the United States. We are on a mission to improve the customer experience when it comes to automotive care for consumers by creating elegant solutions that allow consumers to get their cars repaired without ever leaving home or work. BizzyCar is a fast paced environment where we solve complex problems in tight deadlines. We are a dispersed team but get together quarterly in person to maintain a tight company culture. Established leadership team has experience growing high value companies in short time periods and rewarding employees with equity returns and well paying jobs. Competitive pay, equity, &amp; medical benefits.", "postedDate": "1 month ago", "benefits": "We value our employees' time and efforts. Our commitment to your success is enhanced by our competitive compensation and benefits package including paid time off, medical, dental, 401k, vision and equity benefits and future growth opportunities within the company. Plus, we work to maintain the best possible environment for our employees, where people can learn and grow with the company. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. To learn more about our company please visit: www.BizzyCar.com.\n\nABOUT BizzyCar\nBizzyCar is a B2B SaaS company that develops software for automotive dealers in the United States. We are on a mission to improve the customer experience when it comes to automotive care for consumers by creating elegant solutions that allow consumers to get their cars repaired without ever leaving home or work. BizzyCar is a fast paced environment where we solve complex problems in tight deadlines. We are a dispersed team but get together quarterly in person to maintain a tight company culture. Established leadership team has experience growing high value companies in short time periods and rewarding employees with equity returns and well paying jobs. Competitive pay, equity, &amp; medical benefits.", "qualifications": {"required": "Education and Experience:\n* Bachelor's degree in Business, Management, Marketing, or a related field preferred\n* 3-5 years of professional experience in sales, marketing, or customer service within an automotive retail environment\n* Over 5 years of experience in a franchise dealership or with large-scale integrated solution software sales to automotive franchise dealerships\n \nSkills and Competencies:\n* Proficient with CRM tools such as Hubspot, and adept with technology including Word, Excel, PowerPoint, Zoom, LinkedIn, etc\n* Strong business and financial acumen with the ability to quickly develop product knowledge and articulate its impact on dealership departments\n* Excellent communication skills, both verbal and written, with a knack for building rapport and developing meaningful relationships\n* Demonstrated ability to think quickly on your feet, handle ambiguity, and find win-win solutions\n* Possess an in-depth understanding of our software platform functionality, related services and an overview of the technical functionality. Leverage this knowledge to strategically implement processes and work with executive management, fixed ops management and other various departments within the dealership on appropriate usage\n* Self-motivated, resilient, detail-oriented, and comfortable working in a fast-paced startup environment\n* Negotiate effectively, finding the win-win solution to problems\n* Proactively solicit feedback, ask clarifying questions and resolve issues in a non-confrontational way\n* Experience working in a startup environment is highly preferred\n \nOther Requirements:\n* Ability to travel 75-100% within the region and nationally, including overnight stays\n* Valid driver's license required\n* Willingness to work extended hours and be on-call as needed", "preferred": ""}, "skills": ["CRM", "Hubspot", "Word", "Excel", "PowerPoint", "Zoom", "LinkedIn"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983560388"}