{"jobTitle": "Data Engineer (L5) - Growth", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00/yr - 720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>About<br/><br/></strong>Netflix is re-imagining entertainment with over 270 million paid memberships in over 190 countries on millions of devices. One of the ways we do this is by using insights from data to optimize for the best customer experience. The Growth Data Engineering team is responsible for data that is critical in driving customer acquisition and optimizing the signup experience for our prospective members. Our work empowers product managers and business leaders to rapidly experiment and innovate on product experiences that drive towards our goal to “Entertain the world”. In this role, you will partner closely with other engineers and data scientists to power experimentation, analytical data products, and machine learning models. This is an opportunity for someone with a strong data engineering background to demonstrate their thought leadership in crafting metrics and elegant insights that have a direct impact on the business. About you:<br/><br/><ul><li>You are proficient in at least one major language (e.g., Java, Scala, Python) and SQL (any variant). You strive to write elegant and maintainable code, and you're comfortable with picking up new technologies.</li><li>You have a product mindset and are curious to understand what the business needs. You have a naturally collaborative style to work with product management, data science, engineering, etc in service of these needs. </li><li>You possess a strong data intuition and apply your analytical and data engineering skills to translate business problems into scalable engineering solutions. </li><li>You are proficient in working with distributed systems and have experience with different distributed processing frameworks that can handle data in batch and real-time e.g. Flink, Spark etc. </li><li>You see patterns and new ways to innovate in existing spaces. As a result, you always look for opportunities to simplify, automate tasks, and build reusable components across multiple use cases and teams.</li><li>You build data products that are well-modeled, documented and easy to understand and maintain. </li><li>You own what you build, beyond just your code. You have a passion for quality. </li><li>You are comfortable working in the most agile of environments with vague requirements. You are nimble and can pivot easily when needed. You are unafraid to take smart risks.</li><li>You relate to and embody many aspects of Netflix's Culture. You love working independently while also collaborating and giving/receiving candid feedback.<br/><br/></li></ul>Learn more about the team and technologies you’d get to work with! Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "You will partner closely with other engineers and data scientists to power experimentation, analytical data products, and machine learning models.", "qualifications": {"required": "You are proficient in at least one major language (e.g., Java, Scala, Python) and SQL (any variant). You strive to write elegant and maintainable code, and you're comfortable with picking up new technologies. You have a product mindset and are curious to understand what the business needs. You have a naturally collaborative style to work with product management, data science, engineering, etc in service of these needs. You possess a strong data intuition and apply your analytical and data engineering skills to translate business problems into scalable engineering solutions. You are proficient in working with distributed systems and have experience with different distributed processing frameworks that can handle data in batch and real-time e.g. Flink, Spark etc. You see patterns and new ways to innovate in existing spaces. As a result, you always look for opportunities to simplify, automate tasks, and build reusable components across multiple use cases and teams. You build data products that are well-modeled, documented and easy to understand and maintain. You own what you build, beyond just your code. You have a passion for quality. You are comfortable working in the most agile of environments with vague requirements. You are nimble and can pivot easily when needed. You are unafraid to take smart risks. You relate to and embody many aspects of Netflix's Culture. You love working independently while also collaborating and giving/receiving candid feedback.", "preferred": ""}, "skills": ["Java", "Scala", "Python", "SQL", "Flink", "Spark"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983492972"}