{"jobTitle": "Vice President, Enterprise IT Operations", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "230,000.00 - 300,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/><strong>Job Description<br/><br/></strong>NBCUniversal is seeking a dynamic and experienced Vice President of West Coast Enterprise IT Operations, Workplace Operations. The successful candidate will oversee all aspects of Enterprise IT operations on the West Coast, including day-to-day IT support, TechBar support, audiovisual (AV) services, TV Production, Executive Support, and Project Management. This role requires a visionary leader with a proven track record in transforming IT services and leading high-performance teams to drive organizational success.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Lead and manage the operational oversight of all Enterprise IT functions on the West Coast, ensuring seamless and efficient day-to-day operations.</li><li>Serve as the designated escalation point for the West Coast region</li><li>Oversee the TechBar support services, providing top-tier technical assistance and user experience.</li><li>Facilitate seamless coordination between AV and various technology partners, ensuring a unified approach and communication strategy for key stakeholders.</li><li>Direct the AV services, enhancing the quality and reliability of multimedia support across the organization.</li><li>Provide strategic executive support, ensuring high availability and performance of IT services for senior leadership.</li><li>Oversee the TV Production support team, ensuring seamless delivery of technical assistance and solutions tailored to the needs of the TV production environment.</li><li>Spearhead the planning, execution, and delivery of IT projects, aligning with the company's strategic goals and operational requirements.</li><li>Cultivate a culture of innovation and continuous improvement, leveraging technology to optimize business processes and user satisfaction.</li><li>Develop and maintain strong relationships with internal stakeholders, external vendors, and technology partners to ensure alignment with NBCUniversal’s strategic objectives.</li><li>Ensure compliance with industry standards, security protocols, and legal requirements in all IT operations.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required Qualifications: <br/><br/></strong><ul><li>12+ years of experience in large-scale IT operations and technology management, preferably in a global enterprise environment.</li><li>Proven ability to lead and manage cross-functional teams, fostering collaboration and high performance.</li><li>Demonstrated success in implementing multi-million-dollar technology projects and innovations.</li><li>Proven experience managing product life cycles, from conception to launch, with a focus on user experience and quality assurance.</li><li>Certifications in ITIL 4, Product Management, Project Management Professional (PMP), Certified Product Owner (CPO), and/or Certified Scrum Master (CSM).<br/><br/></li></ul><strong>Desired Characteristics<br/><br/></strong><ul><li>Experience in managing IT support, TechBar services, AV operations, TV Production support, and executive support in a large-scale, dynamic environment.</li><li>Track record of driving transformation in enterprise operations through cloud-based collaboration solutions and technology innovations.</li><li>Strong strategic planning, project management, and organizational skills.</li><li>Excellent communication, negotiation, and stakeholder management abilities.</li><li>Deep understanding of the latest technology trends, enterprise IT solutions, and best practices.</li><li>Bachelor’s degree in Communications, Media Studies, or a related field; MBA in Strategic Leadership and Business Policies preferred.<br/><br/></li></ul><strong>Hybrid</strong>: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $230,000 - $300,000 <em>(bonus and long-term incentive eligible)<br/><br/></em><strong>Additional Information<br/><br/></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "Lead and manage the operational oversight of all Enterprise IT functions on the West Coast, ensuring seamless and efficient day-to-day operations.\nServe as the designated escalation point for the West Coast region\nOversee the TechBar support services, providing top-tier technical assistance and user experience.\nFacilitate seamless coordination between AV and various technology partners, ensuring a unified approach and communication strategy for key stakeholders.\nDirect the AV services, enhancing the quality and reliability of multimedia support across the organization.\nProvide strategic executive support, ensuring high availability and performance of IT services for senior leadership.\nOversee the TV Production support team, ensuring seamless delivery of technical assistance and solutions tailored to the needs of the TV production environment.\nSpearhead the planning, execution, and delivery of IT projects, aligning with the company's strategic goals and operational requirements.\nCultivate a culture of innovation and continuous improvement, leveraging technology to optimize business processes and user satisfaction.\nDevelop and maintain strong relationships with internal stakeholders, external vendors, and technology partners to ensure alignment with NBCUniversal’s strategic objectives.\nEnsure compliance with industry standards, security protocols, and legal requirements in all IT operations.", "qualifications": {"required": "12+ years of experience in large-scale IT operations and technology management, preferably in a global enterprise environment.\nProven ability to lead and manage cross-functional teams, fostering collaboration and high performance.\nDemonstrated success in implementing multi-million-dollar technology projects and innovations.\nProven experience managing product life cycles, from conception to launch, with a focus on user experience and quality assurance.\nCertifications in ITIL 4, Product Management, Project Management Professional (PMP), Certified Product Owner (CPO), and/or Certified Scrum Master (CSM).", "preferred": "Experience in managing IT support, TechBar services, AV operations, TV Production support, and executive support in a large-scale, dynamic environment.\nTrack record of driving transformation in enterprise operations through cloud-based collaboration solutions and technology innovations.\nStrong strategic planning, project management, and organizational skills.\nExcellent communication, negotiation, and stakeholder management abilities.\nDeep understanding of the latest technology trends, enterprise IT solutions, and best practices.\nBachelor’s degree in Communications, Media Studies, or a related field; MBA in Strategic Leadership and Business Policies preferred."}, "skills": [], "postedDate": "1 week ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3983737312"}