{"jobTitle": "Production Supervisor", "company": {"name": "Masonite®", "industry": "Wholesale Building Materials, Machinery Manufacturing, and Motor Vehicle Manufacturing", "size": "Not specified", "location": "Moreno Valley, CA"}, "location": "Moreno Valley, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$78,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials, Machinery Manufacturing, and Motor Vehicle Manufacturing", "description": "We heard you knock! Masonite is now proudly part of Owens Corning. Owens Corning is a global building and construction materials leader committed to building a sustainable future through material innovation. Our four integrated businesses – Roofing, Insulation, Doors, and Composites – provide durable, sustainable, energy-efficient solutions that leverage our unique material science, manufacturing, and market knowledge to help our customers win and grow. We are global in scope, human in scale with more than 25,000 employees in 31 countries dedicated to generating value for our customers and shareholders, and making a difference in the communities where we work and live. Founded in 1938 and based in Toledo, Ohio, USA, Owens Corning posted 2023 sales of $9.7 billion. For more information, visit www.owenscorning.com. Overview Reporting to the Plant Manager, the Production Supervisor incumbent will be a proven leader and mentor. Qualities we look for in the Production Supervisor are problem solving skills, someone that promotes a safe work environment, utilizes resources (HR, HSE, Quality, Purchasing), and can motivate while assess/understand/utilize their staff’s strengths & weaknesses, attendance management. What you will do: You will oversee plant activities, supervise the overall production, and delegate work assignments to ensure all key performance indicators (KPIs) are identified, structured and addressed. You will use production boards to keep employees enlightened and informed of the department performance against standards, working with them to correct deficiencies. Facilitate Gemba walks out on the plant floor, monitoring machine center performance to ensure optimum efficiencies, a practice used by Lean Leaders, and participate in Tier meetings with senior leadership using appropriate decision-making tools gaining approval before implementing decisions or changes. Part of your job will be to administer plant rules and other policies and procedures in a fair and equitable manner. Required qualifications: High School diploma with 3 years leadership experience in a team-based Lean Manufacturing environment required. College degree with 3 years leadership experience in a team-based Lean Manufacturing environment preferred. Must be computer literate and proficient in MS Office, Excel, Outlook. Previous exposure to Kronos as Time Management tool is an asset. Bilingual - Spanish required. The rate of pay for this position begins at an annualized salary of $78,000 (for a 40-hour work week) + benefits. Base pay may increase depending on job-related knowledge, skills and experience. This information is specific to Moreno Valley, CA and may not be applicable to other locations.", "responsibilities": "You will oversee plant activities, supervise the overall production, and delegate work assignments to ensure all key performance indicators (KPIs) are identified, structured and addressed. You will use production boards to keep employees enlightened and informed of the department performance against standards, working with them to correct deficiencies. Facilitate Gemba walks out on the plant floor, monitoring machine center performance to ensure optimum efficiencies, a practice used by Lean Leaders, and participate in Tier meetings with senior leadership using appropriate decision-making tools gaining approval before implementing decisions or changes. Part of your job will be to administer plant rules and other policies and procedures in a fair and equitable manner.", "qualifications": {"required": "High School diploma with 3 years leadership experience in a team-based Lean Manufacturing environment required. College degree with 3 years leadership experience in a team-based Lean Manufacturing environment preferred. Must be computer literate and proficient in MS Office, Excel, Outlook. Previous exposure to Kronos as Time Management tool is an asset. Bilingual - Spanish required.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Benefits included, specific details not provided.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3983411409"}