{"jobTitle": "Product Manager, AI Platform", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "240,000.00 - 725,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Our Infrastructure organization is vital to this mission, serving as the backbone for Netflix’s growing scale and boosting the productivity of our technical talent. Within Infrastructure, our AI Platform exists to maximize the productivity and innovation of Netflix machine learning practitioners, data scientists, and engineers across our consumer and studio businesses. We take care of the heavy lifting needed to build compliant and innovative generative AI-powered experiences that support the expanding needs of the business. This allows our talent to concentrate on what truly matters: helping Netflix entertain the world.<br/><br/><strong>The Opportunity<br/><br/></strong>We are looking for a technical product manager to help drive our AI platform's model consumption and app development capabilities. Your mission is to simplify and accelerate Netflix's investments across our consumer and studio businesses.<br/><br/>Your focus will be on the end-to-end experience for our users who need to leverage our AI platform to accomplish their work. You will lead the vision and strategy for our model consumption layer, conversational assistants, LLMOps, prompt management, prototyping tools, and an opinionated app development framework for AI applications and agents. The scope and impact of this role is significant. You'll be responsible for managing a portfolio of products and driving holistic product strategy and prioritization across them.<br/><br/>If you’re looking for a deeply technical and highly dynamic opportunity that will have an outsized impact on the future of the AI platform at Netflix, we’d love to talk to you!<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Deeply understand customer needs, product analytics, and industry innovation to drive the product vision and strategy, maximizing business and customer impact.</li><li>Partner closely with senior management and engineering teams to define and align with stakeholders on vision, strategy, and roadmaps.</li><li>Develop product roadmaps in partnership with relevant product and engineering teams that execute product vision and strategy and inform our engineering teams of what problems need to be solved.</li><li>Foster a metrics-driven environment that encourages quality experimentation and sets high standards for measuring product success.</li><li>Stay informed about industry advancements, influence their direction, and conduct comprehensive buy vs. build analysis to align with state-of-the-art solutions, encouraging ROI-based decisions.</li><li>Foster a collaborative environment with Netflix engineers, creating continuous feedback loops to ensure we solve the right problems and drive maximum impact for Netflix.</li><li>Exhibit robust problem-solving and decision-making skills, tackling technical and strategic challenges in innovative ways and leveraging data and intuition to make strategic choices in the face of ambiguity and complexity.</li><li>Ensure thoughtful product evolution that addresses product lifecycle and adoption experience.</li><li>Help evolve our customer engagement model, communication strategy, prioritization, and planning/road-mapping practices.<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>8+ years of experience as a Technical Product Manager with at least 2+ years of domain experience in ML/AI consumer scale AI platforms.</li><li>Proven track record of managing and evolving a product portfolio and/or driving product vision and strategy</li><li>A healthy blend of technical depth and deep domain expertise with a customer-focused mindset</li><li>Demonstrated passion and experience in one or more of the following domains: Generative AI, AI Application Frameworks &amp; SDKs, ML/AI Observability and Evaluations. </li><li>Strategic thinker who can connect customer use cases to technology solutions and think holistically about the end-to-end experience</li><li>Ability to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision</li><li>Comfortable applying a combination of qualitative and quantitative methods to define success </li><li>Leverages product intuition and judgment to solve problems and make decisions without perfect information</li><li>Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’</li><li>Excellent communication skills; timely communication with clear expectations<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $240,000 - $725,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "Deeply understand customer needs, product analytics, and industry innovation to drive the product vision and strategy, maximizing business and customer impact.\nPartner closely with senior management and engineering teams to define and align with stakeholders on vision, strategy, and roadmaps.\nDevelop product roadmaps in partnership with relevant product and engineering teams that execute product vision and strategy and inform our engineering teams of what problems need to be solved.\nFoster a metrics-driven environment that encourages quality experimentation and sets high standards for measuring product success.\nStay informed about industry advancements, influence their direction, and conduct comprehensive buy vs. build analysis to align with state-of-the-art solutions, encouraging ROI-based decisions.\nFoster a collaborative environment with Netflix engineers, creating continuous feedback loops to ensure we solve the right problems and drive maximum impact for Netflix.\nExhibit robust problem-solving and decision-making skills, tackling technical and strategic challenges in innovative ways and leveraging data and intuition to make strategic choices in the face of ambiguity and complexity.\nEnsure thoughtful product evolution that addresses product lifecycle and adoption experience.\nHelp evolve our customer engagement model, communication strategy, prioritization, and planning/road-mapping practices.", "qualifications": {"required": "8+ years of experience as a Technical Product Manager with at least 2+ years of domain experience in ML/AI consumer scale AI platforms.\nProven track record of managing and evolving a product portfolio and/or driving product vision and strategy\nA healthy blend of technical depth and deep domain expertise with a customer-focused mindset\nDemonstrated passion and experience in one or more of the following domains: Generative AI, AI Application Frameworks &amp; SDKs, ML/AI Observability and Evaluations. \nStrategic thinker who can connect customer use cases to technology solutions and think holistically about the end-to-end experience\nAbility to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision\nComfortable applying a combination of qualitative and quantitative methods to define success \nLeverages product intuition and judgment to solve problems and make decisions without perfect information\nInsatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’\nExcellent communication skills; timely communication with clear expectations"}, "skills": ["AI", "Machine Learning", "Product Management", "Product Strategy", "Generative AI", "AI Application Frameworks", "ML/AI Observability", "ML/AI Evaluations"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983492949"}