{"jobTitle": "Marketing Project Manager", "company": {"name": "Pressed Juicery", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management, Marketing, and Production", "industry": "Food and Beverage Services, Food and Beverage Retail, and Food & Beverages", "description": "<strong>About Pressed Juicery</strong><p>Pressed Juicery is at the forefront of the wellness movement and is dedicated to making healthy living as convenient and delicious as possible. Pressed operates 112 retail stores, is available in nearly 3,000 supermarkets, and can be delivered to any US location through the Pressed Juicery website or app.</p><p><br/></p><p><strong>Our Mission</strong></p><p>Pressed Juicery’s mission is to empower your wellness journey.</p><p><br/></p><p><strong>Our Workplace Culture</strong></p><p>We embrace diversity, equity, inclusion, and belongingness!</p><p>We speak up with radically candid communication.</p><p>We wholeheartedly support personal and professional growth.</p><p>We believe mistakes can be valuable and lead to continuous improvement.</p><p>Lastly, we value excellence and strive to achieve greatness in all we do!</p><p><br/></p><p><strong>Our Values</strong></p><p>Community - as leaders, we celebrate differences, champion strengths, and compassionately aspire to be our most vibrant selves.</p><p>Passion - curious and humble, we inspire people to make healthy choices.</p><p>Growth - pursuing wellness with intention, we create and embrace good energy.</p><p><br/></p><p><strong>Our Benefits</strong></p><p>401k match</p><p>13 paid holidays</p><p>8 paid Pressed Days (additional days off)</p><p>Medical, dental, and vision insurance</p><p>Vacation time</p><p>Flexible Spending Account</p><p>Paid parental leave</p><p>Employee Referral Program</p><p><br/></p><p><strong>Job Overview</strong></p><p>We are seeking an experienced and dynamic Marketing Project Manager to join our team. The Marketing Project Manager is pivotal in driving cross-functional initiatives and ensuring seamless execution of projects across the company in a timely manner. Projects include overseeing the creation of content such as blog posts, videos, infographics, and social media updates; planning and executing digital marketing campaigns, including SEO, SEM, email marketing, and social media marketing; and, managing media relations, press releases, and public statements with agency. The ideal candidate will have a strong background in Consumer Packaged Goods (CPG), excellent project management skills, and the ability to influence and collaborate with leaders to finalize decisions and drive results.</p><p><br/></p><p>Key Responsibilities</p><ul><li>Lead and manage cross-company projects, ensuring alignment with strategic goals and timely execution.</li><li>Develop and maintain comprehensive project plans, including timelines, milestones, deliverables, and resource allocation.</li><li>Plan, organize, and facilitate quarterly planning sessions, working closely with department heads to define objectives, prioritize initiatives, and allocate resources.</li><li>Coordinate and manage multiple tasks and projects simultaneously, ensuring deadlines are met and quality standards are upheld.</li><li>Collaborate with key stakeholders across various departments, including marketing, sales, operations, and finance, to drive project success.</li><li>Utilize project management tools and methodologies to track progress, identify risks, and implement solutions to keep projects on track.</li><li>Influence and guide senior leaders to make timely decisions and finalize project plans.</li><li>Prepare and present project updates, reports, and recommendations to executive leadership.</li></ul><p><br/></p><p> </p><p>Qualifications</p><ul><li>Bachelor's degree in Business Administration, Project Management, or a related field; MBA or advanced degree preferred.</li><li>Minimum of 5+ years of project management experience, preferably within the Consumer Packaged Goods (CPG) industry.</li><li>Proven track record of successfully managing cross-functional projects from initiation to completion.</li><li>Strong organizational and multitasking skills, with the ability to manage multiple priorities and deadlines.</li><li>Excellent communication and interpersonal skills, with the ability to influence and collaborate with senior leaders.</li><li>Proficiency in project management tools and software (e.g., Asana, Trello, Microsoft Project).</li><li>Strong analytical and problem-solving abilities, with a strategic mindset and attention to detail.</li><li>Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities.</li></ul>", "responsibilities": "Lead and manage cross-company projects, ensuring alignment with strategic goals and timely execution. Develop and maintain comprehensive project plans, including timelines, milestones, deliverables, and resource allocation. Plan, organize, and facilitate quarterly planning sessions, working closely with department heads to define objectives, prioritize initiatives, and allocate resources. Coordinate and manage multiple tasks and projects simultaneously, ensuring deadlines are met and quality standards are upheld. Collaborate with key stakeholders across various departments, including marketing, sales, operations, and finance, to drive project success. Utilize project management tools and methodologies to track progress, identify risks, and implement solutions to keep projects on track. Influence and guide senior leaders to make timely decisions and finalize project plans. Prepare and present project updates, reports, and recommendations to executive leadership.", "qualifications": {"required": "Bachelor's degree in Business Administration, Project Management, or a related field; MBA or advanced degree preferred. Minimum of 5+ years of project management experience, preferably within the Consumer Packaged Goods (CPG) industry. Proven track record of successfully managing cross-functional projects from initiation to completion. Strong organizational and multitasking skills, with the ability to manage multiple priorities and deadlines. Excellent communication and interpersonal skills, with the ability to influence and collaborate with senior leaders. Proficiency in project management tools and software (e.g., Asana, Trello, Microsoft Project). Strong analytical and problem-solving abilities, with a strategic mindset and attention to detail. Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities.", "preferred": ""}, "skills": ["Project Management", "Marketing", "Cross-Functional Collaboration", "Strategic Planning", "Resource Allocation", "Communication", "Interpersonal Skills", "Project Management Tools", "Analytical Skills", "Problem Solving"], "postedDate": "3 weeks ago", "benefits": "401k match, 13 paid holidays, 8 paid Pressed Days (additional days off), Medical, dental, and vision insurance, Vacation time, Flexible Spending Account, Paid parental leave, Employee Referral Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983363582"}