{"jobTitle": "Supply Chain Planning Analyst", "company": {"name": "Talent Xpanse", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "70,000.00 - 80,000.00", "currency": "USD"}, "jobFunction": "Strategy/Planning and Supply Chain", "industry": "Food and Beverage Manufacturing", "description": "<strong>Job Title<br/><br/></strong>Supply Chain Planning Analyst<br/><br/>Location:<br/><br/>Orange County, CA (100% on-site in office)<br/><br/><strong>Our Client Partner<br/><br/></strong>Talent Xpanse partners with a prestigious company in the consumer goods sector, renowned for its commitment to innovation, quality, and customer satisfaction. This company has longevity spanning several decades, with a continuous growth strategy.<br/><br/><strong>Role Overview<br/><br/></strong>The Supply Chain Planning Analyst is pivotal in optimizing the production processes. This role involves coordinating production scheduling, inventory management, and cost optimization to ensure the smooth operation of the supply chain and heavy cross-functional collaboration.<br/><br/><strong>Impact Snapshot<br/><br/></strong>The Supply Chain Planning Analyst will directly influence the operational efficiency of the company, ensuring product availability and cost-effective resource management.<br/><br/><strong>Core Responsibilities<br/><br/></strong><ul><li>Develop detailed weekly production plans.</li><li>Analyze and optimize inventory levels to meet business objectives.</li><li>Collaborate across departments to enhance supply chain efficiency and reduce costs.<br/><br/></li></ul><strong>What You’ll Bring<br/><br/></strong><ul><li>The ability to conduct analysis and modify supply plans to meet customer demand forecast requirements.</li><li>Continuous monitoring and adjusting supply chain plans throughout the month, ensuring timely system updates and communication with Sales/Customer Service.</li><li>Plan and release weekly production requirements to manufacturing, maximizing efficiency and meeting customer delivery requirements.</li><li>Partner with Procurement/Quality to ensure visibility of material requirements and develop solutions for any supply mitigation needs.</li><li>Ensure new product launches and discontinuations are planned appropriately.</li><li>Monitor excess and obsolete inventory, providing visibility and leading timely identification and disposal tracking.</li><li>Continuous review of ERP data and update planning system parameters.</li><li>Proactively communicate, seeking optimal efficiency, maintaining accuracy, and implementing continuous improvement initiatives.<br/><br/></li></ul><strong>Essentials<br/><br/></strong><ul><li>Bachelor’s degree in Supply Chain Management, Business, or related field.</li><li>Minimum of 3 years’ experience in Supply Chain Planning, preferably in consumer goods. Preferably in a manufacturing environment.</li><li>Proficiency in ERP systems and Microsoft Excel.</li><li>Strong analytical skills and ability to work independently in a fast-paced environment.<br/><br/></li></ul><strong>Desirables<br/><br/></strong><ul><li>Supply Chain Management certification.</li><li>Experience in manufacturing in industries such as pharmaceutical, health products, or food sectors.<br/><br/></li></ul><strong>Client Partner Insights<br/><br/></strong><ul><li>Our client is seeking a collaborative analyst with a hands-on approach to proactive problem solving, who can navigate complex supply chain functions with ease and efficiency.<br/><br/></li></ul><strong>Compensation<br/><br/></strong>Our client practices fair and transparent pay. The estimated salary range is $70,000 - $80,000 annually, influenced by factors like experience, education, and market conditions. Compensation is determined through a comprehensive evaluation of skills, experience, and industry standards.<br/><br/>Talent Xpanse and our client partners are committed to fostering an inclusive and diverse workplace. We welcome candidates from all backgrounds and are proud to be an equal-opportunity employer. Discrimination and harassment based on race, color, religion, sex, national origin, age, disability, genetic information, sexual orientation, veteran status, or any other protected status is prohibited.<br/><br/>(This is a truncated description utilized in the talent attraction process.)", "responsibilities": "<ul><li>Develop detailed weekly production plans.</li><li>Analyze and optimize inventory levels to meet business objectives.</li><li>Collaborate across departments to enhance supply chain efficiency and reduce costs.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s degree in Supply Chain Management, Business, or related field.</li><li>Minimum of 3 years’ experience in Supply Chain Planning, preferably in consumer goods. Preferably in a manufacturing environment.</li><li>Proficiency in ERP systems and Microsoft Excel.</li><li>Strong analytical skills and ability to work independently in a fast-paced environment.<br/><br/></li></ul>", "preferred": "<ul><li>Supply Chain Management certification.</li><li>Experience in manufacturing in industries such as pharmaceutical, health products, or food sectors.<br/><br/></li></ul>"}, "skills": ["Supply Chain Management", "ERP", "Microsoft Excel", "Analytical Skills"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983668516"}