{"jobTitle": "Business Operations Senior Analyst (EX3, CL4)", "company": {"name": "American Honda Motor Company, Inc.", "industry": "Motor Vehicle Manufacturing", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Business Development and Sales", "industry": "Motor Vehicle Manufacturing", "description": "What Makes a Honda, Is Who Makes a Honda\n\nHonda has a clear vision for the future, and it’s a joyful one. We are looking for individuals with the skills, courage, persistence, and dreams that will help us reach our future-focused goals. At our core is innovation. Honda is constantly innovating and developing solutions to drive our business with record success. We strive to be a company that serves as a source of “power” that supports people around the world who are trying to do things based on their own initiative and that helps people expand their own potential. To this end, Honda strives to realize “the joy and freedom of mobility” by developing new technologies and an innovative approach to achieve a “zero environmental footprint.”\n\nWe are looking for qualified individuals with diverse backgrounds, experiences, continuous improvement values, and a strong work ethic to join our team.\n\nIf your goals and values align with Honda’s, we want you to join our team to Bring the Future!\n\nJob Purpose\n\nAmerican Honda’s Sustainability & Business Development (SBD) business unit (BU) is tasked with navigating the business and technology application path for Honda's future renewable energy, resource circulation and innovative business initiative products, services, and businesses. Our focus is to establish an ecosystem of hardware, software, and renewable energy that achieves these goals by focusing on real-world user experience. By providing solutions to users that are intuitive, generate value for users in terms of time savings, money savings, and enriching their lives we can expand and deepen our relationship with each customer. The team will focus on building and sustaining Honda's core brand values and enhancing brand image and competitiveness in the marketplace by innovating, incubating, selecting, developing, applying, and operating new businesses, features, products, and services with responsibility for their profitability, competitiveness, and customer satisfaction for Honda in North America. This role will be developing and executing product and business strategy in a world of rapid technological and social change requires a highly capable, highly knowledgeable, and highly engaged team.\n\nThis business analyst role expertly administers the company's connected and energy businesses, faithfully executing the company's contracts and business obligations.\n\nFocusing on financial accuracy as well as regulatory compliance supporting operations and providing new value to the Customer, the Dealer, and AHM, the Senior Analyst strategizes, plans, executes and reports all aspects of the connected and energy businesses. Executing on responsibility is a mandatory requirement to adhere to AHM’s compliance requirements and manage the sustainability of the businesses. This requires frequent coordination and review of wide-ranging information, along with regular communication with external business partners providers, HM, Product Planning, Service, Quality, Sales, Finance, HNA Law, and other pertinent business units.", "responsibilities": "Responsible for all Gross Profit aspects of financial operation for the Business Unit. Understand all business lines, including the agreed terms with each vendor. Responsible for AHM's compliance to the terms of the agreements. In addition, accountable to create a detailed financial analysis outlining problems, opportunities and solutions for management to improve connected and energy business. This activity will represent the financial reporting at key AHM events, such as BRM, BIM, and FY Business planning. Lead and oversee invoice and revenue management between vendors, procurement and AHM finance teams and ensure all financial transactions have been validated and reconciled (Gross Profit for both Connected & Energy). Must result in monthly, quarterly, semi-annual and annual approval by executive management and AHM Finance. Lead and direct internal stakeholders to plan and develop budget forecasting of Gross Profit for both Connected & Energy programs for monthly, quarterly, midterm and annual business meetings. Must act as the leader to consolidate and validate for submission to executive management. Collaborate between auto operations and AHM IT, Service, and Sales teams to implement requirements and provide necessary guidance for business financial planning. This includes financial impact on AHM Sales and Service operations, as new services, such as Over-the-air updates are administered through cooperation with R&D, Operations and service providers. Lead research, process analysis, and recommend / propose increase in operational efficiencies through process improvements.", "qualifications": {"required": "Bachelor’s degree is required, ideally with a major in business, marketing, or engineering related field.", "preferred": "5+ years of related experience in planning, telematics, finance, or engineering."}, "skills": ["Basic understanding of financial reporting and business models required.", "Excellent planning, negotiating, analytical, and presentation skills.", "Technical orientation and understanding preferred.", "Knowledge of operations – planning, r&d, manufacturing, sales, quality, service, and customer support is preferred.", "PC proficiency with ms office (powerpoint, excel, word)", "Ability to function in an agile project team as a product owner / lpl, scrum master / alpl, or person-in-charge of a functional area for a project.", "Familiar with Microsoft PowerBI (or similar), data analysis, data science is a plus."], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive Base Salary (pay will be based on several variables that include, but not limited to geographic location, work experience, etc.), Paid Overtime, Regional Bonus (when applicable), Industry-leading Benefit Plans (Medical, Dental, Vision, Rx), Paid time off, including vacation, holidays, shutdown, Company Paid Short-Term and Long-Term Disability, 401K Plan with company match + additional contribution, Relocation assistance (if eligible).", "remoteWork": "Hybrid working remote available; in office time (2-3 days per week and as required).", "url": "https://www.linkedin.com/jobs/view/3983400732"}