{"jobTitle": "Social Media and Community Manager", "company": {"name": "KanaRey Productions Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Kanarey Productions Inc. is a renowned production company specializing in creating high-quality content for various platforms. We are looking for a skilled and experienced Social Media and Community Manager to join our dynamic team. As a Social Media and Community Manager, you will play a vital role in the planning and execution of community projects for one of the most popular Japanese anime.<br/><br/>In this role, you will work closely with the game development, brand and creative teams to manage all aspects of social channels and community management, including excecuting social strategy, leading ideation for assets and writing copies for posts. You will be responsible for ensuring that projects are delivered on time, and to the highest quality standards.<br/><br/>The ideal candidate is highly organized, detail-oriented, and has a strong passion and deep knowleage for anime and manga. You must have excellent communication and problem-solving skills, as well as the ability to work effectively in a fast-paced environment. If you are an enthusiastic and talented individual who thrives in anime community, we would love to hear from you.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>Execute social media strategy and best practices across various social media channels</li><li>Lead ideation, development and day to day management of Publishing Calendar to ensure successful program development and execution across various social channels</li><li>Write copy and work with graphic designers to create visual assets that drive engagement across the portfolio of social channels</li><li>Work with brand managers to onboard content management platform to ensure successful program development across the social channel portfolio</li><li>Identify real-time digital, cultural, and real-time news and consumer trends to inform social strategy and community building. </li><li>Extract insights, identify trends, and build out data-driven strategies to amplify creative campaign performance to meet KPIs </li><li>Research past posts for learnings and performance optimization and work with Brand Manager to deliver actionable social insights in audience growth forecasts, performance reporting and analysis</li><li>Work with our Brand Managers to develop lead generation strategies through social media</li><li>Ensure our customers and community members are engaged, by answering questions and comments, solving problems and replying to customer service inquiries</li><li>Ideate and design bespoke strategies for engaging the community on each social channel</li><li>Identify and engage with external creative and talent agencies, management groups, and independent contractors to employ various 3rd party services such as influencer &amp; content creator sponsorships, Social management middleware, fabrication of promotional materials, and other specialized services</li><li>Optimize social media performance through organic and paid efforts</li><li>Drive strategy, ideation, and development of social content across current and upcoming platforms</li><li>Embody a Team player mentality day in and day out<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>2+ Years in Community Management, Marketing or related role</li><li>Personal or professional experience with video games and/or anime</li><li>Strong written and verbal communication skills<br/><br/></li></ul>Advanced skill<br/><br/><ul><li>Previous Brand management experience</li><li>Previous Video Production and/or Graphic Design experience</li><li>Multiple language fluency<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li><li>Family Leave (Maternity, Paternity)</li><li>Work From Home</li></ul>", "responsibilities": "Execute social media strategy and best practices across various social media channelsLead ideation, development and day to day management of Publishing Calendar to ensure successful program development and execution across various social channelsWrite copy and work with graphic designers to create visual assets that drive engagement across the portfolio of social channelsWork with brand managers to onboard content management platform to ensure successful program development across the social channel portfolioIdentify real-time digital, cultural, and real-time news and consumer trends to inform social strategy and community building. Extract insights, identify trends, and build out data-driven strategies to amplify creative campaign performance to meet KPIs Research past posts for learnings and performance optimization and work with Brand Manager to deliver actionable social insights in audience growth forecasts, performance reporting and analysisWork with our Brand Managers to develop lead generation strategies through social mediaEnsure our customers and community members are engaged, by answering questions and comments, solving problems and replying to customer service inquiriesIdeate and design bespoke strategies for engaging the community on each social channelIdentify and engage with external creative and talent agencies, management groups, and independent contractors to employ various 3rd party services such as influencer & content creator sponsorships, Social management middleware, fabrication of promotional materials, and other specialized servicesOptimize social media performance through organic and paid effortsDrive strategy, ideation, and development of social content across current and upcoming platformsEmbody a Team player mentality day in and day out", "qualifications": {"required": "2+ Years in Community Management, Marketing or related rolePersonal or professional experience with video games and/or animeStrong written and verbal communication skills", "preferred": "Previous Brand management experiencePrevious Video Production and/or Graphic Design experienceMultiple language fluency"}, "skills": ["Social Media", "Community Management", "Marketing", "Anime", "Manga", "Content Creation", "Social Strategy", "Copywriting", "Graphic Design", "Brand Management", "Video Production", "Influencer Marketing", "Social Media Marketing", "Paid Advertising", "Data Analysis", "Customer Service", "Communication", "Teamwork"], "postedDate": "1 month ago", "benefits": "Health Care Plan (Medical, Dental & Vision)Paid Time Off (Vacation, Sick & Public Holidays)Family Leave (Maternity, Paternity)Work From Home", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983517571"}