{"jobTitle": "Operations Manager", "company": {"name": "Robert Walters", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Our client is a leading organisation dedicated to simplifying the complexities of international mobility. They are seeking a highly skilled and motivated Operations Manager to oversee and optimise their global logistics and compliance operations. This role offers an exciting opportunity to work in a dynamic, fast-paced environment where you will be instrumental in improving efficiency and productivity.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Oversee and streamline global logistics operations to ensure timely and cost-effective delivery of services.</li><li>Develop and implement logistics strategies to optimise supply chain processes.</li><li>Coordinate with international partners, vendors, and service providers to ensure seamless operations.</li><li>Ensure compliance with international laws, regulations, and industry standards.</li><li>Develop and maintain policies and procedures to ensure regulatory adherence.</li><li>Lead, mentor, and develop a team of logistics and compliance staff.</li><li>Identify opportunities for process optimisation and implement best practices.</li><li>Ensure a seamless and positive experience for our clients and partners.</li><li>Develop and manage logistics and compliance budgets.<br/><br/></li></ul><strong>What You Bring<br/><br/></strong><ul><li>Bachelor’s degree in Business Administration, Logistics, Supply Chain Management or related field.</li><li>Proven experience as an Operations Manager in global logistics and compliance.</li><li>Strong leadership skills with experience in team management.</li><li>Excellent problem-solving abilities with analytical mindset.</li><li>Proficiency in using logistics software and tools.</li><li>Experience with SQL and Python.</li><li>Outstanding communication skills with ability to interact effectively at all levels.</li><li>Ability to thrive in a fast-paced environment.</li><li>Knowledge of the immigration industry is desirable.<br/><br/></li></ul><strong>What Sets This Company Apart<br/><br/></strong>This is an opportunity to join a mission-driven company that is transforming its industry landscape. The company fosters a collaborative and inclusive culture where everyone's contribution is valued. They offer opportunities for professional growth and development along with competitive benefits package.", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3983901547"}