{"jobTitle": "Practice Assistant - Transactional (Hybrid)", "company": {"name": "Holland & Knight LLP", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative and Legal", "industry": "Law Practice", "description": "We are a Firm where people truly believe in what they do and strive to achieve the highest standards of performance and success.\n\nGeneral Description\nPractice Assistants provide high quality administrative support to a group of lawyers and professionals in a team environment, effectively and efficiently meeting Firm/client needs. The practice assistant position is currently a hybrid role with designated days required to be in the office, which may change depending on future needs of the firm or industry standards. This position will be located in Century City, CA.\n\nKey Responsibilities And Essential Job Functions\nPrior experience in Venture Capital and Emerging Companies, preferred.\nCommunicate effectively and professionally with clients, lawyers, and co-workers via email, by telephone and in person; answer telephone providing responses to routine questions from clients and staff members and/or route calls to appropriate lawyer or staff member; arrange conference calls and greet clients.\nCreate, draft, format, edit, proofread, and manage Word documents, Excel spreadsheets, PowerPoint presentations; draft routine business correspondence, forms, and documents under the supervision of an appropriate lawyer/professional.\nSchedule domestic and foreign travel through firm travel system, including flights, hotels and/or car rentals.\nPrepare, organize, and process reimbursements, invoices, and check requests in a timely manner.\nCollect and prepare information to run conflict checks, open new client matters, and draft engagement letters, scope letters, and other required documents; provide guidance to lawyers to ensure completed forms are prepared and submitted properly.\nLearn client-specific billing guidelines or restrictions and consistently apply them to client invoices to ensure compliance and cost-effective practices.\nOpen, prioritize and distribute mail (both paper and electronic); coordinate mailings, deliveries, and copying, scanning, and printing, when appropriate.\nEnter and manage work requests from lawyers in the firm’s workflow tool and complete according to provided deadline(s).\nPerform routine electronic and paper filing in an organized manner for easy access; photocopy, scan, compile, and distribute documents; identify and coordinate available services provided by administrative departments such as office services, the IT Help Desk, document services, accounting, billing, and records.\nPerform all file maintenance, including saving documents to the document management system.\nAssist lawyers with time entry, billing, and collection, as needed.\nOperate independently to ensure completion of assignments, which may be complex in nature or require high-level production, in an accurate and timely manner. Produce a high volume of work assignments in an accurate and timely manner.\nPerform clerical duties for non-legal departments, as needed.\nSpecial project and duties as assigned.\n\nRequired Skills\nAdvanced knowledge of Microsoft Office Suite and Adobe.\nExperience with document management systems.\nExperience with electronic signature software programs.\nProficiency in core legal administrative assistant functions and advanced technical and communications skills.\nAbility to thrive in a fast-paced environment with demonstrated ability to coordinate multiple competing tasks and demands.\nSuperb attention to detail, grammar, and punctuation, and the ability to articulate thoughts and effectively present innovative ideas and findings.\nAbility to take direction and work independently with little supervision.\nAbility to effectively work well with others.\nEffective and professional interpersonal and communication skills.\nAbility to write clearly and professionally, with excellent proofing skills.\nStrong work ethic with ability and commitment to maintain confidentiality.\nAbility to lift and carry up to 30 pounds.\n\nRequired Qualifications & Education\nBachelor’s degree preferred.\n5 to 10 years supporting lawyers and paralegal with administrative or client-related tasks, required\n\nPhysical Requirements\nAbility to sit or stand for extended periods of time.\nModerate or advanced keyboard usage\n\nIn accordance with the California Pay Transparency Law, the pay range for this position is $37.50 – $56.30/hr. An individual's actual compensation will depend on the individual's qualifications and experience.\n\nBenefits: Our goal is to promote a work environment in which individuals have access to the resources they need to be at their best both professionally and personally, which includes resources that encourage individuals to focus on their health and well-being. Below is a list of just some of the benefits we offer: generous paid time off; eleven paid holidays per year; time off for bereavement or jury duty; paid leave for new parents; comprehensive medical (PPO and HDHPs), dental and vision plans including coverage for domestic partners; life and AD&D insurance; short and long term disability insurance; tax-advantaged accounts for health care expenses, including FSA or HSA; FSA for dependent care; supplemental AFLAC policies for medical care; excess liability coverage; health advocacy services; behavioral health and counseling resources for all family members; 401(k); profit sharing; pre-tax transit and parking program; backup care for children and adults; senior care planning support; and resources for individuals with development disabilities and their caregivers.\n\nBenefits may vary by position and office.\n\nHolland & Knight is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran or any other protected class.\n\nPersonal Information collected from applicants will be used for the purpose of processing the application throughout any recruitment or employment process, as well as inclusion in a personnel file. Categories of data collected may include name, address, phone numbers, email, Social Security Number, and signature. Holland & Knight may collect further information if you consent to a background check. This includes criminal background, employment, and certifications. Please visit Legal Information Portal for Holland & Knight LLP’s privacy policies.", "responsibilities": "Practice Assistants provide high quality administrative support to a group of lawyers and professionals in a team environment, effectively and efficiently meeting Firm/client needs. The practice assistant position is currently a hybrid role with designated days required to be in the office, which may change depending on future needs of the firm or industry standards. This position will be located in Century City, CA.", "qualifications": {"required": "5 to 10 years supporting lawyers and paralegal with administrative or client-related tasks, required", "preferred": "Bachelor’s degree preferred."}, "skills": ["Microsoft Office Suite", "Adobe", "document management systems", "electronic signature software programs", "legal administrative assistant functions", "technical and communications skills", "attention to detail", "grammar", "punctuation", "interpersonal and communication skills", "writing", "proofing skills", "work ethic", "confidentiality"], "postedDate": "2 weeks ago", "benefits": "Our goal is to promote a work environment in which individuals have access to the resources they need to be at their best both professionally and personally, which includes resources that encourage individuals to focus on their health and well-being. Below is a list of just some of the benefits we offer: generous paid time off; eleven paid holidays per year; time off for bereavement or jury duty; paid leave for new parents; comprehensive medical (PPO and HDHPs), dental and vision plans including coverage for domestic partners; life and AD&D insurance; short and long term disability insurance; tax-advantaged accounts for health care expenses, including FSA or HSA; FSA for dependent care; supplemental AFLAC policies for medical care; excess liability coverage; health advocacy services; behavioral health and counseling resources for all family members; 401(k); profit sharing; pre-tax transit and parking program; backup care for children and adults; senior care planning support; and resources for individuals with development disabilities and their caregivers.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983436577"}