{"jobTitle": "Senior Media Planner/Buyer", "company": {"name": "Bloom Ads Global Media Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80k-$95k/year", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "Job Description<br/><br/>We are looking for your dynamic, best-in-class talent! Bloom Ads is currently seeking a Senior Media Planner/Buyer to add to our growing media team. The Senior Media Planner/Buyer will coordinate media planning efforts in conjunction with our Sr. Media Manager. The Senior Media Planner/Buyer must effectively interact with clients, internal account teams as well as media partners.<br/><br/>You'll be a thought leader, recognizing innovative, game-changing ideas to solve our clients’ business challenges through highly integrated media plans. You will work directly with and support the Sr, Media Manager in their leadership roles in all advertising, marketing, and business efforts for all assigned accounts. Qualified candidates must have vast experience creating, developing, and executing cross-channel media plans and an eye for detail, ensuring work is client-ready and exceeds client expectations.<br/><br/>Desired Skills<br/><br/><ul><li>A strong, effective communicator with managing experience</li><li>Background across both traditional (OOH, Linear TV &amp; Radio, Print, etc.) and digital media</li><li>A problem solver with the ability to develop creative solutions</li><li>Detail-oriented with strong organizational skills</li><li>Ensuring you’re constantly proactive and not reactive helping to stay ahead of client/team needs and questions</li><li>Great with time management &amp; comfortable working with multiple timelines and deliverables</li><li>Comfortable working within large sets of data and numbers</li><li>A helpful team player with business maturity in a professional setting; willing to roll up your sleeves and get your hands dirty &amp; get in the weeds</li><li>Takes pride in ownership of work and demonstrates accountability</li><li>Results and solutions-oriented; consistently motivated, proactive, and resourceful</li><li>Interested in the media landscape with a desire to constantly innovate and keep up with trends</li><li>Positive attitude and demeanor<br/><br/></li></ul>Responsibilities<br/><br/><ul><li>Media Planning &amp; Buying - 25%</li><li> Develop proposals for paid media campaigns across the active client roster</li><li> Create and present media-specific documents such as RFPs, media plans, strategic decks, and other related assignments</li><li> Responsible for analyzing proposals, partner negotiations, and then signing IOs</li><li> Maintain vendor meeting communication, updating internal weekly status documents, and maintaining team deliverables</li><li>Media Strategy &amp; Buying Oversight - 25%</li><li> Engage in new &amp; emerging opportunities and applications in paid media environments, and then appropriately apply that knowledge</li><li> Take ownership of completing and monitoring both internal team and client-facing financial tracking documents</li><li> Manage and execute Quality Assurance (QA) across all deliverables/documents to identify and solve any issues</li><li> Provide education on best practices, media principles, and the media industry at large</li><li> Work with AdOps team to ensure campaigns launch correctly, on time, and continue to be executed flawlessly throughout all campaign durations (i.e., final post-logs review for Linear TV, conversions are taking place daily, tagging issues are not taking place with placements, etc.)</li><li>Campaign Management/Execution - 20%</li><li> Maintain thorough knowledge in all internal buying and reporting tools, including platform interfaces and native tools (when applicable), target digital consumption support, plan development, and reporting</li><li> Assist AdOps in trafficking plan assets such as creative and required tracking tags</li><li> Generate insertion orders within internal systems tool to reserve advertising space and is responsible for accuracy of plan details and confirmation of delivery ensuring proper protocol</li><li> Responsible for collaboration with the setup of Paid Social campaigns with the Social Team to ensure full alignment</li><li>Relationship Development - 10%</li><li> Anticipates and fields requests and questions from internal teams when needed</li><li> Own and maintain active communication with internal client roster teams to manage timelines and cross-collaborative meetings</li><li> Work closely to partner and build relationships with other internal teams (e.g., Acct. Team, AdOps, &amp; Analytics)</li><li> Participate in larger team projects with direct oversight from the Supervisor</li><li> Manage Media Planner/Buyer and Associate to delegate tasks, QA their work, and ensure you’re assisting with their career growth through stimulating and challenging work</li><li> Participate in the interview process for Associate/Planner/Coordinator roles</li><li>Reporting - 10%</li><li> Monitor pacing and optimizations of active campaigns across the client roster daily</li><li> Generate high-level performance insights and recommendations relative to active client campaigns in tandem with the manager and the Analytics team for holistic reporting</li><li> Manage client roster reporting on campaign performance and proactively communicate any issues to internal team managers, when necessary</li><li>Learning &amp; Development - 10%</li><li> Attend agency learning sessions and vendor meetings</li><li> Participate in internal learning and development opportunities (e.g. Facebook Blueprint, Google AdWords, Twitter Flight School, etc.)<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>A four-year college degree or equivalent in marketing, advertising, or a related field</li><li>4+ years of media planning and/or buying experience</li><li>Demonstrated presentation and writing skills</li><li>Ability to work autonomously or in a more team-oriented environment</li><li>Experience managing and coordinating inter-departmental efforts</li><li>MS Office: Internet Explorer, Excel, Word and PowerPoint</li><li>Experience or familiarity using industry media planning tools: Donovan/Media Ocean, Media Tools, MRI Research, TNS, DDS/Strata/DataTech, etc. </li><li>An understanding of digital advertising is preferred<br/><br/></li></ul>Compensation Range: $80k-$95k/year Depending on Experience<br/><br/>This is the pay range Bloom Ads reasonably expects it will pay for this position at the time of this posting. Consistent with applicable law, compensation will be determined based on the level of experience, relevant skills, professional certifications, market pay, and demand for the role. Bloom Ads reserves the right to modify this pay range at any time.<br/><br/>Company Description<br/><br/>About the Company:<br/><br/>Bloom offers an agency life in a family-oriented environment. And don’t worry... it’s not all about the work. We also love to play. Our culture prides itself not only on insight, innovation, and results but also on growing and expanding our breadth of knowledge through fun team-building activities. The position offers competitive compensation and full benefits. To apply, please send your resume, cover letter, and salary requirements to hr@bloomads.com.<br/><br/>Bloom will invest in you, your wellness, and your future.<br/><br/>Full medical benefits, including health, dental and vision coverage<br/><br/>Generous vacation policy<br/><br/>12 Paid Holidays + WFH Fridays (workday ends at 2 pm)<br/><br/>Company contribution to employee 401(K)<br/><br/>Company-paid volunteer hours<br/><br/>Professional development program<br/><br/>Extras<br/><br/>Free snacks (mostly healthy)<br/><br/>Sundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat<br/><br/>Monthly lunch and learns<br/><br/>Quarterly town hall meetings with lots of food and prizes<br/><br/>Team parties and celebrations<br/><br/>Responsible for developing best-in-class media solutions. In a widely disparate advertising landscape, we leverage best-in-class strategy, technology and analytics to deliver the most comprehensive, highest-performing media solutions on the market. We provide extensive expertise for some of the best and brightest brands across our agency partner landscape. Headquartered in Los Angeles, California, Bloom operates in 100+ markets worldwide.<br/><br/>We are a fast-paced, risk-taking, close-knit environment where ideas come from everywhere at every level. We believe that diversity of background, talent, skillset and mindset create a flourishing environment for new thinking and ideas. Our business is growing and we are always looking for new talent. If you are driven by challenging work, passionate about media and technology and interested in helping to shape the future of our industry, we would like to hear from you!<br/><br/>Note: Travel to and from client and vendor sites in a personal vehicle may be required in this position. The preceding functions have been provided as the types of work performed by the employees assigned to this job classification. Management reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job. This job description does not promise or imply that the functions listed are the only duties to be performed or that the position may not change or be eliminated.", "responsibilities": "Develop proposals for paid media campaigns across the active client roster\nCreate and present media-specific documents such as RFPs, media plans, strategic decks, and other related assignments\nResponsible for analyzing proposals, partner negotiations, and then signing IOs\nMaintain vendor meeting communication, updating internal weekly status documents, and maintaining team deliverables\nEngage in new &amp; emerging opportunities and applications in paid media environments, and then appropriately apply that knowledge\nTake ownership of completing and monitoring both internal team and client-facing financial tracking documents\nManage and execute Quality Assurance (QA) across all deliverables/documents to identify and solve any issues\nProvide education on best practices, media principles, and the media industry at large\nWork with AdOps team to ensure campaigns launch correctly, on time, and continue to be executed flawlessly throughout all campaign durations (i.e., final post-logs review for Linear TV, conversions are taking place daily, tagging issues are not taking place with placements, etc.)\nMaintain thorough knowledge in all internal buying and reporting tools, including platform interfaces and native tools (when applicable), target digital consumption support, plan development, and reporting\nAssist AdOps in trafficking plan assets such as creative and required tracking tags\nGenerate insertion orders within internal systems tool to reserve advertising space and is responsible for accuracy of plan details and confirmation of delivery ensuring proper protocol\nResponsible for collaboration with the setup of Paid Social campaigns with the Social Team to ensure full alignment\nAnticipates and fields requests and questions from internal teams when needed\nOwn and maintain active communication with internal client roster teams to manage timelines and cross-collaborative meetings\nWork closely to partner and build relationships with other internal teams (e.g., Acct. Team, AdOps, &amp; Analytics)\nParticipate in larger team projects with direct oversight from the Supervisor\nManage Media Planner/Buyer and Associate to delegate tasks, QA their work, and ensure you’re assisting with their career growth through stimulating and challenging work\nParticipate in the interview process for Associate/Planner/Coordinator roles\nMonitor pacing and optimizations of active campaigns across the client roster daily\nGenerate high-level performance insights and recommendations relative to active client campaigns in tandem with the manager and the Analytics team for holistic reporting\nManage client roster reporting on campaign performance and proactively communicate any issues to internal team managers, when necessary\nAttend agency learning sessions and vendor meetings\nParticipate in internal learning and development opportunities (e.g. Facebook Blueprint, Google AdWords, Twitter Flight School, etc.)", "qualifications": {"required": "A four-year college degree or equivalent in marketing, advertising, or a related field\n4+ years of media planning and/or buying experience\nDemonstrated presentation and writing skills\nAbility to work autonomously or in a more team-oriented environment\nExperience managing and coordinating inter-departmental efforts\nMS Office: Internet Explorer, Excel, Word and PowerPoint\nExperience or familiarity using industry media planning tools: Donovan/Media Ocean, Media Tools, MRI Research, TNS, DDS/Strata/DataTech, etc. ", "preferred": "An understanding of digital advertising is preferred"}, "skills": ["Communication", "Media Planning", "Media Buying", "Digital Advertising", "MS Office", "Problem Solving", "Time Management", "Teamwork", "Accountability", "Data Analysis", "Innovation", "Media Strategy", "Quality Assurance", "Relationship Building", "Reporting"], "postedDate": "4 weeks ago", "benefits": "Full medical benefits, including health, dental and vision coverage\nGenerous vacation policy\n12 Paid Holidays + WFH Fridays (workday ends at 2 pm)\nCompany contribution to employee 401(K)\nCompany-paid volunteer hours\nProfessional development program\nFree snacks (mostly healthy)\nSundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat\nMonthly lunch and learns\nQuarterly town hall meetings with lots of food and prizes\nTeam parties and celebrations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983998137"}