{"jobTitle": "Materials Manager", "company": {"name": "Collins Aerospace", "location": "Santa Fe Springs, CA", "industry": "Aviation and Aerospace Component Manufacturing"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "105,000 USD - 221,000 USD", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Date Posted:<br/><br/></strong>2024-07-22<br/><br/><strong>Country:<br/><br/></strong>United States of America<br/><br/><strong>Location:<br/><br/></strong>HCA04: Wheels &amp; Brakes (Carbon) -SFS 11120 S Norwalk Blvd, Santa Fe Springs, CA, 90670 USA<br/><br/><strong>Position Role Type:<br/><br/></strong>Onsite<br/><br/>As the <strong>Materials Manager</strong>, you will lead a highly skilled team of Materials Planning and Sales, Inventory, and Operations Planning (SIOP) professionals onsite at our Santa Fe Springs, CA facility, ensuring flawless execution of operational strategies. This role encompasses the meticulous scheduling, monitoring, and timely shipping of products, driving efficiency and meeting customer demands with precision. You will spearhead the development of comprehensive inventory control reports and manuals, optimizing processes and safeguarding operational excellence in every detail.<br/><br/><strong>What You Will Do: <br/><br/></strong><ul><li>The functional process responsibilities include Production Planning, Production Control, and Inventory Control for the site. </li><li>Managing a team of production planners</li><li>The position also is a key contributor to Inventory Management, SIOP, Master Scheduling / Capacity Planning</li><li>The Manager, Materials manages the team who has responsibilities for ensuring the right materials on time for finished goods, semi-finished goods, and raw materials for the site, while ensuring continuous improvement of planning process. </li><li>Lead regular commitment/planning meetings to establish regular production plan. </li><li>With OTD and Inventory as key metrics and balanced to ensure supply and demand alignment, the Manager ensures the team has documented and clear roles and responsibilities, planning assignments, and metrics that tie to business targets for site and the division. </li><li>The Manager, Materials shall also be responsible for process adherence and compliance to accuracy and on time cycle counts for the site. </li><li>The role shall have a tireless focus on continuous improvement and ensure the cycle count program drives improvements needed to achieve targets. </li><li>If targets are not met, the role is responsible for leading an Annual Physical Inventory for the site, ensuring materials are accurately accounted for, including WIP. </li><li>The Manager, Materials shall also be responsible for process adherence, compliance, and improvement to WIP management through robust Production Order Management, Visual Control Metrics, Production Management and Control meetings, and capturing and actioning turnback’s to the production schedule. </li><li>The role ensures daily and/or weekly production meetings with manufacturing, quality, and engineering to ensure a lean and effective flow of materials through the site. </li><li>The Manager, Materials shall also be responsible for E&amp;O and Aged WIP financial processes for review and updates to reserve. </li><li>Additionally, the role shall ensure proactive action to eliminate and avoid Excess and Obsolete inventory, by raising excess inventory in site materials reviews and division SIOP process for liquidation/elimination and timely scrap of obsolete material. </li><li>The Manager, Materials additional responsibilities include supporting Macro Plan for process and systems continuous improvement, including but not limited to leading projects or events. </li><li>Additionally, the execution of key contributing tasks to Inventory Management, SIOP, and Master Scheduling / Capacity Planning</li><li>Travel requirements are minimal, up to 10%, to support events. <br/><br/></li></ul><strong>Qualifications You Must Have<br/><br/></strong><ul><li>Typically requires University Degree and minimum 8 years prior relevant experience or an Advanced Degree in a related field and minimum 5 years of experience or in absence of a degree, 12 years of relevant experience</li><li>U.S. Person (U.S. citizen, permanent resident, or granted refugee or asylee status) as defined here: https://www.ecfr.gov/current/title-22/chapter-I/subchapter-M/part-120/subpart-C/section-120.62 </li><li>Minimum 5 years of Manufacturing industry experience</li><li>ERP experience in manufacturing planning</li><li>Experience leading and managing others directly or indirectly (i.e. projects)<br/><br/></li></ul><strong>Qualifications We Prefer<br/><br/></strong><ul><li>SAP experience</li><li>Aerospace industry experience</li><li>APICS Certification (CPIM, CSCP)</li><li>Degree in Business Management, Materials Management, Operations Management, Supply Chain Management, or another related field</li><li>Computer skills in Microsoft Office Software (i.e., Excel, Visio etc.) as well as Business Intelligence Software<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Eligible for relocation</li><li>Medical, dental, and vision insurance</li><li>Three weeks of vacation for newly hired employees</li><li>Generous 401(k) plan that includes employer matching funds and separate employer retirement contribution, including a Lifetime Income Strategy option</li><li>Tuition reimbursement program</li><li>Student Loan Repayment Program</li><li>Life insurance and disability coverage</li><li>Optional coverages you can buy: pet insurance, home and auto insurance, additional life and accident insurance, critical illness insurance, group legal, ID theft protection</li><li>Birth, adoption, parental leave benefits</li><li>Ovia Health, fertility, and family planning</li><li>Adoption Assistance </li><li>Autism Benefit</li><li>Employee Assistance Plan, including up to 10 free counseling sessions</li><li>Healthy You Incentives, wellness rewards program</li><li>Doctor on Demand, virtual doctor visits</li><li>Bright Horizons, child and elder care services</li><li>Teladoc Medical Experts, second opinion program</li><li> And more! <br/><br/></li></ul><strong>Learn More &amp; Apply Now!<br/><br/></strong>Diversity drives innovation; inclusion drives success. We believe a multitude of approaches and ideas enable us to deliver the best results for our workforce, workplace, and customers. We are committed to fostering a culture where all employees can share their passions and ideas so we can tackle the toughest challenges in our industry and pave new paths to limitless possibility.<br/><br/>This role is also eligible for the Re-Empower Program. The Re-Empower Program helps support talented and committed professionals as they rebuild their capabilities, enhance leadership skills, and continue their professional journey. Over the course of the 14-week program, experienced professionals will gain paid, on-the-job experience, have an opportunity to participate in sessions with leadership, develop personalized plans for success and receive coaching to guide their return-to-work experience. Upon completion of the program, based on performance and contributions participants will be eligible for a career at RTX.<br/><br/>To qualify for the Raytheon Technologies, Re-Empower Program, candidates should:<br/><br/><ul><li>Be on a career break of one or more year at time of application</li><li>Have prior experience in functional area of interest</li><li>Have interest in returning in either a full-time or part-time position<br/><br/></li></ul>Our Advanced Structures team leverages advanced materials and additive manufacturing to develop complex interior and exterior solutions. These solutions ensure structural integrity of the aircraft, help aircraft take off and land, stay trim in the air, move forward, carry cargo and conduct rescues. We delight our customers with superior products and best-in-class service. Our global team is committed to continuous improvement – we work hard to make our solutions lighter-weight, stronger and more technically advanced, so that plane travel can be safer, more affordable and more sustainable in the years to come. We are looking for the best and brightest to fly and land with us!<br/><br/>Please consider the following role type definitions as you apply for this role.<br/><br/><ul><li>Onsite: Employees who are working in Onsite roles will work primarily onsite. This includes all production and maintenance employees, as they are essential to the development of our products. </li><li>Regardless of your role type, collaboration and innovation are critical to our business and all employees will have access to digital tools so they can collaborate with colleagues around the world – and access to Collins sites when their work requires in-person meetings. <br/><br/></li></ul>To learn more about Collins’ Landing Systems business; please click this link: https://www.youtube.com/watch?v=7qcXPa0ZCeE<br/><br/>The salary range for this role is 105,000 USD - 221,000 USD. The salary range provided is a good faith estimate representative of all experience levels. RTX considers several factors when extending an offer, including but not limited to, the role, function and associated responsibilities, a candidate’s work experience, location, education/training, and key skills.<br/><br/>Hired applicants may be eligible for benefits, including but not limited to, medical, dental, vision, life insurance, short-term disability, long-term disability, 401(k) match, flexible spending accounts, flexible work schedules, employee assistance program, Employee Scholar Program, parental leave, paid time off, and holidays. Specific benefits are dependent upon the specific business unit as well as whether or not the position is covered by a collective-bargaining agreement.<br/><br/>Hired applicants may be eligible for annual short-term and/or long-term incentive compensation programs depending on the level of the position and whether or not it is covered by a collective-bargaining agreement. Payments under these annual programs are not guaranteed and are dependent upon a variety of factors including, but not limited to, individual performance, business unit performance, and/or the company’s performance.<br/><br/>This role is a U.S.-based role. If the successful candidate resides in a U.S. territory, the appropriate pay structure and benefits will apply.<br/><br/>RTX anticipates the application window closing approximately 40 days from the date the notice was posted. However, factors such as candidate flow and business necessity may require RTX to shorten or extend the application window.<br/><br/><strong><em>RTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.<br/><br/></em></strong><strong>Privacy Policy and Terms:<br/><br/></strong>Click on this link to read the Policy and Terms", "responsibilities": "As the <strong>Materials Manager</strong>, you will lead a highly skilled team of Materials Planning and Sales, Inventory, and Operations Planning (SIOP) professionals onsite at our Santa Fe Springs, CA facility, ensuring flawless execution of operational strategies. This role encompasses the meticulous scheduling, monitoring, and timely shipping of products, driving efficiency and meeting customer demands with precision. You will spearhead the development of comprehensive inventory control reports and manuals, optimizing processes and safeguarding operational excellence in every detail.", "qualifications": {"required": "Typically requires University Degree and minimum 8 years prior relevant experience or an Advanced Degree in a related field and minimum 5 years of experience or in absence of a degree, 12 years of relevant experience\nU.S. Person (U.S. citizen, permanent resident, or granted refugee or asylee status) as defined here: https://www.ecfr.gov/current/title-22/chapter-I/subchapter-M/part-120/subpart-C/section-120.62 \nMinimum 5 years of Manufacturing industry experience\nERP experience in manufacturing planning\nExperience leading and managing others directly or indirectly (i.e. projects)", "preferred": "SAP experience\nAerospace industry experience\nAPICS Certification (CPIM, CSCP)\nDegree in Business Management, Materials Management, Operations Management, Supply Chain Management, or another related field\nComputer skills in Microsoft Office Software (i.e., Excel, Visio etc.) as well as Business Intelligence Software"}, "skills": ["ERP", "SAP", "Inventory Management", "SIOP", "Master Scheduling", "Capacity Planning", "Production Planning", "Production Control", "Inventory Control", "Continuous Improvement", "Cycle Counting", "Annual Physical Inventory", "WIP Management", "Production Order Management", "Visual Control Metrics", "Production Management", "E&O", "Aged WIP", "Excess and Obsolete Inventory", "Macro Plan", "Microsoft Office", "Business Intelligence Software"], "postedDate": "5 days ago", "benefits": "Eligible for relocation\nMedical, dental, and vision insurance\nThree weeks of vacation for newly hired employees\nGenerous 401(k) plan that includes employer matching funds and separate employer retirement contribution, including a Lifetime Income Strategy option\nTuition reimbursement program\nStudent Loan Repayment Program\nLife insurance and disability coverage\nOptional coverages you can buy: pet insurance, home and auto insurance, additional life and accident insurance, critical illness insurance, group legal, ID theft protection\nBirth, adoption, parental leave benefits\nOvia Health, fertility, and family planning\nAdoption Assistance \nAutism Benefit\nEmployee Assistance Plan, including up to 10 free counseling sessions\nHealthy You Incentives, wellness rewards program\nDoctor on Demand, virtual doctor visits\nBright Horizons, child and elder care services\nTeladoc Medical Experts, second opinion program\n And more! ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983057275"}