{"jobTitle": "Plant Manager - Recycling", "company": {"name": "CMC", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "it’s what’s inside that counts<br/><br/>_______________________________<br/><br/>There’s more to CMC than our products and the buildings, structures, and roads they go into. At CMC, it’s the people inside our recycling centers, fabrication plants, manufacturing facilities, steel mills and offices that make us who we are as a company. Our success comes from finding, retaining, and supporting the highest quality talent by offering:<br/><br/><ul><li>Day 1 Benefits Coverage with low cost Medical, Vision, Dental</li><li>Day 1 Paid-time Off and Vacation</li><li>4.5% Company Match 401(k) plan</li><li>$500 Annual Company-paid Lifestyle Benefit</li><li>Competitive Compensation and Bonuses</li><li>Company-paid Life and Disability Insurance</li><li>Employee Stock Purchase Plan</li><li>Training and Advancement Opportunities</li><li>Pay range: $100,000 - $130,000 annually (depending on experience)<br/><br/></li></ul><strong>Why This Job<br/></strong>CMC provides an excellent opportunity to learn the steel, construction reinforcement and ground stabilization industries and to grow in your career. Whether you will spend your day brainstorming in an office cubicle, operating a crane, running manufacturing equipment or troubleshooting technical obstacles, at CMC, you’ll get the training and support from your team that you need to excel in your role and reach your full potential.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Embodies and reinforces CMC's culture, Guiding Principles, Safety, and policies/procedures</li><li>Lead in a professional manner toward achieving company performance goals with emphasis on safety, quality and all company standards</li><li>Must collaborate and develop strong relationships with people to ensure successful accomplishments of plant and regional goals</li><li>Assists in the control of inventory dollars and tons by meeting inventory turn standards set forth by the company</li><li>Demonstrates a passion for customers and world class customer service</li><li>Provides guidance and direction to staff including hiring, disciplinary action, staff development, goal formulation and performance review</li><li>Ensures compliance with employment laws and regulations, minimizing the company’s exposure to adverse outcomes of complaints, litigation, audits and inspections<br/><br/></li></ul><strong>What You'll Need<br/><br/></strong><ul><li>Minimum of 3 years of supervisory experience preferred</li><li>Able to clearly communicate expectations, issues and feedback</li><li>Ability to multitask and handle stress in a highly productive environment</li><li>Entrepreneurial attitude and exceptional leadership skills to include team building skills by setting high standards for self and others</li><li>Participate in the CMC Safety Programs and proactively uphold the CMC Safety Culture</li><li>Must be able to assist in problem solving in all areas of plant</li><li>Bi-lingual English/Spanish preferred</li><li>Non-ferrous experience strongly preferred but not required<br/><br/></li></ul><strong>Your Education<br/><br/></strong><ul><li>High School Diploma or GED required</li><li>Bachelor's degree preferred<br/><br/></li></ul>We are Commercial Metals Company, a Fortune 500 company with a family feel that’s already part of your life. Our steel products have been supporting structures in more than 20 countries for over 100 years. And the secret to our success? We’ve built our legacy by assembling a team of innovators and doers to tackle some of the most challenging problems facing our world over the last 100 years — but we’re just getting started.<br/><br/>If you’re ready to reimagine ways to make the steel industry more sustainable, reinforce the bridges and roadways connecting our communities, and do meaningful work, you’re ready to join CMC. Apply today and start moving your career — and our world — forward.<br/><br/>CMC is committed to providing equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, age, physical or mental disability, national origin, citizenship, military or veteran status, sexual orientation, gender identity and/or expression, genetic information, or other status protected by federal, state or local law.", "responsibilities": "<ul><li>Embodies and reinforces CMC's culture, Guiding Principles, Safety, and policies/procedures</li><li>Lead in a professional manner toward achieving company performance goals with emphasis on safety, quality and all company standards</li><li>Must collaborate and develop strong relationships with people to ensure successful accomplishments of plant and regional goals</li><li>Assists in the control of inventory dollars and tons by meeting inventory turn standards set forth by the company</li><li>Demonstrates a passion for customers and world class customer service</li><li>Provides guidance and direction to staff including hiring, disciplinary action, staff development, goal formulation and performance review</li><li>Ensures compliance with employment laws and regulations, minimizing the company’s exposure to adverse outcomes of complaints, litigation, audits and inspections<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 3 years of supervisory experience preferred, Able to clearly communicate expectations, issues and feedback, Ability to multitask and handle stress in a highly productive environment, Entrepreneurial attitude and exceptional leadership skills to include team building skills by setting high standards for self and others, Participate in the CMC Safety Programs and proactively uphold the CMC Safety Culture, Must be able to assist in problem solving in all areas of plant, Bi-lingual English/Spanish preferred, Non-ferrous experience strongly preferred but not required", "preferred": "High School Diploma or GED required, Bachelor's degree preferred"}, "skills": ["Safety", "Leadership", "Customer Service", "Team Building", "Inventory Management", "Problem Solving", "Communication", "Supervisory Experience", "Non-ferrous Experience", "Bi-lingual English/Spanish"], "postedDate": "3 weeks ago", "benefits": "<ul><li>Day 1 Benefits Coverage with low cost Medical, Vision, Dental</li><li>Day 1 Paid-time Off and Vacation</li><li>4.5% Company Match 401(k) plan</li><li>$500 Annual Company-paid Lifestyle Benefit</li><li>Competitive Compensation and Bonuses</li><li>Company-paid Life and Disability Insurance</li><li>Employee Stock Purchase Plan</li><li>Training and Advancement Opportunities</li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983735685"}