{"jobTitle": "Team Lead, Legal Investigations Support", "company": {"name": "Google", "location": "Chicago, IL"}, "location": "Chicago, IL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "125,000.00/yr - 185,000.00/yr", "currency": "USD"}, "jobFunction": "Legal and Public Relations", "industry": "Information Services and Technology, Information and Internet", "description": "Minimum qualifications:<br/><br/>\n<ul><li>Bachelor's degree or equivalent practical experience.</li><li>5 years of experience in a policy, legal, Trust &amp; Safety, or technology environment.</li><li>Experience in people management as a lead, or coaching or mentoring others.<br/><br/></li></ul>Preferred qualifications:<br/><br/>\n<ul><li>3 years of experience managing policy or operational processes with a high volume of requests, with heavy emphasis on velocity and accuracy.</li><li>Experience with the development, implementation, and maintenance of policy.</li><li>Experience managing strategic programs that span organizations and have a direct business impact.</li><li>Experience in designing and driving initiatives aimed at developing and improving culture.<br/><br/></li></ul>About The Job<br/><br/>\nThe Legal Investigations Support (LIS) team handles requests for user data received from government agencies, courts, and parties in criminal and civil litigation. LIS handles a high-volume of these legal requests, processing them through internal tools based on complex internal policy and workflows utilizing queue management and metric performance.<br/><br/>This role works with sensitive content or situations and may be exposed to graphic, controversial, and/or upsetting topics or content. The requests will relate to real-world investigations on Google users. Some of those investigations will be routine, others may very well be on the news. Members of this team must respect confidentiality, and be sensitive to legal requirements and user privacy laws.<br/><br/>The US base salary range for this full-time position is $125,000-$185,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/>\nResponsibilities<br/><br/>\n<ul><li>Lead a team of individuals; set and communicate individual and team priorities that support organizational goals. Meet regularly with individuals to discuss performance and development, and provide feedback and coaching.</li><li>Track team metrics and manage operational goals for individual team members.</li><li>Analyze and respond to law-enforcement or civil legal requests from international agencies and participate in on-call pager rotation, responding to emergency law-enforcement requests.</li><li>Identify policy issues that may affect Google and understand their impact, and manage high-impact policy escalations and suggest improvements. Assist in designing, implementing, and documenting new policies and procedures that drive more efficiency, improve quality, and/or mitigate risk.</li><li>Work with sensitive content or situations and potentially be exposed to graphic, controversial, and/or upsetting topics or content.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Lead a team of individuals; set and communicate individual and team priorities that support organizational goals. Meet regularly with individuals to discuss performance and development, and provide feedback and coaching.</li><li>Track team metrics and manage operational goals for individual team members.</li><li>Analyze and respond to law-enforcement or civil legal requests from international agencies and participate in on-call pager rotation, responding to emergency law-enforcement requests.</li><li>Identify policy issues that may affect Google and understand their impact, and manage high-impact policy escalations and suggest improvements. Assist in designing, implementing, and documenting new policies and procedures that drive more efficiency, improve quality, and/or mitigate risk.</li><li>Work with sensitive content or situations and potentially be exposed to graphic, controversial, and/or upsetting topics or content.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n5 years of experience in a policy, legal, Trust & Safety, or technology environment.\nExperience in people management as a lead, or coaching or mentoring others.", "preferred": "3 years of experience managing policy or operational processes with a high volume of requests, with heavy emphasis on velocity and accuracy.\nExperience with the development, implementation, and maintenance of policy.\nExperience managing strategic programs that span organizations and have a direct business impact.\nExperience in designing and driving initiatives aimed at developing and improving culture."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983489369"}