{"jobTitle": "Revenue Cycle Operations Analyst", "company": {"name": "Husch Blackwell", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Legal", "industry": "Law Practice", "description": "<strong>Husch Blackwell LLP</strong> is a full-service litigation and business law firm with multiple locations across the United States, serving clients with domestic and international operations.<br/><br/>At Husch Blackwell we believe that diverse, equitable and inclusive teams lead to better outcomes. Husch Blackwell is committed to retaining, recruiting, developing, and promoting talented lawyers and business professionals with diverse backgrounds and experiences. We foster an engaged, diverse, and inclusive team culture of accountability and purpose that makes our Firm and our communities better.<br/><br/>Our firm is committed to attracting and retaining professionals who value each other and the service we provide by embracing Teamwork, Collaboration, Client Service, and Innovation. If you are a motivated professional looking for a long-term fit where you can grow in a role, and will be valued and empowered, then we invite you to apply to our<strong> Revenue Cycle Operations Analyst</strong> position. This position may be filled remotely, or in any of our locations.<br/><br/>The Revenue Cycle Operations Analyst will have responsibility for aspects of SBU client billing and revenue services. This role will manage revenue cycle related activities for key CRM’s within their assigned Strategic Business Unit. They will participate in continuous improvement activities with peer positions to optimize revenue cycle workflow and reduce the time investment of assigned Billing Attorneys or CRM’s in these administrative tasks. Essential job functions include:<br/><br/><ul><li>Serve as the point of contact for SBU Managing Directors and select Billing Attorneys for revenue cycle related questions.</li><li>Collaborate with intersecting teams, PST/ART, Conflicts, NBI, Pricing, Billing, Collections, AR and AP, etc. to ensure revenue cycle processes are running accurately and efficiently.</li><li>Maintain direct relationship with the Clients, act as liaison for questions and issues (particularly data and reporting requests).</li><li>Coordinate efforts with Business Intake on compliance with client internal eBilling and matter management systems (e.g., budgets, status updates, required information, etc.).</li><li>Work with CRM and Billing Attorney to identify required updates to client matter data during the lifecycle and ensure updates are made in relevant systems on a timely basis. Anticipate and be reactive to changing client instructions and requirements.</li><li>Respond to Business Intake team questions / requests in order for them to set up billing related client/matter information.</li><li>Participate in the development of the Memo of Understanding (MOU) related to alternative fee arrangements, proformas, outlines what can and cannot be billed and provides details related to client’s electronic billing system requirements, etc.</li><li>Evaluate vendors to confirm compliance with clients’ OCG.</li><li>Ensure compliance with OCGs and manage list of words/phrases that cannot be used in time entry system and update software applications with word or phrase narrative restrictions.</li><li>Assist with the onboarding &amp; off-boarding of lateral partners &amp; clients; disseminate pertinent information downstream to appropriate teams. Effectively collaborate with other administrative areas and internal resources to meet deliverables.</li><li>Escalate issues/problems to Director of Revenue Cycle Operations that prevents or hinders the delivery of high-quality support to clients.</li><li>Conduct high-quality pre-review of monthly proformas for select clients and matters, as necessary.</li><li>Review billing processes for assigned clients as it relates to the revenue process, as necessary.</li><li>Work with Billing / eBilling on next steps and actions regarding invoice appeals and rejections.</li><li>Gather pertinent data for monthly and quarterly updates for internal and client reporting.</li><li>Collaborate with Client Development Department on tracking client development work, identifies dollar value of “free”/investment work.</li><li>Work with Collections to identify stale AR and evaluate likelihood of collections based on OCG compliance and relationship with client; identify if invoice should be chased down or written off based on a deep dive of the invoice details.</li><li>Work with Billings, Collections, and Cash Applications teams to research and determine the correct course of action for incoming unallocated payments.</li><li>Lead and/or participate in special projects related to the revenue cycle, as necessary.<br/><br/></li></ul><strong>Position Requirements<br/><br/></strong><ul><li>4-year degree required; MBA and/or other advanced degrees preferred.</li><li>5+ years of experience in client billing, practice support, paralegal, or legal project management role.</li><li>Good understanding of Law Firm client matter lifecycle processes, from matter inception through to billing.</li><li>Demonstrated ability to manage client or matter billing assignments in a centralized, cohesive environment, with strong communication skills.</li><li>Proven success working as part of a high-performance team; cultivating a unified, “one team” mentality and approach, strong lines of communication and collaboration; and the highest levels of operational excellence.</li><li>Outstanding interpersonal skills, the ability to lead through influence rather than control and to create consensus-based support for business strategies and decisions.</li><li>Dynamic energy level, an unquestioned work ethic, willingness to “roll up your sleeves,” and work closely with colleagues and team members.</li><li>Superior presentation, written, and verbal communication skills; the ability to interact credibly and diplomatically with all levels in an organization – tailoring communications effectively for different groups and stakeholders.</li><li>Superior business acumen and analytic capabilities, sound judgment.</li><li>A strong background in financial technology, applications, systems, and solutions in the professional services industry; experience using e-billing, and other software for client billing strongly preferred. <br/><br/></li></ul><em>The above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of essential functions, responsibilities, or requirements. The Firm will provide reasonable accommodations as necessary to allow an individual with a disability to apply for and/or perform the essential functions of a position. Please reach out to our HR team to request an accommodation.<br/><br/></em><strong>Compensation And Benefits<br/><br/></strong>Employees are entitled to compensation commensurate with skill and experience. <strong>The exact compensation will vary based on skills, experience, location, and other factors permitted by law.</strong> The expected compensation ranges for this position in various states and jurisdictions are as follows:<br/><br/><ul><li>State of California: $94,000 - $180,000</li><li>State of Colorado: $87,000 - $155,000</li><li>Jersey City, NJ: $102,000 - $186,000</li><li>State of Massachusetts: $94,000 - $180,000</li><li>State of New York: $88,000 - $190,000</li><li>State of Washington: $91,000 - $173,000</li><li>Washington, D.C.: $122,000 - $179,000<br/><br/></li></ul>The above salaries do not include a discretionary bonus, however bonus opportunities are non-guaranteed, and are dependent upon individual and firm performance. Full-time employees receive benefits including: medical and dental coverage; life insurance; short-term and long-term disability insurance; pre-tax flexible spending account for certain medical and dependent care expenses; an employee assistance program; Paid Time Off; paid holidays; participation in a retirement plan program after meeting eligibility requirements; and more.<br/><br/>Please submit a cover letter and resume when applying.<br/><br/>EOE/Minority/Female/Disabled/Vet. Principal Applicants Only.<br/><br/>", "responsibilities": "The Revenue Cycle Operations Analyst will have responsibility for aspects of SBU client billing and revenue services. This role will manage revenue cycle related activities for key CRM’s within their assigned Strategic Business Unit. They will participate in continuous improvement activities with peer positions to optimize revenue cycle workflow and reduce the time investment of assigned Billing Attorneys or CRM’s in these administrative tasks. Essential job functions include:<br/><br/><ul><li>Serve as the point of contact for SBU Managing Directors and select Billing Attorneys for revenue cycle related questions.</li><li>Collaborate with intersecting teams, PST/ART, Conflicts, NBI, Pricing, Billing, Collections, AR and AP, etc. to ensure revenue cycle processes are running accurately and efficiently.</li><li>Maintain direct relationship with the Clients, act as liaison for questions and issues (particularly data and reporting requests).</li><li>Coordinate efforts with Business Intake on compliance with client internal eBilling and matter management systems (e.g., budgets, status updates, required information, etc.).</li><li>Work with CRM and Billing Attorney to identify required updates to client matter data during the lifecycle and ensure updates are made in relevant systems on a timely basis. Anticipate and be reactive to changing client instructions and requirements.</li><li>Respond to Business Intake team questions / requests in order for them to set up billing related client/matter information.</li><li>Participate in the development of the Memo of Understanding (MOU) related to alternative fee arrangements, proformas, outlines what can and cannot be billed and provides details related to client’s electronic billing system requirements, etc.</li><li>Evaluate vendors to confirm compliance with clients’ OCG.</li><li>Ensure compliance with OCGs and manage list of words/phrases that cannot be used in time entry system and update software applications with word or phrase narrative restrictions.</li><li>Assist with the onboarding &amp; off-boarding of lateral partners &amp; clients; disseminate pertinent information downstream to appropriate teams. Effectively collaborate with other administrative areas and internal resources to meet deliverables.</li><li>Escalate issues/problems to Director of Revenue Cycle Operations that prevents or hinders the delivery of high-quality support to clients.</li><li>Conduct high-quality pre-review of monthly proformas for select clients and matters, as necessary.</li><li>Review billing processes for assigned clients as it relates to the revenue process, as necessary.</li><li>Work with Billing / eBilling on next steps and actions regarding invoice appeals and rejections.</li><li>Gather pertinent data for monthly and quarterly updates for internal and client reporting.</li><li>Collaborate with Client Development Department on tracking client development work, identifies dollar value of “free”/investment work.</li><li>Work with Collections to identify stale AR and evaluate likelihood of collections based on OCG compliance and relationship with client; identify if invoice should be chased down or written off based on a deep dive of the invoice details.</li><li>Work with Billings, Collections, and Cash Applications teams to research and determine the correct course of action for incoming unallocated payments.</li><li>Lead and/or participate in special projects related to the revenue cycle, as necessary.<br/><br/></li></ul>", "qualifications": {"required": "4-year degree required; MBA and/or other advanced degrees preferred.\n5+ years of experience in client billing, practice support, paralegal, or legal project management role.\nGood understanding of Law Firm client matter lifecycle processes, from matter inception through to billing.\nDemonstrated ability to manage client or matter billing assignments in a centralized, cohesive environment, with strong communication skills.\nProven success working as part of a high-performance team; cultivating a unified, “one team” mentality and approach, strong lines of communication and collaboration; and the highest levels of operational excellence.\nOutstanding interpersonal skills, the ability to lead through influence rather than control and to create consensus-based support for business strategies and decisions.\nDynamic energy level, an unquestioned work ethic, willingness to “roll up your sleeves,” and work closely with colleagues and team members.\nSuperior presentation, written, and verbal communication skills; the ability to interact credibly and diplomatically with all levels in an organization – tailoring communications effectively for different groups and stakeholders.\nSuperior business acumen and analytic capabilities, sound judgment.\nA strong background in financial technology, applications, systems, and solutions in the professional services industry; experience using e-billing, and other software for client billing strongly preferred. ", "preferred": "MBA and/or other advanced degrees preferred."}, "skills": ["Client Billing", "Practice Support", "Paralegal", "Legal Project Management", "Communication", "Teamwork", "Collaboration", "Client Service", "Innovation", "Financial Technology", "e-billing"], "postedDate": "6 days ago", "benefits": "Full-time employees receive benefits including: medical and dental coverage; life insurance; short-term and long-term disability insurance; pre-tax flexible spending account for certain medical and dependent care expenses; an employee assistance program; Paid Time Off; paid holidays; participation in a retirement plan program after meeting eligibility requirements; and more.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983347015"}