{"jobTitle": "Procurement Manager", "company": {"name": "DSJ Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $135,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Personal Care Product Manufacturing, Retail Health and Personal Care Products, and Pharmaceutical Manufacturing", "description": "<strong><u>About our Client</u></strong><p>Our client is a health and wellness company based in Los Angeles, dedicated to enhancing well-being through thoughtful self-care practices. As a dynamic startup in a growth phase, they have gained notable recognition from top media outlets and boast a strong brand identity and a network of influential advisors. They are on an exciting growth trajectory and offer ample opportunities for professional development.</p><p><br/></p><p><strong><u>Position Overview</u></strong></p><p>The Operations team is pivotal to our client's success, overseeing procurement, fulfillment, shipping, and strategic planning for all omnichannel operations. The Procurement Manager will handle all aspects of procurement and supply chain management, including contract manufacturing, and will help build and lead the procurement team. This role involves close collaboration with internal teams and external suppliers, reporting directly to the Director of Operations.</p><p>The ideal candidate should be analytical, detail-oriented, creative, well-organized, and an excellent communicator with a collaborative mindset.</p><p><br/></p><p><strong><u>Key Responsibilities</u></strong></p><ul><li>Oversee the complete procurement process with existing and new suppliers, including sourcing and purchasing.</li><li>Identify, assess, qualify, and onboard suppliers for current and future product and packaging needs.</li><li>Enhance and manage the supplier qualification processes and performance metrics.</li><li>Handle the end-to-end purchasing process for product and packaging suppliers.</li><li>Manage purchase orders, ensuring timely and complete fulfillment.</li><li>Develop key performance indicators, reports, and data analytics to monitor supplier performance and drive improvements.</li><li>Anticipate and address potential delays or issues, documenting and resolving them as necessary.</li><li>Coordinate with suppliers on product quality, testing, release, and shipping logistics.</li><li>Ensure accurate management of Certificates of Analysis (COAs), Material Safety Data Sheets (MSDS), and stability testing.</li><li>Integrate procurement, strategic sourcing, supply chain, and contract manufacturing skills in daily operations.</li><li>Conduct ad hoc analyses and support project management for various initiatives.</li><li>Recruit, train, and develop the procurement team over time.</li><li>Collaborate with internal teams such as Operations, Product, and Finance.</li><li>Build and maintain strong, accountable relationships with external suppliers.</li><li>Proactively monitor performance to identify and address issues early, and seek opportunities to enhance performance in terms of cost, quality, and accuracy.</li></ul><p><br/></p><p><strong><u>Required Qualifications</u></strong></p><ul><li>Bachelor’s Degree.</li><li>6+ years of experience in Supply Chain or Procurement roles, or 2-4 years in management consulting or a similar field.</li><li>Experience with consumer packaged goods (CPG) is highly advantageous.</li><li>Familiarity with startups, e-commerce, or supplements is a plus.</li><li>Strong analytical and problem-solving skills with proficiency in Excel.</li><li>Excellent communication and interpersonal abilities.</li><li>Effective multitasking, organizational, and results-driven approach.</li><li>Strong time management and prioritization capabilities.</li></ul><p><br/></p><p><strong><u>Compensation and Work Details</u></strong></p><ul><li>Anticipated base salary range: $100,000 - $135,000</li></ul><p><br/></p><p><strong><u>Benefits and Perks</u></strong></p><ul><li>Flexible paid time off, sick days, and wellness days.</li><li>Comprehensive medical, vision, and dental insurance.</li><li>401(k) plan with company matching.</li><li>Monthly fitness reimbursement.</li></ul>", "responsibilities": "Oversee the complete procurement process with existing and new suppliers, including sourcing and purchasing. Identify, assess, qualify, and onboard suppliers for current and future product and packaging needs. Enhance and manage the supplier qualification processes and performance metrics. Handle the end-to-end purchasing process for product and packaging suppliers. Manage purchase orders, ensuring timely and complete fulfillment. Develop key performance indicators, reports, and data analytics to monitor supplier performance and drive improvements. Anticipate and address potential delays or issues, documenting and resolving them as necessary. Coordinate with suppliers on product quality, testing, release, and shipping logistics. Ensure accurate management of Certificates of Analysis (COAs), Material Safety Data Sheets (MSDS), and stability testing. Integrate procurement, strategic sourcing, supply chain, and contract manufacturing skills in daily operations. Conduct ad hoc analyses and support project management for various initiatives. Recruit, train, and develop the procurement team over time. Collaborate with internal teams such as Operations, Product, and Finance. Build and maintain strong, accountable relationships with external suppliers. Proactively monitor performance to identify and address issues early, and seek opportunities to enhance performance in terms of cost, quality, and accuracy.", "qualifications": {"required": "Bachelor’s Degree. 6+ years of experience in Supply Chain or Procurement roles, or 2-4 years in management consulting or a similar field. Experience with consumer packaged goods (CPG) is highly advantageous. Familiarity with startups, e-commerce, or supplements is a plus. Strong analytical and problem-solving skills with proficiency in Excel. Excellent communication and interpersonal abilities. Effective multitasking, organizational, and results-driven approach. Strong time management and prioritization capabilities."}, "skills": ["Supply Chain", "Procurement", "Management Consulting", "Consumer Packaged Goods (CPG)", "Startups", "E-commerce", "Supplements", "Analytical Skills", "Problem Solving", "Excel", "Communication", "Interpersonal Skills", "Multitasking", "Organizational Skills", "Results-Driven", "Time Management", "Prioritization"], "postedDate": "3 weeks ago", "benefits": "Flexible paid time off, sick days, and wellness days. Comprehensive medical, vision, and dental insurance. 401(k) plan with company matching. Monthly fitness reimbursement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983362457"}