{"jobTitle": "Administrative Assistant", "company": {"name": "RemX - Accounting & Finance Staffing", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Provides advanced administrative support associated with office operations. Usually deals with complex and confidential departmental information. No instruction on routine work, general instructions on new projects.<br/><br/><strong>Essential Functions:<br/><br/></strong>Completes special projects/ad-hoc reports, including designing graphic presentations, as delegated by management.<br/><br/>Orchestrates and organizes project meetings, schedules and materials such as agendas, timelines, reports and presentations.<br/><br/>Takes minutes.<br/><br/>May perform desktop publishing.<br/><br/>Uses a variety of software to compose letters/prepares reports for executive/manager review.<br/><br/>Maintains confidential department files and records.<br/><br/>Maintains manager/executives’ calendar; arranges meetings, conferences and travel itineraries.<br/><br/>Screen’s telephone calls/visitors refer to appropriate staff member.<br/><br/>Interprets policies and procedures in response to inquiries.<br/><br/>May provide information to top level management, Board Members. etc.<br/><br/>Reviews/screens manager/executives mail, researches issues and provides recommendations.<br/><br/>May provide training/direction to other non-exempt personnel.<br/><br/><strong>Basic Qualifications:<br/><br/></strong><strong>Minimum Three (3) Years Of Secretarial/administrative Or Comparable Experience.<br/><br/></strong>2-year degree required; 4-year degree preferred.<br/><br/><strong>Additional Requirements:<br/><br/></strong><strong>Advanced Writing, Reading And Arithmetic Skills Required.<br/><br/></strong>Ability to respond to top level management inquiries and assemble highly confidential/sensitive information.<br/><br/>Strong customer service skills required to communicate effectively with all levels of management internal/external.<br/><br/>Initiative and analytical ability to research and prepare reports.<br/><br/>Proficient with software used by the department (i.e.: KP Payroll System, MS Word, Excel).<br/><br/>Proficiency in MS Word &amp; MS Excel must be demonstrated through testing.<br/><br/>Word processing speed: 40 wpm required.<br/><br/>Must be able to work in a Labor/Management Partnership environment.<br/><br/>RemX is the professional staffing division of Employbridge, America’s Leading Workforce Specialist. When our Talent is looking for their next opportunity, we know they are not just looking for their next paycheck. Our Recruiters are experts in their specialized fields and understand that making the right match between the candidate and the company, is the key to long term success. We offer a variety of staffing solutions, including: Temporary, temp-to-hire, direct hire Independent contract placements Executive search Managed staffing and outsourced workforce solutions", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3983998270"}