{"jobTitle": "Private Placement - Analyst", "company": {"name": "Guggenheim Partners", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "135,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Financial Services, Investment Banking, and Investment Management", "description": "<strong>Position Summary<br/><br/></strong>Guggenheim Investments is seeking a Private Placement analyst to join a high performing team. The Private Placement team is responsible for originating, underwriting, and monitoring private placement credit, equity, funds, and other illiquid transactions. This position is collaborative and cross-functional, but highly demanding and requires technical skills such as financial modeling and structuring. In addition to investment acumen, a successful candidate will have interpersonal skills facilitating collaboration with broker-dealers, portfolio managers, operations, and accounting. This position is for a Senior Associate and will be co-located with and reporting to the Head of Private Placements in Santa Monica, CA.<br/><br/><strong>Essential Job Functions<br/><br/><br/></strong><ul><li> Support review and execution of private placement new issue transactions with a focus on fundamental credit and relative value analysis</li><li> Provide support in secondary trading execution of private placement bonds and analysis related to market liquidity, pricing, and primary supply activity</li><li> Maintain and develop surveillance materials related to originations, market activity, performance monitoring, risk exposures, valuations, among other topics</li><li> Assist analysis and evaluation of transaction amendments and waivers by developing an understanding of covenants and transaction structures</li><li> Work with primary credit research analysts to monitor individual and sector credit positions</li><li> Work with senior team members to diligence private equity and alternative investment opportunities</li><li> Develop and maintain business relationships with sell-side counterparts including all sales, trading, and syndicate functions</li><li> Oversee monthly pricing process for private placement bond holdings in accordance to internal policies and procedures</li><li> Conduct and oversee ad hoc analysis to support PM, management, client, and desk-directed inquiries<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/><br/></strong><ul><li> CFA Level 2</li><li> Strong credit, finance, economic, business, analytical, and technical skills</li><li> Strong written and verbal communication skills, attention to detail, and problem-solving ability</li><li> Ability to multi-task across analytical, administrative, and research activities in a detail oriented and timely manner</li><li> Advanced Excel proficiency</li><li> Strong commitment to performance and accuracy of work product<br/><br/><br/></li></ul><strong>Basic Qualifications<br/><br/><br/></strong><ul><li> 4-5 years of experience in investment management or investment banking</li><li> MBA, CFA, or equivalent educational background<br/><br/><br/></li></ul><strong> Salary Details <br/><br/></strong>The annual base salary for this role is between $135,000-$150,000. The base salary range represents the low and high end of the anticipated base salary range for this position. Actual base salaries may vary depending on factors such as location and experience. The range listed reflects base salary only, and the total compensation package may include other components such as incentive compensation<br/><br/><strong>About Us<br/><br/></strong>Guggenheim Partners is a diversified financial services firm that delivers value to its clients through two primary businesses: #Guggenheim Investments, a premier global asset manager and investment advisor, and Guggenheim Securities, a leading investment banking and capital markets business. Guggenheim’s professionals are based in offices around the world, and our commitment is to deliver long-term results with excellence and integrity while advancing the strategic interests of our clients.<br/><br/>Guggenheim is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Learn more at GuggenheimPartners.com, and follow us on LinkedIn and Twitter @GuggenheimPtnrs.", "responsibilities": "Support review and execution of private placement new issue transactions with a focus on fundamental credit and relative value analysis\nProvide support in secondary trading execution of private placement bonds and analysis related to market liquidity, pricing, and primary supply activity\nMaintain and develop surveillance materials related to originations, market activity, performance monitoring, risk exposures, valuations, among other topics\nAssist analysis and evaluation of transaction amendments and waivers by developing an understanding of covenants and transaction structures\nWork with primary credit research analysts to monitor individual and sector credit positions\nWork with senior team members to diligence private equity and alternative investment opportunities\nDevelop and maintain business relationships with sell-side counterparts including all sales, trading, and syndicate functions\nOversee monthly pricing process for private placement bond holdings in accordance to internal policies and procedures\nConduct and oversee ad hoc analysis to support PM, management, client, and desk-directed inquiries", "qualifications": {"preferred": "CFA Level 2\nStrong credit, finance, economic, business, analytical, and technical skills\nStrong written and verbal communication skills, attention to detail, and problem-solving ability\nAbility to multi-task across analytical, administrative, and research activities in a detail oriented and timely manner\nAdvanced Excel proficiency\nStrong commitment to performance and accuracy of work product", "required": "4-5 years of experience in investment management or investment banking\nMBA, CFA, or equivalent educational background"}, "skills": ["Credit", "Finance", "Economics", "Business", "Analytical", "Technical", "Communication", "Problem Solving", "Multi-tasking", "Excel"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983538484"}