{"jobTitle": "Director Medical Staff Services", "company": {"name": "CommonSpirit Health", "industry": "Wellness and Fitness Services, Hospitals and Health Care, Medical Practices", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$49.09 - $71.19", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Wellness and Fitness Services, Hospitals and Health Care, Medical Practices", "description": "Founded in 1887 Dignity Health - California Hospital Medical Center is a 318-bed acute care nonprofit hospital located in downtown Los Angeles. The hospital offers a full complement of services including a Level II trauma center the Los Angeles Center for Womens Health obstetrics and pediatric services and comprehensive cardiac and surgical services. The hospital shares a legacy of humankindness with Dignity Health one of the nations five largest health care systems. Visit https://www.dignityhealth.org/socal/locations/californiahospital for more information. If you are committed to social justice, health equity, and prepared to deliver care in new, innovative ways, you belong with us.", "responsibilities": "As our Director of Medical Staff Services at California Hospital Medical Center, you will lead a team of Medical Staff Coordinators and ensure we meet all regulatory and hospital requirements related to credentialing and privileging of Medical Staff. Your strong knowledge in Joint Commission and other regulatory standards help us properly govern the Medical Staff. You will provide accurate and timely updates related to Medical Staff membership to our Executive Leadership Team. Every day you will oversee the operations of the Medical Staff Administration office. You will guide and oversee the MSO Coordinators, facilitate committee meetings, process applications, manage the financial activities, and provide reports to hospital leadership.", "qualifications": {"required": "Bachelor's degree in business administration or related health or management field preferred or ability to obtain within a period of time agreed upon by supervisor. Minimum of five (5) years of experience in a Medical Staff office, with at least one (1) year in a supervisory capacity, or a comparable combination of education and experience.", "preferred": "Certified Provider Credentialing Specialist (CPCS) achieved within one (1) year of employment."}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Annual Incentive (Bonus) Program, Matching Retirement Program, Pension fully funded by the Hospital, Tuition Assistance for career growth and development, Health/Dental/Vision Insurance, Free Membership to our Care@Work program supporting child care, pet care, and adult dependent needs, Employee Assistance Program (EAP) for you and your family, Flexible spending accounts, Voluntary Protection: Group Accident, Critical Illness, and Identity Theft, Wellness Program, Paid Time Off (PTO).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3983666553"}