{"jobTitle": "Retail Experience Manager, Devices and Services", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "132,000.00/yr - 196,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management, Consulting, and Engineering", "industry": "Information Services and Technology, Information and Internet", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor’s degree or equivalent practical experience.</li><li>8 years of experience with retail operations.</li><li>5 years of experience leading managers in retail.</li><li>Ability to travel up to 40% of the time.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience working with cross-functional teams, vendor partners, and external agencies.</li><li>Ability to build and manage large, dynamic teams in ambiguous environments.</li><li>Ability to cultivate effective relationships, influence, and collaborate across a wide range of audiences.</li><li>Ability to problem solve and effectively navigate a fast-paced, action-oriented environment while managing multiple projects and priorities.</li><li>Excellent communication skills, including planning, execution, and follow-up skills.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>As a Retail Experience Manager, you will use your expertise to create a radically helpful customer experience that brings the magic of Google to life. You will work with executive management and play an integral role in shaping and supporting business and operational strategy. You will work primarily with Retail Operations teams to ensure consistency, provide guidance, facilitate training, and offer support. You will inspire and coordinate with high-performing teams to execute on the in-person customer experience direction locally.<br/><br/>In this role, you will lead by example, guide and support a retail experience that will deliver an unparalleled customer experience. You are an excellent communicator with an ability to train and motivate a large team, and you take an investigative approach to understanding business and customer needs. Ultimately, you are passionate about building lasting connections with our users and introducing uniquely Google products and solutions to positively transform their lives.<br/><br/>Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices &amp; Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices &amp; Services team is making people's lives better through technology.<br/><br/>The US base salary range for this full-time position is $132,000-$196,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Oversee the day-to-day operations of a retail experience, including oversight of on-site vendors, events, reporting, inventory operations, merchandising compliance, etc. Be the expert in on-the-ground operational needs, assisting however needed.</li><li>Manage and report store performance and customer experience.</li><li>Evaluate, understand, and respond to customer feedback, striving to create the best customer experience that is uniquely Google.</li><li>Be the liaison between stakeholders (i.e., retail operations, retail marketing, public relations, etc.) and the Retail team, ensuring that ideas are developed and executed.</li><li>Conduct ongoing trainings on behalf of Google to include updating the teams on new products, upcoming programming, and using customer feedback to reinforce steps of service.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Oversee the day-to-day operations of a retail experience, including oversight of on-site vendors, events, reporting, inventory operations, merchandising compliance, etc. Be the expert in on-the-ground operational needs, assisting however needed.</li><li>Manage and report store performance and customer experience.</li><li>Evaluate, understand, and respond to customer feedback, striving to create the best customer experience that is uniquely Google.</li><li>Be the liaison between stakeholders (i.e., retail operations, retail marketing, public relations, etc.) and the Retail team, ensuring that ideas are developed and executed.</li><li>Conduct ongoing trainings on behalf of Google to include updating the teams on new products, upcoming programming, and using customer feedback to reinforce steps of service.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree or equivalent practical experience.\n8 years of experience with retail operations.\n5 years of experience leading managers in retail.\nAbility to travel up to 40% of the time.", "preferred": "Experience working with cross-functional teams, vendor partners, and external agencies.\nAbility to build and manage large, dynamic teams in ambiguous environments.\nAbility to cultivate effective relationships, influence, and collaborate across a wide range of audiences.\nAbility to problem solve and effectively navigate a fast-paced, action-oriented environment while managing multiple projects and priorities.\nExcellent communication skills, including planning, execution, and follow-up skills."}, "skills": [], "postedDate": "5 days ago", "url": "https://www.linkedin.com/jobs/view/3983346081"}