{"jobTitle": "HR Assistant", "company": {"name": "Panda Restaurant Group", "industry": "Restaurants", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Restaurants", "description": "The HR Customer Service Representative role is internally Panda's HR Shared Services Representative . This position works with our internal Panda employees regarding Human Resources questions and the position is responsible for problem identification, accurate documentation, and clear communication to Operations associates in resolving their inquiries on HR processes and programs. The Shared Services Representative also handles specialized assignments involving unemployment claims, leaves of absence, and other HR activities to ensure HR processes are carried out accurately and on a timely basis on behalf of Operations associates. This position also conducts training at regional Operations meetings on HR processes/benefits<br/><br/><strong>You’ll get a chance to:<br/><br/></strong><ul><li>Provide responses to Operations associates concerning a wide variety of HR practices and processes, such as benefits, hiring processes, and employment verification, on a timely and accurate basis. </li><li>Identify location with common questions and issues and attends regional Operations meetings to provide training on HR processes and company benefits, focusing on issues specific to the location. </li><li>Handle specialized assignments involving unemployment claims, leaves of absence, state-specific tax forms, and other activities as required to support Operations. </li><li>Ensure that appropriate documentation is prepared so that new hire transactions and existing employee changes can be processed. </li><li>Solicit input from Operations and other functions on how to improve HR processes using technology. <br/><br/><br/></li></ul><strong>How we reward you:<br/><br/></strong><ul><li>Hybrid Work schedule </li><li>401K with company match</li><li>Yearly bonus opportunity*</li><li>Full medical, dental, and vision insurance *</li><li>On-site fitness center, biometric screen, and flu shot clinic</li><li>Discounts at Panda restaurants, theme parks, and gym memberships</li><li>Paid time off starting at 15 days with 7 federal holidays*</li><li>Continuous education assistance and scholarships*</li><li>Income protection including Disability, Life and AD&amp;D insurance*</li><li>Bereavement leave*</li><li>Benefits available for eligible permanent full time associates<br/><br/><br/></li></ul>,<br/><br/><strong>Your background &amp; experience:<br/><br/></strong><ul><li>Bilingual in Spanish required.</li><li>Bachelor's degree required. </li><li>Minimum two years of experience, preferably in a retail/hospitality operations environment.</li><li>Successful completion of initial and periodically required trainings</li><li>Obtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position.</li><li>If hired, successful completion of annual store training<br/><br/><br/></li></ul><strong>Panda Strong since 1983<br/><br/></strong>Founded in Glendale, California, we are now the largest family-owned American Chinese Restaurant concept in America. With close to 2,000 locations globally, we continue our mission of delivering exceptional Asian dining experiences by building an organization where people are inspired to better their lives. Whether it’s impacting our team or the communities we work in, we’re proud to be an organization that embraces family values.<br/><br/><strong>You’re wanted here<br/><br/></strong>We value diversity in all forms and know the strength it brings. Workplace equality allows for creative ideas to blossom, diverse points of view to be heard, and improves overall happiness. We like the sound of that.<br/><br/><em>Panda Restaurant Group, Inc. is an Equal Opportunity Employer and prohibits discrimination and harassment on the basis of race, color, religion, sex, national origin, disability, age and any other basis protected by the laws which apply where we operate. Panda provides accommodations for disabilities and religious observance purposes as required by law.<br/><br/></em>", "postedDate": "5 days ago", "benefits": "Hybrid Work schedule , 401K with company match, Yearly bonus opportunity*, Full medical, dental, and vision insurance *, On-site fitness center, biometric screen, and flu shot clinic, Discounts at Panda restaurants, theme parks, and gym memberships, Paid time off starting at 15 days with 7 federal holidays*, Continuous education assistance and scholarships*, Income protection including Disability, Life and AD&amp;D insurance*, Bereavement leave*, Benefits available for eligible permanent full time associates", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983074569"}