{"jobTitle": "Sales Assistant - Entry Level", "company": {"name": "My Office Apps", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$18.00/hr - $22.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "<strong>Job Description<br/><br/></strong>We are seeking a dynamic and organized Sales Assistant and customer relationship skills to join our growing team. The ideal candidate will support our sales team in various aspects of sales process, from prospecting and lead generation, to assisting with sales related projects, and foster positive relationships with prospects and clients.<br/><br/>This entry-level position offers an excellent opportunity to gain hands-on experience in B2B sales, develop strong customer relationship skills, and learn the intricacies of our ERP solutions. With your hard work and dedication, you'll be well-positioned to grow into a Senior Sales Representative and Account Executive role, managing your own territory and building a successful client base.<br/><br/><strong>This is a 100% in-office position in Irvine.<br/><br/></strong><strong>Key Responsibilities:<br/><br/></strong><ul><li>Assist the sales team in managing leads, prospects, and customer accounts. </li><li>Coordinate and schedule meetings, calls, and product demos with potential clients. </li><li>Provide administrative support, including managing schedules, tracking sales activities, and maintaining up-to-date information in CRM systems. </li><li>Respond to inquiries and provide detailed information about our software products and services. </li><li>Manage projects related to sales activities, ensuring tasks are completed on time and within scope. </li><li>Support new business development activities by follow-up phone calls on sales leads, as required. </li><li>Gather and analyze customer feedback to identify opportunities for product and service improvements. </li><li>Collaborate with cross-functional teams, including development, support, and marketing, to ensure project objectives are met. </li><li>Ability to work independently as well as collaboratively in a team environment. </li><li>Additional professional development opportunities including shadowing, training and certification of key activities and skills across the sales process (discovery, demos, relationship engagement calls) to prepare strong performers for next steps as Account Execs or Account Managers</li><li>Casual work environment and great office location in Irvine<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Minimum 2-3 years of experience in a sales or customer service role. </li><li>College degree preferred. </li><li>Strong organizational and time-management skills, with the ability to handle multiple projects simultaneously. </li><li>Ability to prioritize tasks, manage multiple deadlines, and thrive in a fast-paced environment. </li><li>Excellent communication and interpersonal skills, with a customer-focused mindset. </li><li>Proficiency in Microsoft Office Suite. </li><li>Knowledge of CRM and software sales is a plus. </li><li>Sales/Administrative Support: 2 years (Required)</li><li>B2B Sales experience is a plus. </li><li>Spanish speaking and writing are a plus. <br/><br/></li></ul><em><strong>Benefits and amenities:<br/><br/></strong></em>Our office location offers a variety of amenities to help you stay well and enjoy your workplace.<br/><br/><ul><li>On-site Yoga Studio</li><li>Full-service Gym with Shower Facilities</li><li>Wellness Room</li><li>On-Site Café</li><li>Unwind and play a game of corn hole and enjoy the regulation-size Bocce ball court and putting green</li><li>Game Room &amp; Lounge</li><li>EV charging station on site</li><li>Paid time off</li><li>Health Insurance</li><li>Dental/Vision<br/><br/></li></ul>Join our dynamic team and be part of an innovative company that offers cutting-edge ERP SaaS solutions to businesses worldwide. As an entry-level Sales Assistant, you will have the opportunity to significantly impact our company's growth while gaining career development opportunities. Apply now and help shape the future of ERP software sales in the SaaS industry!<br/><br/>Pay: $18 to $22 per hour plus Commission and Bonus<br/><br/>Job Type: Full Time, M-F<br/><br/><strong>Company Description<br/><br/></strong>My Office Apps, Inc. (MOA) is a leader in business improvement software solutions to automate your organization. Building on three decades of software design and development, MOA delivers Kechie, a transformative business tool. Kechie is a fully integrated Enterprise Resource Planning Software with a Software as a Service (SaaS) platform that simplifies the user experience and has the latest in cloud technology.<br/><br/>My Office Apps, Inc. (MOA) is a leader in business improvement software solutions to automate your organization. Building on three decades of software design and development, MOA delivers Kechie, a transformative business tool. Kechie is a fully integrated Enterprise Resource Planning Software with a Software as a Service (SaaS) platform that simplifies the user experience and has the latest in cloud technology.", "responsibilities": "Assist the sales team in managing leads, prospects, and customer accounts. Coordinate and schedule meetings, calls, and product demos with potential clients. Provide administrative support, including managing schedules, tracking sales activities, and maintaining up-to-date information in CRM systems. Respond to inquiries and provide detailed information about our software products and services. Manage projects related to sales activities, ensuring tasks are completed on time and within scope. Support new business development activities by follow-up phone calls on sales leads, as required. Gather and analyze customer feedback to identify opportunities for product and service improvements. Collaborate with cross-functional teams, including development, support, and marketing, to ensure project objectives are met. Ability to work independently as well as collaboratively in a team environment. Additional professional development opportunities including shadowing, training and certification of key activities and skills across the sales process (discovery, demos, relationship engagement calls) to prepare strong performers for next steps as Account Execs or Account ManagersCasual work environment and great office location in Irvine", "qualifications": {"required": "Minimum 2-3 years of experience in a sales or customer service role. College degree preferred. Strong organizational and time-management skills, with the ability to handle multiple projects simultaneously. Ability to prioritize tasks, manage multiple deadlines, and thrive in a fast-paced environment. Excellent communication and interpersonal skills, with a customer-focused mindset. Proficiency in Microsoft Office Suite. Knowledge of CRM and software sales is a plus. Sales/Administrative Support: 2 years (Required)B2B Sales experience is a plus. Spanish speaking and writing are a plus.", "preferred": "College degree"}, "skills": ["CRM", "Sales", "Customer Service", "Microsoft Office Suite", "B2B Sales", "Spanish"], "postedDate": "4 weeks ago", "benefits": "On-site Yoga StudioFull-service Gym with Shower FacilitiesWellness RoomOn-Site CaféUnwind and play a game of corn hole and enjoy the regulation-size Bocce ball court and putting greenGame Room & LoungeEV charging station on sitePaid time offHealth InsuranceDental/Vision", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983996431"}