{"jobTitle": "Automotive Assistant Manager", "company": {"name": "Monro, Inc.", "industry": "Automotive", "size": "1,200+ employees", "location": "Lakewood, CA"}, "location": "Lakewood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$18.00 - $22.50", "currency": "USD"}, "jobFunction": "Sales", "industry": "Automotive", "description": "Monro, Inc. is one of the nation’s largest auto service companies and major tire retailer. We own and operate more than 1,200 stores in 32 states and our stock trades on the Nasdaq (MNRO). The Monro family of brands includes some the most recognizable names in the industry—Monro Auto Service and Tire Centers, Mr. Tire, Tire Choice, amongst many more regional chains. Our dominance is driven by teammates who strive to provide a five-star experience and deliver consistent value to our guests and shareholders. At Monro, we understand that a 5-star guest experience begins with a 5-star teammate experience. In fact, we’re currently investing more than $100 million in store improvements, new technology, and career development through our own Monro University training platform. Destination Monro – Your Career is Here! Do you have what it takes to shape a better future for yourself and the automotive service industry? Our vision is to be America’s leading auto and tire centers, trusted by consumers as the best place in our neighborhoods for quality automotive maintenance and repairs. We’re looking for motivated individuals at every stage in their career who share our vision. Positions are available in our retail locations across our many brands, in field management, and in store operations at our Store Support Center in Rochester, New York. If you like helping others, as much as you like working on cars; if you enjoy being part of a team, solving problems, and building guest relationships; if you value honesty and integrity - we have a Destination for you at Monro. Contact us to learn more. Destination Monro! – Your career is here.", "responsibilities": "Collaborate with Store Manager on operations of the store and decisions of hiring, training, coaching, disciplining, and terminating employees. Support automotive technicians in establishing and maintaining productive sales environment by training and developing teammates on all shop operations and guest services. Assist with scheduling employees, completing timecards, and assigning work to Lube and Tire technicians. Performs duties of automotive technician when needed. Attends meetings and clinics to maintain current knowledge of tools, parts, and repairs.", "qualifications": {"required": "High school or GED equivalent. 2+ years of automotive and sales experience. Valid Driver License. Ability to work with hands overhead, stand for long periods and lift 50 lbs. Excellent communication skills and basic algebra to calculate figures and amounts such as discounts, interest, commissions proportions, and percentages. Guest and team focused mindset.", "preferred": "Automotive State Inspector License. ASE Automotive Certifications. Proven Automotive or Automotive Quick Lube sales experience. Leadership experience."}, "skills": ["Automotive Service", "Sales Management", "Customer Service", "Team Leadership", "Problem Solving"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "Performance based incentives, Paid vacation and holidays for Full-Time Teammates, Reimbursement for ASE Certifications, Reimbursement for State Inspection Licenses, where applicable, 401k eligibility immediately upon hire, Direct Deposit, Employee Discounts, Healthcare, Vision, and Dental for Full time teammates, Employee Access Perks, Career Advancement Opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983971160"}