{"jobTitle": "On-site Sales Executive - Los Angeles", "company": {"name": "Indie Campers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "<strong>ABOUT US<br/><br/></strong>Indie Campers, the go-to campervan Marketplace, is on a mission of making road trips available to everyone. Thanks to its digital approach and customer-centric orientation, Indie Campers has developed a strong booking experience and high-quality road trips at affordable prices.<br/><br/>With over one million nights rented through our travel platform, we have welcomed more than 300,000 travelers from 169 countries. We offer a comprehensive and expanding array of road trip possibilities: short-term RV rentals, long-term campervan subscriptions, and the possibility of buying one of our vehicles available for sale.<br/><br/>Rooted in a deep technological focus, our challenges are both exciting and demanding and require top talent and motivation to be successfully pursued. We are growing our team and looking for those interested in pursuing this dream with us and joining an ever-developing journey.<br/><br/><strong>THE ROLE<br/><br/></strong>Indie Campers is seeking a dedicated and dynamic RV Sales Onsite Sales Executive to join our team. This role is critical in managing the entire sales process for our used recreational vehicles (RVs) onsite. The successful candidate will be the lead person for RV Sales located in our Los Angeles location responsible for qualifying leads, conducting customer demos, preparing vehicles for sale, and handling vehicle handovers post-purchase. The role requires a combination of sales capabilities, operational efficiency, and a customer-driven mindset.<br/><br/><strong>WHAT WILL YOU WORK ON?<br/><br/></strong><ul><li>Develop and implement local sales strategies to meet sales targets.</li><li>Manage inbound leads and drive them through the commercial funnel to generate sales.</li><li>Prepare vehicles for sale in coordination with depot colleagues and the fleet analyst, including coordination of MOT, repairs, vehicle condition audits, photographs, and cleaning.</li><li>Conduct customer demos and handle vehicle handovers to customers post-purchase.</li><li>Build and maintain local partnerships for vehicle photos, refurbishment, condition reports, etc.</li><li>Organize and hold local sales events (e.g., open days at the depot).</li><li>Coordinate with teams at HQ to ensure proper alignment of priorities and quality execution. Maintain accurate records of sales activities and performance metrics.<br/><br/></li></ul><strong>WHO ARE WE LOOKING FOR?<br/><br/></strong><ul><li>Technical degree in sales and/or Bachelor's degree in Sales, Marketing, Business, or a related field.</li><li>Experience in auto sales, RV sales, or other sales roles is highly desirable.</li><li>1-10 years of experience in sales, preferably in RV sales and/or auto sales at a dealership.</li><li>Fluency in English.</li><li>Strong understanding of RV products and sales capabilities is a strong plus.</li><li>Proficiency in handling administrative requirements related to the sale of leased vehicles/RVs (document handling, lease termination, etc.) is nice to have.</li><li>Humble and proactive attitude with a \"builder\" mindset.</li><li>Knowledge of consumer financing is nice to have.</li><li>Excellent communication and collaboration skills.</li><li>Ability to travel up to 10% of the time.</li><li>Customer-driven with a focus on high standards.</li><li>Strong organizational skills and attention to detail.</li><li>Ability to work independently and as part of a team.</li><li>Strong problem-solving skills and adaptability.<br/><br/></li></ul><strong>THE INDIE COMMITMENT!<br/><br/></strong><ul><li>A dynamic position in a young, fast-growing and innovative company.</li><li>Continuous training and coaching to develop the skills that matter to you.</li><li>Free roadtrips European-wide (subject to availability).<br/><br/></li></ul><strong>Are you ready to Go Indie?</strong>", "responsibilities": "Develop and implement local sales strategies to meet sales targets. Manage inbound leads and drive them through the commercial funnel to generate sales. Prepare vehicles for sale in coordination with depot colleagues and the fleet analyst, including coordination of MOT, repairs, vehicle condition audits, photographs, and cleaning. Conduct customer demos and handle vehicle handovers to customers post-purchase. Build and maintain local partnerships for vehicle photos, refurbishment, condition reports, etc. Organize and hold local sales events (e.g., open days at the depot). Coordinate with teams at HQ to ensure proper alignment of priorities and quality execution. Maintain accurate records of sales activities and performance metrics.", "qualifications": {"required": "Technical degree in sales and/or Bachelor's degree in Sales, Marketing, Business, or a related field. Experience in auto sales, RV sales, or other sales roles is highly desirable. 1-10 years of experience in sales, preferably in RV sales and/or auto sales at a dealership. Fluency in English. Strong understanding of RV products and sales capabilities is a strong plus. Proficiency in handling administrative requirements related to the sale of leased vehicles/RVs (document handling, lease termination, etc.) is nice to have. Humble and proactive attitude with a \"builder\" mindset. Knowledge of consumer financing is nice to have. Excellent communication and collaboration skills. Ability to travel up to 10% of the time. Customer-driven with a focus on high standards. Strong organizational skills and attention to detail. Ability to work independently and as part of a team. Strong problem-solving skills and adaptability."}, "skills": ["Sales", "RV Sales", "Auto Sales", "Customer Service", "Communication", "Collaboration", "Problem Solving", "Organization", "Adaptability"], "postedDate": "1 month ago", "benefits": "A dynamic position in a young, fast-growing and innovative company. Continuous training and coaching to develop the skills that matter to you. Free roadtrips European-wide (subject to availability).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983565701"}