{"jobTitle": "Senior Designer", "company": {"name": "MONO", "location": "Greater Minneapolis-St. Paul Area"}, "location": "Greater Minneapolis-St. Paul Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Advertising", "industry": "Advertising Services", "description": "<strong>About Us </strong><p>MONO is an advertising and branding agency formed to create magnetic brands that draw people in. We aim to create legendary work that works for our clients and provide a working environment that is optimistic, collaborative, and team-based. We are a values-driven company, supporting people personally and professionally.</p><p><br/></p><p><strong>Overview </strong></p><p>We are looking for a Senior Designer who is a problem-solver, conceptual thinker and imaginative storyteller with a strong design background and sensibility. We're looking for people who view design, not as an application, but as a means for solving complex problems. </p><p><br/></p><p><strong>Responsibilities </strong></p><p>Due to our cross-disciplined, collaborative, and fast-paced work environment, the ability (and desire) to work with a team and push your thinking beyond the traditional graphic design landscape is required. You’re not just a designer, you're a Senior Creative, with the ability to work across multiple projects independently with minimal oversight. In addition to design craft, you need to showcase a strong ability to collaborate with art directors and copywriters on a conceptual level. Important to your growth as a senior-level Creative, this role will include opportunities to provide mentorship to Creatives on the team who have less experience. </p><p><br/></p><p><strong>Required Skills </strong></p><p>Candidates should have a design degree (BFA or BA) and 4+ years of experience in an agency, design firm, or studio setting. The candidate should be capable of creating and producing innovative, award-winning work across mediums; an integrated thinker who thrives in a media-agnostic world (digital, video, print, experiential). Finally, the ability to sell ideas (both internally and to clients) through a confident, engaging, carefully considered presentation is required.</p><p><br/></p><p><strong>Qualifications </strong></p><p>This is a locally-based role, where relocation will be required for candidates living outside of the Minneapolis/St. Paul area. We currently observe a hybrid work model. We work onsite every Tuesday and Wednesday for Work From MONO (WFM) days, in addition to moments that matter outside of those designated days, with the purpose of fostering agency connection and aiding collaboration. Some travel may be required.</p><p><br/></p><p><strong>Benefits </strong></p><p>Our company offers flexible paid time off, medical, dental, vision and well-being benefits, HSA, FSAs, pre-tax commuter benefits, 401k with match, and upgraded parental leave policies. MONO is a dynamic design-driven advertising and branding agency that uniquely blends strategy and design to create and elevate brands and businesses in meaningful ways that connect with consumers. We are a values-driven company, supporting people personally and professionally.</p><p><br/></p><p><strong>Equal Opportunities</strong></p><p>MONO is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, and other protected status as required by law.</p><p></p>", "responsibilities": "Due to our cross-disciplined, collaborative, and fast-paced work environment, the ability (and desire) to work with a team and push your thinking beyond the traditional graphic design landscape is required. You’re not just a designer, you're a Senior Creative, with the ability to work across multiple projects independently with minimal oversight. In addition to design craft, you need to showcase a strong ability to collaborate with art directors and copywriters on a conceptual level. Important to your growth as a senior-level Creative, this role will include opportunities to provide mentorship to Creatives on the team who have less experience.", "qualifications": {"required": "Candidates should have a design degree (BFA or BA) and 4+ years of experience in an agency, design firm, or studio setting. The candidate should be capable of creating and producing innovative, award-winning work across mediums; an integrated thinker who thrives in a media-agnostic world (digital, video, print, experiential). Finally, the ability to sell ideas (both internally and to clients) through a confident, engaging, carefully considered presentation is required.", "preferred": "This is a locally-based role, where relocation will be required for candidates living outside of the Minneapolis/St. Paul area. We currently observe a hybrid work model. We work onsite every Tuesday and Wednesday for Work From MONO (WFM) days, in addition to moments that matter outside of those designated days, with the purpose of fostering agency connection and aiding collaboration. Some travel may be required."}, "skills": ["Design", "Art Direction", "Copywriting", "Digital Design", "Video Production", "Print Design", "Experiential Design", "Presentation Skills"], "postedDate": "4 weeks ago", "benefits": "Our company offers flexible paid time off, medical, dental, vision and well-being benefits, HSA, FSAs, pre-tax commuter benefits, 401k with match, and upgraded parental leave policies.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983097808"}