{"jobTitle": "Employee Relations Partner", "company": {"name": "Google", "location": "Chicago, IL"}, "location": "Chicago, IL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "105,000.00/yr - 154,000.00/yr", "currency": "USD"}, "jobFunction": "General Business and Administrative", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>Mountain View, CA, USA; Atlanta, GA, USA; Ann Arbor, MI, USA; Austin, TX, USA; Chicago, IL, USA; Los Angeles, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Washington D.C., DC, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>4 years of experience in employee relations/investigations, gained in either an HRBP role, Employee Relations Advisory role, or equivalent experience as an employment attorney practicing employment law.</li><li>Experience in conflict resolution and client/stakeholder management. <br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience advising on a wide range of employee relations issues, including reorganizations and performance issues.</li><li>Experience conducting workplace concern intakes or investigations.</li><li>Experience with stakeholder management in a global organization.</li><li>Ability to operate with empathy, and diffuse/de-escalate challenging conversations/situations.</li><li>Excellent investigation interview techniques and communication, analytical, and writing skills.<br/><br/></li></ul><strong>About the job</strong>As an Employee Relations Partner in the Workplace Concerns Practice Area you will rely on your expertise in applicable employment law and best practices to interpret and apply Google policy to provide consultative services to aid in the resolution of workplace concerns. You will be responsible for conducting thorough intakes with Googlers with care and empathy while keeping there experience and an intersectional lens in mind, identifying the policies implicated, engaging the appropriate partners, gathering the information necessary and ensuring a timely resolution. You may also have the opportunity to support investigations of harassment, discrimination, and retaliation.Great just isn't good enough for our People Operations team (known elsewhere as \"Human Resources\"). We bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next Googler, refining our core programs, developing talent, or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field. You’ll play an essential role advancing a more diverse, accessible, equitable, and inclusive Google through our hiring, promotion, retention, and inclusion practices.<br/><br/>The US base salary range for this full-time position is $105,000-$154,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provide one-on-one and group mentoring and development feedback to managers around how to manage employee relations issues, conduct investigations concerning allegations of inappropriate conduct in violation of Google policy, and evaluate, correct, and enhance job performance and other workplace behaviors.</li><li>Provide guidance on policies and processes to ensure compliance with regulations, and consistent application of practices and leverage metrics to identify employee relations trends and diagnose organizational effectiveness.</li><li>Apply employee relations expertise and employment law to successfully identify issues, risks, trends, gaps, and challenges, execute solution-focused strategies and processes to mitigate risks.</li><li>Work with partner groups, including employment, legal, other investigations teams, Employee Engagement, People Consultants and People Partners, and more to ensure a positive and effective employee experience.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Provide one-on-one and group mentoring and development feedback to managers around how to manage employee relations issues, conduct investigations concerning allegations of inappropriate conduct in violation of Google policy, and evaluate, correct, and enhance job performance and other workplace behaviors.</li><li>Provide guidance on policies and processes to ensure compliance with regulations, and consistent application of practices and leverage metrics to identify employee relations trends and diagnose organizational effectiveness.</li><li>Apply employee relations expertise and employment law to successfully identify issues, risks, trends, gaps, and challenges, execute solution-focused strategies and processes to mitigate risks.</li><li>Work with partner groups, including employment, legal, other investigations teams, Employee Engagement, People Consultants and People Partners, and more to ensure a positive and effective employee experience.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n4 years of experience in employee relations/investigations, gained in either an HRBP role, Employee Relations Advisory role, or equivalent experience as an employment attorney practicing employment law.\nExperience in conflict resolution and client/stakeholder management.", "preferred": "Experience advising on a wide range of employee relations issues, including reorganizations and performance issues.\nExperience conducting workplace concern intakes or investigations.\nExperience with stakeholder management in a global organization.\nAbility to operate with empathy, and diffuse/de-escalate challenging conversations/situations.\nExcellent investigation interview techniques and communication, analytical, and writing skills."}, "skills": [], "postedDate": "1 week ago", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983492255"}