{"jobTitle": "Research Scientist (L5)  - Content & Media ML Foundations", "company": {"name": "Netflix", "location": "Los Gatos, CA", "industry": "Entertainment Providers"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00/yr - 720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Location: Los Angeles, Los Gatos, or Remote Netflix is revolutionizing the entertainment industry with world-class technology. We serve 270+ million members across 190+ countries, delivering great movies &amp; TV shows every month in 30+ languages. To meet our members’ entertainment needs, Netflix has invested in scaled Content Production &amp; Promotion workflows. With assistance from creative supervision and member feedback data, we have built tools &amp; processes that use technologies like Computer Vision, Graphics, Machine Learning &amp; Generative Algorithms to enable our creators to tell the best version of the story they want while allowing our studio to scale further. The Content &amp; Media ML Foundations team, within Data Science and Engineering, is responsible for foundational R&amp;D initiatives shaping the future of content production and promotion at a global scale. Using rich multi-modal data (text, video, audio, images), we build ML models and capabilities (such as customized generative algorithms and multi-modal embeddings enabling unique content understanding), that are high leverage and unlock impact across Netflix. We are looking for an experienced ML Scientist to join the team. Responsibilities:<br/><br/><ul><li>Build ML models that push state-of-the-art either using Netflix’s unique multimodal dataset or algorithmic innovations or both.</li><li>Design and implement state-of-the-art machine learning models for visual, audio and textual data to enhance content understanding and improve content production and promotion processes.</li><li>Collaborate with cross-functional teams, including product managers, engineers and data scientists, to define problem statements, define roadmaps and execute on priorities. </li><li>Communicate complex concepts and the results of analyses with both technical and non-technical stakeholders to influence strategic decisions.</li><li>Stay abreast of the latest developments in the field by attending conferences, reading research papers and implementing promising novel ideas that can impact Studio workflows.</li><li>Engage with the ML community, internal and external, to learn, to teach, to contribute to building a great Netflix brand in ML.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>You have a strong foundation in machine learning and deep learning, including embedding methods, supervised and unsupervised learning, and deep learning architectures.</li><li>Advanced degree (MS or PhD) in Computer Science, Electrical Engineering, or a related technical field with a focus on machine learning, artificial intelligence or computer vision.</li><li>Strong programming skills in Python and experience with ML/DL frameworks such as Tensorflow, Keras or PyTorch.</li><li>You have a strong track record of solving complex problems with innovative solutions. You are able to both develop novel algorithms and to adapt existing methods from the literature to new challenges.</li><li>You are an excellent communicator, capable of explaining complex technical details to both technical and non-technical audiences.</li><li>You are collaborative and thrive in fast-paced dynamic environments, contributing positively to the team and company culture.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Build ML models that push state-of-the-art either using Netflix’s unique multimodal dataset or algorithmic innovations or both.\nDesign and implement state-of-the-art machine learning models for visual, audio and textual data to enhance content understanding and improve content production and promotion processes.\nCollaborate with cross-functional teams, including product managers, engineers and data scientists, to define problem statements, define roadmaps and execute on priorities. \nCommunicate complex concepts and the results of analyses with both technical and non-technical stakeholders to influence strategic decisions.\nStay abreast of the latest developments in the field by attending conferences, reading research papers and implementing promising novel ideas that can impact Studio workflows.\nEngage with the ML community, internal and external, to learn, to teach, to contribute to building a great Netflix brand in ML.", "qualifications": {"required": "You have a strong foundation in machine learning and deep learning, including embedding methods, supervised and unsupervised learning, and deep learning architectures.\nAdvanced degree (MS or PhD) in Computer Science, Electrical Engineering, or a related technical field with a focus on machine learning, artificial intelligence or computer vision.\nStrong programming skills in Python and experience with ML/DL frameworks such as Tensorflow, Keras or PyTorch.\nYou have a strong track record of solving complex problems with innovative solutions. You are able to both develop novel algorithms and to adapt existing methods from the literature to new challenges.\nYou are an excellent communicator, capable of explaining complex technical details to both technical and non-technical audiences.\nYou are collaborative and thrive in fast-paced dynamic environments, contributing positively to the team and company culture."}, "skills": ["Machine Learning", "Deep Learning", "Computer Vision", "Python", "Tensorflow", "Keras", "PyTorch"], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983494703"}