{"jobTitle": "Director of Nursing", "company": {"name": "Benevolence Health Centers", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><ul><li>Works directly with the Chief Operating Officer and Chief Medical Officer to manage the daily operations of the Clinics</li><li>Develops and implements tactical work plans to support the goals and objectives of the Clinics</li><li>Participates in QI and Risk Management Committees and maintains the QI/QA and Risk Management</li><li>Access and identify potential risks that may hinder safety and security of staff, patients, volunteers and visitors. Implement risk management processes and procedures. </li><li>Analyzes patient flow problems and assists in instituting corrective</li><li>Regularly interfaces with providers, managers and staff to assist to facilitate communication and improvement</li><li>Assists as directed with the development and implementation of policies and procedures. </li><li>Provides direction and support for clinical leads in order to achieve the clinical goals and objectives in the organization's comprehensive health care</li><li>Manages the activities of the day by staff, patients, students, and providers to assure a smooth, efficient patient flow through the</li><li>Works with the Chief Operating Officer to assure that the medical equipment, and</li><li>sup plies that the providers require is readily available at the time it is needed, and in emergencies, including medications, lab processing and notification of emergency medical services when</li><li>Oversees and controls stock drugs, vaccines and clinical inventory at all locations, Monitoring stock for expiration</li><li>Works with clinical lead in each department/site to accurately monitor all clinical logs for accuracy and</li><li>Ensures that all sites have accurately completed and sent in monthly reports, i.e., hand hygiene, infection control and equipment check</li><li>Coordinates and prepares clinical staff for potential weather-related disasters. i.e., secure vaccines and store with maximum refrigeration back</li><li>Coordinates with Clinical Lead at each site to assure clinical support competencies. </li><li>Coordinates clinical staff education with outreach worker, hospice, case managers, hospitals, staff development leader, and other health care</li></ul>", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3983998557"}