{"jobTitle": "Director, Influencer & Affiliate Marketing", "company": {"name": "24 Seven Talent", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000/year - 140,000/year", "currency": "USD"}, "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job title: Director, Influencer & Affiliate Marketing<br/><br/>Contract type:<br/><br/>Location: Irvine<br/><br/>Discipline:<br/><br/>Remote: Yes<br/><br/>Salary: $100,000/year - 140,000/year<br/><br/>Reference: 474154<br/><br/>Contact name: Christina Turner<br/><br/><strong>Job description</strong> Position: Director, Influencer & Affiliate Marketing<br/><br/>Beauty/Wellness<br/><br/>100% remote<br/><br/>What you’ll do:<br/><br/>Influencer Partnerships:<br/><br/><br/><ul><li> Develop and execute strategic campaigns and partnerships with content creators and influencers to amplify brand awareness and reach. </li><li> Monitor influencer content to ensure compliance with brand voice and guidelines and edit and proofread influencer materials and content before the post date. </li><li> Build and maintain relationships with influencers, managers, and agents Identify and evaluate potential influencers and emerging trends on various social media platforms, including YouTube, Instagram, TikTok, Twitter, and Facebook, to maximize opportunities for collaboration. </li><li> Manage affiliate program. </li><li> Successfully manage affiliate relationships and grow them. </li><li> End-to-end project management, including developing the strategy, partnering with internal and external stakeholders, developing assets, tracking and reporting results, and ongoing optimization. <br/><br/><br/></li></ul>Data-Driven Decision Making:<br/><br/><br/><ul><li> Utilize data and insights to assess the success of influencer partnerships and campaigns, making data-driven decisions for future initiatives and optimizations. </li><li> Track and analyze key performance metrics, such as engagement rates and conversions, to evaluate the effectiveness of influencer-generated content. <br/><br/><br/></li></ul>Social Media Content Management:<br/><br/><br/><ul><li> Collaborate with the Social Media Coordinator to ensure timely execution of content plans and alignment with brand guidelines. </li><li> Provide guidance, mentorship, and support to the Social Media Coordinator, overseeing their day-to-day activities, performance, and professional development. </li><li> Foster a collaborative and positive team culture, encouraging creativity, innovation, and continuous learning. Pinpoint new media opportunities by actively keeping a pulse on emerging influencers and trends through various social media channels such as YouTube, Instagram, TikTok, Twitter, and Facebook. <br/><br/><br/></li></ul>Influencer Collaboration:<br/><br/><br/><ul><li> Serve as the main point of contact for influencer partners, managing all aspects of collaboration, including negotiation, contracts, content approvals, and performance tracking. </li><li> Collaborate with internal Marketing, Creative, and PR teams to align influencer activities with broader marketing campaigns and brand initiatives. </li><li> Establish and maintain regular communication between the brand and influencer partners and actively source and negotiate new influencer partnerships. <br/><br/><br/></li></ul>The ideal candidate has:<br/><br/><br/><ul><li> 5+ years of dedicated experience in influencer and/or affiliate performance marketing. </li><li> Experience managing a small team of 2-3 influencer managers with varying duties In-depth knowledge and tactical experience in social media and influencer marketing. </li><li> Proven experience in direct influencer communication across all social platforms. </li><li> Highly analytical with strong proficiency in Excel and Google Docs. </li><li> Strong negotiation skills and industry knowledge of performance-based influencer marketing. Innovative mindset with a drive to find effective ways to engage and excite influencers, focusing on scaling the program. </li><li> Excellent written communication skills. </li><li> Eagerness to learn and grow within the company. </li><li> Passion for social media, the digital space, and the health & wellness industry. </li><li> Collaborative partner with a positive, solution-oriented attitude. </li><li> Bachelor's degree in business, marketing, or a related field from an accredited university. 2-3+ years of experience in DTC marketing management; experience with beauty products is a significant plus. </li><li> Proven track record of leading successful Influencer Marketing strategies. </li><li> Experience planning and executing comprehensive marketing strategies, digital advertising campaigns, and PR efforts. </li><li> Competitive analysis experience. </li><li> Demonstrated ability to work effectively in a remote capacity. <br/><br/><br/></li></ul>Bonus Experience:<br/><br/>Familiarity with Shopify app store offerings and CRM systems like Infusionsoft, Marketo, or Eloqua.<br/><br/>Experience with live chat applications and design/UIUX tools like Photoshop or InDesign.<br/><br/>Knowledge of eCommerce shipping and logistics processes. Understanding of SEO/SEM/PPC strategies, including Facebook Ads, Google AdWords, and Amazon advertising.<br/><br/>Previous project management or copywriting experience.", "responsibilities": "Develop and execute strategic campaigns and partnerships with content creators and influencers to amplify brand awareness and reach. Monitor influencer content to ensure compliance with brand voice and guidelines and edit and proofread influencer materials and content before the post date. Build and maintain relationships with influencers, managers, and agents Identify and evaluate potential influencers and emerging trends on various social media platforms, including YouTube, Instagram, TikTok, Twitter, and Facebook, to maximize opportunities for collaboration. Manage affiliate program. Successfully manage affiliate relationships and grow them. End-to-end project management, including developing the strategy, partnering with internal and external stakeholders, developing assets, tracking and reporting results, and ongoing optimization. Utilize data and insights to assess the success of influencer partnerships and campaigns, making data-driven decisions for future initiatives and optimizations. Track and analyze key performance metrics, such as engagement rates and conversions, to evaluate the effectiveness of influencer-generated content. Collaborate with the Social Media Coordinator to ensure timely execution of content plans and alignment with brand guidelines. Provide guidance, mentorship, and support to the Social Media Coordinator, overseeing their day-to-day activities, performance, and professional development. Foster a collaborative and positive team culture, encouraging creativity, innovation, and continuous learning. Pinpoint new media opportunities by actively keeping a pulse on emerging influencers and trends through various social media channels such as YouTube, Instagram, TikTok, Twitter, and Facebook. Serve as the main point of contact for influencer partners, managing all aspects of collaboration, including negotiation, contracts, content approvals, and performance tracking. Collaborate with internal Marketing, Creative, and PR teams to align influencer activities with broader marketing campaigns and brand initiatives. Establish and maintain regular communication between the brand and influencer partners and actively source and negotiate new influencer partnerships.", "qualifications": {"required": "5+ years of dedicated experience in influencer and/or affiliate performance marketing. Experience managing a small team of 2-3 influencer managers with varying duties In-depth knowledge and tactical experience in social media and influencer marketing. Proven experience in direct influencer communication across all social platforms. Highly analytical with strong proficiency in Excel and Google Docs. Strong negotiation skills and industry knowledge of performance-based influencer marketing. Innovative mindset with a drive to find effective ways to engage and excite influencers, focusing on scaling the program. Excellent written communication skills. Eagerness to learn and grow within the company. Passion for social media, the digital space, and the health & wellness industry. Collaborative partner with a positive, solution-oriented attitude. Bachelor's degree in business, marketing, or a related field from an accredited university. 2-3+ years of experience in DTC marketing management; experience with beauty products is a significant plus. Proven track record of leading successful Influencer Marketing strategies. Experience planning and executing comprehensive marketing strategies, digital advertising campaigns, and PR efforts. Competitive analysis experience. Demonstrated ability to work effectively in a remote capacity.", "preferred": "Familiarity with Shopify app store offerings and CRM systems like Infusionsoft, Marketo, or Eloqua. Experience with live chat applications and design/UIUX tools like Photoshop or InDesign. Knowledge of eCommerce shipping and logistics processes. Understanding of SEO/SEM/PPC strategies, including Facebook Ads, Google AdWords, and Amazon advertising. Previous project management or copywriting experience."}, "skills": ["Influencer Marketing", "Affiliate Marketing", "Social Media Marketing", "Digital Marketing", "Project Management", "Data Analysis", "Excel", "Google Docs", "Negotiation", "Communication", "Team Management", "CRM", "Shopify", "Photoshop", "InDesign", "SEO", "SEM", "PPC", "Facebook Ads", "Google AdWords", "Amazon Advertising", "Copywriting"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984159947"}