{"jobTitle": "Operations Associate - Flex", "company": {"name": "SEPHORA", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.70 - 26.58/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Job ID:</strong> 252336<br/><br/><strong>Store Name/Number:</strong> CA-Del Amo (0948)<br/><br/><strong>Address:</strong> 3525 W Carson St Unit #406, Torrance, CA 90503, United States (US)<br/><br/><strong>Hourly/Salaried:</strong> Hourly (Non-Exempt)<br/><br/><strong>Full Time/Part Time:</strong> Flex<br/><br/><strong>Position Type:</strong> Regular<br/><br/><strong>Your role at Sephora:</strong> As an Operations Associate, you'll thrive in a dynamic, fast-paced environment. This role is about ensuring a smooth operation that enhances the shopping experience for every client. You'll be part of a dedicated team that values your unique skills. If you love the operational side of retail, this is the perfect role for you.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Ensuring Accurate Order Fulfillment: Ensure orders are accurately fulfilled and excellent service is provided during pickup.</li><li>Maintaining Inventory: Help maintain a well-stocked store for our clients.</li><li>Store Maintenance: Contribute to a clean, smoothly operating store.</li><li>Supporting Sales and Promotional Events: Participate in setup and execution of sales events and promotions.</li><li>Loss Prevention: Participate in efforts to maintain a safe and secure shopping environment.<br/><br/></li></ul><strong>Qualifications/Experience<br/><br/></strong><ul><li>Prior work experience, preferably in operations.</li><li>Passion for client service and teamwork.</li><li>Strong communication skills and ability to multitask.</li><li>Resilience and adaptability to changing store priorities.</li><li>Flexible availability to work during “peak” retail hours.</li><li>Consistent and reliable attendance.</li><li>Ability to lift and carry up to 50 pounds.<br/><br/></li></ul><strong>While at Sephora, you’ll enjoy.<br/><br/></strong><strong>Diversity, Inclusion &amp; Belonging</strong> We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored.<br/><br/><strong>Meaningful Rewards</strong> Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; Details about our company benefits can be found at the following link: Click Here<br/><br/>$21.70 - $26.58/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location.<br/><br/>Sephora now offers a Flex (on demand) position for employees who can work anywhere from 0-19 hours a week. This flexibility allows you to balance your work schedule with other commitments. This could be a steppingstone into a more permanent position if you are looking for more in the future.<br/><br/>Sephora is an equal opportunity employer; and values a diverse and inclusive workplace. All persons will receive consideration for employment without regard to sex, pregnancy, race, color, national origin, gender (including gender identity and gender expression), age, religion, sexual orientation, military/veteran status, disability, or any other legally protected status. Sephora is committed to providing reasonable accommodation in our recruiting processes to applicants with disabilities or other medical conditions.<br/><br/>Sephora will consider for employment all qualified applicants, including those with a criminal history, in a manner consistent with the requirements of all applicable federal, state, and local laws, including the Los Angeles Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York City Fair Chance Act.<br/><br/><ul><li>This job will be posted for a minimum of 5 business days.</li></ul>", "responsibilities": "<ul><li>Ensuring Accurate Order Fulfillment: Ensure orders are accurately fulfilled and excellent service is provided during pickup.</li><li>Maintaining Inventory: Help maintain a well-stocked store for our clients.</li><li>Store Maintenance: Contribute to a clean, smoothly operating store.</li><li>Supporting Sales and Promotional Events: Participate in setup and execution of sales events and promotions.</li><li>Loss Prevention: Participate in efforts to maintain a safe and secure shopping environment.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Prior work experience, preferably in operations.</li><li>Passion for client service and teamwork.</li><li>Strong communication skills and ability to multitask.</li><li>Resilience and adaptability to changing store priorities.</li><li>Flexible availability to work during “peak” retail hours.</li><li>Consistent and reliable attendance.</li><li>Ability to lift and carry up to 50 pounds.<br/><br/></li></ul>"}, "skills": [], "postedDate": "4 weeks ago", "benefits": "Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; Details about our company benefits can be found at the following link: Click Here", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984390911"}