{"jobTitle": "Brand Designer, Brand Design", "company": {"name": "Amazon", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "The Brand Design team is seeking a passionate, customer-obsessed, and experienced Designer who demonstrates a strong understanding of design systems and how to apply strategic design thinking across multiple marketing channels including digital platforms, social, broadcast, print, and out of home channels. They are a design thinker, motivated to develop the best solution for every challenge, regardless of scope, length or budget, and readily dive deep to understand the objectives of their business partners. They have experience working on brand/identity systems and seasonal campaigns, and are seasoned at preparing and professionally presenting their work to a variety of stakeholders. The ideal candidate highly values collaboration and is able to synthesize clear design solutions with a distinct bias for action while factoring in the implications of a global brand.<br/><br/>If you are passionate about creative innovation, customer-focused user experiences, and are excited to collaborate with a global team of talented designers and marketing managers to deliver exceptional brand systems, experiences, and campaigns seen by millions of customers world-wide, we are looking for you.<br/><br/><strong>About The Team<br/><br/></strong>The Brand Design team within XCM (Cross-Channel Marketing) guides Amazon's visual identity globally. We are the team responsible for setting the standard for brand expression through design mechanisms that support consistency and better brand standards across the company. We are also the team responsible for creating visual campaigns and style guides in support of seasonal retail events and our physical owned and operated channels. We collaborate regularly with cross-channel creatives and business stakeholders with the primary objective of creating bar-raising design solutions that express the core brand traits.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> 5+ years of design industry experience with an agency or in-house</li><li> Portfolio demonstrating understanding and development of brand guidelines</li><li> Portfolio demonstrating seasonal and/or brand campaigns that scale across multiple touch points</li><li> Strong grasp of the creative process; from ideation through implementation</li><li> Strong understanding of typography, design principles, and color</li><li> Understanding of production best practices for print and digital mediums</li><li> Familiarity with brand strategy and working from briefs</li><li> Exceptional attention to detail</li><li> Ability to share ideas and receive feedback from business partners and stakeholders through presentations and writing.</li><li> Experience presenting work to senior creative leadership and customers</li><li> Bachelor's degree in Design or equivalent professional experience</li><li> Proficiency in InDesign, Photoshop, Illustrator, Keynote, and Figma<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in photo art direction</li><li> Deep understanding of typography, design principles, trends and best practices across digital and print.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $108,400/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2710536", "jobFunction": "Art/Creative and Design", "industry": "Software Development", "postedDate": "1 week ago", "salary": {"amount": "108,400.00/year - 185,000.00/year", "currency": "USD"}, "skills": ["Design Systems", "Design Thinking", "Digital Platforms", "Social Media", "Broadcast", "Print", "Out of Home Channels", "Brand Identity Systems", "Seasonal Campaigns", "Presentations", "Collaboration", "Creative Innovation", "Customer-Focused User Experiences", "InDesign", "Photoshop", "Illustrator", "Keynote", "Figma", "Photo Art Direction", "Typography", "Design Principles", "Trends", "Best Practices", "Digital", "Print"], "url": "https://www.linkedin.com/jobs/view/3984138823"}