{"jobTitle": "Principal Specialist, Program Cost Controls", "company": {"name": "Raytheon", "location": "El Segundo, CA", "industry": "Defense and Space Manufacturing"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000 USD - 179,000 USD", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Defense and Space Manufacturing", "description": "At Raytheon, the foundation of everything we do is rooted in our values and a higher calling – to help our nation and allies defend freedoms and deter aggression. We bring the strength of more than 100 years of experience and renowned engineering expertise to meet the needs of today’s mission and stay ahead of tomorrow’s threat. Our team solves tough, meaningful problems that create a safer, more secure world.<br/><br/>Be a part of Raytheon Finance team, a World Class finance organization that leads by example and is favored and valued by our internal and external customers. Work for an organization that is noted for its teamwork within Finance and across functional boundaries. This position will support a critical AESA Radar Development Program that is the foundation for future growth on the APG-82 platform.<br/><br/>The responsibilities of this position include various weekly, monthly, quarterly and annual routines including the following: Earned Value reporting, Baseline Planning and Development, Estimates at Completion (EACs), risk and opportunity development, financial forecasting, Short Range Outlook (SRO), Annual Operation Plan (AOP) and Long Range Strategic Planning. The candidate will also have the opportunity to support various customer meetings, RFS level meetings and senior administrative level meetings. This position will have the opportunity to engage in proposal development within the development programs including review of Basis of Estimates (BOEs), chart preparation, cost volume development, personnel planning and contract negotiation preparation.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>This position will be the lead analyst supporting continued process improvement, reporting efficiencies and product quality. Results in this role will be dictated by one’s ability to meet critical deadlines while managing multiple conflicting priorities. </li><li>You will need to analyze and understand data quickly in order to make informed business decisions. </li><li>You will need to exhibit financial autonomy, possess high business acumen and exhibit robust analysis within the AESA Development programs portfolio. </li><li>You must be able to interpret and ensure implementation of Raytheon Financial Policies and Procedures to program personnel as part of their daily/weekly communications. </li><li>This position requires tactical thinking and developing positive relationships with our internal and external customers. <br/><br/></li></ul><strong>Qualifications You Must Have<br/><br/></strong><ul><li>Typically requires a University Degree or equivalent experience and minimum 5 years prior relevant experience, or An Advanced Degree in a related field and minimum 3 years experience. </li><li>Experience with Earned value analysis (SPI/CPI/TCPI/IEAC/VAR). </li><li>Experience in externally reported EVM programs (IPMR/IPMDAR, CFSR, DFARS clauses, DID formats, etc). </li><li>Experience in application of finance principles, concepts, practices, and standard knowledge of industry practices implementation. </li><li>Experience interfacing and conducting business with various functional disciplines (Contracts, Operations, Engineering, Supply Chain Management, etc.) in program development and. </li><li>Experience communicating financial concepts, trends and variances to management. </li><li>Prior experience in Defense or Aerospace. </li><li>U.S. Citizenship and ability to access to US only data systems and the ability to obtain a security clearance. <br/><br/></li></ul><strong>Qualifications We Prefer<br/><br/></strong><ul><li>Proactive, creative and innovative in solving problems and issues. </li><li>Ability to plan and manage daily tasks, meet deadlines, analyze, provide results and recommend solutions to various levels of management. </li><li>Excellent communication skills (written and oral). </li><li>Excellent personal computer skills including a high level of proficiency with MS Office products (Excel, Word and PowerPoint). </li><li>Experience with modeling, creating formulas, and complex data mining using MS Office Excel. </li><li>Experience with SAP APEX, BW and BPS. </li><li>Excellent critical thinking abilities. </li><li>Experience interfacing with customers external to Raytheon. </li><li>Shows initiative by seeking ways to improve processes and data analysis. </li><li>Ability to work under minimal supervision. </li><li>Participates in determining objectives of assignment plans, schedules and arranges own activities in accomplishing objectives after training period. </li><li>Ability to quickly learn our Business Systems. <br/><br/></li></ul><strong>What We Offer:<br/><br/></strong><ul><li>Our values strengthen our actions, behaviors, and performance with a vision for a safer, more connected world. At RTX we value: Trust, Respect, Accountability, Collaboration, and Innovation. </li><li>Whether you’re just starting out on your career journey or are an experienced professional, we offer a total rewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life benefits; career development and recognition programs. Some of the benefits we offer include parental (including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup care. <br/><br/></li></ul><strong>Learn More &amp; Apply Now!<br/><br/></strong><ul><li>RTX solves some of the toughest challenges in aerospace and defense. That requires expansive thinking and bold innovation – and that, in turn, requires a culture that is diverse, equitable and inclusive. We embrace individuality and diversity of thought to fuel opportunity for our employees, our customers, and our communities. We work toward progress, knowing that a more inclusive world is critical to our mission. Not just in this moment, but always. <br/><br/></li></ul>The salary range for this role is 85,000 USD - 179,000 USD. The salary range provided is a good faith estimate representative of all experience levels. RTX considers several factors when extending an offer, including but not limited to, the role, function and associated responsibilities, a candidate’s work experience, location, education/training, and key skills.<br/><br/>Hired applicants may be eligible for benefits, including but not limited to, medical, dental, vision, life insurance, short-term disability, long-term disability, 401(k) match, flexible spending accounts, flexible work schedules, employee assistance program, Employee Scholar Program, parental leave, paid time off, and holidays. Specific benefits are dependent upon the specific business unit as well as whether or not the position is covered by a collective-bargaining agreement.<br/><br/>Hired applicants may be eligible for annual short-term and/or long-term incentive compensation programs depending on the level of the position and whether or not it is covered by a collective-bargaining agreement. Payments under these annual programs are not guaranteed and are dependent upon a variety of factors including, but not limited to, individual performance, business unit performance, and/or the company’s performance.<br/><br/>This role is a U.S.-based role. If the successful candidate resides in a U.S. territory, the appropriate pay structure and benefits will apply.<br/><br/>RTX anticipates the application window closing approximately 40 days from the date the notice was posted. However, factors such as candidate flow and business necessity may require RTX to shorten or extend the application window.<br/><br/><strong><em>RTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.<br/><br/></em></strong><strong>Privacy Policy and Terms:<br/><br/></strong>Click on this link to read the Policy and Terms", "responsibilities": "The responsibilities of this position include various weekly, monthly, quarterly and annual routines including the following: Earned Value reporting, Baseline Planning and Development, Estimates at Completion (EACs), risk and opportunity development, financial forecasting, Short Range Outlook (SRO), Annual Operation Plan (AOP) and Long Range Strategic Planning. The candidate will also have the opportunity to support various customer meetings, RFS level meetings and senior administrative level meetings. This position will have the opportunity to engage in proposal development within the development programs including review of Basis of Estimates (BOEs), chart preparation, cost volume development, personnel planning and contract negotiation preparation.", "qualifications": {"required": "Typically requires a University Degree or equivalent experience and minimum 5 years prior relevant experience, or An Advanced Degree in a related field and minimum 3 years experience. \nExperience with Earned value analysis (SPI/CPI/TCPI/IEAC/VAR). \nExperience in externally reported EVM programs (IPMR/IPMDAR, CFSR, DFARS clauses, DID formats, etc). \nExperience in application of finance principles, concepts, practices, and standard knowledge of industry practices implementation. \nExperience interfacing and conducting business with various functional disciplines (Contracts, Operations, Engineering, Supply Chain Management, etc.) in program development and. \nExperience communicating financial concepts, trends and variances to management. \nPrior experience in Defense or Aerospace. \nU.S. Citizenship and ability to access to US only data systems and the ability to obtain a security clearance. ", "preferred": "Proactive, creative and innovative in solving problems and issues. \nAbility to plan and manage daily tasks, meet deadlines, analyze, provide results and recommend solutions to various levels of management. \nExcellent communication skills (written and oral). \nExcellent personal computer skills including a high level of proficiency with MS Office products (Excel, Word and PowerPoint). \nExperience with modeling, creating formulas, and complex data mining using MS Office Excel. \nExperience with SAP APEX, BW and BPS. \nExcellent critical thinking abilities. \nExperience interfacing with customers external to Raytheon. \nShows initiative by seeking ways to improve processes and data analysis. \nAbility to work under minimal supervision. \nParticipates in determining objectives of assignment plans, schedules and arranges own activities in accomplishing objectives after training period. \nAbility to quickly learn our Business Systems. "}, "skills": ["Earned Value Analysis", "EVM", "Financial Forecasting", "Financial Analysis", "Risk Management", "Proposal Development", "MS Office", "Excel", "PowerPoint", "SAP", "APEX", "BW", "BPS", "Communication", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Our values strengthen our actions, behaviors, and performance with a vision for a safer, more connected world. At RTX we value: Trust, Respect, Accountability, Collaboration, and Innovation. \nWhether you’re just starting out on your career journey or are an experienced professional, we offer a total rewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life benefits; career development and recognition programs. Some of the benefits we offer include parental (including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup care. ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984252154"}