{"jobTitle": "2025 Business Analyst Intern", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Please note the following eligibility requirements to apply for this role:<br/><br/><ul><li> Graduate from Bachelor's degree program between 12/2025 and 6/2026.</li><li> Ability to relocate nationwide. Relocation assistance provided, if eligible.</li><li> Ability to complete 12-week internship between May – August 2025.</li><li> We are unable to offer visa sponsorship for this role.<br/><br/></li></ul>For more information, please visit https://amazonundergradstudent.splashthat.com.<br/><br/>As you launch your career as a business analyst at Amazon, you will focus on improving the success within a business function by analyzing data, discovering and solving real world problems, and building metrics and business cases to improve the customer's experience. We are focused on your success and want to build future leaders within Amazon.<br/><br/>A key component of the role is to identify process and system improvement opportunities by monitoring existent metrics, analyzing data and collaborating with internal teams. In addition, design and develop automated reporting solutions to enable stakeholders to manage the business and make effective decisions. Lastly, enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format. Internship roles are available nationwide: Corporate offices and fulfillment centers.<br/><br/>Preferred applicants are majoring in business, computer, data engineering, economics, finance, engineering, mathematics, machine learning, science, statistics, and symbolic systems. In addition, basic to advanced knowledge of TABLEAU/Power Query, intermediate (e.g., vlookup) / advanced Excel skills (e.g., Write/edit VBA), and a basic to advanced knowledge of SQL (all join types, group by, order by, calculated columns).<br/><br/>To learn more, watch \"Day in the Life: Business Analyst\": https://register.gotowebinar.com/recording/953167065495375705<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Are 18 years of age or older</li><li> Work 40 hours/week throughout the course of a 12-week summer internship between May through September</li><li> Knowledge of SQL</li><li> Currently enrolled in a bachelor’s degree program with a graduation conferral date between December 2025 and June 2026<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Basic to advanced knowledge of TABLEAU/Power Query, intermediate (e.g., vlookup) / advanced Excel skills (e.g., Write/edit VBA), and a basic to advanced knowledge of SQL (all join types, group by, order by, calculated columns)</li><li> Preferred majors are business, computer, data engineering, economics, finance, engineering, mathematics, machine learning, science, statistics, and symbolic systems</li><li> Strong academic, leadership, and/or extracurricular record</li><li> Effective interpersonal, written, and oral communication with a keen focus on delivering business results</li><li> Demonstrated track record in using data and metrics to make decisions and build scalable solutions</li><li> Ability to influence across all levels of an organization</li><li> Ability to act strategically and make decisions under ambiguity</li><li> Strong organizational and time management skills<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $24.13/hr in our lowest geographic market up to $51.63/hr in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2712814", "jobFunction": "Strategy/Planning, Analyst, and Information Technology", "industry": "Software Development", "postedDate": "5 days ago", "skills": ["SQL", "TABLEAU", "Power Query", "Excel", "VBA"], "benefits": "Relocation assistance provided, if eligible.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984972364"}