{"jobTitle": "Shipping Clerk", "company": {"name": "Shimano", "industry": "Truck Transportation", "size": "51-200 employees", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Distribution and Supply Chain", "industry": "Truck Transportation", "description": "Distribution Center (DC)\n\nShimano North America Holding, Inc. is a global company that offers the world's sporting community top labels and brands, including Shimano, G. Loomis, Power Pro, and Lazer Sports.\n\nWe are seeking a Shipping Clerk to join our team!! At Shimano, we welcome your talent, innovation, and enthusiasm.\n\nWe offer an exceptional array of employee benefits and incentives and are proud to support our employees' health and happiness. We offer paid time off, medical, dental, vision, employer-matching 401k, wellness incentives, a fully equipped onsite gym, rideshare program, and much more.\n\nJob Summary\n\nThe Shipping Clerk verifies and keeps records on incoming and outgoing shipments and prepares items for shipment.", "responsibilities": "Use shipping software and automation equipment.\nStack products on pallets correctly.\nPrepare, match, and verify shipping information and manifest accurately.\nAssist with stretch wrapping, loading trucks, and all other tasks directed by Supervisor.\nAdhere to customer shipping guidelines and the preparation of shipping information and manifest.\nAdhere to strict Shimano's 5S Principles.", "qualifications": {"required": "High school diploma or GED equivalent", "preferred": "Experience working in a warehouse/distribution center preferred."}, "skills": ["Good verbal and written communication skills", "Excellent attention to detail", "Ability to work and multitask in a fast-paced warehouse environment focusing on customer satisfaction", "Ability to work under pressure and within time constraints is required.", "Must be able to stretch wrap product on pallets properly.", "Ability to use shipping software and automation equipment and perform a task in accordance with Shimano's standard operating procedures and customer guidelines."], "postedDate": "4 weeks ago", "applicationDeadline": "Not specified", "benefits": "Paid time off, medical, dental, vision, employer-matching 401k, wellness incentives, a fully equipped onsite gym, rideshare program, and much more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3984918192"}