{"jobTitle": "Bookkeeper Assistant - Account Payable & Receivable", "company": {"name": "Innovative Metrics", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing", "industry": "Internet Publishing", "description": "Innovative Metrics, a successful innovative online technology company since 2005, is looking for a bookkeeper assistant. As a bookkeeper assistant, you will provide crucial support to our account management team in all areas of accounting. Working mainlyon accounts payable and receivable duties, you will be responsible for invoicing, checking figures, and creating financial spreadsheets.<br/><br/><strong>Job Duties:<br/><br/></strong><ul><li>Preparework to be accomplished by gathering and sorting documents and related information</li><li>Payinvoices by verifying transaction information, scheduling, preparing disbursements, and obtaining authorization of payment</li><li>Assist in managing client accounts, including creating invoices, processing and postingpayments, follow up on any outstanding invoices and maintaining accurate records. </li><li>Draftcorrespondence for standard past-due accounts and collections, identifydelinquent accounts by reviewing AR and contact accountholders for payments</li><li>Prepares financial reports by collecting, analyzing, and summarizing account information and trends</li><li>Maintains accounting ledgers by posting account transactions</li><li>Verifies accounts by reconciling statements and transactions</li><li>Resolves account discrepancies by investigating documentation and issuing stop payments and adjustments</li><li>Maintains financial security by following internal accounting controls</li><li>Perform other related accounting duties as assigned<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>A minimum of 2 years of accounting experience</li><li>Prefer knowledge of Accounts Receivable and Payables</li><li>Great attention to detail</li><li>Strong customer service skills</li><li>Excellent negotiation skills</li><li>Proficiency in MS Office and Quickbooks<br/><br/></li></ul>Powered by JazzHR<br/><br/>8FQDEMwv2E", "responsibilities": "Preparework to be accomplished by gathering and sorting documents and related informationPayinvoices by verifying transaction information, scheduling, preparing disbursements, and obtaining authorization of paymentAssist in managing client accounts, including creating invoices, processing and postingpayments, follow up on any outstanding invoices and maintaining accurate records. Draftcorrespondence for standard past-due accounts and collections, identifydelinquent accounts by reviewing AR and contact accountholders for paymentsPrepares financial reports by collecting, analyzing, and summarizing account information and trendsMaintains accounting ledgers by posting account transactionsVerifies accounts by reconciling statements and transactionsResolves account discrepancies by investigating documentation and issuing stop payments and adjustmentsMaintains financial security by following internal accounting controlsPerform other related accounting duties as assigned", "qualifications": {"required": "A minimum of 2 years of accounting experiencePrefer knowledge of Accounts Receivable and PayablesGreat attention to detailStrong customer service skillsExcellent negotiation skillsProficiency in MS Office and Quickbooks"}, "skills": ["Accounts Payable", "Accounts Receivable", "Quickbooks", "MS Office"], "postedDate": "4 weeks ago", "url": "https://www.linkedin.com/jobs/view/3984278055"}