{"jobTitle": "BH Care Manager, Health Plan, Licensed in CA, Remote", "company": {"name": "Magellan Health", "industry": "Hospitals and Health Care", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "This is a remote position and candidates must be licensed in California.<br/><br/>If candidate resides outside of CA, you must be licensed in CA and the State of residence.<br/><br/>This position is responsible for the assessment, reassessment, care planning and coordination of care and services including ongoing monitoring of an appropriate and effective person-centered care plan, member education and care management. Conducts initial and concurrent review for prior authorization of higher levels of care against medical necessity criteria. Responsible for the development of individualized care plans for high and moderate stratified members in the Medicaid, Medicare, and Whole Health markets. Possesses clinical knowledge, understands best practices and continuous learning skills, reviews member records, and works in conjunction with primary care, community benefits, and other support opportunities to develop a long term care plan to guide the member through their mental health care. Oversees the work of its assigned care support team and work with non-licensed support staff to meet standards of care and performance set by Member Market Leads and the Care Management Center of Operational Excellence (CoOE) Lead.<br/><br/><ul><li>Accountable for all Care Management activities for assigned high and moderate members with behavioral health conditions identified and assessed as requiring intensive interventions and oversight including multiple clinical, social, and community resources.</li><li>Provides telephone triage, crisis intervention and prior authorizations as assigned for select members stratified as high and moderate member need.</li><li>Conducts in depth health risk assessment and/or comprehensive needs assessment including, but not limited to, psycho-social, physical, medical, behavioral, environmental, and financial parameters.</li><li>Develops, documents, implements, and communicates the patient-centered care plan, which provides appropriate resources to address social, physical, mental, emotional, spiritual and supportive needs.</li><li>Educates providers, supporting staff, members and families regarding care management role and health strategies with a focus on member-focused approach to care.</li><li>Serves as an accountable member of the care team to oversee appropriate rendering of services (e.g., during transitions in care or transition to home care, back up plans, community-based services).</li><li>Oversees and effectively manages work assigned and conducted by assigned care support team</li><li>Implements, coordinates, and monitors strategies for members and families to improve health and quality of life outcomes.</li><li>Acts as an advocate for members' care needs by identifying and addressing gaps in care.</li><li>Performs ongoing monitoring of members' care plan and measures the effectiveness of interventions as identified; develops plans that strive to meet Magellan developed KPIs in accordance with the CM CoOE Lead and Member Market Leads.</li><li>Assesses and reviews plan of care regularly to identify gaps in care, trends to improve health and quality of life outcomes.</li><li>Works with members and the interdisciplinary care plan team to adjust plan of care as necessary.</li><li>Facilitates a team approach, including all participants of the Interdisciplinary Care Plan team, Health Plan Medical Care Management where appropriate, to ensure appropriate interventions, cost effective delivery of quality care and services across the continuum.<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><strong>Other Job Requirements<br/><br/></strong>Licensure is required for this position, specifically a current license that meets State, Commonwealth or customer-specific requirements.<br/><br/>One or more of the following licenses is required for this role with necessary degree: LMSW, LCSW, LMFT, LPC, or RN.<br/><br/>Minimum 5 years’ experience post degree in healthcare, behavioral health, psychiatric and/or substance abuse health care setting.<br/><br/>Strong organization, time management and communication skills.<br/><br/>Ability to manage and oversee activities of assigned care support teams.<br/><br/>Experience with Care Management workflows.<br/><br/>Knowledge of utilization management procedures, mental health and substance abuse community resources and providers.<br/><br/>Knowledge of and experience in inpatient and/or outpatient setting.<br/><br/>Knowledge of DSM-5 or most current diagnostic edition.<br/><br/>Ability to analyze specific utilization problems, plan and implement solutions that directly influence quality of care.<br/><br/>Understanding of plan benefit structures, psychiatric/medical terminology, call center terminology and operations.<br/><br/>Strong written and verbal communication skills.<br/><br/><strong><strong>General Job Information<br/><br/></strong></strong><strong>Title<br/><br/></strong>BH Care Manager, Health Plan, Licensed in CA, Remote<br/><br/><strong>Grade<br/><br/></strong>25<br/><br/><strong>Work Experience - Required<br/><br/></strong>Behavioral Health, Healthcare<br/><br/><strong>Work Experience - Preferred<br/><br/></strong><strong>Education - Required<br/><br/></strong>Bachelor's - Nursing, Master's - Counseling, Master's - Social Work<br/><br/><strong>Education - Preferred<br/><br/></strong><strong>License and Certifications - Required<br/><br/></strong>LCSW - Licensed Clinical Social Worker - Care Mgmt, LMFT - Licensed Marital and Family Therapist - Care Mgmt, LMSW - Licensed Master Social Worker - Care Mgmt, LPC - Licensed Professional Counselor - Care Mgmt, RN - Registered Nurse, State and/or Compact State Licensure - Care Mgmt<br/><br/><strong>License And Certifications - Preferred<br/><br/></strong><strong>Salary Range<br/><br/></strong><strong>Salary Minimum<br/><br/></strong>$64,285<br/><br/><strong>Salary Maximum<br/><br/></strong>$102,855<br/><br/><em>This information reflects the anticipated base salary range for this position based on current national data. Minimums and maximums may vary based on location. Actual pay will be adjusted based on an individual's skills, experience, education, and other job-related factors permitted by law.<br/><br/></em><em>This position may be eligible for short-term incentives as well as a comprehensive benefits package. Magellan offers a broad range of health, life, voluntary and other benefits and perks that enhance your physical, mental, emotional and financial wellbeing.<br/><br/></em>Magellan Health, Inc. is proud to be an Equal Opportunity Employer and a Tobacco-free workplace. EOE/M/F/Vet/Disabled.<br/><br/>Every employee must understand, comply with and attest to the security responsibilities and security controls unique to their position; and comply with all applicable legal, regulatory, and contractual requirements and internal policies and procedures.", "responsibilities": "Accountable for all Care Management activities for assigned high and moderate members with behavioral health conditions identified and assessed as requiring intensive interventions and oversight including multiple clinical, social, and community resources.\nProvides telephone triage, crisis intervention and prior authorizations as assigned for select members stratified as high and moderate member need.\nConducts in depth health risk assessment and/or comprehensive needs assessment including, but not limited to, psycho-social, physical, medical, behavioral, environmental, and financial parameters.\nDevelops, documents, implements, and communicates the patient-centered care plan, which provides appropriate resources to address social, physical, mental, emotional, spiritual and supportive needs.\nEducates providers, supporting staff, members and families regarding care management role and health strategies with a focus on member-focused approach to care.\nServes as an accountable member of the care team to oversee appropriate rendering of services (e.g., during transitions in care or transition to home care, back up plans, community-based services).\nOversees and effectively manages work assigned and conducted by assigned care support team\nImplements, coordinates, and monitors strategies for members and families to improve health and quality of life outcomes.\nActs as an advocate for members' care needs by identifying and addressing gaps in care.\nPerforms ongoing monitoring of members' care plan and measures the effectiveness of interventions as identified; develops plans that strive to meet Magellan developed KPIs in accordance with the CM CoOE Lead and Member Market Leads.\nAssesses and reviews plan of care regularly to identify gaps in care, trends to improve health and quality of life outcomes.\nWorks with members and the interdisciplinary care plan team to adjust plan of care as necessary.\nFacilitates a team approach, including all participants of the Interdisciplinary Care Plan team, Health Plan Medical Care Management where appropriate, to ensure appropriate interventions, cost effective delivery of quality care and services across the continuum.", "qualifications": {"required": "Licensure is required for this position, specifically a current license that meets State, Commonwealth or customer-specific requirements.<br/><br/>One or more of the following licenses is required for this role with necessary degree: LMSW, LCSW, LMFT, LPC, or RN.<br/><br/>Minimum 5 years’ experience post degree in healthcare, behavioral health, psychiatric and/or substance abuse health care setting.<br/><br/>Strong organization, time management and communication skills.<br/><br/>Ability to manage and oversee activities of assigned care support teams.<br/><br/>Experience with Care Management workflows.<br/><br/>Knowledge of utilization management procedures, mental health and substance abuse community resources and providers.<br/><br/>Knowledge of and experience in inpatient and/or outpatient setting.<br/><br/>Knowledge of DSM-5 or most current diagnostic edition.<br/><br/>Ability to analyze specific utilization problems, plan and implement solutions that directly influence quality of care.<br/><br/>Understanding of plan benefit structures, psychiatric/medical terminology, call center terminology and operations.<br/><br/>Strong written and verbal communication skills.", "preferred": ""}, "skills": [], "postedDate": "4 weeks ago", "salary": {"amount": "64,285.00/yr - 102,855.00/yr", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984172130"}