{"jobTitle": "HR Generalist", "company": {"name": "Acrisure Protection Group", "industry": "Motor Vehicle Manufacturing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,000.00 - $70,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Motor Vehicle Manufacturing", "description": "Southwest Dealer Services: Acrisure Protection Group I KARR Security offers dealer clients the industry leading F&amp;I voluntary protection products, reinsurance/dealer participation programs, anti-theft programs and dealer-centric P&amp;C/worker comp offerings. The company boasts a national network of more than 3,000 active dealers across all 50 states. With driven focus for product innovation, compliance expertise and results-driven training, Acrisure has redefined how our dealer clients measure success and grow their bottom line. SWDS, an Acrisure agency partner, has a current need for a full-time Human Resources Generalist. This is an onsite, salaried exempt position reporting directly to the HR Director.", "responsibilities": "Listed responsibilities include but are not limited to: Oversee various day-to-day HR functions including onboarding, offboarding, training, employee relations, and employee engagement. Respond to internal and external HR related inquiries or requests. Administer employee benefits programs, including health, dental, vision, 401k and supplemental insurances. Assist HR Team with recruitment and onboarding process. Ensure compliance with federal, state, and local legal requirements by studying existing and new legislation, enforcing adherence to requirements, and advising management on needed actions. Maintain management guidelines by preparing, updating, and recommending Human Resource policies and procedures. Conduct and analyze exit interviews; recommend changes. Administers our benefit, leave, and workers compensation reporting. Assists with our semi-monthly payroll for 350+ employees.", "qualifications": {"required": "Bachelor’s degree in Human Resources, Business Administration, or a related field. At least 3+ years of experience in an HR Position. Excellent interpersonal and communication skills. Proficiency with HRIS systems, preferably Paycom. Strong understanding of State and Federal employment and payroll laws. Ability to handle sensitive information with discretion and confidentiality. Strong skills in MS Office (MS Excel and MS Word)", "preferred": "Not specified"}, "skills": ["Human Resources", "Employee Relations", "HRIS Systems", "Compliance", "Payroll Management"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Paid Vacation, Sick leave and Holidays, Medical, Dental &amp; Vision, other voluntary benefit options available, Company paid Benefits Life, AD&amp;D with Long Term Disability policy providing income protection, 401k Retirement Plan with company Match", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3984573985"}