{"jobTitle": "Exhibitions Maintenance Supervisor", "company": {"name": "Natural History Museum of Los Angeles County", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Museums, Historical Sites, and Zoos", "description": "The Natural History Museum of Los Angeles County was the first museum in L.A. to open its doors 111 years ago and is poised for an exciting new era as it plans for the future. Having recently completed a new strategic framework, the Natural History Museums of Los Angeles County—including NHMLA at Exposition Park, La Brea Tar Pits and Museum in mid-Wilshire, and the William S. Hart Museum in Newhall—is looking forward to new building projects and campaigns, exhibitions, community outreach, and innovative audience engagement.<br/><br/>The Natural History Museum of Los Angeles County values and endeavors to support diversity, equity, inclusion, and access within its organization and communities. Candidates who identify as Black, Indigenous, or a Person of Color (BIPOC), neurodiverse, gender, a person with a disability, a veteran, and/or a part of the LGBTQAI+ community are welcome and encouraged to apply.<br/><br/>The Natural History Museum of Los Angeles County is seeking an Exhibitions Maintenance Supervisor for our Exhibitions department. The Exhibitions Maintenance Supervisor works closely with the Technical Director to supervise technical maintenance projects for the Museum’s showcase exhibitions and experiences ranging from basic repair, fabrication, and digital/electronic component troubleshooting at the Natural History Museum of Los Angeles County. It is an exciting time as we embark on new journeys of becoming a museum of, for, and with L.A.<br/><br/>Responsibilities for this position include, but are not limited to:<br/><br/><ul><li>Team Management: Leads a team of technicians in regularly maintaining, repairing, testing, and assessing technology and exhibitry, including lighting, interactives, media, casework, graphics, and finishes, throughout all exhibitions, to ensure smooth daily operations throughout the Museum’s exhibitions and experiences.</li><li>Team Training and Schedule Development: Develops team schedules, conducts technical training, and develops and executes daily, weekly, monthly, and annual standard operating procedures (S.O.P.) for the Museums.</li><li>Weekend Supervisor: Is the on-site Exhibitions team lead on weekends, and serves as the department’s point of contact for technical and informational requests.</li><li>Budget Management: Manages and budgets for existing exhibition maintenance needs as required. </li><li>Documentation and Organization: Produces exhibition documentation and organizes related storage spaces and inventory.</li><li>Exhibition Development: Participates in a collaborative process of exhibition development with interdisciplinary teams -- including museum exhibitions staff, curators, registrars, collections staff and outside consultants.</li><li>Maintenance Project Coordination: Participates in the development, planning, and scheduling of exhibit maintenance projects. Coordinates with the appropriate departments within the Museum on the repair and installation of exhibit components.</li><li>Vendor Management: As needed, engages and oversees outside vendors on the maintenance and repair of exhibit components.<br/><br/></li></ul><strong>This Position Has The Following Requirements<br/><br/></strong><ul><li>Familiarity with exhibit development is highly desirable. Familiarity with exhibit fabrication techniques and tools desirable.</li><li>Demonstrated knowledge of project management and budgets with proven ability to execute design, fabrication and installation projects of wide scope and working with multiple participants, within schedule and cost parameters. Ability to manage a diverse team of professionals with varying backgrounds and skill sets to foster a successful team.</li><li>Proven experience in the production of all design documentation, technical design, understanding and execution.</li><li>Must be experienced with different production, construction and fabrication methods within exhibit and display fields. This experience should include, but not be limited to, methods and technical knowledge of metal work, millwork, mounts, lighting, multi-media and audio-visual production.</li><li>Must have experience operating and troubleshooting a variety of technologies used within exhibitions, including, but not limited to, audiovisual systems, lighting systems, electronics, and computer operating systems and software.</li><li>Must have experience with shop tools, stationary shop equipment and hand tools.</li><li>Ability to read blueprints and floor plans.</li><li>Has experience using a personal computer and with MS Office and its Word, Excel and Outlook functions (PC and/or Macintosh).</li><li>Has extensive experience with multimedia authoring software, programming environments, and workflows</li><li>Familiarity with project management software</li><li>Knowledge of CAD and collections database management software preferred.<br/><br/></li></ul>The Natural History Museum of Los Angeles County is especially interested in candidates whose background and experience have prepared them to contribute to our commitment to engagement and inclusion at culturally diverse audiences in museums and in sciences.<br/><br/>The Natural History Museum of Los Angeles County is seeking applicants who have demonstrated experience and commitment working with a diverse community. Salary range for this position is $68,309 - $73,450 based on experience plus excellent benefits. This is a full time- regular, exempt position.<br/><br/>A cover letter, current resume, and list of 3-4 references are required for all applicants. Review of applications begins immediately and continues until the position is filled. Interested candidates please visit www.nhmlac.org/careers-our-museums and click the link of the position for which you are interested or go directly to the online application.<br/><br/>The Natural History Museum of Los Angeles County is an Equal Opportunity Employer.", "responsibilities": "The Exhibitions Maintenance Supervisor works closely with the Technical Director to supervise technical maintenance projects for the Museum’s showcase exhibitions and experiences ranging from basic repair, fabrication, and digital/electronic component troubleshooting at the Natural History Museum of Los Angeles County. It is an exciting time as we embark on new journeys of becoming a museum of, for, and with L.A.<br/><br/>Responsibilities for this position include, but are not limited to:<br/><br/><ul><li>Team Management: Leads a team of technicians in regularly maintaining, repairing, testing, and assessing technology and exhibitry, including lighting, interactives, media, casework, graphics, and finishes, throughout all exhibitions, to ensure smooth daily operations throughout the Museum’s exhibitions and experiences.</li><li>Team Training and Schedule Development: Develops team schedules, conducts technical training, and develops and executes daily, weekly, monthly, and annual standard operating procedures (S.O.P.) for the Museums.</li><li>Weekend Supervisor: Is the on-site Exhibitions team lead on weekends, and serves as the department’s point of contact for technical and informational requests.</li><li>Budget Management: Manages and budgets for existing exhibition maintenance needs as required. </li><li>Documentation and Organization: Produces exhibition documentation and organizes related storage spaces and inventory.</li><li>Exhibition Development: Participates in a collaborative process of exhibition development with interdisciplinary teams -- including museum exhibitions staff, curators, registrars, collections staff and outside consultants.</li><li>Maintenance Project Coordination: Participates in the development, planning, and scheduling of exhibit maintenance projects. Coordinates with the appropriate departments within the Museum on the repair and installation of exhibit components.</li><li>Vendor Management: As needed, engages and oversees outside vendors on the maintenance and repair of exhibit components.<br/><br/></li></ul>", "qualifications": {"required": "Familiarity with exhibit development is highly desirable. Familiarity with exhibit fabrication techniques and tools desirable.<br/>Demonstrated knowledge of project management and budgets with proven ability to execute design, fabrication and installation projects of wide scope and working with multiple participants, within schedule and cost parameters. Ability to manage a diverse team of professionals with varying backgrounds and skill sets to foster a successful team.<br/>Proven experience in the production of all design documentation, technical design, understanding and execution.<br/>Must be experienced with different production, construction and fabrication methods within exhibit and display fields. This experience should include, but not be limited to, methods and technical knowledge of metal work, millwork, mounts, lighting, multi-media and audio-visual production.<br/>Must have experience operating and troubleshooting a variety of technologies used within exhibitions, including, but not limited to, audiovisual systems, lighting systems, electronics, and computer operating systems and software.<br/>Must have experience with shop tools, stationary shop equipment and hand tools.<br/>Ability to read blueprints and floor plans.<br/>Has experience using a personal computer and with MS Office and its Word, Excel and Outlook functions (PC and/or Macintosh).<br/>Has extensive experience with multimedia authoring software, programming environments, and workflows<br/>Familiarity with project management software<br/>Knowledge of CAD and collections database management software preferred.<br/><br/>", "preferred": ""}, "skills": ["Project Management", "Budget Management", "Team Management", "Technical Training", "Exhibition Development", "Multimedia Authoring", "CAD", "Collections Database Management", "MS Office", "Blueprints", "Shop Tools", "Audiovisual Systems", "Lighting Systems", "Electronics", "Computer Operating Systems", "Software"], "postedDate": "3 weeks ago", "salary": {"amount": "68,309 - 73,450", "currency": "USD"}, "benefits": "excellent benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984497305"}