{"jobTitle": "Sr. Procurement Specialist", "company": {"name": "Abbott", "location": "Temecula, CA"}, "location": "Temecula, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$72,700.00 - $145,300.00", "currency": "USD"}, "jobFunction": "Purchasing", "industry": "Hospitals and Health Care", "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals and branded generic medicines. Our 114,000 colleagues serve people in more than 160 countries.<br/><br/>Abbott Vascular provides innovative, minimally invasive and cost-effective products for treatment of vascular disease. Our extensive portfolio includes drug-eluting stents, bare metal stents, guide wires, balloon dilatation catheters, imaging catheters and software, vessel closure devices and peripheral stents<br/><br/>Our locations in Temecula CA, St. Paul MN or Westford MA currently has an opportunity for a Senior Procurement Specialist. (2 of 2 open positions)<br/><br/>What You’ll Do<br/><br/>Responsible for developing and/or implementing/executing the strategy for assigned categories. Work intimately with customers, divisions and sites, in alignment with the \"One Procurement\" model. Provide superior levels of customer service and satisfaction while adhering to a strict standard of business ethics and integrity<br/><br/>The Opportunity <br/><br/>The Sr. Specialist may have delegated authority to commit company funds as defined by applicable directives. This position will define and resolve known or anticipated problems in value, quality, feasibility and specifications in the procurement of goods and services while contributing cost savings, supplier partnerships and other value added activities to support customer needs and expectations. Proactively seek and lead innovative ways to improve the procurement processes, reduce risk, and elevate customer service. Considered a SME in their assigned category/ies. Strong understanding of \"One Procurement\" when developing and/or implementing category strategies and works on projects that impact the division/s in alliance with \"One Procurement\" and/or division goals. Is recognized as an expert within own area. Requires specialized depth and/or breadth of expertise. Act as a lead, coordinating work, and may lead teams.<br/><br/>What You’ll Work On<br/><br/><ul><li>Responsible for compliance with applicable Corporate and Divisional Policies and procedures.</li><li>Uses best procurement practices to develop assigned category strategy and manage implementation to reduce risk, manage cost and support business needs.</li><li>First line responder in influencing the implementation and alignment between strategy and Business Stakeholders/Partners.</li><li>Acts as a resource for colleagues with less experience. Align against larger category strategies and work with other strategic category leaders.</li><li>Researches, evaluates, and influences/decides selection of products, services and suppliers.</li><li>Performs value analysis on costs and supplier quotes.</li><li>Recommends process improvements to streamline for efficiencies. Analyzes complex problems and delivers solutions.</li><li>Provides inputs (e.g., non-transactional decisive negotiations) for PO conversion.</li><li>May manage PO approvals up to $1,000,000 in accordance with directives. Educate on existing solutions and enable performance and technical tools development.</li><li>Manage supplier issues in support of Business Stakeholders/Partners and may intervene in invoice error resolution.</li><li>Solves complex problems. Enable supplier integration and KPI's. Drive value and lead savings outcomes.</li><li>Collaborate with functions.</li><li>Develops bids and proposal formats. Lead complex RFPs, perform analyses of spend data, market data and supplier proposals, as well as lead small projects.</li><li>Provides advice/direction in primary areas of expertise to division/s.</li><li>Communicate and educate appropriate departments to provide appropriate supporting documentation for purchases.</li><li>Develop and leads division/s/sites in implementing purchasing strategies for assigned category.</li><li>Measures and track supplier performance, resolves conflicts, and uses supplier relationship management (SRM) to strengthen partnerships.</li><li>Seek, develop and establish business relationships with diverse suppliers.</li><li>Meet regularly with division customers and lead functions to ensure superior customer satisfaction and continuous improvement for efficiencies.</li><li>Responsible for performance management of all supportive personnel (non exempts)<br/><br/></li></ul>Position Accountability / Scope<br/><br/><ul><li>Includes the authority and responsibility for setting global supply chain strategies, at designated level, for assigned category; with resulting significant financial benefit for the business. </li><li>Executes against the goals set by Managers/Directors. </li><li>Drive innovative ways to maintain and improve procurement processes, cycle times, total acquisition costs, and customer service levels. </li><li>Key Organizational Relationships: other Category Leaders, Manager, Senior Manager, Functional Heads (e.g., head of IT, AQR, HR, Meeting Event Planners, Legal, Division Purchasing leadership, Division and Corp requisitions, Division Commercial and operations stakeholders, site leaders). </li><li>Provide strategy leadership by interfacing, presenting, recommending, and updating strategies and initiatives to senior management. </li><li>May have supervisory responsibilities for non-exempts. </li><li>As delegated, may manage PO Spend up to $1,000,000 in accordance with governing directives. Participates in the development of less experienced staff by setting an example, providing guidance, and offering counsel. </li><li>Cumulative Category Spend: up to 50MM; Suppliers: up to 500; Span of control: global<br/><br/></li></ul>Education And Experience You’ll Bring<br/><br/>Minimum Education<br/><br/><ul><li>Bachelor’s Degree or equivalent experience: Supply Chain, Engineering, Science, Business, or Financial Degrees. </li><li>CPSM certification desired<br/><br/></li></ul>Minimum Experience / Training Required<br/><br/><ul><li>4-6 years of or Procurement experience. </li><li>Functional experience. </li><li>Project management skills. </li><li>Excellent people skills, </li><li>Excellent problem solving skills and Proficient in the use of spreadsheet programs. </li><li>Strong communication skills (written and verbal). </li><li>Strong interdisciplinary, intercultural, influence, and networking skills<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>4 yr Degree strongly preferred</li><li>Medical Device, Automotive, Pharma or Aerospace industry experience strongly preferred</li><li>Experience with supplier negotiations, contract management and development, having developed category strategies in previous roles</li><li>Supplier relationship management</li><li>Financial Acumen a plus</li><li>Able to travel 10%-25% domestic, some international<br/><br/></li></ul>Apply Now<br/><br/><ul><li> Participants who complete a short wellness assessment qualify for FREE coverage in our HIP PPO medical plan. Free coverage applies in the next calendar year.<br/><br/></li></ul>Learn more about our health and wellness benefits, which provide the security to help you and your family live full lives: </strong>www.abbottbenefits.com <br/><br/>Follow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.<br/><br/>Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.<br/><br/>Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.<br/><br/>The base pay for this position is $72,700.00 – $145,300.00. In specific locations, the pay range may vary from the range posted.", "responsibilities": "Responsible for developing and/or implementing/executing the strategy for assigned categories. Work intimately with customers, divisions and sites, in alignment with the \"One Procurement\" model. Provide superior levels of customer service and satisfaction while adhering to a strict standard of business ethics and integrity", "qualifications": {"required": "Bachelor’s Degree or equivalent experience: Supply Chain, Engineering, Science, Business, or Financial Degrees. \nCPSM certification desired\n4-6 years of or Procurement experience. \nFunctional experience. \nProject management skills. \nExcellent people skills, \nExcellent problem solving skills and Proficient in the use of spreadsheet programs. \nStrong communication skills (written and verbal). \nStrong interdisciplinary, intercultural, influence, and networking skills", "preferred": "4 yr Degree strongly preferred\nMedical Device, Automotive, Pharma or Aerospace industry experience strongly preferred\nExperience with supplier negotiations, contract management and development, having developed category strategies in previous roles\nSupplier relationship management\nFinancial Acumen a plus\nAble to travel 10%-25% domestic, some international"}, "skills": ["Supply Chain", "Engineering", "Science", "Business", "Financial", "CPSM", "Procurement", "Project Management", "Problem Solving", "Spreadsheet Programs", "Communication", "Interdisciplinary", "Intercultural", "Influence", "Networking", "Supplier Negotiations", "Contract Management", "Supplier Relationship Management", "Financial Acumen"], "postedDate": "1 week ago", "benefits": "Participants who complete a short wellness assessment qualify for FREE coverage in our HIP PPO medical plan. Free coverage applies in the next calendar year.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3984642521"}