{"jobTitle": "Logistic Coordinator_ Drayage Management Coordinator (HUB)@ Santa Ana CA", "company": {"name": "MindSource", "industry": "IT Services and IT Consulting", "size": "51-200 employees", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Logistics", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$23.00/hr - $27.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "Hi\n\nMindsource is seeking a Logistics Coordinator for one of our Direct Clients. If interested, please drop your resume to akhil@mindsource.com\n\nTitle: Logistics Coordinator\n\nLocation: Santa Ana, CA\n\nPay Range : $23-$27/hr W2 \n\nRequirements/Qualifications\n\n- Bachelor's degree preferred or GED\n- Strong understanding of international transportation (especially ocean shipping) / freight forwarding industry\n- Excellent project and people management skills\n- Experience in establishing a transport plan that can optimize loading rate, transport time and logistics cost\n- Ability to manage within goals by considering in time, budget and business objectives\n- Analytical/focused/data-driven coupled with creative problem solving\n- Strong cross-functional teamwork, collaboration, interpersonal, with excellent written and verbal skills.\n- Advanced proficiency in MS Office Suite and other applications\n- Prioritization skill, able to shift focus to urgent issues while not falling behind on other duties\n- Ability to travel up to 20% in domestic and international", "responsibilities": "- Monitor and manage the drayage process of shipment movement (receive Arrival Notices, ISF information before port arrival of vessel, create and send delivery(work) order, empty container return)\n- Manage relationships with selected drayage carriers and make urgent communication in case of emergency\n- Search plan B drayage carriers in case of lack of capacities\n- Share with daily container delivery schedules with drayage carriers\n- Analyze, create, edit, track and trace select LSPs such as drayage carriers, rail companies, rail terminals\n- Monitor and drive improvement to customer service goals including on-time delivery, product lead-times, and request-for-quote responsiveness\n- In case to use pre-pull yard, find the best solutions in time\n- Report monthly on Key Performance Indicators (KPI's) for drayage deliveries\n- Checking the delivery status and share with customers\n- Document corrective actions and improvement plans properly, and verify plan's effectiveness.\n- Perform ad-hoc reporting, as required.\n- Perform other job related duties as required", "qualifications": {"required": "Bachelor's degree preferred or GED", "preferred": "Strong understanding of international transportation (especially ocean shipping) / freight forwarding industry, Excellent project and people management skills, Experience in establishing a transport plan that can optimize loading rate, transport time and logistics cost, Ability to manage within goals by considering in time, budget and business objectives, Analytical/focused/data-driven coupled with creative problem solving, Strong cross-functional teamwork, collaboration, interpersonal, with excellent written and verbal skills, Advanced proficiency in MS Office Suite and other applications, Prioritization skill, able to shift focus to urgent issues while not falling behind on other duties, Ability to travel up to 20% in domestic and international."}, "skills": ["Logistics", "Project Management", "Communication", "Analytical Skills", "MS Office Suite", "Problem Solving", "Teamwork", "Time Management"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984139952"}