{"jobTitle": "Buyer", "company": {"name": "REVOLVE", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Strategy/Planning, Administrative, and Other", "industry": "Retail Apparel and Fashion", "description": "<strong><u>Meet the Owned Brand division of REVOLVE:</u></strong><p><br/></p><p><em>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand and a go-to source for discovery and inspiration, REVOLVE delivers an engaging customer experience from a vast yet curated offering of over 45,000 products. Founded in Los Angeles in 2003 by co-CEOs, Michael Mente and Mike Karanikolas, REVOLVE’s family of brands includes their luxury offering, FWRD and a portfolio of 24 owned brands such as Lovers + Friends, Tularosa, NBD and RAYE.</em></p><p><br/></p><p>The Owned Brand division within REVOLVE is an industry-leading fashion design and production house based in Los Angeles. Leveraging the power of REVOLVE’s data driven merchandising, combined with raw creative talent, results in an unparalleled ability to identify specific market niches and develop brands that each have their own identity, designed with a distinct consumer interest and personality in mind.</p><p><br/></p><p>At REVOLVE the most successful team members have the thirst and creativity to redefine fashion retail for the 21st century, making REVOLVE the leading online retail destination targeted towards Millennial and Generation Z consumers seeking premium fashion. With a team of 1,000 strong, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment. </p><p><br/></p><p>Some of the sweetest perks we offer aren’t in a typical benefit package like hefty discounts on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties. </p><p><br/></p><p>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or #lifeatrevolve.</p><p><br/></p><p>Are you ready to set the standard for Premium apparel?</p><p><br/></p><p><strong>Are you ready to set the standard for Premium apparel?</strong></p><p><strong>Main purpose of the Buyer role:</strong></p><p>This is a full time role for a candidate who will buy and manage a subset of brands in the Women’s RTW and/or accessories and/or shoe space for REVOLVE, Owned Brands. The person in this role will bring drive and passion for following trends and understanding analytics. This position requires an out of the box thinker, with exceptional organizational skills that will thrive in a fast-paced environment. The position will report to the Buying Manager.</p><p><br/></p><p><strong><u>Major Responsibilities:</u></strong></p><p>Essential Duties and Responsibilities include the following. Other duties may be assigned.</p><ul><li>Assist in merchandising, developing, purchasing and managing a variety of products and brands for the Owned Brands segment with minimal direction.</li><li>Knowledgeable in women’s contemporary brands, as well as current trends.</li><li>Responsible for assortment selection consisting of planning, customer needs, trends, competitors and merchandising with minimal supervision.</li><li>Understand/study sales history and inventory levels to evaluate what product is needed</li><li>Oversee all aspects of re-cuts, re-orders, and re-colors.</li><li>Ability to follow calendar and key deadlines with minimal supervision</li><li>Partner with cross functional teams to set retails in order to hit margin goals.</li><li>Oversee &amp; approve post-po, fit issues, retail changes and delays with minimal supervision.</li><li>Manage brand budget and category/skus with minimal supervision (with Macro budget in mind).</li><li>Identify opportunities and risk in-season through analyzing sales performance.</li><li>Work closely with internal Design and Product Development teams to ensure proper product mix being put into development as well as ability to provide feedback on construction, fabrication and fit.</li><li>Train and support Assistant and Admin Buyers. This includes providing guidance to junior members on how to solve discrepancies &amp; troubleshoot issues.</li><li>Ability to balance multiple brands while thinking strategically with strong attention to details.</li><li>Responsible for calculating and managing gross margin, turnover, and OTB.</li><li>Reviews sales results to strategize timely mark-downs and manages old age inventories through strategic liquidation.</li><li>Work closely with the analytics team to execute a strategic buy.</li><li>Oversee order placement and tracking to ensure timely receipt of merchandise.</li><li>Some travel may be required.</li><li>Must be able to work flexible hours to get the job done.</li><li>Complete ad-hoc tasks and special projects as assigned by management.</li><li>Ability to manage 1-3 direct reports </li></ul><p><br/></p><p><strong><u>Required Competencies:</u></strong></p><p>To perform the job successfully, an individual should demonstrate the following competencies:</p><ul><li>Strong knowledge in retail setting, fabrications and garment construction.</li><li>Ability to understand the “big picture”.</li><li>Ability to manage and train junior level admins/assistants while staying on task.</li><li>Self-starter with the ability to give constructive criticism, encourage teammates, and celebrate team successes.</li><li>Ability to demonstrate logical thinking, critical thinking and problem solving skills.</li><li>Ability to develop strong, synergistic relationships with a multitude of teams and personnel. Ability to work successfully with any personality type.</li><li>Ability to balance multiple brands and initiatives.</li><li>Strong multitasking, prioritization, and organization skills.</li><li>Strong work ethic to excel in a fast paced environment.</li><li>Strong analytical skills, good judgment, creativity, and enthusiasm.</li><li>Ability to make tight deadlines.</li><li>Strong understanding of industry trends and market awareness.</li><li>Ability to work in a fast-paced growing environment.</li><li>Strong verbal and written communication skills.</li></ul><p><br/></p><p><strong><u>Minimum Qualifications:</u></strong></p><ul><li>Bachelor’s degree in Fashion or Business preferred.</li><li> 3-5 years of Women’s Buying experience.</li><li>Work experience as a Buyer is required - strong knowledge of and ability to apply retail math concepts, including elements of markup, margin planning, open to buy, and inventory productivity measures.</li><li>Strong knowledge of and the ability to apply retail math concepts, including markup, margin planning, open to buy, and inventory productivity measures.</li><li>Experience with private label buying preferred, both development and merchandising.</li><li>Experience as a manager is a plus.</li><li>Proficient in Email (preferably Gmail), Google Suite, Microsoft Office.</li></ul><p><br/></p><p>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day. </p><p><br/></p><p>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.</p><p>A reasonable estimate of the current salary rate is $85,000- $95,000 per year.</p>", "postedDate": "3 weeks ago", "qualifications": {"required": "Work experience as a Buyer is required - strong knowledge of and ability to apply retail math concepts, including elements of markup, margin planning, open to buy, and inventory productivity measures.", "preferred": "Bachelor’s degree in Fashion or Business preferred, Experience with private label buying preferred, both development and merchandising, Experience as a manager is a plus"}, "skills": ["Retail", "Fashion", "Merchandising", "Buying", "Trend Analysis", "Inventory Management", "Budgeting", "Product Development", "Sales Analysis", "Team Management", "Communication", "Analytical Skills", "Problem Solving", "Microsoft Office", "Google Suite", "Gmail"], "benefits": "hefty discounts on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984493153"}