{"jobTitle": "Human Resources Manager", "company": {"name": "GOOD SEED COMMUNITY DEVELOPMENT CORPORATION", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources and Management", "industry": "Health and Human Services and Public Health", "description": "Position Overview:\nWe are seeking an experienced and motivated HR Manager to join our team in Los Angeles. This senior level role is ideal for professionals with a strong background in healthcare and legal environments. The HR Manager will collaborate closely with leadership to align talent management strategies with organizational goals, ensuring compliance with relevant employment laws and regulations. The ideal candidate will support the full scope of Human Resources responsibilities and partner with the organization on strategic initiatives. They will maintain and enhance the organization's human resources by planning, implementing, and evaluating human resources policies, programs, and practices. \n\nKey Responsibilities:\n- Talent Management: Partner with senior leadership to understand talent needs, manage recruitment and onboarding processes, and develop policies to ensure compliance with employment laws.\n- Employee Relations: Oversee employee disciplinary meetings, terminations, and investigations. Prepare performance evaluation reports and determine merit increases and bonuses.\n- Benefits Administration: Manage employee benefits packages, including annual health insurance renewal and open enrollment processes.\n- Training and Development: Provide training and coordinate professional development opportunities for attorneys and partners.\n- Office Operations: Supervise office operations, including managing timesheets, billable and non-billable hours, and payroll processing.\n- Compliance and Documentation: Ensure compliance with federal, state, and local regulations related to hiring, onboarding, and personnel file management. Perform duties in accordance with HIPAA regulations.\n\nQualifications:\n- Master’s Degree in Healthcare Administration or a related field.\n- Bachelor’s Degree in Health Sciences or a related field.\n-5+ years' experience in Human Resources with proven experience in HR management within healthcare or legal industries.\n- Strong understanding of employment laws, benefits administration, and compliance requirements.\n- Excellent interpersonal and communication skills with the ability to manage sensitive and confidential information.\n- Proficiency in HR software and Microsoft Office Suite.\n\nAdditional Information:\n- This role requires a proactive approach to problem-solving and the ability to work independently as well as part of a team.\n- Must be detail-oriented with strong organizational skills and the ability to handle multiple tasks simultaneously.", "postedDate": "3 weeks ago", "qualifications": {"required": "Master’s Degree in Healthcare Administration or a related field.\nBachelor’s Degree in Health Sciences or a related field.\n5+ years' experience in Human Resources with proven experience in HR management within healthcare or legal industries.\nStrong understanding of employment laws, benefits administration, and compliance requirements.\nExcellent interpersonal and communication skills with the ability to manage sensitive and confidential information.\nProficiency in HR software and Microsoft Office Suite.", "preferred": "- This role requires a proactive approach to problem-solving and the ability to work independently as well as part of a team.\n- Must be detail-oriented with strong organizational skills and the ability to handle multiple tasks simultaneously."}, "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984837119"}