{"jobTitle": "Manager, Social Media & Brand Marketing", "company": {"name": "Sony Music Entertainment", "location": "Culver City, CA", "industry": "Musicians"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Musicians", "description": "About Sony Music Entertainment<br/><br/>At Sony Music Entertainment, we fuel the creative journey. We’ve played a pioneering role in music history, from the first-ever music label to the invention of the flat disc record. We’ve nurtured some of music’s most iconic artists and produced some of the most influential recordings of all time.<br/><br/>Today, we work in more than 70 countries, supporting a diverse roster of international superstars, developing and independent artists, and visionary creators. From our position at the intersection of music, entertainment, and technology, we bring imagination and expertise to the newest products and platforms, embrace new business models, employ breakthrough tools, and provide powerful insights that help our artists push creative boundaries and reach new audiences. In everything we do, we’re committed to artistic integrity, transparency, and entrepreneurship.<br/><br/>Sony Music Entertainment is a member of the Sony family of global companies.<br/><br/>What you'll do:<br/><br/>• Oversee AWAL brand strategy and social media strategy<br/>• Manage all AWAL digital properties (including all social platforms, website &amp; blog)<br/>• Work directly with artists and internal teams to produce AWAL branded events &amp; activations<br/>• Along with Head of PR, oversee AWAL’s participation and submission for industry events, awards and conferences<br/>• Responsible for crafting and maintaining our brand tone of voice<br/>• Brainstorm and implement new AWAL-branded content series, optimized for each channel<br/>• Oversee social media content calendars and work with the design team to support social campaigns<br/>• Post and schedule content across multiple platforms<br/>• Use analytics tools to create social performance reports and collate data that will inform our social strategy<br/>• Stay on top of emerging social &amp; industry trends<br/>• Work with our internal teams to compile and promote key artist/songwriter projects, company achievements, awards and press coverage<br/>• Conceptualize &amp; work directly with internal teams and senior leadership to produce AWAL branded events &amp; activations at industry conferences<br/>• Track and oversee submissions for industry awards on behalf of AWAL<br/>• Assist in media/partner outreach on behalf of the AWAL brand and its executives; produce brand advertisements<br/><br/>Who you are:<br/><br/>• 3+ years of experience at a label, agency, management company or similar environment<br/>• You’ll live and breathe AWAL, crafting high quality content plans to bring our brand to life on social media &amp; beyond<br/>• Passionate storyteller with the ability to communicate creatively and manage project collaborators, a strong eye for aesthetics<br/>• A demonstrated track record of creating and executing effective marketing campaigns, with demonstrable ROI<br/>• Hyper-knowledgeable about music and internet culture, expert user of social media with a passion for all platforms<br/>• A self starter, and can think on your feet, excited to grow your career in this industry<br/>• An adept producer/project manager with a high level of attention to detail<br/><br/>Skills<br/><br/>• Strong team player with excellent people skills<br/>• Understanding of social media analytics &amp; strategy<br/>• Knowledge of SproutSocial or other social CMS<br/>• Superior organizational skills with an ability to manage multiple projects at once<br/>• Excellent communication skills, both written and verbal; Copywriting<br/>• Ability to communicate creatively &amp; submit content briefs<br/>• Basic Photoshop or video editing a plus (ie. cropping a photo, making a music video cutdown)<br/>• Interviewing skills for artist/employee/brand initiatives<br/>• Knowledge of Google Docs, Keynote, Google Drive<br/>• Some experience in event production and planning<br/><br/>What we give you:<br/><br/>• You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day <br/>• A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best <br/>• An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching <br/>• Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans <br/>• Investment in your professional growth and development enabling you to thrive in our vibrant community. <br/>• The space to accelerate progress, positively disrupt, and create what happens next <br/>• Time off for a winter recess<br/><br/>Sony Music is committed to providing equal employment opportunity for all persons regardless of age, disability, national origin, race, color, religion, sex, sexual orientation, gender, gender identity or expression, pregnancy, veteran or military status, marital and civil partnership/union status, alienage or citizenship status, creed, genetic information or any other status protected by applicable federal, state, or local law.<br/><br/>California based applicants have certain rights under California law. Please see our California Recruitment Privacy Policy for more details.<br/><br/>The anticipated annual base salary does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>California Pay Range<br/><br/>$75,000—$85,000 USD", "responsibilities": "Oversee AWAL brand strategy and social media strategy\nManage all AWAL digital properties (including all social platforms, website &amp; blog)\nWork directly with artists and internal teams to produce AWAL branded events &amp; activations\nAlong with Head of PR, oversee AWAL’s participation and submission for industry events, awards and conferences\nResponsible for crafting and maintaining our brand tone of voice\nBrainstorm and implement new AWAL-branded content series, optimized for each channel\nOversee social media content calendars and work with the design team to support social campaigns\nPost and schedule content across multiple platforms\nUse analytics tools to create social performance reports and collate data that will inform our social strategy\nStay on top of emerging social &amp; industry trends\nWork with our internal teams to compile and promote key artist/songwriter projects, company achievements, awards and press coverage\nConceptualize &amp; work directly with internal teams and senior leadership to produce AWAL branded events &amp; activations at industry conferences\nTrack and oversee submissions for industry awards on behalf of AWAL\nAssist in media/partner outreach on behalf of the AWAL brand and its executives; produce brand advertisements", "qualifications": {"required": "3+ years of experience at a label, agency, management company or similar environment\nYou’ll live and breathe AWAL, crafting high quality content plans to bring our brand to life on social media &amp; beyond\nPassionate storyteller with the ability to communicate creatively and manage project collaborators, a strong eye for aesthetics\nA demonstrated track record of creating and executing effective marketing campaigns, with demonstrable ROI\nHyper-knowledgeable about music and internet culture, expert user of social media with a passion for all platforms\nA self starter, and can think on your feet, excited to grow your career in this industry\nAn adept producer/project manager with a high level of attention to detail", "preferred": null}, "skills": ["SproutSocial", "Social Media Analytics", "Social Media Strategy", "Marketing Campaigns", "Music Industry", "Content Creation", "Social Media Management", "Event Production", "Project Management", "Communication", "Copywriting", "Photoshop", "Video Editing", "Google Docs", "Keynote", "Google Drive"], "postedDate": "2 days ago", "applicationDeadline": null, "benefits": "You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day \nA modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best \nAn attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching \nVoluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans \nInvestment in your professional growth and development enabling you to thrive in our vibrant community. \nThe space to accelerate progress, positively disrupt, and create what happens next \nTime off for a winter recess", "remoteWork": null, "salary": {"amount": "75,000—$85,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3984807634"}