{"jobTitle": "Assembler C", "company": {"name": "COGENT Infotech", "location": "Gardena, CA"}, "location": "Gardena, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "<strong>Major Purpose<br/><br/></strong>Job Description:<br/><br/><ul><li>Under close supervision of the Lead and/or Production Supervisor, this position is responsible for simple and repetitive job assignments, consisting of both Magnetic and Electro Mechanical assembly work ranging from simple to semi-complex in accordance with work order instructions, Engineering Drawings and Manufacturing Process Specifications<br/><br/></li></ul>Major functions:<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Assemble Electro-Mechanical parts and perform inner chassis wiring connections using various tools.</li><li>Assemble Magnetic assemblies through all stages of the process, from core and coil assembly to final assembly.</li><li>Assemble wood creates/pallets as needed/required</li><li>Perform simple to semi-complex cable assembly per shop order instructions and engineering drawing.</li><li>Basic understanding of standard hardware installation sequence.</li><li>Ability to read hardware descriptions on Engineering BOM and physically identify the characteristic of the hardware.</li><li>Ability to communicate issues, concerns and/or questions to his or her supervisors/managers and/or support groups (Manufacturing Engineering, Planning, Quality and Inspection).</li><li>Complies with company’s safety rules and regulations.</li><li>Responsible for the accuracy of time charging on job performed.</li><li>Responsible for keeping his or her work area clean and well organized.</li><li>Perform other duties as assigned by Management.</li><li>Able to pass soldering test and be certified ANSI-J-STD-001 as required.</li><li>Able to read and understand both written and verbal instructions in English<br/><br/></li></ul>Technical Functional skills:<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>High School Diploma or G.E.D</li><li>4-6 years in related magnetic and/or electro-mechanical assembly related trainings, OR</li><li>2 years post-Secondary/Associates Degree with a minimum of 2 years of prior related experience.</li><li>Solid experience with assembly blueprint reading.</li><li>Experience with hardware installation requirements.<br/><br/></li></ul><strong>NOTE: Due to the varying production requirements at the time of hire, this position may require soldering skills to Military specifications or ANSI-J-STD-001 in addition to mechanical/assembly skills or may require only mechanical/assembly skills. This is to be determined by the Manager/Supervisor based on the tasks and production needs.</strong>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984251302"}