{"jobTitle": "Manager Infection Control", "company": {"name": "CommonSpirit Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "56.57/hr - 82.04/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Wellness and Fitness Services, Hospitals and Health Care, and Medical Practices", "description": "*Overview*<br/><br/>Founded in 1887 Dignity Health - California Hospital Medical Center is a 318-bed acute care nonprofit hospital located in downtown Los Angeles. The hospital offers a full complement of services including a Level II trauma center the Los Angeles Center for Womens Health obstetrics and pediatric services and comprehensive cardiac and surgical services. The hospital shares a legacy of humankindness with Dignity Health one of the nations five largest health care systems. Visit https://www.dignityhealth.org/socal/locations/californiahospital for more information.<br/><br/>If you are committed to social justice, health equity, and prepared to deliver care in new, innovative ways, you belong with us.<br/><br/>We offer the following benefits to support you and your family:<br/><br/><ul><li> Annual Incentive (Bonus) Program.</li><li> Matching Retirement Programs.</li><li> Pension fully funded by the Hospital.</li><li> Tuition Assistance for career growth and development.</li><li> Health/Dental/Vision Insurance.</li><li> Free Membership to our Care@Work program supporting child care, pet care, and adult dependent needs.</li><li> Employee Assistance Program (EAP) for you and your family.</li><li> Flexible spending accounts.</li><li> Voluntary Protection: Group Accident, Critical Illness, and Identity Theft.</li><li> Wellness Program.</li><li> Paid Time Off (PTO).<br/><br/></li></ul>*Responsibilities*<br/><br/><strong>Position Summary<br/><br/></strong>As our Manager Infection Prevention at California Hospital Medical Center, you’ll coordinate all infection prevention related activities associated with surveillance, performance improvement , and education, which are intended to ensure that the facility’s patients, personnel &amp; visitors will be protected from transmission of diseases &amp; infection within the facility’s environment as identified in the core competency model by the Association for Professionals in Infection Control and Epidemiology (APIC).<br/><br/>To thrive in this role, you must be competent and confident. Utilizing your expertise and excellent communication skills you will work in collaboration with Hospital Administration to develop and manage an Infection Prevention Program that incorporaes essential facility strategic plan elements that align with the goals, objectives, and risk assessments of the Infection Prevention Program.<br/><br/><strong>Principal Duties And Accountabilities<br/><br/></strong><ul><li> Responsible for oversight of daily operations of the Infection Prevention Department and Employee Health in regard to the facility compliance with Hospital Accreditation Standards, State and CMS regulations.</li><li> Ongoing assessment and development of programs, policies &amp; procedures and forms to address the Infection Prevention needs of employees, volunteers, contract workers, independent contractors, physicians, registry workers and students in accordance with the guidelines established by the regulatory agencies.</li><li> Provides expert consultation and education, as needed, and as related to Infection Prevention.</li><li> Develops and operationalizes the Infection Prevention Program’s annual risk assessment, annual plans, and annual evaluations. Identifies and implements updates to the Infection Prevention Program when new regulations and /or Professional guidelines are published.<br/><br/></li></ul>*Qualifications*<br/><br/><strong>Education And Experience<br/><br/></strong><ul><li> Bachelor's degree in Science (Microbiology, Biology, Nursing, Public Health).</li><li> Minimum of three (3) years clinical experience in Nursing, Microbiology, Biology, or Public Health, and two (2) years of experience as an Infection Preventionist in an acute care facility.<br/><br/></li></ul>*Licensure *<br/><br/><ul><li> An active license in state of practice is required for a Registered Nurse or Clinical Lab Scientist.</li><li> Certification in Infection Prevention and Control by the Certification Board of Infection Control and Epidemiology (CBIC) to be obtained during the first two (2) years of hire.<br/><br/></li></ul>*Pay Range*<br/><br/>$56.57 - $82.04 /hour<br/><br/>", "responsibilities": "<strong>Position Summary<br/><br/></strong>As our Manager Infection Prevention at California Hospital Medical Center, you’ll coordinate all infection prevention related activities associated with surveillance, performance improvement , and education, which are intended to ensure that the facility’s patients, personnel &amp; visitors will be protected from transmission of diseases &amp; infection within the facility’s environment as identified in the core competency model by the Association for Professionals in Infection Control and Epidemiology (APIC).<br/><br/>To thrive in this role, you must be competent and confident. Utilizing your expertise and excellent communication skills you will work in collaboration with Hospital Administration to develop and manage an Infection Prevention Program that incorporaes essential facility strategic plan elements that align with the goals, objectives, and risk assessments of the Infection Prevention Program.<br/><br/><strong>Principal Duties And Accountabilities<br/><br/></strong><ul><li> Responsible for oversight of daily operations of the Infection Prevention Department and Employee Health in regard to the facility compliance with Hospital Accreditation Standards, State and CMS regulations.</li><li> Ongoing assessment and development of programs, policies &amp; procedures and forms to address the Infection Prevention needs of employees, volunteers, contract workers, independent contractors, physicians, registry workers and students in accordance with the guidelines established by the regulatory agencies.</li><li> Provides expert consultation and education, as needed, and as related to Infection Prevention.</li><li> Develops and operationalizes the Infection Prevention Program’s annual risk assessment, annual plans, and annual evaluations. Identifies and implements updates to the Infection Prevention Program when new regulations and /or Professional guidelines are published.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Science (Microbiology, Biology, Nursing, Public Health). Minimum of three (3) years clinical experience in Nursing, Microbiology, Biology, or Public Health, and two (2) years of experience as an Infection Preventionist in an acute care facility.", "preferred": "An active license in state of practice is required for a Registered Nurse or Clinical Lab Scientist. Certification in Infection Prevention and Control by the Certification Board of Infection Control and Epidemiology (CBIC) to be obtained during the first two (2) years of hire."}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Annual Incentive (Bonus) Program. Matching Retirement Programs. Pension fully funded by the Hospital. Tuition Assistance for career growth and development. Health/Dental/Vision Insurance. Free Membership to our Care@Work program supporting child care, pet care, and adult dependent needs. Employee Assistance Program (EAP) for you and your family. Flexible spending accounts. Voluntary Protection: Group Accident, Critical Illness, and Identity Theft. Wellness Program. Paid Time Off (PTO).", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3984072596"}