{"jobTitle": "Coordinator- Influencer Relations", "company": {"name": "Murad", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00/yr - 65,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Personal Care Product Manufacturing", "description": "Murad Skincare has a 30-year legacy of developing clinically proven products that are backed by science and cruelty-free. Founded by dermatologist Dr. Howard Murad, we follow four pillars of wellness to create products and experiences for happier lives: Eat your water, be kind to your mind, nourish your skin, and awaken your body. We’re proud to be part of the Unilever prestige family that works every day towards enhancing sustainability and inclusivity. We stand against discrimination and hate, and actively advocate for inclusion: so much so that one of our core values is respect, connect, and appreciate. Our team members are as diverse as they are talented—each bringing a unique perspective to an environment that encourages coloring outside of the lines, speaking up, and collaboration—and we’re ready for you to join our team!<br/><br/>The Influencer Relations Coordinator will be responsible for the activation of Murad’s earned and paid influencer marketing programs, supporting the Influencer Manager with overall strategy, day-to-day operations, and campaign executions. You’ll work closely with the Marketing and Consumer Engagement teams to build programs that will drive the most buzz, engagement, conversation, and conversion, as aligned with business objectives and goals. Responsibilities will include overseeing ongoing influencer seeding and talent relations and playing a critical support role in global talent management, digital activations, and partnerships.<br/><br/>This candidate will thrive in a fast-paced, ever-changing environment, with strong project management skills, timeline organization, and experience with metric reporting and analysis. The ideal person will have proven experience assisting in identifying and engaging influencers, supporting outreach programs, and project-managing digital launches. This individual also has a deep interest in beauty, digital marketing, community, and culture.<br/><br/><strong>Campaign Marketing &amp; Paid Creator Partnerships (50%)<br/><br/></strong><ul><li>Support Influencer Manager with creator relationships, including outreach, day-to-day communications, and content review</li><li>Identify new talent to bring into the Murad program for both earned and paid opportunities through manual discovery and influencer discovery tools on platforms such as Trackr and Tribe</li><li>Build &amp; nurture existing creator relationships through both direct and agency-led partnerships; help to craft culturally relevant engagements</li><li>Lead execution of monthly mailers by managing the day-to-day production timeline, product ordering, creative briefing, recipient list building, and communication about incoming packages and supervising the fulfillment of mailers in the office</li><li>Manage micro-influencer program to ensure all plans are completed on time</li><li>Support execution of paid influencer campaigns from contracts, product sends, creative briefs, and communication</li><li>Track and maintain the creator database to ensure it is up-to-date and optimized</li><li>Support public relations team with outreach for event attendance</li><li>Collaborate with social media &amp; community counterparts to ensure integrated activations<br/><br/></li></ul><strong>Analytics and Measurement (30%)<br/><br/></strong><ul><li>Utilize marketing measurement tools to track performance metrics and activate influencer campaigns, posting, and data gathering</li><li>Assist Influencer Manager in post-campaign analysis across paid and earned influencer marketing efforts</li><li>Monitor metrics daily via digital listening dashboards (e.g., Tribe Dynamics and Traackr) to ensure all activity is captured within the platform<br/><br/></li></ul><strong>Community Engagement (15%)<br/><br/></strong><ul><li>Engage daily with Murad influencer Instagram posts/stories and TikTok posts to foster positive, trusted relationships with existing and prospective influencers</li><li>Monitor influencer activity across the social sphere (e.g., Instagram, YouTube, Snapchat) to report on trends, content, and collaborations, monitoring competitive and innovative non-beauty activity</li><li>Flag talent inquiries from social channels to the team</li><li>Support retention efforts by flagging key milestones in our influencer community</li><li>Always On Support (5%)</li><li>Manage CE team's forecast and product closet and shipments</li><li>Keep track of all influencer invoices and opening of POs, collaborating with our team members to ensure that all creators and agency invoices are paid on time<br/><br/></li></ul><strong>Requirements &amp; Qualifications<br/><br/></strong><ul><li>Four-year college degree or equivalent.</li><li>2-3 years of related experience, e.g., digital advertising, digital marketing, social media, influencer marketing, and program management</li><li>Brand/beauty experience a plus</li><li>Demonstrate proactivity and detail-oriented with a curiosity to learn. Thinks strategically and thrives in a fast-paced environment</li><li>Team player that is highly organized with project and campaign management skills.</li><li>Works collaboratively with internal teams, organic social, PR, creative, and product marketing to develop ideas.</li><li>Excellent communication and writing skills, and strong creative judgment to recognize what is on brand and on trend.</li><li>Strong quantitative skills and ability to interpret data for real-time optimization; knowledge of key social media. Understanding of paid media/social advertising is a plus.</li><li>Active daily life in digital and social media, very digitally savvy and curious, passionate about pop culture and social, enthusiastic about forging relationships with influencers and tastemakers<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Unlimited Paid Time Off</li><li>Medical, Dental, Vision Insurance</li><li>FSA/HSA</li><li>Life/Accident Insurance</li><li>Employee Assistance Program (EAP)</li><li>Professional Development Resources</li><li>401(k) Employer Match Program<br/><br/></li></ul>This position is based in our El Segundo, CA headquarters, which is currently 40% hybrid onsite/remote work.<br/><br/>The expected base salary for this position is $60,000 to $65,000. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget. In addition to base salary, Murad offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.<br/><br/>Murad is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to race, color, religion, national origin, ethnicity, age, sex, marital status, physical or mental disability, gender identity, sexual orientation, veteran or military status, or any other category protected under the law. Murad is an equal opportunity employer; committed to creating a community of inclusion, and an environment free from discrimination, harassment, and retaliation.<br/><br/>", "responsibilities": "The Influencer Relations Coordinator will be responsible for the activation of Murad’s earned and paid influencer marketing programs, supporting the Influencer Manager with overall strategy, day-to-day operations, and campaign executions. You’ll work closely with the Marketing and Consumer Engagement teams to build programs that will drive the most buzz, engagement, conversation, and conversion, as aligned with business objectives and goals. Responsibilities will include overseeing ongoing influencer seeding and talent relations and playing a critical support role in global talent management, digital activations, and partnerships.", "qualifications": {"required": "Four-year college degree or equivalent., 2-3 years of related experience, e.g., digital advertising, digital marketing, social media, influencer marketing, and program management, Brand/beauty experience a plus, Demonstrate proactivity and detail-oriented with a curiosity to learn. Thinks strategically and thrives in a fast-paced environment, Team player that is highly organized with project and campaign management skills., Works collaboratively with internal teams, organic social, PR, creative, and product marketing to develop ideas., Excellent communication and writing skills, and strong creative judgment to recognize what is on brand and on trend., Strong quantitative skills and ability to interpret data for real-time optimization; knowledge of key social media. Understanding of paid media/social advertising is a plus., Active daily life in digital and social media, very digitally savvy and curious, passionate about pop culture and social, enthusiastic about forging relationships with influencers and tastemakers", "preferred": null}, "skills": ["Influencer Marketing", "Digital Marketing", "Social Media", "Project Management", "Communication", "Writing", "Data Analysis", "Social Media Advertising"], "postedDate": "6 days ago", "applicationDeadline": null, "benefits": "Unlimited Paid Time Off, Medical, Dental, Vision Insurance, FSA/HSA, Life/Accident Insurance, Employee Assistance Program (EAP), Professional Development Resources, 401(k) Employer Match Program", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3984584865"}