{"jobTitle": "Director- US Marketing (Youth to the People)", "company": {"name": "L'Oréal", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Advertising, Marketing, and Other", "industry": "Manufacturing and Personal Care Product Manufacturing", "description": "Title: Director, US Marketing<br/><br/>Brand: Youth to the People<br/><br/>Location: El Segundo, CA<br/><br/><strong>Job Summary<br/><br/></strong>The Marketing Director is responsible for leading and accelerating growth &amp; market share for Youth To The People by developing innovative and consumer centric strategies with executional excellence. The Marketing Director will create and implement go-to market plans working closely with VP, Marketing for brand, new launches and core hero products. They will own consumer insights and trends for the US market to drive breakthrough communications with a data-driven and creative mindset. They will evaluate product launches, perform business &amp; competitive analyses, drive US-market content and promotional marketing programs as well as prepare presentations to key retailers and top management meetings. This position is an opportunity for a proactive, self-motivated individual to be both creative and analytical and to help accelerate the growth of Youth To The People. It is responsible for leading and developing 1 direct report.  <br/><br/><strong>Job Responsibilities<br/><br/></strong>New Product Launches:                                                    <br/><br/><ul><li>Ownership and responsibility for supervising entire go to market process across multiple launches- retailer, social, media, education, etc.</li><li>Evaluate new product launches and opportunities for categories and recommend feasibility for US market, working closely with global teams, Sales, Demand Planning and Finance partners</li><li>Participate in selling project to management at large</li><li>Generate long term strategic development</li><li>Collaborate with Global Teams and Creative to create launch materials for full 360 animations<br/><br/></li></ul><strong>Strategy &amp; Planning<br/><br/></strong><ul><li>Drive the research, analysis, category trends and insights to develop long term strategy</li><li>Strong understanding of consumer insights, trends, social landscape and winning content</li><li>Oversee and guide plans development and create vision for owned categories</li><li>Contribute to total category strategy / plans<br/><br/></li></ul>Sales/Trade Marketing:                                                                      <br/><br/><ul><li>Collaborate with Creative + Sales to create launch materials including visual merchandising and sampling</li><li>Prepare and conduct presentations for retailer meetings</li><li>Partner with Sales and Education teams to drive activations with retailers, both online and in-store including special events programs<br/><br/></li></ul> Financial P&amp;L and Forecasting:                                                        <br/><br/><ul><li>Own retail forecast and planning of new launches and existing products</li><li>Understand and manage financial implications of forecasts</li><li>Drive accuracy of all budgets and roll up of total category with finance</li><li>Manage budget allocation between spending buckets with VP and peers<br/><br/></li></ul><strong>Promotions/Advertising / Media<br/><br/></strong><ul><li>Work intimately with creative + partners to create breakthrough consumer communications in all touchpoints, from traditional media to digital data driven activations</li><li>Work closely with media + Advocacy &amp; Influence team on direction + implementation</li><li>Provide US consumer centric feedback to global team during creative campaign development<br/><br/></li></ul>Team And Meeting Management<br/><br/><ul><li>Foster collaboration within the team and with our core partners (DMI, Sales, finance etc) </li><li>Effectively manage, train and develop direct report</li><li>Lead meeting preparation, and represent Youth To The People in management meetings</li><li>Lead cross functional teams to deliver go to market objectives</li><li>Contribute to Youth’s Culture and spirit of Unity + Giving a Damn <br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li>7+ years of Industry related marketing work experience (beauty/skincare preferred)</li><li>Experience managing direct reports preferred</li><li>Experience successfully launching and managing a new product or renovation through its entire life cycle </li><li>Brand Administration: in-depth knowledge of brand equity and management. Ability to create project plan according to product portfolio, consumer needs and market opportunity gaps</li><li>Market Research: ability to read and interpret research data</li><li>Ability to work independently with rigorous deadlines</li><li>Strong Project Management Skills</li><li>Strong presentation skills</li><li>Strong quantitative data analytical skills</li><li>Prioritization &amp; Organization Skills</li><li>Strong appreciation for our business / sensitivity to métier<br/><br/></li></ul><strong>Salary Range: 128-175k salary + bonus</strong>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984860840"}