{"jobTitle": "Associate Manager, Retail Business Development", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "70,000 - 85,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "Company Description<br/><br/>NBCUniversal Overview:<br/><br/>We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations &amp; Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/>Universal Products &amp; Experiences Overview<br/><br/>Universal Products &amp; Experiences (UP&amp;E) globally drives the expansion and elevation of NBCUniversal’s iconic collection of brands, intellectual properties, characters, and stories based on the company’s extensive portfolio of properties created by Universal Pictures, Illumination, DreamWorks Animation and NBCUniversal Television and Streaming. The division executes this through innovative physical and digital products, engaging retail and product experiences across our expansive global theme park destinations (for both owned and 3rd party IP), location-based venues, e-commerce product platforms, and retailers around the world. Along with global brand strategy and creative, UP&amp;E’s three lines of business include Consumer Products, Games and Digital Platforms, as well as Theme Parks Products &amp; Retail. UP&amp;E is a division of Universal Destinations &amp; Experiences, part of NBCUniversal, a subsidiary of Comcast Corporation. https://www.universalproductsexperiences.com/<br/><br/>Universal Products &amp; Experiences is committed to attracting and retaining a diverse workforce of the highest caliber. We are committed to fostering equitable and inclusive environments that honor the experiences, perspectives, and uniqueness of each colleague.<br/><br/>It is the policy of NBCUniversal and NBCUniversal's affiliated businesses to consider all qualified applicants for employment without regard to race, color, religion, national origin, sex (including pregnancy) sexual orientation, age, disability, veteran status or other characteristics protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.<br/><br/>Job Description<br/><br/>The Associate Manager, Retail Business Development will identify opportunities for Universal Pictures theatrical releases and NBC Television programs brands with a cross-category focus at Growth Channel accounts, with an emphasis on Specialty retailers. The Associate Manager role reports into the Senior Manager, Retail Development strategizing, developing, pitching, securing, and implementing merchandise and marketing programs that deliver incremental product placement at retail.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.<br/><br/>Salary range: $70,000 - $85,000<br/><br/>Qualifications<br/><br/>Responsibilities include:<br/><br/><ul><li>Manages the overall retail relationship with Buyers with frequent communication in-person, virtually and electronically.</li><li>Develops strategy, presents opportunities, and secures retailer alignment to implement programs that drive incremental product placement.</li><li>Works with appropriate retail personnel at all levels (DMM’s, Buyers, Planners, etc.) to develop, plan, and effectively implement programs that drive sales and build awareness of NBCU IP.</li><li>Responsible for the sell-in of new partnerships, as well as maintaining business on evergreen franchises, to deliver YOY growth.</li><li>Serves as the retail expert to licensees and Universal partners; provides information, strategic direction, and collaborative partnership with the goal to drive incremental sales.</li><li>Responsible for organizing meetings and delivering film/TV/Property presentations with retailers and collaborates with Category, Retail Marketing, Franchise, Product Development, Creative, Consumer Insights, Data Analytics, and Operations on pitch materials.</li><li>Partners with licensees on sell-in of products at retail for all relevant NBCUniversal properties; Regularly reviews performance of existing licensees and makes recommendations based on Buyer feedback and first-hand experience.</li><li>Proactively reviews and analyzes sales performance at all accounts. Uses sales data to inform decisions on how to strategically create more business or to pivot in a different direction to continue growth and hit financial goals.</li><li>Researches and understands business, retail, and market trends to be at the forefront of new business opportunities, new trends, and new initiatives. Proactively finds white space opportunities to present to retailers to secure incremental business.</li><li>Manages complex and flexible business models across DTR, POD and licensee opportunities across multiple retailers. Identifies financial goals for each opportunity and uses insights to help steer specific business strategy and sell-in efforts.<br/><br/></li></ul>Qualifications/Requirements<br/><br/><ul><li>2+ years’ experience in Licensor/Licensee organization or comparable industry.</li><li>BA/BS degree preferred or equivalent work experience.</li><li>Experience working with retailers strongly preferred.</li><li>Strong analytical, problem solving and research skills.</li><li>Retailer and/or vertical experience in fashion and home</li><li>Comprehensive knowledge of apparel production timelines and creative capabilities/limitations</li><li>Ability to work on several projects simultaneously and maintain flexibility to adapt to changing priorities, can work cross functionally with creative/PD, retail, and franchise counterparts.</li><li>Self-starter who identifies sales solutions that meet the needs of the retailer as well as Universal's sales objectives.</li><li>Proficient with Keynote, PowerPoint and Excel.</li><li>Strong presentation skills with proven ability to present to buyers, licensees, and senior management.</li><li>Strong organization and communication skills.</li><li>20-30% travel required.<br/><br/></li></ul>Additional Requirements<br/><br/><ul><li>Hybrid: This position has been designated as hybrid, generally contributing from the office a minimum of three days per week.<br/><br/></li></ul>Additional Information<br/><br/>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.", "responsibilities": "<ul><li>Manages the overall retail relationship with Buyers with frequent communication in-person, virtually and electronically.</li><li>Develops strategy, presents opportunities, and secures retailer alignment to implement programs that drive incremental product placement.</li><li>Works with appropriate retail personnel at all levels (DMM’s, Buyers, Planners, etc.) to develop, plan, and effectively implement programs that drive sales and build awareness of NBCU IP.</li><li>Responsible for the sell-in of new partnerships, as well as maintaining business on evergreen franchises, to deliver YOY growth.</li><li>Serves as the retail expert to licensees and Universal partners; provides information, strategic direction, and collaborative partnership with the goal to drive incremental sales.</li><li>Responsible for organizing meetings and delivering film/TV/Property presentations with retailers and collaborates with Category, Retail Marketing, Franchise, Product Development, Creative, Consumer Insights, Data Analytics, and Operations on pitch materials.</li><li>Partners with licensees on sell-in of products at retail for all relevant NBCUniversal properties; Regularly reviews performance of existing licensees and makes recommendations based on Buyer feedback and first-hand experience.</li><li>Proactively reviews and analyzes sales performance at all accounts. Uses sales data to inform decisions on how to strategically create more business or to pivot in a different direction to continue growth and hit financial goals.</li><li>Researches and understands business, retail, and market trends to be at the forefront of new business opportunities, new trends, and new initiatives. Proactively finds white space opportunities to present to retailers to secure incremental business.</li><li>Manages complex and flexible business models across DTR, POD and licensee opportunities across multiple retailers. Identifies financial goals for each opportunity and uses insights to help steer specific business strategy and sell-in efforts.<br/><br/></li></ul>", "qualifications": {"required": "2+ years’ experience in Licensor/Licensee organization or comparable industry., Strong analytical, problem solving and research skills., Retailer and/or vertical experience in fashion and home, Comprehensive knowledge of apparel production timelines and creative capabilities/limitations, Ability to work on several projects simultaneously and maintain flexibility to adapt to changing priorities, can work cross functionally with creative/PD, retail, and franchise counterparts., Self-starter who identifies sales solutions that meet the needs of the retailer as well as Universal's sales objectives., Proficient with Keynote, PowerPoint and Excel., Strong presentation skills with proven ability to present to buyers, licensees, and senior management., Strong organization and communication skills., 20-30% travel required.", "preferred": "BA/BS degree or equivalent work experience., Experience working with retailers"}, "skills": ["Retail", "Sales", "Business Development", "Marketing", "Product Development", "Presentation Skills", "Communication Skills", "Analytical Skills", "Problem Solving", "Research", "Keynote", "PowerPoint", "Excel"], "postedDate": "2 days ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3984496763"}