{"jobTitle": "Sales Associate - Mar Vista", "company": {"name": "Pet Food Express", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.30/hr - 17.80/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Candidates for consideration must be willing and able to travel to and work from the Beverly Hills location on W Olympic Blvd for training until the opening of our Mar Vista location.<br/><br/><strong>About Pet Food Express<br/><br/></strong>Pet Food Express is the best place to shop for pet supplies – and it’s all because of the people who work here. Our employees are passionate pet people who care deeply about our community. We offer gold star customer service and expert advice for even the toughest pet problems. Sound like you? Join us.<br/><br/>Our Sales Consultants are the heart of our business. They do a little bit of everything – and matter a lot. They work the cash registers, stock shelves, answer customer questions, and generally make sure every customer has an enjoyable, friendly, and informative shopping experience.<br/><br/><strong>Responsibilities<br/><br/></strong>On an average day, Sales Consultants:<br/><br/>Engage<br/><br/><ul><li>Actively approach and engage with our two-legged and four-legged customers</li><li>Answer customer questions about specific products</li><li>Use the Pet Food Express Whole Life Approach to provide tailored recommendations that help customers live their best possible lives with their pets<br/><br/></li></ul>Learn<br/><br/><ul><li>Participate in daily training and continuous educational programs to enhance your product knowledge and sales skills</li><li>Stay up to date about new products and the pet community<br/><br/></li></ul>Operate<br/><br/><ul><li>Operate the cash register in a friendly and efficient manner</li><li>Unload shipments and stock the store – this includes lots of heavy lifting. Successful candidates will be prepared for and embrace the physical requirements of the job</li><li>Clean and maintain the store by participating regularly in tasks such as sweeping, mopping, and cleaning pet messes as needed<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>We value potential over experience. If you’re unsure about whether you meet our qualifications, just apply</li><li>A passion for pets and people</li><li>A warm and welcoming personality and a genuine desire to provide excellent customer service to all customers</li><li>Sales and/or pet experience is a plus</li><li>Eagerness to learn and willingness to participate in daily educational activities</li><li>Ability to work a flexible schedule to meet the needs of the business; will require weekends, evenings, and holidays</li><li>Must be able to lift, move and carry up to 50 pounds while using the appropriate lifting techniques and following all safety rules</li><li>Ability to climb and balance using a ladder and/or step stool</li><li>Ability to continuously stand, walk, bend, stretch and engage in repetitive motions throughout shift<br/><br/></li></ul><strong>PFE Perks<br/><br/></strong><ul><li>Grow with us: Many potential career paths and options for advancement within the company</li><li>Continued Learning: A focus on your development and leadership training. Investment in your pet and product knowledge, you'll never see pets the same way! </li><li>Generous in-store employee discount that extends to your family</li><li>Be Healthy: PT employees have access to health care tools and services through New Benefits. FT employees are eligible for Health coverage, FSA options, dental, and vision insurance</li><li>Plan for the future: 401k with employer match</li><li>Get Rewarded: Employee referral bonuses</li><li>Bring your well-behaved pet to work</li><li>Opportunities to make an impact in the community through the Pet Food Express Pet Fair, in-store fundraisers and adoption events benefiting local rescue and shelter partners, and more!<br/><br/></li></ul>The salary range for this position is expected to be $17.30 - $17.80 per hour. Pet Food Express determines starting salary based on many factors, including but not limited to, local market rate, the qualified pool of candidates, internal compensation practices, a candidate’s actual skills and experience, and budget constraints.<br/><br/><em>This job summary is intended to describe the general nature and level of work associates/leaders assigned to this job perform. It is not intended to include all duties and responsibilities.<br/><br/></em><em>Pet Food Express is an Equal Opportunity Employer and does not discriminate against employees or applicants based on race, sexual orientation, gender identity, or any other characteristics protected by applicable law. This applies to all Pet Food Express activities, including, but not limited to, recruitment, hiring, compensation, assignment, training, promotion, performance evaluation, discipline and discharge. Pet Food Express also provides reasonable accommodation of religion and disability in accordance with applicable law. We celebrate diversity and are committed to creating an inclusive environment for all employees. Pet Food Express is a place where everyone can learn and grow. However you identify and whatever your background, please apply if this is a role that would make you excited to come to work every day.<br/><br/></em><em>For applicants in our San Francisco, or Los Angeles locations: Pursuant to the San Francisco Fair Chance Ordinance, as well as the Los Angeles Fair Chance Initiative for Hiring, we will consider for employment, qualified applicants with arrest and conviction records in a manner consistent with the law.<br/><br/></em>Powered by JazzHR<br/><br/>2t9hkZq3ya", "responsibilities": "On an average day, Sales Consultants:<br/><br/>Engage<br/><br/><ul><li>Actively approach and engage with our two-legged and four-legged customers</li><li>Answer customer questions about specific products</li><li>Use the Pet Food Express Whole Life Approach to provide tailored recommendations that help customers live their best possible lives with their pets<br/><br/></li></ul>Learn<br/><br/><ul><li>Participate in daily training and continuous educational programs to enhance your product knowledge and sales skills</li><li>Stay up to date about new products and the pet community<br/><br/></li></ul>Operate<br/><br/><ul><li>Operate the cash register in a friendly and efficient manner</li><li>Unload shipments and stock the store – this includes lots of heavy lifting. Successful candidates will be prepared for and embrace the physical requirements of the job</li><li>Clean and maintain the store by participating regularly in tasks such as sweeping, mopping, and cleaning pet messes as needed<br/><br/></li></ul>", "qualifications": {"required": "We value potential over experience. If you’re unsure about whether you meet our qualifications, just apply\nA passion for pets and people\nA warm and welcoming personality and a genuine desire to provide excellent customer service to all customers\nSales and/or pet experience is a plus\nEagerness to learn and willingness to participate in daily educational activities\nAbility to work a flexible schedule to meet the needs of the business; will require weekends, evenings, and holidays\nMust be able to lift, move and carry up to 50 pounds while using the appropriate lifting techniques and following all safety rules\nAbility to climb and balance using a ladder and/or step stool\nAbility to continuously stand, walk, bend, stretch and engage in repetitive motions throughout shift", "preferred": ""}, "skills": [], "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "Grow with us: Many potential career paths and options for advancement within the company\nContinued Learning: A focus on your development and leadership training. Investment in your pet and product knowledge, you'll never see pets the same way! \nGenerous in-store employee discount that extends to your family\nBe Healthy: PT employees have access to health care tools and services through New Benefits. FT employees are eligible for Health coverage, FSA options, dental, and vision insurance\nPlan for the future: 401k with employer match\nGet Rewarded: Employee referral bonuses\nBring your well-behaved pet to work\nOpportunities to make an impact in the community through the Pet Food Express Pet Fair, in-store fundraisers and adoption events benefiting local rescue and shelter partners, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984764362"}