{"jobTitle": "Sr. Manager, Product Marketing - Color & Promotional Catergories", "company": {"name": "Haus Labs By Lady Gaga", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$115,000 - $125,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "Job Title: Sr. Manager, Product Marketing - Color & Promotional<br/><br/>Salary: $115,000 - $125,000<br/><br/>Department: Marketing<br/><br/>Manager: Sr. Director, Marketing<br/><br/>Who We Are<br/><br/>Launched by Lady Gaga, Haus Labs is a vegan and cruelty-free cosmetics brand with a mission of spreading kindness, bravery, and creativity. Filled with versatile products that encourage self-expression, this collection boasts high-impact eye makeup, lipsticks, highlighters, and more. Regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics, we want everyone to feel welcome. We are committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/><strong>Overview<br/><br/></strong>The Sr. Manager, Product Marketing will be responsible for the strategy, execution, and performance of the Color &amp; Promotional categories in alignment with brand objectives. This role will report into the Sr Director of Marketing and work collaboratively with key stakeholders across business functions including product development, creative, marketing, sales, finance, operations, digital and growth in order to bring the category strategy to life and achieve short-term and long-term objectives for the category. This position requires a data-driven mindset, strategic and creative thinking, and outstanding communication and analytical skills.<br/><br/>What You’ll Do<br/><br/><ul><li>Develop marketing strategy and plans to deliver on category short and long-terms sales and profitability targets</li><li>Monitor, track, and report on product category KPIs and performance metrics, responding in real-time to create data-driven action plans to support the category</li><li>Develop deep product expertise in order to act as the subject matter expert for the category, in this case the Color &amp; Promotional landscape in beauty</li><li>Partner with cross-functional teams to ensure all have a clear, strong understanding of the core product positioning and strategy in order to bring activations to life across all customer touchpoints</li><li>Partner with Product Marketing to inform the innovation development pipeline for this category</li><li>Continuously review and evaluate assortment performance and productivity to recommend optimizations and opportunities within the product line</li><li>Partner with Sales &amp; Digital to support development of annual sales forecast for category across channels</li><li>Partner with Operations to ensure adequate inventory levels are maintained to support category strategy and growth plans and to identify opportunities for excess category inventory</li><li>Conduct market and consumer research to find insights and opportunities to improve category offering</li><li>Demonstrate a firm understanding of the constantly evolving Color &amp; Beauty landscape and competitive environment to inform planning and execution<br/><br/></li></ul>What We Are Looking For<br/><br/><ul><li>Highly refined communication and presentation skills</li><li>Strong analytical and problem-solving skills</li><li>Ability to thrive and pivot in a dynamic, fast-paced work environment</li><li>Strong understanding of business financials and KPIs</li><li>Results oriented, self-starter with demonstrated ability to influence key stakeholders and drive complex projects end-to-end</li><li>BS or BA in Marketing, Management, or other relevant area</li><li>5+ years of experience in Brand Management, Marketing, or other relevant experience</li><li>A passion for the beauty industry is a plus</li><li>Ability to use a computer keyboard and computer screen for extended periods</li><li>Must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future<br/><br/></li></ul>What We Expect<br/><br/><ul><li>At Haus Labs, how you communicate is as important as what you communicate. We are seeking driven team players with strong communication skills and enthusiasm for collaboration</li><li>You’re a self-starter who possesses an entrepreneurial spirit</li><li>You thrive in a fast-paced, agile environment</li><li>You are a team player who approaches solutions from a place of curiosity and positivity</li><li>We are seeking HAUSmates who welcome constructive criticism and have an impeccable attention to detail<br/><br/></li></ul>Our Pillars<br/><br/>ART: We are a creative collective that believes art has the power to shape the future.<br/><br/>SCIENCE: We unlock innovation using science and artistry.<br/><br/>KINDNESS: We are a collective community: universal, inclusive and non-binary.<br/><br/>What We Offer<br/><br/><ul><li>Medical, Dental, &amp; Vision Insurance</li><li>Paid, Equal Parental Leave for Birth, Non-Birth and Adoptive Parents</li><li>Flexible time-off policies</li><li>Cell phone stipend</li><li>401(k)</li><li>Equity</li><li>Life Insurance</li><li>FunHaus Event<br/><br/></li></ul>Everyone is welcome in our HAUS<br/><br/>“Baby, you were born this way.” Regardless of age, education, ethnicity, gender, sexual<br/><br/>orientation, or any personal characteristics, we want everyone to feel welcome. We are<br/><br/>committed to building a diverse and inclusive, equal opportunity workplace.<br/><br/>Powered by JazzHR<br/><br/>AGtWORb0R9", "responsibilities": "The Sr. Manager, Product Marketing will be responsible for the strategy, execution, and performance of the Color &amp; Promotional categories in alignment with brand objectives. This role will report into the Sr Director of Marketing and work collaboratively with key stakeholders across business functions including product development, creative, marketing, sales, finance, operations, digital and growth in order to bring the category strategy to life and achieve short-term and long-term objectives for the category. This position requires a data-driven mindset, strategic and creative thinking, and outstanding communication and analytical skills.", "qualifications": {"required": "Highly refined communication and presentation skills, Strong analytical and problem-solving skills, Ability to thrive and pivot in a dynamic, fast-paced work environment, Strong understanding of business financials and KPIs, Results oriented, self-starter with demonstrated ability to influence key stakeholders and drive complex projects end-to-end, BS or BA in Marketing, Management, or other relevant area, 5+ years of experience in Brand Management, Marketing, or other relevant experience, A passion for the beauty industry is a plus, Ability to use a computer keyboard and computer screen for extended periods, Must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future", "preferred": null}, "skills": ["Marketing", "Management", "Brand Management", "Communication", "Presentation Skills", "Analytical Skills", "Problem Solving", "Data-Driven", "Strategic Thinking", "Business Financials", "KPIs", "Sales", "Operations", "Digital Marketing", "Growth Marketing", "Product Development", "Creative", "Consumer Research", "Beauty Industry"], "postedDate": "4 weeks ago", "applicationDeadline": null, "benefits": "Medical, Dental, &amp; Vision Insurance, Paid, Equal Parental Leave for Birth, Non-Birth and Adoptive Parents, Flexible time-off policies, Cell phone stipend, 401(k), Equity, Life Insurance, FunHaus Event", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3984578981"}