{"jobTitle": "Junior Merchant Success Manager", "company": {"name": "SHOPLINE", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Business Development, Customer Service, and Administrative", "industry": "Technology, Information and Media", "description": "🫡 SHOPLINE’s Merchant Success team is growing!\n<br/>\nSHOPLINE is a leading e-commerce platform dedicated to empowering merchants to build and grow their online businesses. With a suite of user-friendly tools and innovative solutions, we enable entrepreneurs to create stunning online stores, manage inventory, process payments, and reach customers worldwide. Our mission is to provide merchants with the support and resources they need to succeed in the competitive e-commerce landscape.\n<br/>\nWe are seeking a dynamic and results-driven Junior Merchant Success Manager to join our new SHOPLINE US team. The Junior Merchant Success Manager will be the enabler for cultivating strong relationships with our merchants, understanding their needs and challenges, and providing personalized support to help them achieve their business goals.\n<br/>\n**What you will be doing:**\n<ul><li>Executing the Merchant Success strategy for SHOPLINE US</li><li>Follow the protocol to provide excellent onboarding experience for new merchants</li><li>Maintain growth of assigned merchants and develop effective client retention strategies</li><li>Deliver quality customer services support</li><li>Sustain solid business relationships with key accounts and with people at all levels</li><li>Collect feedback on Shopline's core product from accounts, while understanding the reasons and use cases of every feedback</li><li>Liaise with internal departments on product promotion/marketing activities</li><li>Lead and perform ad-hoc projects as assigned by the Management</li><li>Answer incoming questions via live chat, email and phone calls, handle customer inquiries</li><li>Be a strong advocate for our brand and product, interact and build a community of loyal customers</li></ul>\n<br/>\n**Who you are:**\n<ul><li>At least 1 year working in the e-commerce industry</li><li>Bachelor Degree Holder or equivalent</li><li>Knowledge of e-commerce and startup culture</li><li>100% customer-focused attitude</li><li>Self-starter and good team player</li><li>Excellent internal/external communication skills</li><li>Demonstrate excellent business judgment</li><li>Comfortable with uncertainty and situations where there is no “right answer”</li><li>Strong time management and expectation management skills</li></ul>\n<br/>\n**Nice to have:**\n<ul><li>E-commerce marketing experiences</li><li>Hands on experiences with e-commerce solutions or platforms</li><li>Project and account management skills</li><li>Experience in any customer facing role or at E-commerce platforms is preferred</li><li>Adept to CRM tools i.e. Salesforce, Intercom and Zen-desk</li></ul>\n<br/>\n<br/>\n**The usual process**\n<ul><li>TA team representative</li><li>Hiring Manager round</li><li>Stakeholder round(s)</li><li>Pitch round</li></ul>\n<br/>\n**What our perks look like**\n💸 5% matching for 401K\n🍎100% covered medical, dental, vision insurance for employee\n🌴Time off and vacation of 15 PTO days & 10 sick days\n🏠 Flexible work arrangement and Phone & Internet allowance\n<br/>\n**About SHOPLINE**\nFounded in 2013, SHOPLINE is one of Asia’s largest and fastest growing omnichannel ecommerce SaaS solution providers. The SHOPLINE platform is pioneering a rich ecosystem of streamlined technologies, resources and partners that empowers merchants to succeed.\n<br/>\nYou are joining the team at a critical stage of our global expansion! This year, SHOPLINE established their first US office in the heart of LA marking a new milestone to disrupt the e-commerce industry. The GTM team is rapidly growing. We strive to stay true to our start-up roots and spearhead new ideas everyday to build an awesome work culture.\n<br/>\nWe firmly believe that growing a team with ambitious and fearless individuals will allow us to unlock our product’s full potential.", "postedDate": "3 weeks ago", "skills": ["E-commerce", "Customer Service", "CRM", "Salesforce", "Intercom", "Zen-desk", "Onboarding", "Account Management", "Project Management", "Business Development", "Marketing", "Communication", "Time Management", "Expectation Management", "Startup Culture"], "url": "https://www.linkedin.com/jobs/view/3984488554"}