{"jobTitle": "Warehouse Associate Full Time", "company": {"name": "Fashion Nova", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion", "description": "<strong>Position Summary<br/><br/></strong>FNL Warehouse Associates contribute to the success of FNL by ensuring that our customers receive a complete and accurate order, on time, and in excellent condition.<br/><br/>Warehouse Associates may be assigned a specific department and role by a Supervisor and/or have a primary work location. It is to be expected that roles and department assignments will fluctuate as dictated by business need, and no one single location is permanent. All Warehouse Associates should expect cross-training in more than one department or one location.<br/><br/><strong>Essential Functions<br/><br/></strong>Work shifts can include early starts, late finishes, and weekends. During busy periods, mandatory overtime is required.<br/><br/>Depending on the assigned work location, the Warehouse Associate is responsible for performing all manner of order fulfillment functions regardless of prior assignment. Departments include Picking, Packing, Shipping, and Receiving. Other duties may be assigned at the Supervisors’ discretion.<br/><br/><strong>All Departments:<br/><br/></strong><ul><li>At FNL we communicate all policies and standards of conduct either in writing, verbally, or both. It is the responsibility of all individuals working at the DC to follow these policies regardless of communication method. </li><li>FNL takes safety seriously. Everyone is expected to comply with safety rules and regulations as communicated in policies or by members of the safety team. </li><li>FNL Warehouse Associates are responsible for their own work area. Associates must maintain a neat and organized work area, as well as replenish consumable supplies. </li><li> Inspect all equipment or devices for damage prior to use, report all findings to management.<br/><br/></li></ul><strong>Picking Dept:<br/><br/></strong><ul><li>Utilize warehouse management technology (Radio Frequency Scanner/Android Device) to systematically perform an order picking session. </li><li>Inspect picking equipment (RF Device/Pick Cart/Tote) prior to use, report damaged equipment to department leadership. </li><li> Maneuver a pick cart/tote through the Pick mod and pull items from inventory locations as directed by the warehouse management system. </li><li>Apply special packaging material on select items and apply a unique license plate number sticker (ILPN) for each pick transaction. </li><li>Release full totes on the motorized conveyor system. </li><li>Ability to achieve hourly performance goals without jeopardizing standards of safety, quality, or transactional accuracy. <br/><br/></li></ul><strong>Packing Dept:<br/><br/></strong><ul><li>Pack and label completed items for shipment and storage. </li><li>Perform a superficial quality inspection on all items prior to packing an order. </li><li>Use a PC and tethered barcode scanner to systemically conduct the packing function and fulfill a customer order. </li><li>Physically pack customer orders into appropriate packaging/container sizes (Polybag/box). </li><li>Skilled in using a variety of packing methods and techniques to prevent in-transit loss or damage.</li><li>Ability to achieve hourly performance goals without jeopardizing standards safety, quality, or transactional accuracy. </li><li>Perform the Speed Match function by scanning the ILPN barcode of every item dropped on your station and reconciling items pertaining to the same customer order until the order is complete and ready to pack. </li><li>Perform the Induction function by placing individual items on a motorized sorter tray. </li><li>When assigned to a running task, you may be required to operate hand trucks to distribute consumable packaging supplies, troubleshoot/ enable sorter stoppages and assist induction platforms. <br/><br/></li></ul><strong>Shipping Dept:<br/><br/></strong><ul><li>Skilled in completing manual and computerized forms and shipping documents. </li><li>Handle lifting equipment (Manual Pallet Jack, Hand Truck/Dolly Carts) to move product in the warehouse. </li><li>Enable and disable ship lanes when adding or removing pallets from a shipping lane. Use RF devices to systemically load inventory/packages into an outbound load.</li><li>Preserve load integrity by ensuring load accuracy. </li><li>Physically load packages/pallets into trailers or floor load when applicable. </li><li>Reprint damaged shipping label. </li><li>Re-introduce/induct packages into the shipping sorter. </li><li>Follow shipping dock Safety procedures and protocols. </li><li>Handle wooden pallets and assemble Gaylord boxes as needed. <br/><br/></li></ul><strong>Receiving/</strong><strong>Returns</strong><strong> Dept:<br/><br/></strong><ul><li>Sort items by carton into a location (Staging/Bulk Storage/Pick Mod) across 2 DC’s (RIM/SFS).</li><li>Examine and inspect containers, perform quality inspection on materials, and products in order to ensure that packing specifications are met. </li><li>Operate machinery/heavy lifting equipment (electric pallet jack/Sit-down forklift/CP Lift) if certified by FNL and instructed by management. </li><li>Assemble, line, and pad cartons, crates, and containers. </li><li>Perform added value services (re-tagging/labeling/folding items/applying or removing sensor). </li><li>Receive, label, count and itemize units to be received. <br/><br/></li></ul><strong>Education Requirements<br/><br/></strong><ul><li>High School Diploma/GED </li><li>Experience in a logistics and/or warehouse environment or related field is preferred </li><li>Ability to follow verbal and written instructions, bilingual is a plus <br/><br/></li></ul><strong>Knowledge &amp; Skill Requirements<br/><br/></strong><ul><li>Skilled in picking and packaging a variety of materials </li><li>Hands-on experience in operating a pick truck to pull inventory from the warehouse</li><li>Proven record of placing, arranging, marking, sealing, and tagging items </li><li>Proficient reading skills and identifying the accurate parts for fulfilling customer orders</li><li>Knowledge of packing procedures, techniques, tools, and necessary warehouse procedures</li><li>Hands-on experience in counting and sorting various product items</li><li>Thorough understanding of assembling finished products into boxes or containers for shipping <br/><br/></li></ul><strong>Working Conditions<br/><br/></strong>The working conditions described here are representative of those an employee encounters while performing the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>Must be physically capable of working in conditions normally associated with a merchandise warehouse distribution center.<br/><br/>In specific assignments, an employee may occasionally work near moving equipment and have an increased risk of exposure to toxic or caustic chemicals, biological hazards, airborne fumes, outdoor weather conditions, and loud, prolonged noise.<br/><br/><strong>Physical Requirements<br/><br/></strong><ul><li>Able to stand or walk for long periods (8-12 hours)</li><li>Able to reach and extend both arms in full length</li><li>Able to bend, twist, reach, and lift to 50 pounds</li><li>Able to work with both hands</li><li>Ability to be on feet for a long period without restrictions</li><li>Ability to ascend and descend staircases without restriction</li><li>Able to work in aisles or floors other than ground level.</li><li>Ability to adapt in an ever-changing environment<br/><br/></li></ul><strong>Disclaimer<br/><br/></strong>This position description is not designed to cover or contain a comprehensive or exhaustive listing of activities, duties, or responsibilities that are required of the employee for this position. The listed activities, duties, or responsibilities may change at any time with or without notice.<br/><br/>Employees are expected to regularly review their position descriptions and ensure that they are executing the essential functions at a level that meets or exceeds the expected performance outcomes. By signing below, you acknowledge receipt of this Job description and confirm that you have reviewed this document with your manager or supervisor.", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984818110"}