{"jobTitle": "Data Scientist, Go-To-Market", "company": {"name": "Whatnot", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$180,000 - $275,000", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet", "description": "Whatnot is the largest livestream shopping platform in North America and Europe to buy, sell, and discover the things you love. We’re building the future of ecommerce, bringing together community, shopping and entertainment. We are committed to our values, and as a remote co-located team, we operate out of hubs within the US, UK, Ireland, Poland, and Germany today.<br/><br/>We’re innovating in the fast-paced world of live auctions from fashion, beauty, electronics to collectibles like trading cards, comic books, and even live plants. Whatnot has something for everyone.<br/><br/>And, we’re growing. Whatnot has been one of the fastest growing marketplaces and we’re hiring forward-thinking problem solvers across all functional areas.<br/><br/><strong>💻 Role<br/><br/></strong>We’re looking for an experienced Data Scientist to support our Go To Market teams as they expand across product categories and geographic markets. This individual will partner with the groups responsible for scaling Whatnot’s account management and marketing efforts, looking across multiple factors including supply growth, marketing, logistics, and more.<br/><br/>You will:<br/><br/><ul><li>Partner closely with GTM and International leads to find improvements &amp; opportunities using data science methodologies and tools.</li><li>Inform the effectiveness of GTM motions to adapt Whatnot’s strategy and tactics for new markets.</li><li>Build actionable KPIs, create production-quality dashboards and notebooks to convey insights for strategy and operations</li><li>Improve roadmaps through analysis of marketplace, user behavior, and industry trends.</li><li>Define and advance company best practices within a data-informed culture.<br/><br/></li></ul>Team members in this role are required to be within commuting distance of our San Francisco, Los Angeles, Seattle, or New York City hubs.<br/><br/><strong>👋 About You<br/><br/></strong>We are looking for intellectually curious, highly motivated individuals to be foundational members of our Data team! You will partner with our Category Expansion, Marketing, and Strategy &amp; Operations teams to identify critical goals for the business, develop a deep understanding of them, and design scalable solutions enabled by both analysis and self-serve methodologies.<br/><br/>You should have strong critical thinking and analytical skills, excellent communication abilities, and a knack for working across teams in a fast-paced environment. The ideal candidate will be adept in navigating the data stack and able to support initiatives in all facets from metric creation to analytics engineering to forecasting, ideally with previous experience in GTM, marketing, or other high-growth startup environments.<br/><br/>In addition to 5+ years of experience in the Data field, you should have:<br/><br/><ul><li>3+ years of experience in Data Analytics &amp; Science supporting go to market, sales operations, marketing, or consulting/operations roles.</li><li>Bachelor’s degree in Computer Science, Economics, Statistics, or a related field, or equivalent work experience. </li><li>Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaborators.</li><li>Industry experience with proven ability to apply scientific methods to solve real-world problems on large scale data.</li><li>Ability to lead initiatives across multiple product areas and communicate findings with leadership and product teams.</li><li>Comfortability with data warehouses and big data technologies such as Redshift, Snowflake, Big Query, Presto/Trino, Athena, Spark, DBT.</li><li>Expert in using SQL for data analysis, reporting, and dashboarding.</li><li>Experience with a scripting language such as Python or R.</li><li>Aptitude in time series forecasting, goal setting, and cohort analysis.</li><li>Aptitude in industry standard sales team tooling such as Salesforce, Hubspot</li><li>Firm grasp of visualization tools, interactive and self-serving, such as business intelligence and notebooks.<br/><br/></li></ul><strong>💰Compensation<br/><br/></strong>$180,000 - $275,000/year + benefits + equity<br/><br/>The salary range may be inclusive of several levels that would be applicable to the position. Final salary will be based on a number of factors including, level, relevant prior experience, skills and expertise. This range is only inclusive of base salary, not benefits (more details below) or equity.<br/><br/><strong>🎁 Benefits<br/><br/></strong><ul><li>Flexible Time off Policy and Company-wide Holidays (including a spring and winter break)</li><li>Health Insurance options including Medical, Dental, Vision</li><li>Work From Home Support</li><ul><li>$1,000 home office setup allowance</li><li>$150 monthly allowance for cell phone and internet</li></ul><li>Care benefits</li><ul><li>$450 monthly allowance on food</li><li>$500 monthly allowance for wellness</li><li>$5,000 annual allowance towards Childcare</li><li>$20,000 lifetime benefit for family planning, such as adoption or fertility expenses</li></ul><li>Retirement; 401k offering for Traditional and Roth accounts in the US (employer match up to 4% of base salary) and Pension plans internationally</li><li>Parental Leave</li><ul><li>16 weeks of paid parental leave + one month gradual return to work *company leave allowances run concurrently with country leave requirements which take precedence.<br/></li></ul></ul><strong>💛 EOE<br/><br/></strong>Whatnot is proud to be an Equal Opportunity Employer. We value diversity, and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, parental status, disability status, or any other status protected by local law. We believe that our work is better and our company culture is improved when we encourage, support, and respect the different skills and experiences represented within our workforce.", "responsibilities": "You will:<br/><br/><ul><li>Partner closely with GTM and International leads to find improvements &amp; opportunities using data science methodologies and tools.</li><li>Inform the effectiveness of GTM motions to adapt Whatnot’s strategy and tactics for new markets.</li><li>Build actionable KPIs, create production-quality dashboards and notebooks to convey insights for strategy and operations</li><li>Improve roadmaps through analysis of marketplace, user behavior, and industry trends.</li><li>Define and advance company best practices within a data-informed culture.<br/><br/></li></ul>", "qualifications": {"required": "In addition to 5+ years of experience in the Data field, you should have:<br/><br/><ul><li>3+ years of experience in Data Analytics &amp; Science supporting go to market, sales operations, marketing, or consulting/operations roles.</li><li>Bachelor’s degree in Computer Science, Economics, Statistics, or a related field, or equivalent work experience. </li><li>Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaborators.</li><li>Industry experience with proven ability to apply scientific methods to solve real-world problems on large scale data.</li><li>Ability to lead initiatives across multiple product areas and communicate findings with leadership and product teams.</li><li>Comfortability with data warehouses and big data technologies such as Redshift, Snowflake, Big Query, Presto/Trino, Athena, Spark, DBT.</li><li>Expert in using SQL for data analysis, reporting, and dashboarding.</li><li>Experience with a scripting language such as Python or R.</li><li>Aptitude in time series forecasting, goal setting, and cohort analysis.</li><li>Aptitude in industry standard sales team tooling such as Salesforce, Hubspot</li><li>Firm grasp of visualization tools, interactive and self-serving, such as business intelligence and notebooks.<br/><br/></li></ul>", "preferred": null}, "skills": ["Data Science", "SQL", "Python", "R", "Redshift", "Snowflake", "Big Query", "Presto/Trino", "Athena", "Spark", "DBT", "Salesforce", "Hubspot", "Business Intelligence", "Data Analytics", "Go To Market", "Sales Operations", "Marketing", "Consulting", "Operations"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Flexible Time off Policy and Company-wide Holidays (including a spring and winter break)\nHealth Insurance options including Medical, Dental, Vision\nWork From Home Support\n$1,000 home office setup allowance\n$150 monthly allowance for cell phone and internet\nCare benefits\n$450 monthly allowance on food\n$500 monthly allowance for wellness\n$5,000 annual allowance towards Childcare\n$20,000 lifetime benefit for family planning, such as adoption or fertility expenses\nRetirement; 401k offering for Traditional and Roth accounts in the US (employer match up to 4% of base salary) and Pension plans internationally\nParental Leave\n16 weeks of paid parental leave + one month gradual return to work *company leave allowances run concurrently with country leave requirements which take precedence.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3984496801"}