{"jobTitle": "Head of Talent Acquisition", "company": {"name": "Anduril Industries", "location": "Costa Mesa, CA", "industry": "Defense and Space Manufacturing"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "204,000—306,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Defense and Space Manufacturing", "description": "Anduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.<br/><br/>As the Head of Talent Acquisition, you will champion Anduril’s global Talent Acquisition efforts with full responsibility for the function. Reporting to the Head of People, you will serve as a member of the People & Culture leadership team and define, as well as execute, Anduril’s global Talent Acquisition strategy. You will be accountable for recruiting, developing, and retaining a world-class Talent Acquisition team and ensuring an exceptional candidate experience. Beyond leading the team, you will partner closely with Anduril’s leadership to translate business objectives into talent acquisition imperatives and advise them on talent acquisition best practices.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Oversee the entirety of Anduril’s global Talent Acquisition function, including: executive recruiting, corporate staffing, high-volume recruiting, programmatic recruiting, employer branding, talent intelligence, and coordination </li><li>Develop and execute, in partnership with the business and People leaders, the company’s Talent Acquisition strategy</li><li>Lead the company through a period of significant scale where unorthodox tactics are required to achieve hiring targets</li><li>Recruit, retain, and develop a talented team in a fast-moving and ambiguous environment</li><li>Help define, in partnership with business and People leadership, Anduril’s DEI&amp;B objectives and provide the requisite TA execution to achieve them</li><li>Collaborate closely with People business partners on best practices, areas of improvement, and overall knowledge sharing</li><li>Partner with the People Operations team to refine the Talent Acquisition “tech stack” and processes that force-multiply recruiter impact, facilitate hiring manager engagement, and deliver an exceptional candidate experience</li><li>Facilitate a data-driven yet qualitatively informed approach to communicating Talent Acquisition decisions and performance</li><li>Tightly integrate into the annual business planning and strategic workforce planning processes to understand Anduril’s hiring objectives and proactively build the Talent Acquisition capabilities to achieve them</li><li>Responsibly manage the Talent Acquisition budget and headcount</li><li>Support special projects from a Talent Acquisition perspective e.g. M&amp;A, contract staff-ups, etc. as needed <br/><br/></li></ul><strong>What You've Done<br/><br/></strong><ul><li>10+ years of experience leading talent acquisition teams in ambiguous, high-intensity businesses undergoing scale (above 5k EEs preferred)</li><li>Deep understanding of the talent needs of technology-driven (ideally hardware and software) product companies</li><li>Track record of success leading programmatic recruiting efforts, including university recruitment, DEI&amp;B, and event-driven programs</li><li>Dynamic range to build and execute Talent Acquisition strategy and dig into the details to triage roadblocks alongside the team </li><li>Proven builder of highly efficient and scalable Talent Acquisition teams with experience managing managers</li><li>Understanding of and a network in the defense industry preferred</li><li>Experience managing the Talent Acquisition process for government contractors (OFCCP) preferred</li><li>Prior leadership of the overall Talent Acquisition function preferred</li><li>Previous success as a global Talent Acquisition leader preferred</li><li>Cross-functional experience in other areas of the People function preferred</li><li>Leadership through IPO or other major-scale events preferred<br/><br/></li></ul>US Salary Range<br/><br/>$204,000—$306,000 USD<br/><br/><strong>Benefits<br/><br/></strong>The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.<br/><br/>Anduril is an equal-opportunity employer committed to creating a diverse and inclusive workplace. The Anduril team is made up of incredibly talented and unique individuals, who together are disrupting industry norms by creating new paths towards the future of defense technology. All qualified applicants will be treated with respect and receive equal consideration for employment without regard to race, color, creed, religion, sex, gender identity, sexual orientation, national origin, disability, uniform service, Veteran status, age, or any other protected characteristic per federal, state, or local law, including those with a criminal history, in a manner consistent with the requirements of applicable state and local laws, including the CA Fair Chance Initiative for Hiring Ordinance. We actively encourage members of recognized minorities, women, Veterans, and those with disabilities to apply, and we work to create a welcoming and supportive environment for all applicants throughout the interview process. If you are someone passionate about working on problems that have a real-world impact, we'd love to hear from you!<br/><br/>To view Anduril's candidate data privacy policy, please visit https://anduril.com/applicant-privacy-notice/.", "responsibilities": "As the Head of Talent Acquisition, you will champion Anduril’s global Talent Acquisition efforts with full responsibility for the function. Reporting to the Head of People, you will serve as a member of the People & Culture leadership team and define, as well as execute, Anduril’s global Talent Acquisition strategy. You will be accountable for recruiting, developing, and retaining a world-class Talent Acquisition team and ensuring an exceptional candidate experience. Beyond leading the team, you will partner closely with Anduril’s leadership to translate business objectives into talent acquisition imperatives and advise them on talent acquisition best practices.", "qualifications": {"required": "10+ years of experience leading talent acquisition teams in ambiguous, high-intensity businesses undergoing scale (above 5k EEs preferred)\nDeep understanding of the talent needs of technology-driven (ideally hardware and software) product companies\nTrack record of success leading programmatic recruiting efforts, including university recruitment, DEI&amp;B, and event-driven programs\nDynamic range to build and execute Talent Acquisition strategy and dig into the details to triage roadblocks alongside the team \nProven builder of highly efficient and scalable Talent Acquisition teams with experience managing managers\nUnderstanding of and a network in the defense industry preferred\nExperience managing the Talent Acquisition process for government contractors (OFCCP) preferred\nPrior leadership of the overall Talent Acquisition function preferred\nPrevious success as a global Talent Acquisition leader preferred\nCross-functional experience in other areas of the People function preferred\nLeadership through IPO or other major-scale events preferred", "preferred": "Understanding of and a network in the defense industry preferred\nExperience managing the Talent Acquisition process for government contractors (OFCCP) preferred\nPrior leadership of the overall Talent Acquisition function preferred\nPrevious success as a global Talent Acquisition leader preferred\nCross-functional experience in other areas of the People function preferred\nLeadership through IPO or other major-scale events preferred"}, "skills": [], "postedDate": "1 week ago", "benefits": "The salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: <br/><br/><ul><li>Platinum Healthcare Benefits: For U.S. roles, we offer top tier platinum coverage (medical, dental, vision) that are 100% covered by Anduril for you and 90% covered for your dependents.</li><ul><li>For UK roles, Private Medical Insurance (PMI): Anduril will cover the full cost of the insurance premium for an employee and dependents.</li><li>For AUS roles, Private health plan through Bupa: Coverage is fully subsidized by Anduril.</li></ul><li>Basic Life/AD&amp;D and long-term disability insurance 100% covered by Anduril, plus the option to purchase additional life insurance for you and your dependents.</li><li>Extremely generous company holiday calendar including a holiday hiatus in December, and highly competitive PTO plans.</li><li>16 weeks of paid Caregiver &amp; Wellness Leave to care for a family member, bond with your baby, or tend to your own medical condition.</li><li>Family Planning &amp; Parenting Support: Fertility (eg, IVF, preservation), adoption, and gestational carrier coverage with additional benefits and resources to provide support from planning to parenting.</li><li>Mental Health Resources: We provide free mental health resources 24/7 including therapy, life coaching, and more. Additional work-life services, such as free legal and financial support, available to you as well.</li><li>A professional development stipend is available to all Andurilians.</li><li>Daily Meals and Provisions: For many of our offices this means breakfast, lunch and fully stocked micro-kitchens.</li><li>Company-funded commuter benefits available based on your region.</li><li>Relocation assistance (depending on role eligibility).</li><li>401(k) retirement savings plan - both a traditional and Roth 401(k). (US roles only)<br/></li></ul>The recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3984726114"}