{"jobTitle": "Design Operations Project Manager", "company": {"name": "STIIIZY", "industry": "Manufacturing and Retail", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Management", "industry": "Manufacturing and Retail", "description": "We are seeking a highly skilled and detail-oriented Design Manager to join our team. As the Design Manager, you will play a crucial role in ensuring the smooth and efficient functioning of our design department. You will be responsible for streamlining processes, managing resources, and optimizing productivity within the design team. If you have a strong background in design operations and a passion for driving efficiency and excellence, we want to hear from you.", "responsibilities": "Develop and implement best practices and standard operating procedures for the design team. Oversee and improve design workflows and processes, ensuring timely and high-quality deliverables. Manage project schedules, ensuring deadlines are met and resources are allocated effectively. Collaborate closely with cross-functional teams, including product management, engineering, and marketing, to align design goals and deliverables with overall business objectives. Evaluate and implement design tools and software to enhance productivity and efficiency. Foster a culture of collaboration and continuous improvement within the design team. Lead and mentor a team of designers, providing guidance and support to help them succeed and grow in their roles. Supervises and motivates direct reporting staff by assigning duties to each employee, explaining how these duties are to be done and communicating how the successful performance of those duties will be measured. Monitors and corrects performance issues in real time, and appropriately documents issues and corrective actions. Leads and directs the work of other employees and has authority for personnel decisions. Manages strategic hiring, people scheduling, performance management, corrective actions, and separations. Must be able to work at least 40 hours a week. Flexible availability to work both day and night shifts plus some weekends. Perform other duties as needed in support of business objectives assigned by supervisor.", "qualifications": {"required": "Must be at least 21 years of age.", "preferred": "Bachelor's degree in design, visual communications, preferred but not required. Minimum 4 years of experience in related field. Proven experience in design operations or a similar role."}, "skills": ["Strong understanding of design principles and processes.", "Exceptional organizational and project management skills.", "Proficiency in design software, such as Adobe Creative Suite.", "Excellent communication and interpersonal skills.", "Ability to work well under pressure and meet tight deadlines.", "A proactive and solutions-oriented mindset."], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "All employees are provided competitive compensation and paid training. We offer a range of benefits packages based on employee eligibility, including: Paid Vacation Time, Paid Sick Leave, Paid Holidays, Parental Leave. Health, Dental, and Vision Insurance. Employee Assistance Program. 401k with generous employer match. Life Insurance. Employee discounts on products and services.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3984582798"}