{"jobTitle": "Vice President, ECommerce", "company": {"name": "Red Bull", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "215K to 255K", "currency": "USD"}, "jobFunction": "Sales", "industry": "Food and Beverage Services", "description": "This position's work location can be flexible within the continental United States. The purpose of the eCommerce sales team is to oversee the strategy of our online business across Brick & Click (B&C), Pure Play and Delivery retailers/services. Reporting to the SVP, Emerging Channels, you will be charged with US strategic leadership of our go-to-market plan and execution of said plan. You will lead our eCommerce sales team and their efforts across eCommerce by creating goals, both quantitative (revenue, volume, profit and share) and qualitative (online presence, top retail relationships and training). You will work US brand and advertising leadership for aligned online brand execution. You will also work with global ecommerce leadership for aligned US plan and global leadership to support total global strategy development.<br/><br/><strong>All the responsibilities we'll trust you with:<br/><br/></strong><strong>BUSINESS PLANNING<br/><br/></strong>Develop long-term strategies and programs for the eCommerce channel according to organizational goals, retailer goals, and consumer/industry trends Build organizational understanding and adoption of ecommerce plans and expectations across our sales leadership team and entire accounts organization. Lead the annual business planning process for eCommerce by establishing plans to meet important goals. Manage budget and Joint Business Plan (JBP) of Pure Play & Delivery customers (e.g. Amazon). Develop strategy for B&amp;C and responsible for key account integration and activation across small and large format. Aggregate and analyze large amounts of complex data quickly and distill that data into clear, viable action plans Allocate resources where the investment has the highest strategic payback Monitor market trends and maintain data on competition Build upon the eCommerce strategy by identifying new revenue streams<br/><br/><strong>PURE PLAY AND DELIVERY CUSTOMERS<br/><br/></strong>Deliver volume and share targets within established budget of all Pure Play &amp; Delivery customers (e.g. Amazon, Instacart, GoPuff etc) Lead account manager team and Key accounts field leadership to achieve our goals. Set clear direction and develop the team through both qualitative and quantitative feedback Develop business relationships with customer’s senior management by adding value through expertise and strategic partnerships<br/><br/><strong>LEADERSHIP<br/><br/></strong>Ensure career development for entire team through focus of specific and direct feedback Spend balanced time with team in the office and in the field to implement our eCommerce priorities Lead the team to develop thought-leading programs and insights that impact national strategy<br/><br/><strong>PARTNERSHIPS<br/><br/></strong>Partner with (Global) HQ counterparts to ensure consistency of strategy and global excellence in programs Accountable performance leader of ecommerce contributors across operations (3), Advertising (3), brand (2), shopper marketing (2), Shopper Insights (1), Category Insights (2), Trade finance (2) Work with Red Bull Key Account leadership to upskill eCommerce knowledge and ensure business plan goals align with our eCommerce and Key Account strategies Work in partnership with small and large format leadership for a comprehensive understanding of the two channels and priorities Manage external partnerships and vendor performance which include 2 advertising agencies, 2 business insights vendors, 2 content consolidators, and 1 content agency Responsible for discovery, vetting, and onboarding new partners to lead category execution<br/><br/><strong>BUSINESS REVIEWS<br/><br/></strong>Responsible for eCommerce sales and share reporting suite to measure the impact of programs on performance. Establish direction for quarterly business reviews to measure progress against sales and financial targets and provide competitive analysis. Define post-campaign analysis of all program activity to evaluate effectiveness and improve investment opportunities. Share examples of Red Bull activities to differentiate vs. competition.<br/><br/><strong>Your areas of knowledge and expertise that matter most for this role:<br/><br/></strong><ul><li>10+ years of eCommerce account management experience, with experience leading strategic planning across teams and Brick &amp; Click</li><li>Experience in beverage, CPG (Consumer Packaged Goods), or FMCG (Fast Moving Consumer Goods) industries</li><li>Negotiation experience</li><li>Experience working with Digital Advertising Agencies</li><li>Experience using multiple data sources to draw relevant insights.</li><li>Bachelor's degree or equivalent work experience</li><li>Must be fluent in English, additional language skills an advantage<br/><br/></li></ul>The base salary range for this position is $215K to $255K<br/><br/>Actual salary offers may vary based on work experience.<br/><br/>The base pay range is subject to change and may be modified in the future.<br/><br/>Our current Benefits include:<br/><br/>Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO &amp; Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement<br/><br/>(Benefits listed may vary depending on the nature of your employment and/or work location)<br/><br/>Red Bull North America, Inc. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law. We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.", "postedDate": "5 days ago", "skills": ["eCommerce", "Strategic Planning", "Beverage", "CPG", "FMCG", "Negotiation", "Digital Advertising", "Data Analysis", "English"], "url": "https://www.linkedin.com/jobs/view/3984974035"}