{"jobTitle": "Site Operations and Merchandising Manager", "company": {"name": "True Classic", "industry": "Retail Apparel and Fashion", "size": "51-200 employees", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Salary depends on experience", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "We are seeking an exceptional Site Operations and Merchandising Manager to oversee the execution of campaigns, promotions, product launches and merchandising on TrueClassic.com. In this role you will own how products are placed and positioned on the website, product bundling into packs, and item setup. The ideal candidate will have a strong background in Shopify and a deep understanding of the apparel industry.", "responsibilities": "Lead and mentor team of site merchandisers responsible for item setup and bundle creation, providing guidance and support in day-to-day operations. Monitor inventory levels and work with the planning team to ensure best-selling and core styles are fully stocked. Prepare backup bundles for best-selling packs. Develop and execute site merchandising strategies to optimize the customer journey and increase conversions. Utilize data-driven insights and analytics to monitor traffic, customer behavior, and product sales trends. Create and optimize product listing pages (category and collection pages) with ideal sorts using data-driven insights and automated merchandising tools. Conduct A/B testing to identify the most effective merchandising strategies and improve conversion rates. Oversee site maintenance, ensuring excellent customer experience and troubleshooting issues related to merchandising setup. Implement and manage promotions, seasonal campaigns, and special collection pages. Work closely with other ecommerce teams including website development, digital product, and UX/UI design. Collaborate with cross-functional teams including marketing, creative, and product development to align site merchandising with overall brand strategy.", "qualifications": {"required": "3+ years of experience in e-commerce merchandising, site operations, or digital retail management. Extensive knowledge of Shopify platform and its capabilities. Ability to learn merchandising apps quickly and configure them. High attention to detail and accuracy in managing product information and inventory levels. Strong understanding of the apparel industry, including trends, seasonality, and consumer behavior. Proven track record of driving sales growth and improving key performance metrics in an e-commerce environment.", "preferred": "Experience with A/B testing and conversion rate optimization techniques. Familiarity with SEO best practices for e-commerce. Knowledge of email marketing strategies and their impact on site merchandising. Passion for ecommerce and a keen interest in men’s fashion and apparel."}, "skills": ["Slack", "Asana", "Excel", "PowerPoint", "Google Analytics"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Unlimited Sick Days & PTO, Company paid medical, dental, and vision PPO insurance (Anthem Gold PPO), 401k plan with 3% company match, Monthly $200 stipend for home office expenses, Free $1,000 worth of True Classic merchandise every year, Free Employee Assistance Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984874275"}