{"jobTitle": "Digital / Content Marketing Manager", "company": {"name": "Solomon Page", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "size": "N/A", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "N/A", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "$48-53", "currency": "USD"}, "jobFunction": "Art/Creative and Marketing", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "description": "Our client is looking to fill the role of Digital / Content Marketing Manager. The Digital / Content Marketing Manager will lead the editorial strategy for brand and franchise campaigns, ensuring alignment with brand standards and strategic objectives. This role requires a dynamic and innovative thinker who can develop audience-first content goals and creative, manage agency partners, and collaborate with cross-functional teams to enhance digital brand strategy. The ideal candidate will be a digital expert with a strong understanding of current trends and platform updates, capable of providing on-the-ground social capture and event coverage as needed. This position will be hybrid and based out of the Glendale office.", "responsibilities": "Lead the editorial strategy for brand and franchise campaigns. Develop and implement audience-first content goals and creative. Develop creative concepts in support of enterprise initiatives. Build a monthly editorial calendar, ensuring that priorities and brand goals are reflected in the content plans. Collaborate with internal and external teams through the lifecycle of content development, from strategy, positioning, content ideation, concepting, scripting, production, routing, to final execution and delivery of approved assets across all channels domestically for amplification and support. Stay abreast of digital trends and platform updates to inform strategy and execution. Assist with live content coverage and execution for talent press junkets, content shoots, and marketing events as needed. Manage agency partners in content development, ensuring alignment with brand standards and strategic objectives. Handle partner support requests and provide consultation on partner creative. Work with cross-functional partners to source and develop creative in alignment with the digital brand strategy. Serve as an internal thought partner and digital expert representing the global entertainment brand. Participate in refining systems and operations for the Social Team. Foster a work culture that values inclusivity, collaboration, creativity, and problem-solving. Manage a direct report and serve as an internal lead for professionals, ranging from experienced to early-career individuals, including experienced individual contributors. Act as an influential team leader for more junior team members in terms of presentation, planning, operations, and organizational awareness. Participate in quarterly planning and professional development workshops to enhance skills and growth. Maintain documentation of incremental workload and resource needs to proactively address bandwidth concerns. Provide real-time updates to the team leader to manage impact. Frame and contribute to project team meetings, establish agendas, and provide strategic recommendations to drive growth and address complex situations effectively.", "qualifications": {"required": "Minimum 3+ years of experience in social/digital marketing, ideally working in a big brand setting. Outstanding project management, communication, and organizational skills. Top of the line passion, appreciation, and knowledge of global entertainment brands, films, characters, shorts, TV series, and theme parks presence. Invested in developing creative, social-first ideas that drive meaningful cultural impact and resonance with fans. Ability to manage multiple projects and creative ideas on tight deadlines in a fast-paced environment. Superior knowledge of social platforms (TikTok, Instagram, Twitter, Facebook, YouTube) and native products, plus invested interest in exploring new spaces. Up to date with the latest trends and platform updates and able to use those to inform strategy. Excellent writing and copy-editing skills with the ability to translate traditional marketing content into brand-relevant conversations. Passion for storytelling, listening to what the community has to say, and providing memorable and/or award-winning experiences in the social space. Knack for finding creative solutions to challenges and using data to drive decision-making. Team player with a strong work ethic and high level of confidentiality. Strong attention to detail and ability to use sound judgment as it relates to brand safety. Polished in presentation and communication. Able to be nimble and adapt quickly to new technologies and processes. Perpetual learner’s attitude, always looking for ways to improve processes and learn and grow. Passion for creating diverse, equitable, and inclusive content. Experience in Airtable, Sprinklr publishing and reporting, Google Workspace, Slack, Zoom, Photography, Videography, and Photoshop. Bachelor’s Degree in Communications, Business, Marketing, Film, and/or related field or equivalent years of industry experience.", "preferred": "N/A"}, "skills": ["Digital Marketing", "Content Strategy", "Social Media Management", "Project Management", "Creative Development", "Audience Engagement", "Brand Strategy", "Communication Skills", "Team Leadership", "Trend Analysis"], "postedDate": "3 weeks ago", "applicationDeadline": "N/A", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3984455710"}