{"jobTitle": "Senior Account Manager, Large Customer Sales", "company": {"name": "Google", "location": "Los Angeles, CA", "industry": "Information Services and Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "101,000.00/yr - 147,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>Chicago, IL, USA; Detroit, MI, USA; Cambridge, MA, USA; New York, NY, USA; Los Angeles, CA, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>5 years of experience in digital advertising, consultative sales, digital media sales, business development, online media environment, or digital marketing role.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Master's degree in a business related field.</li><li>3 years of experience managing digital marketing and advertising campaigns and relationships with customers or agencies.</li><li>Experience in customer-facing consulting or business. </li><li>Experience optimizing and troubleshooting products or services. </li><li>Experience with Google Ads, Display and Video 360, Search Ads 360, Youtube or similar digital advertising campaigns and platforms.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.<br/><br/>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.<br/><br/>The US base salary range for this full-time position is $101,000-$147,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Build and manage relationships with clients, and develop an understanding of their business challenges, marketing objectives, and success metrics.</li><li>Work proactively and cooperatively with internal and external stakeholders to ensure workflows and projects are completed on time to a high standard.</li><li>Plan for, and achieve, business growth targets, through the presentation of Google advertising products/solutions that will help clients to meet their marketing objectives.</li><li>Develop forward thinking, data-driven analyses and consultative recommendations that align with customer goals, and quantify high-impact opportunities with clear recommendations to present to customers.</li><li>Build an in-depth knowledge of how Google Advertising products work and can be used to help meet a wide range of marketing objectives. <br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Build and manage relationships with clients, and develop an understanding of their business challenges, marketing objectives, and success metrics.</li><li>Work proactively and cooperatively with internal and external stakeholders to ensure workflows and projects are completed on time to a high standard.</li><li>Plan for, and achieve, business growth targets, through the presentation of Google advertising products/solutions that will help clients to meet their marketing objectives.</li><li>Develop forward thinking, data-driven analyses and consultative recommendations that align with customer goals, and quantify high-impact opportunities with clear recommendations to present to customers.</li><li>Build an in-depth knowledge of how Google Advertising products work and can be used to help meet a wide range of marketing objectives. <br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 5 years of experience in digital advertising, consultative sales, digital media sales, business development, online media environment, or digital marketing role.", "preferred": "Master's degree in a business related field. 3 years of experience managing digital marketing and advertising campaigns and relationships with customers or agencies. Experience in customer-facing consulting or business.  Experience optimizing and troubleshooting products or services.  Experience with Google Ads, Display and Video 360, Search Ads 360, Youtube or similar digital advertising campaigns and platforms."}, "skills": ["Digital Advertising", "Consultative Sales", "Digital Media Sales", "Business Development", "Online Media", "Digital Marketing", "Google Ads", "Display and Video 360", "Search Ads 360", "Youtube", "Relationship Building", "Client Service", "Research", "Market Analysis", "Strategic Planning"], "postedDate": "3 days ago", "benefits": "bonus + equity + benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984473687"}