{"jobTitle": "Curatorial Assistant", "company": {"name": "Academy Museum of Motion Pictures", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "28.85", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Museums, Historical Sites, and Zoos", "description": "This position is responsible for assisting curatorial team members on all aspects of exhibitions and for performing administrative duties in relation to exhibition projects. As an integral member of the curatorial team, the Curatorial Assistant also collaborates closely with creative, design, registration, conservation, planning, and publication departments on the execution of an exhibition. They may also conduct primary research and writing support as assigned by the project’s lead curator and offer additional support for digital projects relating to an exhibition. They may contribute texts for didactics and AV elements in support of the curatorial project team and perform assignments in relation to catalogues and other online formats.<br/><br/>This position is represented by a union.<br/><br/><strong>Duties and Responsibilities</strong><strong>:<br/><br/></strong><ul><li>Supports disseminating knowledge on the Academy collection and programs and film history in general through mission critical exhibitions, publications, lectures, symposia, gallery talks, and other innovative public programs.</li><li>Works with lead curatorial team members to provide research and administrative support in all aspects of content creation for larger and smaller-scale exhibition projects including digital projects.</li><li>Assists with developing exhibition narrative, checklists, securing loans, writing didactics, creating AV components on projects of any scale, and assists the lead curator in the installation phase of an exhibition project.</li><li>Lends administrative support for exhibition projects, performs data entry, and assists the lead curator in formulating the budget, participates in fundraising efforts and writing grant requests.</li><li>Collaborates closely with creative and design teams on implementing exhibitions.</li><li>May take the lead on curating a clearly defined small-scale project under the guidance and supervision of a Curator.</li><li>Supports curatorial staff on various aspects of publication work.</li><li>May assist a guest curator on exhibition projects.</li><li>May work with Assistant, Associate or Senior Curator or Guest Curator on exhibitions organized by another institution traveling to the Academy Museum. Works closely with other Academy Museum staff members regarding shipping, layout, and installation of works.</li><li>As assigned, responsible for conducting research in film and cultural history related to potential exhibitions, publications, lectures, conferences, symposia, and interpretive public programs.</li><li>Maintains contacts with filmmakers, scholars, curators, critics, authors, and other colleagues in the field and culture in general.</li><li>Assists the project lead with outreach and interpretive programs with Education and Public Program teams and works with them on innovative interpretive programs geared for a wide range of audiences, including adults, universities, schools, families, and children.</li><li>As assigned, works with Development staff to cultivate individuals, corporations, and foundations that may donate funds and/or goods and services in support of the museum’s programs.</li><li>Performs other duties as required.<br/><br/></li></ul><strong>Position Requirements<br/><br/></strong><strong>Qualifications and Requirements</strong><strong>:<br/><br/></strong><ul><li>BA in film studies, museum studies, art history or related field, or equivalent professional experience.</li><li>2+ years museum experience.</li><li>Demonstrated knowledge of film history.</li><li>Excellent organizational, prioritization, and time management skills; ability to execute multiple, high-priority projects, with a keen attention to detail and excellent follow through.</li><li>Highly developed written and verbal communications skills geared toward a wide audience.</li><li>Great ability for collaborative working methods.<br/><br/></li></ul><strong>If hired, we require all employees to be vaccinated against COVID-19, unless a medical or religious accommodation is needed as determined on a case-by-case basis. <br/><br/></strong>The expected salary for this role is $28.85 per hour. The actual base pay offered will be determined by factors such as experience, skills, training, location, certifications, education, and other factors permitted by law. Decisions will be made on a case-by-case basis.<br/><br/><strong>Our Benefits:<br/><br/></strong><ul><li>Comprehensive medical, dental, and vision.</li><li>PTO and Sick Time</li><li>401(k)<br/><br/></li></ul>@museumLI<br/><br/>About the Organization The Academy of Motion Picture Arts and Sciences is a global community of more than 10,000 of the most accomplished artists, filmmakers and executives working in film. In addition to celebrating and recognizing excellence in filmmaking through the Oscars, the Academy supports a wide range of initiatives to promote the art and science of the movies, including public programming, educational outreach and the Academy Museum of Motion Pictures.<br/><br/>EOE Statement The Academy is committed to equal opportunity in employment and to creating and valuing diversity in its workforce. Maintaining a diverse workforce is important to the Academy. The Academy enforces a strict policy that prohibits discrimination in hiring, training, compensation, promotion, transfer, or termination, whether on the basis of race, color, national origin, religion, sex, disability, age, veteran status, sexual orientation or genetic information. This includes a workplace that is free of all forms of harassment. Also, to help foster diversity, the Academy uses programs that ensure fairness of opportunity, pay, and growth to all applicants and employees. Every employee of the Academy is required to follow this policy and to preserve the Academy’s commitment to diversity.", "responsibilities": "Supports disseminating knowledge on the Academy collection and programs and film history in general through mission critical exhibitions, publications, lectures, symposia, gallery talks, and other innovative public programs.\nWorks with lead curatorial team members to provide research and administrative support in all aspects of content creation for larger and smaller-scale exhibition projects including digital projects.\nAssists with developing exhibition narrative, checklists, securing loans, writing didactics, creating AV components on projects of any scale, and assists the lead curator in the installation phase of an exhibition project.\nLends administrative support for exhibition projects, performs data entry, and assists the lead curator in formulating the budget, participates in fundraising efforts and writing grant requests.\nCollaborates closely with creative and design teams on implementing exhibitions.\nMay take the lead on curating a clearly defined small-scale project under the guidance and supervision of a Curator.\nSupports curatorial staff on various aspects of publication work.\nMay assist a guest curator on exhibition projects.\nMay work with Assistant, Associate or Senior Curator or Guest Curator on exhibitions organized by another institution traveling to the Academy Museum. Works closely with other Academy Museum staff members regarding shipping, layout, and installation of works.\nAs assigned, responsible for conducting research in film and cultural history related to potential exhibitions, publications, lectures, conferences, symposia, and interpretive public programs.\nMaintains contacts with filmmakers, scholars, curators, critics, authors, and other colleagues in the field and culture in general.\nAssists the project lead with outreach and interpretive programs with Education and Public Program teams and works with them on innovative interpretive programs geared for a wide range of audiences, including adults, universities, schools, families, and children.\nAs assigned, works with Development staff to cultivate individuals, corporations, and foundations that may donate funds and/or goods and services in support of the museum’s programs.\nPerforms other duties as required.", "qualifications": {"required": "BA in film studies, museum studies, art history or related field, or equivalent professional experience.\n2+ years museum experience.\nDemonstrated knowledge of film history.\nExcellent organizational, prioritization, and time management skills; ability to execute multiple, high-priority projects, with a keen attention to detail and excellent follow through.\nHighly developed written and verbal communications skills geared toward a wide audience.\nGreat ability for collaborative working methods."}, "skills": [], "postedDate": "1 week ago", "benefits": "Comprehensive medical, dental, and vision.\nPTO and Sick Time\n401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984242946"}