{"jobTitle": "Salesperson - BMW", "company": {"name": "McKenna Cars", "industry": "Motor Vehicle Manufacturing", "size": "Not specified", "location": "Norwalk, CA"}, "location": "Norwalk, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Motor Vehicle Manufacturing", "description": "JOIN THE ELITE! We have more leads than we can handle! Since 1956 McKenna Cars has been serving our loyal Southern California customers. We offer a team environment, great benefits and ongoing support for our associates. We will also consider highly qualified candidates that have experience in similar makes as ours on an individual basis. WOMEN ARE HIGHLY ENCOURAGED TO APPLY! Highly competitive commission and bonus plan designed to reward top sales people. Be part of a team and not just a corporate employee with a number. We look internally and train our future supervisors and managers. GENERAL SUMMARY McKenna BMW is seeking automotive sales people with experience to provide our guests a “World Class” guest service experience both in our beautiful showroom, and in a modern, online sales environment. We provide an exciting training regimen that helps gain knowledge and know everything there is to know about the brand. We offer tremendous opportunity for growth. Great fun energetic working environment. Generous compensation. Principal Duties And Responsibilities Are you ready to take it to the next level? If you are a go getter, motivated, self-starter, then we want to talk to you. Why McKenna? Family owned stable business (for over 60 years!) Great brands that are aspirational and popular…. ok and fun too!! Over 9 different dealerships located in South Bay, LA and Orange County Advancement opportunities – we have a long history of promoting from within at all levels and all departments. What we offer! One of the industry’s best introductory sales pay plan with exceptional upside for high performers. We will train you on our brands cutting edge technology and we’ll help you to become an industry expert. Opportunity to work with and learn from seasoned managers and sales people in a supportive and high energy environment. Growth opportunities, a career path and development. Competitive benefits – Medical, Dental, Vision, 401(k), Life, Accident, Pet Insurance and more! Requirements (your Part Of The Deal) A great attitude! Come to work every day ready to learn, grow and sell cars Comfortable interacting with people, both in person and online Confidence in cultivating and building new customer relationships Passion for success Excellent communication skills DMV Sales License (this can be obtained post-hire) We promote a workplace of integrity and respect. We care about our customers and It shows!", "responsibilities": "Provide guests a 'World Class' guest service experience both in the showroom and online. Engage with customers to build relationships and drive sales. Participate in training and development programs to enhance product knowledge and sales skills.", "qualifications": {"required": "A great attitude, willingness to learn, and strong communication skills.", "preferred": "DMV Sales License (can be obtained post-hire)"}, "skills": ["Sales", "Customer Service", "Communication", "Teamwork", "Motivation"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental, Vision, 401(k), Life, Accident, Pet Insurance and more!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3984787739"}