{"jobTitle": "Ocean Import Operation Specialist", "company": {"name": "Pan Pacific Express", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "19.00 to 23.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "We are an International Freight Forwarder/NVO/Logistic service provider with a global presence. Established in 1977, we have grown to include a full line of transportation and logistics services including air, ocean, trucking, warehousing, custom brokering, and supply chain management. With numerous branch offices in Asia and the United States and a comprehensive global agency network, our business activities continue to expand and grow worldwide. Responsibilities and Duties Need an ocean import operation specialized in FCL &amp; LCL coordination, quotation, and operation. Maintain existing accounts. Assist/follow up oversea inquiries. Provide operation support such as data entry, arrange truck delivery on deadline<br/><br/>Qualifications and Skills: This is an office job. Applicants must be organized and enthusiastic. Superior communication, organization, and follow-through skills essential. Excellent verbal and written communication skills, interpersonal skills, and time-management skills. Ability to multi-task and problem-solve. Comprehensive training will be provided. Opportunity for advancement and attractive compensation package. Prefer previous experience in freight forwarder/Logistics industry.<br/><br/>Company has 401K &amp; pay Medical benefit include Dental/Vision, paid Sick leave and paid time off Must have legal documents to work in United States. No OPT Sponsor.<br/><br/>Pay from $19.00 to $ 23.00 per hour based on experience<br/><br/>recblid js9kp3getyyh465ddjt0fvlcrmuuqg", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984399760"}