{"jobTitle": "Client Sales Coordinator/Apartment Host", "company": {"name": "Accor", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Hospitality", "description": "<strong>Company Description<br/><br/></strong>The Hoxton, Downtown LA is in a neighborhood that has seen a major revival over the last few years, with some of the city’s best restaurants, shops and bars. The Hoxton, Downtown LA offers 174 rooms designed by Ennismore Design Studio, a ground floor restaurant with exciting culinary partners, along with The Hoxton’s first rooftop pool with restaurant and amazing views over Broadway, the historic commercial, theatre and cinema district and one of the oldest streets in the city.<br/><br/><strong>Job Description<br/><br/></strong>We are looking for a Client Sales Coordinator/Apartment Host to join our Sales team at The Hoxton, Downtown LA. We are an ambitious company in need of someone who will take on this great role of supporting the success of our dynamic property through assisting in sales administration, Apartment hosting, and ensuring clients have a stellar Hox experience. The role reports to the Director of Sales.<br/><br/><strong>What You’ll Do…<br/><br/></strong><ul><li>Create company and contact profiles within Opera and company CRM</li><li>Create flyers and update sales collateral</li><li>Help cover the phones and support client tours and entertainment</li><li>Qualify groups leads and relay details thoroughly to the Director of Sales</li><li>Manage sales reservation requests</li><li>Assist VIP guest room allocation and amenities</li><li>Process Housekeeping and Maintenance work orders via Knowcross</li><li>Help maintain databases and assist with research</li><li>Order beverages, snacks and food items for The Apartment pantry</li><li>Order and maintain Apartment stationary stock</li><li>Manage and develop new and existing Sales and Apartment SOP's</li><li>Meet and Greet Apartment guests and be the on-site in-person contact for meetings</li><li>Ensure The Apartment is always show ready and presentable</li><li>Use Opera and ihotelier, and liaise with Travel Click to load rates</li><li>Achieve set goals and KPO's</li><li>Build ihotelier group booking links</li><li>Build and Maintain groups in Opera</li><li>Work with the Front Desk team on group check-ins, room drops and operational logistics</li><li>Build blocks in Opera, send proposals and contracts, create and close PM's</li><li>Create and distribute weekly M&amp;E and Sales Strat reports, BEO's, Group Memo's and Site Alerts</li><li>Process deposits, billing and invoices</li><li>Liaise with clients on final numbers, billing, logistics and rooming lists</li><li>Coordinate Commissions with the Finance team</li><li>Work with our R&amp;B partners on breakfast and lunch orders for groups and meetings guests.<br/><br/></li></ul><strong>What’s In It For You…<br/><br/></strong><ul><li>You’ll work for an organization committed to not just building new hotels but also a global organization.</li><li>The opportunity to challenge the norm and work in an environment that is both creative and rewarding.</li><li>The opportunity to be yourself and collaborate with other bright minds in a relaxed, innovative culture.</li><li>Opportunity to grow with an exciting business and be part of a team who are passionate about everything they do.</li><li>Receive a competitive package with opportunity for career development.</li><li>Excellent discounts across the entire Ennismore family for you and your nearest and dearest (even after you leave).<br/><br/></li></ul>The Hoxton, Downtown LA is an <em>equal opportunity </em>employer. All applicants will be considered for <em>employment </em>without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. True Facts.<br/><br/><strong>What’s next?<br/><br/></strong>Successful applicants will meet with the team to discuss their experience within the hospitality field. Further to this, the candidate will be expected to meet a member of the People team.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>You’re an Opera wiz.</li><li>You execute. You get things done.</li><li>You are scarily organized and neat</li><li>Ability to learn quickly and adapt to The Hoxton’s unique culture.</li><li>You’re a natural host and can make guests and team members feel at home in our hotel.</li><li>You take ownership of issues, solve problems and make effective decisions within a team.</li><li>You work positively and collaboratively to achieve the highest standards of delivery at work.</li><li>A balance between a methodical and process-driven approach and flexibility and creativity when it comes to meeting deadlines and finding solutions.</li><li>Passion for hospitality – whether that’s a drink, a meal, an event or a bed for the night.</li><li>You’re all about having a positive impact on the people you interact with, leaving them with a memorable experience.</li><li>Ability to work positively and collaboratively to achieve the highest standards of delivery at work.</li><li>You're humble and open to ideas. We leave our egos at the door and help get shit done.</li><li>You’re up for doing things differently and trying (almost) everything once.</li><li>You want to be part of a team that works hard, supports each other and has fun along the way.<br/><br/></li></ul>Additional Information<br/><br/>All your information will be kept confidential according to EEO guidelines.", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984726387"}