{"jobTitle": "Data Analyst", "company": {"name": "One Federal Solution", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Defense & Space", "description": "One Federal Solution seeks a talented and passionate Data Analyst to join our Los Angeles, CA team to support our Federal Government client. As a Data Analyst, you will be responsible for gathering, analyzing, and interpreting large datasets to uncover insights that will drive informed business decisions as follows:<br/><br/><ul><li>Establish/maintain physical and electronic files.</li><li>Provide organization and management of case files in physical and electronic formats.</li><li>Review data (completeness of information, proper execution).</li><li>Review, enter, and extract data from database.</li><li>Obtain additional information from other investigative agencies and databases.</li><li>Receive, suspense petitions, claims, and process requests.</li><li>Reconcile inconsistencies.</li><li>Gather information and organize investigative packages.</li><li>Verify case files and case tracking systems.</li><li>Conduct and reconcile reports.</li><li>Receive and distribute various types of documents, including court documents.</li><li>Assist lead analyst or official in obtaining/collecting all documents/information to complete case file.</li><li>Provide administrative information and assistance concerning cases to other investigative agencies, local law enforcement agencies, U.S. Attorney, other DOJ processing units, and higher headquarters.</li><li>Extract data from agency database for management and program reports.</li><li>Perform word processing relevant to case documentation.</li><li>Perform data entry relevant to case.<br/><br/></li></ul><strong>Qualifications &amp; Requirements<br/><br/></strong><ul><li>Undergraduate degree.</li><li>Ability to review and analyze data and information from multiple sources.</li><li>Ability to establish case/project files in both paper and electronic mediums.</li><li>Ability to enter and retrieve data from databases.</li><li>Ability to prepare and format management reports.</li><li>Ability to manipulate, transfer, compute, and print information.</li><li>Proficiency in using spreadsheet and word processing software.</li><li>Ability to create and manipulate spreadsheets.</li><li>Ability to prepare and correct reports and correspondence using word processing software.<br/><br/></li></ul><strong>Note</strong>: Parking is not provided or covered for this location.<br/><br/><strong>About One Federal Solution<br/><br/></strong>One Federal Solution (OFS) is an innovative Professional Services provider with over 17 years of experience supporting Defense and Civilian agencies. OFS specializes in Business Intelligence, Acquisition and Procurement, and other Professional Services. We are pioneers, builders, thought leaders, and pride ourselves in thinking outside the box to co-create with our customers, helping them achieve excellent enterprise wide outcomes. As a certified Service-Disabled Veteran-Owned Small Business (SDVOSB), OFS is committed to providing people who deliver high performance and excellence to our government partners.", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984144525"}