{"jobTitle": "Quality Manager", "company": {"name": "OSEA Malibu", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Join our fast growing beauty brand and become a fundamental member of our team. We are looking for a savvy, passionate Quality Manager in the Los Angeles, California area who is excited about quality, sustainability, and beauty! The Quality Manager is responsible for overseeing the quality assurance and control processes for skincare products manufactured by contract manufacturers. The ideal candidate will have a thorough understanding of the beauty industry's regulatory environment, including MoCRA and experience in QC/QA processes, and shares our commitment to wellness in both our products and work life balance. Our mission is to create effective, results-driven skincare that is safe for the planet and humankind.<br/><br/>Requirements<br/><br/>Regulatory Compliance and Standardization<br/><br/><ul><li>Continue developing and implementing standardized procedures and protocols to ensure consistent adherence to MoCRA regulations across all aspects of product quality, customer care, and contract manufacturing sites</li><li>Maintain strict adherence to health and safety guidelines, legal obligations, and regulatory requirements<br/><br/><br/></li></ul>Feedback, Customer Complaints and Issue Management <br/><br/><ul><li>Establish a structured feedback loop with Customer Care to gather insights on potential quality and compliance issues and address them proactively</li><li>Investigate complaints in collaboration with contract manufacturers</li><li>Review production and quality records to identify the root cause as needed</li><li>Implement corrective actions. <br/><br/><br/></li></ul>Product Development and Quality Assurance<br/><br/><ul><li>Collaborate with Product Development to ensure compliance with quality standards and regulatory requirements</li><li>Inspect final products to ensure they meet quality requirements, approving compliant products and rejecting defective ones</li><li>Analyze data to identify deviations from standards, implementing corrective actions as necessary<br/><br/><br/></li></ul>Vendor Qualification and Monitoring<br/><br/><ul><li>Develop and implement a vendor qualification process to ensure contract manufacturers meet quality standards and comply with MoCRA</li><li>Conduct initial and regular audits of contract manufacturers, assessing compliance with GMP, MoCRA, and other regulatory requirements</li><li>Oversee and maintain quality agreements with contract manufacturers, defining responsibilities and ensuring adherence to company and MoCRA guidelines</li><li>Maintain comprehensive records of all audits and assessments<br/><br/><br/></li></ul>Raw Material and Packaging Material Approval<br/><br/><ul><li>Review and approve specifications for raw materials and packaging materials, ensuring compliance with MoCRA</li><li>Require contract manufacturers to perform incoming material inspections and provide COAs for each batch</li><li>Conduct periodic audits of the contract manufacturer's inspection process and records</li><li>Perform independent testing of raw materials and packaging materials as needed<br/><br/><br/></li></ul>In-Process Quality Monitoring<br/><br/><ul><li>Review and approve in-process quality control procedures of contract manufacturers, ensuring MoCRA compliance</li><li>Require contract manufacturers to provide in-process test results and manage deviations</li><li>Conduct periodic audits of in-process control records and procedures</li><li>Implement corrective actions for any identified deviations<br/><br/><br/></li></ul>Finished Product Testing and Relea<br/><br/><ul><li>Approve finished product testing protocols provided by contract manufacturers, ensuring MoCRA compliance</li><li>Require contract manufacturers to perform finished product testing and provide CoAs for each batch</li><li>Conduct independent testing of finished products as needed</li><li>Review and approve batch records and COAs before product release<br/><br/><br/></li></ul>Stability Testing and Shelf Life Determination<br/><br/><ul><li>Develop stability testing protocols in collaboration with Product Development and contract manufacturers, ensuring MoCRA compliance</li><li>Require contract manufacturers to perform stability testing and provide interim and final reports</li><li>Review stability data periodically to assess product quality over time<br/><br/><br/></li></ul>Documentation and Internal Audits<br/><br/><ul><li>Manage and control all quality-related documents, ensuring compliance with MoCRA</li><li>Develop and implement an internal audit schedule, covering all operational areas, including contract manufacturers</li><li>Conduct audits and record observations, ensuring MoCRA compliance</li><li>Identify non-conformances and areas for improvement</li><li>Ensure implementation of corrective actions and report findings to senior management<br/><br/><br/></li></ul>Training and Competency<br/><br/><ul><li>Identify training needs for relevant employees, including Product Development, Operations, and Customer Care. </li><li>Develop and implement training plans, ensuring MoCRA compliance</li><li>Conduct training sessions, maintain training records, and update training materials regularly<br/><br/></li></ul>Qualifications: <br/><br/><ul><li>Minimum of 5 years in quality assurance within the skincare or cosmetics industry, with proven expertise in quality control, regulatory compliance, and product development</li><li>Strong analytical skills and attention to detail</li><li>Proficiency in Excel for data analysis, reporting, and quality management</li><li>Ability to manage multiple projects, meet deadlines, and handle contract manufacturers and audits</li><li>Excellent communication and interpersonal skills</li><li>Proficiency in quality management software and tools</li><li>In-depth knowledge of GMP, MoCRA, and other relevant regulatory requirements</li><li>Strong problem-solving skills with a proactive approach to continuous improvement</li><li>Familiarity with health, safety, and environmental regulations in the skincare industry</li><li>Occasional travel to contract manufacturers and audit sites</li><li>Excellent communication and interpersonal skills (oral, written, non-verbal, intuitive, psychic, et al)</li><li>Must be willing to fall in love with our products, meditate with our team, and have fun while we work!<br/><br/></li></ul>Compensation: <br/><br/>Base salary range: $90,000-$120,000 (The actual compensation will depend on a variety of job-related factors which may include work experience and skill level).", "responsibilities": "The Quality Manager is responsible for overseeing the quality assurance and control processes for skincare products manufactured by contract manufacturers.", "qualifications": {"required": "Minimum of 5 years in quality assurance within the skincare or cosmetics industry, with proven expertise in quality control, regulatory compliance, and product development\nStrong analytical skills and attention to detail\nProficiency in Excel for data analysis, reporting, and quality management\nAbility to manage multiple projects, meet deadlines, and handle contract manufacturers and audits\nExcellent communication and interpersonal skills\nProficiency in quality management software and tools\nIn-depth knowledge of GMP, MoCRA, and other relevant regulatory requirements\nStrong problem-solving skills with a proactive approach to continuous improvement\nFamiliarity with health, safety, and environmental regulations in the skincare industry\nOccasional travel to contract manufacturers and audit sites\nExcellent communication and interpersonal skills (oral, written, non-verbal, intuitive, psychic, et al)\nMust be willing to fall in love with our products, meditate with our team, and have fun while we work!", "preferred": ""}, "skills": ["Quality Assurance", "Quality Control", "Regulatory Compliance", "Product Development", "Excel", "GMP", "MoCRA", "Problem Solving", "Communication", "Interpersonal Skills"], "postedDate": "1 month ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984182635"}