{"jobTitle": "Coordinator, Digital Marketing", "company": {"name": "Sony Music Entertainment", "location": "Culver City, CA", "industry": "Musicians"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Musicians", "description": "About Sony Music Entertainment<br/><br/>At Sony Music Entertainment, we fuel the creative journey. We’ve played a pioneering role in music history, from the first-ever music label to the invention of the flat disc record. We’ve nurtured some of music’s most iconic artists and produced some of the most influential recordings of all time.<br/><br/>Today, we work in more than 70 countries, supporting a diverse roster of international superstars, developing and independent artists, and visionary creators. From our position at the intersection of music, entertainment, and technology, we bring imagination and expertise to the newest products and platforms, embrace new business models, employ breakthrough tools, and provide powerful insights that help our artists push creative boundaries and reach new audiences. In everything we do, we’re committed to artistic integrity, transparency, and entrepreneurship.<br/><br/>Sony Music Entertainment is a member of the Sony family of global companies.<br/><br/>As a Coordinator, Digital Marketing you will be responsible for providing support to the Head of Digital Marketing and extended team as well as playing a key role in helping to ensure the efficient day-to-day operations of the Marketing Department at Epic Records. This is a unique opportunity to grow your skills and build your career in a fast-paced, hyper creative environment while influencing how music reaches listeners around the world.<br/><br/>What you'll do:<br/><br/>\n<ul><li>Schedule meetings, arrange travel and provide administrative support for the Head of Digital Marketing and back-up support for other members of the department as needed.</li><li>Update weekly status reports and sales information on behalf of Epic artists.</li><li>Collaborate with digital project managers to execute highly impactful, customized campaigns.</li><li>Build &amp; maintain artist email marketing campaigns as well as e-mail lists, databases, files and other assets for the department.</li><li>Support community development and engagement initiatives across all direct to fan channels including Instagram, Snapchat, Tik Tok, YouTube, etc.</li><li>Assist in planning/implementation of content initiatives and work with digital project managers to execute highly impactful, customized campaigns.</li><li>Coordinate and manage budgets, promotional trips, travel, work orders and marketing plans for artists.</li><li>Consistently use Adobe suites (asset design, photo/video editing), and a variety of other computer systems including Mediabase, BDS, and RPS, Keynote, Canva and Mailchimp.<br/><br/></li></ul>Who you are:<br/><br/>\n<ul><li>Passionate music fan with previous administrative experience in marketing or a related field.</li><li>A thoughtful, organized and results-oriented professional.</li><li>An excellent communicator and enthusiastic collaborator who works well with team members, external partners, and senior management.<br/><br/></li></ul>What we give you:<br/><br/>\n<ul><li>You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day </li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best </li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching </li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans </li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community. </li><li>The space to accelerate progress, positively disrupt, and create what happens next </li><li>Time off for a winter recess<br/><br/></li></ul><em>Sony Music is committed to providing equal employment opportunity for all persons regardless of age, disability, national origin, race, color, religion, sex, sexual orientation, gender, gender identity or expression, pregnancy, veteran or military status, marital and civil partnership/union status, alienage or citizenship status, creed, genetic information or any other status protected by applicable federal, state, or local law.<br/><br/></em><em>California based applicants have certain rights under California law. Please see our California Recruitment Privacy Policy for more details.<br/><br/></em>The anticipated annual base salary does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>California Pay Range<br/><br/>$48,000—$48,000 USD", "responsibilities": "As a Coordinator, Digital Marketing you will be responsible for providing support to the Head of Digital Marketing and extended team as well as playing a key role in helping to ensure the efficient day-to-day operations of the Marketing Department at Epic Records. This is a unique opportunity to grow your skills and build your career in a fast-paced, hyper creative environment while influencing how music reaches listeners around the world.<br/><br/>What you'll do:<br/><br/>\n<ul><li>Schedule meetings, arrange travel and provide administrative support for the Head of Digital Marketing and back-up support for other members of the department as needed.</li><li>Update weekly status reports and sales information on behalf of Epic artists.</li><li>Collaborate with digital project managers to execute highly impactful, customized campaigns.</li><li>Build &amp; maintain artist email marketing campaigns as well as e-mail lists, databases, files and other assets for the department.</li><li>Support community development and engagement initiatives across all direct to fan channels including Instagram, Snapchat, Tik Tok, YouTube, etc.</li><li>Assist in planning/implementation of content initiatives and work with digital project managers to execute highly impactful, customized campaigns.</li><li>Coordinate and manage budgets, promotional trips, travel, work orders and marketing plans for artists.</li><li>Consistently use Adobe suites (asset design, photo/video editing), and a variety of other computer systems including Mediabase, BDS, and RPS, Keynote, Canva and Mailchimp.<br/><br/></li></ul>", "qualifications": {"required": "Passionate music fan with previous administrative experience in marketing or a related field.\nA thoughtful, organized and results-oriented professional.\nAn excellent communicator and enthusiastic collaborator who works well with team members, external partners, and senior management.<br/><br/>"}, "skills": ["Adobe Suites", "Mediabase", "BDS", "RPS", "Keynote", "Canva", "Mailchimp", "Marketing", "Administrative", "Communication", "Collaboration"], "postedDate": "2 days ago", "benefits": "You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day \nA modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best \nAn attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching \nVoluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans \nInvestment in your professional growth and development enabling you to thrive in our vibrant community. \nThe space to accelerate progress, positively disrupt, and create what happens next \nTime off for a winter recess<br/><br/>", "remoteWork": null, "salary": {"amount": "48,000—48,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3984804957"}