{"jobTitle": "Owner's Rep Construction Associate Project Manager", "company": {"name": "WayUp", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$80,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Real Estate", "description": "This role is with CBRE. WayUp is partnering with CBRE to hire top talent.<br/><br/>About the role This is an outstanding opportunity to work in a team setting in the Best-in-class, fast-paced environment with the world's largest commercial real estate company! As an Associate Project Manager at CBRE, you will have an opportunity to learn and grow alongside our dedicated Project Management team. You will be responsible for advanced administrative support to the project management operations, administration, and management of commercial real estate projects. This will include documentation preparation, escalation for commitment, and reporting. You will assist the Project Management teams with highly regulated small and large utility capex projects for a specific client, with direct accountability for project delivery. You may also be responsible for managing smaller projects with oversight from a more experienced Project Manager or leader.<br/><br/>This position will require someone local to the Greater Los Angeles, CA area, the selected candidate will be required to report to the Rosemead, CA office a minimum of two days per week and may be required to complete site visits to monitor and supervise ongoing projects in the regional area. What you’ll do<br/><br/><ul><li>Assist Project Managers to manage facets of project management (budget, schedule, procurement, quality &amp; risk) for individual projects including planning, design, construction, occupancy, and closeout.</li><li>Demonstrate capability to read, understand, and apply standard documents affecting projects, including but not limited to agreements/contracts, leases, work letters, project charters, surveys, and drawings.</li><li>Implement project documentation governance aligned with company and client requirements. Ensure project data integrity and documentation is accurate, timely, and coordinated.</li><li>Track the progress of each project against goals, objectives, approved budgets, and approved timelines. Reports status and variances. Crafts action plans to meet objectives, budget, and schedule.</li><li>Identify project risks, develop risk mitigation and contingency plans, and proactively implement action plans to reduce or eliminate project risks. Solve advanced problems involving several options in complex situations.</li><li>May manage smaller projects as assigned. May manage third-party project delivery resources/team (typically smaller team) and be responsible for tracking performance and motivating team members.</li><li>Have a broad knowledge of own job discipline and some knowledge of several job disciplines within the function.</li><li>Lead by example and model behaviors that are consistent with CBRE RISE values.<br/><br/></li></ul>May convince others to reach an agreement.<br/><br/><ul><li>Impact the quality of own work and the work of others on the team.</li><li>Work primarily within standardized procedures and practices to achieve objectives and meet deadlines.</li><li>Explain complex information to others in straightforward situations.</li><li>Other duties as assigned. What you’ll need</li><li>Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future</li><li>Bachelor's Degree preferred with 2-5 years of relevant experience. In lieu of a degree, a combination of experience and education will be considered.</li><li>Previous AEC experience preferred and should include construction project management, owner's rep, or project management experience for commercial projects.</li><li>Ability to read and understand architectural drawings. Working understanding in MS Project is helpful. Knowledge of leases, contracts, and construction practices is preferred.</li><li>Understanding of existing procedures and standards to solve slightly complex problems.</li><li>Ability to analyze possible solutions using technical experience to apply appropriate judgment and precedents.</li><li>In-depth knowledge of Microsoft Office products.<br/><br/></li></ul>Examples include Word, Excel, Outlook, etc.<br/><br/><ul><li>Strong organizational skills with an inquisitive mindset.<br/><br/></li></ul>Why CBRE?<br/><br/><ul><li>FORTUNE Most Admired Company #1 in real estate for the third consecutive year; Ten years in a row on the list!</li><li>Forbes Named one of the best large employers in America and one of the World's Best Employers! California Equal Pay Disclaimer: CBRE Carefully considers multiple factors to determine compensation, including a candidate’s education, training, and experience. The minimum salary for this position is $80,000 annually and the maximum salary for this position is $100,000 annually. The compensation that is offered to a successful candidate will depend on the candidate’s skills, qualifications, and experience. Successful candidates will also be eligible for a discretionary bonus based on CBRE’s applicable benefit program. This role will provide the following benefits: 401(K), Dental Insurance, Health Insurance, Life Insurance, and Vision Insurance. The application window is anticipated to close on 8/01/24 and may be extended as needed. Or to express interest in similar roles, visit CBRE.com/careers Equal Employment Opportunity: CBRE is an equal opportunity employer that values diversity. We have a long-standing commitment to providing equal employment opportunity to all qualified applicants regardless of race, color, religion, national origin, sex, sexual orientation, gender identity, pregnancy, age, citizenship, marital status, disability, veteran status, political belief, or any other basis protected by applicable law. Candidate Accommodations: CBRE values the differences of all current and prospective employees and recognizes how every employee contributes to our company’s success. CBRE provides reasonable accommodations in job application procedures for individuals with disabilities. If you require assistance due to a disability in the application or recruitment process, please submit a request via email at recruitingaccomodations@cbre.com or via telephone at +1 866 225 3099 (U.S.) and +1 866 388 4346 (Canada). NOTE: Some, but not all, of our positions may have an additional requirement to comply with COVID-19 health and safety protocols, including COVID-19 vaccination proof and/or rigorous testing. If you have questions about the requirement(s) for this position, please inform your Recruiter.</li></ul>", "responsibilities": "Assist Project Managers to manage facets of project management (budget, schedule, procurement, quality &amp; risk) for individual projects including planning, design, construction, occupancy, and closeout.\nDemonstrate capability to read, understand, and apply standard documents affecting projects, including but not limited to agreements/contracts, leases, work letters, project charters, surveys, and drawings.\nImplement project documentation governance aligned with company and client requirements. Ensure project data integrity and documentation is accurate, timely, and coordinated.\nTrack the progress of each project against goals, objectives, approved budgets, and approved timelines. Reports status and variances. Crafts action plans to meet objectives, budget, and schedule.\nIdentify project risks, develop risk mitigation and contingency plans, and proactively implement action plans to reduce or eliminate project risks. Solve advanced problems involving several options in complex situations.\nMay manage smaller projects as assigned. May manage third-party project delivery resources/team (typically smaller team) and be responsible for tracking performance and motivating team members.\nHave a broad knowledge of own job discipline and some knowledge of several job disciplines within the function.\nLead by example and model behaviors that are consistent with CBRE RISE values.\nMay convince others to reach an agreement.\nImpact the quality of own work and the work of others on the team.\nWork primarily within standardized procedures and practices to achieve objectives and meet deadlines.\nExplain complex information to others in straightforward situations.\nOther duties as assigned.", "qualifications": {"required": "Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future", "preferred": "Bachelor's Degree preferred with 2-5 years of relevant experience. In lieu of a degree, a combination of experience and education will be considered.\nPrevious AEC experience preferred and should include construction project management, owner's rep, or project management experience for commercial projects.\nAbility to read and understand architectural drawings. Working understanding in MS Project is helpful. Knowledge of leases, contracts, and construction practices is preferred.\nUnderstanding of existing procedures and standards to solve slightly complex problems.\nAbility to analyze possible solutions using technical experience to apply appropriate judgment and precedents.\nIn-depth knowledge of Microsoft Office products.\nExamples include Word, Excel, Outlook, etc.\nStrong organizational skills with an inquisitive mindset."}, "skills": ["Project Management", "Construction", "Commercial Real Estate", "Risk Management", "Budgeting", "Scheduling", "Microsoft Office", "Communication", "Problem Solving", "Teamwork", "Leadership"], "postedDate": "4 weeks ago", "benefits": "401(K), Dental Insurance, Health Insurance, Life Insurance, and Vision Insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984564976"}