{"jobTitle": "Event Producer", "company": {"name": "Beth Helmstetter Events", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Events Services", "description": "Beth Helmstetter is seeking an experienced event producer to serve as the project manager for our events throughout the world. The ideal candidate will have luxury hospitality experience and have a strong passion for and background in weddings. This individual will:\n\n-Lead and manage all aspects of events, internal teams and vendors\n\n-Oversee every step of the event planning process from proposal to on site implementation including full ownership of all financial expenditures and budgets related to each celebration \n\n-Manage internal event team including design, production and staffing\n\n-Develop and maintain high level contact with new and existing clients\n\n-Supervise Production Manager, Design Manager and Event Associate on a daily basis\n\nThis is a full time, salaried position and will work in our West Hollywood studio. This is not a remote position nor is there flexibility for it to develop into one. Weekends, evenings and travel are requirements of this position.\n\nABOUT BETH HELMSTETTER\nBeth Helmstetter is a multidisciplinary design studio specializing in multi day celebrations around the world and lifestyle design for our discerning clients. We are an intimate team whose purpose is simply to make the world a more beautiful place through the curation and implementation of beautiful celebrations, intentional design and meaningful experiences. You will love working with us if:\n\n-You love to make people feel celebrated and seen\n\n-You love details\n\n-You’re a problem solver by nature\n\n-You understand that hospitality and entertaining can truly be an art form\n\n-You desire the rewards that can only be obtained from hard work\n\n-You love to travel and are inspired by other cultures\n\n-You enjoy working with a tight knit team to create some of life’s most beautiful moments\n\n-You’re self motivated with a heart of service\n\n", "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984836352"}