{"jobTitle": "Analyst, Business and Data Strategy", "company": {"name": "Los Angeles Football Club (LAFC)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$67,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Construction", "description": "<strong>OVERVIEW<br/><br/></strong>The Los Angeles Football Club (LAFC) is an MLS soccer club serving the greater Los Angeles area. LAFC is dedicated to building a world-class soccer club that represents the diversity of Los Angeles and is committed to delivering an unrivaled experience for fans. LAFC’s ownership group is comprised of local leaders and innovators of industry with intellectual capital, financial prowess, operations expertise, and success in the fields of entertainment, sports, technology, and media. LAFC is invested in the world’s game and Los Angeles, constructing, and developing the 22,000 seat BMO Stadium and a top-flight training center on the campus of Cal-State Los Angeles.<br/><br/><strong>POSITION SUMMARY<br/><br/></strong>This position will primarily support projects that impact the operations of automated reporting, prescriptive modeling, data warehouse management, sales lead prospecting, research, proposal development, ad-hoc business analysis, partner recap analysis, and as well as external consultancy projects. Furthermore, this individual will have oversight over developing and managing customer relationship management (CRM) systems, creating data-driven analyses, and summarizing and implementing recommendations. This position works cross-collaboratively and cross-functionally in developing strategies for various departments, such as Ticketing, Sales, and Service, Corporate Partnerships, Brand & Community, and Stadium Operations. Thus, the successful candidate will have previously demonstrated experience in extracting data and producing insights from a myriad of sources, including internal resources and external secondary research, and possess the ability to develop creative solutions while adhering to data-driven processes.<br/><br/>This role will report to the VP, Business and Data Strategy.<br/><br/><em>LAFC is currently operating on a hybrid work model with a minimum of 1 – 2 in-office days per week. Please note that this may vary by role, and your scheduled in-office days are up to the discretion of your supervisor. <br/><br/></em><strong>ESSENTIAL FUNCTIONS<br/><br/></strong><ul><li>Create and maintain high quality business management dashboards and reports for organization-wide use and for the executive team. </li><li>Develop prescriptive models analyzing ticket and partnership sales, service, and CRM data to develop analytical models. </li><li>Assist with CRM platform management and buildout with a focus on Ticket Sales and Corporate Partnerships departments, executing projects including but not limited to administration of campaigns, loading new leads while managing data cleanliness and pipeline, working with the Digital team on data segmentation, development of new process workflows, implementation of third-party integrations, and day-to-day management.  </li><li>Analyze campaigns and provide recaps and recommendations incorporating all process metrics including call volume, appointments, activities, opportunity stages and conversion rates. </li><li>Assist on collaborative projects with the Ticket Sales and Stadium Operations teams to develop ticket pricing and inventory allocation models for all stadium events and implement resulting recommendations. </li><li>Produce and deliver compelling presentations that visualize key observations and insights based on analysis of sales, survey and marketing data, etc. </li><li>Proactively identify opportunities to drive innovation, optimization, improve organizational financial performance, and enhance the customer experience. </li><li>Other duties as assigned by Supervisor/Management. <br/><br/></li></ul><strong>QUALIFICATIONS<br/><br/></strong><ul><li>Bachelor’s degree in Business Administration, Analytics, Math, Economics or related field preferred. Equivalent, relevant work experience may be considered in lieu of formal education. </li><li>At least 2 years of relevant experience working in business intelligence or related field preferred. </li><li>Previous experience with presentation development tools (VISME preferred). </li><li>Previous experience with data visualization tools (Tableau preferred). </li><li>Previous experience with demographic data tools is a plus (YouGov, Scarborough, Nielsen preferred). </li><li>Previous experience with CRM systems is a plus (Salesforce preferred). </li><li>Previous experience with survey creation, distribution and analysis is a plus (Qualtrics preferred). </li><li>Previous experience with coding languages (SQL, R, Python preferred). </li><li>ETL experience a plus. </li><li>Knowledge of ticketing systems is a plus (Ticketmaster preferred). </li><li>Knowledge of domestic and global professional soccer is a plus.  </li><li>Excellent communication skills – both verbal and written. </li><li>Strong sense of ownership and accountability as a self-starter. </li><li>Must be proactive, organized, and resourceful with great attention to detail.   </li><li>Ability to multi-task, meet tight deadlines, and work effectively in a fast-paced setting.   </li><li>Must possess a high level of discretion, with the ability to handle highly sensitive and confidential information as needed.  </li><li>Flexible schedule with the ability to work nights, weekends, and holidays as the event calendar requires. <br/><br/></li></ul><strong>SALARY RANGE<br/><br/></strong>At LAFC, we carefully consider a wide range of factors to determine a fair and equitable compensation package. The final offer amount will consider a wide range of factors that are considered in making compensation decisions including, but not limited to skill sets; relevant experience and training; and other business and organizational needs. Pursuant to state and local pay disclosure guidelines, the overall range for this role is $67,000 - $85,000 per year.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>LAFC strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.<br/><br/>Applicants for employment in the U.S. must possess work authorization, which does not require sponsorship by the employer for a visa.", "responsibilities": "<ul><li>Create and maintain high quality business management dashboards and reports for organization-wide use and for the executive team. </li><li>Develop prescriptive models analyzing ticket and partnership sales, service, and CRM data to develop analytical models. </li><li>Assist with CRM platform management and buildout with a focus on Ticket Sales and Corporate Partnerships departments, executing projects including but not limited to administration of campaigns, loading new leads while managing data cleanliness and pipeline, working with the Digital team on data segmentation, development of new process workflows, implementation of third-party integrations, and day-to-day management.  </li><li>Analyze campaigns and provide recaps and recommendations incorporating all process metrics including call volume, appointments, activities, opportunity stages and conversion rates. </li><li>Assist on collaborative projects with the Ticket Sales and Stadium Operations teams to develop ticket pricing and inventory allocation models for all stadium events and implement resulting recommendations. </li><li>Produce and deliver compelling presentations that visualize key observations and insights based on analysis of sales, survey and marketing data, etc. </li><li>Proactively identify opportunities to drive innovation, optimization, improve organizational financial performance, and enhance the customer experience. </li><li>Other duties as assigned by Supervisor/Management. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Business Administration, Analytics, Math, Economics or related field preferred. Equivalent, relevant work experience may be considered in lieu of formal education. At least 2 years of relevant experience working in business intelligence or related field preferred. Previous experience with presentation development tools (VISME preferred). Previous experience with data visualization tools (Tableau preferred). Previous experience with demographic data tools is a plus (YouGov, Scarborough, Nielsen preferred). Previous experience with CRM systems is a plus (Salesforce preferred). Previous experience with survey creation, distribution and analysis is a plus (Qualtrics preferred). Previous experience with coding languages (SQL, R, Python preferred). ETL experience a plus. Knowledge of ticketing systems is a plus (Ticketmaster preferred). Knowledge of domestic and global professional soccer is a plus.  Excellent communication skills – both verbal and written. Strong sense of ownership and accountability as a self-starter. Must be proactive, organized, and resourceful with great attention to detail.   Ability to multi-task, meet tight deadlines, and work effectively in a fast-paced setting.   Must possess a high level of discretion, with the ability to handle highly sensitive and confidential information as needed.  Flexible schedule with the ability to work nights, weekends, and holidays as the event calendar requires.", "preferred": ""}, "skills": ["Business Intelligence", "Data Analysis", "CRM", "Data Visualization", "Tableau", "SQL", "R", "Python", "ETL", "Ticketmaster", "Presentation Development", "VISME", "YouGov", "Scarborough", "Nielsen", "Salesforce", "Qualtrics"], "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984144833"}