{"jobTitle": "Sales Associate, Apartments.com - Orange County, CA", "company": {"name": "Apartments.com", "industry": "Advertising Services", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "CoStar Group (NASDAQ: CSGP) is a leading global provider of commercial and residential real estate information, analytics, and online marketplaces. Included in the S&P 500 Index and the NASDAQ 100, CoStar Group is on a mission to digitize the world’s real estate, empowering all people to discover properties, insights and connections that improve their businesses and lives.\n\nWe have been living and breathing the world of real estate information and online marketplaces for over 35 years, giving us the perspective to create truly unique and valuable offerings to our customers. We’ve continually refined, transformed and perfected our approach to our business, creating a language that has become standard in our industry, for our customers, and even our competitors. We continue that effort today and are always working to improve and drive innovation. This is how we deliver for our customers, our employees, and investors. By equipping the brightest minds with the best resources available, we provide an invaluable edge in real estate.\n\nApartments.com is the nation’s #1 rental marketplace for owners, property managers and consumers. Apartments.com is the network that millions of renters every year rely on to find their new place, is continuing to grow our industry-leading sales force. We provide apartment Property Managers and Owners with a platform to market their property listings and the industry’s most comprehensive virtual tools to attract the most and highest-quality renters. The Apartments.com Network includes Apartments.com, ForRent.com, ApartmentFinder.com, ApartmentHomeLiving.com, and eight other leading rental sites. Our suite of services includes digital advertising, social and reputation management, and market analytic solutions which delivers innovative tools for our customers. Learn more about Apartments.com.\n\nWe are looking for passionate sales professionals to build long-lasting, service-focused customer relationships. As an Apartments.com Sales Associate, you will be part of a dynamic team that operates as a strategic digital marketing partner to the Multifamily industry. The Apartments.com Sales team is the top sales team in the multi-family industry. As part of the team, you may be asked to participate in sales efforts with other residential products through CoStar Group, including Homes.com. Through engaging sales presentations and in-person client visits, you will advise and sell clients marketing solutions that enable them to achieve their goals. You will also grow revenue by prospecting new clients and growing existing accounts by identifying and developing new marketing solutions for their portfolios.\n\nAll new Sales Associates receive extensive classroom and field training, ensuring they are equipped with the product and industry knowledge needed to build market credibility, proudly represent our brand, and achieve career success. In addition, you will learn marketable skills in digital marketing and sales from working closely with talented and driven internal industry experts, product marketing and product management specialists.\n\nResponsibilities\n\n* Business Development – Prospect opportunities to develop new business, and identify upsell and renewal opportunities with current customers, using extensive CoStar Group’s market data.\n* Relationship Management – Build and maintain relationships with clients as a trusted advisor to their strategic marketing plan and grow revenue.\n* Business Industry Acumen – Develop subject matter expertise in digital advertising strategies, multifamily real estate, and trends within your specific market territory.\n* Teamwork - Partner with colleagues across teams to drive sales revenue and provide exceptional customer service.\n* Customer Focus – Develop strong client relationships by delivering outstanding customer support through regular, value-add communication, sharing market insights, and offering solutions that help our clients achieve their goals. \n\nBasic Qualifications\n\n* Two or more years of outside sales experience in a B2B environment, preferably in digital marketing or advertising sales; or equivalent experience in the Multifamily industry.\n* Proven track record of exceeding sales targets and quotas in a consultative sales environment.\n* A current and valid driver’s license (or the ability to obtain a driver’s license prior to start date) is required.\n* Satisfactory completion of a Motor Vehicle Record (MVR) check prior to start. Driving history must reflect responsible driving behavior and compliance with traffic laws.\n* Ability to regularly drive for extended periods and intermittently throughout the workday.\n* Bachelor’s degree required, preferably in Business Administration, Communications or Marketing from an accredited, not-for-profit University or College.\n* A track record of commitment to prior employers.\n\nPreferred Qualifications And Skills\n\n* Ability to analyze data, build out reporting and make strategic recommendations based on market data, trends, and performance metrics.\n* Flexible and adaptable to changing situations at a high growth company.\n* Self-starter who can work within a team environment and independently, while being highly organized with a strong attention to detail.\n* Experience managing customer relationships through the entire customer life cycle, including contact and pipeline management.\n* Excellent written and verbal communication skills, with strong interpersonal skills and the ability to connect with a variety of audiences.\n* Regular and consistent access to an operational motor vehicle prior to or by start date.\n* Evidence of strong academic performance in college\n\nWhat’s in it for you?\n\nWhen you join CoStar Group, you’ll experience a collaborative and innovative culture working alongside the best and brightest to empower our people and customers to succeed.\n\nWe offer you generous compensation and performance-based incentives. CoStar Group also invests in your professional and academic growth with internal training, tuition reimbursement, and an inter-office exchange program.\n\nOur Benefits Package Includes (but Is Not Limited To)\n\n* Comprehensive healthcare coverage: Medical / Vision / Dental / Prescription Drug\n* Life, legal, and supplementary insurance\n* Virtual and in person mental health counseling services for individuals and family\n* Commuter and parking benefits\n* 401(K) retirement plan with matching contributions\n* Employee stock purchase plan\n* Paid time off\n* Tuition reimbursement\n* On-site fitness center and/or reimbursed fitness center membership costs (location dependent), with yoga studio, Pelotons, personal training, group exercise classes\n* Access to CoStar Group’s Diversity, Equity, &amp; Inclusion Employee Resource Groups\n* Complimentary gourmet coffee, tea, hot chocolate, fresh fruit, and other healthy snacks \n\nWe welcome all qualified candidates who are currently eligible to work full-time in the United States to apply. However, please note that CoStar Group is not able to provide visa sponsorship for this position.\n\n<br/>\n\nThis position offers a base salary of $65,000 and includes a generous commission and benefits plan.\n\n<br/>\n\n<br/>\n\nCoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testing", "responsibilities": "Business Development – Prospect opportunities to develop new business, and identify upsell and renewal opportunities with current customers, using extensive CoStar Group’s market data.\nRelationship Management – Build and maintain relationships with clients as a trusted advisor to their strategic marketing plan and grow revenue.\nBusiness Industry Acumen – Develop subject matter expertise in digital advertising strategies, multifamily real estate, and trends within your specific market territory.\nTeamwork - Partner with colleagues across teams to drive sales revenue and provide exceptional customer service.\nCustomer Focus – Develop strong client relationships by delivering outstanding customer support through regular, value-add communication, sharing market insights, and offering solutions that help our clients achieve their goals. ", "qualifications": {"required": "Two or more years of outside sales experience in a B2B environment, preferably in digital marketing or advertising sales; or equivalent experience in the Multifamily industry.\nProven track record of exceeding sales targets and quotas in a consultative sales environment.\nA current and valid driver’s license (or the ability to obtain a driver’s license prior to start date) is required.\nSatisfactory completion of a Motor Vehicle Record (MVR) check prior to start. Driving history must reflect responsible driving behavior and compliance with traffic laws.\nAbility to regularly drive for extended periods and intermittently throughout the workday.\nBachelor’s degree required, preferably in Business Administration, Communications or Marketing from an accredited, not-for-profit University or College.\nA track record of commitment to prior employers.", "preferred": "Ability to analyze data, build out reporting and make strategic recommendations based on market data, trends, and performance metrics.\nFlexible and adaptable to changing situations at a high growth company.\nSelf-starter who can work within a team environment and independently, while being highly organized with a strong attention to detail.\nExperience managing customer relationships through the entire customer life cycle, including contact and pipeline management.\nExcellent written and verbal communication skills, with strong interpersonal skills and the ability to connect with a variety of audiences.\nRegular and consistent access to an operational motor vehicle prior to or by start date.\nEvidence of strong academic performance in college"}, "skills": ["Sales", "Business Development", "Digital Marketing", "Advertising Sales", "Multifamily Real Estate", "Customer Relationship Management", "Data Analysis", "Reporting", "Strategic Recommendations", "Teamwork", "Customer Service", "Communication"], "postedDate": "6 days ago", "benefits": "Comprehensive healthcare coverage: Medical / Vision / Dental / Prescription Drug\nLife, legal, and supplementary insurance\nVirtual and in person mental health counseling services for individuals and family\nCommuter and parking benefits\n401(K) retirement plan with matching contributions\nEmployee stock purchase plan\nPaid time off\nTuition reimbursement\nOn-site fitness center and/or reimbursed fitness center membership costs (location dependent), with yoga studio, Pelotons, personal training, group exercise classes\nAccess to CoStar Group’s Diversity, Equity, &amp; Inclusion Employee Resource Groups\nComplimentary gourmet coffee, tea, hot chocolate, fresh fruit, and other healthy snacks ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984560485"}