{"jobTitle": "Procurement Analyst", "company": {"name": "APR Consulting", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "39.00/hr - 39.00/hr", "currency": "USD"}, "jobFunction": "Purchasing, Supply Chain, and Project Management", "industry": "Utilities", "description": "An electric utility client is looking for an Procurement Analyst to provide operational support, overseeing and coordinating procurement efforts, preparing, reviewing, and maintaining documentation, data collection, monitoring project activities, tracking metrics..<br/>Location: Rosemead, CA 91770 (Hybrid)<br/>Position: Procurement Analyst<br/>Pay Rate: $39/hr. on W2<br/>Duration: 12 months or longer<br/>Schedule: M-F, 8:00 am – 5:00 pm<br/>***Hybrid, onsite 2 days a week***<br/>Microsoft Word, Powerpoint, and Excel Test are required with each submission. Must be able to reach at least a 90% on all three tests.<br/>RESPONSIBILITIES:<br/>Provide operational support, overseeing and coordinating procurement efforts, preparing, reviewing, and maintaining documentation, data collection, monitoring project activities, tracking metrics.<br/>Support various procurement activities related to supporting Cybersecurity Technology operations.<br/>REQUIRED QUALIFICATIONS:<br/>High School Diploma or equivalent required<br/>Procurement management experience<br/>General tracking of procurement requests<br/>MS office suite - proficient / expert level with Word, Excel, Powerpoint, &amp; Viso, W/ Excel - must have Pivot table, lookup, data analytics<br/>Strong project coordinator background 3+ years exp in Document management Contract management to include setting up docs, tracking negotiations change orders, etc. (can train on this)- like to have<br/>Prior project background is a like to have SAP exp<br/>Strong oral and written skills as they will be internal and externally communicating<br/>Coordinating in the cyber space for procurement functions<br/>About our client:Our client is one of the largest electric utilities and a longtime leader in renewable energy and energy efficiency in the United States providing electricity for much of Southern California.<br/>About APR:Since 1980 APR Consulting, Inc. has provided professional recruiting and contingent workforce solutions to a diverse mix of clients, industries, and skill sets nationwide.<br/>We are an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.<br/>Don't miss out on this amazing opportunity! If you feel your experience is the match for this position please apply today and join our team. We look forward to working with you!", "responsibilities": "Provide operational support, overseeing and coordinating procurement efforts, preparing, reviewing, and maintaining documentation, data collection, monitoring project activities, tracking metrics.\nSupport various procurement activities related to supporting Cybersecurity Technology operations.", "qualifications": {"required": "High School Diploma or equivalent required\nProcurement management experience\nGeneral tracking of procurement requests\nMS office suite - proficient / expert level with Word, Excel, Powerpoint, &amp; Viso, W/ Excel - must have Pivot table, lookup, data analytics\nStrong project coordinator background 3+ years exp in Document management Contract management to include setting up docs, tracking negotiations change orders, etc. (can train on this)- like to have\nPrior project background is a like to have SAP exp\nStrong oral and written skills as they will be internal and externally communicating\nCoordinating in the cyber space for procurement functions"}, "skills": ["Microsoft Word", "Powerpoint", "Excel", "Pivot table", "lookup", "data analytics", "Document management", "Contract management", "SAP"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984869496"}