{"jobTitle": "GUCCI Team Manager - Topanga", "company": {"name": "Gucci", "industry": "Retail Luxury Goods and Jewelry", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Regular", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$76,500 - $85,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail Luxury Goods and Jewelry", "description": "If you are a Dream-maker, this is the place for you. Together, we will create the real fabric of Gucci. A community of people united by the same passion: breaking new ground in the fashion world and beyond.", "responsibilities": "As a Gucci Team Manager, you will lead and inspire a dedicated team of Client Advisors to deliver the highest performance through a customer centric attitude. You will lead from the selling floor, delivering real time coaching and feedback to achieve business and product category goals. You will develop and grow the talent within your team. The Team Manager will represent the brand as a Gucci Ambassador by promoting the Gucci Values and Amplifiers of the brand within the marketplace.", "qualifications": {"required": "Minimum of 2-4 years of sales management experience in retail, luxury retail, or service-related industry; A Bachelor’s Degree in a related field is preferred; Ability to analyze selling reports, identify business trends, and react quickly to the needs of the business; Proven ability to drive positive client experiences that build loyalty and deliver measurable results; Ability to manage competing priorities in a fast-paced environment; Proficiency with Microsoft Office software including Word, Excel, PowerPoint, Outlook; Industry awareness and strong business acumen; Strong verbal and written communication skills and excellent organizational skills; Passion for the fashion industry; Ability to inspire and influence a team, with an entrepreneurial vision, and high level of integrity and professionalism; Flexibility to work a retail schedule which will include evenings, weekends, and holidays.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3984831082"}