{"jobTitle": "Senior Salesforce Business Analyst", "company": {"name": "Resource Informatics Group, Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "<strong>Job Description:<br/><br/></strong><ul><li> The primary role of the Senior Salesforce Business Analyst is to act as a liaison between business partners and IT Teams, supporting the solution delivery lifecycle for the Digital Distribution application portfolio under the direction of the Director, Business Engagement. </li><li> Join a team consisting of high-performing individuals that execute on product management, business analysis, process mapping, functional architecture, testing, and system integrations. </li><li> Be a proactive product owner and work alongside developers, support consultants, IT infrastructure, vendors, and different business verticals to support the Digital Distribution business. </li><li> Be the product manager of the portfolio of salesforce.com applications and system integrations. </li><li> Collaborate as project manager with technical teams to provide input on technical solutions and support end to end solution delivery. </li><li> Partner with key business clients to independently conduct and drive business requirements and design-related discussions and workshops. </li><li> Be a change agent and a knowledge keeper to support the successful business adoption of new IT solutions. </li><li> Research new technology tools and provide architecture solutions to support the growing Digital Distribution business. <br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li> Minimum of 4 years of solid hands-on experience with Salesforce.com</li><li> Minimum of 5 years of client facing and business systems analysis experience</li><li> Minimum of 5 years in application development and SDLC</li><li> Bachelor degree in Computer Science, Management Information Systems, or related fields. </li><li> Experience leading the analysis, extracting, and documentation of business requirements, and testing on projects, system enhancements and defects. </li><li> Deep understanding of IT project management, SDLC processes and methodologies, such as Waterfall, Agile Scrum and associated best practices, leveraging tools such as JIRA. </li><li> Excellent verbal and written communication skills - comfortable and confident communicating to all levels of the organization, both business and IT. </li><li> Ability to adapt to changing priorities and requirements, including the ability to multi-task and juggle many competing priorities and deadlines. <br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li> Salesforce Admin Certification</li><li> Experience with Salesforce Lightning components</li><li> Experience with Media/Entertainment</li><li> Experience with Jira and Smartsheet</li><li> Experience with user experience and wireframe/mockup creation</li><li> Experience with business intelligence and analytical tools</li><li> Experience with data architecture, data warehouse and middleware/ETL tools and technologies. </li><li> Has worked within a project team over multiple geographic/international locations.</li></ul>", "postedDate": "1 month ago", "skills": ["Salesforce", "Business Analysis", "Project Management", "SDLC", "Agile Scrum", "JIRA", "Communication", "Salesforce Admin Certification", "Salesforce Lightning components", "Media/Entertainment", "Jira", "Smartsheet", "User Experience", "Wireframing", "Mockup Creation", "Business Intelligence", "Analytical Tools", "Data Architecture", "Data Warehouse", "Middleware", "ETL"], "url": "https://www.linkedin.com/jobs/view/3984548373"}