{"jobTitle": "Administrative Assistant", "company": {"name": "LHH", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "23.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Job Title: Administrative Assistant</strong><p><strong>Location:</strong> Carson, CA (Onsite)</p><p><strong>Pay:</strong> $23/hr - $27/hr</p><p><strong>Job Type:</strong> Full-Time</p><p><strong>Job Description:</strong></p><p>LHH is seeking a detail-oriented and highly organized Administrative Assistant to join our client's team in Carson, CA. The ideal candidate will have a Bachelor's degree and be capable of handling various administrative tasks, supporting multiple departments and managers, and demonstrating advanced Excel skills. This role is essential for ensuring smooth office operations and providing critical support to our HR department.</p><p><strong>Responsibilities:</strong></p><ul><li><strong>Travel Arrangements:</strong> Schedule and coordinate travel for staff, including booking flights, accommodations, and transportation.</li><li><strong>Office Supplies:</strong> Order and maintain office supplies to ensure the smooth operation of the office.</li><li><strong>Office Maintenance:</strong> Keep the office environment tidy and well-organized.</li><li><strong>Invoice Allocation:</strong> Manage and allocate invoices for different offices, ensuring accurate record-keeping.</li><li><strong>HR Support:</strong> Assist the HR department with filing, scanning, and other administrative tasks as needed.</li><li><strong>Receptionist Backup:</strong> Provide backup support to the receptionist, including greeting visitors and handling phone calls.</li><li><strong>Interdepartmental Coordination:</strong> Work effectively with various departments and managers to meet administrative needs.</li></ul><p><strong>Requirements:</strong></p><ul><li><strong>Education:</strong> Bachelor's degree required.</li><li><strong>Excel Proficiency:</strong> Advanced knowledge of Excel, including VLOOKUPs and Pivot Tables.</li><li><strong>Communication Skills:</strong> Strong verbal and written communication skills.</li><li><strong>Organizational Skills:</strong> Excellent organizational skills with the ability to multitask and prioritize effectively.</li><li><strong>Interpersonal Skills:</strong> Ability to work collaboratively with multiple departments and managers.</li><li><strong>Attention to Detail:</strong> High level of accuracy and attention to detail in all tasks.</li></ul><p></p>", "responsibilities": "Schedule and coordinate travel for staff, including booking flights, accommodations, and transportation. Order and maintain office supplies to ensure the smooth operation of the office. Keep the office environment tidy and well-organized. Manage and allocate invoices for different offices, ensuring accurate record-keeping. Assist the HR department with filing, scanning, and other administrative tasks as needed. Provide backup support to the receptionist, including greeting visitors and handling phone calls. Work effectively with various departments and managers to meet administrative needs.", "qualifications": {"required": "Bachelor's degree required. Advanced knowledge of Excel, including VLOOKUPs and Pivot Tables. Strong verbal and written communication skills. Excellent organizational skills with the ability to multitask and prioritize effectively. Ability to work collaboratively with multiple departments and managers. High level of accuracy and attention to detail in all tasks."}, "skills": ["Excel", "Communication", "Organization", "Travel Arrangements", "Office Supplies", "Office Maintenance", "Invoice Allocation", "HR Support", "Receptionist Backup", "Interdepartmental Coordination"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Dental insurance, 401(k), Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984492189"}