{"jobTitle": "Production Coordinator (Apparel)", "company": {"name": "Karen Kane", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative, Manufacturing, and Product Management", "industry": "Retail Apparel and Fashion, Wholesale, and Wholesale Apparel and Sewing Supplies", "description": "We’re looking for a Production Coordinator to support our fabric and import buying team. This role requires an excellent eye for detail, strong negotiation skills, and a keen understanding of the textile and apparel industry. The position is based in Los Angeles, CA.\n\nThe ideal candidate for this job is sharply organized, focused on finding solutions, and a great problem-solver.\n\nJob Responsibilities Include:\n\n* Collaborate with Design and Sales to understand fabric requirements and sourcing needs for upcoming collections.\n* Negotiate pricing, terms, and contracts with suppliers to ensure favorable terms and competitive pricing.\n* Help issue domestic production cuts as needed.\n* Monitor inventory levels and manage reordering to maintain optimal stock levels and minimize out-of-stock situations.\n* Conduct quality inspections of incoming materials to ensure they meet our standards and specifications.\n* Issue Production paperwork - purchase orders, cut tickets, etc.\n* Help maintain and update fabric library and inventory.\n* Measure and inspect garments for quality; cross-reference with standards.\n* Handle send-outs - communicate regularly with vendors and follow-up as needed for information on production & fit samples. Send-outs include, but not limited to elastic shirring, eyelets, tie dye, garment dye & wash, welt pockets.\n\nCandidate Requirements:\n\n* Strong time-management from organization, multi-tasking, and prioritization skills.\n* Excellent communication and interpersonal skills, with the ability to build and maintain relationships with suppliers and internal stakeholders.\n* Analytical mindset with the ability to analyze market data and make data-driven purchasing decisions.\n* Detail-oriented with a keen eye for quality and design.\n* Proficient in Microsoft Office Suite and experience with purchasing software or ERP systems is a plus.\n* Passion for fashion and a strong understanding of industry trends and consumer preferences.\n\nBenefits:\n\n* 401k plan with partial company match.\n* Comprehensive healthcare, dental, and vision plan.\n* Clothing discount.\n* Voluntary life insurance, as well as short-term and long-term disability policies.\n* Voluntary free annual biometric health test.\n* Early access to company sample sales.\n* Company-sponsored Wellness program.\n* Access to free monthly health & mindfulness webinars.\n* Seasonal monetary awards for participation in company Fitness Challenges.\n* Partial healthcare-subsidized fitness membership to 10,000 gym locations across the country.\n* Company-subsidized discounts to theme parks & local attractions, including Disneyland, Knotts Berry Farm, Universal Studios, Legoland, Six Flags, Sea World, and Southern California sports teams; discounts to brands including Vitamix, Sonos, and others.", "responsibilities": "Collaborate with Design and Sales to understand fabric requirements and sourcing needs for upcoming collections. Negotiate pricing, terms, and contracts with suppliers to ensure favorable terms and competitive pricing. Help issue domestic production cuts as needed. Monitor inventory levels and manage reordering to maintain optimal stock levels and minimize out-of-stock situations. Conduct quality inspections of incoming materials to ensure they meet our standards and specifications. Issue Production paperwork - purchase orders, cut tickets, etc. Help maintain and update fabric library and inventory. Measure and inspect garments for quality; cross-reference with standards. Handle send-outs - communicate regularly with vendors and follow-up as needed for information on production & fit samples. Send-outs include, but not limited to elastic shirring, eyelets, tie dye, garment dye & wash, welt pockets.", "qualifications": {"required": "Strong time-management from organization, multi-tasking, and prioritization skills. Excellent communication and interpersonal skills, with the ability to build and maintain relationships with suppliers and internal stakeholders. Analytical mindset with the ability to analyze market data and make data-driven purchasing decisions. Detail-oriented with a keen eye for quality and design. Proficient in Microsoft Office Suite and experience with purchasing software or ERP systems is a plus. Passion for fashion and a strong understanding of industry trends and consumer preferences.", "preferred": ""}, "skills": ["Negotiation", "Time Management", "Communication", "Detail Oriented", "Microsoft Office", "Fashion", "Inventory Management", "Purchasing", "Quality Assurance", "Supply Chain"], "postedDate": "3 weeks ago", "benefits": "401k plan with partial company match. Comprehensive healthcare, dental, and vision plan. Clothing discount. Voluntary life insurance, as well as short-term and long-term disability policies. Voluntary free annual biometric health test. Early access to company sample sales. Company-sponsored Wellness program. Access to free monthly health & mindfulness webinars. Seasonal monetary awards for participation in company Fitness Challenges. Partial healthcare-subsidized fitness membership to 10,000 gym locations across the country. Company-subsidized discounts to theme parks & local attractions, including Disneyland, Knotts Berry Farm, Universal Studios, Legoland, Six Flags, Sea World, and Southern California sports teams; discounts to brands including Vitamix, Sonos, and others.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984840441"}