{"jobTitle": "Director, Retail and Product Licensing", "company": {"name": "Lucas Museum of Narrative Art", "location": "Los Angeles, CA", "industry": "Museums, Historical Sites, and Zoos"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "110,000.00 - 135,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Museums, Historical Sites, and Zoos", "description": "About The Lucas Museum Of Narrative Art<br/><br/>As the first museum to focus exclusively on storytelling through images, the Lucas Museum of Narrative Art believes that visual storytelling can connect us and help shape a more just society. With a growing collection that encompasses artworks from across cultures, places, times, and mediums, including paintings, sculptures, murals, photography, comic art, book and magazine illustrations, and the arts of filmmaking, the Lucas Museum will explore narrative art’s potential to prompt questions, invite opinions, inspire community, and move people to think about the impact of images on our world.<br/><br/>Co-founded by George Lucas and Mellody Hobson and led by director and CEO Sandra Jackson-Dumont, the Lucas Museum was designed by renowned architect Ma Yansong of MAD Architects with Stantec as executive architect and is under construction in Los Angeles’s Exposition Park. An 11-acre campus with extensive new green space designed by Studio-MLA will embrace the museum’s 300,000-square-foot building, which will feature expansive galleries, two state-of-the-art theaters, and dedicated spaces for learning and engagement, dining, retail, and events. www.lucasmuseum.org .<br/><br/>Position Summary<br/><br/>The Lucas Museum is sharply focused on creating a superior and inclusive experience for all our visitors. The Retail and Product Licensing Director has a key leadership role in achieving this objective. The LMNA retail and licensing team are responsible for product development, sales, e-commerce, external retailer relationships and creating an exceptional service led retail offer within the museum. The Director will lead them to maximize growth and revenue in support of the goals and objectives of the museum. The Director will additionally work with a range of external partners to secure licensing deals that reflect the excellence of the Museum, and in maximizing revenue for the Museum.<br/><br/>Leading the Lucas Museum of Narrative Art retail and licensing departments, the Director will assume responsibility for the retail stores and licensing initiatives in all forms. The Director is tasked with formulating strategies, overseeing merchandising programs, and directing daily programs to bolster retail sales. An experienced professional with initiative and entrepreneurial skills, the Director will ensure that the retail environment and product offer activates the customer’s desire to buy, and to gain and increase customer loyalty. The Director will be responsible for maximizing revenue by selling merchandise through other retail outlets, raising revenues for and extending the brand of the Museum. The Director is fully responsible for all retail and licensing operations, operating within the mission of the Museum.<br/><br/>The Retail and Product Licensing Director will lead the strategic development and implementation of the Museum’s long-term retail and licensing vision and short-term objectives, ensuring alignment with the Museum’s broader mission and strategic plan. The Director will set and meet retail and licensing revenue goals and profitability. The Director will be responsible for monitoring customer preferences and in determining the focus of sales strategies, including price schedules and discounts. The Director will use data to manage actively the SKU’s to maximize revenue for the Museum. The Director will lead both the retail and licensing teams in recruitment, coaching, innovation, and continuous learning. The shops are a major touch-point for the visitor, and the Director will create an environment that is inviting and accessible for visitors and will train staff and model the behaviors that will result in the highest level of customer engagement and satisfaction.<br/><br/>Responsibilities<br/><br/><ul><li>Oversee the daily operations of the retail and licensing departments</li><li>Develop and implement new initiatives in line with department and Museum objectives</li><li>Work closely with other departments within the museum to ensure that the Museum's overall mission and goals are met</li><li>Use data, experimentation, and visitor feedback continuously to improve the retail experience, manage SKU’s and drive net profits. This is an essential element of the position and the ultimate success of the Museum</li><li>Actively manage and monitor the Museum’s retail and licensing budgets: revenue and expenses</li><li>Ensure profitability through effective pricing strategies, cost controls and sales promotions, and experimentation</li><li>Develop and implement strategies for marketing to promote the retail and licensing operations and drive sales</li><li>Ensure that the LMNA stores offer the highest standard of customer service and engagement, from product selection to placement, visual merchandising, to post-purchase support</li><li>Establish rapport with licensing partners and ensuring that licensing deals are appropriate and meet the Museum’s mission as well as ensuring revenue, and the broader promotion of the Museum</li><li>Use sales data, customer feedback and market trends to inform the overall buying plan and product strategies</li><li>Actively manage SKU’s, using data to continually shift the mix of product and drive net profits</li><li>Oversee the Museum’s e-commerce management, ensuring a seamless online shopping experience from selection to check out</li><li>As part of the Museum’s e-commerce management, actively use data to dynamically change the offering and experiment with new product lines</li><li>Develop and maintain strong relationships with suppliers, artists, and artisans, negotiating favorable terms and ensuring the timely delivery of quality products</li><li>Post-opening, continuously refine the practices, hiring, retention and training. The sales staff needs deeply to understand that they are the ambassadors for the Museum. All visitors should feel welcome</li><li>Actively champion the Museum’s commitment to Diversity, Equity, Inclusion, Accessibility and Belonging in hiring, in sourcing and in connection with visitors<br/><br/></li></ul>Qualifications<br/><br/><ul><li>5+ years of experience in a leadership role in a retail environment</li><li>Demonstrable experience in licensing, brand management and product development</li><li>Financial and strategic operational planning ability</li><li>Experience in managing and motivating staff of both senior and entry levels</li><li>Demonstrated commitment to Diversity, Equity, Inclusion, Accessibility and Belonging in hiring, staffing, management, training and leaderships practices</li><li>Strong commitment to and demonstrated ability to use data and experimentation to drive net profits and improve visitor experience</li><li>Experience in running an international licensing program is a plus</li><li>Ability to influence and engage direct reports and peers</li><li>Excellent communication and interpersonal skills</li><li>Demonstrated ability to collaborate with colleagues across the Museum</li><li>Strong organizational and problem-solving skills</li><li>Ability to work independently and as part of a team</li><li>Innovative thinker, with a track record for translating strategic thinking into action plans and output</li><li>Solid strategic planning, organizational, and project management skills</li><li>Ability to work under pressure and meet deadlines<br/><br/></li></ul>$110,000 - $135,000 a year<br/><br/>EQUAL OPPORTUNITY AND OUR COMMITMENT TO DEAIB<br/><br/>The Lucas Museum of Narrative Art embraces diversity and equal opportunity. We are committed to building a team that represents and supports a variety of backgrounds and perspectives. The Lucas Museum fosters a work environment that is free of discrimination and harassment, whether based on race, national origin, gender, gender expression, religion, ethnic background, age, disability, marital status, sexual orientation, or any other criterion prohibited by applicable federal, state, or local laws. We believe that diversity and inclusion among our team is critical to our success, and we seek to recruit, develop, and retain the best qualified people from a diverse candidate pool. Applications from traditionally underrepresented communities are encouraged.<br/><br/>The statements in this description represent typical elements, criteria, and general work performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required for the job.<br/><br/>MISSION AND VISION <br/><br/>We are a museum dedicated to the art of storytelling. Through visual storytelling the Lucas Museum expands the role of art and museums for society. The Museum inspires thought provoking ideas and conversations that are relevant within and beyond geographic boundaries. Our work radiates to catalyze more connected and empathetic spaces. The art of storytelling connects us to shape a more just society.<br/><br/>VALUES <br/><br/>Our internal and external practice is shaped by the following beliefs and behaviors.<br/><br/>PEOPLE FIRST<br/><br/>We meet people wherever they are (physically, intellectually, emotionally). Our inclusive practice connects who people are and what people find meaningful, to works of art and the work of our organization.<br/><br/>INSPIRED<br/><br/>We believe that art can move you to feel, think, reflect, and act.<br/><br/>COLLABORATIVE<br/><br/>We believe that nimble thinking and working together yields exponential results.<br/><br/>BRAVE<br/><br/>We approach our work and learning with courage, creativity, curiosity, and a sense of adventure.<br/><br/>4 STRATEGIC PRIORITIES <br/><br/>ART<br/><br/>Amplify the social impact of Narrative Art through an approach that bridges the academic and the popular.<br/><br/>COMMUNITY<br/><br/>Connect to a broad and diverse public by create an institution rooted in impactful, respectful, sustainable relationships.<br/><br/>INCLUSION<br/><br/>Practice diversity, equity, inclusion, accessibility and belonging in all operational and programmatic aspects of our work.<br/><br/>OPERATIONAL EXCELLENCE<br/><br/>Create a healthy and durable institution equipped to fulfill its vision and public mandate.<br/><br/>_All staff at the Lucas Museum of Narrative Art lead through a deep commitment to diversity, equity, and inclusion, both within the Museum and with the communities that we serve.<br/><br/>_Salary and titles will be assigned commensurate to the successful candidates’ education and experience. An attractive compensation package will be offered to the successful candidate(s).<br/><br/>_Pursuant to the Lucas Museum of Narrative Art’s COVID-19 Mandatory Vaccination Policy, the museum requires all new hires to provide proof of COVID-19 vaccination as a condition of employment absent an approved medical and/or religious exemption. Upon hire, all new hires will receive detailed instructions on complying with this policy. Federal, state, or local public health directives may impose additional requirements._", "responsibilities": "<ul><li>Oversee the daily operations of the retail and licensing departments</li><li>Develop and implement new initiatives in line with department and Museum objectives</li><li>Work closely with other departments within the museum to ensure that the Museum's overall mission and goals are met</li><li>Use data, experimentation, and visitor feedback continuously to improve the retail experience, manage SKU’s and drive net profits. This is an essential element of the position and the ultimate success of the Museum</li><li>Actively manage and monitor the Museum’s retail and licensing budgets: revenue and expenses</li><li>Ensure profitability through effective pricing strategies, cost controls and sales promotions, and experimentation</li><li>Develop and implement strategies for marketing to promote the retail and licensing operations and drive sales</li><li>Ensure that the LMNA stores offer the highest standard of customer service and engagement, from product selection to placement, visual merchandising, to post-purchase support</li><li>Establish rapport with licensing partners and ensuring that licensing deals are appropriate and meet the Museum’s mission as well as ensuring revenue, and the broader promotion of the Museum</li><li>Use sales data, customer feedback and market trends to inform the overall buying plan and product strategies</li><li>Actively manage SKU’s, using data to continually shift the mix of product and drive net profits</li><li>Oversee the Museum’s e-commerce management, ensuring a seamless online shopping experience from selection to check out</li><li>As part of the Museum’s e-commerce management, actively use data to dynamically change the offering and experiment with new product lines</li><li>Develop and maintain strong relationships with suppliers, artists, and artisans, negotiating favorable terms and ensuring the timely delivery of quality products</li><li>Post-opening, continuously refine the practices, hiring, retention and training. The sales staff needs deeply to understand that they are the ambassadors for the Museum. All visitors should feel welcome</li><li>Actively champion the Museum’s commitment to Diversity, Equity, Inclusion, Accessibility and Belonging in hiring, in sourcing and in connection with visitors<br/><br/></li></ul>", "qualifications": {"required": "5+ years of experience in a leadership role in a retail environment, Demonstrable experience in licensing, brand management and product development, Financial and strategic operational planning ability, Experience in managing and motivating staff of both senior and entry levels, Demonstrated commitment to Diversity, Equity, Inclusion, Accessibility and Belonging in hiring, staffing, management, training and leaderships practices, Strong commitment to and demonstrated ability to use data and experimentation to drive net profits and improve visitor experience, Experience in running an international licensing program is a plus, Ability to influence and engage direct reports and peers, Excellent communication and interpersonal skills, Demonstrated ability to collaborate with colleagues across the Museum, Strong organizational and problem-solving skills, Ability to work independently and as part of a team, Innovative thinker, with a track record for translating strategic thinking into action plans and output, Solid strategic planning, organizational, and project management skills, Ability to work under pressure and meet deadlines<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984735884"}