{"jobTitle": "Production Assistant - Feature", "company": {"name": "Sony Pictures Animation", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "<strong>SUMMARY: <br/><br/></strong>The Production Assistant supports one or more departments for a feature or series. Departments include Production, Story, Script, Editorial, and Visual Development. This is an entry level position.<br/><br/>Sony Pictures Animation is a pre-production animation studio based in Culver City, California, creating both feature animation and animated series with artists from around the world. We pride ourselves on empowering filmmakers to lead the creative process, and allowing the hand of the artist to be truly felt, with the goal of producing bold and innovative visual storytelling.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Assist the Production Office Coordinator with day-to-day operations for the production.</li><li>Enter data into production tracking software.</li><li>Transcribe meeting notes.</li><li>Assist with coordinating scripts and prepping binders for voice recordings.</li><li>Archive artwork and production files within specific online directory structures.</li><li>Assist with preparing for presentations, special events, and meetings.</li><li>Provide desk coverage including answering phones, scheduling meetings, special coverage and other administrative duties as needed.</li><li>Order office supplies for the department.</li><li>Run for lunch, snacks, and coffee as needed. Our team appreciates the refreshments!</li><li>Complete expense reports for food and purchases.<br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>Previous office or project organization experience.</li><li>Highly organized, resourceful, and diligent with excellent interpersonal, oral and written communication skills.</li><li>Ability to multitask and work well under pressure in a face paced department.</li><li>Must be willing to take direction.</li><li>Ability to work independently and set appropriate priorities.</li><li>Take direction when needed and also take the initiative where applicable.</li><li>Dependable and ability to maintain a high level of discretion.</li><li>Bachelor's degree or equivalent preferred.<br/><br/></li></ul><strong>REQUIREMENTS:<br/><br/></strong><ul><li>Candidates must be eligible to work in the US and must be at least 18 years old</li><li>High School diploma required, Bachelors preferred.</li><li>Computer and technology literate – familiarity with Mac/PC operating systems, Photoshop, Word, Excel, and Gmail.</li><li>Must possess an active driver's license.</li><li>Ability to lift 20+ pounds. <br/><br/></li></ul>The anticipated base salary for this position is $19.50/hour to $22.00/hour. This role may also qualify for incentives and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Animation is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.", "responsibilities": "The Production Assistant supports one or more departments for a feature or series. Departments include Production, Story, Script, Editorial, and Visual Development. This is an entry level position.", "qualifications": {"required": "Previous office or project organization experience. Highly organized, resourceful, and diligent with excellent interpersonal, oral and written communication skills. Ability to multitask and work well under pressure in a face paced department. Must be willing to take direction. Ability to work independently and set appropriate priorities. Take direction when needed and also take the initiative where applicable. Dependable and ability to maintain a high level of discretion.", "preferred": "Bachelor's degree or equivalent"}, "skills": ["Photoshop", "Word", "Excel", "Gmail"], "postedDate": "4 weeks ago", "benefits": "The anticipated base salary for this position is $19.50/hour to $22.00/hour. This role may also qualify for incentives and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984580907"}