{"jobTitle": "Associate Director, Digital Marketing", "company": {"name": "Sony Music Entertainment", "location": "Los Angeles, CA", "industry": "Musicians"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Musicians", "description": "About Sony Music Entertainment<br/><br/>At Sony Music Entertainment, we fuel the creative journey. We’ve played a pioneering role in music history, from the first-ever music label to the invention of the flat disc record. We’ve nurtured some of music’s most iconic artists and produced some of the most influential recordings of all time.<br/><br/>Today, we work in more than 70 countries, supporting a diverse roster of international superstars, developing and independent artists, and visionary creators. From our position at the intersection of music, entertainment, and technology, we bring imagination and expertise to the newest products and platforms, embrace new business models, employ breakthrough tools, and provide powerful insights that help our artists push creative boundaries and reach new audiences. In everything we do, we’re committed to artistic integrity, transparency, and entrepreneurship.<br/><br/>Sony Music Entertainment is a member of the Sony family of global companies.<br/><br/>The Digital Marketing role at Columbia Records is a key position responsible for leading the digital rollout of album and single releases. This individual will play a crucial role in driving the growth and use of our music on social media platforms and oversee short-form content strategy for given projects. Additionally, this role is responsible for expanding the artist's social footprint and managing the growth of assigned artists’ fan base. Serving as the main point of contact for all digital marketing and one of the key players for short-form content-related activities, this role ensures that our digital strategies align with the artist’s vision and marketing objectives, delivering impactful and cohesive campaigns.<br/><br/><ul><li>We are open to this role working 4x a week out of our NY or LA office.<br/><br/></li></ul><strong>What you'll do:<br/><br/></strong><ul><li>Brainstorming and Concepting. Lead brainstorming sessions with all digitally focused players (digital associate, designer, video, audience, media) and Marketing to conceptualize digital rollouts for album and single releases, and present concepts to wider internal and external teams for feedback and refinement.</li><li>Content Strategy and Management. Oversee short-form content strategy for assigned artists, ensuring alignment with the artist's vision and current trends. Work with the content team or 3rd party to ideate and implement content strategies. This includes sourcing videographers, collaborating with content producers, and building relationships with agencies to create and share compelling narratives, aiming to boost our music's presence on social platforms.</li><li>Digital Setup. Oversee the creation and design of campaign pages, (ie pre-save, sing up etc) in collaboration with associates and designers. Develop static and video release assets, draft YouTube descriptions, load tags, and manage channel linking and claims to ensure all digital components are ready for the rollout.</li><li>Campaign Development and Execution. Develop and implement comprehensive digital campaigns, including dedicated campaign websites with interactive elements. Work closely with all stakeholders and coordinate approvals. Monitor campaign development and reactions in real time. </li><li>Audience Strategy and Engagement. Develop strategies to engage assigned artist audience across multiple platforms, ensuring a consistent and impactful presence. Collaborate with the Audience team to initiate and oversee the implementation of owned third-party UGC channels and fan accounts.</li><li>Influencer Management. Concept influencer campaigns. Work with agencies to launch and monitor campaigns. Approve influencer drafts and oversee creative. Craft sound growth strategies while tracking development.</li><li>Video Launch Coordination. Coordinate video launches with release planning, including acquiring ISRCs, setting up YouTube premieres, and monitoring engagement metrics to ensure successful video rollouts.</li><li>Reporting and Social Media Management. Conduct digital recap reporting, monitor artist development, trends, and viral moments in real time, and manage the posting and engagement on the artist's social accounts, including developing relationships with fan pages.</li><li>Direct Communication with Artist and Management. Serve as the main point of contact for the artist and their management team regarding all digital marketing. Also, one of the key players around short-form content. Ensure smooth communication and coordination for approvals and feedback.<br/><br/></li></ul><strong>Who you are:<br/><br/></strong><ul><li>At least 5 years of digital marketing experience at a record label or other related media companies</li><li>Proficiency in digital marketing tools and platforms, including social media management and analytics.</li><li>Strong understanding of short-form content and what performs best online.</li><li>Ability to develop and execute comprehensive digital campaigns and to develop and oversee the creation of interactive web elements</li><li>Strong understanding of pop and country music.</li><li>Creativity and Innovation: Ability to generate original and engaging digital marketing and content ideas that align with the artist's brand.</li><li>Communication Skills: Excellent written and verbal communication skills for crafting compelling narratives and collaborating with various teams.</li><li>Organizational Skills: Strong ability to manage multiple projects simultaneously and meet deadlines.</li><li>Collaboration and Teamwork: Ability to work effectively with cross-functional teams and manage relationships with external partners.</li><li>Adaptability and Learning Agility: Openness to feedback, willingness to learn new skills, and adaptability to rapidly changing digital trends and technologies.<br/><br/></li></ul><strong>What we give you:<br/><br/></strong><ul><li>You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day </li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best </li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching </li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans </li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community. </li><li>The space to accelerate progress, positively disrupt, and create what happens next </li><li>Time off for a winter recess<br/><br/></li></ul><em>Sony Music is committed to providing equal employment opportunity for all persons regardless of age, disability, national origin, race, color, religion, sex, sexual orientation, gender, gender identity or expression, pregnancy, veteran or military status, marital and civil partnership/union status, alienage or citizenship status, creed, genetic information or any other status protected by applicable federal, state, or local law.<br/><br/></em>The anticipated annual base salary does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>California Pay Range<br/><br/>$85,000—$95,000 USD", "responsibilities": "<ul><li>Brainstorming and Concepting. Lead brainstorming sessions with all digitally focused players (digital associate, designer, video, audience, media) and Marketing to conceptualize digital rollouts for album and single releases, and present concepts to wider internal and external teams for feedback and refinement.</li><li>Content Strategy and Management. Oversee short-form content strategy for assigned artists, ensuring alignment with the artist's vision and current trends. Work with the content team or 3rd party to ideate and implement content strategies. This includes sourcing videographers, collaborating with content producers, and building relationships with agencies to create and share compelling narratives, aiming to boost our music's presence on social platforms.</li><li>Digital Setup. Oversee the creation and design of campaign pages, (ie pre-save, sing up etc) in collaboration with associates and designers. Develop static and video release assets, draft YouTube descriptions, load tags, and manage channel linking and claims to ensure all digital components are ready for the rollout.</li><li>Campaign Development and Execution. Develop and implement comprehensive digital campaigns, including dedicated campaign websites with interactive elements. Work closely with all stakeholders and coordinate approvals. Monitor campaign development and reactions in real time. </li><li>Audience Strategy and Engagement. Develop strategies to engage assigned artist audience across multiple platforms, ensuring a consistent and impactful presence. Collaborate with the Audience team to initiate and oversee the implementation of owned third-party UGC channels and fan accounts.</li><li>Influencer Management. Concept influencer campaigns. Work with agencies to launch and monitor campaigns. Approve influencer drafts and oversee creative. Craft sound growth strategies while tracking development.</li><li>Video Launch Coordination. Coordinate video launches with release planning, including acquiring ISRCs, setting up YouTube premieres, and monitoring engagement metrics to ensure successful video rollouts.</li><li>Reporting and Social Media Management. Conduct digital recap reporting, monitor artist development, trends, and viral moments in real time, and manage the posting and engagement on the artist's social accounts, including developing relationships with fan pages.</li><li>Direct Communication with Artist and Management. Serve as the main point of contact for the artist and their management team regarding all digital marketing. Also, one of the key players around short-form content. Ensure smooth communication and coordination for approvals and feedback.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>At least 5 years of digital marketing experience at a record label or other related media companies</li><li>Proficiency in digital marketing tools and platforms, including social media management and analytics.</li><li>Strong understanding of short-form content and what performs best online.</li><li>Ability to develop and execute comprehensive digital campaigns and to develop and oversee the creation of interactive web elements</li><li>Strong understanding of pop and country music.</li><li>Creativity and Innovation: Ability to generate original and engaging digital marketing and content ideas that align with the artist's brand.</li><li>Communication Skills: Excellent written and verbal communication skills for crafting compelling narratives and collaborating with various teams.</li><li>Organizational Skills: Strong ability to manage multiple projects simultaneously and meet deadlines.</li><li>Collaboration and Teamwork: Ability to work effectively with cross-functional teams and manage relationships with external partners.</li><li>Adaptability and Learning Agility: Openness to feedback, willingness to learn new skills, and adaptability to rapidly changing digital trends and technologies.<br/><br/></li></ul>", "preferred": ""}, "skills": ["Digital Marketing", "Social Media Management", "Analytics", "Short-form Content", "Campaign Development", "Audience Engagement", "Influencer Marketing", "Video Launch Coordination", "Reporting", "Social Media Management", "Communication", "Collaboration", "Teamwork", "Adaptability", "Learning Agility"], "postedDate": "3 days ago", "benefits": "<ul><li>You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day </li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best </li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching </li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans </li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community. </li><li>The space to accelerate progress, positively disrupt, and create what happens next </li><li>Time off for a winter recess<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984810404"}