{"jobTitle": "Senior Manager Operations - CA Remote", "company": {"name": "Optum", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "88,000.00/yr - 173,200.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "For those who want to invent the future of health care, here's your opportunity. We're going beyond basic care to health programs integrated across the entire continuum of care. Join us to start Caring. Connecting. Growing together. <br/><br/>This role is the primary driver of shared services transformation and supporting operational design and milestones and is highly collaborative across corporate and market-level operations, leveraging existing subject matter experts (SMEs) to aid in decision making. The role may include coaching and managing junior team members supporting the work. Initially the work will be highly focused on an in-flight initiative with our DHMC Strategy &amp; Operations team which interfaces with most of Optum CA shared services and clinical operations teams as well as external regulators.<br/><br/>The ideal candidate will be highly motivated, organized, process-oriented, and self-directed. This individual will have a successful track record of designing and executing against major operational implementation programs across shared services affecting both group and IPA models of care and a solid understanding of healthcare operations and business needs. Examples of work includes standardizing business and clinical operations and staffing models, supporting unifying and standardizingation work flows, and defining consistent patient and provider inbound and outbound communication processes. The Senior Manager will report to the Chief Administrative Officer with dotted line accountability to the Executive Director, DMHC Strategy &amp; Operations.<br/><br/>If you are located in California, you will have the flexibility to work remotely* as you take on some tough challenges.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Partners with business leaders to develop and execute shared services integration plans by ensuring key milestones are met and dependencies managed</li><li>Conducts research, develops work plans and action steps and carries them through to meet internal and external stakeholder expectations</li><li>Leads select governance meetings and planning sessions with senior cross-functional leaders</li><li>Manages relationships with senior business leaders to provide regular updates on progress, identify barriers and risks, recommend path forward, and influence alignment on solutions</li><li>Provide status updates and regular reports to stakeholders</li><li>Identifies process standardization opportunities, leads the implementation of adoption of best practices and process improvement efforts</li><li>Manages complex, cross-functional workstreams to achieve operational readiness</li><li>Develops and applies decision frameworks to reach discrete outcomes with broad impact on the business</li><li>Oversees analysis, shapes data collection strategy, and supports quality review and interpretation of analysis</li><li>Sets direction, resolves problems, and provides guidance to junior teammates and shared cross-functional resources</li><li>Anticipates areas of difficulty/potential unknown risks, contributes towards creative solutions, and moves to action quickly</li><li>Drives work independently, determines next steps, highlights risk and barriers, and develops mitigation plan without extensive oversight<br/><br/></li></ul>You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>Experience in managed care organizations; medical group or IPA operations preferred</li><li>Intermediate level of experience with Microsoft Suite</li><li>Demonstrated project management, consulting, and facilitation skills</li><li>Proven proactive, self-starter with excellent project management skills and ability to drive change within an organization</li><li>Proven excellent communication skills with the ability to engage, influence, and inspire partners and stakeholders to drive collaboration and alignment</li><li>Proven high degree of organization, individual initiative, and personal accountability<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Supervisory experience</li><li>Direct experience in healthcare operations </li><li>Experience in management consulting, with mix of strategy and implementation of projects in care delivery settings </li><li>All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy<br/><br/></li></ul><strong>California Residents Only: </strong>The salary range for this role is $88,000 to $173,200 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.<br/><br/><em>At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission.<br/><br/></em><em>Diversity creates a healthier atmosphere: OptumCare is an Equal Employment Opportunity/Affirmative Action employers and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. <br/><br/></em><em>OptumCare is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.</em>", "responsibilities": "Partners with business leaders to develop and execute shared services integration plans by ensuring key milestones are met and dependencies managedConducts research, develops work plans and action steps and carries them through to meet internal and external stakeholder expectationsLeads select governance meetings and planning sessions with senior cross-functional leadersManages relationships with senior business leaders to provide regular updates on progress, identify barriers and risks, recommend path forward, and influence alignment on solutionsProvide status updates and regular reports to stakeholdersIdentifies process standardization opportunities, leads the implementation of adoption of best practices and process improvement effortsManages complex, cross-functional workstreams to achieve operational readinessDevelops and applies decision frameworks to reach discrete outcomes with broad impact on the businessOversees analysis, shapes data collection strategy, and supports quality review and interpretation of analysisSets direction, resolves problems, and provides guidance to junior teammates and shared cross-functional resourcesAnticipates areas of difficulty/potential unknown risks, contributes towards creative solutions, and moves to action quicklyDrives work independently, determines next steps, highlights risk and barriers, and develops mitigation plan without extensive oversight", "qualifications": {"required": "Experience in managed care organizations; medical group or IPA operations preferredIntermediate level of experience with Microsoft SuiteDemonstrated project management, consulting, and facilitation skillsProven proactive, self-starter with excellent project management skills and ability to drive change within an organizationProven excellent communication skills with the ability to engage, influence, and inspire partners and stakeholders to drive collaboration and alignmentProven high degree of organization, individual initiative, and personal accountability", "preferred": "Supervisory experienceDirect experience in healthcare operations Experience in management consulting, with mix of strategy and implementation of projects in care delivery settings All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy"}, "skills": ["Microsoft Suite", "Project Management", "Consulting", "Facilitation", "Communication", "Collaboration", "Leadership", "Healthcare Operations", "Managed Care", "IPA Operations", "Change Management"], "postedDate": "4 weeks ago", "benefits": "a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984386419"}