{"jobTitle": "Social Media Influencer Operations Manager", "company": {"name": "Think Academy U.S", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering", "industry": "Hospitality, Real Estate, and Travel Arrangements", "description": "<strong>Who We Are<br/><br/></strong>We are a leading education company from China expanding our children's consumer hardware business in the United States. We aim to create engaging and educational products that inspire young minds.<br/><br/><strong>Whom We Are Looking For<br/><br/></strong>We are seeking a dynamic and experienced Social Media Influencer Operations Manager to lead our influencer marketing efforts in the U.S. This role will be responsible for driving social media sales performance through effective management of influencers on platforms such as TikTok, overseas Xiaohongshu, Facebook, WeChat, Email, and other community channels. The ideal candidate will have strong skills in influencer business development, influencer-driven sales, and team management. <strong>Fluency in English and Mandarin is required</strong>; proficiency in Spanish is a plus.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Develop and execute strategies for influencer partnerships and campaigns on TikTok, overseas Xiaohongshu, and other relevant platforms.</li><li>Drive sales performance through effective influencer collaborations and promotions.</li><li>Manage relationships with influencers, negotiating contracts and ensuring successful campaign execution.</li><li>Oversee operations of all social media communities including Facebook, WeChat, and email marketing.</li><li>Lead and manage the U.S. influencer operations team, providing guidance and support to achieve targets.</li><li>Monitor and analyze campaign performance metrics, providing insights and recommendations for optimization.</li><li>Collaborate with cross-functional teams to align influencer activities with broader marketing goals.</li><li>Stay updated with industry trends and best practices in influencer marketing and social media.<br/><br/></li></ul><strong>How You Can Be Qualified<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Communications, or a related field.</li><li>Proven experience in influencer marketing and social media management.</li><li>Strong understanding of major social media platforms and their respective audiences.</li><li>Excellent communication and negotiation skills in both English and Mandarin; proficiency in Spanish is highly desirable.</li><li>Demonstrated ability to drive sales and meet performance targets. Experience managing a team and working in a fast-paced environment.</li><li>Creative thinker with strong problem-solving abilities. Ability to work independently and collaboratively within a team.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive salary and performance-based bonuses.</li><li>Health insurance and retirement benefits.</li><li>Opportunities for professional growth and development.</li><li>A collaborative and innovative work environment.<br/><br/></li></ul>If you are passionate about social media, influencer marketing, and making an impact in the education technology space, we would love to hear from you! !", "postedDate": "1 month ago", "skills": ["Social Media", "Influencer Marketing", "TikTok", "Xiaohongshu", "Facebook", "WeChat", "Email Marketing", "Team Management", "Sales", "Business Development", "English", "Mandarin", "Spanish"], "url": "https://www.linkedin.com/jobs/view/3984245833"}