{"jobTitle": "Patient Service Representative II - Neurology", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "24.34 - 36.51", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "<strong>Job Description<br/><br/></strong>Align yourself with an organization that has a reputation for excellence! Cedars-Sinai received the National Research Corporation’s Consumer Choice Award 19 times for providing the highest-quality medical care in Los Angeles. We also were awarded the Advisory Board Company’s Workplace of the Year, 3 years in a row. This recognizes hospitals and health systems nationwide that have outstanding levels of employee engagement. We offer an outstanding benefit package and competitive compensation. Come find out why Cedars-Sinai was Voted #1 in California and #2 in the Nation by U.S. News Best Hospitals in 2022-2023!<br/><br/><strong>Why work here?<br/><br/></strong>Beyond an outstanding benefit package and competitive salaries, we take pride in hiring the best, most committed employees. Our staff reflects the culturally and ethnically diverse community we serve. They are proof of our dedication to creating a multifaceted, inclusive environment that fuels innovation and the gold standard of patient care we strive for.<br/><br/><strong>What will you be doing in this role?<br/><br/></strong>The Patient Service Representative II following established practices, policies and guidelines, provides clerical and administrative support/duties while handling high volume of patient coordination and complex scheduling in the licensed clinics at Cedars-Sinai Medical Center. <strong>*This position will support 100% on-site.<br/><br/></strong>These responsibilities include:<br/><br/><ul><li>Answering and triaging calls- directing to appropriate individuals or departments.</li><li>Scheduling and authorization for appointments, surgeries and ancillary services.</li><li>Perform insurance verification functions.</li><li>Process and track all incoming and outgoing referrals.</li><li>Sorting and deposition of mail and patient information in compliance with HIPAA rules and regulations following Cedars-Sinai standards.</li><li>Assist in all work assignments.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required Qualifications:<br/><br/></strong><ul><li>High School Diploma/GED.</li><li>2 + years of experience working with insurance companies and obtaining authorizations.<br/><br/></li></ul><strong>About Us<br/><br/></strong>Cedars-Sinai is a leader in providing high-quality healthcare encompassing primary care, specialized medicine and research. Since 1902, Cedars-Sinai has evolved to meet the needs of one of the most diverse regions in the nation, setting standards in quality and innovative patient care, research, teaching and community service. Today, Cedars- Sinai is known for its national leadership in transforming healthcare for the benefit of patients. Cedars-Sinai impacts the future of healthcare by developing new approaches to treatment and educating tomorrow's health professionals. Additionally, Cedars-Sinai demonstrates a commitment to the community through programs that improve the health of its most vulnerable residents.<br/><br/><strong>About The Team<br/><br/></strong>Cedars-Sinai is one of the largest nonprofit academic medical centers in the U.S., with 886 licensed beds, 2,100 physicians, 2,800 nurses and thousands of other healthcare professionals and staff. Choose this if you want to work in a fast-paced environment that offers the highest level of care to people in the Los Angeles that need our care the most.<br/><br/><strong>Req ID</strong> : 3311<br/><br/><strong>Working Title</strong> : Patient Service Representative II - Neurology<br/><br/><strong>Department</strong> : Neurology<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Administrative<br/><br/><strong>Job Specialty</strong> : Admissions/Registration<br/><br/><strong>Overtime Status</strong> : NONEXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $24.34 - $36.51", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984898847"}