{"jobTitle": "Web Content Manager - Engagement & Resource Content", "company": {"name": "Corebridge Financial", "location": "Los Angeles, CA", "industry": "Financial Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "94,800.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Financial Services", "description": "Corebridge Financial is looking for a digital content leader with expertise in writing web content, developing content strategies, content planning, content creation and content delivery to support our company, brand activation and thought leadership activities.<br/><br/><strong>Who We Are<br/><br/></strong>Corebridge Financial helps people make some of the most meaningful decisions they’re ever going to make. We help them plan and take action to protect the future they envision, and respond to some of life’s most difficult moments through the solutions and services we provide. We do this through our broad portfolio of life insurance, retirement and institutional products, offered through an extensive, multichannel distribution network. We provide solutions for a brighter future through our client centered service, breadth of product expertise, deep distribution relationships, and outstanding team of hardworking and passionate employees.<br/><br/><strong>Get to know the business<br/><br/></strong>Life and Retirement is a unique franchise that brings together a broad portfolio of life insurance, retirement and institutional products offered through an extensive, multichannel distribution network. It holds longstanding, leading market positions in many of the markets it serves in the U.S.<br/><br/><strong>Overview Of The Position<br/><br/></strong>Reporting to the Head of Web Strategy &amp; Governance, the Web Content Manager will drive content creation, planning and strategy for CorebridgeFinancial.com and related digital properties. Primarily, this role will define a digital content production and optimization pipeline focused on corporate positioning, brand journalism, investor relations, thought leadership, community philanthropy, human resources &amp; recruitment, events and client help/resources.<br/><br/>This role will also manage the relationship with content authors and designers to research, plan, create, measure and test content to drive engagement with Corebridge Financial products and services. Among these responsibilities, the role will be a champion for the value of content with regards to SEO and how content can move a user through the sales funnel.<br/><br/>The ideal candidate should have extensive digital content creation experience within the financial services industry, have 5+ years of hands-on SEO experience and have 5+ years of hands-on experience with Adobe Experience Manager Sites, Adobe Experience Manager Assets, Adobe Analytics and understand the complexities and compliance requirements of the financial services industry.<br/><br/>This role will collaborate with marketing leaders across the organization to architect, create and govern content across publications. This role will also partner with the digital product and data teams to continually improve and evolve our digital solutions.<br/><br/><strong>Responsibilities (including, But Not Limited To)<br/><br/></strong><ul><li>Create and manage content pipelines across multiple disciplines including thought leadership, brand journalism, community philanthropy, human resources &amp; recruitment, events, and client support/help resources.</li><li>Define, plan and create content strategies and calendars inclusive of seasonality, audience segments, and existing content libraries (PDFs, print and traditional media assets).</li><li>Incorporate SEO strategies and best practices during the content creation process.</li><li>Create and manage content within Adobe Experience Manager inclusive of Sites &amp; Pages, Content Fragments, Assets, Experience Fragments and Tags.</li><li>Support ongoing software roadmaps through identifying new requirements/features, reporting bugs, collaborating with UX designers and testing/approving new feature development.</li><li>Monitor and analyze how our competitors are representing themselves, promoting their products and supporting the client experience through web strategies.<br/><br/></li></ul><strong>What You Need To Know<br/><br/></strong><ul><li>College degree in Marketing, Communications, Multimedia, Interactive Media, Journalism or similar program. </li><li>5+ years of specialized experience creating and managing content calendars in support of financial concepts and products within the retirement, savings and insurance industries.</li><li>5+ years of experience and/or certification with web content management systems such as Adobe Experience Manager, Yext, Content Stack, Drupal, Sitecore, WordPress, Contentful, Optimizely, Webflow, etc.</li><li>5+ years of experience tagging, tracking and analyzing content impact through advanced use of data platforms such as Adobe Analytics, Claravine, Google Search Console, SEMrush, and Conductor, among others.</li><li>Subject matter expertise with SEO tools such as Conductor, BrightEdge, and Semrush regarding content generation, content auditing and content optimization.</li><li>Experience utilizing a marketing operations platform to create content calendars and production pipelines such as Aprimo, Workfront, Wrike, etc..</li><li>General understanding and familiarity with AGILE development with experience supporting feature development (release planning, user stories, acceptance criteria, UAT support, etc.).</li><li>Strong writing skills including 3+ years of financial industry experience planning, creating and managing digital content.<br/><br/></li></ul><strong>What our employees like most about working for Corebridge Financial Life &amp; Retirement<br/><br/></strong><ul><li>We care about your professional development. Our career progression program will provide you with the opportunity to develop your skills, strengthen your productivity and be eligible to progressively advance to positions with an increased responsibility and increased compensation. </li><li>Our “Giving Back” policy is at the core of our daily operations and guides our future progress. Don’t believe us? We put our money where our mouth is! Corebridge Financial will give you up to 16 hours a year paid time off to volunteer in the community.</li><li>Our people are our most important asset therefore we provide a generous benefits plan and competitive pay.<br/><br/></li></ul><strong>Benefit package includes<br/><br/></strong><ul><li>Paid Time Off Corebridge Financial recognizes the importance of work life balance). We offer 24 PTO days to start. YES, 24!</li><li>17 paid holidays per calendar year. </li><li>A 401(k) Retirement Plan which will be HARD TO BEAT. Our 401K - $1 for $1 match up to 6% with immediate vesting, plus Corebridge Financial automatically contributes an additional 3% into your 401K regardless of if you enroll or not.<br/><br/></li></ul>For positions based in Woodland Hills, CA, the base salary range is $94,800-$130,000 and the position is eligible for a bonus in accordance with the terms of the applicable incentive plan. In addition, we're proud to offer a range of competitive benefits, a summary of which can be viewed here: Benefits Overview.<br/><br/><strong>We are an Equal Opportunity Employer <br/><br/></strong>Corebridge Financial, Inc., its subsidiaries and affiliates are committed to be an Equal Opportunity Employer and its policies and procedures reflect this commitment. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories such as sexual orientation. At Corebridge Financial, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.<br/><br/>To learn more please visit: www.corebridgefinancial.com<br/><br/>Corebridge Financial is committed to working with and providing reasonable accommodations to job applicants and employees with physical or mental disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to complete any part of the application or hiring process, please send an email to TalentandInclusion@corebridgefinancial.com. Reasonable accommodations will be determined on a case-by-case basis.<br/><br/>We consider qualified applicants with criminal histories, consistent with applicable law.<br/><br/><strong>Functional Area<br/><br/></strong>CM - Communications<br/><br/>Estimated Travel Percentage (%): Up to 25%<br/><br/>Relocation Provided: No<br/><br/>American General Life Insurance Company", "responsibilities": "<ul><li>Create and manage content pipelines across multiple disciplines including thought leadership, brand journalism, community philanthropy, human resources &amp; recruitment, events, and client support/help resources.</li><li>Define, plan and create content strategies and calendars inclusive of seasonality, audience segments, and existing content libraries (PDFs, print and traditional media assets).</li><li>Incorporate SEO strategies and best practices during the content creation process.</li><li>Create and manage content within Adobe Experience Manager inclusive of Sites &amp; Pages, Content Fragments, Assets, Experience Fragments and Tags.</li><li>Support ongoing software roadmaps through identifying new requirements/features, reporting bugs, collaborating with UX designers and testing/approving new feature development.</li><li>Monitor and analyze how our competitors are representing themselves, promoting their products and supporting the client experience through web strategies.<br/><br/></li></ul>", "qualifications": {"required": "College degree in Marketing, Communications, Multimedia, Interactive Media, Journalism or similar program. \n5+ years of specialized experience creating and managing content calendars in support of financial concepts and products within the retirement, savings and insurance industries.\n5+ years of experience and/or certification with web content management systems such as Adobe Experience Manager, Yext, Content Stack, Drupal, Sitecore, WordPress, Contentful, Optimizely, Webflow, etc.\n5+ years of experience tagging, tracking and analyzing content impact through advanced use of data platforms such as Adobe Analytics, Claravine, Google Search Console, SEMrush, and Conductor, among others.\nSubject matter expertise with SEO tools such as Conductor, BrightEdge, and Semrush regarding content generation, content auditing and content optimization.\nExperience utilizing a marketing operations platform to create content calendars and production pipelines such as Aprimo, Workfront, Wrike, etc..\nGeneral understanding and familiarity with AGILE development with experience supporting feature development (release planning, user stories, acceptance criteria, UAT support, etc.).\nStrong writing skills including 3+ years of financial industry experience planning, creating and managing digital content.", "preferred": ""}, "skills": ["SEO", "Content Strategy", "Content Management", "Adobe Experience Manager", "Adobe Analytics", "Digital Marketing", "Financial Services", "Content Creation", "Content Marketing", "Web Content", "Marketing", "Communications", "Multimedia", "Interactive Media", "Journalism", "Agile Development", "Marketing Operations", "Writing", "Editing"], "postedDate": "3 weeks ago", "benefits": "<ul><li>We care about your professional development. Our career progression program will provide you with the opportunity to develop your skills, strengthen your productivity and be eligible to progressively advance to positions with an increased responsibility and increased compensation. </li><li>Our “Giving Back” policy is at the core of our daily operations and guides our future progress. Don’t believe us? We put our money where our mouth is! Corebridge Financial will give you up to 16 hours a year paid time off to volunteer in the community.</li><li>Our people are our most important asset therefore we provide a generous benefits plan and competitive pay.<br/><br/></li></ul><strong>Benefit package includes<br/><br/></strong><ul><li>Paid Time Off Corebridge Financial recognizes the importance of work life balance). We offer 24 PTO days to start. YES, 24!</li><li>17 paid holidays per calendar year. </li><li>A 401(k) Retirement Plan which will be HARD TO BEAT. Our 401K - $1 for $1 match up to 6% with immediate vesting, plus Corebridge Financial automatically contributes an additional 3% into your 401K regardless of if you enroll or not.<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984839070"}