{"jobTitle": "Head of Agency, Google Customer Solutions", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "211,000.00/yr - 300,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, General Business, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "Businesses that partner with Google come in all shapes, sizes, and market caps, and no one Google advertising solution works for all. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the direction and the strategy for how their advertising can reach thousands of users.\n\nAs the Head of Agency, you will focus on empowering your team to strengthen long-term relationships with our key Premier Partner agencies. You will lead and manage Google's agency team to provide the highest level of service to agency partners. You will work with your team to develop Google solutions to support the agencies on driving business growth through existing customers and improving the Agency go-to-market capabilities through education, agreements, and strategic value adds.\n\nIn this role, you will work through stakeholders and developing strategies that are focused on driving impact at scale. You will be an effective leader that embraces Google’s values and prioritizes team development, creating a robust culture of collaboration and ideation. You will work with cross-functional stakeholders and have a solid understanding of Google’s ecosystem and advertising solutions.\n\nGoogle Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.\n\nThe US base salary range for this full-time position is $211,000-$300,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n\n* Recruit, retain, and develop a team of Strategic Agency Managers. Mentor and help them engage with executive stakeholders at key agencies.\n* Own and strengthen executive-level agency relationships through level navigation, engagement, joint planning, sponsorship, and create opportunities.\n* Build direction, focus, and accountability for sustained business planning and growth.\n* Drive cross-functional collaboration across key Partner teams globally to solve complex business challenges (e.g., marketing, technical support, strategy, product, finance, etc.).\n* Define the future of business management and help develop the necessary infrastructure and processes. Initiate and run strategic initiatives to further develop new and existing businesses.\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "* Recruit, retain, and develop a team of Strategic Agency Managers. Mentor and help them engage with executive stakeholders at key agencies.\n* Own and strengthen executive-level agency relationships through level navigation, engagement, joint planning, sponsorship, and create opportunities.\n* Build direction, focus, and accountability for sustained business planning and growth.\n* Drive cross-functional collaboration across key Partner teams globally to solve complex business challenges (e.g., marketing, technical support, strategy, product, finance, etc.).\n* Define the future of business management and help develop the necessary infrastructure and processes. Initiate and run strategic initiatives to further develop new and existing businesses.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n15 years of experience in advertising sales, sales enablement, or partnerships.\nExperience in building relationships with internal and external C-level stakeholders, particularly in an advertising or marketing context.\nExperience managing or coaching a sales, partnerships, or similar team with external-facing customers.", "preferred": "MBA or Master's degree.\nExperience promoting or consulting on complex digital advertising solutions, including Google Ads, YouTube, or other performance and video advertising solutions.\nExperience with advertising agency business models, either as an agency professional or third-party partner."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3985690128"}