{"jobTitle": "Assistant Manager, Product Marketing - Smashbox", "company": {"name": "Estée Lauder Companies South Africa", "industry": "Personal Care Product Manufacturing", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Standard", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$73,150.00 - $109,200.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "This role is responsible for crafting 3-year innovation pipeline, developing breakthrough innovations, project manage key programs, and work cross functionally to deliver products and programs that are on time and in budget. This role will also continue to leverage a consumer-first mindset in the key NA and EMEA markets.", "responsibilities": "Lead Product Innovation and Manage New Product Launches: Prepare concept briefs with consumer insight, competitive positioning, and key product concept/claims. Set and drive adherence to COGs targets, from prelim/target to final costs, with support from Finance. Guide product claims testing to ensure alignment with concept, in support of Product Development. Guide packaging, artwork/deco, and copy development to ensure alignment with concept, in close partnership with Packaging, Creative, and Artwork teams. Contribute to development of Marketing's product category strategy: Contribute to developing team's subcategory-focused expertise, working with Enterprise Marketing & Data to collect insights, and market analysis to inform go-to-market plans centered around consumer experience, that drives business and reinforces brand equity. Lead the briefing process from concept to the 360-marketing campaign: Effectively communicating and handing off all product marketing related aspects related to a new product launch to the Digital Marketing teams in order to create a campaign that is impactful and allows Creative and Commercial teams to build best in class and cost-effective campaigns. Liaison regional requests and communications all NPL cross-functional partners: Work closely with regional partners to gain buy in on new programs and financial ambition with a key focus on ULTA needs. Review sales estimates and forecasts for launches, with support from Global Business Planning group. While driving and build emerging marketing trends and technology capabilities to meet customers where they are. Prepares and presents marketing plans to Regions and affiliates, i.e. Sales Meetings, Regional Roundtables, etc. Create forums and initiate program development to ensure teams meet SBX strategic and financial objectives for specified segments: Develops concepts in Brand Innovation Tool for concept kick off, create programs within Global Marketing Website for regional review and forecasting. Key contributor in all NPL cross-functional meeting such as but not limited to NPDE, Program Technical Briefs and Sr. NPA. Provide direction and spearheads the development of launches and support programs with all necessary support groups on assigned projects (including Product Development, Packaging, Packaging Design, Creative, Legal, Business Planning, GBVC, Education, Digital and Commercial Marketing) to ensure they are delivered on time and within budget.", "qualifications": {"required": "4+ years of hands-on experience of leading projects and taking them from idea stage to actual in-market launch. 4+ years of experience and strong knowledge of the Product Development process. Develop and support in the creation of global strategic marketing plans for products and categories. Business reporting to help make product recommendations, including but not limited too NPD data, Mintel, and Statista. Analytics and business acumen, strong financial skills, analytical skills with internal data.", "preferred": "Capable of synthesizing data to drive business decisions. Forward-looking thinker. Strategic & Executional Abilities. Strategic mindset and capable of driving innovation plan from 3-5-year roadmap through operational business planning. Demonstrates inquisitive approach to decision making. Financial fluency. Disruptive mindset. Disciplined project management capabilities. Excellent communication, writing and quantitative skills. Ability to work in fast-paced highly creative environment with a sense of urgency. Team player with the ability to build, foster and nurture relationships with members of cross functional teams. Capable of structuring options and identifying tradeoffs. An endless curiosity for what's happening in the market and passion for beauty & trends."}, "skills": ["Product Development", "Marketing Strategy", "Project Management", "Consumer Insights", "Cross-functional Collaboration"], "postedDate": "4 weeks ago", "applicationDeadline": "Not specified", "benefits": "The Estée Lauder Companies offers a variety of benefits to eligible employees, including health insurance coverage, wellness and family support programs, life, and disability insurance, retirement savings plans, paid leave programs, education-related programs, paid holidays and vacation time, and many others. Many of these benefits are subsidized or fully paid for by the company.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985431427"}