{"jobTitle": "Medical Director", "company": {"name": "Seen Health", "location": "Alhambra, CA"}, "location": "Alhambra, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "About Seen Health<br/><br/>At Seen Health, we are revolutionizing the way senior care is delivered through the PACE (Programs of All-Inclusive Care for the Elderly) model. Backed by top VCs, Seen Health is a culturally-focused, technology-enabled healthcare organization that integrates comprehensive medical care and social support with a high-touch, interdisciplinary approach.<br/><br/>Our mission is to empower seniors to age-in-place with dignity and provide their families peace of mind. We are building upon a proven Home and community based services model to create a culturally-competent and scalable PACE program. We are also building a comprehensive operating system focused on data and workflows that span across systems, processes, people, and care contexts. We want to empower our clinicians and staff with tools that deliver relevant data at the time and site of care and enable them to deliver exceptional care to our participants, which improve clinical outcomes, participant &amp; provider satisfaction, and ultimately our strength as an organization.<br/><br/>We are a mission-driven, multidisciplinary team with deep healthcare, technology, and operations expertise, each inspired by our own personal stories of caring for seniors in our lives. Our name, Seen Health, was chosen to reflect our commitment to provide the highest standard of care to underserved older adults while respecting and incorporating their individual beliefs, heritage, and values, so that they can truly be <em>seen</em>.<br/><br/>About This Role<br/><br/>As an integral member of the leadership team, the Medical Director will support the design and development of Seen Health's clinical model and lead the day-to-day clinical operations of our PACE program. You will work closely with the Seen Health team to execute the mission, oversee all clinical teams, build and enhance a scalable care model, and shepard our commitment to positive team and participant experience. As a physician entrepreneur, you will have the unique opportunity to cultivate high-performing clinical talent, redefine traditionally fragmented senior care and caregiver experiences, and collaborate with our technology and operations teams to ensure the scalable delivery of culturally-sensitive, highest-quality care to underserved populations.<br/><br/>Responsibilities<br/><br/>\n<ul>\n<li>Design, refine, and execute our clinical model in support of enhancing participant's and their families' quality of life and improved value for Seen Health (including care standards, innovative care pathways, programs, and best practices, etc.) </li>\n<li>Work across disciplines and functions to drive continuous improvement for and innovate upon the existing PACE care model to provide best-in-class comprehensive care for the participants </li>\n<li>Serve as the clinical voice in all functional areas related to the opening of the Seen Health San Gabriel Valley PACE center, including meeting with state regulators and ensuring regulatory compliance </li>\n<li>Provide strategic planning, budgeting, and oversight leadership for Seen Health as a member of the Seen Health management team </li>\n<li>Represent clinical and participant input to inform technology development and prioritization, process improvement, and clinical innovation to reduce provider administrative and care coordination burden </li>\n<li>Direct participant care and oversee Seen Health's clinical impact, QAPI (Quality assurance performance improvement) plan, and outcomes while ensuring that we operate with high fidelity to the PACE care model (quality improvement, outcomes measurement, best-practice utilization, compliance) </li>\n<li>Build and manage a world-class, high-performing clinical team committed to setting the highest standards of participant outcomes and experience, data and research-driven clinical innovation, and interdisciplinary collaboration (with technology and operations teams) </li>\n<li>Provide clinical care in the capacity you determine best suited for the Seen Health, whether direct care of a small panel or in a supervisory role overseeing other providers </li>\n<li>Cultivate a culture of clinical integrity and accountability, direct and candid communication, adaptability and embracing change, technology affinity, and data-driven decision making among the clinical teams </li>\n<li>Collaborate with community and network partners, contracted medical providers, and other external stakeholders </li>\n<li>Champion PACE model and Seen Health program to external audiences, including local participant and medical communities <br/><br/></li>\n</ul>\nQualifications<br/><br/>\n<ul>\n<li>MD or DO required; active board certification in California for internal medicine, family medicine, geriatrics, complex care, home-based care, palliative care, or other related clinical area with continued certification throughout employment </li>\n<li>Geriatrics fellowship preferred </li>\n<li>Current and valid Drug Enforcement Agency Certificate </li>\n<li>Current, unrestricted medical license in the states in which we operate (California to start); if not currently licensed, willingness to become licensed upon hire </li>\n<li>Experience with capitated, integrated care delivery model including Medicare Shared Savings Programs, BPCI, or other Value Based Care Models </li>\n<li>Creative and enthusiastic commitment to the \"quadruple aim\": experience, health, and value for PACE participants, and healthcare team wellbeing, with particular passion and strong commitment to serving vulnerable seniors and frail older adults </li>\n<li>Knowledge and experience with chronic / geriatric care in the senior community in California; program development and community relations for the elderly and frail highly preferred </li>\n<li>Excellent leadership, interpersonal, and communication skills with adaptability to relevant audience; results-oriented work ethic and a positive, can-do attitude; strong people management and team building skills </li>\n<li>Creative and innovative problem solver that is able to think strategically and at a high level, while also able to focus on details and hone in at a granular level </li>\n<li>Native proficiency in Chinese or Cantonese highly preferred, conversational fluency required <br/><br/></li>\n</ul>\nLocation<br/><br/>\n<ul>\n<li>Alhambra, CA<br/><br/></li>\n</ul>\nBenefits<br/><br/>\n<ul>\n<li>Salary is competitive and includes benefits.</li>\n</ul>", "jobFunction": "Health Care Provider", "industry": "Technology, Information and Internet", "postedDate": "4 weeks ago", "benefits": "Salary is competitive and includes benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985311363"}