{"jobTitle": "Senior Product Manager, Customer Experience Technology", "company": {"name": "Crunchyroll", "industry": "Entertainment Providers", "size": "51-200 employees", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$154,678—$193,347", "currency": "USD"}, "jobFunction": "Product Management", "industry": "Entertainment Providers", "description": "WE HELP EVERYONE BELONG. IT’S OUR PURPOSE. Founded by fans, Crunchyroll delivers the art and culture of anime to a passionate community. We super-serve over 100 million anime and manga fans across 200+ countries and territories, and help them connect with the stories and characters they crave. Whether that experience is online or in-person, streaming video, theatrical, games, merchandise, events and more, it’s powered by the anime content we all love. Join our team, and help us shape the future of anime! As a Senior Product Manager, Customer Experience Technology, you will lead the strategy to replace and improve our customer service CRM and helpdesk tools. You'll lead the selection and implementation of new solutions, manage the request for proposal (RFP) process, and enhance both customer experience agent experience and customer satisfaction (CSAT). You'll collaborate with teams to identify problems and develop product epics, features, and user stories. You will facilitate brainstorming sessions, write detailed product briefs, and deliver precise requirements for Customer Service, Engineering, Program Management, Acquisitions, Legal, Finance, and Analytics.", "responsibilities": "Create strategies for customer service CRM and helpdesk tool replacement and optimization by collaborating with the Customer Experience team and customers to inform feature development and prioritization. Lead the selection and implementation process for new helpdesk tools, including market review and RFP. Develop and implement strategies to enhance customer satisfaction (CSAT) through improved helpdesk and admin tools. Collaborate with teams to identify business problems and develop high-level product epics, features, and user stories. Conduct regular brainstorming and specification sessions to ensure agreement across departments and partner organizations. Author detailed product briefs explaining the rationale and goals for new projects. Deliver streamlined product requirements that are easily understood by technical and non-technical audiences. Be the primary contact for product-related questions, issues, and feedback. Manage the product backlog, addressing delivery impediments or quality issues. Collaborate with product managers, program managers, engineers, designers, and other partners throughout the product development process.", "qualifications": {"required": "5+ years of experience shipping products and features for a consumer technology company. Specific experience with Customer Experience (CX) tools and helpdesk integrations. Track record in transaction flows, e-commerce, and checkout systems. Expertise in driving strategic growth for subscription and streaming service products. Experience working with Customer Service teams. Experience with customer experience metrics, including customer satisfaction and agent productivity metrics. Experience using technology to enhance operational efficiency, improve customer satisfaction, and exceed productivity goals. Excellent product judgment: You make sound judgments based on tradeoffs between different solutions, complex problems, multiple partners, and many constraints. You have an in-depth understanding of what makes a user experience good or bad and deliver what the customer wants to do. Experience writing detailed product specs and documentation: You easily recognize aesthetic and functional details and make decisions about what details are important. Experience managing multiple simultaneous projects. Experience communicating complex technical concepts to a variety of audiences with the ability to engage partners and collaborators to guide collaboration and understanding.", "preferred": ""}, "skills": ["Product Management", "Customer Experience", "CRM", "Helpdesk Tools", "E-commerce", "User Experience", "Product Development", "Collaboration", "Strategic Growth", "Documentation"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Receive a great compensation package including salary plus performance bonus earning potential, paid annually. Flexible time off policies allowing you to take the time you need to be your whole self. Generous medical, dental, vision, STD, LTD, and life insurance. Health Saving Account HSA program. Health care and dependent care FSA. 401(k) plan, with employer match. Employer paid commuter benefit. Support program for new parents. Pet insurance and some of our offices are pet friendly!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985828657"}