{"jobTitle": "Senior Manager, HR Business Partner", "company": {"name": "Hyundai Motor America", "industry": "Motor Vehicle Manufacturing", "size": "Large", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$107,800.00 - $154,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Motor Vehicle Manufacturing", "description": "At Hyundai, we’ve rethought our business and created cars that combine performance, quality, design and innovation into a complete package. It’s time you rethink what you expect from an employer. At Hyundai, we understand you're not just building a career – you're building a life. We believe in our people and realize that our success is a direct result of our commitment in offering you great opportunities for your career. If you would enjoy working in a dynamic environment and are looking for a chance to become part of a stellar team of professionals, we invite you to apply online today.", "responsibilities": "Act as a trusted advisor to executive management aiding in business and functional plans. Lead, develop, and inspire a team in a high-growth rapidly changing environment. Understand business goals and implement innovative approaches for continual improvement. Provide performance management guidance and coaching to management. Facilitate HR Programs and strategies through collaboration with clients and HR functional groups. Offer guidance and coaching on employee relations issues, focusing on scalable processes. Provide input on business function restructures, workforce planning, and succession planning. Proactively assess business performance and drive data-driven actions to support strategic objectives. Contribute to organizational design efforts to align structure with strategic goals. Utilize data to identify trends and recommend scalable solutions for people processes. Navigate rapid and complex work environments with autonomy and discretion. Monitor employee experience and engagement to ensure a high level of satisfaction. Oversee separation processes, including exit interviews and regulatory compliance. Lead a team of HR professionals at various levels.", "qualifications": {"required": "Eight or more years of direct HR experience. Three or more years of supervisory experience is required. Automotive OEM industry experience is preferred.", "preferred": "Bachelor’s degree preferred. Master’s degree a plus."}, "skills": ["Broad knowledge of HR functions to exercise sound judgment in decision-making.", "Ability to quickly build trusting relationships, gain credibility, and partner with leaders and peers.", "Strong change management and project management skills.", "Ability to motivate, influence, and optimize working relationships with senior leadership."], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Monthly Hyundai/Genesis vehicle lease allowance (including insurance and maintenance), Holiday Pay - the company shuts down with pay between Christmas and New Years, Vacation and sick time off, Healthcare insurance (medical, dental, and vision), 401(K) company match, Additional 401(K) Employer Enhanced Contribution program – eligible after 1 year of employment, in addition to the regular employer matching contribution, Basic life insurance, short- and long-term disability, Mental health, wellbeing, and employee assistance program, Health advocate (coordinate care and services, assistance with claim and billing issues, understanding Hyundai benefits)", "remoteWork": "60% Onsite/40% Remote", "url": "https://www.linkedin.com/jobs/view/3985024800"}