{"jobTitle": "Production Supervisor", "company": {"name": "Cicoil Corporation, A Trexon Company", "industry": "Appliances, Electrical, and Electronics Manufacturing", "size": "Not specified", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "As a Production Supervisor at Cicoil, a Trexon Company, this role will oversee our cable and wire harness assembly operations. The ideal candidate will have a strong background in lean manufacturing principles, ERP system knowledge (preferably Epicor), and bilingual proficiency in English and Spanish. This role requires excellent management and conflict resolution skills to lead a diverse team effectively. This includes ensuring efficient manufacturing processes, maintaining high standards of quality, and driving operational excellence as we expand our capabilities to meet increasing demand.", "responsibilities": "Establish production floor priorities based off company needs, assist Production Planner in developing the production schedule, read and analyze ERP data, monitor inventory levels, evaluate production processes, prepare monthly production forecasts, collaborate closely with Engineering and Quality Departments, monitor production metrics and KPIs, lead and supervise daily production activities, train and mentor production team members, conduct employee training, evaluate employee performance, uphold and enforce safety protocols.", "qualifications": {"required": "Bachelor’s degree in manufacturing, Engineering, or a related field is preferred, but not required. Three (3) to Five (5) years of experience in a production supervisory role, preferably in wire harness assembly or a related field.", "preferred": "Bilingual in English and Spanish, strong leadership skills, excellent problem-solving abilities, knowledge of lean manufacturing principles and practices, effective communication skills."}, "skills": ["Lean manufacturing", "ERP systems (Epicor)", "Bilingual (English and Spanish)", "Leadership", "Conflict resolution", "Data analytics"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985854687"}