{"jobTitle": "Product Marketing Manager, In-Store Experience, Amazon Fresh", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Public Relations and Marketing", "industry": "Software Development", "description": "Are you a builder who thrives in a fast-paced, startup environment? Do you enjoy working cross-functionally to improve experiences for customers? The Amazon Fresh In-Store Marketing team is looking for an entrepreneurial and organized Product Marketing Manager to help us build, scale and execute complex projects. Our team serves as the voice of our in-store customer. We advocate for a bar-raising CX through improved product experiences, streamlined customer communications and we are responsible for defining marketing requirements for key in-store tools and technologies. We utilize project management as a core discipline to build and drive scalable processes and programs to boost customer engagement and retention for our physical stores.\n\nThis role will work closely with Product, Tech and Pricing teams to influence the core roadmap for Electronic Shelf Labels (ELSs) as well as work with 3P agencies to drive enhancements for the signage ordering portal to optimize workflows for signage production and realize cost savings on asset development and internal bandwidth. You will own and manage relationships with several cross-functional stakeholders across product, advertising, UX Design, tech, pricing and marketing teams. You will set the vision for new initiatives leveraging customer insights and proactively anticipate customer needs.\n\nTo succeed in role, you must be a thoughtful project manager, possess strong business acumen, excellent organizational skills, acute analytical skills and the demonstrated ability to use creative thinking to solve complex problems. You should be comfortable with navigating through high degrees of ambiguity, have strong attention to detail and be motivated by a fast-paced startup environment. Strong written and verbal communication skills and an ability to influence partner teams will also be critical.\n\nKey job responsibilities\n\n<ul><li> Liaise with Product Development, Marketing, UX Design, Category, Legal, Pricing and other stakeholders to advocate on behalf of the customer to improve in-store experiences</li><li> Develop testing plans to evaluate how customers interact with key products and programs to inform business requirements and potential future enhancements</li><li> Prepare project schedules, define milestones, track and report progress, identify and mitigate risks and escalate / remove blockers as needed</li><li> Invent new mechanisms or recommend new tools to simplify manual tasks across the team’s workflows</li><li> Work with downstream Operations partners to drive excellence in execution for customer communications in our stores</li><li> Collect and build requirements with Pricing &amp; Promotions, Legal and UX Design teams to ensure all existing and new pricing constructs are conveyed accurately across customer communication touchpoints</li><li> Ability to develop and implement new concepts to the physical retail environment</li><li> Travel to various locations as needed to inform and implement new programs<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 4+ years of professional non-internship marketing experience</li><li> Experience building, executing and scaling cross-functional programs or marketing campaigns from concept to completion</li><li> Experience presenting ideas to various levels of an organization to gain support for initiatives</li><li> Experience using data and metrics to measure impact and determine improvements<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience managing external partners to develop marketing programs</li><li> Knowledge of analytical reporting tools (ie Excel, Tableau)</li><li> Experience managing and measuring marketing performance in various channels</li><li> Experience working in physical, brick &amp; mortar retail a plus<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $98,200/year in our lowest geographic market up to $179,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2688302", "responsibilities": "Liaise with Product Development, Marketing, UX Design, Category, Legal, Pricing and other stakeholders to advocate on behalf of the customer to improve in-store experiences\nDevelop testing plans to evaluate how customers interact with key products and programs to inform business requirements and potential future enhancements\nPrepare project schedules, define milestones, track and report progress, identify and mitigate risks and escalate / remove blockers as needed\nInvent new mechanisms or recommend new tools to simplify manual tasks across the team’s workflows\nWork with downstream Operations partners to drive excellence in execution for customer communications in our stores\nCollect and build requirements with Pricing &amp; Promotions, Legal and UX Design teams to ensure all existing and new pricing constructs are conveyed accurately across customer communication touchpoints\nAbility to develop and implement new concepts to the physical retail environment\nTravel to various locations as needed to inform and implement new programs", "qualifications": {"required": "4+ years of professional non-internship marketing experience\nExperience building, executing and scaling cross-functional programs or marketing campaigns from concept to completion\nExperience presenting ideas to various levels of an organization to gain support for initiatives\nExperience using data and metrics to measure impact and determine improvements", "preferred": "Experience managing external partners to develop marketing programs\nKnowledge of analytical reporting tools (ie Excel, Tableau)\nExperience managing and measuring marketing performance in various channels\nExperience working in physical, brick &amp; mortar retail a plus"}, "skills": ["Project Management", "Marketing", "Customer Experience", "Cross-functional Collaboration", "Product Development", "Data Analysis", "Communication", "Problem Solving", "Retail", "Excel", "Tableau"], "postedDate": "6 days ago", "salary": {"amount": "98,200.00/year - 179,600.00/year", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3985192330"}