{"jobTitle": "Attorney", "company": {"name": "Wisner Baum", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$100,000.00/yr - $125,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Law Practice", "description": "<strong>Why You Want to Work with Us</strong><p><br/></p><p>We are on a mission to fight for those harmed by corporate negligence, greed, fraud, and corruption thereby changing corporate conduct and creating a safer world. As part of our mission, we are leading the litigation for over 12,000 people who have developed cancer after taking the drug Zantac. </p><p><br/></p><p>This position reports directly to R. Brent Wisner who serves as both the Managing Partner and lead trial attorney. Renowned as one of America's 50 Most Influential Trial Lawyers by Trial Lawyer Magazine. Over the last several years, Brent has served on the plaintiff’s leadership for multiple mass torts, earned jury verdicts worth a combined $2.427 billion, and helped negotiate settlements in excess of $1 billion—all before the age of 40. He is currently the youngest attorney in American history to win a multi-billion-dollar jury verdict, which he achieved with a $2 billion Roundup cancer verdict against Monsanto. </p><p><br/></p><p><strong>Purpose and Impact of Your Role</strong></p><p><br/></p><p>As an Attorney within our Zantac litigation, you will be responsible for providing legal counsel on our complex Zantac litigation. Your role involves research, drafting legal documents, and developing litigation strategies to uphold the department's legal interests while navigating regulatory frameworks and ensuring compliance </p><p><br/></p><p><strong>What Outcomes Will You Achieve</strong></p><p><br/></p><ul><li>Provide well-organized and insightful legal summaries and memoranda to support senior attorneys in developing winning strategies.</li><li>Deliver accurate and well-crafted legal documents that effectively represent clients' interests.</li><li>Efficiently gather and organize evidence necessary to build a strong case foundation.</li><li>Actively participate in the preparation and execution of depositions. </li><li>Oversee the discovery process meticulously while collaborating closely with expert witnesses and you engage deeply in trial preparation.</li><li>Provide knowledgeable support to effectively advocate for clients in legal proceedings.</li><li>Maintain a strong understanding of the legal landscape to adapt strategies and provide the best possible client service.</li></ul><p><br/></p><p><strong>What You Will Bring to the Table</strong></p><p><br/></p><ul><li>Juris Doctor (JD) degree from an accredited law school.</li><li>Active member in good standing with the State Bar.</li><li>Excellent written and verbal communication skills.</li></ul><p><br/></p><p><strong>What You’ll Love About Us</strong></p><p><br/></p><p><strong>Our Vision and Mission. </strong>To create a world where products created by corporations are safe and effective.</p><p><strong>Great Company Culture.</strong> We pride ourselves on our exceptional culture where your growth is not just encouraged, but actively invested in. We know that when our team members thrive, our firm thrives, and allows us to have a positive impact on our world. </p><p><strong>Making an Impact.</strong> We know that each and every team member plays an important role in our mission. We recognize that investing in and empowering our team members leads to employees who are genuinely passionate about their work, which in turn maximizes their impact.</p><p><strong>Focused on your Growth.</strong> Our coaching, continuous feedback, and personalized development plans are designed to empower each team member to reach their full potential.</p><p><strong>Rest and Relaxation. </strong>We are committed to the well-being of our employees, and we understand the importance of a healthy work-life balance. To support this, we offer generous paid holidays, sick leave, and vacation time, so that our team members may step away from work when needed.</p><p><strong>Health Benefits. </strong>Our employees' physical and mental well-being is of utmost importance to us. That's why we offer comprehensive benefits that include medical, dental, and vision coverage, ensuring that you have access to quality healthcare. Additionally, we provide a 401(k) plan to help you secure your financial future.</p><p></p>", "responsibilities": "As an Attorney within our Zantac litigation, you will be responsible for providing legal counsel on our complex Zantac litigation. Your role involves research, drafting legal documents, and developing litigation strategies to uphold the department's legal interests while navigating regulatory frameworks and ensuring compliance ", "qualifications": {"required": "Juris Doctor (JD) degree from an accredited law school., Active member in good standing with the State Bar., Excellent written and verbal communication skills."}, "skills": [], "postedDate": "4 weeks ago", "benefits": "Our Vision and Mission. To create a world where products created by corporations are safe and effective., Great Company Culture. We pride ourselves on our exceptional culture where your growth is not just encouraged, but actively invested in. We know that when our team members thrive, our firm thrives, and allows us to have a positive impact on our world. , Making an Impact. We know that each and every team member plays an important role in our mission. We recognize that investing in and empowering our team members leads to employees who are genuinely passionate about their work, which in turn maximizes their impact., Focused on your Growth. Our coaching, continuous feedback, and personalized development plans are designed to empower each team member to reach their full potential., Rest and Relaxation. We are committed to the well-being of our employees, and we understand the importance of a healthy work-life balance. To support this, we offer generous paid holidays, sick leave, and vacation time, so that our team members may step away from work when needed., Health Benefits. Our employees' physical and mental well-being is of utmost importance to us. That's why we offer comprehensive benefits that include medical, dental, and vision coverage, ensuring that you have access to quality healthcare. Additionally, we provide a 401(k) plan to help you secure your financial future.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985857216"}