{"jobTitle": "Social Media Marketing Coordinator (Beauty)", "company": {"name": "Solomon Page", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "28-31/hr", "currency": "USD"}, "jobFunction": "Marketing and Advertising", "industry": "Personal Care Product Manufacturing and Retail Health and Personal Care Products", "description": "Our client, an award-winning skincare brand based in El Segundo, is looking for a Social Media Marketing Coordinator to join their team for a 3 month contract! This role will work a hybrid schedule in office 2 days per week. Please note, this role will require 1 hour of community management in the evenings and then 2-4 hours on the weekends.", "responsibilities": "Develop and implement social media strategies on Instagram to enhance brand visibility, engage the target audience, and drive growth\nCreate and curate engaging content for Instagram\nManage the social media content calendar, ensuring consistent posting and alignment with marketing campaigns and brand messaging\nMonitor social media channels for trends, customer feedback, and industry news to identify opportunities for content creation and engagement\nRespond to customer inquiries, comments, and messages in a timely and professional manner, fostering positive relationships and addressing concerns effectively\nCollaborate with the marketing and design teams to create visually appealing graphics, videos, and other multimedia content that aligns with brand guidelines\nTrack and analyze social media metrics, generate reports, and provide actionable insights to optimize performance and inform future strategies\nStay updated on industry trends, social media best practices, and emerging platforms to recommend innovative approaches and maintain a competitive edge", "qualifications": {"required": "Bachelor's degree in a related field\n3 years agency account management, copywriting, marketing project management, marketing or digital experience idea\nPrior social media and community management experience preferred\nStrong proficiency with Microsoft Suite including Word, PowerPoint, Excel, Visio\nExcellent organizational and communication skills\nStrong customer service skills\nAbility to multi-task in heavy workload environment\nFlexibility to adapt to a fast-paced growing business model", "preferred": ""}, "skills": ["Instagram", "Social Media", "Content Creation", "Community Management", "Microsoft Suite", "Word", "PowerPoint", "Excel", "Visio", "Marketing", "Digital Marketing", "Customer Service"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985696674"}