{"jobTitle": "Operations Manager (Microbiology Lab Buildout)", "company": {"name": "Element Materials Technology", "industry": "Pharmaceutical Manufacturing and Manufacturing", "size": "Not specified", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Pharmaceutical Manufacturing and Manufacturing", "description": "Element is a leading provider of testing, inspection, and certification services globally, specializing in the Life Sciences sector. Element is seeking an experienced business leader for a high-profile Operations Manager position within our Company, located in Santa Fe Springs, CA. This role is part of our leadership team and will be responsible for leading the strategy execution around a specific value stream in our North American Life Sciences Pharmaceutical business. In this role, you will plan, organize, coordinate and direct strategy execution to drive growth and strong customer relationships across our portfolio in multiple laboratories in the US and Canada. Emphasis will be placed on setting up a new service (testing) driven value stream in the first 6-12 months and then leading that value stream, ongoing.", "responsibilities": "Prioritize safety for colleagues and customers, embedding safety into all processes and designs. Develop and execute operational plans to expand revenue across assigned North American locations, focusing on revenue, margin commitments, capacity planning, and customer feedback. Lead strategy execution for specific value streams across laboratories, defining processes and KPIs to support revenue growth. Participate in customer-centric committees to align operational delivery with customer feedback. Foster a culture of continuous improvement in operational excellence, colleague engagement, and sustainable results. Act as a thought leader, influencing operational behaviors within our North American pharmaceutical labs. Collaborate effectively with support functions including Quality, Sales, Safety, Security, Finance, Human Resources, and Business Excellence. Align strategies with long-term business growth goals, leveraging industry knowledge and market conditions.", "qualifications": {"required": "10+ years of operations management experience, ideally within the pharmaceutical or TIC (Testing, Inspection, Certification) industries, managing operational delivery across multiple locations. Proven track record in operationalizing new service-driven value streams to meet evolving customer needs and strategic objectives. Strong critical thinking skills to analyze financial challenges and innovate solutions. Demonstrated experience in customer engagement and leading organizations to enhance customer service. Ability to lead through influence, aligning dynamic teams towards shared goals. Strong problem-solving skills, resolving business challenges with cross-functional teams. Effective collaboration with departments such as Sales, Marketing, Legal, Human Resources, and Finance. Exceptional multitasking ability in an intense, deadline-driven environment. Excellent communication skills, with the ability to articulate ideas clearly to internal and external stakeholders. Onsite presence required in Santa Fe Springs, CA, with up to 30% travel expected.", "preferred": "Not specified"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985580349"}