{"jobTitle": "Inside Sales Specialist - Solar Energy (Remote)", "company": {"name": "OTT HydroMet", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "54,800.00/yr - $67,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Environmental Services", "description": "Are you…<br/><br/><ul><li>Interested in working for an international and diverse company? </li><li>Interested in working for a company that is dedicated to sustainability? </li><li>Looking for a friendly and supporting team? <br/><br/><br/></li></ul>If so, read on!<br/><br/>Protecting water, the most valuable resource, and driving sustainability is very close to our hearts. You will be part of a flexible, family friendly organization that cares about its people just as it cares about the environment.<br/><br/><strong>We offer: <br/><br/></strong><ul><li>Flexible working hours </li><li>Professional onboarding and training options </li><li>Powerful team looking forward to working with you </li><li>Career coaching and development opportunities </li><li>Health benefits </li><li>Bonus</li><li>401(k) <br/><br/><br/></li></ul>The <strong>Inside Sales Specialist - Solar Energy</strong> is responsible for proactively managing assigned accounts, prospecting and cultivating new accounts to drive market penetration and accelerated sales growth. The Inside Sales Specialist will need to quickly build customer rapport and establish trust and credibility through a consultative selling style, thereby building a funnel of opportunities to close. Based upon the trends, preferences and needs of the solar market, you will lead both strategic and tactical marketing activities to improve market access, increase product adoption, achieve our sales targets, and maximize profitability.<br/><br/>This position is part of the Inside Sales department and will be remote.<br/><br/><strong>In this role, a typical day will look like:<br/><br/></strong><ul><li>Conduct targeted outbound calls and email campaigns to identify and qualify potential leads, demonstrating a proactive approach to lead generation. Field inbound leads to qualify and convert to sales opportunities. </li><li>Document and maintain customer interactions and activities in the CRM system, ensuring accurate and up-to-date records that contribute to effective pipeline management and strategic decision-making. </li><li>Collaborate with cross-functional teams, such as marketing and commercial operations, to develop and implement effective strategies for lead generation, ensuring a cohesive and aligned approach to sales initiatives. </li><li>Maintain a comprehensive understanding of OTT product and service offerings, staying informed about updates, features, and industry trends to effectively communicate value propositions to potential customers. </li><li>Drive results by achieving and surpassing monthly and quarterly sales &amp; bookings targets through a combination of lead qualification, relationship building, collaboration across the sales team, and effective sales techniques. <br/><br/><br/></li></ul><strong>The essential requirements of the job include:<br/><br/></strong><ul><li>1-3 years of direct B2B sales experience, preferably in the solar energy market. </li><li>Bachelor's degree.</li><li>Must demonstrate proficiency in using a CRM tool for funnel management and forecasting (Salesforce preferred). </li><li>Must be willing and able to travel up 2 to 3 weeks per year. Must have valid driver’s license &amp; acceptable driving record. <br/><br/><br/></li></ul><strong>It would be a plus if you also possess previous experience in:<br/><br/></strong><ul><li>Experience in distribution and channel partner development is a plus. </li><li>A degree in a management or science-related field such as Environmental Science, Hydrological and Meteorological Studies, Engineering, Business, or equivalent is an asset. </li><li>Formal sales training with experience in value and question-based selling is a plus. <br/><br/><br/></li></ul>In a world increasingly focused on how humans can responsibly live within our environment, <strong>OTT HydroMet</strong> (www.otthydromet.com) is on the frontlines, creating the critical water and weather solutions that ensure a safer future for us all. By partnering with our customers around the world, we help detect floods, make solar power more efficient, protect the environment, and ultimately save lives.<br/><br/>Our collaborative, diverse team is made up of engineers and scientists, marketers and researchers; people who’ve been in the industry for decades or have just arrived with fresh ideas. We’re driven by a love of problem-solving and inventive thinking, and by the unique impact our customers make on people’s everyday lives. Bringing our global team together within our renowned brands affords us unsurpassed strength and expertise in meteorology and hydrology—and gives you the chance to build a meaningful career.<br/><br/>Motivated by the highest possible stakes of climate change and global health, we’re working together within a rapidly digitizing industry to find innovative technologies that guarantee the safety of our water and our environment.<br/><br/>OTT HydroMet is proud to be a Water Quality company in Veralto (NYSE: VLTO). Imagine a world where everyone has access to clean water, safe food and medicine, and trusted essential goods. That is the tomorrow Veralto is creating today. Veralto is a $5B global leader in essential technology solutions made up of over 16,000 associates across our Water Quality and Product Identification segments all united by a powerful purpose: Safeguarding the World’s Most Vital Resources.<br/><br/><strong>US ONLY:<br/><br/></strong>The below range reflects the range of possible compensation for this role at the time of this posting. We may ultimately pay more or less than the posted range. This range may be modified in the future. An associate’s position within the salary range will be based on several factors, including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, shift, travel requirements, sales or revenue-based metrics, any collective bargaining agreements, and business or organizational needs.<br/><br/>The compensation range for this role is $54,800 - $67,000 USD per year. This job is also eligible for Bonus Pay.<br/><br/>We offer a comprehensive package of benefits including paid time off, medical/dental/vision insurance and 401(k) to eligible employees.<br/><br/>Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.<br/><br/>US residents: In any materials you submit, you may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.<br/><br/>Veralto Corporation and all Veralto Companies are committed to equal opportunity regardless of race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. We value diversity and the existence of similarities and differences, both visible and not, found in our workforce, workplace and throughout the markets we serve. Our associates, customers and shareholders contribute unique and different perspectives as a result of these diverse attributes.<br/><br/>The EEO posters are available <strong>here</strong>.<br/><br/>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us at applyassistance@veralto.com to request accommodation.<br/><br/><strong>Unsolicited Assistance<br/><br/></strong>We do not accept unsolicited assistance from any headhunters or recruitment firms for any of our job openings. All resumes or profiles submitted by search firms to any employee at any of the Veralto companies, in any form without a valid, signed search agreement in place for the specific position, approved by Talent Acquisition, will be deemed the sole property of Veralto and its companies. No fee will be paid in the event the candidate is hired by Veralto and its companies because of the unsolicited referral.", "responsibilities": "The <strong>Inside Sales Specialist - Solar Energy</strong> is responsible for proactively managing assigned accounts, prospecting and cultivating new accounts to drive market penetration and accelerated sales growth. The Inside Sales Specialist will need to quickly build customer rapport and establish trust and credibility through a consultative selling style, thereby building a funnel of opportunities to close. Based upon the trends, preferences and needs of the solar market, you will lead both strategic and tactical marketing activities to improve market access, increase product adoption, achieve our sales targets, and maximize profitability.", "qualifications": {"required": "1-3 years of direct B2B sales experience, preferably in the solar energy market. \nBachelor's degree.\nMust demonstrate proficiency in using a CRM tool for funnel management and forecasting (Salesforce preferred). \nMust be willing and able to travel up 2 to 3 weeks per year. Must have valid driver’s license &amp; acceptable driving record. ", "preferred": "Experience in distribution and channel partner development is a plus. \nA degree in a management or science-related field such as Environmental Science, Hydrological and Meteorological Studies, Engineering, Business, or equivalent is an asset. \nFormal sales training with experience in value and question-based selling is a plus. "}, "skills": ["Sales", "CRM", "Lead Generation", "Salesforce", "Marketing", "Customer Relationship Management", "Business Development", "Sales Management", "Account Management", "Sales Operations", "Outbound Sales", "Sales Strategy", "Pipeline Management", "Sales Forecasting", "Solar Energy"], "postedDate": "6 days ago", "benefits": "Flexible working hours \nProfessional onboarding and training options \nPowerful team looking forward to working with you \nCareer coaching and development opportunities \nHealth benefits \nBonus\n401(k) ", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3985330862"}