{"jobTitle": "Commercial Counsel, Corporate Services", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Responsibilities<br/><br/>Company Summary:<br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible.<br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day.<br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always.<br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve.<br/>Join us.<br/><br/>About the Team<br/>The US Commercial, IP &amp; Law Enforcement Legal Team (the \"Team\") is a member of the Global Legal, Business Solutions &amp; Corporate Compliance team, primarily covering TikTok and supporting other products and services. The Team provides key legal support for all of TikTok’s innovative initiatives, state-of-the-art products, and integrated platforms servicing our global video and other markets. We help our product, business, and corporate &amp; functional services teams enable their vision by providing integrated legal guidance and support. The Team is continuing to grow, and is seeking experienced, bright and capable legal professionals to join us. The ideal candidate will not only be adept at providing legal guidance, but will also be business-savvy, understanding the company's overarching goals and objectives. <br/><br/>Responsibilities <br/>- Provide strategic counsel on a broad range of initiatives, and draft and negotiate a wide range of commercial agreements, supporting both TikTok and other products and services, such as Pico, CapCut, Lemon8, SoundOn, etc.<br/>- Provide adept support to the Corporate Services function (i.e., procurement, global real estate, administration, facilities, global security, infrastructure, etc.), and the other Team verticals (Content, Marketing, Distribution Partnerships, Functional Services, IP, Law Enforcement, etc.). <br/>- Work collaboratively and cross-functionally with other legal teams (locally and globally) and with internal stakeholders across various functions and departments (including Procurement, Privacy, Global Security, Finance, Tax, Logistics, Trust and Safety, Communications/PR, Risk, and US Data Security). <br/><br/>Qualifications<br/><br/>Minimum Qualifications<br/>- Bachelor’s degree plus a Juris Doctorate (or equivalent) from an ABA-accredited law school or international accredited school of law <br/>- Experience practicing law at a top-tier law firm, and/or in-house <br/>- A wealth of experience specializing in general commercial transactions and business counseling, preferably with prior experience supporting a Procurement team <br/>- Prior experience supporting a heavy volume of commercial transactions across various business functions in a fast-paced environment<br/>- Outstanding analytical, communication, organizational, negotiation, and drafting skills <br/><br/>Preferred Qualifications:<br/>- Prior experience in other relevant subject matter areas (including marketing, entertainment, content, data privacy, advertising, and technology)<br/> - Tech-savvy, diligent, and a fast learner, combined with a strong work ethic and the ability to work independently <br/>- Excellent legal and business judgment, strategic thinking, and the ability to manage multiple matters simultaneously<br/>- Strong executive presence and integrity<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2. <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $180500 - $303240 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "jobFunction": "Legal and General Business", "industry": "Entertainment Providers", "postedDate": "6 days ago", "salary": {"amount": "180500 - 303240", "currency": "USD"}, "skills": ["Commercial Transactions", "Business Counseling", "Procurement", "Legal Guidance", "Negotiation", "Drafting", "Marketing", "Entertainment", "Content", "Data Privacy", "Advertising", "Technology", "Strategic Thinking", "Executive Presence", "Integrity"], "url": "https://www.linkedin.com/jobs/view/3985348437"}