{"jobTitle": "Clinical Research Coordinator, Health and Wellbeing", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "116,000.00/yr - 166,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "The Health Health and Wellbeing Team at Meta is seeking a Clinical Research Coordinator to support data collection. This role will work with a team of multidisciplinary stakeholders to support planning and execution of multiple levels of research and validation of novel approaches. The appropriate candidate can manage multiple aspects of research including aligning internal stakeholders (i.e. research teams, engineering, legal) and external partners (i.e. vendors, academic collaborators, IRB, regulators) to achieve concrete research and product goals. The ideal candidate brings a wealth of skill in executing high quality scientific research and also understands the goals and needs required to ship high quality digital products.<br/><br/>Clinical Research Coordinator, Health and Wellbeing Responsibilities:<br/><br/><ul><li>Coordinate clinical technology validation studies, leading operational planning and day-to-day management of research execution.</li><li>Serve as primary contact with research participants, vendors, and research leads. Coordinate studies from startup through close-out</li><li>Develop and manage data collection processes. Maintain research project databases, develop flow sheets and other relevant study documentation</li><li>Maintain research schedule, communicate study milestones and reporting to research team</li><li>Assist research team with Institutional Review Board (IRB) submission and compliance management</li><li>Align operational aspects of research with the needs of other internal stakeholders including engineering, legal, and product requirements</li><li>Assist research team with the assessment and implementation of new processes to gain efficiencies for study set up and administration</li><li>Travel at least 30%<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Bachelor's degree or higher in an area requiring significant human subjects research.</li><li>2+ years of experience with clinical research in either academic and/or commercial settings, with a proven understanding of the study lifecycle and clinical research ecosystem.</li><li>A proven knowledge and proficiency in navigating the sensitive issues around human subjects and clinical research in digital health.</li><li>Technical expertise in study start-up, human subjects enrollment, consenting, data collection and data management.</li><li>4+ years experience working with multidisciplinary stakeholders such as research scientists, statisticians, product managers, software engineers.<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Strong technical experience in digital health and wearable technologies, skills to troubleshoot clinical research related issues.</li><li>Familiar with software and hardware tooling, electronic data capturing systems that support clinical research studies.</li><li>Experience in working with contracted research organizations.<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$116,000/year to $166,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Coordinate clinical technology validation studies, leading operational planning and day-to-day management of research execution.\nServe as primary contact with research participants, vendors, and research leads. Coordinate studies from startup through close-out\nDevelop and manage data collection processes. Maintain research project databases, develop flow sheets and other relevant study documentation\nMaintain research schedule, communicate study milestones and reporting to research team\nAssist research team with Institutional Review Board (IRB) submission and compliance management\nAlign operational aspects of research with the needs of other internal stakeholders including engineering, legal, and product requirements\nAssist research team with the assessment and implementation of new processes to gain efficiencies for study set up and administration\nTravel at least 30%", "qualifications": {"required": "Bachelor's degree or higher in an area requiring significant human subjects research.\n2+ years of experience with clinical research in either academic and/or commercial settings, with a proven understanding of the study lifecycle and clinical research ecosystem.\nA proven knowledge and proficiency in navigating the sensitive issues around human subjects and clinical research in digital health.\nTechnical expertise in study start-up, human subjects enrollment, consenting, data collection and data management.\n4+ years experience working with multidisciplinary stakeholders such as research scientists, statisticians, product managers, software engineers.", "preferred": "Strong technical experience in digital health and wearable technologies, skills to troubleshoot clinical research related issues.\nFamiliar with software and hardware tooling, electronic data capturing systems that support clinical research studies.\nExperience in working with contracted research organizations."}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "$116,000/year to $166,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3985221550"}