{"jobTitle": "Transportation Analyst", "company": {"name": "Developlus Inc", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "28.00/hr - 30.00/hr", "currency": "USD"}, "jobFunction": "Analyst", "industry": "Manufacturing", "description": "<strong>Position Title:</strong>\n<p><strong>Transportation / Logistics Analyst </strong></p>\n<p><br/></p>\n<p><strong>Function:</strong></p>\n<p>Provides analytical support to DVP Operations as a point of contact for issues, resolutions,\nalignment, compliance, and usage of systems used for transportation analysis. Responsibilities\nrequire a detail-oriented person who can work within a fast paced, dynamic environment that\nroutinely involves analyzing, forecasting, and problem solving. This position reports to DVP\nSupply Chain Manager.</p>\n<p><br/></p>\n<p><strong>*Looking for a candidate with strong Excel skills and experience managing large freight shipments to chain accounts / large mass market customers.</strong></p>\n<p><br/></p>\n<p><strong>Essential Duties and Key Responsibilities:</strong></p>\n<p><br/></p>\n<ul>\n<li>Applies insight and experience to configure trend analysis, delivered cost, and recommend service solutions to benefit DVP and its customers</li>\n<li>Takes input from others in Supply Chain, and partners with DVP Operations, Finance, TPA’s and other Transportation partners to simplify complex, technical issues and recommend solutions</li>\n<li>Monitor important transportation metrics and develop actions plans with a focus on continuous improvement efforts</li>\n<li>Assist in the development of a daily shipment tracking report to improve the groups to ensure all orders are shipped as schedule</li>\n<li>File freight claims for lost or damaged product and track process for reimbursement</li>\n<li>Reviews and approves carriers Invoice for accuracy</li>\n<li>Verifies allocations, shipping instructions and other transportation related information to reconcile costs and analyze data. Assist in tracking inconsistencies in information</li>\n<li>Manage the tracking and reconciling of import duties, tariffs, and transportation costs to align cost</li>\n<li>Reconcile inventory versus incoming shipments</li>\n<li>Manages backorder reconciliation and expediting, as necessary. Provide analysis on demands and service levels and reconciles receiving</li>\n<li>Provides Supply Chain Manager weekly updates on the Dashboard for all deliverables, product shortage, late deliveries including any non-compliance fee deductions from customers</li>\n</ul>\n<p><br/></p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Previous experience as a Transportation Analyst or similar role</li>\n<li>Must have a strong understanding of the transportation and the logistic industry</li>\n<li>Excellent verbal and written communication skills with the ability to communicate professionally with people of different levels within the organization and external contact</li>\n<li>Ability to apply logical thinking and exercise sound judgment to arrive at appropriate business decisions</li>\n<li>Demonstrates the ability to remain professional and diplomatic when working under pressure</li>\n<li>Displays expense and cost control in decision making.</li>\n<li>Ability to stay organized and multi-task in a professional and efficient manner</li>\n<li>Excellent negotiation skills</li>\n<li>Must be proficient in MS Office (Outlook, Word, Excel)</li>\n<li>Gives attention to detail and follows instructions</li>\n<li>Works cooperatively and collaboratively within a group</li>\n<li>Ability to work independently with little supervision</li>\n<li>Adhere to company policies and procedures</li>\n</ul>\n<p><br/></p>\n<p><strong>Education/Experience:</strong></p>\n<ul>\n<li>Bachelor’s Degree in supply chain, transportation, supplier management, business administration or similar areas, is desired</li>\n<li>2-3 years’ experience in a responsible role working with a Transportation Management</li>\n<li>System to analyze data, present facts and recommend changes, is required</li>\n<li>Proficient in Microsoft Office, Outlook. Excel, word, and ERP System is required</li>\n</ul>\n<p><br/></p>\n<p><strong>Language Skills:</strong></p>\n<ul>\n<li>Effectively communicate with Supply Chain Manager and other administrative staff regarding transportation</li>\n<li>Communicate effectively with customers</li>\n</ul>\n<p><br/></p>\n<p><strong>Mathematical Skills:</strong></p>\n<p>Strong general mathematical skills with the ability to solve complex math problems and\nprovide report analysis</p>\n<p><br/></p>\n<p><strong>Reasoning Ability:</strong></p>\n<ul>\n<li>Strong research abilities</li>\n<li>Results driven</li>\n<li>Ability to remain on task</li>\n</ul>\n<p><br/></p>\n<p><strong>Physical Demands:</strong></p>\n<p>While performing the duties of this job, the employee is regularly required to talk and hear. This position is mostly sedentary and requires prolonged repetitive hand movements, may require some standing, walking, bending, lift up to 25 lbs and filing throughout the workday. Specific vision abilities required by this job include close vision and the ability to work in front of a computer monitor for extended periods of the day. This position also calls for occasional work in the warehouse and interacting with warehouse personnel as needed</p>\n<p><br/></p>\n<p><strong>Work Environment:</strong></p>\n<p>This position operates in a professional office setting, this position routinely uses standard office equipment such as computers, phones, copiers/ scanners, filing cabinet</p>", "responsibilities": "Provides analytical support to DVP Operations as a point of contact for issues, resolutions, alignment, compliance, and usage of systems used for transportation analysis. Responsibilities require a detail-oriented person who can work within a fast paced, dynamic environment that routinely involves analyzing, forecasting, and problem solving. This position reports to DVP Supply Chain Manager.", "qualifications": {"required": "Previous experience as a Transportation Analyst or similar role, Must have a strong understanding of the transportation and the logistic industry, Excellent verbal and written communication skills with the ability to communicate professionally with people of different levels within the organization and external contact, Ability to apply logical thinking and exercise sound judgment to arrive at appropriate business decisions, Demonstrates the ability to remain professional and diplomatic when working under pressure, Displays expense and cost control in decision making., Ability to stay organized and multi-task in a professional and efficient manner, Excellent negotiation skills, Must be proficient in MS Office (Outlook, Word, Excel), Gives attention to detail and follows instructions, Works cooperatively and collaboratively within a group, Ability to work independently with little supervision, Adhere to company policies and procedures", "preferred": "Bachelor’s Degree in supply chain, transportation, supplier management, business administration or similar areas, is desired, 2-3 years’ experience in a responsible role working with a Transportation Management, System to analyze data, present facts and recommend changes, is required, Proficient in Microsoft Office, Outlook. Excel, word, and ERP System is required"}, "skills": ["Transportation", "Logistics", "Analysis", "Forecasting", "Problem Solving", "Supply Chain", "Excel", "MS Office", "Outlook", "Word", "ERP System", "Communication", "Negotiation"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Tuition assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985134793"}