{"jobTitle": "Senior Manager Talent Acquisition - Americas", "company": {"name": "Marvell Technology", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Semiconductor Manufacturing", "description": "About Marvell\n\nMarvell’s semiconductor solutions are the essential building blocks of the data infrastructure that connects our world. Across enterprise, cloud and AI, automotive, and carrier architectures, our innovative technology is enabling new possibilities.\n\nAt Marvell, you can affect the arc of individual lives, lift the trajectory of entire industries, and fuel the transformative potential of tomorrow. For those looking to make their mark on purposeful and enduring innovation, above and beyond fleeting trends, Marvell is a place to thrive, learn, and lead.\n\nYour Team, Your Impact\n\nMarvell’s semiconductor solutions are the essential building blocks of the data infrastructure that connects our world. Across enterprise, cloud and AI, automotive, and carrier architectures, our innovative technology is enabling new possibilities.\n\nAt Marvell, you can affect the arc of individual lives, lift the trajectory of entire industries, and fuel the transformative potential of tomorrow. For those looking to make their mark on purposeful and enduring innovation, above and beyond fleeting trends, Marvell is a place to thrive, learn, and lead. bolster our market position.\n\nWhat You Can Expect\n\n<ul><li>Implement and oversee a standardized recruitment process.</li><li>Develop and execute region-specific recruitment strategies aligned with business objectives and local market conditions.</li><li>Leverage technology and data analytics to optimize the recruitment process and improve decision-making.</li><li>Foster strong partnerships with hiring managers, HR business partners, and senior leadership to understand and fulfill talent needs.</li><li>Ensure compliance with local labor laws and regulations across the diverse markets in the Americas.</li><li>Cultivate an inclusive recruitment approach that supports diversity initiatives and promotes equal opportunity.<br/><br/></li></ul>What We're Looking For\n\nAs our Senior Manager of Talent Acquisition for the Americas, you will report directly to the Head of Global Recruitment and play a pivotal role in shaping our Global Recruitment Team.\n\nYou'll lead and execute key recruitment activities across North and South America, including Argentina. Your mission will be to build and develop a team of strategic advisors, driving talent acquisition efforts throughout the region.\n\n<ul><li>Minimum 8 years of recruitment experience required.</li><li>At least 3 years of management experience in a talent acquisition role, demonstrating exceptional leadership and team development abilities, with a proven track record of building and mentoring high-performing recruitment teams.</li><li>Prior experience working in semiconductor and other technology companies required.</li><li>Proficient in staffing tools and systems (i.e. LinkedIn, Beamery, Workday) required.</li><li>Experience with OFCCP Compliance.</li><li>An avid learner, you approach challenges with curiosity and resilience, seeking data to help build understanding.</li><li>Demonstrates an inclusive mindset with the ability to adapt to diverse global norms, a strong commitment to fostering an inclusive workplace, and a passion for talent development and organizational growth.</li><li>Highly collaborative, with a proven ability to build strong relationships across all levels of the organization and humbly offer support to team members and stakeholders.</li><li>Innovative and adaptable, consistently exploring new ideas and solutions while quickly adjusting to changing business needs and industry trends.<br/><br/></li></ul>Expected Base Pay Range (USD)\n\n135,550 - 203,000, $ per annum\n\nThe successful candidate’s starting base pay will be determined based on job-related skills, experience, qualifications, work location and market conditions. The expected base pay range for this role may be modified based on market conditions.\n\nAdditional Compensation And Benefit Elements\n\nAt Marvell, we offer a total compensation package with a base, bonus and equity.Health and financial wellbeing are part of the package. That means flexible time off, 401k, plus a year-end shutdown, floating holidays, paid time off to volunteer. Have a question about our benefits packages - health or financial? Ask your recruiter during the interview process.\n\nThis role is eligible for our hybrid work model in which you will be able to split time between working from home and on-site in a Marvell office.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.\n\nAny applicant who requires a reasonable accommodation during the selection process should contact Marvell HR Helpdesk at TAOps@marvell.com.\n\n", "responsibilities": "Implement and oversee a standardized recruitment process.\nDevelop and execute region-specific recruitment strategies aligned with business objectives and local market conditions.\nLeverage technology and data analytics to optimize the recruitment process and improve decision-making.\nFoster strong partnerships with hiring managers, HR business partners, and senior leadership to understand and fulfill talent needs.\nEnsure compliance with local labor laws and regulations across the diverse markets in the Americas.\nCultivate an inclusive recruitment approach that supports diversity initiatives and promotes equal opportunity.", "qualifications": {"required": "Minimum 8 years of recruitment experience required.\nAt least 3 years of management experience in a talent acquisition role, demonstrating exceptional leadership and team development abilities, with a proven track record of building and mentoring high-performing recruitment teams.\nPrior experience working in semiconductor and other technology companies required.\nProficient in staffing tools and systems (i.e. LinkedIn, Beamery, Workday) required.\nExperience with OFCCP Compliance.\nAn avid learner, you approach challenges with curiosity and resilience, seeking data to help build understanding.\nDemonstrates an inclusive mindset with the ability to adapt to diverse global norms, a strong commitment to fostering an inclusive workplace, and a passion for talent development and organizational growth.\nHighly collaborative, with a proven ability to build strong relationships across all levels of the organization and humbly offer support to team members and stakeholders.\nInnovative and adaptable, consistently exploring new ideas and solutions while quickly adjusting to changing business needs and industry trends.", "preferred": ""}, "skills": ["Recruitment", "Talent Acquisition", "Semiconductor", "Technology", "LinkedIn", "Beamery", "Workday", "OFCCP Compliance", "Leadership", "Team Development", "Diversity", "Inclusion", "Collaboration", "Innovation", "Adaptability"], "postedDate": "6 days ago", "benefits": "At Marvell, we offer a total compensation package with a base, bonus and equity.Health and financial wellbeing are part of the package. That means flexible time off, 401k, plus a year-end shutdown, floating holidays, paid time off to volunteer. Have a question about our benefits packages - health or financial? Ask your recruiter during the interview process.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3985870298"}