{"jobTitle": "Administrative Assistant, Consumer Products", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "60,000.00/yr - 240,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is one of the world’s leading entertainment services with over 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/>The Team<br/><br/>Our growing global Consumer Products team brings our members' favorite stories to real life through products and experiences. The team is responsible for overseeing the business and creative execution across merchandise creation, product development, licensee relationships, publishing, marketing, as well as a global division focused on live experiences.<br/><br/>We are searching for an administrative assistant who is passionate about media and entertainment to support the leaders of our US/Canada/Australia and New Zealand team.<br/><br/><ul><li> Licensing - Developing the product plans and managing the partners that help bring our IPs to life through various product categories (toys, apparel, food &amp; beverage, beauty, etc.)</li><li> Retailing - Managing relationships with a wide variety of retail channels (mass, specialty, department stores, e-commerce, and more) where our products are sold, including our very own Netflix.shop</li><li> Marketing - promoting our products and retail programs across Netflix owned/earned channels as well as paid marketing<br/><br/></li></ul>The Role<br/><br/>We are looking for someone who is exceptionally detail-oriented, proactive, self-motivated, and collaborative. The pace of the team is demanding and thus the role requires flexibility, quick-thinking, and a growth mindset. We encourage curiosity and an eagerness to learn. The ideal candidate will also demonstrate passion for entertainment, media and marketing.<br/><br/><strong>Responsibilities Include, But Are Not Limited To<br/><br/></strong><ul><li>Proactive management of calendars for the leader and their team, including scheduling internal and external meetings</li><li>Book, manage, and coordinate logistics for team meetings, events, and offsite </li><li>Coordinating travel arrangements on a regular basis</li><li>Processing expense reports in a timely manner</li><li>Creating presentations and documents using Google Suite </li><li>Sitting in on meetings and taking notes </li><li>Assisting with team projects as needed<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5+ years of experience in an Administrative Assistant or Executive Assistant capacity </li><li>Proficiency in Google: Gmail, Google Calendar, Google Docs, Google Sheets, Google Groups</li><li>Strong written and verbal communication skills </li><li>Independent worker with strong organizational skills and the ability to prioritize and balance multiple projects and switch easily between tasks</li><li>Displays professionalism in communication with internal and external partners</li><li>Responsive and able to work flexibly across East Coast/West Coast time zones</li><li>Ability to be discrete and maintain confidential information</li><li>Strong judgment and ability to make decisions quickly</li><li>Strong attention to detail at all times</li><li>Team-player who operates in a fast-paced, team-oriented setting</li><li>Able to stay calm under pressure and work on short deadlinesPrior experience in media, marketing and/or entertainment is ideal<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $60,000- $240,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "<ul><li>Proactive management of calendars for the leader and their team, including scheduling internal and external meetings</li><li>Book, manage, and coordinate logistics for team meetings, events, and offsite </li><li>Coordinating travel arrangements on a regular basis</li><li>Processing expense reports in a timely manner</li><li>Creating presentations and documents using Google Suite </li><li>Sitting in on meetings and taking notes </li><li>Assisting with team projects as needed<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>5+ years of experience in an Administrative Assistant or Executive Assistant capacity </li><li>Proficiency in Google: Gmail, Google Calendar, Google Docs, Google Sheets, Google Groups</li><li>Strong written and verbal communication skills </li><li>Independent worker with strong organizational skills and the ability to prioritize and balance multiple projects and switch easily between tasks</li><li>Displays professionalism in communication with internal and external partners</li><li>Responsive and able to work flexibly across East Coast/West Coast time zones</li><li>Ability to be discrete and maintain confidential information</li><li>Strong judgment and ability to make decisions quickly</li><li>Strong attention to detail at all times</li><li>Team-player who operates in a fast-paced, team-oriented setting</li><li>Able to stay calm under pressure and work on short deadlinesPrior experience in media, marketing and/or entertainment is ideal<br/><br/></li></ul>", "preferred": ""}, "skills": ["Google Suite", "Communication", "Organization", "Prioritization", "Time Management", "Travel Coordination", "Expense Reporting", "Meeting Coordination", "Project Management", "Media", "Marketing", "Entertainment"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3985096110"}