{"jobTitle": "Clinic Manager", "company": {"name": "Carbon Health", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "As a physician-founded and led organization, ensuring everyone has access to quality healthcare is what inspires us. That’s why we hire people who genuinely care about patients, solving healthcare challenges, and making a positive impact every day. Join us and help change the future of healthcare for the better.<br/><br/><ul><li> 120+ locations and growing, along with vast virtual coverage</li><li> 1 million+ patients to-date</li><li> 2,000+ caring clinicians and support staff serving their communities</li><li> Backed by investors such as CVS Health Ventures and Blackstone Horizon<br/><br/></li></ul>The Clinic Manager is responsible for the daily management of a Carbon Health clinic. Managing all operational policies and procedures, clinic financials, patient experience and community outreach with an owner’s mindset, to ensure profitability. A successful clinic manager is intrinsically motivated, challenge-driven, rethinks traditions and genuinely cares about employees and patients.<br/><br/><strong>Key Capabilities<br/><br/></strong><strong>Collaborate: </strong> Shares information with others so there are no surprises; facilitates effective collaboration among clinic medical directors, clinic managers, and external partners<br/><br/><strong>Drive Outcomes: </strong> Eliminates obstacles that affect organizational performance.<br/><br/><strong>Influence and Inform: </strong> Negotiates skillfully in tough situations; facilitates management of differences by addressing them openly and encouraging mutually beneficial resolutions<br/><br/><strong>Demonstrate Accountability:</strong> Acts with a clear sense of ownership with exceptional organization and time management skills; establishes clear responsibilities and processes for delivering, monitoring and measuring results<br/><br/><strong>Manage through Ambiguity: </strong> Coaches others in finding solutions and accomplishing goals despite incomplete information<br/><br/><strong>Develop Self &amp; Others:</strong> Provide real-time coaching to others, mentors key talent and takes significant action for effectiveness in current and future jo<br/><br/><strong>About You<br/><br/></strong><ul><li>1+ year of healthcare leadership experience and/or combination of healthcare experience and education</li><li>Active listener that uses soft skills to build and maintain trusting relationships at all levels of the organization</li><li>Excellent communication and interpersonal, time management, planning, organizational, analytical, problem-solving, and critical thinking skills</li><li>Willing to work a flexible schedule including evenings, weekends and holidays<br/><br/></li></ul><strong>What You'll Do<br/><br/></strong><ul><li>Implement staffing standards for hiring, training/development, scheduling, timecards, payroll, and talent management according to Carbon Health best practices</li><li>Assess team member needs for scope of role, development needs, succession planning and clinic outcomes; create and promote development plans accordingly</li><li>Lead regular team meetings, resolve conflict when needed, motivate employees and foster a culture of communication that promotes employee retention</li><li>In partnership with the Clinic Medical Director - set, communicate and monitor clinical excellence standards of care and safety standards in keeping with regulatory agencies and Carbon Health policy; this includes daily standards, emergency preparedness and hazardous materials/waste programs, in addition security, equipment and utilities management</li><li>Build positive relationships with clinicians, support staff, patients, community and vendors; manage conflict with care and empathy</li><li>Communicate and respond to patient inquiries with a sense of urgency</li><li>Monitor and control clinic expenditures within approved budget using administrative guidelines, organization benchmarks and anticipated scope of services with an owner’s mindset</li><li>Institute necessary modifications to procedures and clinic resource commitments as financial changes dictate</li><li>Identify, plan and participate in marketing activities and community events that increase patient volume and engagement</li><li>Maintain an environment that complies with all state and federal regulations including HIPAA<br/><br/></li></ul><strong>Perks<br/><br/></strong><ul><li> Forward-thinking, transparent, and inclusive company culture</li><li> Competitive salary, generous paid time off, learning time off, and paid holidays</li><li> Comprehensive benefits package including medical, dental &amp; vision insurance</li><li> 401k employee contributions, FSA, HSA, and dependent care options</li><li> Employee referral bonus program, employee resource groups, and professional development</li><li> All benefits dependent on role and eligibility<br/><br/></li></ul>All candidate email communication will be done through an @carbonhealth.com email address. If you ever receive communication regarding a job posting from an entity that does not match that or seems concerning, please contact people@carbonhealth.com .<br/><br/>Carbon Health is a leading national healthcare provider with a mission to make high-quality healthcare accessible to everyone. We offer primary and urgent care to nearly two-thirds of the U.S. Leveraging our unique technology platform, we meet patients where they are by delivering care across a variety of access points, including in-person clinics and virtual care. Carbon Health also focuses on value-based care and other value-add services to employers, health plans, health systems and other ecosystem partners.<br/><br/>We recognize that the key to success lies in valuing the minds, experiences and perspectives of people from all walks of life. Carbon Health is proud to value diversity and be an equal opportunity employer. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, we will consider for employment qualified applicants with arrest and conviction records. Carbon Health is an E-Verify employer.", "responsibilities": "The Clinic Manager is responsible for the daily management of a Carbon Health clinic. Managing all operational policies and procedures, clinic financials, patient experience and community outreach with an owner’s mindset, to ensure profitability. A successful clinic manager is intrinsically motivated, challenge-driven, rethinks traditions and genuinely cares about employees and patients.", "postedDate": "1 week ago", "benefits": "Forward-thinking, transparent, and inclusive company culture, Competitive salary, generous paid time off, learning time off, and paid holidays, Comprehensive benefits package including medical, dental &amp; vision insurance, 401k employee contributions, FSA, HSA, and dependent care options, Employee referral bonus program, employee resource groups, and professional development, All benefits dependent on role and eligibility", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985182503"}