{"jobTitle": "Materials Handler", "company": {"name": "Campus4Tech", "location": "Simi Valley, CA"}, "location": "Simi Valley, CA 93063", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Professional Training and Coaching", "description": "<strong>Job Title : Materials Handler<br/><br/></strong><strong>Location : Simi Valley, CA 93063<br/><br/></strong><strong>Shift : 1st Shift (5AM-1:30PM)<br/><br/></strong><strong>Duration : 6 months<br/><br/></strong><strong>Job Description<br/><br/></strong><ul><li>The Materials Handler ensures proper and timely flow of all materials and products from arrival until stored or shipped, following established policies and procedures. Performs the physical or administrative tasks involved in the shipping, receiving, order fulfillment, storing and distributing of materials, parts, supplies and equipment, while following policies, procedures and safety regulations.<br/><br/></li></ul><strong>Job Core Responsibilities<br/><br/></strong><ul><li>Receives, stocks, and disburses parts or materials, loads or unloads trucks, and disburses parts, materials and supplies to other team members as required</li><li>Unpacks and checks goods received against purchase orders or invoices</li><li>Maintains records of received goods and rejects unsatisfactory items</li><li>Examines stocks and distributes materials in inventory and on manufacturing lines</li><li>Prepares and maintains records of merchandise shipped</li><li>Demonstrates all safety policies and procedures</li><li>Posts weights and shipping charges and prepares goods for final shipment</li><li>Demonstrates all safety policies and procedures</li><li>Other responsibilities as assigned</li><li>Regular, consistent and punctual attendance is required. May need to work nights and weekends, variable schedule(s) and additional hours as necessary<br/><br/></li></ul><strong>Job Specifications<br/><br/></strong><ul><li>Education : A Secondary Certificate/High School Diploma or equivalent combination of relevant education and work experience that will allow successful performance of job expectations.</li><li>Certifications : Vocational training, apprenticeships or the equivalent experience in related field</li><li>Years Experience: 2 years or more of relevant experience<br/><br/></li></ul><strong>Skills :<br/><br/></strong><ul><li>Ability to write, communicate and utilize math skills</li><li>Skilled in using powered industrial trucks, material handling equipment and small hand tools</li><li>Basic computer skills</li><li>Capable of operating within structured/supervised environment and follow written and oral instructions with little supervision</li></ul>", "postedDate": "3 weeks ago", "skills": ["Powered Industrial Trucks", "Material Handling Equipment", "Small Hand Tools", "Basic Computer Skills", "Communication", "Math Skills", "Written and Oral Instructions"], "url": "https://www.linkedin.com/jobs/view/3985198177"}