{"jobTitle": "Business Analyst II, PV Advertising", "company": {"name": "Prime Video & Amazon MGM Studios", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Strategy/Planning, Analyst, and Information Technology", "industry": "Entertainment Providers", "description": "Are you interested in shaping the future of movies and television, and being part of a team that is helping Amazon redefine the future of video advertising? Prime Video is a premium streaming service that offers customers a vast collection of TV shows and movies - all with the ease of finding what they love to watch in one place. Video Advertising is rapidly evolving as customers shift their viewing experiences from traditional linear TV to streaming via connected devices, and Prime Video is a rising player in this space.<br/><br/>Prime Video is looking for a Business Analyst II to support Prime Video Advertising and to help us translate advertising performance into actionable results. The ideal candidate can think strategically and execute to a high standard, has strong written and verbal communication skills, and is excited to experiment and learn in a data driven environment using customer and advertiser data to influence strategy and execution across multiple internal teams across Prime Video Advertising and Studios. The ideal candidate will be a self-starter who is comfortable working with large complex datasets, possesses strong analytical skills, and is an effective communicator.<br/><br/>Key job responsibilities<br/><br/><ul><li> Develop metrics, data sources, and promote data accuracy within operational reporting.</li><li> Leverage existing data sources to answer strategic business questions and identify insights that improve business performance.</li><li> Partner closely with Business Intelligence teams to update logic, spot errors, and create user-friendly formats of routine reports.</li><li> Perform business analysis and data queries using SQL, R etc<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of tax, finance or a related analytical field experience</li><li> Bachelor's degree or equivalent</li><li> Experience with Excel</li><li> Experience with SQL</li><li> Experience defining requirements and using data and metrics to draw business insights</li><li> Experience making business recommendations and influencing stakeholders<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $66,900/year in our lowest geographic market up to $143,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2664369", "responsibilities": "Develop metrics, data sources, and promote data accuracy within operational reporting. Leverage existing data sources to answer strategic business questions and identify insights that improve business performance. Partner closely with Business Intelligence teams to update logic, spot errors, and create user-friendly formats of routine reports. Perform business analysis and data queries using SQL, R etc", "qualifications": {"required": "3+ years of tax, finance or a related analytical field experience, Bachelor's degree or equivalent, Experience with Excel, Experience with SQL, Experience defining requirements and using data and metrics to draw business insights, Experience making business recommendations and influencing stakeholders", "preferred": "Experience in Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau"}, "skills": ["SQL", "Excel", "Business Intelligence", "Data Analysis", "Data Visualization", "Tableau"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985193197"}