{"jobTitle": "Full-Cycle Account Executive", "company": {"name": "Promenade Group", "industry": "Transportation, Logistics, Supply Chain and Storage", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90K - 110K", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Promenade, formerly known only as BloomNation, is looking for a Full-Cycle Account Executive to help us grow! We are looking for a competitive, coachable, and incredibly tenacious sales executive who is not only a true sales professional, but someone who can bring unique value to our rapidly growing team. As a results-driven sales executive, you will actively call on new clients and boost company revenue through customer acquisition. Joining our sales organization will give you the opportunity to apply your skill-set as you build and sustain customer growth through daily prospecting and running product demonstrations with small business owners. You'll also focus on building a strong referral network of both clients and vendors, and will join a collaborative team of sales professionals who support each other and create a friendly, competitive, and winning team culture. While our HQ is based in Santa Monica, CA (aka Silicon Beach), this role will be hybrid (unless you're local to Santa Monica and prefer to work daily in-person).", "responsibilities": "Hunt for net new partners primarily in our restaurant vertical. Build a pipeline of prospects and manage the sales stages from initiate to close. Successfully cultivate relationships at the owner level through research, cold-calling, channel partnerships, and professional networking. Meet and exceed monthly sales booking and revenue quotas. Plan, direct, and record sales activities, including management of the sales pipeline using our tech stack. Involved in all phases of the sales lifecycle including identifying and developing leads; meeting with clients; developing value propositions; financial deal structuring; contract negotiation and closing. Share industry, deal, and sales “best practice” knowledge with other members of the sales team. Understand the competitive landscape (strengths, weaknesses, features/benefits) and determine the unique value Promenade's brands deliver. Must collaborate with the Implementation team to ensure that expectations set during the sales process are met in onboarding and post-launch. Work with the Sales Director to effectively identify opportunities for market growth.", "qualifications": {"required": "At least 2 years of Sales closing experience. Experience hunting and closing new business. Ability to self generate at least 15 net new opportunities per month. Experience with and ability to consultative sell and close SMB's in short deal cycle. A proven sales process and track record of exceeding quota. Openness and willingness to be coached and mentored. A desire to be creative with your sales process and outreach. The ability to thrive in a fast-paced environment. An undying will to succeed! Multilingual is a plus!", "preferred": "Not specified"}, "skills": ["Sales", "Business Development", "Customer Acquisition", "Networking", "Sales Strategy", "Salesforce", "SalesLoft", "ChiliPiper"], "postedDate": "1 month ago", "applicationDeadline": "Not specified", "benefits": "Equity/Stock options in a profitable and rapidly growing company. Great Medical/Dental/Vision coverage. Transportation coverage in the form of parking, rideshare, or metro credit (for local candidates). Fully stocked snack bar & weekly catered lunches. Company provided gear & swag (MacBook Pro, t-shirt, sunglasses, etc.). Ability to mold your career and make an immediate impact. Work in a fast-paced, fun environment with an eclectic group of people from all over the world.", "remoteWork": "Hybrid (unless local to Santa Monica and prefer to work daily in-person)", "url": "https://www.linkedin.com/jobs/view/3985344998"}