{"jobTitle": "Blockchain Analyst", "company": {"name": "SideRamp", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Operations Consulting", "description": "SideRamp allows professionals to engage with part-time opportunities in the gig economy, offering a centralized platform that manages high-quality, flexible side gigs. We focus on connecting our users to various freelance and part-time work—from discovering opportunities to streamlining the application process.<br/><br/><strong>BLOCKCHAIN ANALYST<br/><br/></strong>Seeking an experienced Blockchain Analyst for a financial services team specializing in innovative investment solutions and portfolio management. The Blockchain Analyst will be responsible for researching, analyzing, and implementing blockchain technologies to enhance the firm's financial products and services. You will work closely with the IT and finance teams to identify blockchain applications that can improve operational efficiency and security. This role requires a deep understanding of blockchain technology, financial markets, and data analysis.<br/><br/><strong>Hourly Commitment:</strong> 10 to 15 hours per week<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Conduct in-depth research on blockchain technologies and their potential applications in financial services. </li><li>Analyze blockchain data and trends to provide insights and recommendations for business strategies. </li><li>Develop and maintain blockchain-based solutions to improve transaction security, transparency, and efficiency. </li><li>Collaborate with IT and finance teams to integrate blockchain technologies into existing systems and processes. </li><li>Monitor and evaluate the performance of blockchain applications, identifying areas for improvement. </li><li>Stay updated with the latest developments in blockchain technology, regulations, and industry best practices. </li><li>Prepare detailed reports and presentations on blockchain trends, insights, and project progress. </li><li>Ensure compliance with regulatory requirements and company policies related to blockchain usage. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s degree in Computer Science, Finance, or a related field. </li><li>3+ years of experience in blockchain analysis or related roles in financial services. </li><li>Strong understanding of blockchain technology, including smart contracts, consensus algorithms, and distributed ledgers. </li><li>Proficiency in programming languages such as Solidity, Python, or JavaScript. </li><li>Experience with blockchain platforms such as Ethereum, Hyperledger, or Corda. </li><li>Excellent analytical and problem-solving skills. </li><li>Strong communication skills to effectively present findings and recommendations. </li><li>Ability to work independently and as part of a team. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Master’s degree in a relevant field. </li><li>Experience in the financial services industry. </li><li>Certification in blockchain technology or related fields. </li><li>Knowledge of financial regulations and compliance related to blockchain technology. <br/><br/></li></ul><strong>Note:</strong><em> Job descriptions may have been edited from their original format to ensure fair hiring standards along with consistent formats across all postings. Salary information is not guaranteed and many estimates are based on a yearly, full-time salary. This system can make mistakes.</em>", "responsibilities": "Conduct in-depth research on blockchain technologies and their potential applications in financial services. Analyze blockchain data and trends to provide insights and recommendations for business strategies. Develop and maintain blockchain-based solutions to improve transaction security, transparency, and efficiency. Collaborate with IT and finance teams to integrate blockchain technologies into existing systems and processes. Monitor and evaluate the performance of blockchain applications, identifying areas for improvement. Stay updated with the latest developments in blockchain technology, regulations, and industry best practices. Prepare detailed reports and presentations on blockchain trends, insights, and project progress. Ensure compliance with regulatory requirements and company policies related to blockchain usage.", "qualifications": {"required": "Bachelor’s degree in Computer Science, Finance, or a related field. 3+ years of experience in blockchain analysis or related roles in financial services. Strong understanding of blockchain technology, including smart contracts, consensus algorithms, and distributed ledgers. Proficiency in programming languages such as Solidity, Python, or JavaScript. Experience with blockchain platforms such as Ethereum, Hyperledger, or Corda. Excellent analytical and problem-solving skills. Strong communication skills to effectively present findings and recommendations. Ability to work independently and as part of a team.", "preferred": "Master’s degree in a relevant field. Experience in the financial services industry. Certification in blockchain technology or related fields. Knowledge of financial regulations and compliance related to blockchain technology."}, "skills": ["Blockchain", "Solidity", "Python", "JavaScript", "Ethereum", "Hyperledger", "Corda", "Financial Services", "Data Analysis", "Problem Solving", "Communication"], "postedDate": "4 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985375233"}