{"jobTitle": "Executive Assistant, Amazon Ads", "company": {"name": "Amazon", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00/year - 107,100.00/year", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development", "description": "Amazon Ads seeks exceptional Executive Assistants for positions based in multiple locations. As valued team members, these EAs will support multiple business leaders.\n\nAmazon Ads operates at the intersection of eCommerce and advertising, offering a rich array of digital advertising solutions with the goal of helping our customers find and discover anything they want to buy. We help advertisers reach Amazon customers on Amazon owned and operated sites and on other high-quality sites across the web. We start with the customer and work backwards in everything we do, including advertising. If you’re interested in joining a growing team working to build a unique, world-class advertising product with a relentless focus on the customer, you’ve come to the right place!\n\nWe are looking for self-motivated, resourceful, tech-savvy problem solvers that demonstrate the ability to look around corners, understand business priorities and proactively anticipate needs. Attention to detail, strong organizational skills, and the ability to meet tight deadlines while juggling multiple critical requests across global teams is required. Successful candidates have the ability to complete complex tasks quickly and proactively with little to no guidance, react with appropriate urgency to situations that require a quick turnaround, and take effective action without having to know the whole picture. Strong written and verbal communication skills are a must. Integrity and discretion in handling confidential information and professionalism in dealing with senior executives internal and external to Amazon is essential. Working a minimum of three days a week in the office is required.\n\nThese roles function as part of a team of EAs working to facilitate and coordinate meetings, team activities and other projects. The ability to operate independently and collaboratively with a strong sense of ownership, bias for action, and a customer service-oriented approach is key to success.\n\nKey job responsibilities\n\n<ul><li>Complex calendar management, including coordinating all aspects of scheduling and logistics for internal and external meetings</li><li>Seamlessly managing detailed domestic and international travel itineraries, as well as processing expense reports</li><li>Coordinating in-person and virtual event logistics, including catering, accommodations, AV and presentation materials (e.g. global team meetings, annual planning offsites, morale-building activities, etc.)</li><li>Planning space for the team and facilitating office moves</li><li>Partnering closely and proactively with Finance, HR, Recruiting, and EAs throughout the Amazon Ads org</li><li>Attending key team meetings, tracking and helping drive completion of key deliverables, and following up on outstanding items</li><li>Identifying internal and external approaches to solving problems in a creative way<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 2+ years of professional or military experience</li><li> Experience with executive level calendar management</li><li> Experience with domestic or international travel coordination</li><li> Experience with Microsoft Office products and applications<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon Advertising LLC<br/><br/>Job ID: A2713802", "responsibilities": "<ul><li>Complex calendar management, including coordinating all aspects of scheduling and logistics for internal and external meetings</li><li>Seamlessly managing detailed domestic and international travel itineraries, as well as processing expense reports</li><li>Coordinating in-person and virtual event logistics, including catering, accommodations, AV and presentation materials (e.g. global team meetings, annual planning offsites, morale-building activities, etc.)</li><li>Planning space for the team and facilitating office moves</li><li>Partnering closely and proactively with Finance, HR, Recruiting, and EAs throughout the Amazon Ads org</li><li>Attending key team meetings, tracking and helping drive completion of key deliverables, and following up on outstanding items</li><li>Identifying internal and external approaches to solving problems in a creative way<br/><br/></li></ul>", "qualifications": {"required": "2+ years of professional or military experience, Experience with executive level calendar management, Experience with domestic or international travel coordination, Experience with Microsoft Office products and applications", "preferred": "Experience in a fast-paced, high-tech company, Experience managing multiple calendars"}, "skills": ["Calendar Management", "Travel Coordination", "Microsoft Office", "Event Planning", "Problem Solving", "Communication"], "postedDate": "6 days ago", "benefits": "Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985383095"}