{"jobTitle": "Import Production Assistant", "company": {"name": "Reformation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "<strong>Who We Are:<br/><br/></strong>Founded in 2009, Reformation is a revolutionary lifestyle brand that proves fashion and sustainability can coexist. We combine stylish, vintage-inspired designs with sustainable practices, releasing limited-edition collections for individuals who want to look beautiful and live sustainably. Setting an example for the industry, Reformation remains at the forefront of innovation in sustainable fashion—running the first sustainable factory in Los Angeles, using deadstock and eco fabrics, tracking and sharing the environmental impact of every product, and investing in the people who make this revolution possible. The brand has also established itself as a pioneer in retail innovation, developing an in-store tech concept that brings the best of its online experience to its physical doors.<br/><br/>We are a future focused organization committed to the belief that the problems facing our planet and society can be solved through innovation, common sense and education. Being naked is the #1 most sustainable option. We're #2.<br/><br/>Here at Ref, we put people first. We know that you can't innovate and do cool stuff without having everyone on board. So we work to create a culture where everyone feels like they belong and where their voices are truly valued. We build an inclusive culture together and make a real impact along the way.<br/><br/>Job Name:<br/><br/>Reformation is seeking an Import Production Assistant, to coordinate various aspects of import manufacturing. This position will be responsible for tracking and organizing deliverables needed for production. We are looking for someone who is detail oriented and proactive with an interest in sustainability, and will be the lead for team coordination and organization.<br/><br/>The Production Assistant's primary task is to carry out the directions of the Production Manager to support the fulﬁllment of all orders to meet company top line goals, starting from Pre-Production Handoff through Logistics/Shipping.<br/><br/>What you'll do:<br/><br/><ul><li>Inbound vendor TOP package tracking &amp; distribution for timely</li><li>Daily maintenance of TOP sample tracking doc with courier tracking, ETD, ETA</li><li>Coordinate/Prioritize workload with QC for Production Fittings based on Prepare for daily Production Fittings by pulling PP (Fit Released) sample to review with TOP; attend daily Production fittings; send out TOP comments to vendors with photos and spec sheet(s)</li><li>Tackle factory Purchase Orders daily, consisting of tagging vendor/material/PO status in PIM and reserving the bulk materials to be allocated</li><li>Maintain accurate daily WIPs for all import production; keep accurate records and files in our corporate system of POs, costs, fit releases, production approvals, BOMs, and delivery dates</li><li>Weekly WIP Review: Track and monitor execution to time-and-action Support production managers with daily production follow up; address milestone misses</li><li>Weekly Material Pull Review: Follow up with Purchasing Team on pending fabric allocations that may risk garment deliveries</li><li>Weekly Liability Review: Track fabric and/or trim liabilities that have accrued or been consumed throughout the week from overseas vendors</li><li>Daily Inbound Logistics Coordination between vendor and freight forwarder; and PIM/WIP maintenance with accurate shipping statuses</li><li>Regular communication with the Sample Coordinator &amp; Ecom team, providing updates on photoshoot sample Requesting photoshoot samples from overseas vendors to meet photoshoot deadlines. Work with manager to validate and reconcile sample invoices before submitting to appropriate cross functional teams.</li><li>Maintain PP/Archive sample closet and maintain shared sample log; track down any missing</li><li>Take Initiative beyond basic responsibilities</li><li>Support special projects as<br/><br/></li></ul>What you'll need:<br/><br/><ul><li>Bachelor's Degree in related field</li><li>1-2 years of apparel production experience, import production preferred</li><li>Ability to work in a team as well as work independently</li><li>Ability to thrive in a fast-paced, team-oriented environment</li><li>Must be proactive and possess the ability to meet multiple tight deadlines</li><li>Must have exceptional organizational skills</li><li>Must possess excellent written and verbal communication skills to interact effectively with cross-functional teams such as Merchandising, Product Development, and Quality Control</li><li>Proficient in G-Suite &amp; Microsoft Office, including working knowledge of pivot tables and vlookups<br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong><ul><li>Health, vision, and dental insurance for eligible employees</li><li>Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees</li><li>Mission based company + casual and entrepreneurial work environment </li><li>Clothing discount, dog-friendly office, company events + parties and much more </li><li>401K with company match <br/><br/></li></ul><em>The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status<br/><br/></em><em>Notice at Collection- Privacy Notice for California Candidates</em>", "responsibilities": "The Production Assistant's primary task is to carry out the directions of the Production Manager to support the fulﬁllment of all orders to meet company top line goals, starting from Pre-Production Handoff through Logistics/Shipping.<br/><br/>What you'll do:<br/><br/><ul><li>Inbound vendor TOP package tracking &amp; distribution for timely</li><li>Daily maintenance of TOP sample tracking doc with courier tracking, ETD, ETA</li><li>Coordinate/Prioritize workload with QC for Production Fittings based on Prepare for daily Production Fittings by pulling PP (Fit Released) sample to review with TOP; attend daily Production fittings; send out TOP comments to vendors with photos and spec sheet(s)</li><li>Tackle factory Purchase Orders daily, consisting of tagging vendor/material/PO status in PIM and reserving the bulk materials to be allocated</li><li>Maintain accurate daily WIPs for all import production; keep accurate records and files in our corporate system of POs, costs, fit releases, production approvals, BOMs, and delivery dates</li><li>Weekly WIP Review: Track and monitor execution to time-and-action Support production managers with daily production follow up; address milestone misses</li><li>Weekly Material Pull Review: Follow up with Purchasing Team on pending fabric allocations that may risk garment deliveries</li><li>Weekly Liability Review: Track fabric and/or trim liabilities that have accrued or been consumed throughout the week from overseas vendors</li><li>Daily Inbound Logistics Coordination between vendor and freight forwarder; and PIM/WIP maintenance with accurate shipping statuses</li><li>Regular communication with the Sample Coordinator &amp; Ecom team, providing updates on photoshoot sample Requesting photoshoot samples from overseas vendors to meet photoshoot deadlines. Work with manager to validate and reconcile sample invoices before submitting to appropriate cross functional teams.</li><li>Maintain PP/Archive sample closet and maintain shared sample log; track down any missing</li><li>Take Initiative beyond basic responsibilities</li><li>Support special projects as<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's Degree in related field, 1-2 years of apparel production experience, import production preferred, Ability to work in a team as well as work independently, Ability to thrive in a fast-paced, team-oriented environment, Must be proactive and possess the ability to meet multiple tight deadlines, Must have exceptional organizational skills, Must possess excellent written and verbal communication skills to interact effectively with cross-functional teams such as Merchandising, Product Development, and Quality Control, Proficient in G-Suite &amp; Microsoft Office, including working knowledge of pivot tables and vlookups<br/><br/>", "preferred": ""}, "skills": ["G-Suite", "Microsoft Office", "Pivot Tables", "Vlookups", "Apparel Production", "Import Production", "Teamwork", "Communication", "Organization"], "postedDate": "3 weeks ago", "benefits": "Health, vision, and dental insurance for eligible employees, Paid vacation, sick, holidays &amp; volunteer time-off for eligible employees, Mission based company + casual and entrepreneurial work environment , Clothing discount, dog-friendly office, company events + parties and much more , 401K with company match <br/><br/>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3985309377"}