{"jobTitle": "Director, Sales (Independent)", "company": {"name": "Cast & Crew", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00 - $175,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "At Cast & Crew, we've empowered creativity and supported the global entertainment industry for decades. Together with our family of brands - Backstage, CAPS, Checks & Balances, Final Draft, Media Services, Sargent-Disc, and The TEAM Companies – we operate as a combined entertainment technology and services provider offering industry standard screenwriting accounting software, digital payroll products, data & reporting, and a host of creative tools. The industry continues to move faster than ever, and the need for our expertise, our technology, and our people has never been greater. We are a production's best ally every step of the way. #OneCastOneCrew<br/><br/>About Cast & Crew<br/><br/>We grew from a modest small business in 1976 to be the premiere provider of entertainment technology and solutions, staying true to our mission of modernizing content production and leading the digital transformation within the industry. Our cloud-based solutions and industry expertise help streamline the entire production lifecycle and have revolutionized how content is made. We now have a global workforce across a host of storied brands, spanning all areas of produced and live entertainment, from film, television, streaming, to advertising, live events, and short-form.<br/><br/>Director – Independent Sales<br/><br/>Regular Full-Time<br/><br/>Position Overview<br/><br/>The role of Director, Independent Sales is a key position of the Cast & Crew Sales Film Television and Streaming group reporting directly to the VP, Sales. Role will primarily be involved with the sales and client services efforts of Media Services and Cast & Crew independent payroll clients. This candidate will also assist with Cast & Crew Financial Services (CCFS), Cast & Crew Production Incentives, and special financial projects as requested.<br/><br/>Core Responsibilities<br/><br/><ul><li>Develop target list of independent clients for Media Services and assist with established relationships for potential payroll service opportunities</li><li>Coordinate with Cast & Crew Sales on mini-major and independent client opportunities</li><li>Follow up with producers and accountants on any outstanding CCFS lending issues</li><li>Assist clients with problem resolution, always keeping client aware of status and ensuring the best possible experience</li><li>Assist Finance with delinquent account messaging</li><li>Work closely with Sales executives from Media Services and Cast & Crew on the development and implementation of growth strategy plans</li><li>Maintain collaborative relationships with all departments, including external facing divisions such as Set-Up, Client Services, Payroll Operations, Finance, Labor Relations, and Product Support and Implementation</li><li>Establish and maintain strong client relationships<br/><br/></li></ul>Key Qualifications<br/><br/><ul><li>Minimum 5 years in entertainment industry, either in-house as a production finance or physical production executive or freelance in an accounting or physical production capacity</li><li>Must have an extensive professional network of production finance and physical production executives, production accountants, and industry professionals.</li><li>Proven track record of successful project management and problem-solving skills</li><li>Outstanding interpersonal skills and ability to communicate clearly and effectively (both written and verbal)</li><li>Excellent relationship-building skills with internal teams and external partners</li><li>West Coast based, work from home.</li><li>Minimum Education requirement: Bachelor's degree<br/><br/></li></ul>Special Work Conditions<br/><br/><ul><li>Occasional travel</li><li>Client breakfasts, lunches and dinners and event hosting in the greater Los Angeles area</li><li>Sedentary – Involves sitting most of the time but may involve walking or standing for brief periods of time. Some positions may entail exerting up to 15 lbs. of force occasionally and/or a negligible amount of force to lift, carry, push, or pull.<br/><br/></li></ul>Compensation is commensurate with various factors including, but not limited to, relevant experience, qualifications, skills, training, licensure, certifications, geographic cost of labor, and other business and organizational needs. Compensation range for candidates in other locations may differ based on the cost of labor in that location.<br/><br/>The compensation range for this position is:<br/><br/>$140,000—$175,000 USD<br/><br/>Benefits <br/><br/>Cast & Crew provides a comprehensive package of employee benefits including: Medical, Dental, Vision, PTO, health and wellness programs, employee discounts, and more! Note: Cast & Crew benefits are subject to eligibility requirements.<br/><br/>Due to the high volume of applicants, it is likely that only shortlisted candidates will be contacted.<br/><br/>CA residents: Your personal information may be collected in connection with certain services provided by Cast & Crew or its affiliated companies. A summary of your California privacy rights can be found at: https://www.castandcrew.com/privacy-policy/<br/><br/>Cast & Crew is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. It is our policy to provide equal employment opportunities to all individuals based on job-related qualifications and ability to perform a job, without regard to age, gender, gender identity, sexual orientation, race, color, religion, creed, national origin, disability, genetic information, veteran status, citizenship or marital status, and to maintain a non-discriminatory environment free from intimidation, harassment or bias based upon these grounds.", "responsibilities": "<ul><li>Develop target list of independent clients for Media Services and assist with established relationships for potential payroll service opportunities</li><li>Coordinate with Cast & Crew Sales on mini-major and independent client opportunities</li><li>Follow up with producers and accountants on any outstanding CCFS lending issues</li><li>Assist clients with problem resolution, always keeping client aware of status and ensuring the best possible experience</li><li>Assist Finance with delinquent account messaging</li><li>Work closely with Sales executives from Media Services and Cast & Crew on the development and implementation of growth strategy plans</li><li>Maintain collaborative relationships with all departments, including external facing divisions such as Set-Up, Client Services, Payroll Operations, Finance, Labor Relations, and Product Support and Implementation</li><li>Establish and maintain strong client relationships<br/><br/></li></ul>", "qualifications": {"required": "Minimum 5 years in entertainment industry, either in-house as a production finance or physical production executive or freelance in an accounting or physical production capacity, Must have an extensive professional network of production finance and physical production executives, production accountants, and industry professionals., Proven track record of successful project management and problem-solving skills, Outstanding interpersonal skills and ability to communicate clearly and effectively (both written and verbal), Excellent relationship-building skills with internal teams and external partners, West Coast based, work from home., Minimum Education requirement: Bachelor's degree<br/><br/>", "preferred": ""}, "skills": ["Sales", "Client Services", "Project Management", "Problem Solving", "Communication", "Relationship Building"], "postedDate": "4 weeks ago", "benefits": "Cast & Crew provides a comprehensive package of employee benefits including: Medical, Dental, Vision, PTO, health and wellness programs, employee discounts, and more! Note: Cast & Crew benefits are subject to eligibility requirements.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3985307804"}