{"jobTitle": "Supervisor Patient Access", "company": {"name": "Providence", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "29.04/hr - 45.30/hr", "currency": "USD"}, "jobFunction": "Revenue Cycle", "industry": "Hospitals and Health Care", "description": "Providence employees who work throughout Providence Health &amp; Services in revenue cycle systems and structures support our ministries and operations in all regions from Alaska to California. In line with our core strategy of Ministry's Committed to Excellence and enhancing the overall patient care experience (know me, care for me, ease my way) we are committed to delivering a robust foundation of services, operational and technical support, and the sharing of comprehensive, relevant, and highly specialized revenue cycle expertise.<br/><br/>Providence caregivers are not simply valued – they’re invaluable. Join our team at Saint Johns Health Center and thrive in our culture of patient-focused, whole-person care built on understanding, commitment, and mutual respect. Your voice matters here, because we know that to inspire and retain the best people, we must empower them.<br/><br/><strong>Required Qualifications<br/><br/></strong><ul><li>3 years Healthcare access experience.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor's Degree in Related healthcare field. Or equivalent educ/experience.</li><li>1 year Direct supervisory experience for a minimum of ten employees.</li><li>3 years Experience with computer software in a complex business environment.<br/><br/></li></ul><strong>Why Join Providence?<br/><br/></strong>Our best-in-class benefits are uniquely designed to support you and your family in staying well, growing professionally, and achieving financial security. We take care of you, so you can focus on delivering our Mission of caring for everyone, especially the most vulnerable in our communities.<br/><br/><strong>About Providence<br/><br/></strong>At Providence, our strength lies in Our Promise of “Know me, care for me, ease my way.” Working at our family of organizations means that regardless of your role, we’ll walk alongside you in your career, supporting you so you can support others. We provide best-in-class benefits and we foster an inclusive workplace where diversity is valued, and everyone is essential, heard and respected. Together, our 120,000 caregivers (all employees) serve in over 50 hospitals, over 1,000 clinics and a full range of health and social services across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. As a comprehensive health care organization, we are serving more people, advancing best practices and continuing our more than 100-year tradition of serving the poor and vulnerable.<br/><br/>The amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.<br/><br/>Check out our benefits page for more information about our Benefits and Rewards.<br/><br/><strong>About The Team<br/><br/></strong>The Sisters of Providence and Sisters of St. Joseph of Orange have deep roots in California, bringing health care and education to communities from the redwood forests to the beach shores of Orange county - and everywhere in between. In Southern California, Providence provides care throughout Los Angeles County, Orange County, High Desert and beyond.<br/><br/>Our award-winning and comprehensive medical centers are known for outstanding programs in cancer, cardiology, neurosciences, orthopedics, women's services, emergency and trauma care, pediatrics and neonatal intensive care. Our not-for-profit network provides a full spectrum of care with leading-edge diagnostics and treatment, outpatient health centers, physician groups and clinics, numerous outreach programs, and hospice and home care, and even our own Providence High School.<br/><br/>Providence is proud to be an Equal Opportunity Employer. We are committed to the principle that every workforce member has the right to work in surroundings that are free from all forms of unlawful discrimination and harassment on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. We believe diversity makes us stronger, so we are dedicated to shaping an inclusive workforce, learning from each other, and creating equal opportunities for advancement.<br/><br/><strong>Requsition ID:</strong> 300555<br/><br/><strong>Company:</strong> Providence Jobs<br/><br/><strong>Job Category:</strong> Patient Access<br/><br/><strong>Job Function:</strong> Revenue Cycle<br/><br/><strong>Job Schedule:</strong> Full time<br/><br/><strong>Job Shift:</strong> Day<br/><br/><strong>Career Track:</strong> Leadership<br/><br/><strong>Department:</strong> 7006 PSJHC PATIENT ACCESS<br/><br/><strong>Address:</strong> CA Santa Monica 2121 Santa Monica Blvd<br/><br/><strong>Work Location:</strong> Providence Saint John's Health Ctr-Santa Monica<br/><br/><strong>Pay Range:</strong> $29.04 - $45.30<br/><br/>The amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.<br/><br/>Check out our benefits page for more information about our Benefits and Rewards.<br/><br/>Providence offers a comprehensive benefits package including a retirement 401(k) Savings Plan with employer matching, health care benefits (medical, dental, vision), life insurance, disability insurance, time off benefits (paid parental leave, vacations, holidays, health issues), voluntary benefits, well-being resources and much more. Learn more at providence.jobs/benefits", "responsibilities": null, "qualifications": {"required": "3 years Healthcare access experience.", "preferred": "Bachelor's Degree in Related healthcare field. Or equivalent educ/experience.\n1 year Direct supervisory experience for a minimum of ten employees.\n3 years Experience with computer software in a complex business environment."}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Our best-in-class benefits are uniquely designed to support you and your family in staying well, growing professionally, and achieving financial security. We take care of you, so you can focus on delivering our Mission of caring for everyone, especially the most vulnerable in our communities.<br/><br/>Providence offers a comprehensive benefits package including a retirement 401(k) Savings Plan with employer matching, health care benefits (medical, dental, vision), life insurance, disability insurance, time off benefits (paid parental leave, vacations, holidays, health issues), voluntary benefits, well-being resources and much more. Learn more at providence.jobs/benefits", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3985331754"}