{"jobTitle": "Techcon Global Sales Director", "company": {"name": "Hire Velocity", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "The Global Sales Director is responsible for the sales of all products and leadership of the sales team and channel partners worldwide. The position will be charged with developing sales strategy, sales training and achieving revenue/profitability targets for the company's portfolio of products. JOB DUTIES\n•\nProvide department leadership and communicates company vision for sales.\n•\nDevelop annual sales and gross profit plans as part of the Annual Operating Plan (AOP) as well as own the global Techcon Sales budget.\n•\nEstablish sales objectives by forecasting and developing annual sales quotas for regions and territories, projecting expected sales volume and profit for existing and new products.\n•\nDevelop and execute reporting structure of activities and health of the business to sales leadership and Executive team.\n•\nImplement global sales programs by developing field sales action plans.\n•\nMaintain sales volume, product mix, and selling price by keeping current with supply and demand, changing trends, economic indicators, and competitors.\n•\nEstablish and adjusts with Product Management selling prices by monitoring costs, competition, and supply and demand.\n•\nMaintain sales staff by recruiting, selecting, orienting, and training employees.\n•\nAnalyze sales statistics to track and predict growth of Techcon portfolio.\n•\nEstablishes performance goals to achieve Techcon metrics for department employees and monitors performance on a monthly, quarterly and yearly basis.\n•\nDevelops, maintains and improves business relations with Techcon distributors and end customers.\n•\nIdentifies new customers and sales opportunities, initiates action plans to approach and secure new business for the Techcon portfolio.\n•\nIn support of the Operations and Finance departments coordinates sales forecast, customer payment and credit terms.\n•\nGenerate, issue, and improve monthly and project reports for internal use and Dover management.\n•\nMaintain professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies.\n•\nTravel 50%\nSupervisory Responsibility\n•\nManages the direction and coordination of the Techcon sales team in US, Canada and Mexico.\n•\nCarries out supervisory responsibilities in accordance with the company policies. Responsibilities include interviewing, hiring, planning, assigning, directing work, rewarding, disciplining employees, performance reviews, addressing complaints and resolving problems. WORK EXPERIENCE REQUIREMENTS\n•\nMinimum 10 years sales experience within dispensing, electronics, semiconductor or industrial markets\n•\nMinimum 5 years sales management of direct sales team\n•\nExperience selling through distribution and direct sales channels\nSKILLS REQUIRED\n•\nThe Director of Sales must possess initiative and drive; have broad sales and customer experience ideally in the dispensing and/or electronics industry, distribution and direct sales experience.\n•\nExperience executing and coaching value based selling tactics.", "postedDate": "4 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985810903"}