{"jobTitle": "Business Analyst I", "company": {"name": "Metrolink", "industry": "Rail Transportation", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Rail Transportation", "description": "PURPOSE OF POSITION\nThe Business Analyst I will administer and oversee department project processes, submit purchase requisitions, and ensure that the procurement approvals are processed in accordance with department policies and procedures. This position also provides administrative support, prepares reports and other information necessary to support the Department Director and the staff.", "responsibilities": "Oversee and administer department project processes, including participating in the continuous improvement processes. Act as liaison with other departments on various projects and issues as needed and directed. Review and process purchase requisitions, invoices, and check requests. Develop and maintain status reports to allow departments to manage a growing number of projects and funding sources; create and maintain procurement checklists. Route procurements for approval in accordance with the Agency IAW Procurement Policies and Procedures. Provide administrative support to the department including, but not limited to, the processing of expense reports, timesheets, calendar and schedule meetings, set up department meetings and events, ordering supplies, pickup and distribution of mail, correspondence, faxing and photocopying and scheduling maintenance/repairs of office equipment and vending machine and the preparation of reports for department personnel. Review and track Contract Task Order charges. Assist internal and external customers with research requests or analysis. Complete and compile monthly and annual departmental reports. Maintain, monitor, and coordinate the records retention program on behalf of the assigned department. Update and maintain all department databases. Collaborate with appropriate SCRRA departments and contractors to initiate new projects and funding sources, and to improve monitoring and execution of the various projects and contracts. Serve as Project Manager when necessary. Participate in the preparation and administration of assigned program budget. Conduct and collect employee surveys. Work with IT and Contracts Sr Manager to develop needed Oracle reports for the Contracts Procurement team. Draft and update department documents, including policies, procedures, processes, maps, etc. Review special project billing and verify for contract compliance and applicability to project. Perform other related duties as assigned.", "qualifications": {"required": "Bachelor’s Degree in Business Administration, Finance, or a related field. A minimum of two years’ experience performing similar job duties or any combination of education and experience that provides equivalent knowledge, skills, and abilities may be considered.", "preferred": "Experience supporting a procurement department in a public agency."}, "skills": ["Basic finance and accounting", "Train operations", "Mathematical analytics and trend analysis", "SCRRA policies and procedures", "Use of Microsoft Office, including Excel, Word, PowerPoint, database applications, and Oracle", "Effective organization and analytics", "Strong verbal and written communication", "Strong analytical skills and detail oriented"], "postedDate": "4 weeks ago", "applicationDeadline": "August 8, 2024", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985377483"}