{"jobTitle": "Human Resources Generalist", "company": {"name": "FoodPharma", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "68,000.00/yr - 77,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources and Manufacturing", "industry": "Manufacturing and Food and Beverage Manufacturing", "description": "<strong><u>Job Summary: </u></strong>The Human Resource Generalist will work with the Human Resources Manager and Supervisor on the daily functions of the Human Resource (HR) department including interviewing, hiring, administering payroll, processing benefits, administering leaves, managing worker’s compensation injury reporting and enforcing company policies and practices to ensure compliance with applicable State and Federal laws.<br/><strong><u>Human Resources Responsibilities:</u></strong><strong>Payroll/ Time and Attendance</strong><ul><li>Audits timecards</li><li>Reconciles missing punches</li><li>Processes payroll</li><li>Issues manual checks/ final checks/ bonus checks etc.</li></ul><strong>Recruitment &amp; Onboarding</strong><ul><li>Creates and manages job postings via different job posting platforms.</li><li>Conducts phone screens and schedules interviews of qualified candidates.</li><li>Collaborates with department leadership to understand skills and competencies required for openings.</li><li>Extends job offers and conducts pre-employment screenings.</li><li>Conducts new hire orientations.</li></ul><strong>Benefits</strong><ul><li>Process benefits for new hires, open enrollment changes and QEs.</li><li>Conducts meetings for open enrollment.</li><li>Audits benefit invoices (medical, dental, vision, etc.)</li></ul><strong>Employee Relations </strong><ul><li>Issue disciplinary actions.</li></ul><strong>LOAs</strong><ul><li>Administers leave programs and policies in accordance with the applicable federal and state employment laws (FMLA, CFRA, ADA, Pregnancy Discrimination Act, etc.)</li><li>Maintaining complete and accurate records of leave requests and supporting documentation.</li></ul><strong>Worker’s Compensation and Safety</strong><ul><li>Works with the Human Resources Manager to set up a new employee on-boarding process for safety.</li><li>Works with the Plant Manager, Operations Managers and Plant Engineer to create and enforce preventative measures.</li><li>Injury reporting and investigations, with root cause analysis and preventative measures.</li><li>Identifies and reports safety concerns.</li><li>Acts as a liaison between the medical clinic, work-related injured employees and worker’s compensation adjuster.</li></ul><strong>General Duties</strong><ul><li>Conducts employee verifications.</li><li>Creates and manages employee recognition programs.</li><li>Works directly with staffing agencies on staffing related matters and trains new agency employees on company GMP’s and expectations.</li><li>Assist with creating job descriptions as needed.</li><li>Maintains compliance with federal, state, and local employment laws and regulations, and recommends best practices, reviews policies and practices to maintain compliance.</li><li>Identifies needs of the department and makes recommendations on best practices for compliance.</li><li>Process and file documents timely</li><li>Performs routine tasks required to administer and execute human resource programs including but not limited to compensation, benefits and leave; disciplinary matters; disputes, performance and attendance management.</li><li>Complete and issue disciplinary actions under the direction of the Human Resources Manager</li><li>Support the management team as needed</li><li>Performs other duties as assigned.</li></ul><strong><u> Food Safety Responsibilities:</u></strong><ul><li>Every employee is responsible for Food Safety</li><li>With regard to site visits originating in Santa Fe Springs, attends to visitors and requires visit compliances</li><li>Follow all Good Manufacturing Practices and Pre-requisite programs if in processing or warehouse areas including:</li></ul>Personnel Hygiene (including hand wash procedures)Personnel Processing PracticesFood Defense Procedures<ul><li>Must report food safety and quality problems to personnel with authority to initiate action: SQF Practitioner, Quality Management, Plant/Production Management, or Supervisors</li></ul><strong><u> Qualifications:</u></strong><ul><li>4+ years as an HR Generalist, in a manufacturing environment.</li><li>PHR Certification (preferred)</li><li>Ability to act with integrity, professionalism, and confidentiality.</li><li>Proficient in MS Office, proficient with Excel (simple formulas, creates spreadsheets from scratch)</li><li>Experienced with PAYCHEX payroll system</li><li>Strong knowledge of employment- related laws and regulations in California</li><li>Excellent attention to detail and accuracy</li><li>Excellent organization skills and time management, highly organized</li><li>Great interpersonal and communication skills</li><li>Must be Bilingual in Spanish/English</li><li>Support all locations.</li><li>Must be trained on:</li></ul><br/>Company food safety procedures including prerequisite programs – see training requirements.<br/><strong><u>Physical Requirements:</u></strong><ul><li>Prolonged periods of sitting at a desk and working on a computer.</li><li>Must be able to lift up to 25lbs at times.</li><li>Must be able to climb stairs.</li><li>Must be able to access and navigate each department at the organizations multiple facilities.</li></ul>", "responsibilities": "The Human Resource Generalist will work with the Human Resources Manager and Supervisor on the daily functions of the Human Resource (HR) department including interviewing, hiring, administering payroll, processing benefits, administering leaves, managing worker’s compensation injury reporting and enforcing company policies and practices to ensure compliance with applicable State and Federal laws.", "qualifications": {"required": "4+ years as an HR Generalist, in a manufacturing environment., PHR Certification (preferred), Ability to act with integrity, professionalism, and confidentiality., Proficient in MS Office, proficient with Excel (simple formulas, creates spreadsheets from scratch), Experienced with PAYCHEX payroll system, Strong knowledge of employment- related laws and regulations in California, Excellent attention to detail and accuracy, Excellent organization skills and time management, highly organized, Great interpersonal and communication skills, Must be Bilingual in Spanish/English, Support all locations., Must be trained on: Company food safety procedures including prerequisite programs – see training requirements.", "preferred": "PHR Certification"}, "skills": ["Payroll", "Time and Attendance", "Recruitment", "Onboarding", "Benefits", "Employee Relations", "LOAs", "Worker's Compensation", "Safety", "General Duties", "Food Safety", "MS Office", "Excel", "PAYCHEX", "Employment Law", "Bilingual", "Spanish", "English"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985816292"}