{"jobTitle": "Office Manager", "company": {"name": "FORTIS Resource Partners", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative, Customer Service, and Legal", "industry": "Law Practice", "description": "<strong>Overview:</strong><p>We are seeking a dynamic and results-driven Office Manager to join our client, a law firm in Orange County, California, to play a pivotal role in maintaining the smooth operation of their legal practice and support the firm's partners and associates. We are seeking a detail-oriented and organized professional who can oversee various administrative functions and contribute to the overall efficiency of the office.</p><p><br/></p><p><strong>Responsibilities:</strong></p><p><strong>Administrative Oversight</strong>: Manage day-to-day administrative tasks, including mail distribution, office supplies, and general office operations.</p><p><br/></p><p><strong>Facilities Management</strong>: Ensure a well-maintained and organized office space, overseeing facilities and maintenance. Manage and maintain office supplies, inventory, and equipment. Maintain organized filing systems for both physical and electronic documents.</p><p><br/></p><p><strong>Vendor and Supplier Relations</strong>: Establish and maintain relationships with vendors, negotiate contracts, and oversee office supplies and services procurement.</p><p><br/></p><p><strong>Calendar and Scheduling</strong>: Coordinate and manage schedules for attorneys and staff, ensuring efficient use of time and resources.</p><p><br/></p><p><strong>Client Interaction</strong>: Serve as a primary point of contact for clients, handling inquiries, and appointments, and ensuring excellent client service for sophisticated and discerning clientele. Answer and direct phone calls professionally and courteously.</p><p><br/></p><p><strong>Event Coordination &amp; Personal Assistance</strong>: Plan and coordinate firm events, meetings, and conferences, both internal and external.</p><p><br/></p><p><strong>Budget Management</strong>: Assist in managing the office budget, tracking expenses, and contributing to cost-effective decision-making.</p><p><br/></p><p><strong>Technology Support</strong>: Collaborate with IT professionals to address office technology needs, troubleshoot issues, and facilitate staff training on relevant systems.</p><p><br/></p><p><strong>Marketing Support</strong>: Collaborate with marketing professionals on firm advertising, marketing, and public relations.</p><p><br/></p><p>This job description is intended to provide a general overview of the position. Other duties may be assigned as needed.</p><p><br/></p><p><strong>Qualifications:</strong></p><ol><li>Proven experience as an office administrator, office manager, director of operations, or in a similar role.</li><li>Strong organizational skills with the ability to multitask effectively.</li><li>Excellent communication skills, both verbal and written. Strong interpersonal skills.</li><li>Proficient in using office software (e.g., Microsoft Office Suite).</li><li>Heavy calendaring experience is a plus.</li><li>Knowledge of phone systems and phone etiquette.</li><li>Familiarity with budgeting processes and financial record keeping.</li><li>Experience in vendor management is a plus.</li><li>Ability to maintain confidentiality and handle sensitive information with discretion.</li><li>Notary public license.</li></ol><p><br/></p><p>If you are a proactive and organized professional with a passion for maintaining efficient office operations, we invite you to apply.</p><p><br/></p><p>FORTIS Resource Partners provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p><p><br/></p><p>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p>", "responsibilities": "<strong>Administrative Oversight</strong>: Manage day-to-day administrative tasks, including mail distribution, office supplies, and general office operations.<p><br/></p><p><strong>Facilities Management</strong>: Ensure a well-maintained and organized office space, overseeing facilities and maintenance. Manage and maintain office supplies, inventory, and equipment. Maintain organized filing systems for both physical and electronic documents.</p><p><br/></p><p><strong>Vendor and Supplier Relations</strong>: Establish and maintain relationships with vendors, negotiate contracts, and oversee office supplies and services procurement.</p><p><br/></p><p><strong>Calendar and Scheduling</strong>: Coordinate and manage schedules for attorneys and staff, ensuring efficient use of time and resources.</p><p><br/></p><p><strong>Client Interaction</strong>: Serve as a primary point of contact for clients, handling inquiries, and appointments, and ensuring excellent client service for sophisticated and discerning clientele. Answer and direct phone calls professionally and courteously.</p><p><br/></p><p><strong>Event Coordination &amp; Personal Assistance</strong>: Plan and coordinate firm events, meetings, and conferences, both internal and external.</p><p><br/></p><p><strong>Budget Management</strong>: Assist in managing the office budget, tracking expenses, and contributing to cost-effective decision-making.</p><p><br/></p><p><strong>Technology Support</strong>: Collaborate with IT professionals to address office technology needs, troubleshoot issues, and facilitate staff training on relevant systems.</p><p><br/></p><p><strong>Marketing Support</strong>: Collaborate with marketing professionals on firm advertising, marketing, and public relations.</p><p><br/></p><p>This job description is intended to provide a general overview of the position. Other duties may be assigned as needed.</p>", "qualifications": {"required": "Proven experience as an office administrator, office manager, director of operations, or in a similar role. Strong organizational skills with the ability to multitask effectively. Excellent communication skills, both verbal and written. Strong interpersonal skills. Proficient in using office software (e.g., Microsoft Office Suite). Heavy calendaring experience is a plus. Knowledge of phone systems and phone etiquette. Familiarity with budgeting processes and financial record keeping. Experience in vendor management is a plus. Ability to maintain confidentiality and handle sensitive information with discretion. Notary public license.", "preferred": ""}, "skills": ["Microsoft Office Suite", "Calendar Management", "Phone Etiquette", "Budgeting", "Vendor Management"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985699010"}