{"jobTitle": "Manager, Business Methods (Challenges)", "company": {"name": "Herbalife", "industry": "Wellness and Fitness Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,200.00 - $145,600.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Wellness and Fitness Services", "description": "Business Methods & Growth Strategies team is looking for a key player to be responsible for systemizing, optimizing, and strategically supporting promotions world-wide, and foster growth opportunities across Herbalife through promotions.", "responsibilities": "Serve as subject matter expert, source of data, information and insights about platforms and methods for Weight Loss Challenges, Transformation Challenges and other similar attraction methods. Develop performance data, develop and track standard set of success metric on key types of challenge based health results strategies. Lead roll out of main tool used for digital support of challenges. Collaborate with various countries on effective digital support tool strategy and development. Generate Insights and implement best practices to improve Distributor and customer adoption, engagement and success. Formalize training & support for rollout of best practices to Distributors and train internal teams. Identify opportunities and provide strategic recommendations tailored to countries and regions around the world for revenue growth. Provide cross-regional communication, collaboration and support (input & output)", "qualifications": {"required": "5-7+ years in sales or marketing, preferably working directly with Distributor / Independent Sellers. Analytics background. Familiar with sales analysis. B2B sales.", "preferred": "Bachelor’s degree preferred, or 10 years of relevant work experience."}, "skills": ["Proficient in Microsoft Office (PowerPoint, Word, Excel & Outlook)", "Proficient in various communication platforms (Whats App, Telegram)", "Strong analytical skills to evaluate platform effectiveness and make data-driven decisions", "Effective communication skills", "A Self-starter, organized, detail-oriented individual that takes ownership."], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Group Health Programs, other Voluntary Benefit Programs, and Paid Time Off. Group Health Programs include Medical, Dental, Vision, Health Savings Account (HSA), Flexible Spending Accounts (FSA), Basic Life/AD&D; Short-Term and Long-Term Disability and an Employee Assistance Program (EAP). Other Voluntary Benefit Programs include a 401(k) plan, Wellness Incentive Program, Employee Stock Purchase Plan (ESPP), Supplemental Life/Critical Illness/Hospitalization/Accident Insurance, and Pet Insurance. Paid time off includes Company-observed U.S. Holidays, Floating Holidays, Vacation, Sick Time, a Volunteer Program, Paid Maternity and Paternity Leave, Bereavement Leave, Personal Leave and time off for voting.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985083531"}