{"jobTitle": "Customer Growth Marketing Manager", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "122,000.00/yr - 176,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Meta's Business Marketing Group is seeking an experienced, data-driven marketer to help our advertisers succeed on our platforms. The Customer Growth Marketing Manager will oversee the development, management and execution of educational marketing programs -- both one-on-one and one-to-many -- that help businesses understand and adopt strategies that improve their advertising outcomes.The ideal candidate will have a deep understanding of how marketers use Meta technologies and advertising solutions to reach and acquire customers. The individual will need to be an experienced, hands-on contributor who is able to execute against business objectives while adapting to the outcomes of evolving marketing practices and technical frameworks. This role requires someone who can build partnerships with sales leaders and product marketing teams to develop holistic marketing strategies that serve the needs of our advertisers. This person must be a data-driven, flexible, cross-functional team player comfortable with a fast-paced, sometimes ambiguous, environment.<br/><br/>Customer Growth Marketing Manager Responsibilities:<br/><br/><ul><li>Develop strategy and execute regional programming that aligns with business priorities (e.g. best practices, Reels, etc.) by assessing advertiser needs and defining scope for, proposing, and gaining leadership alignment for new opportunities</li><li>Orchestrate the production of large-scale educational programs (in person events, webinars, content marketing campaigns, etc.) that inspire our advertisers and help facilitate decision making and prioritization of actions that will improve their business outcomes</li><li>Oversee conversion rate optimization programming, develop detailed UX optimization recommendations for key advertisers and create structured tests to assess performance improvements</li><li>Analyze data and insights to guide strategy and implementation of Meta solutions</li><li>Assess advertiser strategy and identify opportunities to adjust tactics, develop strategies, and create scalable workshops that improve client results</li><li>Work closely with cross-functional teams including sales, creative shop, product marketing, marketing science, and business engineering to identify and proactively provide solutions for our advertisers</li><li>Partner with the audience strategy team to determine budget, timelines and activations of the work, aligning it to our regional priorities</li><li>Adapt to high-priority changes to processes and best practices, communicating them with cross-functional teams and integrating them into programs</li><li>Manage and nurture relationships with key internal stakeholders across account teams, business solutions, product marketing and Global Business and Product Marketing<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>6+ years professional experience in marketing in a digital advertising focused role</li><li>Experience with digital advertising platforms, including Meta Ads Manager</li><li>Experience identifying opportunities for conversion rate optimization and conducting testing to improve website performance</li><li>Experience creating effective campaigns and presentations</li><li>Project management experience</li><li>Experience working with executive stakeholders across your organization</li><li>Experience with analyzing data sets and delivering insights in Ads Manager, Excel, or data visualization tools</li><li>Customer service oriented, with experience in a client-facing capacity</li><li>Experience contributing at strategic, operational and tactical levels</li><li>Experience communicating complex, large-scale concepts clearly and simply<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>BA/BS degree<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$122,000/year to $176,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Develop strategy and execute regional programming that aligns with business priorities (e.g. best practices, Reels, etc.) by assessing advertiser needs and defining scope for, proposing, and gaining leadership alignment for new opportunities\nOrchestrate the production of large-scale educational programs (in person events, webinars, content marketing campaigns, etc.) that inspire our advertisers and help facilitate decision making and prioritization of actions that will improve their business outcomes\nOversee conversion rate optimization programming, develop detailed UX optimization recommendations for key advertisers and create structured tests to assess performance improvements\nAnalyze data and insights to guide strategy and implementation of Meta solutions\nAssess advertiser strategy and identify opportunities to adjust tactics, develop strategies, and create scalable workshops that improve client results\nWork closely with cross-functional teams including sales, creative shop, product marketing, marketing science, and business engineering to identify and proactively provide solutions for our advertisers\nPartner with the audience strategy team to determine budget, timelines and activations of the work, aligning it to our regional priorities\nAdapt to high-priority changes to processes and best practices, communicating them with cross-functional teams and integrating them into programs\nManage and nurture relationships with key internal stakeholders across account teams, business solutions, product marketing and Global Business and Product Marketing", "qualifications": {"required": "6+ years professional experience in marketing in a digital advertising focused role\nExperience with digital advertising platforms, including Meta Ads Manager\nExperience identifying opportunities for conversion rate optimization and conducting testing to improve website performance\nExperience creating effective campaigns and presentations\nProject management experience\nExperience working with executive stakeholders across your organization\nExperience with analyzing data sets and delivering insights in Ads Manager, Excel, or data visualization tools\nCustomer service oriented, with experience in a client-facing capacity\nExperience contributing at strategic, operational and tactical levels\nExperience communicating complex, large-scale concepts clearly and simply", "preferred": "BA/BS degree"}, "skills": ["Marketing", "Digital Advertising", "Meta Ads Manager", "Conversion Rate Optimization", "Campaign Creation", "Presentations", "Project Management", "Executive Stakeholder Management", "Data Analysis", "Ads Manager", "Excel", "Data Visualization Tools", "Customer Service", "Client-Facing", "Strategic", "Operational", "Tactical", "Communication"], "postedDate": "5 days ago", "benefits": "$122,000/year to $176,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3985511070"}