{"jobTitle": "Business Partner, Finance Procurement Operations", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00 - $240,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>We are looking for a finance professional to assist our Product team with end to end finance procurement operations. This position will reside in the company’s Los Gatos office and will report to the Manager, Finance Procurement Operations in Los Gatos. The ideal candidate for this role will help drive operational process improvements, have the courage to challenge prevailing assumptions, and develop strong cross functional relationships with business partners across various Product functions, FP&amp;A, Accounting, and IT teams.<br/><br/>In this role you will partner with the following cross-functional partners:<br/><br/><ul><li>Business Owners - Execute all finance related tasks (procurement support, reviewing and re-negotiating contracts, vendor management, creating purchase orders, reviewing invoices, expense reporting) and be an embedded partner and active contributor across various Product teams. </li><li>Accounts Payable - Create POs where applicable and provide non-PO invoice coding to enable timely and accurate invoice processing and accurate financial reporting.</li><li>Accounting - Drive an accurate and timely month-end close by owning the accrual process and explaining variance drivers. </li><li>FP&amp;A - Ensure accurate coding to provide meaningful reporting and identify opportunities to use data to drive business decisions. </li><li>IT - Design, simplify, and automate finance and payment workflows and partner on system enhancements to help automate workflows to scale. <br/><br/></li></ul><strong>Responsibilities Include<br/><br/></strong><ul><li>Communicating across the Product teams to drive the procurement of services from our vendors and understand the status/timeline of delivery of services.</li><li>Partner closely with the business to support their sourcing decisions and vendor partnerships for scale, cost efficiencies, and to ensure a diverse and sustainably focused supplier chain to keep pace with the evolving needs of our business. </li><li>Setting-up purchase orders (PO’s) in to ensure appropriate classification of expenses to enable financial reporting and analysis.</li><li>Driving projects that help to simplify and automate manual workflows. Actively participate in system features development and user acceptance testing. </li><li>Managing vendors and invoicing processes: ensuring timely billing, approving invoices, and working with Accounting to ensure accuracy of accrued services.<br/><br/></li></ul><strong>Qualities We’re Looking For<br/><br/></strong><ul><li>5+ years of relevant Finance and/or Accounting experience</li><li>Deep knowledge and understanding of the Source-to-Pay process workflow, including supplier sourcing, contract reviews and procure-to-pay process</li><li>Ability to take ownership of tasks while handling competing priorities</li><li>Strong analytical skills with the ability to navigate large data sets</li><li>Strong communication skills, business acumen, and the ability to lead cross-functional meetings </li><li>Relationship builder - Ability to cultivate strong cross functional relationships and communicate effectively with team members and business partners</li><li>Strong enthusiasm for implementing systems and processes </li><li>Curiosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it; having a positive attitude and never settling for “good enough” are key</li><li>Adaptable - You are comfortable in an ever-changing ecosystem of content, finance and accounting issues and projects</li><li>Ability to take occasional trips to the Los Angeles office in Southern California<br/><br/></li></ul><strong>Extra Dose Of Awesome If You Have<br/><br/></strong><ul><li>Industry experience in a Product environment </li><li>Experience working with shared services center in different regions</li><li>ERP and Procurement systems experience - experience with Workday Financials and Tableau</li><li>Bachelor’s Degree in Accounting or Finance; MBA and/or CPA <br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $240,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "<ul><li>Communicating across the Product teams to drive the procurement of services from our vendors and understand the status/timeline of delivery of services.</li><li>Partner closely with the business to support their sourcing decisions and vendor partnerships for scale, cost efficiencies, and to ensure a diverse and sustainably focused supplier chain to keep pace with the evolving needs of our business. </li><li>Setting-up purchase orders (PO’s) in to ensure appropriate classification of expenses to enable financial reporting and analysis.</li><li>Driving projects that help to simplify and automate manual workflows. Actively participate in system features development and user acceptance testing. </li><li>Managing vendors and invoicing processes: ensuring timely billing, approving invoices, and working with Accounting to ensure accuracy of accrued services.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of relevant Finance and/or Accounting experience, Deep knowledge and understanding of the Source-to-Pay process workflow, including supplier sourcing, contract reviews and procure-to-pay process, Ability to take ownership of tasks while handling competing priorities, Strong analytical skills with the ability to navigate large data sets, Strong communication skills, business acumen, and the ability to lead cross-functional meetings , Relationship builder - Ability to cultivate strong cross functional relationships and communicate effectively with team members and business partners, Strong enthusiasm for implementing systems and processes , Curiosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it; having a positive attitude and never settling for “good enough” are key, Adaptable - You are comfortable in an ever-changing ecosystem of content, finance and accounting issues and projects, Ability to take occasional trips to the Los Angeles office in Southern California<br/><br/>", "preferred": "Industry experience in a Product environment , Experience working with shared services center in different regions, ERP and Procurement systems experience - experience with Workday Financials and Tableau, Bachelor’s Degree in Accounting or Finance; MBA and/or CPA <br/><br/>"}, "skills": ["Finance", "Accounting", "Source-to-Pay", "Supplier Sourcing", "Contract Reviews", "Procure-to-Pay", "Analytical Skills", "Communication Skills", "Business Acumen", "Cross-Functional Meetings", "Relationship Building", "System Implementation", "Workday Financials", "Tableau"], "postedDate": "6 days ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985092874"}