{"jobTitle": "Senior Designer - Surface and Product", "company": {"name": "Made For Retail Inc.", "industry": "Retail and Wholesale Import and Export", "size": "Not specified", "location": "Greater Minneapolis-St. Paul Area"}, "location": "Greater Minneapolis-St. Paul Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Art/Creative and Design", "industry": "Retail and Wholesale Import and Export", "description": "PLEASE NOTE: Applicant must reside near the GREATER MINNEAPOLIS/ST. PAUL AREA MN area.\n\nAs our Senior Designer, you'll be the creative mastermind behind various collection concepts and products. You'll take ideas from a spark to impressive reality, working closely with our designers, production artists, and cross-functional teams. You're a self-starter who can assume multiple projects and deadlines with ease.\n\nWHAT YOU’LL DO:\n\nDesign Magic: From concept to packaging, you'll handle color, graphic design, and product application. Your creativity knows no bounds.\n\nTrend Hunter: Stay ahead of the game by researching current print, graphic, and design trends. Market shopping, trend reviews, and cultural research are your playground.\n\nTeam Collaborator: Work with our design and product development teams to bring your creative vision to life. Communication is key!\n\nMentor Extraordinaire: Help junior designers grow by providing training, development, and feedback.\n\nProject Owner: Take full ownership of your work, ensuring every detail is perfect and meets our high standards.\n\nAdobe Whiz: Keep everything organized and on track using your expert knowledge of design software (Adobe Creative Suite) and our PLM system.\n\nWHAT YOU BRING:\n\n7+ years of designing consumer products.\nA degree in Product, or Graphic Design.\nMastery of Adobe Creative Suite (Illustrator, Photoshop, and InDesign).\nExperience in art direction and creative leadership.\nA sharp eye for trends, color, and design.\nStrong understanding of product design and printing techniques.\n\nStrong understanding of product design.\nAbility to distinguish layout/typography, apply color theory, hierarchy and balance.\nKnowledge of 4-color process printing, as well as spot color printing and various printing techniques.\nClear understanding of die lines and technical drawings.\n\nAbility to work independently and accept client feedback like a pro.\nExcellent communication and organization skills.\nA passion for continuous learning and professional development.\n\nWHY YOU’LL LOVE IT HERE:\n\nBe part of a team that's always innovating and creating.\nWork in a dynamic, fast-paced environment where no two days are the same.\nOpportunities for growth and development.\nCompetitive salary and benefits package.\n\nIf you're ready to make your mark and create beautiful, unique products, we'd love to hear from you!", "responsibilities": "Design Magic: From concept to packaging, you'll handle color, graphic design, and product application. Your creativity knows no bounds.\nTrend Hunter: Stay ahead of the game by researching current print, graphic, and design trends. Market shopping, trend reviews, and cultural research are your playground.\nTeam Collaborator: Work with our design and product development teams to bring your creative vision to life. Communication is key!\nMentor Extraordinaire: Help junior designers grow by providing training, development, and feedback.\nProject Owner: Take full ownership of your work, ensuring every detail is perfect and meets our high standards.\nAdobe Whiz: Keep everything organized and on track using your expert knowledge of design software (Adobe Creative Suite) and our PLM system.", "qualifications": {"required": "7+ years of designing consumer products. A degree in Product, or Graphic Design. Mastery of Adobe Creative Suite (Illustrator, Photoshop, and InDesign). Experience in art direction and creative leadership. A sharp eye for trends, color, and design. Strong understanding of product design and printing techniques.", "preferred": "Ability to work independently and accept client feedback like a pro. Excellent communication and organization skills. A passion for continuous learning and professional development."}, "skills": ["Adobe Creative Suite", "Graphic Design", "Product Design", "Art Direction", "Creative Leadership"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Disability insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3985691590"}