{"jobTitle": "Strategy and Operations Manager, YouTube (Fixed Term Contract)", "company": {"name": "Google", "industry": "Information Services and Technology, Information and Internet", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$142,000.00/yr - $211,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus. Note: By applying to this position you will have an opportunity to share your preferred working location from the following: San Bruno, CA, USA; New York, NY, USA; Los Angeles, CA, USA. Minimum qualifications: 6 years of experience in a management consulting, operations, business strategy, investment banking, venture capital or private equity role, or 4 years of experience with an advanced degree. 3 years of experience working with executive stakeholders. 2 years of experience developing business strategies or managing cross-functional initiatives. Preferred qualifications: MBA or equivalent practical experience. Experience with analytical problem-solving, quantitative analysis, and communicating findings to executive management. Ability to work in ambiguous, fast-changing environments. Ability to work across teams, build relationships, and influence executives. Ability to develop and understand strategy. About The Job This is a 3-year Fixed Term Contract (FTC) role. In this role, you would contribute to multiple teams within the Go-To-Market team through 6 month assignments to support top priorities within the Central Planning and Operations, Product Activation, and Segment Go-To-Market teams. You will lead critical projects helping YouTube’s business grow and operate effectively and enabling our teams to execute against YouTube’s most critical priorities. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together. The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "responsibilities": "Work with function leaders and product managers/leadership to operationalize recommendations, identifying teams and Googlers to execute strategy. Identify problems and issues across the product and create programs and processes to solve them, structuring business issues for the leadership team, to develop solutions. Translate business needs into product strategies, working with leadership to develop and prioritize initiatives, and conduct strategic analysis, optimize business performance, and deliver execution. Manage workflows within the measurement processes, engaging with stakeholders to ensure timely and accurate delivery of work, and establish/lead processes for effectively managing the area (e.g., goals, annual planning, team meetings, budget, expenses, etc.).", "qualifications": {"required": "6 years of experience in a management consulting, operations, business strategy, investment banking, venture capital or private equity role, or 4 years of experience with an advanced degree. 3 years of experience working with executive stakeholders. 2 years of experience developing business strategies or managing cross-functional initiatives.", "preferred": "MBA or equivalent practical experience. Experience with analytical problem-solving, quantitative analysis, and communicating findings to executive management. Ability to work in ambiguous, fast-changing environments. Ability to work across teams, build relationships, and influence executives. Ability to develop and understand strategy."}, "skills": [], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3986176331"}