{"jobTitle": "Production Associate - Long Beach", "company": {"name": "Thistle", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20 - 24", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Food and Beverage Services", "description": "Founded in 2013, Thistle is a leading tech-enabled food and nutrition company that delivers ready-to-eat meals right to your doorstep. We empower our customers to get and stay healthy while improving the sustainability of our food system. Thistle began as a single pop-up location in San Francisco, going from selling cold-pressed juices to delivering nearly 15 million delicious, healthy, plant-forward meals, organic cold-pressed juices, and snacks.<br/><br/>About The Role<br/><br/>We are looking for professional, talented, and driven people to join our Production team to plate and pack our ready-to-eat meals and products into customer bags or boxes for delivery. This position is ideal for someone looking to work hard in a fast-paced environment and bring a positive, open attitude to the job and team!<br/><br/>The schedule for this position is  Sunday 1:00pm-11:25pm or Sunday 5:00am-3:25pm . This position is 100% onsite in our Long Beach, CA, fulfillment facility.<br/><br/>What You’ll Do<br/><br/><ul><li>Work collaboratively with the team to properly execute menu vision and prepare food ingredients; ensure consistency and compliance with Thistle's recipes, portioning, and waste control guidelines</li><li>Maintain a flawlessly clean working environment, follow Thistle GMP and safety standards</li><li>Follow instructions from leads and supervisors</li><li>Appropriately store and manage all food products to ensure safety, quality, and freshness</li><li>Prolonged sitting or standing, physical exertion to manually move, lift, carry, pull or push heavy objects (up to 50 pounds).</li><li>Requires stooping, kneeling, bending or reaching</li><li>You’ll work in a refrigerated environment<br/><br/></li></ul>What You’ll Bring<br/><br/><ul><li>High school diploma or equivalent required</li><li>1+ years equivalent experience preferred</li><li>You bring your A-game every day and encourage your team to do the same</li><li>You have a CA or equivalent Food Handlers Certification - or willing to procure one within 30 days of starting</li><li>You can work a flexible schedule including weekend or early morning shifts</li><li>You are punctual and have attention to detail</li><li>The ability to manually move, lift, carry, pull, or push objects up to 50 pounds<br/><br/></li></ul>$20 - $24 an hour<br/><br/>The starting hourly rate for this position is $20.00 out of the pay band range of $20.00 - $24.00 and represents the company's good faith minimum and maximum range for this role at the time of the posting.<br/><br/>Diversity, equity, and inclusion are essential values at Thistle. We know we do our best and most impactful work when we feel we are represented and belong. We're proud to actively recruit and hire talented people from a wide variety of backgrounds and experiences. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "responsibilities": "Work collaboratively with the team to properly execute menu vision and prepare food ingredients; ensure consistency and compliance with Thistle's recipes, portioning, and waste control guidelines\nMaintain a flawlessly clean working environment, follow Thistle GMP and safety standards\nFollow instructions from leads and supervisors\nAppropriately store and manage all food products to ensure safety, quality, and freshness\nProlonged sitting or standing, physical exertion to manually move, lift, carry, pull or push heavy objects (up to 50 pounds).\nRequires stooping, kneeling, bending or reaching\nYou’ll work in a refrigerated environment", "qualifications": {"required": "High school diploma or equivalent required\n1+ years equivalent experience preferred\nYou bring your A-game every day and encourage your team to do the same\nYou have a CA or equivalent Food Handlers Certification - or willing to procure one within 30 days of starting\nYou can work a flexible schedule including weekend or early morning shifts\nYou are punctual and have attention to detail\nThe ability to manually move, lift, carry, pull, or push objects up to 50 pounds"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986725271"}