{"jobTitle": "Director, Supply Chain Ops", "company": {"name": "Cedars-Sinai", "location": "Beverly Hills, CA", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$61.60 - $107.80", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong><strong>Job Summary: Key Job Responsibilities<br/><br/></strong>The Director, Supply Chain Operations directs and oversees the daily operations and management of leadership team for all assigned Supply Chain functions within the medical center, to include, but not limited to fulfillment, distribution (i.e. AGVS fleet, dock, receiving, ED, IR. Cath and other procedural/nursing units) and/or procurement of supplies and products. Rounds regularly with key stakeholders to support and lead the Supply Chain Transformation. Responsible to direct/guide leadership team in addressing tactical service issues in support of clinical needs while continuing to evaluate resources and execution of strategic initiatives (i.e. Value Analysis, Operational Excellence and EIS). Actively identifies and leads process improvement and transformation initiatives within the medical center in collaboration with the broader Supply Chain organization (i.e. – inventory optimization, service improvement, workflow assessment and improvement, policy/procedure development, etc.). Ensures all performance measures are actively managed and continuously improved. Act as primary liaison with clinicians and physicians as well as other leaders to enable consistent service delivery, system strategy alignment and financial effectiveness.<br/><br/><strong>Primary Duties And Responsibilities<br/><br/></strong><ul><li>Provides operational/financial planning, analysis, leadership, and oversight for the entire Supply Chain management function with close collaboration with the Supply Chain leadership core team. Develops policies and procedures for Supply Chain responsibilities and ensures all operational and service level outcomes are met.</li><li>Drives process optimization opportunities to improve service, team effectiveness and financial results. Champions the Supply Chain Transformation across the medical center by leveraging analytic tools, KPIs and other central resources to effectively lead transformational change across Supply Chain Operations.</li><li>Oversees the broader management of Supply Chain operations, in collaboration with the leadership for assigned departments/units to ensure optimal par levels, timeliness, cost reduction and/or efficiency efforts are implemented in accordance to operational goals. Promotes and ensures alignment by establishing departmental goals and facilitating collaboration and coordination for interdepartmental problem-solving to drive process and productivity improvement opportunities that enhance department operations.</li><li>Ensure compliance with state and federal laws, accreditation, professional and regulatory agency standards, and licensure requirements. Maintain staff compliance with Cedars-Sinai policies, procedures, and protocols. Ensure department specific products are properly stored and secured.</li><li>In collaboration with Executive leadership, develop business and operations plans for assigned units and for specific supply chain programs and services. Ensure fiscal responsibility for department for the unit including unit budget preparation, labor and supply cost management, and revenue enhancement.</li><li>Evaluates performance measurement tools to ensure we maintain and promote a customer focus model with consistent focus on customer relations, soliciting input regarding customer feedback and participating in customer satisfaction initiatives.</li><li>Identifies and developments competency tools to ensure appropriate staff education that, promotes an environment that fosters self-directed staff and assist employees to develop and contribute to the organization. Provide leadership, coaching and opportunities for professional development to staff.</li><li>Leads supply chain transformation with supply chain operations function across the medical center campus.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Job Qualifications <br/><br/></strong>Education<br/><br/>Minimum Requirement - Bachelor's Degree - Business Management, Supply Chain, Finance, Healthcare Administration, and/or related field.<br/><br/>Preferred Requirement - Master's Degree - Business Management, Supply Chain, Finance, Healthcare Administration, and/or related field.<br/><br/>Work Experience<br/><br/>Minimum Requirement - 7 years - Supply chain management/ operations experience.<br/><br/>Preferred Requirement - 7 years - Supply chain management/ operations experience in an acute care facility.<br/><br/>Minimum Requirement - 5 years - Supply chain management/ operations experience in a union environment.<br/><br/><strong>About Us<br/><br/></strong>Cedars-Sinai is a leader in providing high-quality healthcare encompassing primary care, specialized medicine and research. Since 1902, Cedars-Sinai has evolved to meet the needs of one of the most diverse regions in the nation, setting standards in quality and innovative patient care, research, teaching and community service. Today, Cedars- Sinai is known for its national leadership in transforming healthcare for the benefit of patients. Cedars-Sinai impacts the future of healthcare by developing new approaches to treatment and educating tomorrow's health professionals. Additionally, Cedars-Sinai demonstrates a commitment to the community through programs that improve the health of its most vulnerable residents.<br/><br/><strong>Req ID</strong> : 4038<br/><br/><strong>Working Title</strong> : Director, Supply Chain Ops<br/><br/><strong>Department</strong> : Central Supply<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Supply Chain / Procurement<br/><br/><strong>Job Specialty</strong> : Supply Chain<br/><br/><strong>Overtime Status</strong> : EXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $61.60 - $107.80", "responsibilities": "Provides operational/financial planning, analysis, leadership, and oversight for the entire Supply Chain management function with close collaboration with the Supply Chain leadership core team. Develops policies and procedures for Supply Chain responsibilities and ensures all operational and service level outcomes are met.Drives process optimization opportunities to improve service, team effectiveness and financial results. Champions the Supply Chain Transformation across the medical center by leveraging analytic tools, KPIs and other central resources to effectively lead transformational change across Supply Chain Operations.Oversees the broader management of Supply Chain operations, in collaboration with the leadership for assigned departments/units to ensure optimal par levels, timeliness, cost reduction and/or efficiency efforts are implemented in accordance to operational goals. Promotes and ensures alignment by establishing departmental goals and facilitating collaboration and coordination for interdepartmental problem-solving to drive process and productivity improvement opportunities that enhance department operations.Ensure compliance with state and federal laws, accreditation, professional and regulatory agency standards, and licensure requirements. Maintain staff compliance with Cedars-Sinai policies, procedures, and protocols. Ensure department specific products are properly stored and secured.In collaboration with Executive leadership, develop business and operations plans for assigned units and for specific supply chain programs and services. Ensure fiscal responsibility for department for the unit including unit budget preparation, labor and supply cost management, and revenue enhancement.Evaluates performance measurement tools to ensure we maintain and promote a customer focus model with consistent focus on customer relations, soliciting input regarding customer feedback and participating in customer satisfaction initiatives.Identifies and developments competency tools to ensure appropriate staff education that, promotes an environment that fosters self-directed staff and assist employees to develop and contribute to the organization. Provide leadership, coaching and opportunities for professional development to staff.Leads supply chain transformation with supply chain operations function across the medical center campus.", "qualifications": {"required": "Bachelor's Degree - Business Management, Supply Chain, Finance, Healthcare Administration, and/or related field.7 years - Supply chain management/ operations experience.5 years - Supply chain management/ operations experience in a union environment.", "preferred": "Master's Degree - Business Management, Supply Chain, Finance, Healthcare Administration, and/or related field.7 years - Supply chain management/ operations experience in an acute care facility."}, "skills": [], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3986611929"}