{"jobTitle": "Manager, Marketing Systems", "company": {"name": "Airtable", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "146,100.00/yr - 229,900.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Airtable is the no-code app platform that empowers people closest to the work to accelerate their most critical business processes. More than 500,000 organizations, including 80% of the Fortune 100, rely on Airtable to transform how work gets done.<br/><br/>We are passionate about how our product democratizes software creation and empowers anyone to “create anything.” We believe well-designed, integrated business systems are critical to our teams’ executing on this vision. As the Leader of MarTech, you will be responsible for developing and delivering a world class digital experience for our Marketing teams.<br/><br/>We are looking for an experienced and passionate Marketing systems leader to join our team. In this role, you will be part of an enthusiastic team that manages Airtable's business systems. You will play a critical role in supporting and evolving our platforms and capabilities that drive demand. We’re looking for folks who know what good looks like, but who are flexible, resourceful, collaborative and really excited to join us on our adventure to figure out both the right long term vision and the right next steps for tomorrow.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Serve as a trusted and strategic advisor to Marketing business stakeholders </li><li>Be a thought leader to curate capability driven roadmap aligned to business goals</li><li>Lead the Marketing digital transformation journey and own the delivery of initiatives</li><li>Be responsible for day to day support and maintenance of Marketing systems</li><li>Emerge as the definitive authority on Marketing technologies, steering their selection, integration, to advance marketing efficacy and ROI</li><li>Partner with Marketing teams across operations, demand gen, and customer marketing to define requirements, drive adoption, lead user acceptance testing, and deployments</li><li>Define what success looks like by defining OKRs, measuring KPIs, and bringing clarity of execution to stakeholders </li><li>Engage effectively with business stakeholders and lead a team of contractors/consultants</li><li>Partner closely with other technology leaders to influence end-state architecture and drive secure, resilient and scalable technology solutions that solve business problems </li><li>Proactively research new vendors, technologies, and industry best practices that will inform our long-term marketing and technology strategy<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>10+ years of experience in leading large-scale marketing technology platform transformations and enterprise implementations</li><li>5+ years of experience in people management managing external and internal resources</li><li>Strong performance record in managing successful marketing programs, ideally across multiple channels</li><li>Ability to quickly prioritize and drive decisions in a constantly changing dynamic environment</li><li>Deep expertise in designing and building Customer Data Platforms, Marketing Automations and Personalization Platforms at scale</li><li>Expertise building and scaling campaign management platforms to manage omni-channel customer journeys</li><li>Exceptional business and technical acumen and ability to make data-driven decisions to drive measurement impact.</li><li>Solid experience in Marketo, Iterable, 6sense, people.ai, drift and other GTM, data and integration technologies</li><li>Familiar or has worked on application of GenAI in the marketing domain</li><li>Must be a team player, able to work collaboratively with and through others, and able to share knowledge and coach others</li><li>Capable of driving difficult conversions, ability to influence and removing roadblocks to execute business strategies</li><li>Problem solving and critical thinking skills, technical acumen, excellent communication skills with the ability to articulate complex ideas effectively</li><li>Proven ability to break down and diagnose issues, then identify and rapidly deploy fixes.</li><li>Bachelor’s or Master’s degree in CS or equivalent<br/><br/></li></ul>Airtable is an equal opportunity employer. We embrace diversity and strive to create a workplace where everyone has an equal opportunity to thrive. We welcome people of different backgrounds, experiences, abilities, and perspectives. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or any characteristic protected by applicable federal and state laws, regulations and ordinances. Learn more about your EEO rights as an applicant<strong>. <br/><br/></strong>VEVRAA-Federal Contractor<br/><br/>If you have a medical condition, disability, or religious belief/practice which inhibits your ability to participate in any part of the application or interview process, please complete our Accommodations Request Form and let us know how we may assist you. Airtable is committed to participating in the interactive process and providing reasonable accommodations to qualified applicants.<br/><br/>Compensation awarded to successful candidates will vary based on their work location, relevant skills, and experience.<br/><br/>Our total compensation package also includes the opportunity to receive benefits, restricted stock units, and may include incentive compensation. To learn more about our comprehensive benefit offerings, please check out Life at Airtable.<br/><br/>For work locations in the San Francisco Bay Area, New York City, and Los Angeles, the base salary range for this role is:<br/><br/>$162,300 - $229,900 USD<br/><br/>For all other work locations (including remote), the base salary range for this role is:<br/><br/>$146,100 - $206,900 USD<br/><br/>Please see our Privacy Notice for details regarding Airtable’s collection and use of personal information relating to the application and recruitment process by clicking here.<br/><br/>", "postedDate": "3 weeks ago", "skills": ["Marketo", "Iterable", "6sense", "people.ai", "drift", "Customer Data Platforms", "Marketing Automations", "Personalization Platforms", "campaign management platforms", "GenAI"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3986133939"}