{"jobTitle": "Warehouse Supervisor (Chinese/English) - West Coast", "company": {"name": "Cainiao Group", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$65,000.00/yr - $85,000.00/yr", "currency": "USD"}, "jobFunction": "Management, Quality Assurance, and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Warehouse Supervisor - Commerce, CA</strong><p><br/></p><p><strong>About Us</strong></p><p><strong>Overview</strong></p><p>Cainiao is a global leader in e-commerce logistics and the largest provider of cross-border e-commerce logistics services. Established in 2013 by Alibaba Group and partners, we address the evolving logistics needs of buyers and sellers on Alibaba’s platforms. Our cutting-edge technology and deep e-commerce expertise have made us a leader in each of our business segments.</p><p><br/></p><p><strong>Global Reach, Innovation and Leadership</strong></p><ul><li><strong>Cross-Border Logistics:</strong> Cainiao is the world’s No.1 cross-border e-commerce logistics company. We offer a range of solutions, including cross-border express delivery, global supply chain management, and local services. Our innovative “10-day global delivery” and “5-day global delivery” solutions support small and medium-sized enterprises in cross-border trade.</li><li><strong>Strategic Facilities:</strong> Cainiao operates logistics facilities in key locations worldwide, serving over 200 countries and regions. Our network integrates advanced technology at every level.</li><li><strong>Cainiao Post:</strong> We have developed the largest digital “pick up, drop off” network globally through our “Cainiao Post” solution.</li></ul><p><br/></p><p>Cainiao's ESG initiatives are deeply embedded in every element of the logistics value chain, revolving around five focus areas, namely green logistics, customer experience, community services, emergency logistics and high-quality employment. </p><p>Looking ahead, Cainiao is committed to delivering faster, more cost-effective, and environmentally friendly services to merchants and consumers across the world.</p><p><br/></p><p><strong>Job Description:</strong></p><ul><li><strong>Customer Targets:</strong> Achieve and exceed customer targets.</li><li><strong>Team Coordination:</strong> Manage and coordinate with the operational team to enhance performance.</li><li><strong>Performance Monitoring:</strong> Oversee and monitor the performance of warehouse sub-departments.</li><li><strong>Process Improvement:</strong> Identify and implement improvements to warehouse processes.</li><li><strong>Team Development:</strong> Develop team leaders to manage their areas, ensuring alignment with KPI’s and customer expectations.</li><li><strong>Staff Management:</strong> Arrange shifts and ensure sufficient staff coverage.</li><li><strong>Staff Engagement:</strong> Foster engagement and enthusiasm among warehouse staff.</li><li><strong>Training and Development:</strong> Maintain staff performance through training, coaching, mentoring, and discipline as needed.</li><li><strong>Safety:</strong> Champion a safe working environment and ensure adherence to health and safety regulations.</li><li><strong>Stock Checks:</strong> Conduct biannual and rolling stock checks.</li><li><strong>Maintenance:</strong> Oversee regular checks and upkeep of premises, equipment, and company trucks, ensuring compliance with maintenance agreements.</li><li><strong>Operational Planning:</strong> Prepare plans for operational peaks and projects.</li><li><strong>Additional Duties:</strong> Perform other reasonable duties as assigned by senior management.</li></ul><p><br/></p><p><strong>Requirements:</strong></p><ul><li><strong>Management Experience:</strong> Proven experience in warehouse management.</li><li><strong>Leadership:</strong> Positive attitude, leading by example, and building relationships.</li><li><strong>Problem-Solving:</strong> Passion for identifying issues and implementing solutions.</li><li><strong>Attention to Detail:</strong> Exceptional attention to detail.</li><li><strong>Communication Skills:</strong> Strong verbal and written communication skills.</li><li><strong>Organizational Skills:</strong> Excellent planning and organizational abilities.</li><li><strong>People Management:</strong> Experience in people management, including knowledge of disciplinary, grievance, and mentoring processes.</li><li><strong>Bilingual:</strong> Proficiency in English and Chinese.</li></ul><p></p>", "responsibilities": "Achieve and exceed customer targets. Manage and coordinate with the operational team to enhance performance. Oversee and monitor the performance of warehouse sub-departments. Identify and implement improvements to warehouse processes. Develop team leaders to manage their areas, ensuring alignment with KPI’s and customer expectations. Arrange shifts and ensure sufficient staff coverage. Foster engagement and enthusiasm among warehouse staff. Maintain staff performance through training, coaching, mentoring, and discipline as needed. Champion a safe working environment and ensure adherence to health and safety regulations. Conduct biannual and rolling stock checks. Oversee regular checks and upkeep of premises, equipment, and company trucks, ensuring compliance with maintenance agreements. Prepare plans for operational peaks and projects. Perform other reasonable duties as assigned by senior management.", "qualifications": {"required": "Proven experience in warehouse management. Positive attitude, leading by example, and building relationships. Passion for identifying issues and implementing solutions. Exceptional attention to detail. Strong verbal and written communication skills. Excellent planning and organizational abilities. Experience in people management, including knowledge of disciplinary, grievance, and mentoring processes. Proficiency in English and Chinese."}, "skills": ["Warehouse Management", "Leadership", "Problem Solving", "Attention to Detail", "Communication", "Organizational Skills", "People Management", "Bilingual", "English", "Chinese"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986495133"}