{"jobTitle": "Director, VIP & Influence Services", "company": {"name": "KARLA OTTO", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000.00/yr - $115,000.00/yr", "currency": "USD"}, "jobFunction": "Public Relations", "industry": "Public Relations and Communications Services", "description": "Karla Otto is a renowned public relations and communications agency with offices across 14 locations in the UK, EMEA, US, and Asia. Established in 1982 by Karla Otto herself, the agency has since grown to become a global leader in luxury brand PR and events.\n\nWith offices in major fashion capitals such as Milan, London, New York, and Los Angeles, Karla Otto represents some of the most prestigious fashion, beauty, and lifestyle brands in the industry.\n\nIn 2017, Karla Otto and K2 merged to form The Independents, a global group of agencies for industry leaders across luxury and lifestyle. Currently this group comprises of Bureau Betak & Bureau Future, Karla Otto, K2, The Qode, Lefty, Prodject and CTZA, Atelier LUM, INCA Productions and Atelier Athem, Kennedy and Sunshine\n\nOur network of expert strategists, designers, planners, and publicists work tirelessly to deliver exceptional results and establish long-term partnerships with our clients. We are passionate about the world of fashion, beauty, and luxury, with everyone bringing their unique expertise and insights to the table. We are driven by a shared commitment to excellence and a deep understanding of the ever-evolving industry landscape.\n\nTo help support our future growth as an agency, we are looking for a Director, VIP Services to lead our team based in Los Angeles. Please note this role will be fully remote and required to work EST hour to align with our New York office.\n\n**Key Responsibilities**\n\n* Further the development of VIP/Celebrity and Influencer services for Karla Otto, building relationships with talent and agency representation across fashion, music, film, and TV, and sports\n* Generate top-tier opportunities for clients to engage with talent targets (inclusive of brand ambassadorships, event attendance, social media campaigns, dressing, gifting, loaning, etc.) via both earned and paid engagements\n* Be an expert in the talent space, sharing thoughtful insight with clients (including but not limited to: VIP/Celebrity activities, the competitive landscape, industry news, fee structures, high quality talent recommendations)\n* Lead communication with high-profile clients daily and own client relationships that lead to long-lasting partnerships\n* Utilize personal contacts with stylists, talent and agents to optimize potential for organic/earned placements and event invites\n* Actively work to create new relationships with VIP/Celebrity and Influencer talent and their agents \n* Be an in-person representative for top tier stylists and foster new relationships with emerging stylists \n* Develop thoughtful 360 VIP/Celebrity and influencer strategies for seeding, gifting, dressing, and loans for existing clients and new business pitches \n* Proactively share key VIP/Celebrity and influencer calendar moments with clients to recommend dressing or gifting opportunities\n* Develop creative ideas and solutions to execute a brand’s vision that will successfully deliver it to their target and aspirational audiences, pivoting strategy when necessary\n* Build contracts for new clients - define scope of work, including organic and paid partnerships, seedings, events, and guest lists\n* Confidently lead, encourage, and mentor direct reports and junior staff members\n* Negotiate, contract and execute long-term celebrity deals, influencer campaigns, one-off celebrity spotted moments, event attendance, etc.\n* Act as on-site leader and client point-of-contact at brand events and fashion shows\n* Attend industry events and remain well ahead of emerging trends and talent \n* Demonstrate value of talent relationships and report on effectiveness of projects and campaigns upon completion\n\n**Key Attributes**\n\n* 8-10 years’ experience within an agency or in-house, working in fashion and/or entertainment\n* Proven track record of successfully managing large-scale celebrity campaigns for clients in a variety of industries.\n* Ability to lead and manage multiple direct reports\n* Established connections and relationships within the entertainment industry (talent agents, influencers, publicists, managers, stylists, relevant media)\n* Excellent working knowledge of social platforms\n* High level execution skills and meticulous attention to detail, both aesthetically and organizationally\n* Strong negotiator and creative problem solver\n* Experienced working through complex contracts with legal to reach a resolution\n* Confidently deliver ideas to the wider team that focuses on client experience\n* Enthusiasm to attend industry events with strong awareness of cultural calendar\n* Strong communication skills (both written and oral), research, and organization skills\n* A positive, can-do attitude who can work under pressure and likes to solve problems\n* A creative, innovative thinker with an open attitude and eagerness to learn new things\n\nWhat We Offer...\n\n* Medical, Dental, and Vision plans\n* 401K Employer Match program\n* Commuter Benefits\n* Paid Time Off including Vacation Days, Personal Days, Sick Days, and additional Comp Days\n* Company-wide closure last week of the year\n* 10 Federal Holidays Observed\n\nAt Karla Otto, we are always looking for personalities with positive charisma who are enthusiastic, self-motivated, and have a keen sense of aesthetics.\n\nKarla Otto embraces and celebrates diversity, inclusivity, and equal opportunity. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. Karla Otto provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression.\n\nWe aspire to have a diverse and inclusive workplace and strongly encourage qualified applicants from a wide range of backgrounds to apply and join our team!", "responsibilities": "Further the development of VIP/Celebrity and Influencer services for Karla Otto, building relationships with talent and agency representation across fashion, music, film, and TV, and sports\nGenerate top-tier opportunities for clients to engage with talent targets (inclusive of brand ambassadorships, event attendance, social media campaigns, dressing, gifting, loaning, etc.) via both earned and paid engagements\nBe an expert in the talent space, sharing thoughtful insight with clients (including but not limited to: VIP/Celebrity activities, the competitive landscape, industry news, fee structures, high quality talent recommendations)\nLead communication with high-profile clients daily and own client relationships that lead to long-lasting partnerships\nUtilize personal contacts with stylists, talent and agents to optimize potential for organic/earned placements and event invites\nActively work to create new relationships with VIP/Celebrity and Influencer talent and their agents \nBe an in-person representative for top tier stylists and foster new relationships with emerging stylists \nDevelop thoughtful 360 VIP/Celebrity and influencer strategies for seeding, gifting, dressing, and loans for existing clients and new business pitches \nProactively share key VIP/Celebrity and influencer calendar moments with clients to recommend dressing or gifting opportunities\nDevelop creative ideas and solutions to execute a brand’s vision that will successfully deliver it to their target and aspirational audiences, pivoting strategy when necessary\nBuild contracts for new clients - define scope of work, including organic and paid partnerships, seedings, events, and guest lists\nConfidently lead, encourage, and mentor direct reports and junior staff members\nNegotiate, contract and execute long-term celebrity deals, influencer campaigns, one-off celebrity spotted moments, event attendance, etc.\nAct as on-site leader and client point-of-contact at brand events and fashion shows\nAttend industry events and remain well ahead of emerging trends and talent \nDemonstrate value of talent relationships and report on effectiveness of projects and campaigns upon completion", "qualifications": {"required": "8-10 years’ experience within an agency or in-house, working in fashion and/or entertainment\nProven track record of successfully managing large-scale celebrity campaigns for clients in a variety of industries.\nAbility to lead and manage multiple direct reports\nEstablished connections and relationships within the entertainment industry (talent agents, influencers, publicists, managers, stylists, relevant media)\nExcellent working knowledge of social platforms\nHigh level execution skills and meticulous attention to detail, both aesthetically and organizationally\nStrong negotiator and creative problem solver\nExperienced working through complex contracts with legal to reach a resolution\nConfidently deliver ideas to the wider team that focuses on client experience\nEnthusiasm to attend industry events with strong awareness of cultural calendar\nStrong communication skills (both written and oral), research, and organization skills\n A positive, can-do attitude who can work under pressure and likes to solve problems\nA creative, innovative thinker with an open attitude and eagerness to learn new things", "preferred": ""}, "skills": ["Public Relations", "Fashion", "Entertainment", "Celebrity Relations", "Influencer Marketing", "Event Management", "Social Media", "Communication", "Negotiation", "Contract Management"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Medical, Dental, and Vision plans\n401K Employer Match program\nCommuter Benefits\nPaid Time Off including Vacation Days, Personal Days, Sick Days, and additional Comp Days\nCompany-wide closure last week of the year\n10 Federal Holidays Observed", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3986403556"}