{"jobTitle": "Cargo Handler", "company": {"name": "DHL Global Forwarding", "industry": "Transportation, Logistics, Supply Chain and Storage", "size": "30,000 employees", "location": "Los Angeles, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Competitive base salary", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "DHL Global Forwarding (DGF) is the world leader in air freight services and one of the leading providers of ocean freight services. Around 30,000 employees work to ensure we transport our customers of shipments by air or sea. DGF's logistics solutions span the entire supply chain, from the factory to the shop floor. This also includes special transport-related services. As a Forklift Driver / Warehouse Associate you will be responsible for performing all tasks associated with warehousing and distribution including picking, packing, shipping, receiving, labeling, loading/unloading, and inventory control.", "responsibilities": "Receives, sorts, and segregates incoming shipments for warehouse / distribution facilities. Loads and unloads shipments on to or off of pallets, trays, racks, and shelves by hand. Sorts and processes outgoing shipments according to established procedures and regulations. Load shipments into vehicles and uses hand tools to install strapping, bracing, and padding. Prepares and updates information in computerized systems such as logs, packing lists, pick tickets, invoices, inventories, transfer/delivery tickets, orders / receipts etc. Maintains inventory records of customer shipments and performs audits to ensure integrity and security of freight. May perform routine vehicle, equipment, and warehouse maintenance. May operate forklift, hand jacks, and other vehicles and equipment.", "qualifications": {"required": "Strong communication skills, Knowledge of scanning freight in/out of the warehouse, Detail oriented and strong follow-up skills, Able to walk/stand/kneel for long periods of time and lift 40-50 pounds occasionally, Forklift experience (stand up is preferred), Warehouse management systems (WMS) experience is preferred, Warehouse and / or Freight Forwarding industry experience strongly preferred.", "preferred": ""}, "skills": ["Strong communication skills", "Knowledge of scanning freight in/out of the warehouse", "Detail oriented", "Strong follow-up skills", "Able to lift 40-50 pounds occasionally", "Forklift experience", "Warehouse management systems (WMS) experience"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "Total Compensation Package: We offer a competitive base salary. 401(k) with a match: Pre-tax 401(k) contribution plan comes with a $1 for $1 match up to 4% quarterly, plus a 2% base contribution annually to help you save for retirement. Stock Purchase Plan: Eligible employees can purchase Deutsche Post AG shares at a 15% discount and benefit from the Group’s success as shareholders. Medical: We offer comprehensive healthcare plans covering preventative care, inpatient and outpatient services, and prescription drugs. Vision: Optional coverage for eye exams, frames, and contact lenses. Dental: Optional coverage for preventative, major, and basic dental services. Holiday / Paid Time Off: The company provides paid time off for 7 major holidays each calendar year (New Year's Day, MLK Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day, and Christmas Day), plus 8 floating holidays, and accrued vacation days.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986140569"}