{"jobTitle": "Digital Strategy Manager, Enterprise Dealer Groups (Los Angeles, CA)", "company": {"name": "PureCars", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Advertising Services", "description": "Who is PureCars?<br/><br/>PureCars helps unlock the full sales potential of automotive dealers across the US and Canada using our proprietary multi-channel advertising and analytics platform combined with our team of high-touch digital strategy experts. By utilizing our extensive data library and proprietary technology, our digital advertising and attribution solutions enable dealers to capture more customers, optimize spend efficiency and maximize profitability while providing mission critical business insights and analytics.<br/><br/>We are focused on investing in world-class talent and technology in order to help our partners dominate their markets in new and innovative ways.<br/><br/>Job Summary - Digital Strategy Manager, Enterprise Dealer Groups (Los Angeles, CA)<br/><br/>PureCars is seeking a talented Digital Strategy Manager to join our growing Client Experience team. As a Digital Strategy Manager, you will help build and expand our relationships with the largest enterprise level automotive client, [client name redacted for NDA purposes], in PureCars Tier 3 book of business. Through regular communication, strategic planning sessions, and data-driven business reviews, you will act as a key liaison between the client and PureCars’ internal teams and partner with our Ad Performance team to help manage all phases of the interactive campaign cycle, from research and planning to optimization and analysis. If you have a strong background in relationship management, digital marketing and technology, and enjoy expanding your portfolio using industry-changing products, we would love to hear from you!<br/><br/>What You’ll Do:<br/><br/><ul><li>Act as PureCars’ subject matter expert to our Enterprise / Major Group automotive client across an assigned territory in the United States by managing the post-sale client relationship, digital ad and product strategy, in constant pursuit of the most effective and efficient ad strategy to enable [Client] to hit its Sales and Service objectives.</li><li>Build trust by being a connected client advocate and resource through consistent delivery of high value insights, giving PureCars’ clients the edge in a hyper-competitive landscape.</li><li>Track, analyze, create, and deliver relevant industry data and performance metrics through high-impact presentations to key automotive dealership executives including Dealer Group C-Suite, Corporate Marketing personnel, Corporate Regional Managers, Dealer Principals, General Managers, General Sales Managers, and E-Commerce Managers.</li><li>Partner alongside various internal ad performance teams (Paid Search, Social, Programmatic/Display, Video, OTT, SEO, Onsite Offers, and more) to ensure the execution of successful campaigns in accordance with client’s objectives and budgets.</li><li>Use your technical and business development chops to educate clients on using our platform, increase client’s utilization of current technology, and keep clients updated on new technology/feature releases.</li><li>Overnight travel is expected. This role is primarily in-dealership and will be client-facing 4+ days / week, 2+ weeks / month.<br/><br/><br/></li></ul>The Skills and Experience You Bring:<br/><br/><ul><li>This role is client facing, primarily in-dealership and corporate. Candidates must live in the assigned territory or willing to relocate within 6 months of hire date.</li><li>Minimum 5 years in the Auto-tech industry, with proven success managing multi-rooftop, high stakes relationships. </li><li>Prior AdTech SaaS or Digital Advertising client success experience with a focus on paid search and/or display products and services. Demonstrated ability in building world-class relationships with client executives and in communicating technical product capabilities, success metrics, and best practices to technical and non-technical audiences.</li><li>Skilled in client performance data analysis and in providing actionable and impactful insights to clients with a focus on optimizing revenue generation.</li><li>Adept in quickly analyzing varying client environments and needs, identifying and influencing key decision makers, and creating a long-term adoption of PureCars’ value proposition and suite of products.</li><li>Strong knowledge of online media channels (paid search, display, social, video, local SEO) and metrics, MS Excel/Google Sheets, Salesforce, PowerPoint, analytics tools, and client research.</li><li>Top-notch communication and presentation skills to a wide variety of audiences across a variety of regions and cultures.<br/><br/><br/></li></ul>Our Perks &amp; Quirks:<br/><br/><ul><li>Rich Benefits Plans - Health, dental, vision, 401(k), paid parental leave, and more!</li><li>Open PTO Policy - Take what you need, when you need it.</li><li>Internal Growth - Over ⅓ of the positions opened and filled are with our own employees. </li><li>Learning and Development - Robust new employee onboarding, leadership, and management training. </li><li>Radical Transparency - All employees have direct access to our executive leadership, whether in recurring town halls or direct conversation and mentorship. </li><li>Diversity &amp; Inclusion - Come one, come all! Between ongoing training, panels, celebrations, and more, our DEI team ensures every employee knows they belong here.<br/><br/><br/></li></ul>Salary Range: $125K-$135K depending on experience.<br/><br/><em>PureCars is committed to building diverse teams and upholding an equal employment workplace that is free from discrimination. We hire amazing individuals regardless of their race, color, ancestry, religion, sex, gender identity, national origin, sexual orientation, age, citizenship, marital status, pregnancy, medical conditions, genetic information, disability, or Veteran status. Just be passionate, genuine, collaborative, data-driven, and entrepreneurial at heart!<br/><br/></em>", "responsibilities": "<ul><li>Act as PureCars’ subject matter expert to our Enterprise / Major Group automotive client across an assigned territory in the United States by managing the post-sale client relationship, digital ad and product strategy, in constant pursuit of the most effective and efficient ad strategy to enable [Client] to hit its Sales and Service objectives.</li><li>Build trust by being a connected client advocate and resource through consistent delivery of high value insights, giving PureCars’ clients the edge in a hyper-competitive landscape.</li><li>Track, analyze, create, and deliver relevant industry data and performance metrics through high-impact presentations to key automotive dealership executives including Dealer Group C-Suite, Corporate Marketing personnel, Corporate Regional Managers, Dealer Principals, General Managers, General Sales Managers, and E-Commerce Managers.</li><li>Partner alongside various internal ad performance teams (Paid Search, Social, Programmatic/Display, Video, OTT, SEO, Onsite Offers, and more) to ensure the execution of successful campaigns in accordance with client’s objectives and budgets.</li><li>Use your technical and business development chops to educate clients on using our platform, increase client’s utilization of current technology, and keep clients updated on new technology/feature releases.</li><li>Overnight travel is expected. This role is primarily in-dealership and will be client-facing 4+ days / week, 2+ weeks / month.<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>This role is client facing, primarily in-dealership and corporate. Candidates must live in the assigned territory or willing to relocate within 6 months of hire date.</li><li>Minimum 5 years in the Auto-tech industry, with proven success managing multi-rooftop, high stakes relationships. </li><li>Prior AdTech SaaS or Digital Advertising client success experience with a focus on paid search and/or display products and services. Demonstrated ability in building world-class relationships with client executives and in communicating technical product capabilities, success metrics, and best practices to technical and non-technical audiences.</li><li>Skilled in client performance data analysis and in providing actionable and impactful insights to clients with a focus on optimizing revenue generation.</li><li>Adept in quickly analyzing varying client environments and needs, identifying and influencing key decision makers, and creating a long-term adoption of PureCars’ value proposition and suite of products.</li><li>Strong knowledge of online media channels (paid search, display, social, video, local SEO) and metrics, MS Excel/Google Sheets, Salesforce, PowerPoint, analytics tools, and client research.</li><li>Top-notch communication and presentation skills to a wide variety of audiences across a variety of regions and cultures.<br/><br/><br/></li></ul>"}, "skills": ["Paid Search", "Display", "Social", "Video", "OTT", "SEO", "Onsite Offers", "MS Excel", "Google Sheets", "Salesforce", "PowerPoint", "Analytics"], "postedDate": "3 weeks ago", "benefits": "<ul><li>Rich Benefits Plans - Health, dental, vision, 401(k), paid parental leave, and more!</li><li>Open PTO Policy - Take what you need, when you need it.</li><li>Internal Growth - Over ⅓ of the positions opened and filled are with our own employees. </li><li>Learning and Development - Robust new employee onboarding, leadership, and management training. </li><li>Radical Transparency - All employees have direct access to our executive leadership, whether in recurring town halls or direct conversation and mentorship. </li><li>Diversity &amp; Inclusion - Come one, come all! Between ongoing training, panels, celebrations, and more, our DEI team ensures every employee knows they belong here.<br/><br/><br/></li></ul>", "salary": {"amount": "125,000.00 - 135,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986109338"}