{"jobTitle": "Head of Real Estate, Google Store", "company": {"name": "Google", "location": "Mountain View, CA"}, "location": "Mountain View, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "165,000.00/yr - 248,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management, Strategy/Planning, and Other", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Mountain View, CA, USA; Chicago, IL, USA; New York, NY, USA; San Francisco, CA, USA**. **Minimum qualifications:**<br/><br/> <ul><li>Bachelor's degree or equivalent practical experience.</li><li>8 years of experience in program or project management. </li><li>8 years of experience managing cross-functional or cross-team projects.</li><li>Experience working in the Americas retail market industry, including key retail locations, market trends, and regulatory environments.<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>10 years of experience in retail real estate, with 5 years of experience in an executive leadership role.</li><li>Ability to lead and inspire teams, drive results, and manage complex projects.</li><li>Excellent communication and people management skills, with the ability to build relationships and influence stakeholders at all levels.</li><li>Excellent negotiation, investigative, and project management skills.<br/><br/></li></ul> **About The Job**<br/><br/> A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.<br/><br/> Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.<br/><br/> In this role, you will be responsible for leading the expansion and management of our retail store portfolio across North America. You will drive our store growth strategy, ensure optimal site selection, build strong relationships with landlords, and manage day-to-day operations of the real estate development process to support our brand's growth objectives in the North Americas.<br/><br/> Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices &amp; Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices &amp; Services team is making people's lives better through technology.<br/><br/> The US base salary range for this full-time position is $165,000-$248,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/> **Responsibilities**<br/><br/> <ul><li>Conduct thorough market research and analysis to identify trends, opportunities, and engaging dynamics in the North American retail landscape.</li><li>Develop and implement a comprehensive retail real estate strategy to support the company's expansion goals in the North Americas.</li><li>Establish and maintain strong relationships with landlords to unlock exceptional opportunities and secure prime locations for the business. </li><li>Identify and evaluate potential locations for new stores, ensuring alignment with brand standards and market potential.</li><li>Lead the negotiation of Letters of Intent (LOI) to secure preliminary agreements and set the stage for lease negotiations.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "Conduct thorough market research and analysis to identify trends, opportunities, and engaging dynamics in the North American retail landscape. Develop and implement a comprehensive retail real estate strategy to support the company's expansion goals in the North Americas. Establish and maintain strong relationships with landlords to unlock exceptional opportunities and secure prime locations for the business.  Identify and evaluate potential locations for new stores, ensuring alignment with brand standards and market potential. Lead the negotiation of Letters of Intent (LOI) to secure preliminary agreements and set the stage for lease negotiations.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 8 years of experience in program or project management.  8 years of experience managing cross-functional or cross-team projects. Experience working in the Americas retail market industry, including key retail locations, market trends, and regulatory environments.", "preferred": "10 years of experience in retail real estate, with 5 years of experience in an executive leadership role. Ability to lead and inspire teams, drive results, and manage complex projects. Excellent communication and people management skills, with the ability to build relationships and influence stakeholders at all levels. Excellent negotiation, investigative, and project management skills."}, "skills": [], "postedDate": "11 hours ago", "benefits": "bonus + equity + benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986409933"}