{"jobTitle": "Video Content Creator", "company": {"name": "CULT GAIA", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Art/Creative", "industry": "Retail Apparel and Fashion", "description": "Seeking a skilled video content creator to make digital material for marketing purposes, such as Tik Tok, Instagram, YouTube, Pinterest and related media. The ideal candidate is creative and loves generating new and fun ways to make content. Keeping the pulse on all social media trends is a must.", "responsibilities": "Creates short, impactful promotional video content daily for marking purposes – posting on social media and ecomm platforms. Create and work within the established content calendar to deliver videos promptly and regularly. Quickly and effectively identify moments worth creating and formatting for social content for a variety of brands, shows, and publications. Collaborate with the content team and other internal departments on video production, social planning, and other improvements. Contribute to team brainstorming sessions on video and social strategies. Speech creative ideas on how to edit previously recorded incoming footage for the prod team. Proactively identify inefficiencies & challenges and work collaboratively to implement solutions. Set up and breakdown recording equipment before and after use. Keep all video equipment in good working order. Experience with lighting and audio equipment, color correction, editing, and digital special effects. Must keep track of time spent shooting and editing videos to ensure a sound output. Must have finger on the pulse of Internet and meme culture. Knowledge of current video trends and how to apply them to brand specific content. Familiar with location scouting. Be able to format for different social channels.", "qualifications": {"required": "Technical proficiency of various video editing software and editing programs such as Adobe Creative Suite including but not limited to Premiere Pro, After Effects, Photoshop, and Final Cut. Familiar with best practices for media creation on the different editing software. Excellent interpersonal skills to work with people of all ages and walks of life; ability to help talent feel relaxed and comfortable in front of the camera. Excellent time management skills; ability to work within tight deadlines, capturing actions, and once-in-a lifetime moments on camera. Typography and kinetic typography skills are a plus. Excellent verbal communication skills. Keen attention to detail to ensure precise edits. Comfortable handling multiple edits and revisions with tight turnaround times. 4 plus years of video editing experience. Proficient knowledge of color correction, tracking, and motion graphics. Solid organizational skills, detail oriented, with time management skills and ability to juggle multiple priorities. Must be able to give and receive constructive feedback in a team environment.", "preferred": "A portfolio is required to be considered for this role!"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental, Vision & Dependent Coverage, 401K with company match, Life Insurance, Pet Insurance, PTO, Paid Sick Leave, Clothing Allowance, Referral Program", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3986704905"}