{"jobTitle": "Project Coordinator - Bone Health - 8 Hour Days", "company": {"name": "Cedars-Sinai", "location": "Beverly Hills, CA", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$29.00 - $44.95", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "<strong>Job Description<br/><br/></strong>Align yourself with an organization that has a reputation for excellence! Cedars Sinai was awarded the National Research Corporation’s Consumer Choice Award 19 years in a row for providing the highest-quality medical care in Los Angeles. We also were awarded the Advisory Board Company’s Workplace of the Year. This annual award recognizes hospitals and health systems nationwide that have outstanding levels of employee engagement. We provide an outstanding benefits package, along with competitive compensation. Join us! Discover why U.S. News &amp; World Report has named us one of America’s Best Hospitals.<br/><br/><strong>What will you be doing in this role?<br/><br/></strong>The Program/Project Coordinator provides strategic support to a mid to large scale, recognized organizational program/project by coordinating all operations for the assigned program or project to facilitate the effective management of programs/projects according to organizational standards.<br/><br/><strong>Duties and Responsibilities:<br/><br/></strong><ul><li>Coordinates and maintains applicable program/project schedules and agendas; which may include tracking deadlines, deliverables, communication with management and/or team members.</li><li>Collaborate with other departments, staff, leaders and/or other partners in the administration of the program/project. Provide coordination of applicable logistics or information as directed by leadership.</li><li>Organizes and coordinates the development of all featured events, outreach activities, meetings and materials/collateral; in the promotion and administration of the program/project. May actively represent the program and/or the organization.</li><li>Helps foster a collaborative and positive relationship building dynamic with internal staff and external parties. May be responsible for providing any applicable education, training, on-boarding and/or mentorship pertaining to program/project.</li><li>Supports the development and management of program/project budgets; maintain and track all supporting budget/financial files and documents. Interface with other departments, vendors and applicable community parties as needed.</li><li>Responsible for creating reports for management in the evaluation of the program/project performance or day-to-day operations. May also be responsible for documenting and tracking program/project compliance.</li><li>May provide feedback to management and make recommendations regarding program/project operations and/or procedures.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Education:<br/><br/></strong><ul><li>High School Diploma/GED required</li><li>Bachelor’s Degree in Healthcare, Business, Management or related field preferred<br/><br/></li></ul><strong>Work Experience:<br/><br/></strong><ul><li>2+ years progressively responsible administrative or strategic support experience required</li><li>3+ years of organizational program or project coordination/support experience; utilizing program/project management and development procedures preferred<br/><br/></li></ul>Cedars-Sinai is an EEO employer. Cedars-Sinai does not unlawfully discriminate on the basis of the race, religion, color, national origin, citizenship, ancestry, physical or mental disability, legally protected medical condition (cancer-related or genetic characteristics or any genetic information), marital status, sex, gender, sexual orientation, gender identity, gender expression, pregnancy, age (40 or older), military and/or veteran status or any other basis protected by federal or state law. If you need a reasonable accommodation for any part of the employment process, please contact us by email at Applicant_Accommodation@cshs.org and let us know the nature of your request and your contact information. Requests for accommodation will be considered on a case-by-case basis. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.<br/><br/>Cedars-Sinai will consider for employment qualified applicants with criminal histories, in accordance with the Los Angeles Fair Chance Initiative for Hiring.<br/><br/>At Cedars-Sinai, we are dedicated to the safety, health and wellbeing of our patients and employees. This includes protecting our patients from communicable diseases, such as influenza (flu). For this reason, we require that all new employees receive a flu vaccine based on the seasonal availability of flu vaccine (typically during September through March each year) as a condition of employment, and annually thereafter as a condition of continued employment.<br/><br/><strong>Req ID</strong> : 4162<br/><br/><strong>Working Title</strong> : Project Coordinator - Bone Health - 8 Hour Days<br/><br/><strong>Department</strong> : Ortho Clinical Programs<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Administrative<br/><br/><strong>Job Specialty</strong> : Administrative<br/><br/><strong>Overtime Status</strong> : NONEXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $29.00 - $44.95", "responsibilities": "The Program/Project Coordinator provides strategic support to a mid to large scale, recognized organizational program/project by coordinating all operations for the assigned program or project to facilitate the effective management of programs/projects according to organizational standards.", "qualifications": {"required": "High School Diploma/GED required, 2+ years progressively responsible administrative or strategic support experience required", "preferred": "Bachelor’s Degree in Healthcare, Business, Management or related field preferred, 3+ years of organizational program or project coordination/support experience; utilizing program/project management and development procedures preferred"}, "skills": [], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "Cedars Sinai was awarded the National Research Corporation’s Consumer Choice Award 19 years in a row for providing the highest-quality medical care in Los Angeles. We also were awarded the Advisory Board Company’s Workplace of the Year. This annual award recognizes hospitals and health systems nationwide that have outstanding levels of employee engagement. We provide an outstanding benefits package, along with competitive compensation. Join us! Discover why U.S. News &amp; World Report has named us one of America’s Best Hospitals.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3986618069"}