{"jobTitle": "Engineering Manager", "company": {"name": "Lumicity", "industry": "Defense and Space Manufacturing and Aviation and Aerospace Component Manufacturing", "size": "Not specified", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "On-Site", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Engineering and Management", "industry": "Defense and Space Manufacturing and Aviation and Aerospace Component Manufacturing", "description": "My client is the leading independent manufacturer of durable embedded systems designed for the most challenging environments. They offer advanced solutions in AI, cybersecurity, and digital infrastructure, supporting over 60 top-industry aerospace, military, and space clients.", "responsibilities": "Lead the design & development of electronic systems and circuit card assemblies. Manage PCB process and fabrication. Integrate electronic design and layout functions. Oversee electrical engineering projects. Provide technical support as needed. Lead technical reviews. Establish and manage budgets. Provide technical proposal support and cost estimates.", "qualifications": {"required": "Bachelor's degree in Electrical Engineering or related field. 3+ years of management/lead experience within a small to mid-sized company. 10+ years of electrical/electronic engineering experience. Aerospace, Defense, and/or Space industry experience. Solid understanding of circuit design all the way to the component level. FPGA and Processors: Proficient in designing with Microchip/Microsemi and AMD/Xilinx FPGAs and modern Intel/NXP processors and SoCs. Memory Design: Experience with DDR 2/3/4 Memories. Bus Systems: Familiar with VME, PCI, cPCI, and VPX systems and standards.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3986124498"}