{"jobTitle": "Assistant General Manager", "company": {"name": "Victra - Verizon Authorized Retailer", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$19.28/hr - $24.85/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Telecommunications", "description": "When you join Victra<br/><br/>Victra is the largest Verizon authorized retailer in the United States. As an Assistant General Manager, you’ll get to encourage a sales team and create outstanding customer experiences in one of our retail stores. In this role, you’ll be leading a store team from developing the best sales specialists and driving sales targets to financials and store merchandising. You’ll be the one creating an outstanding in-store experience that will make customers feel good about our brand and solutions—and help them to choose our wireless products and services.<br/><br/>Are you a person who thrives in a competitive atmosphere, while having fun with your team? If so, then you will fit right in. If you love helping others grow to their full potential and consistently deliver results, then Victra is the place for you. Apply today!<br/><br/>We believe in <strong>#Performance #Collaboration #Integrity #Innovation #Integrity #Celebration<br/><br/></strong>On a typical day, you will take care of your guests and confirm that your coworkers have what they need. You will lead by example on the sales floor. Your interactions with customers will show your coworkers how it's done. You will coach them one on one and motivate them to reach the next level of performance. You will also be responsible for some daily operational tasks and will lead your team when the General Manager is away.<br/><br/><ul><li>Leading your team by resolving customer issues and assisting with customer transactions. </li><li>Taking direction from store leader on day-to-day operations. </li><li>Setting and sharing daily/weekly/monthly goals with sales teams. </li><li>Providing your team with training and mentoring to deliver an outstanding customer experience by handling customer flow and store traffic. </li><li>Identifying any selling skill gaps, then building and implementing development plans to help the team meet and exceed sales metrics and quota assignments. </li><li>Running store operations – analyzing staffing needs, reporting financial and sales data, handling cash, meeting compliance, opening trouble tickets with Facilities/Network/IT as needed to ensure store up-time and functionality. </li><li>Monitoring inventory by restocking shelves with product, maintaining device security, and managing the cleanliness of the store. </li><li>Leading store merchandising and planogram compliance in accordance with company expectations. </li><li>Completing store opening and closing activities. </li><li>Collective responsibility on attaining store targets daily/weekly/monthly. <br/><br/></li></ul><strong>Here is what we can offer you in exchange for your world-class work: <br/><br/></strong><ul><li>Paid Training </li><li>Premium Health, Dental, and Vision Insurance </li><li>Paid Maternity Leave </li><li>401K Match </li><li>Tuition Reimbursement </li><li>50% off Verizon Service </li><li>VNation Disaster Relief </li><li>Referral Bonus </li><li>Diversity, Equity, &amp; Inclusion Employee Resource Groups </li><li>Frequent Contests </li><li>Career Advancement Opportunities </li><li>A comprehensive benefit list can be viewed here. Please note that all benefits are subject to the terms and conditions of the plan document or insurance policy. <br/><br/></li></ul>From a fun work environment to an inclusive culture to amazing benefits, VNation is all about being part of a team that invests in you. Click here to learn more!<br/><br/>As part of our retail stores, the Assistant General Manager compensation includes commissions and a minimum base pay of <strong>$</strong>$19.28 per hour. We are proud that our Assistant General Managers make a national average of <strong>$24.85</strong> per hour with the opportunity to earn more through uncapped commissions. That's more than <strong>$50,000.00</strong> per year based on a 40-hour work week. The estimated average maximum is $70,000 per year based on a <strong>40-hour</strong> work week.<br/><br/><strong>What We Are Looking For...<br/><br/></strong>You thrive in a sales environment and sharing this energy with a team that you can develop and motivate excites you most. You set the bar high when it comes to achieving goals, and you know how to motivate others to help you get there. You’re open to new ideas, relate well with a variety of different people and are attuned to the needs of others to ensure that they can perform at their best. You know you’ve succeeded when your team is delivering.<br/><br/><strong>You Will Need To Have<br/><br/></strong><ul><li>Background in customer service within the retail, restaurant, or wireless industry preferred </li><li>1-2 years of experience in a Customer Service or leadership role </li><li>Management experience in a commissions-based sales environment. </li><li>Proven track record of achieving challenging team and individual sales goals. </li><li>Balanced multiple opposing priorities in a multifaceted environment. </li><li>Set goals, evaluated performance, and developed a high performing team. </li><li>Basic interview skills and enhanced staffing knowledge. </li><li>High school diploma or GED. </li><li>One or more years of customer service, preferably in a retail or sales environment. </li><li>Willingness to work evenings, weekends, holidays, November through December, and/or during peak vacation periods. </li><li>At least 18 years of age </li><li>Legally authorized to work in the United States <br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Ability to lift ten pounds. </li><li>Ability to stand for long periods of time <br/><br/></li></ul><strong>Training Requirements<br/><br/></strong>All Assistant General Managers are required to attend and successfully complete a 4-day New Hire University (NHU) training program within 2 weeks of their official start date. This class may include overnight travel at the company's expense. All Dual General Managers are required to attend and successfully complete a 3-day General Manager University (SMU) training program within 30 days of completing NHU. This class may include overnight travel at the company's expense. Various online and computer-based training will be required throughout your employment with Victra.<br/><br/><strong>After you apply…<br/><br/></strong>You will be required to take a pre-hire assessment. It takes only 20 minutes or less to complete. If you’re selected to move forward, one of our recruiters or hiring managers will reach out to tell you more about the role and answer your questions.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>We are proud to be an Equal Employment Opportunity Employer - and we celebrate our employees' differences. We do not discriminate on the basis of race, color, age, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth, breastfeeding, and related medical conditions), gender (including gender identity, gender expression, and transgender), marital status, sexual orientation, sex stereotype, national origin, ancestry, citizenship, military or veteran status, physical or mental disability, and genetic information. Different makes us better.<br/><br/> ", "responsibilities": "Leading your team by resolving customer issues and assisting with customer transactions. \nTaking direction from store leader on day-to-day operations. \nSetting and sharing daily/weekly/monthly goals with sales teams. \nProviding your team with training and mentoring to deliver an outstanding customer experience by handling customer flow and store traffic. \nIdentifying any selling skill gaps, then building and implementing development plans to help the team meet and exceed sales metrics and quota assignments. \nRunning store operations – analyzing staffing needs, reporting financial and sales data, handling cash, meeting compliance, opening trouble tickets with Facilities/Network/IT as needed to ensure store up-time and functionality. \nMonitoring inventory by restocking shelves with product, maintaining device security, and managing the cleanliness of the store. \nLeading store merchandising and planogram compliance in accordance with company expectations. \nCompleting store opening and closing activities. \nCollective responsibility on attaining store targets daily/weekly/monthly. ", "qualifications": {"required": "Background in customer service within the retail, restaurant, or wireless industry preferred \n1-2 years of experience in a Customer Service or leadership role \nManagement experience in a commissions-based sales environment. \nProven track record of achieving challenging team and individual sales goals. \nBalanced multiple opposing priorities in a multifaceted environment. \nSet goals, evaluated performance, and developed a high performing team. \nBasic interview skills and enhanced staffing knowledge. \nHigh school diploma or GED. \nOne or more years of customer service, preferably in a retail or sales environment. \nWillingness to work evenings, weekends, holidays, November through December, and/or during peak vacation periods. \nAt least 18 years of age \nLegally authorized to work in the United States ", "preferred": "Ability to lift ten pounds. \nAbility to stand for long periods of time"}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Paid Training \nPremium Health, Dental, and Vision Insurance \nPaid Maternity Leave \n401K Match \nTuition Reimbursement \n50% off Verizon Service \nVNation Disaster Relief \nReferral Bonus \nDiversity, Equity, & Inclusion Employee Resource Groups \nFrequent Contests \nCareer Advancement Opportunities \nA comprehensive benefit list can be viewed here. Please note that all benefits are subject to the terms and conditions of the plan document or insurance policy. ", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986151406"}