{"jobTitle": "Merchandiser", "company": {"name": "Jacent", "location": "La Crescenta, CA"}, "location": "La Crescenta, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00", "currency": "USD"}, "jobFunction": "Advertising", "industry": "Retail Apparel and Fashion", "description": "Our merchandisers are the heart and soul of Jacent. They’re on the front lines in more than 17,000 stores placing just the right products, building displays, and working with store personnel – right in their own community. Our people are what makes us special and makes us the #1 impulse merchandising company in North America. We are looking for individuals that align with our culture pillars of We Always Play Offense, We Are Solutions Oriented, We Deliver Legendary Service, We Act With Integrity And Courage, and We Are Stronger Together.<br/><br/><strong>Why Jacent?<br/><br/></strong><ul><li>Daytime hours and a predictable schedule</li><li>Paid training</li><li>Mileage and travel time paid between stores</li><li>Cell phone reimbursement</li><li>Advancement opportunities</li><li>Quarterly performance incentives</li><li>$18.00 per hour</li><li>10 HOURS PER WEEK<br/><br/></li></ul><strong>Who We’re Looking For<br/><br/></strong><ul><li>A self-starter and quick learner who enjoys working both independently and in a team setting</li><li>Someone who is comfortable in changing environments</li><li>Someone who is able to meet the physical requirements of the role, with or without a reasonable accommodation, which include:</li><ul><li>Standing and walking 3-8hrs</li><li>Lifting up to 50 lbs</li><li>Crouching, bending, twisting, and repetitive hand movements</li></ul><li>Possesses excellent organizational skills</li><li>A strong communicator with the ability to build relationships with business partners. </li><li>Resides within 20 miles of CRESCENTA, CA, 91214 / MONTROSE, CA, 91020<br/></li></ul><strong>What You’ll Be Doing<br/><br/></strong><ul><li>Cultivating relationships with in-store management</li><li>Executing merchandising resets</li><li>Building retail displays</li><li>Merchandising impulse items on clip strips &amp; J-hooks</li><li>Implementing plan-o-grams<br/><br/></li></ul><strong>Check out this video to learn more! <br/><br/></strong>A Day in the Life of a Jacent Merchandiser<br/><br/><strong>Who We Are<br/><br/></strong>Jacent is the leading cross-merchandising impulse product company in North America and offers multiple solutions to make the challenging world of retail easier.<br/><br/>We are strategic merchandising experts. With our data driven insights and complete line of impulse products, we enable inspired shopping experiences – and increased sales. Jacent sources shopper-inspired products, and blends data and experience to help retailers design and manage strategic merchandising programs. With our 2,500+ merchandising employees, we then provide the merchandising for more than 17,000 stores to maximize sales.<br/><br/><strong>EOE Statement<br/><br/></strong>The Company will make all employment decisions regarding employees and applicants for employment without discrimination or harassment based on race, color, religion, gender, national origin, sexual orientation, age, disability, pregnancy, marital status, veteran status, alienage or citizenship status, creed, genetic predisposition or carrier status, status as a victim of domestic violence, or any other category protected by federal, state, or local law.", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3986702564"}