{"jobTitle": "Accounts Payable Specialist", "company": {"name": "Ledgent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Entry level", "salary": {"amount": "24.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Financial Services", "description": "We are a Business Services Firm that is in search of an experienced Accounts Payable Specialist to add to our growing team. The ideal candidate will be responsible for all accounts payable functions for all of our departments and this includes processing of vendor invoices, related month-end preparing of accruals, processing check requests, billing to the funds, account reconciliations, and other duties assigned.", "responsibilities": "Responsibilities:\n2+ years of relevant work experience\nMust be highly proficient in Excel and Word\nPerform accounts payable duties\nProcess all incoming invoices, check requests, and expense reports\nFile check copies with supporting documentation\nSubmit authorization requests for expenses reimbursable\nTrack all Fund expenses provided by Accounting\nAssist with general ledger accounting including journal entry preparation with appropriate backup\nPerform other related duties as required and assigned\nAll qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "skills": ["Excel", "Word"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986141039"}