{"jobTitle": "Transportation Area Manager II - Oxnard, CA", "company": {"name": "Amazon", "location": "Oxnard, CA"}, "location": "Oxnard, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management, Distribution, and Supply Chain", "industry": "Software Development", "description": "At Amazon, we’re working to be the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and dependable people. Amazon is seeking Transportation Area Managers to work throughout the country. Amazon is one of the most recognizable brand names in the world and we distribute over a billion shipments each year to our loyal customers.\n\nResponsibilities\n\nFour key areas that you’ll always focus on are the safety, quality, customer experience, and productivity of your department. Key responsibilities include:\n\n<ul><li> Collaborate with site leadership on quality and Customer Experience metrics, including the root cause analysis of problem areas</li><li> Streamline logistics in the operation through the implementation of standard work and team leadership</li><li> Support and commit to all safety programs and OSHA compliance to ensure a safe work environment for all associates</li><li> Proactively identify and lead process improvement initiatives and Lean tools\n\n</li></ul>Supervisory Responsibilities\n\nYou and your team of Transportation Associates are responsible for Amazon customers receiving their orders. You are responsible for ensuring that you have properly trained people, and that their needs are addressed so they can focus on their jobs. In addition, one of the most important aspects of your job is to lead change at internet speed……innovation has made us the global company that we are today. Candidates must be flexible to work weekends and/or overnight shifts regularly.\n\nAmazon offers competitive packages, growth potential and a challenging and inclusive work environment.\n\nBasic Qualifications\n\n<ul><li> 2+ years of employee and performance management experience</li><li> Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience</li><li> Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\n\n</li></ul>Preferred Qualifications\n\n<ul><li> 1+ years of performance metrics, process improvement or lean techniques experience\n\n</li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $61,400/year in our lowest geographic market up to $100,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\n\n\nCompany - Amazon.com Services LLC\n\nJob ID: A2714365", "responsibilities": "Four key areas that you’ll always focus on are the safety, quality, customer experience, and productivity of your department. Key responsibilities include:\n\n<ul><li> Collaborate with site leadership on quality and Customer Experience metrics, including the root cause analysis of problem areas</li><li> Streamline logistics in the operation through the implementation of standard work and team leadership</li><li> Support and commit to all safety programs and OSHA compliance to ensure a safe work environment for all associates</li><li> Proactively identify and lead process improvement initiatives and Lean tools\n\n</li></ul>Supervisory Responsibilities\n\nYou and your team of Transportation Associates are responsible for Amazon customers receiving their orders. You are responsible for ensuring that you have properly trained people, and that their needs are addressed so they can focus on their jobs. In addition, one of the most important aspects of your job is to lead change at internet speed……innovation has made us the global company that we are today. Candidates must be flexible to work weekends and/or overnight shifts regularly.", "qualifications": {"required": "2+ years of employee and performance management experience\nBachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\nWork a flexible schedule/shift/work area, including weekends, nights, and/or holidays", "preferred": "1+ years of performance metrics, process improvement or lean techniques experience"}, "skills": [], "postedDate": "3 days ago", "salary": {"amount": "61,400.00/year - $100,000.00/year", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3986975701"}