{"jobTitle": "Business Analyst, Omni-channel - Remote", "company": {"name": "Harbor Freight Tools", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Retail", "description": "The retail landscape continues evolving and blurring the line between physical and digital experiences. Harbor Freight Tools is dedicated to building a more unified and customer-centric experience across all selling channels, such as brick-and-mortar store, website, and customer service. We are looking for a Business Analyst to join the Omni-channel team and drive change across the organization. Omni-channel projects are highly collaborative and involve multiple teams to implement customer-facing enhancements: E-Commerce, Inventory, Retail Ops, DC Ops, Strategy, Customer Service, Marketing, and IT. The Omni-channel Business Analyst will focus on leading cross-functional teams, compiling business requirements, managing the Omni-channel roadmap, and providing Harbor Freight Tool customers more ways to shop and interact with us. We are looking for a strong team player with an ability to prioritize initiatives, communicate effectively, creatively solve complex problems, and an inherent sense of curiosity.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Partner with project owners and stakeholders to deliver state-of-the art, scalable, and cost-effective capabilities within time, budget, and quality constraints. </li><li>Be accountable for assignments and operate with minimal supervision from leaders. </li><li>Work on multiple deliverables concurrently and keep stakeholders updated on progress and what to expect next. </li><li>Makes sure that goals and scope are clearly and completely communicated and documented for all efforts. </li><li>Break goals down into manageable iterations and prioritize deliverables based on the organizations capability and capacity to deliver. </li><li>Document and communicate business and functional requirements to technical teams, designers, and business stakeholders. </li><li>Create process flows and graphical aids to help stakeholders visualize current state and proposed state processes and the transitions between them. </li><li>Identify the impacts of solutions and issues to scope and stakeholders and manage the resulting changes. </li><li>Validate that deliverables satisfy requirements. Leverage test teams if they’re available to support cross application testing. </li><li>Coordinate solution demos and support user acceptance testing (UAT). </li><li>Assists with preparing end user documentation and training materials. </li><li>Solicit feedback from stakeholders and incorporate requests into future iterations. </li><li>Document and drive resolution for post issues identified post implementation. </li><li>Facilitate a transition of responsibilities and knowledge from project to operational teams. </li><li>Identify and suggest opportunities to improve team and business processes.</li><li>No formal supervisory responsibilities in this position. May provide informal assistance such as technical and business guidance and/or training co-workers. <br/><br/></li></ul><strong>Scope<br/><br/></strong><ul><li>Staff supervision and development: No</li><li>Decision making: Provides data for decision support</li><li>Travel: Up to 5%</li><li>Remote<br/><br/></li></ul><strong>RequirementsEducation And Experience<br/><br/></strong><ul><li>Preferred- 4 Year / Bachelors Degree </li><li>Preferred- 2 Year / Associate Degree<br/><br/></li></ul><strong>Years Of Experience<br/><br/></strong><ul><li>5+ years of experience documenting business and/or functional requirements.</li><li>2+ years of experience designing and implementing business and/or technical processes.</li><li>2+ years of experience building tests and validating deliverables.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Strong verbal and written communication skills.</li><li>Able to explain complex challenges and solutions clearly to both technical and non-technical audiences.</li><li>Detail focused and curious to understand the base components of processes.</li><li>Proactive and assertive with solid organizational skills.</li><li>Process flow modeling and system integration mapping.</li><li>Familiar with order management and routing (especially inventory management and payment processing) in retail, ecommerce, and omnichannel spaces.</li><li>Understand common integration methods that support data handling between applications and how to implement them.</li><li>Data querying, interpretation and presentation.</li><li>Proficient skills with Microsoft Office Suite products.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Corporate – Remote: General office environment requiring ability to:</li><li>Stand, walk, sit for extended periods of time .</li><li>Speak and listen to others in person and over the phone and video conferencing.</li><li>Use keyboard and read from computer screen and reports.</li><li>The ability to lift up to 15 lbs.<br/><br/></li></ul><strong>Safety<br/><br/></strong>Must be able to perform this job safely in accordance with standard operating procedures and good manufacturing practices, without endangering the health or safety of self or others.", "responsibilities": "Partner with project owners and stakeholders to deliver state-of-the art, scalable, and cost-effective capabilities within time, budget, and quality constraints. Be accountable for assignments and operate with minimal supervision from leaders. Work on multiple deliverables concurrently and keep stakeholders updated on progress and what to expect next. Makes sure that goals and scope are clearly and completely communicated and documented for all efforts. Break goals down into manageable iterations and prioritize deliverables based on the organizations capability and capacity to deliver. Document and communicate business and functional requirements to technical teams, designers, and business stakeholders. Create process flows and graphical aids to help stakeholders visualize current state and proposed state processes and the transitions between them. Identify the impacts of solutions and issues to scope and stakeholders and manage the resulting changes. Validate that deliverables satisfy requirements. Leverage test teams if they’re available to support cross application testing. Coordinate solution demos and support user acceptance testing (UAT). Assists with preparing end user documentation and training materials. Solicit feedback from stakeholders and incorporate requests into future iterations. Document and drive resolution for post issues identified post implementation. Facilitate a transition of responsibilities and knowledge from project to operational teams. Identify and suggest opportunities to improve team and business processes. No formal supervisory responsibilities in this position. May provide informal assistance such as technical and business guidance and/or training co-workers.", "qualifications": {"preferred": "4 Year / Bachelors Degree, 2 Year / Associate Degree", "required": "5+ years of experience documenting business and/or functional requirements. 2+ years of experience designing and implementing business and/or technical processes. 2+ years of experience building tests and validating deliverables."}, "skills": ["Communication", "Problem Solving", "Process Flow Modeling", "System Integration Mapping", "Order Management", "Inventory Management", "Payment Processing", "Retail", "Ecommerce", "Omnichannel", "Integration Methods", "Data Handling", "Data Querying", "Data Interpretation", "Data Presentation", "Microsoft Office Suite"], "postedDate": "2 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3986959464"}