{"jobTitle": "Network Engineer (L5) - Open Connect", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$100,000.00/yr - $720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is responsible for a significant percentage of Internet traffic at peak times, and we are working collaboratively with Internet Service Providers to ensure that our great content is delivered in a manner that is both highly efficient and cost effective. Today, we deliver 100% of Netflix content from Open Connect, our purpose-built content delivery network. We need great network professionals to help us manage the remarkable challenge and opportunity that this scale represents.<br/><br/>The Open Connect team’s mission is to provide a high quality video streaming experience for our customers at a continually declining cost. The Open Connect Network Engineering group is focused on engineering and operation of the Open Connect Global backbone and egress connectivity to partners that is integral to our streaming service and also underpins the networking needs of our employees and content creators worldwide.<br/><br/>The Open Connect Network Engineering group is recruiting for a L5 Network Engineer. We are looking for the following characteristics in candidates.<br/><br/><strong>A Highly Communicative Individual Who Will<br/><br/></strong><ul><li>interact with team members to operate, maintain and upgrade the Open Connect network infrastructure deployed in 90+ locations worldwide </li><li>work cross-functionally with internal teams and vendors to manage our continuous growth around the globe, with a strong focus on maintaining the high level of Quality of Experience (QoE) for Netflix’s users.</li><li>drive continual improvement in resiliency, observability, monitoring, instrumentation, and automation with the primary goal of maintaining a highly scalable and reliable global network to support our CDN platform</li><li>collaborate with external partners, carriers, data center providers and our hardware vendors to manage and troubleshoot the network</li><li>contribute and collaborate with members of our Network Architecture team to implement, operationalize and support complex network designs</li><li>contribute and collaborate with members of our Network Tools team to develop a high level of automation to increase accuracy and decrease timeframes for day-to-day activities</li><li>have strong written and verbal skills for documentation and collaboration</li><li>when in doubt, and after exhausting self help resources available, exercise curiosity by leveraging the opinions of colleagues by seeking additional context or clarification as described within the Netflix Culture memo<br/><br/></li></ul><strong>Your Skills And Experience Should Include<br/><br/></strong><ul><li>relevant professional experience (preferably in the media/content delivery space)</li><li>an understanding of the basics of Live Streaming infrastructure and operations.</li><li>expert knowledge of large scale multi-vendor wide area networks (Arista, Cisco, Juniper)</li><li>expert knowledge of IP routing, particularly BGP and IS-IS</li><li>experience with the internet ecosystem, including the concepts of interconnection, peering, and transit</li><li>experience with MPLS, QoS and DWDM concepts and technologies</li><li>familiarity in network automation with experience using Python <br/><br/></li></ul><strong><strong>This position includes rotating on-call assignment and occasional travel (quarterly off-sites / conferences)<br/><br/></strong></strong>Be sure to review our culture page to learn more about the unique Netflix culture and the opportunity to be part of our team.<br/><br/>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "The Open Connect team’s mission is to provide a high quality video streaming experience for our customers at a continually declining cost. The Open Connect Network Engineering group is focused on engineering and operation of the Open Connect Global backbone and egress connectivity to partners that is integral to our streaming service and also underpins the networking needs of our employees and content creators worldwide.", "qualifications": {"required": "relevant professional experience (preferably in the media/content delivery space), an understanding of the basics of Live Streaming infrastructure and operations., expert knowledge of large scale multi-vendor wide area networks (Arista, Cisco, Juniper), expert knowledge of IP routing, particularly BGP and IS-IS, experience with the internet ecosystem, including the concepts of interconnection, peering, and transit, experience with MPLS, QoS and DWDM concepts and technologies, familiarity in network automation with experience using Python", "preferred": ""}, "skills": ["Live Streaming", "Arista", "Cisco", "Juniper", "BGP", "IS-IS", "MPLS", "QoS", "DWDM", "Python"], "postedDate": "4 days ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3986242791"}