{"jobTitle": "Project Manager", "company": {"name": "Assembly Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "We are Assembly, a leading global omnichannel media agency that merges data, talent, and technology to catalyze growth for the world's most esteemed brands. Our holistic approach weaves together compelling brand narratives with a comprehensive suite of global media capabilities, driving performance and fostering significant business expansion. Our initiatives are powered by STAGE, our proprietary operating system, and executed by a dedicated global team of over 2,300 professionals across 35 offices worldwide. Committed to purposeful action, we lead the way in social and environmental impact within the agency realm. As a proud member of Stagwell, the challenger network designed to revolutionize marketing, Assembly continues to set new standards of excellence.<br/><br/><strong>ICYMI:</strong> Assembly was named Campaign US 2024 Media Agency of the Year, and our North America CEO, Valerie Davis, was recognized as Adweek's Media All-Stars Executive of the Year. Our innovative work has also earned prestigious accolades, including The Webby Awards, Effies, and Cannes Lions.<br/><br/>Follow us on LinkedIn and Instagram!<br/><br/>Assembly is hiring a Project Manager to assist our team. The primary role of the Project Manager is to oversee flawless execution of multi-channel campaigns and projects from inception to completion. Reporting to the Account Director, this role is a key member of our growing team. A successful candidate will be a self-starter with an organized approach to managing colleagues and deliverables; one who loves checking things off the to do list and can motivate colleagues to get the job done well and on time.  <br/><br/><strong>Responsibilities: <br/><br/></strong><ul><li>With Account Director, facilitate the definition of project goals, objectives and define scope </li><li>Define project tasks and develop project plans, schedules, risk assessments, and communication using the tools that reflect the scope of work, client expectations and line of businesses </li><li>Schedule and facilitate meeting agendas, objectives, details, status, meeting notes and follow-ups </li><li>Manage monthly billing process, both internally with the buying and billing teams and externally with the client </li><li>Execute project plans by managing and overseeing resource assignments, managing scope, and assisting with defining technical solutions and directions </li><li>Provide direction and support to project team, while identifying and mitigating risks </li><li>Proactively adjusts budgets and resources, while identifying opportunities to adjust processes for efficiencies. Engaging the appropriate stake holders prior to making any major changes </li><li>Execute project plans by managing and overseeing resource assignments, managing scope, facilitating meetings, and assisting with defining technical solutions and directions </li><li>Excellent written and verbal communication skills </li><li>Excellent organizational and time management skills <br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>1-2 years of experience as a Project Manager, preferably in a digital media agency </li><li>Attention to detail and the ability to focus under pressure </li><li>The ability to organize, direct, and motivate a team (internal and external), calmly and kindly </li><li>Successfully work with various groups to resolve conflicts in a fast-paced environment </li><li>Be able to handle multiple projects, and multiple brands at the same time </li><li>Self-starter with desire to be responsible and accountable for excellence </li><li>Strong interpersonal, analytical, problem solving, negotiating, facilitation, prioritization, decision making, and conflict resolution skills are expected </li><li>Knowledge of collaboration software and project management techniques and tools (MS Teams and Office 365 preferred) </li><li>Proficient in Excel and confident in using this tool to organize budget materials <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Why Assembly?<br/><br/></strong><ul><li>We care about your growth - we offer competitive salaries and annual compensation reviews</li><li>We recognize and celebrate your success...all the time! Whether it's through company meetups, employee recognition programs, or just a regular day, we make sure our people's achievements are known and appreciated</li><li>We're truly a people-first organization. That's why we offer a Flexible Time Off policy that puts you in control of your work-life balance, as well as market-leading primary and secondary caregiver and parental leave policies</li><li>We have a hybrid in-office/remote working policy that focuses on bringing people together in-person when it's needed most, i.e., team strategy brainstorms, learning &amp; development opportunities, and company meetings</li><li>We care about social and environmental Impact - we have dedicated Impact Champions who collaborate globally to make sure we're leaving the world better than we found it</li><li>We have an amazing group of Employee Resource Groups who form close knit communities and are committed to guiding the agency to become more inclusive, diverse, and representative of the world around us</li><li>We're part of Stagwell, the challenger network built to transform marketing. We're nimble and digital-first, and we're quickly growing to take on the biggest legacy hold cos<br/><br/></li></ul><strong>Equal Opportunities<br/><br/></strong>In order to comply with equal pay and salary transparency laws in various locations, we believe the target range of base compensation in all locations within the United States for this role is $70,000 - $80,000. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, and location.<br/><br/>In addition to medical, dental and vision coverage, we offer a generous PTO plan, 401k program, comprehensive family planning benefits (including paid parental leave), and pre-tax commuter benefits. Benefits/perks may vary depending on the nature of your employment with Assembly and the location where you work.<br/><br/><em>At Assembly, we believe every career is as unique as the individual and empower employees to reach their full potential in a winning culture motivated by a powerful purpose. <br/><br/></em><em>Assembly is an advocate for equal opportunity in the workplace. We are committed to ensuring equal opportunities regardless of race, color, religion, sex, national origin, sexual orientation, age, citizenship, marital status, gender identity, status as a protected veteran, among other things, or status as a qualified individual with disability. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know. EEO Employer M/F/Vet/Disabled.</em>", "responsibilities": "With Account Director, facilitate the definition of project goals, objectives and define scope \nDefine project tasks and develop project plans, schedules, risk assessments, and communication using the tools that reflect the scope of work, client expectations and line of businesses \nSchedule and facilitate meeting agendas, objectives, details, status, meeting notes and follow-ups \nManage monthly billing process, both internally with the buying and billing teams and externally with the client \nExecute project plans by managing and overseeing resource assignments, managing scope, and assisting with defining technical solutions and directions \nProvide direction and support to project team, while identifying and mitigating risks \nProactively adjusts budgets and resources, while identifying opportunities to adjust processes for efficiencies. Engaging the appropriate stake holders prior to making any major changes \nExecute project plans by managing and overseeing resource assignments, managing scope, facilitating meetings, and assisting with defining technical solutions and directions \nExcellent written and verbal communication skills \nExcellent organizational and time management skills", "qualifications": {"required": "1-2 years of experience as a Project Manager, preferably in a digital media agency \nAttention to detail and the ability to focus under pressure \nThe ability to organize, direct, and motivate a team (internal and external), calmly and kindly \nSuccessfully work with various groups to resolve conflicts in a fast-paced environment \nBe able to handle multiple projects, and multiple brands at the same time \nSelf-starter with desire to be responsible and accountable for excellence \nStrong interpersonal, analytical, problem solving, negotiating, facilitation, prioritization, decision making, and conflict resolution skills are expected \nKnowledge of collaboration software and project management techniques and tools (MS Teams and Office 365 preferred) \nProficient in Excel and confident in using this tool to organize budget materials", "preferred": ""}, "skills": ["Project Management", "MS Teams", "Office 365", "Excel", "Communication", "Organization", "Time Management"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "We care about your growth - we offer competitive salaries and annual compensation reviews\nWe recognize and celebrate your success...all the time! Whether it's through company meetups, employee recognition programs, or just a regular day, we make sure our people's achievements are known and appreciated\nWe're truly a people-first organization. That's why we offer a Flexible Time Off policy that puts you in control of your work-life balance, as well as market-leading primary and secondary caregiver and parental leave policies\nWe have a hybrid in-office/remote working policy that focuses on bringing people together in-person when it's needed most, i.e., team strategy brainstorms, learning & development opportunities, and company meetings\nWe care about social and environmental Impact - we have dedicated Impact Champions who collaborate globally to make sure we're leaving the world better than we found it\nWe have an amazing group of Employee Resource Groups who form close knit communities and are committed to guiding the agency to become more inclusive, diverse, and representative of the world around us\nWe're part of Stagwell, the challenger network built to transform marketing. We're nimble and digital-first, and we're quickly growing to take on the biggest legacy hold cos", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3986596025"}