{"jobTitle": "Social Media Marketing Manager", "company": {"name": "Claynosaurz", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Animation and Post-production", "description": "<strong>Job Description:</strong>\n<p>Claynosaurz is at the forefront of leveraging emerging technologies to build a global IP through animation, gaming, product development, e-commerce, community, and more. We are disrupting the entertainment industry and how traditional brands are built by specializing in creating captivating content that resonates with audiences worldwide. We are looking for a Social Media Marketing Manager with a passion for branded entertainment to elevate our social media presence.</p>\n<p><br/></p>\n<p><strong>Responsibilities:</strong></p>\n<p><strong>Growth &amp; Brand Awareness Strategy: </strong></p>\n<ul>\n<li>Develop and implement effective social media strategies focusing on growth while enhancing the brand's image and awareness primarily on <span>Instagram and TikTok. </span></li>\n<li>Collaborate with marketing, animation, and graphic design teams to create cohesive and engaging content focusing on emerging trends and story-telling.</li>\n</ul>\n<p><br/></p>\n<p><strong>Content Creation &amp; Management: </strong></p>\n<ul>\n<li>Identify new trends and lead the creation of high-quality and creative content for various social media platforms with a heavy focus on Instagram.</li>\n<li>Coordinate with marketing and graphic design departments to produce visually appealing and engaging e-commerce and product marketing posts.</li>\n<li>Expertly manage content calendars and scheduling.</li>\n</ul>\n<p><br/></p>\n<p><strong>Community Engagement &amp; Activation: </strong></p>\n<ul>\n<li>Actively monitor and respond to direct messages and comments across all social media accounts.</li>\n<li>Foster a positive and interactive community by engaging with followers and addressing their inquiries or feedback promptly.</li>\n</ul>\n<p><br/></p>\n<p><strong>E-commerce Management (Toys and Apparel): </strong></p>\n<ul>\n<li>Set up and manage the brand's Instagram e-shop, ensuring a seamless and user-friendly experience.</li>\n<li>Utilize Instagram's e-commerce features to drive online sales and convert users to our direct-to-consumer shopping experience.</li>\n<li>Collaborate with marketing and creative on unique content ideas and ad campaigns to drive sales and conversions to our collectible line of products.  </li>\n</ul>\n<p><br/></p>\n<p><strong>Advertising &amp; Analytics: </strong></p>\n<ul>\n<li>Plan and execute influencer and paid advertising campaigns to increase brand visibility and drive conversions.</li>\n<li>Analyze social media metrics and report on the performance of campaigns, making data-driven recommendations for improvement.</li>\n</ul>\n<p><br/></p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Proven experience as a Social Media Manager at a global media franchise or <span>in the entertainment industry</span>.  </li>\n<li>Strong understanding of Instagram with a track record of creating successful content.</li>\n<li>Experience in brand building, storytelling, and e-commerce, particularly on Instagram.</li>\n<li>Ability to coordinate and collaborate with animation and graphic design teams.</li>\n<li>Excellent creative writing skills and ability to establish and maintain brand voice guidelines.</li>\n<li>Proficiency in monitoring and managing social media interactions.</li>\n<li>Experience in running influencer and paid advertising campaigns on social media.</li>\n<li>Strong analytical skills and ability to interpret social media metrics.</li>\n</ul>\n<p><br/></p>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Bachelor's degree in Marketing, Communications, or a related field.</li>\n<li>Experience in setting up and managing e-commerce shops on Instagram.</li>\n<li>Knowledge of other social media platforms (TikTok, X (Twitter), LinkedIn) and emerging trends on each platform.</li>\n<li>Familiarity with social media management tools and analytics platforms.</li>\n<li>Understanding of web3 technologies is a plus.</li>\n</ul>\n<p><br/></p>", "postedDate": "3 weeks ago", "skills": ["Instagram", "TikTok", "Social Media Marketing", "Brand Building", "Storytelling", "E-commerce", "Content Creation", "Content Management", "Community Engagement", "Social Media Analytics", "Influencer Marketing", "Paid Advertising", "Web3"], "url": "https://www.linkedin.com/jobs/view/3986724387"}