{"jobTitle": "Social Media Coordinator", "company": {"name": "Academy of Motion Picture Arts and Sciences", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Associate", "jobFunction": "Advertising, Marketing, and Public Relations", "industry": "Museums, Historical Sites, and Zoos and Non-profit Organizations", "description": "<strong>Coordinator, Social Media (Seasonal)</strong><br/><br/>The Coordinator, Social Media is a full-time, seasonal position in support of the 97th Oscars season. Reporting to the Director of Social Media, the coordinator will serve as a key figure in the day-to-day support of content development and campaigns across social media, data and analytics, digital partnerships, and digital experiences. The ideal candidate will have a passion for the Oscars, filmmaking, graphic design, copywriting &amp; social/digital media, and analytics.<br/><br/><strong>This position will begin on August 26, 2024, and conclude on or around April 4, 2025.</strong><br/><br/><strong>Duties and Responsibilities:</strong><ul><li>Support the Director and Social Media Managers with graphic design, video editing, copywriting and scheduling across Academy (Oscars), Academy Museum, and Academy Gold social channels.</li><li>Community Management across Academy (Oscars), Academy Museum, and Gold social channels.</li><li>Support updating the social content calendar.</li><li>Live event coverage &amp; digital support at the Oscars and lead up seasonal events including Academy Museum Gala.</li><li>Interface with Digital Marketing team, internal departments and external partners concerning coordination of Oscar and Museum related initiatives.</li><li>Track content from pitch, development, production to post-production.</li><li>Support end-to-end assigned digital projects and campaigns.</li><li>Stay up to date with digital marketing developments and industry trends.</li></ul><br/><br/><strong>Qualifications and Requirements:</strong><ul><li>A bachelor’s degree in marketing, communications, or a related field or equivalent professional experience.</li><li>2-4 years of social media or digital marketing experience.</li><li>Experience working in Social Media Platforms (Facebook, Instagram, LinkedIn, TikTok, Pinterest, YouTube, etc.).</li><li>Adobe Suite, Photoshop, Premiere/Final Cut, InDesign, Canva or other design and video editing skills.</li><li>Competency in online analytics, specifically Google Analytics, Meta Insights, TikTok and Twitter Analytics.</li><li>Excellent time and project management skills, ability to multi-task and meet deadlines in fast-paced digital &amp; live events environment.</li><li>Experience creating reports, manipulating data in Google Workspace.</li><li>Team player with a positive attitude who thrives in both a collaborative &amp; independent work environment.</li></ul><br/><br/><strong>If hired, we require all employees to be vaccinated against COVID-19, unless a medical or religious accommodation is needed as determined on a case-by-case basis. </strong><br/><br/>The expected salary for this role is $23 per hour. The actual base pay offered will be determined by factors such as experience, skills, training, location, certifications, education, and other factors permitted by law. Decisions will be made on a case-by-case basis.", "responsibilities": "Support the Director and Social Media Managers with graphic design, video editing, copywriting and scheduling across Academy (Oscars), Academy Museum, and Academy Gold social channels. Community Management across Academy (Oscars), Academy Museum, and Gold social channels. Support updating the social content calendar. Live event coverage &amp; digital support at the Oscars and lead up seasonal events including Academy Museum Gala. Interface with Digital Marketing team, internal departments and external partners concerning coordination of Oscar and Museum related initiatives. Track content from pitch, development, production to post-production. Support end-to-end assigned digital projects and campaigns. Stay up to date with digital marketing developments and industry trends.", "qualifications": {"required": "A bachelor’s degree in marketing, communications, or a related field or equivalent professional experience. 2-4 years of social media or digital marketing experience. Experience working in Social Media Platforms (Facebook, Instagram, LinkedIn, TikTok, Pinterest, YouTube, etc.). Adobe Suite, Photoshop, Premiere/Final Cut, InDesign, Canva or other design and video editing skills. Competency in online analytics, specifically Google Analytics, Meta Insights, TikTok and Twitter Analytics. Excellent time and project management skills, ability to multi-task and meet deadlines in fast-paced digital &amp; live events environment. Experience creating reports, manipulating data in Google Workspace. Team player with a positive attitude who thrives in both a collaborative &amp; independent work environment."}, "skills": ["Social Media", "Graphic Design", "Video Editing", "Copywriting", "Analytics", "Google Analytics", "Meta Insights", "TikTok Analytics", "Twitter Analytics", "Project Management", "Google Workspace"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986135849"}