{"jobTitle": "Vice President Human Resources", "company": {"name": "SkyBridge Luxury & Associates ", "location": "Orange County, CA", "industry": "Hospitality and Hotels and Motels"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$200,000.00/yr - $210,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitality and Hotels and Motels", "description": "SkyBridge Luxury & Associates is excited to partner with a prestigious boutique hotel company in Orange County, California, to find a dynamic and experienced Vice President of Human Resources to join their executive team.\n<br/>\n<strong>Key Responsibilities:</strong>\n<ul><li>Develop and implement HR strategies aligned with the company’s business goals.</li><li>Oversee recruitment, onboarding, talent development, and succession planning.</li><li>Foster a positive and inclusive workplace culture.</li><li>Manage employee relations, conflict resolution, and recognition programs.</li><li>Design and implement competitive compensation and benefits programs.</li><li>Ensure compliance with employment laws and regulations.</li><li>Provide HR metrics and analysis to the executive team.</li></ul>\n<strong>Qualifications:</strong>\n<ul><li>Proven senior HR leadership experience, preferably in the hospitality industry.</li><li>Strong knowledge of HR best practices, employment laws, and regulations.</li><li>Excellent leadership, communication, and interpersonal skills.</li><li>Strategic thinker with a proactive and innovative approach.</li><li>Bachelor’s degree in HR, Business Administration, or related field; advanced degree or HR certification preferred.</li></ul>\n<strong>Benefits:</strong>\n<ul><li>Competitive salary and performance-based incentives.</li><li>Comprehensive health, dental, and vision insurance.</li><li>Professional development and career growth opportunities.</li></ul><p></p>", "responsibilities": "Develop and implement HR strategies aligned with the company’s business goals. Oversee recruitment, onboarding, talent development, and succession planning. Foster a positive and inclusive workplace culture. Manage employee relations, conflict resolution, and recognition programs. Design and implement competitive compensation and benefits programs. Ensure compliance with employment laws and regulations. Provide HR metrics and analysis to the executive team.", "qualifications": {"required": "Proven senior HR leadership experience, preferably in the hospitality industry. Strong knowledge of HR best practices, employment laws, and regulations. Excellent leadership, communication, and interpersonal skills. Strategic thinker with a proactive and innovative approach.", "preferred": "Bachelor’s degree in HR, Business Administration, or related field; advanced degree or HR certification preferred."}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Competitive salary and performance-based incentives. Comprehensive health, dental, and vision insurance. Professional development and career growth opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986142298"}