{"jobTitle": "Operations Manager", "company": {"name": "SSG Project 180", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "Title: Operations Manager Division: Project 180<br/><br/>FLSA: Exempt Supervisor: Sr. Director, Operations<br/><br/>Pay Range: $90,000 - $110,000 Revised Date: 7/30/2024<br/><br/>The Organization<br/><br/>SSG-Project 180 turns lives around through innovative, wraparound services that keep people out of institutions and in their communities. Project 180 is a leader in the forensic treatment space, offering high-quality, specialized treatment programs that serve thousands of justice-involved individuals. Our programs span criminal justice intercepts and include pre-arrest interventions, court-based diversions, jail in-reach, and intensive post-release services. Project 180 operates in partnership with County agencies including the Department of Mental Health (DMH), the Department of Health Services (DHS), and the Justice, Care and Opportunities Department (JCOD). Annually, we serve over justice-involved 1,500 individuals.<br/><br/>The Position<br/><br/>In this fast-paced and impactful role, the Operations Manager will be responsible for helping to build operational processes and procedures that span Project 180’s programs. This position has diversified responsibilities from creating operating plans, leading teams, and helping to manage our facilities.<br/><br/>This position reports to the P180 Senior Director of Operations and works closely with individuals at all levels of the organization, outside consultants, and vendors. The Operations Manager will supervise the office managers, operations associate, and security manager.<br/><br/>Essential Functions:<br/><br/>Develop and implement operational strategy and goals:<br/><br/><ul><li>Drive operational excellence in the organization by identifying and executing processes that create efficiency and remove agency-wide obstacles</li><li>Develop, track, and improve operational metrics</li><li>Communicate regularly with Project 180’s Senior Director of Operations to report progress, escalate issues or concerns, and ensure ongoing strategic alignment</li><li>Partner with Housing teams to manage systems for supply procurement, repairs, and other facilities needs</li><li>Create and manage a work order system to prioritize, assign, and track requests from clients and staff</li><li>Prepare and submit regular reports on facility conditions and maintenance activities</li><li>Visit housing sites and offices on a regular basis</li><li>Oversee the procurement, maintenance, and management of a fleet of vehicles used for programs<br/><br/></li></ul>Manage operations and security teams:<br/><br/><ul><li>Oversee the operations and security teams</li><li>Supervise staff to meet performance expectations. Provide regular coaching and feedback, conduct annual performance reviews, and implement disciplinary actions as needed</li><li>Perform administrative managerial duties and disciplinary actions as needed<br/><br/></li></ul>Fulfill baseline Project 180 staff expectations<br/><br/><ul><li>Regular attendance required. Holiday or weekend work may be required</li><li>Maintain and uphold Agency mission statement, values, policies, procedures, and principles</li><li>Perform other duties as needed<br/><br/></li></ul><strong>Skills And Abilities<br/><br/></strong><ul><li>Excellent communication and relationship-building skills</li><li>Proactive, takes initiative to solve problems</li><li>Flexible and adaptive when things change</li><li>Detail-oriented and organized</li><li>Comfortable having difficult conversations</li><li>Data-oriented and comfortable with technology (Microsoft Office Suite)<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Required:</li><ul><li>Bachelor’s degree</li><li>Minimum 5 years of experience in operations and strategy, project or program management, or a related field</li><li>Experience with Microsoft and Google Suites, advanced skills in Excel</li><li>Experience managing staff and contractors</li><li>Experience working with and analyzing data, and managing multiple projects</li><li>Excellent communication, interpersonal, and problem-solving skills</li><li>Ability to prioritize multiple tasks and work effectively in a fast-paced environment</li><li>Valid CA driver’s license, proof of insurance and own vehicle required</li></ul><li>Preferred:</li><ul><li>MBA</li></ul><li>Experience working with culturally diverse populations</li><li>Verification of Employment Eligibility and Background Check<br/><br/></li></ul>Supervisory Responsibilities<br/><br/>Senior Operations Manager will directly manage the security manager and operations team.<br/><br/>Environmental Conditions (Working Conditions)<br/><br/>The Senior Operations Manager will be based in the Project 180 headquarters in downtown Los Angeles and will need to perform job duties in office and field settings, including Project 180’s housing sites.<br/><br/>Physical Requirements<br/><br/>The employee is expected to drive, carry a maximum of 20 lbs, listen, and speak in order to complete job requirements.<br/><br/>Mental Requirements<br/><br/>The employee must be able to do any/all of the following: perform complex and varied tasks such as synthesizing information and making decisions without immediate supervision; handle routine distractions, interact professionally and diplomatically in high-stress situations; create and follow plans; meet deadlines.<br/><br/>Powered by JazzHR<br/><br/>ineS3eys5F", "responsibilities": "Develop and implement operational strategy and goals:<br/><br/><ul><li>Drive operational excellence in the organization by identifying and executing processes that create efficiency and remove agency-wide obstacles</li><li>Develop, track, and improve operational metrics</li><li>Communicate regularly with Project 180’s Senior Director of Operations to report progress, escalate issues or concerns, and ensure ongoing strategic alignment</li><li>Partner with Housing teams to manage systems for supply procurement, repairs, and other facilities needs</li><li>Create and manage a work order system to prioritize, assign, and track requests from clients and staff</li><li>Prepare and submit regular reports on facility conditions and maintenance activities</li><li>Visit housing sites and offices on a regular basis</li><li>Oversee the procurement, maintenance, and management of a fleet of vehicles used for programs<br/><br/></li></ul>Manage operations and security teams:<br/><br/><ul><li>Oversee the operations and security teams</li><li>Supervise staff to meet performance expectations. Provide regular coaching and feedback, conduct annual performance reviews, and implement disciplinary actions as needed</li><li>Perform administrative managerial duties and disciplinary actions as needed<br/><br/></li></ul>Fulfill baseline Project 180 staff expectations<br/><br/><ul><li>Regular attendance required. Holiday or weekend work may be required</li><li>Maintain and uphold Agency mission statement, values, policies, procedures, and principles</li><li>Perform other duties as needed<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree, Minimum 5 years of experience in operations and strategy, project or program management, or a related field, Experience with Microsoft and Google Suites, advanced skills in Excel, Experience managing staff and contractors, Experience working with and analyzing data, and managing multiple projects, Excellent communication, interpersonal, and problem-solving skills, Ability to prioritize multiple tasks and work effectively in a fast-paced environment, Valid CA driver’s license, proof of insurance and own vehicle required", "preferred": "MBA, Experience working with culturally diverse populations, Verification of Employment Eligibility and Background Check"}, "skills": ["Communication", "Relationship Building", "Problem Solving", "Microsoft Office Suite", "Excel", "Data Analysis", "Project Management", "Operations Management", "Strategic Planning"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986759267"}