{"jobTitle": "Social Media and Influencer Associate (External Agency Staff)", "company": {"name": "National Football League (NFL)", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "30.00—40.00 USD", "currency": "USD"}, "jobFunction": "Other", "industry": "Spectator Sports", "description": "<strong>Summary<br/><br/></strong>JOB DESCRIPTION<br/><br/>The NFL is now hiring a Social Media and Influencer Associate to become a key contributor within a world-class team responsible for several key areas.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Coordinate logistics and spearhead outreach to relevant partners across workstreams</li><li>Work cross-functionally on new business opportunities which will enable and deepen fan engagement globally </li><li>Collaborate with NFL teammates in Marketing, Social, Influencer, and Creative to develop new marketing opportunities at league owned tentpoles including international games </li><li>Support Social Strategy and Emerging Platforms team needs on day-to-day management of projects, campaigns, reporting, and platform innovations</li><li>Organize and manage team timelines across relevant projects</li><li>Innovate and co-create new content opportunities across emerging social platforms which do not currently have any or limited NFL presence </li><li>Stay immersed in social media, technology, and pop culture to identify areas of growth across the NFL social landscape</li><li>Partner with Sr. Director of Social Strategy &amp; Emerging Platforms to build out new monetizable social content </li><li>Work directly with the Sr. Director, Social Strategy and Emerging Platforms to execute innovative and “first-ever” work across the NFL Calendar</li><li>Support global efforts across league social channels / platforms and agencies<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>4+ years of experience in social media / digital marketing.</li><li>Ability to handle multiple projects in a fast-paced environment.</li><li>Excellent organization and communication skills, along with strong time management abilities.</li><li>Proficient in MS office products such as: Outlook, Excel, Word, PowerPoint.</li><li>Proven understanding of social media landscape<br/><br/></li></ul><strong>Travel<br/><br/></strong><ul><li>25%<br/><br/></li></ul><strong>Terms / Expected Hours of Work<br/><br/></strong><ul><li>FSLA Non-Exempt </li><li>This job posting is for a position with one of the NFL’s third-party agency partners that provides services to the NFL. The individual selected for this role will be an employee of that third-party agency and not the NFL. All compensation, benefits, and other terms and conditions of employment are handled by the agency. The assignment to provide services to the NFL will be limited in duration but may be extended for an additional period by agreement between the NFL and the agency.<br/><br/></li></ul><strong>Salary / Pay Range<br/><br/></strong>This job posting contains a pay range, which represents the range of salaries or hourly rates that the NFL believes, in good faith, at the time of this posting that it might be willing to pay for the posted job in the location(s) specified. The NFL expects to hire for this position near the middle of the range. Only in truly rare and exceptional circumstances, where an external candidate has experience, credentials or expertise that far exceed those required or expected for the position, would the NFL consider paying a salary or rate near the higher end of the range.<br/><br/>Salary<br/><br/>$30—$40 USD<br/><br/><em>The NFL maintains a Flexible Workplace Policy that provides members of our workforce with opportunities to periodically work from a location of their choice while maintaining a priority on in-person work at an NFL office, which enables us to more effectively collaborate, connect, and build a workplace culture that will drive our continued success. <br/><br/></em><em>The NFL is committed to building a diverse, equitable, and inclusive work environment that reflects our incredibly diverse fan base. We provide an environment of mutual respect where equal employment opportunities are available to all employees and applicants without regard to status as protected by applicable federal, state, or local law.</em>", "responsibilities": "<ul><li>Coordinate logistics and spearhead outreach to relevant partners across workstreams</li><li>Work cross-functionally on new business opportunities which will enable and deepen fan engagement globally </li><li>Collaborate with NFL teammates in Marketing, Social, Influencer, and Creative to develop new marketing opportunities at league owned tentpoles including international games </li><li>Support Social Strategy and Emerging Platforms team needs on day-to-day management of projects, campaigns, reporting, and platform innovations</li><li>Organize and manage team timelines across relevant projects</li><li>Innovate and co-create new content opportunities across emerging social platforms which do not currently have any or limited NFL presence </li><li>Stay immersed in social media, technology, and pop culture to identify areas of growth across the NFL social landscape</li><li>Partner with Sr. Director of Social Strategy &amp; Emerging Platforms to build out new monetizable social content </li><li>Work directly with the Sr. Director, Social Strategy and Emerging Platforms to execute innovative and “first-ever” work across the NFL Calendar</li><li>Support global efforts across league social channels / platforms and agencies<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>4+ years of experience in social media / digital marketing.</li><li>Ability to handle multiple projects in a fast-paced environment.</li><li>Excellent organization and communication skills, along with strong time management abilities.</li><li>Proficient in MS office products such as: Outlook, Excel, Word, PowerPoint.</li><li>Proven understanding of social media landscape<br/><br/></li></ul>", "preferred": ""}, "skills": ["Social Media", "Digital Marketing", "Marketing", "Social", "Influencer", "Creative", "Social Strategy", "Emerging Platforms", "MS Office", "Excel", "Word", "PowerPoint"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986249470"}