{"jobTitle": "Public Relations Manager", "company": {"name": "33 USA Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Position Summary<br/><br/></strong>The Public Relations Manager oversees the planning, development, and execution of promotional/ publicity campaigns and event supportn for entertainment productions. Additionally, the role involves managing budgets for campaigns, as well as negotiating pricing and contract terms with media agencies and construction companys. The role is responsible for team leadership and reporting, coaching team members as necessary to achieve personal and professional growth and managing the Public Relations division, tracking performance and identifying areas for improvement. The role is responsible for Public Relations Division's total KPI and reports to the CEO.<br/><br/><strong>Requirements<br/><br/></strong><strong>Essential Job Functions &amp; Responsibilities:<br/><br/></strong><strong>Management:<br/><br/></strong><ul><li> Lead the Public Relations Division, collaborating with team members on day-to-day operations and coaching as necessary</li><li> Manage key performance indicators (KPIs) of the division / team members, coaching and following up to confirm progress against these measurements</li><li> Foster a positive team culture, ensuring that team members are engaged, motivated, and aligned with the company's values and objectives<br/><br/><br/></li></ul><strong>Strategy &amp; Campaign Planning:<br/><br/></strong><ul><li> Collaborate internally and externally to create effective, result-driven publicity strategies for entertainment productions</li><li> Plan and execute publicity campaigns, involving all stakeholders as necessary to ensure campaigns are successful and meet client goals</li><li> Plan and execute event/convention planning on behalf of clients and client's production<br/><br/><br/></li></ul><strong>Submission Plan Development &amp; Implementation:<br/><br/></strong><ul><li> Develop submission plans for publicity campaigns and implement them</li><li> Understand and execute social publicity tactics on behalf of clients</li><li> Identify media influencers to use on behalf of clients</li><li> Ensure submission plans are executed efficiently and effectively<br/><br/><br/></li></ul><strong>Content Development:<br/><br/></strong><ul><li> Writing compelling press materials, pitch letters, and promotional copy</li><li> Responsible for writing press releases and pitches<br/><br/><br/></li></ul><strong>Analysis:<br/><br/></strong><ul><li> Pitch and secure media results for clients on a daily basis- Present reports to clients and communicate results in a clear and effective manner<br/><br/><br/></li></ul><strong>Education and Experience Requirements:<br/><br/></strong><strong>Required:<br/><br/></strong><ul><li> Bachelor's degree in PR, Marketing, Communications, or related field</li><li> At least 5 years of project management experience, in-house or with an agency- 4-5 years of experience supervising a team at a Japanese entertainment related company</li><li> Excellent written and verbal communication skills in English and Japanese</li><li> Likes and is familiar with Japanese Anime/Manga- Computer Proficiency: Office, PowerPoint, Outlook and Internet<br/><br/><br/></li></ul><strong>Preferred:<br/><br/></strong><ul><li> Strong Supervisory and Management Skills</li><li> Highly organized with strong time- and resource management skills</li><li> Ability to effectively and independently respond to pressure or emergencies in a professional manner, taking initiative to solve issues</li><li> Flexible, creative, and accustomed to working in teams or independently as necessary</li><li> Ability to speak and read Japanese<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>A number of programs cover all employees in the manner prescribed by law. Additionally, 33 USA Inc. provides several Company-designated benefit programs.<br/><br/><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li><li>Family Leave (Maternity, Paternity)</li><li>Work From Home</li></ul>", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3986949757"}