{"jobTitle": "Remote Data Analyst/ Scientist / Business Analyst/  Database Administrator (Entry/Junior Level)", "company": {"name": "SynergisticIT", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Biotechnology Research, IT Services and IT Consulting, and Accounting", "description": "For more than 12 years Synergisticit has helped Jobseekers stand out from other Jobseekers by providing candidates the requisite skills, experience, and technical competence to outperform at interviews and at clients. Here at SynergisticIT We just don't focus on getting you a tech Job we make careers.<br/><br/>In this market also our candidates get multiple job offers and $100k + salaries.<br/><br/>Please check the links below to see the success outcomes of our candidates.<br/><br/>(url removed)<br/><br/>We regularly interact with the Top Tech companies to give our candidates a competitive advantage see us exhibiting at Oracle Cloud World/Oracle Java One (Las Vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023<br/><br/>All Positions are open for all visas and US citizens<br/><br/>We at Synergistic understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like Apple, google, Paypal, Western Union, Client, visa, Walmart labs etc to name a few.<br/><br/>Currently, We are looking for entry-level software programmers, Java full-stack developers, Python/Java developers, Data analysts/ Data Scientists, and Machine Learning engineers for full-time positions with clients.<br/><br/>Who Should Apply Recent Computer Science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry?<br/><br/>We assist in filing for STEM extension and also for H1b and Green card filing to Candidates<br/><br/>We want Data Science/Machine learning/Data Analyst and Java stack candidates<br/><br/>For data Science/Machine learning Positions<br/><br/><strong>Required Skills<br/><br/></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br/><br/>Project work on the technologies needed<br/><br/>Highly motivated, self-learner, and technically inquisitive<br/><br/>Experience in programming language Java and understanding of the software development life cycle<br/><br/>Knowledge of Statistics, SAS, Python, Computer Vision, and data visualization tools<br/><br/>Excellent written and verbal communication skills<br/><br/>Preferred skills: NLP, Text mining, Tableau, PowerBI, Databricks, Tensorflow<br/><br/><strong>REQUIRED SKILLS For Java /Full Stack/Software Positions<br/><br/></strong>Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT<br/><br/>Highly motivated, self-learner, and technically inquisitive<br/><br/>Experience in programming language Java and understanding of the software development life cycle<br/><br/>Project work on the skills<br/><br/>Knowledge of Core Java , javascript, C++, or software programming<br/><br/>Spring boot, Microservices, Docker, Jenkins, and REST API experience<br/><br/>Excellent written and verbal communication skills<br/><br/>If you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team and only connect with candidates who are matching client requirements.<br/><br/>No phone calls, please. Shortlisted candidates would be reached out. No third-party or agency candidates or c2c candidates", "skills": ["Java", "Python", "Data Visualization", "Statistics", "SAS", "Computer Vision", "NLP", "Text Mining", "Tableau", "PowerBI", "Databricks", "Tensorflow", "Core Java", "Javascript", "C++", "Spring Boot", "Microservices", "Docker", "Jenkins", "REST API"], "postedDate": "3 weeks ago", "url": "https://www.linkedin.com/jobs/view/3986215080"}