{"jobTitle": "Nursing Manager", "company": {"name": "Prime Healthcare", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "108,388.80/yr - 164,174.40/yr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Wellness and Fitness Services, Medical Practices, and Hospitals and Health Care", "description": "<strong><em>Centinela Hospital Medical Center</em></strong><em> has been serving the communities of Inglewood and the wider Los Angeles area for nearly 100 years. An award-winning facility, ranking in the top 5% nationally for quality and patient safety, Centinela Hospital is a 362-bed acute-care hospital with a 24-hour emergency department and primary stroke center, orthopedic care, advanced cardiac services, critical care services, robotics surgery program, inpatient and outpatient rehab programs, labor and delivery, and more. </em></p><p><strong>Join an award-winning team of dedicated professionals</strong> committed to our core values of <strong>quality</strong>, <strong>compassion</strong> and <strong>community</strong>!</p><p><strong>Why Prime Healthcare? Centinela Hospital Medical Center;</strong> a member of Prime Healthcare, offers <strong>incredible opportunities to expand your horizons</strong> and be part of a community dedicated to making a difference.</p><p> <strong>Our Total Rewards package includes, but is not limited to:</strong></p><ul><li>Paid Time Off</li><li>401K retirement plan</li><li>Outstanding Medical</li><li>Dental</li><li>Vision Coverage</li><li>Tuition Reimbursement</li><li>Many more Voluntary Benefit Options!</li></ul><p>Benefits may vary based on collective bargaining agreement requirements and/or the employment status, i.e. full-time or part-time.</p><p>We are an Equal Opportunity Employer and do not discriminate against applicants due to veteran status, disability, race, gender, gender identity, sexual orientation, or other protected characteristics. If you need special accommodation for the application process, please contact Human Resources. Know Your Rights: https://www.eeoc.gov/sites/default/files/2022-10/EEOC_KnowYourRights_screen_reader_10_20.pdf</p><p><em>Privacy Notice for California Applicants: </em>https://www.primehealthcare.com/wp-content/uploads/2024/04/Notice-at-Collection-and-Privacy-Policy-for-California-Job-Applicants.pdf</p><p><strong>Manager of Emergency Department is responsible for the day to day management and coordination of all activities in the Emergency Department.</strong></p><ul><li>Supervises and monitors performance of the Emergency Department staff.</li><li>Interacts with the physicians, hospital staff, outside agencies, patients and patients families/significant other(s) to provide comprehensive care.</li></ul><p><strong>Education and Work Experience</strong></p><ol><li>Must have a current and valid state license as a Registered Nurse.</li><li>BLS (AHA) upon hire and maintain current.</li><li>A minimum of two years supervisory/management experience necessary.</li><li>Certified Emergency Nurse (CEN) preferred.</li><li>PALS upon hire and maintain current.</li><li>Advanced Cardiac Life Support (ACLS) (AHA) upon hire and maintain current.</li><li>Minimum of three years of continuous clinical experience in a clinical/acute care setting.</li><li>Bachelors of Science in Nursing (BSN) preferred.</li></ol><p> </p><p>Centinela Hospital Medical Center offers competitive compensation and a comprehensive benefits package that provides employees the flexibility to tailor benefits according to their individual needs. Our Total Rewards package includes, but is not limited to, paid time off, a 401K retirement plan, medical, dental, and vision coverage, tuition reimbursement, and many more voluntary benefit options. Benefits may vary based on employment status, i.e. full-time, part-time, per diem or temporary. A reasonable compensation estimate for this role, which includes estimated wages, benefits, and other forms of compensation, is $108,388.80 to $164,174.40 on an annualized basis. The exact starting compensation to be offered will be determined at the time of selecting an applicant for hire, in which a wide range of factors will be considered, including but not limited to, skillset, years of applicable experience, education, credentials and licensure.", "responsibilities": "Manager of Emergency Department is responsible for the day to day management and coordination of all activities in the Emergency Department.\n\n*   Supervises and monitors performance of the Emergency Department staff.\n*   Interacts with the physicians, hospital staff, outside agencies, patients and patients families/significant other(s) to provide comprehensive care.", "qualifications": {"required": "Must have a current and valid state license as a Registered Nurse.\nBLS (AHA) upon hire and maintain current.\nA minimum of two years supervisory/management experience necessary.\nMinimum of three years of continuous clinical experience in a clinical/acute care setting.", "preferred": "Certified Emergency Nurse (CEN)\nPALS upon hire and maintain current.\nAdvanced Cardiac Life Support (ACLS) (AHA) upon hire and maintain current.\nBachelors of Science in Nursing (BSN)"}, "skills": ["Registered Nurse", "BLS", "Supervisory", "Management", "CEN", "PALS", "ACLS", "Clinical Experience"], "postedDate": "3 weeks ago", "benefits": "Paid Time Off, 401K retirement plan, Outstanding Medical, Dental, Vision Coverage, Tuition Reimbursement, Many more Voluntary Benefit Options!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986715815"}