{"jobTitle": "JD Logistics - Warehouse Associate Lead - Inbound/Outbound/Inventory", "company": {"name": "JD.COM", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Location:</strong> City of Industry, CA<br/><br/><strong>Job Type:</strong> Full-time<br/><br/><strong>Job Description<br/><br/></strong><strong>Responsibilities:<br/><br/></strong><ul><li>Under the supervision of the department head, responsible for the overall daily work arrangements for shipping, and reasonable deployment of shipping personnel.</li><li>Responsible for formulating, revising and perfecting shipping workflow to make the daily work of the warehouse faster and more organized.</li><li>Responsible for the training of shipping personnel, continuously improve the operating standards of shipping personnel, and improve the overall service quality.</li><li>Supervise assigned shipping employees to ensure 100% timely delivery based on the requirement of each order, and zero errors or omissions. Evaluate the performance of each member.</li><li>Responsible for coordination and cooperation with other working groups.</li><li>Communicate company policies and updates to shipping employees.</li><li>Ensure the compliance of the team according to the requirements of the company's information management system.</li><li>Other tasks assigned by the supervisor/manager.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>College degree or above, proficient in the use of office software, familiar with WMS system is preferred;</li><li>More than 2 years of warehouse work experience, familiar with the working procedures of each link of warehouse receiving, location storage, and delivery arrangements;</li><li>Strong execution ability and certain team management experience;</li><li>Rigorous work attitude, serious and responsible work.<br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology.<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots.<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3986053397"}