{"jobTitle": "Tops Buyer", "company": {"name": "Windsor Fashions", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $115,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "The role of the Tops Buyer at Windsor is a dynamic one that encompasses a variety of responsibilities ranging from selecting product line and carrying out product development to planning and purchasing for both eCommerce and Brick & Mortar stores across the country. This will require an entrepreneurial mindset where you will work across all departments to create a shared vision to make this happen. The position requires a passion for fashion, a team player attitude, a desire to learn and a drive to meet company goals. Like any member of the family, the Buyer is expected to represent Windsor and its mission statement with integrity.", "responsibilities": "Understands sales and can speak to what is driving business by department/class/sub-class and attributeExecutes and completes eCom recaps each weekImproves style depths to maximize sales and improve total unit sales as to increase revenueProposes exit strategy for slow moving styles and/or problem classesMake fiscal decisions with open to buy to maintain sales contribution by department/class and attributeMaintains month and season end notes to improve business the next yearUncover missed opportunities through analysis of reports to monetize next season or the following yearWork with Allocation and Retail teams to ensure eCom selling is not interrupted on best sellersExtremely good organization and prioritizing of 20+ classesElicits critical information from vendors in regard to market trends and current buying activity of competitors and presents findings effectivelyCollect styles for eCom only buys as well as assign quantities to eCom for Store buysTrouble shoot issues with vendors and negotiate accordingly, as well as negotiating on new product and reordersWrites and sends orders as necessaryMaintain relationships with eCom executives and merchandising partners to reach plan topline salesShare merchandising vision with marketing, social media and studio teams to deliver aligned message to the customerPresent Ecom assortment at on order meetingsAttend marketing meetings to collaborate on Email and Homepage storiesShops competitive websites to identify opportunities and trends", "qualifications": {"required": "Must have 3-5 years of fast fashion and eCommerce experience in the tops category.Strong understanding of retail KPI's (GM %/$, sell through, WOH, MD, IMU and AUR)Strong Vendor relations and negotiatingAbility to plan, prepare and execute strategic business plansAbility to communicate and collaborate effectively with all levels of managementMust possess strong organizational and time management skills, with strong attention to detail and ability to prioritize multiple projects and priorities.Highly organized with an ability to adapt to quickly changing priorities and initiativesDemonstrated ability to predict and maximize trends.Must be current with influencer fashion and fast fashion trends both online and brick and mortar.", "preferred": ""}, "skills": ["eCommerce", "Retail", "Fashion", "Sales", "Merchandising", "Vendor Relations", "Negotiation", "Business Planning", "Communication", "Teamwork", "Time Management", "Organization", "Trend Analysis"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3986121993"}