{"jobTitle": "Director of Compliance", "company": {"name": "Larson Maddox", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$100,000.00/yr - $180,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Legal Services", "description": "We are currently partnered with a SEC-registered investment adviser specializing in event-driven, long/short equity strategies based in Los Angeles, CA looking to add a Compliance Director to their team.\n<br/>\n<strong>Compliance Director Role Responsibilities:</strong>\n<ul><li>Manage compliance calendar and regulatory reports (e.g., Section 13 filings, Form ADV, Form PF).</li><li>Test and document compliance policies and procedures.</li><li>Monitor electronic communications for compliance risks.</li><li>Maintain Restricted List and conduct trade surveillance.</li><li>Review marketing materials for proper disclosures.</li><li>Administer Code of Ethics and monitor compliance reporting and pre-clearance requests.</li><li>Update policies, procedures, and training materials.</li><li>Draft compliance communications and assist with training.</li><li>Collaborate with senior management on compliance projects.</li></ul><br/>\n<strong>Compliance Director Associate Qualifications:</strong>\n<ul><li>Bachelor's degree required.</li><li>5 + years of compliance experience, preferably with an RIA or compliance consulting firm.</li><li>Knowledge of the Investment Advisers Act of 1940 and relevant regulations.</li><li>Strong written and verbal communication skills, attention to detail, and organizational skills.</li></ul><br/>\n<strong>Location and Compensation:</strong>\n<ul><li>Based in the Greater Los Angeles area</li><li>Competitive salary (based on experience) and annual bonus.</li><li>Employer-paid healthcare, 401(k) matching, and gym membership.</li></ul><p></p>", "responsibilities": "Manage compliance calendar and regulatory reports (e.g., Section 13 filings, Form ADV, Form PF). Test and document compliance policies and procedures. Monitor electronic communications for compliance risks. Maintain Restricted List and conduct trade surveillance. Review marketing materials for proper disclosures. Administer Code of Ethics and monitor compliance reporting and pre-clearance requests. Update policies, procedures, and training materials. Draft compliance communications and assist with training. Collaborate with senior management on compliance projects.", "qualifications": {"required": "Bachelor's degree required. 5 + years of compliance experience, preferably with an RIA or compliance consulting firm. Knowledge of the Investment Advisers Act of 1940 and relevant regulations. Strong written and verbal communication skills, attention to detail, and organizational skills."}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Competitive salary (based on experience) and annual bonus. Employer-paid healthcare, 401(k) matching, and gym membership.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3986131016"}