{"jobTitle": "HR Assistant", "company": {"name": "Ultimate Staffing", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Office Administration", "description": "<strong>Key Responsibilities:</strong><ul><li>Assist in the recruitment process, including job postings, resume screening, and scheduling interviews.</li><li>Maintain employee records.</li><li>Assist with onboarding new hires and conducting orientation sessions.</li><li>Handle employee inquiries regarding HR policies, procedures, and programs.</li><li>Support the implementation and maintenance of HR programs and initiatives.</li><li>Prepare HR-related reports as needed.</li><li>Assist with payroll processing and benefits administration.</li><li>Coordinate training sessions and seminars.</li><li>Provide administrative support to the HR team, including scheduling meetings and maintaining calendars.</li></ul><p><strong>Qualifications:</strong></p><ul><li>Bachelor's degree in Human Resources, Business Administration, or a related field preferred.</li><li>Proven experience as an HR Assistant, HR Coordinator, or similar role.</li><li>Familiarity with HR software and Microsoft Office Suite.</li><li>Excellent organizational and time-management skills.</li><li>Strong communication and interpersonal abilities.</li><li>Ability to handle sensitive and confidential information with discretion.</li><li>Detail-oriented and able to prioritize tasks effectively.<br/></li></ul><p><em>All qualified applicants will receive consideration for employment without regard to</em> <em>race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status.</em> <em>We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.</em></p>", "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "responsibilities": "Assist in the recruitment process, including job postings, resume screening, and scheduling interviews. Maintain employee records. Assist with onboarding new hires and conducting orientation sessions. Handle employee inquiries regarding HR policies, procedures, and programs. Support the implementation and maintenance of HR programs and initiatives. Prepare HR-related reports as needed. Assist with payroll processing and benefits administration. Coordinate training sessions and seminars. Provide administrative support to the HR team, including scheduling meetings and maintaining calendars.", "qualifications": {"required": "Proven experience as an HR Assistant, HR Coordinator, or similar role. Familiarity with HR software and Microsoft Office Suite. Excellent organizational and time-management skills. Strong communication and interpersonal abilities. Ability to handle sensitive and confidential information with discretion. Detail-oriented and able to prioritize tasks effectively.", "preferred": "Bachelor's degree in Human Resources, Business Administration, or a related field preferred."}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3986142710"}