{"jobTitle": "JD Logistics - Warehouse Manager", "company": {"name": "JD.COM", "location": "Fontana, CA"}, "location": "Fontana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>Location:</strong> City of Industry, CA/Fontana, CA<br/><br/><strong>Job Type:</strong> Full-time<br/><br/><strong>Job Description<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li>Participate in warehousing design, establish and implement warehouse management procedures, quality control processes and various indicator systems, be responsible for the KPI of warehouse operations;</li><li>Implement and improve the warehouse's rules and regulations, standardize operating standards and processes, allocate human resources reasonably, and monitor each job on the warehouse site; improve work efficiency, plan budgets, and reduce costs;</li><li>Supervise and manage the receipt and delivery of commodity vehicles in the warehouse, inventory, process quality, safety and other management affairs. Control the overall error rate of the warehouse, and ensure that the operational status of warehousing business meet company requirements;</li><li>Familiar with the project process, monitor and analyze data, and ensure the efficient operation of the system in the warehouse through data management;</li><li>Effectively handle customers' complaints, provide feedback, visit customers and perform service communication;</li><li>Establish a timely and effective reporting procedure, submit weekly and monthly reports of various warehouse management reports, and conduct other operational analysis.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's Degree or above;</li><li>More than 5 years experience in logistics or warehouse management;</li><li>Experience in warehouse planning;</li><li>Deep understanding of the industry and have resources of logistics service providers;</li><li>Excellent leadership, influencing, organization, communication, interpersonal and teamwork skills;</li><li>Fluent in English and Mandarin.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Experience working in a fast-paced environment with multiple priorities and tight deadlines.<br/><br/></li></ul><strong>About JD.com<br/><br/></strong>JD.com is China's largest online retailer and its biggest overall retailer, as well as the country's biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. As a technology-driven company, JD.com builds reliable and scalable platforms that bring value to partners and customers in sectors such as e-commerce, logistics, Internet finance, cloud computing and smart technology. For more information, visit https://corporate.jd.com/home<br/><br/><strong>About JD Logistics<br/><br/></strong>JD Logistics, a business group under JD.com, which leverages the company's advanced technology and logistics expertise to provide smart supply chain and logistics services to businesses across a wide range of industries. JD.com has one of the largest fulfillment infrastructure of any e-commerce company in the world. JD.com is the only e-commerce platform in the world to provide small-to-medium sized warehousing, oversized warehousing, cross border, cold chain delivery, frozen and chilled warehousing facilities, B2B and crowdsourcing logistics. We believe technology innovation can drive smart logistics. JD built the world's first fully-automated warehouse in Shanghai, and we are currently developing our own drones delivery and automatic delivery robots. For more information, visit http://www.jdworldwide.com/<br/><br/><em>JD.com is an Equal Opportunity Employer. We do not discriminate in our employment decisions on the basis of race, sex, sexual orientation, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law.</em>", "responsibilities": "<ul><li>Participate in warehousing design, establish and implement warehouse management procedures, quality control processes and various indicator systems, be responsible for the KPI of warehouse operations;</li><li>Implement and improve the warehouse's rules and regulations, standardize operating standards and processes, allocate human resources reasonably, and monitor each job on the warehouse site; improve work efficiency, plan budgets, and reduce costs;</li><li>Supervise and manage the receipt and delivery of commodity vehicles in the warehouse, inventory, process quality, safety and other management affairs. Control the overall error rate of the warehouse, and ensure that the operational status of warehousing business meet company requirements;</li><li>Familiar with the project process, monitor and analyze data, and ensure the efficient operation of the system in the warehouse through data management;</li><li>Effectively handle customers' complaints, provide feedback, visit customers and perform service communication;</li><li>Establish a timely and effective reporting procedure, submit weekly and monthly reports of various warehouse management reports, and conduct other operational analysis.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor's Degree or above;</li><li>More than 5 years experience in logistics or warehouse management;</li><li>Experience in warehouse planning;</li><li>Deep understanding of the industry and have resources of logistics service providers;</li><li>Excellent leadership, influencing, organization, communication, interpersonal and teamwork skills;</li><li>Fluent in English and Mandarin.<br/><br/></li></ul>", "preferred": "<ul><li>Experience working in a fast-paced environment with multiple priorities and tight deadlines.<br/><br/></li></ul>"}, "skills": [], "postedDate": "3 weeks ago", "url": "https://www.linkedin.com/jobs/view/3986056166"}