{"jobTitle": "JDL - 3PL Business Development Manager", "company": {"name": "JD.COM", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "JD Logistics US is looking for a 3PL Business Development Manager, you will play a pivotal leadership role in our business development team. You will lead a team of dedicated Business Development professionals and collaborate closely with them to expand our network of partnerships and drive business growth. Your primary responsibility will be to establish, nurture, and enhance relationships with external companies and businesses that can refer our 3PL services. Through strategic planning and innovative solutions, you will be instrumental in acquiring new customers by leveraging these partner relationships and channels.", "responsibilities": "Leadership and Team Management: Lead, mentor, and manage the Business Development team, fostering a collaborative and results-driven environment. Set clear goals and performance targets for team members, conducting regular performance evaluations and providing constructive feedback. Develop training programs and initiatives to enhance the team's skills and capabilities. Partnership Cultivation and Management: Identify potential partner companies and businesses that align with our target market and objectives. Initiate and nurture relationships with key stakeholders in partner organizations, fostering trust and collaboration. Collaborate with partners to develop joint value propositions and marketing strategies that promote our 3PL services. Strategy Development: Formulate comprehensive business development strategies that capitalize on partner relationships and channels to drive customer acquisition. Analyze market trends, competitor activities, and industry developments to identify opportunities and adjust strategies accordingly. Solution Development: Work cross-functionally with internal teams (operations, marketing, sales) to develop tailored solutions that address customer needs and challenges. Design innovative approaches to enhance our service offerings and align them with partner capabilities. Performance Tracking and Reporting: Monitor and analyze the effectiveness of partner-driven customer acquisition strategies, regularly assessing progress against targets. Generate detailed reports and present findings to senior management, offering insights and recommendations for continuous improvement.", "qualifications": {"required": "Master's degree or equivalent experience in marketing, supply chain management, logistics or relevant fields. MBA is preferred. 3+ years of business development, sales or 3PL/4PL supply chain/logistics working experience. Proficiency in MS Office and CRM software (e.g. Salesforce). Independent self-starter with a strong desire to consistently advance the goals of the organization. Experience drafting and negotiating complex agreements. Ability to work effectively with cross-functional teams. Ability to perform in a fast-paced environment with competing priorities under tight deadlines. Fluency in both English and Mandarin.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "The salary rate for this position ranges from: $80,000 - $125,000 per year Schedule: Free comprehensive health insurance package, including medical, dental, and vision. Free meals or equivalent meal allowance. Free office snacks and beverages. 401k. Paid time off, including paid holidays, vacation time and sick time. Performance based year-end bonus. Telecommunication allowance, applied to certain business lines. Monthly team building events.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3986391358"}