{"jobTitle": "Associate Manager, Platform Services - Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "About The Team<br/><br/>DoorDash Drive is one of the fastest-growing segments within DoorDash. We offer a variety of products such as white-label delivery service capabilities, online ordering, and order-pay-at-table. These products enable our merchants (restaurants, grocers, retailers, etc.) to reach customers through their own first-party channels while leveraging their own brand identity and voice. The Drive Platform’s capabilities and integrations are a massive contribution to our business’s ability to grow.<br/><br/>As part of the Strategy &amp; Operations team focused on our restaurant segment, the Associate Manager will have the opportunity to help define and lead key strategic bets and initiatives to grow the business.<br/><br/>On a typical day, you will be working with our cross-functional partners and merchants. This will include running and refining experiments to improve operations, analyzing and diving into data to derive insights, speaking to merchants to inform our product and GTM strategies, and building internal processes to help our teams work together more efficiently.<br/><br/>About The Role<br/><br/>You will play a pivotal role in driving company growth, focused on growing the penetration of our first party products with SMB restaurants in the US and Canada.<br/><br/>Your Responsibilities Will Include<br/><br/><ul><li>Grow the product line — Be responsible for identifying new vectors for growth across our platform products spanning online ordering, tableside order &amp; pay, delivery, loyalty, and more.</li><li>Impact – As the voice of the merchant, work with your partners from Product, Engineering, Operations, Support, Sales and Marketing to solve important challenges for our partners and execute solutions to scale delivery for their business. This influences the product roadmap, making us 1% better each day</li><li>Analyze – Complex data sets paired with partner team feedback to provide insights and recommendations to our Merchants and internal teams.</li><li>Experiment – Use data and sound business judgment to test and build the processes needed to retain and grow our most important merchants, driving them towards operational efficiency and excellence</li><li>Scale learnings — Establish best practices for how to grow penetration of our platform products at scale. Develop and implement new initiatives, strategies, and programs to help increase your team’s productivity and drive enablement across the organization<br/><br/></li></ul>The Best Candidates Will<br/><br/><ul><li>Have extremely strong analytical skills with an intellectual curiosity to challenge and dissect data</li><li>Demonstrate an entrepreneurial spirit to find creative solutions to overcome seemingly impossible challenges</li><li>Understand the importance of ownership and bias for action</li><li>Be comfortable working in a fast-paced environment<br/><br/></li></ul>You're excited about this opportunity because you will…<br/><br/><ul><li>Build deep and meaningful relationships with merchants, laser focused on helping them thrive</li><li>Imagine, develop, and execute on workstreams from start to completion with little oversight </li><li>Oscillate easily from strategic considerations to tactical execution </li><li>Operate comfortably in ambiguous environments while maintaining a strong bias for action</li><li>Communicate precisely dependent on audience and level of detail necessary to share </li><li>Collaborate effectively with cross-functional team members across the organization</li><li>Represent the DoorDash brand with humility and a customer-first mindset<br/><br/></li></ul>We're excited about you because you…<br/><br/><ul><li>4-6 years of experience in consulting / strategy / business development / operations / technology / client experience</li><li>Proven track record of leading initiatives, working cross-functionally to achieve goals, and succeeding in a team environment</li><li>Excellent Excel skills (can perform complex functions); SQL knowledge preferred</li><li>Experience in a complex or high-growth environment preferred</li><li>Bachelor’s degree required<br/><br/></li></ul>Compensation<br/><br/>The location-specific base salary range for this position is listed below. Compensation in other geographies may vary.<br/><br/>Actual compensation within the pay range will be decided based on factors including, but not limited to, skills, prior relevant experience, and specific work location. For roles that are available to be filled remotely, base salary is localized according to employee work location. Please discuss your intended work location with your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being, and that’s why we offer a comprehensive benefits package, for full-time employees, that includes healthcare benefits, a 401(k) plan including an employer match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, paid time off, paid parental leave, and several paid holidays, among others.<br/><br/>In addition to base salary, the compensation package for this role also includes opportunities for equity grants.<br/><br/>Applications for this position are accepted on an ongoing basis<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Colorado Pay Range<br/><br/>$97,200—$145,800 USD<br/><br/>California Pay Range<br/><br/>$102,600—$162,000 USD<br/><br/>New York Pay Range<br/><br/>$108,000—$162,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Grow the product line — Be responsible for identifying new vectors for growth across our platform products spanning online ordering, tableside order &amp; pay, delivery, loyalty, and more.\nImpact – As the voice of the merchant, work with your partners from Product, Engineering, Operations, Support, Sales and Marketing to solve important challenges for our partners and execute solutions to scale delivery for their business. This influences the product roadmap, making us 1% better each day\nAnalyze – Complex data sets paired with partner team feedback to provide insights and recommendations to our Merchants and internal teams.\nExperiment – Use data and sound business judgment to test and build the processes needed to retain and grow our most important merchants, driving them towards operational efficiency and excellence\nScale learnings — Establish best practices for how to grow penetration of our platform products at scale. Develop and implement new initiatives, strategies, and programs to help increase your team’s productivity and drive enablement across the organization", "qualifications": {"required": "4-6 years of experience in consulting / strategy / business development / operations / technology / client experience\nProven track record of leading initiatives, working cross-functionally to achieve goals, and succeeding in a team environment\nExcellent Excel skills (can perform complex functions); SQL knowledge preferred\nExperience in a complex or high-growth environment preferred\nBachelor’s degree required", "preferred": null}, "skills": ["Data Analysis", "Business Development", "Operations Management", "Product Management", "Strategy", "Consulting", "Cross-functional Collaboration", "Excel", "SQL"], "postedDate": "4 days ago", "applicationDeadline": null, "benefits": "DoorDash cares about you and your overall well-being, and that’s why we offer a comprehensive benefits package, for full-time employees, that includes healthcare benefits, a 401(k) plan including an employer match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, paid time off, paid parental leave, and several paid holidays, among others.", "remoteWork": null, "salary": {"amount": "97,200.00—145,800 USD", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3987286107"}