{"jobTitle": "Payment Operations Manager", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "About The Team<br/><br/>The Payments Finance, Strategy, &amp; Operations (FS&amp;O) team at DoorDash is responsible for managing our payments costs, vendor relationships, long-term strategy, as well as interchange analysis and optimizations. The Payments Finance, Strategy, &amp; Operations team is responsible for optimizing and managing DoorDash’s payments cost and strategy to continue to drive our rapid growth. In addition to payments cost forecasting, we manage vendor relationships, evaluate new opportunities, and collaborate with the broader Money organization at DoorDash to help drive payments innovations that improve experience for our Consumers, Merchants and Dashers.<br/><br/>About The Role<br/><br/>This is a unique opportunity to be the leader of the payments cost and growth optimization function at DoorDash with a huge amount of impact and visibility. You will find cost savings and growth opportunities across our payments infrastructure and develop long-term partnership strategies. This role is vital to executing the broader Money organization’s operating plans and will work closely with Product and Engineering partners. You will report into a Senior Director on our Finance &amp; Strategy team in our CFO organization. With this role we are flexible on remote/in-office, but expect quarterly visits to the LA or SF office. The right candidate will possess strong analytical, technical and communication skills to influence data-driven business decisions &amp; trade-offs. Additionally, the candidate must have a deep understanding of the payments industry.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Dive deep into interchange and network costs to produce actionable insights that drive growth optimizations and cost savings</li><li>Collaborate with external partners to diagnose issues, understand business trends, and stay up to date on market updates</li><li>Partner with product, engineering, finance, and analytics on opportunity sizing initiatives for roadmap planning</li><li>Communicate payment impact to the business across finance &amp; strategy and other key business stakeholders</li><li>Think like an owner and initiate longer-term strategic analysis that will contribute meaningfully to DoorDash</li><li>Identify and quantify key risks &amp; opportunities in our business</li><li>Operate in a fast-paced and dynamic environment that is constantly evolving<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>5+ years in a payments function at a high-growth technology startup or well-established company</li><li>Ability to influence cross-functional partners at all levels within an organization</li><li>Ability to develop a data-driven long-term payment optimization strategy within a multiprocessor environment</li><li>Ability to document and implement processes that scale with the business</li><li>Advanced SQL proficiency. Able to manipulate large data sets, uncover hidden insights in our data, and meaningfully improve our understanding of our payments through this process <br/><br/></li></ul>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$121,700—$179,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Dive deep into interchange and network costs to produce actionable insights that drive growth optimizations and cost savings\nCollaborate with external partners to diagnose issues, understand business trends, and stay up to date on market updates\nPartner with product, engineering, finance, and analytics on opportunity sizing initiatives for roadmap planning\nCommunicate payment impact to the business across finance &amp; strategy and other key business stakeholders\nThink like an owner and initiate longer-term strategic analysis that will contribute meaningfully to DoorDash\nIdentify and quantify key risks &amp; opportunities in our business\nOperate in a fast-paced and dynamic environment that is constantly evolving", "qualifications": {"required": "5+ years in a payments function at a high-growth technology startup or well-established company\nAbility to influence cross-functional partners at all levels within an organization\nAbility to develop a data-driven long-term payment optimization strategy within a multiprocessor environment\nAbility to document and implement processes that scale with the business\nAdvanced SQL proficiency. Able to manipulate large data sets, uncover hidden insights in our data, and meaningfully improve our understanding of our payments through this process"}, "skills": ["Payments", "SQL", "Strategy", "Finance", "Operations"], "postedDate": "2 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "salary": {"amount": "121,700—$179,000", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3987282628"}