{"jobTitle": "Sr Director, Ecommerce Marketing", "company": {"name": "Munchkin", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": " $185,000 - $225,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing, Advertising Services, and Market Research", "description": "<strong>Who We Are:<br/><br/></strong>WHY Brands Inc., a parent company of Munchkin and Curio Home Goods, focuses on creating, incubating, and growing the next generation of consumer lifestyle brands. Founded in 1990, Munchkin is the leading consumer product company and most loved baby lifestyle brand behind innovative gear and products for children, mothers, and caregivers. Munchkin has sold billions of dollars of products through our key retail partners: Target, Walmart, and Amazon and has global distribution in over 50 countries. Curio, a premium brand of curated collections of home goods, launched in 2023. WHY’s vision is to establish an expanding portfolio of innovative businesses that align with its commitment to inventive product design. With over 320+ patents under our belt, we continue to create solutions that leave our customers asking, \"how did I ever live without this?\" Recognized as #8 on America’s Most Innovative Companies list by Fortune Magazine, innovation is the core of our company DNA and has been driving our designs for 30 years!<br/><br/>We lead with our core values and believe that investing in the community is our responsibility. We create opportunities for every child’s potential and well-being through the Radiant Colors program, work to create a sustainable future, and in partnership with the International Fund for Animal Welfare have committed to animal conservation.<br/><br/>There is no better time than now to join WHY Brands as we embark on our next and biggest growth journey, and you could be the next influential leader to play a key role in driving enormous customer-centered value and rapid growth.<br/><br/><strong>What You’ll Do<br/><br/><br/></strong><ul><li>Lead the business strategy for Munchkin's DTC operation, championing the launch of new product categories and achieving revenue and contribution targets</li><li>Develop and execute a robust revenue plan for Munchkin.com, focusing on driving short-term revenue while achieving long-term financial goals</li><li>Oversee product curation, pricing strategies, and promotional activities to maximize sales and profitability on Munchkin.com. Collaborate with Marketing and Product Development to co-champion the product development pipeline for DTC exclusives</li><li>Utilize digital marketing expertise to manage the DTC marketing budget across channels (e.g., Paid Search/Google, Paid Social, Display, Email) and deliver improvements in Customer Acquisition Cost (CAC) and Lifetime Value (LTV)</li><li>Lead efforts in both paid and organic customer acquisition, using advanced targeting, segmentation, and personalization techniques. Oversee SEO strategy and implement organic tactics to drive new customer growth</li><li>Develop and implement effective customer retention strategies, including Email, SMS, and Retargeting, to drive lifetime value through subscription models and repeat purchases, prioritizing the development of subscription-based offerings</li><li>Partner with Brand Design and Web Development to drive feature choices that improve sales performance. Ensure an ongoing cadence of A/B tests to optimize the website user experience and conversion rates</li><li>Utilize data analytics to make informed decisions, track performance metrics, and identify areas for improvement</li><li>Manage and mentor a high-performing e-commerce team, fostering a culture of innovation, collaboration, and continuous improvement</li><li>Work closely with marketing, brand design, product development, consumer insights, IT, and other departments to ensure a cohesive and integrated approach to e-commerce</li><li>Stay informed on industry trends, emerging technologies, and best practices to ensure Munchkin remains at the forefront of e-commerce innovation<br/><br/><br/></li></ul><strong>Bring It<br/><br/><br/></strong><ul><li>10+ years of business experience in e-commerce and/or DTC, including team management and a proven track record of leading and growing web sales</li><li>Experience with a strong brick-and-mortar brand expanding into DTC is highly preferred</li><li>Demonstrated experience in launching new products and categories in an e-commerce environment</li><li>Proven experience in developing and managing subscription-based business models</li><li>Experience managing and optimizing online marketing tactics and CRM, with an emphasis on efficient spending to generate high ROI</li><li>Understanding of e-commerce architectures, user interfaces, and back-end processes. Familiarity with Shopify or other large-scale e-commerce platforms</li><li>Ability to measure and report on the performance of marketing campaigns, gain insights, and assess against goals</li><li>Ability to thrive in a fast-paced environment and accommodate demanding project schedules</li><li>Knowledge of digital marketing, particularly mobile, email marketing, and segmentation practices<br/><br/><br/></li></ul><strong>We Got You Covered!<br/><br/></strong>As a Great Place to Work Certified™ company, we are committed to offering the best to our employees. We offer a comprehensive benefits package that includes medical, vision, dental, prescription drug coverage, life insurance, wellness benefits, a generous employer-matched 401(k) plan, and Paid Childcare Leave, among other benefit plans. Our total rewards are top of the market and include competitive salaries, bonuses, and opportunities to earn equity. We focus on supporting employee development and growth.<br/><br/>We regularly hold social functions to foster a genuine camaraderie that enhances teamwork. At our company-wide award functions, we take time to recognize the talent and dedication of the people who make Munchkin the most loved baby lifestyle brand in the world.<br/><br/>To give our people flexibility, we offer a hybrid work environment. Munchkin’s Hybrid Schedule allows employees to work in the office on Monday, Wednesday, and Thursday, with remote work on Tuesday and Friday.<br/><br/>We also provide annual weeklong global office closures giving our people a chance to recharge.<br/><br/>Salary range: <strong> $185,000 - $225,000</strong> (DOE)<br/><br/>To learn more, visit us at www.munchkin.com.<br/><br/>Munchkin welcomes and values what makes everyone unique. We’re proud to be an equal opportunity and affirmative action employer. All hires to our team are based on qualifications, merit and business needs. We recruit, employ, train and promote regardless of race, color, religion, disability, sex, sexual orientation, gender identity, national origin, age, veteran status, genetic characteristic or any other protected status.<br/><br/>Applicant Privacy Statement", "responsibilities": "Lead the business strategy for Munchkin's DTC operation, championing the launch of new product categories and achieving revenue and contribution targets\nDevelop and execute a robust revenue plan for Munchkin.com, focusing on driving short-term revenue while achieving long-term financial goals\nOversee product curation, pricing strategies, and promotional activities to maximize sales and profitability on Munchkin.com. Collaborate with Marketing and Product Development to co-champion the product development pipeline for DTC exclusives\nUtilize digital marketing expertise to manage the DTC marketing budget across channels (e.g., Paid Search/Google, Paid Social, Display, Email) and deliver improvements in Customer Acquisition Cost (CAC) and Lifetime Value (LTV)\nLead efforts in both paid and organic customer acquisition, using advanced targeting, segmentation, and personalization techniques. Oversee SEO strategy and implement organic tactics to drive new customer growth\nDevelop and implement effective customer retention strategies, including Email, SMS, and Retargeting, to drive lifetime value through subscription models and repeat purchases, prioritizing the development of subscription-based offerings\nPartner with Brand Design and Web Development to drive feature choices that improve sales performance. Ensure an ongoing cadence of A/B tests to optimize the website user experience and conversion rates\nUtilize data analytics to make informed decisions, track performance metrics, and identify areas for improvement\nManage and mentor a high-performing e-commerce team, fostering a culture of innovation, collaboration, and continuous improvement\nWork closely with marketing, brand design, product development, consumer insights, IT, and other departments to ensure a cohesive and integrated approach to e-commerce\nStay informed on industry trends, emerging technologies, and best practices to ensure Munchkin remains at the forefront of e-commerce innovation", "qualifications": {"required": "10+ years of business experience in e-commerce and/or DTC, including team management and a proven track record of leading and growing web sales\nExperience with a strong brick-and-mortar brand expanding into DTC is highly preferred\nDemonstrated experience in launching new products and categories in an e-commerce environment\nProven experience in developing and managing subscription-based business models\nExperience managing and optimizing online marketing tactics and CRM, with an emphasis on efficient spending to generate high ROI\nUnderstanding of e-commerce architectures, user interfaces, and back-end processes. Familiarity with Shopify or other large-scale e-commerce platforms\nAbility to measure and report on the performance of marketing campaigns, gain insights, and assess against goals\nAbility to thrive in a fast-paced environment and accommodate demanding project schedules\nKnowledge of digital marketing, particularly mobile, email marketing, and segmentation practices", "preferred": ""}, "skills": ["Ecommerce", "DTC", "Team Management", "Product Launch", "Subscription Models", "Digital Marketing", "CRM", "Ecommerce Platforms", "Data Analytics", "SEO", "Paid Search", "Paid Social", "Email Marketing", "Mobile Marketing", "Segmentation", "A/B Testing", "Customer Acquisition", "Customer Retention", "Brand Design", "Web Development", "Marketing", "Product Development", "Consumer Insights", "IT"], "postedDate": "6 days ago", "benefits": "As a Great Place to Work Certified™ company, we are committed to offering the best to our employees. We offer a comprehensive benefits package that includes medical, vision, dental, prescription drug coverage, life insurance, wellness benefits, a generous employer-matched 401(k) plan, and Paid Childcare Leave, among other benefit plans. Our total rewards are top of the market and include competitive salaries, bonuses, and opportunities to earn equity. We focus on supporting employee development and growth.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3987456070"}