{"jobTitle": "Senior Logistics Clerk", "company": {"name": "KBR, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "<strong>Title<br/><br/></strong>Senior Logistics Clerk<br/><br/><strong>Belong, Connect, Grow, with KBR! <br/><br/></strong><strong>Program Summary<br/><br/></strong>KBR’s Global Asset Management (GAM) group offers comprehensive manufacturing and supply chain solutions to a diverse clientele. With a global reach spanning over +20 locations, the program caters to both commercial and government customers. Our array of services includes Government Property Management, Production Maintenance, Mail Room Services, Equipment Tracking, Regulatory and Customer Compliance of Property Systems, Import/Export Trade Compliance, Material Management, Stockrooms/Tool Cribs/Receiving, Engineering Tool Design and Rework/Repairs, Records Management, Distribution Services, Capital Asset Management, and Development &amp; Production-Equipment Maintenance. The GAM Program is committed to delivering excellence in every aspect of the supply chain and asset management process, ensuring the seamless operation of our clients' enterprises. If you're ready for a new and exciting career opportunity, apply today!<br/><br/><strong>Job Summary<br/><br/></strong>The Senior Logistics Clerk will manage and streamline the movement of materials, parts, and assemblies, setting and communicating deadlines for deliverables. You will ensure the accuracy of incoming and outgoing shipments and associated rates, maintaining all relevant records. This role includes applying identifying information and shipping instructions to containers, liaising with vendors through various communication methods to requisition materials and confirm shipment dates, and coordinating the distribution of materials upon arrival. Additionally, the Senior Logistics Clerk will conduct quality and quantity inspections to ensure compliance with specifications and prioritize meeting schedules and customer requirements to ensure satisfaction.<br/><br/><strong>Roles And Responsibilities<br/><br/></strong><ul><li>Oversee the logistical aspects of daily operations in the Asset Management organization, including inventory control, order fulfillment, and distribution.</li><li>Ensure the accurate application of product adjustments by reviewing inventory records for completeness and accuracy.</li><li>Plan and coordinate inbound and outbound shipments based on customer requirements.</li><li>Verify products and quantities against packing slips upon receipt.</li><li>Record received products in the system and allocate them to the appropriate storage locations.</li><li>Fulfill orders and backorders by picking requested products from generated pick tickets and distributing them across the site.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Must be a US Citizen.</li><li>High School Diploma or equivalent, along with 1 year of related experience.</li><li>Ability to achieve NPMA certification within 1 year of hire date<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>MS Office including Excel, Word, PowerPoint</li><li>SAP, eQuip<br/><br/></li></ul>California: $25.71/ hour – Exempt position<br/><br/><strong>KBR Benefits<br/><br/></strong>KBR offers a selection of competitive lifestyle benefits which could include 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.<br/><br/><strong>Inclusion and Diversity at KBR <br/><br/></strong>At KBR, we are passionate about our people, sustainability, and our Zero Harm culture. These inform all that we do and are at the heart of our commitment to, and ongoing journey toward being a more inclusive and diverse company. That commitment is central to our team of team’s philosophy and fosters an environment of real collaboration across cultures and locations. Our individual differences and perspectives bring enhanced value to our teams and help us develop solutions for the most challenging problems. We understand that by embracing those differences and working together, we are more innovative, more resilient.<br/><br/>KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.<br/><br/><strong>R2092559</strong>", "responsibilities": "<ul><li>Oversee the logistical aspects of daily operations in the Asset Management organization, including inventory control, order fulfillment, and distribution.</li><li>Ensure the accurate application of product adjustments by reviewing inventory records for completeness and accuracy.</li><li>Plan and coordinate inbound and outbound shipments based on customer requirements.</li><li>Verify products and quantities against packing slips upon receipt.</li><li>Record received products in the system and allocate them to the appropriate storage locations.</li><li>Fulfill orders and backorders by picking requested products from generated pick tickets and distributing them across the site.<br/><br/></li></ul>", "qualifications": {"required": "Must be a US Citizen.\nHigh School Diploma or equivalent, along with 1 year of related experience.\nAbility to achieve NPMA certification within 1 year of hire date", "preferred": "MS Office including Excel, Word, PowerPoint\nSAP, eQuip"}, "skills": ["Excel", "Word", "PowerPoint", "SAP", "eQuip"], "postedDate": "2 weeks ago", "benefits": "KBR offers a selection of competitive lifestyle benefits which could include 401K plan with company match, medical, dental, vision, life insurance, AD&amp;D, flexible spending account, disability, paid time off, or flexible work schedule. We support career advancement through professional training and development.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987646487"}