{"jobTitle": "Content Partnerships Manager, The Roku Channel", "company": {"name": "Roku", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "109,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Software Development", "description": "Teamwork makes the stream work.<br/><br/><strong>Roku Is Changing How The World Watches TV<br/><br/></strong>Roku is the #1 TV streaming platform in the US, and we've set our sights on powering every television in the world. Roku pioneered streaming to the TV. Our mission is to be the TV streaming platform that connects the entire TV ecosystem. We connect consumers to the content they love, enable content publishers to build and monetize large audiences, and provide advertisers unique capabilities to engage consumers.<br/><br/>From your first day at Roku, you'll make a valuable - and valued - contribution. We're a fast-growing public company where no one is a bystander. We offer you the opportunity to delight millions of TV streamers around the world while gaining meaningful experience across a variety of disciplines.<br/><br/><strong>About The Role<br/><br/></strong>Roku is seeking a Content Partnerships Manager to join the ad-supported VOD/ linear partner growth team focused on Roku Channel. This team is responsible for the overall success of key partners on Roku Channel. Success is measured by delivering on and exceeding expectations with respect to user engagement (as defined by reach and streaming hours), financial results (revenue, gross profit) and other key health and growth metrics.<br/><br/>The role requires a diverse range of direct-to-consumer video experience across content programming, partner management, product, and marketing. The right individual has proven experience building relationships with content partners, developing data driven growth strategies, then rolling up their sleeve to execute and achieve these goals. To be successful, the candidate will require the ability to work across and organize a diverse range of internal departments, such as editorial, content acquisition, data analytics and marketing.<br/><br/>\"For California Only - The estimated annual salary for this position is between $109,000 and $130,000 annually.<br/><br/>Compensation packages are based on factors unique to each candidate, including but not limited to skill set, certifications, and specific geographical location.<br/><br/>This role is eligible for health insurance, equity awards, life insurance, disability benefits, parental leave, wellness benefits, and paid time off.\"<br/><br/>What you’ll be doing   <br/><br/><ul><li>Account Management</li><ul><li>Act as the day-to-day partner relationship manager to grow partners within Roku Channel</li><li>Drive communication, education, data management across managed partners</li><li>Support the onboarding of new content partners</li><li>Coordinate the submission, selection and launch of new partner content, communicating with partners and working internally with Programming, Acquisition and Operational teams </li></ul><li>Partner Growth Strategy</li><ul><li>Create and present performance evaluations for partners, including comprehensive quarterly business reviews</li><li>Develop internal partner playbooks that offer executive staff a concise overview of partnerships along with actionable strategic plans</li><li>Build deep partner expertise, developing strong internal and external workflows to provide best-in-class service to partners</li><li>Leverage data, market research and insights to evaluate new content partnership opportunities to Roku Channel</li><li>Lean into other content partnership areas as needed </li></ul><li>Cross-Functional Collaboration</li><ul><li>Collaborate with content acquisition, content operations, editorial, and marketing on deal lifecycle and execution through partner roll out</li><li>Assist in the development and implementation of marketing and editorial strategies that maximize user engagement</li><li>Work with product and analytics teams to drive automation, enhanced reporting and tools to improve the efficiency of strategic plans</li><li>Aggregate feedback flagged internal and external stakeholders into comprehensive and actionable trackers to drive process improvement</li><li>Perform other tasks, projects, and responsibilities as assigned by leadership <br/></li></ul></ul><strong>We’re excited if you have<br/><br/></strong><ul><li>5-7 years of relevant experience in a top management consulting firm, investment bank and/or media/entertainment/tech company in a strategy, program planning or analytical role</li><li>Experience delivering results in consultative, partnerships, and/or business development environments</li><li>Strong analytical skills including creating / managing financial and operational KPIs (preferably candidates that have worked in a highly-demanding environment where complex analysis is performed)</li><li>Experience conducting quantitative (including modeling) &amp; qualitative analysis to drive results leveraging data comprehension of video streaming business models (MVPD, TVE, SVOD, AVOD, TVOD)</li><li>Ability to cultivate and build strong relationships with content partners and industry counterparts</li><li>Bachelor's degree in business, finance, accounting, or economics, or equivalent; MBA preferred but not required</li><li>Familiarity with Airtable, Confluence, Salesforce and Looker tooling a plus<br/><br/></li></ul><strong>Benefits<br/><br/></strong>Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.<br/><br/><strong>The Roku Culture<br/><br/></strong>Roku is a great place for people who want to work in a fast-paced environment where everyone is focused on the company's success rather than their own. We try to surround ourselves with people who are great at their jobs, who are easy to work with, and who keep their egos in check. We appreciate a sense of humor. We believe a fewer number of very talented folks can do more for less cost than a larger number of less talented teams. We’re independent thinkers with big ideas who act boldly, move fast and accomplish extraordinary things through collaboration and trust. In short, at Roku you'll be part of a company that's changing how the world watches TV. <br/><br/>We have a unique culture that we are proud of. We think of ourselves primarily as problem-solvers, which itself is a two-part idea. We come up with the solution, but the solution isn't real until it is built and delivered to the customer. That penchant for action gives us a pragmatic approach to innovation, one that has served us well since 2002. <br/><br/>To learn more about Roku, our global footprint, and how we've grown, visit https://www.weareroku.com/factsheet.<br/><br/>By providing your information, you acknowledge that you have read our Applicant Privacy Notice and authorize Roku to process your data subject to those terms.<br/><br/>", "responsibilities": "Act as the day-to-day partner relationship manager to grow partners within Roku Channel\nDrive communication, education, data management across managed partners\nSupport the onboarding of new content partners\nCoordinate the submission, selection and launch of new partner content, communicating with partners and working internally with Programming, Acquisition and Operational teams \nCreate and present performance evaluations for partners, including comprehensive quarterly business reviews\nDevelop internal partner playbooks that offer executive staff a concise overview of partnerships along with actionable strategic plans\nBuild deep partner expertise, developing strong internal and external workflows to provide best-in-class service to partners\nLeverage data, market research and insights to evaluate new content partnership opportunities to Roku Channel\nLean into other content partnership areas as needed \nCollaborate with content acquisition, content operations, editorial, and marketing on deal lifecycle and execution through partner roll out\nAssist in the development and implementation of marketing and editorial strategies that maximize user engagement\nWork with product and analytics teams to drive automation, enhanced reporting and tools to improve the efficiency of strategic plans\nAggregate feedback flagged internal and external stakeholders into comprehensive and actionable trackers to drive process improvement\nPerform other tasks, projects, and responsibilities as assigned by leadership", "qualifications": {"required": "5-7 years of relevant experience in a top management consulting firm, investment bank and/or media/entertainment/tech company in a strategy, program planning or analytical role\nExperience delivering results in consultative, partnerships, and/or business development environments\nStrong analytical skills including creating / managing financial and operational KPIs (preferably candidates that have worked in a highly-demanding environment where complex analysis is performed)\nExperience conducting quantitative (including modeling) &amp; qualitative analysis to drive results leveraging data comprehension of video streaming business models (MVPD, TVE, SVOD, AVOD, TVOD)\nAbility to cultivate and build strong relationships with content partners and industry counterparts\nBachelor's degree in business, finance, accounting, or economics, or equivalent; MBA preferred but not required", "preferred": "Familiarity with Airtable, Confluence, Salesforce and Looker tooling a plus"}, "skills": ["Airtable", "Confluence", "Salesforce", "Looker", "Partner Management", "Content Programming", "Product Management", "Marketing", "Data Analysis", "Business Development", "Financial Analysis", "Strategic Planning", "Relationship Building", "Communication", "Data Driven", "Video Streaming", "MVPD", "TVE", "SVOD", "AVOD", "TVOD"], "postedDate": "3 hours ago", "benefits": "Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987284578"}