{"jobTitle": "Customer Service Manager/Office Coordinator", "company": {"name": "NaphCare, Inc.", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "<strong>About the role:<br/><br/></strong>In your role as Office Coordinator, you will support the Office Manager with the daily running of The Yard by delivering a well presented, professional, efficient, friendly reception and office environment. You’ll also provide support with a wide range of facilities and services to ensure the office operates efficiently and the appearance is maintained to an outstanding level both inside and outside of the building. In addition, you will support the office manager with coordinating contractors onsite and performing daily checks that all areas of the office are within health &amp; safety guidelines.<br/><br/><strong>Key Accountabilities &amp; Responsibilities<br/><br/></strong><ul><li>Support with the day to day running of The Yard which includes coordinating meeting room requirements, diary bookings and coordinating all maintenance ensuring that communal areas are kept to an exceptional standard. You’ll also need to liaise with cleaning staff to ensure standards are delivered and maintained ongoing</li><li>To ensure product displays are in perfect condition and propped appropriately</li><li>Communicating with regular contractors to ensure the maintenance of the entire building is delivered to a high standard and log maintenance tasks on system</li><li>Engaging with alternative contractors to secure them at short notice in emergencies</li><li>Update the following: office policy and procedures documents, the content of The Yard intranet site and the business continuity plan</li><li>Support with the update and maintenance of the product display area in our other offices. </li><li>Deliver H&amp;S inductions for new starters &amp; visitors</li><li>Support with the delivery of Fire Marshall Training, ensuring we always have qualified Fire Marshals in place<br/><br/></li></ul><strong>Benefits Of Working For Us As An Office Coordinator<br/><br/></strong><ul><li>Highly competitive salary plus bonus</li><li>Competitive Pension Plan with core 6% employer contribution, further 2% matching available</li><li>25 days holiday (excluding Bank holidays)</li><li>Staff discount on Howdens’s products</li><li>Share awards and prize draws</li><li>Subsidised gym membership</li><li>Modern spacious offices with free parking</li><li>Friendly and supportive environment offering exceptional reward and recognition<br/><br/></li></ul>Powered by Webbtree", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3987036925"}