{"jobTitle": "Quality Lead, Small Business Group", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "152,000.00/yr - $214,000.00/yr", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Technology, Information and Internet", "description": "Meta’s mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. In the Small Business Group organization, we work with millions of small businesses supporting their growth and connecting them with customers at both a global and local level. We are seeking a strategic, analytical Quality Lead to inform leadership decisions, drive operational excellence, and elevate the outsourced sales team to higher performance. This position will be focused on identifying strategic opportunities, driving operational excellence and influencing cross-functional partners to improve the overall customer experience and enable small business growth. The ideal candidate will combine high empathy for small business owners using the Meta family of apps; understanding of sales teams; a keen eye for identifying process and workflow improvement opportunities; exceptional ability to drive results in collaborative, multi-stakeholder environments; a passion for rigorous planning and flawless execution; and a willingness to roll up their sleeves and execute the tactics. Success in this position requires strong critical-thinking and problem-solving skills; attention to detail; the ability to thrive in a dynamic and changing environment; and a passion for helping others achieve results.<br/><br/>Quality Lead, Small Business Group Responsibilities:<br/><br/><ul><li>Manage the processes and frameworks for gathering customer experience inputs and insights for our sales programs</li><li>Lead cross-functional groups across multiple teams and functions to design, develop and optimize strategies and initiatives that improve the Quality of our sales experience and drive positive customer outcomes</li><li>Evaluate performance data and behavioral trends to drive improvements across Quality Program and juggle competing priorities</li><li>Monitor effectiveness of Quality initiatives, identify gaps and implement actions with regional sales teams and cross-functional partners</li><li>Design and implement solutions for Quality workflow automation through Generative AI and speech analytics</li><li>Deliver strategic recommendations to business and cross-functional teams to enable small business growth across Meta’s platforms e.g. customer journey mapping, product recommendations</li><li>Chair large quality assurance calibration sessions with internal stakeholders and vendors, resolving differences and providing clarity to drive alignment</li><li>Build strong relationships and drive alignment across multiple cross-functional partners to ensure a consistent cross-channel experience across segments</li><li>Represent the customer internally by connecting research, data, and qualitative evidence to influence teams to action</li><li>Monitor outsourced partners compliance, adherence, and productivity</li><li>Utilize multiple customer listening posts (surveys, customer verbatim, focus groups, social media, etc.) to create a more reliable and sensitive customer feedback signal</li><li>Develop and assess customer experience through direct contact interactions and trend analysis</li><li>Sync with outsourced vendor partners to share insights, identify focus areas, and agree on actions</li><li>Provide thought leadership and advocate for small businesses<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Bachelor’s Degree</li><li>5+ years of work experience in consulting, vendor management, operational strategy or sales coaching</li><li>Experience communicating and presenting insights and recommendations to executive teams</li><li>Experience leading and influencing cross-functional teams and aligning partners to shared goals</li><li>Experience managing internal and external facing projects (sales development/strategy, training, communications, marketing, account management)</li><li>Operational and project management experience running strategic projects with cross-functional teams</li><li>Experience utilizing customer sentiment and call logs to define sales development opportunities within vendor partners</li><li>Experience shifting priorities, while maintaining organization and control<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Degree in Business or related field</li><li>Experience with inside sales, outsourced sales or account management capacity</li><li>Experience of sales-program quality assessment or sales development training</li><li>Advanced Excel experience – familiarity with pivot tables, lookups, revenue trend analyses</li><li>Moderate SQL experience extracting data from large databases</li><li>Customer journey mapping and/or process mapping experience</li><li>Demonstrated the experience to work autonomously and proactively<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$152,000/year to $214,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Manage the processes and frameworks for gathering customer experience inputs and insights for our sales programs\nLead cross-functional groups across multiple teams and functions to design, develop and optimize strategies and initiatives that improve the Quality of our sales experience and drive positive customer outcomes\nEvaluate performance data and behavioral trends to drive improvements across Quality Program and juggle competing priorities\nMonitor effectiveness of Quality initiatives, identify gaps and implement actions with regional sales teams and cross-functional partners\nDesign and implement solutions for Quality workflow automation through Generative AI and speech analytics\nDeliver strategic recommendations to business and cross-functional teams to enable small business growth across Meta’s platforms e.g. customer journey mapping, product recommendations\nChair large quality assurance calibration sessions with internal stakeholders and vendors, resolving differences and providing clarity to drive alignment\nBuild strong relationships and drive alignment across multiple cross-functional partners to ensure a consistent cross-channel experience across segments\nRepresent the customer internally by connecting research, data, and qualitative evidence to influence teams to action\nMonitor outsourced partners compliance, adherence, and productivity\nUtilize multiple customer listening posts (surveys, customer verbatim, focus groups, social media, etc.) to create a more reliable and sensitive customer feedback signal\nDevelop and assess customer experience through direct contact interactions and trend analysis\nSync with outsourced vendor partners to share insights, identify focus areas, and agree on actions\nProvide thought leadership and advocate for small businesses", "qualifications": {"required": "Bachelor’s Degree\n5+ years of work experience in consulting, vendor management, operational strategy or sales coaching\nExperience communicating and presenting insights and recommendations to executive teams\nExperience leading and influencing cross-functional teams and aligning partners to shared goals\nExperience managing internal and external facing projects (sales development/strategy, training, communications, marketing, account management)\nOperational and project management experience running strategic projects with cross-functional teams\nExperience utilizing customer sentiment and call logs to define sales development opportunities within vendor partners\nExperience shifting priorities, while maintaining organization and control", "preferred": "Degree in Business or related field\nExperience with inside sales, outsourced sales or account management capacity\nExperience of sales-program quality assessment or sales development training\nAdvanced Excel experience – familiarity with pivot tables, lookups, revenue trend analyses\nModerate SQL experience extracting data from large databases\nCustomer journey mapping and/or process mapping experience\nDemonstrated the experience to work autonomously and proactively"}, "skills": ["Sales", "Customer Experience", "Quality Assurance", "Project Management", "Cross-functional Collaboration", "Strategic Planning", "Operational Excellence", "Data Analysis", "Communication", "Presentation Skills", "Leadership", "Influence", "Vendor Management", "Sales Coaching", "Customer Journey Mapping", "Process Mapping", "Excel", "SQL", "Generative AI", "Speech Analytics"], "postedDate": "1 day ago", "benefits": "$152,000/year to $214,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3987826571"}