{"jobTitle": "Senior Associate, Drive - Growth Strategy and Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "About The Team<br/><br/>We are revolutionizing the delivery experience for merchants and customers by offering the next generation of fulfillment services. We’re looking for someone to join the Drive team to rapidly scale our next big bet and disrupt the delivery industry.<br/><br/>About The Role<br/><br/>We are looking for someone who is passionate about scaling high growth businesses to join our rocketship on Drive, DoorDash’s white label fulfillment offering. You will be responsible for growing one of the most nascent Drive products by scaling strategic partners, driving requirements to unlock product market fit, and launching new products and services to expand our TAM. We are looking for a highly motivated first principles thinker who has a deep sense of ownership and is able to walk the fine line between diving into the lowest level of detail in our data and product, while still being able to think about the high level strategy. This is a true strategy and operations role.<br/><br/>Reporting to the Senior Manager of Drive Strategy and Operations, you will work closely with product, engineering, operations, integrations, business development and other teams to make your vision a reality.<br/><br/>You’re excited about this opportunity because you will…<br/><br/><ul><li>Strategize – Understand the needs of our partners, prioritize those needs by impact, and create solutions with cross-functional partners</li><li>Operate - Get to the lowest level of detail, and scale. You will work directly with internal and external partners to execute on your short &amp; long-term plans; you are a cross functional success enabler and an excellent operator. </li><li>Build – Develop and lead 0 to 1 opportunities, creating the roadmap for future growth vectors and determine how to invest our resources to achieve desired outcomes. </li><li>Collaborate – Value partnerships, and excel at working across Operations, Product, Sales, Engineering, and more to bring new products and services to merchants.</li><li>Construct - Navigate in an ambiguous environment and bring structure to undefined opportunities. There won’t always be playbooks or templates; instead you will create them. </li><li>Analyze – Leverage data whenever possible to inform your hypothesis and convince cross functional partners. <br/><br/></li></ul><strong>We’re Excited About You Because…<br/><br/></strong><ul><li>You have an extreme sense of ownership. You display extreme ownership for the products and business lines that you are responsible for. You never shy away from raising your hand to solve ambiguous problems and are able to motivate and empower your teammates to go above and beyond.</li><li>You solve problems from first principles. You’re excited to solve problems in innovative ways, and you resist “this is how it’s always been done” thinking.</li><li>You thrive with a diverse set of responsibilities. You love working across a breadth of disciplines and teams. </li><li>You’re an analytical powerhouse. You let data win arguments, and you’re comfortable pulling your own data in SQL and modeling in Excel.</li><li>You’re even-keeled. You thrive under pressure and maintain a sense of calm when faced with challenging and time-sensitive obstacles.</li><li>You’re persuasive. You are an effective communicator, speaking as if you’re right and listening as if you’re wrong. You meet people on their level. </li><li>You act with urgency. Speed excites you. You prefer an accomplishment today to an accomplishment tomorrow. </li><li>You’re a builder. You enjoy building from the ground up and excel in creating structure and process.</li><li>You don’t need a guide. You dive into difficult problems and come up with a plan.</li><li>You have 3+ years of experience. You’ve succeeded in competitive, challenging environments where you’ve driven both strategy and execution. <br/><br/></li></ul><strong>Bonus Points<br/><br/></strong><ul><li>You have experience with and are fluent in SQL and Excel. </li><li>You have experience in managing or supporting a complex P&amp;L. </li><li>You have experience in the tech industry launching and growing new partners and products. </li><li>You have a demonstrated interest in logistics, on-demand services, and ecommerce.<br/><br/></li></ul>Applications for this role are accepted on an on-going basis.<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/><strong>Compensation<br/><br/></strong>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$79,900—$117,500 USD<br/><br/><strong>About DoorDash<br/><br/></strong>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/><strong>Our Commitment to Diversity and Inclusion<br/><br/></strong>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "You’re excited about this opportunity because you will…<br/><br/><ul><li>Strategize – Understand the needs of our partners, prioritize those needs by impact, and create solutions with cross-functional partners</li><li>Operate - Get to the lowest level of detail, and scale. You will work directly with internal and external partners to execute on your short &amp; long-term plans; you are a cross functional success enabler and an excellent operator. </li><li>Build – Develop and lead 0 to 1 opportunities, creating the roadmap for future growth vectors and determine how to invest our resources to achieve desired outcomes. </li><li>Collaborate – Value partnerships, and excel at working across Operations, Product, Sales, Engineering, and more to bring new products and services to merchants.</li><li>Construct - Navigate in an ambiguous environment and bring structure to undefined opportunities. There won’t always be playbooks or templates; instead you will create them. </li><li>Analyze – Leverage data whenever possible to inform your hypothesis and convince cross functional partners. <br/><br/></li></ul>", "qualifications": {"required": "You have 3+ years of experience. You’ve succeeded in competitive, challenging environments where you’ve driven both strategy and execution. <br/><br/>", "preferred": "You have experience with and are fluent in SQL and Excel. \nYou have experience in managing or supporting a complex P&amp;L. \nYou have experience in the tech industry launching and growing new partners and products. \nYou have a demonstrated interest in logistics, on-demand services, and ecommerce.<br/><br/>"}, "skills": ["SQL", "Excel", "Logistics", "On-demand Services", "Ecommerce"], "postedDate": "6 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.", "salary": {"amount": "79,900—$117,500", "currency": "USD"}, "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3987282641"}