{"jobTitle": "Pharmacy Technician (Remote), Remote Pharmacy Technician - Amazon Pharmacy", "company": {"name": "Amazon", "location": "Phoenix, AZ"}, "location": "Phoenix, AZ", "jobType": "Full-time", "employmentType": "Full-time", "description": "As a Customer Service Associate, you will play an essential role in empowering our customers to take their medications correctly and achieve better overall wellness. Our pharmacy features a casual dress code in a nonretail facing environment.<br/><br/>Key job responsibilities<br/><br/><ul><li>Answer incoming telephone calls from Customer Care associates on a daily basis and maintain metrics as assigned</li><li>Make outbound calls including for a variety of purposes. Including situations deemed urgent by clinical pharmacist team</li><li>Assist clinical pharmacist team with outgoing MD, pharmacy, and/or customer calls</li><li>Assist Customer Care Associates by providing guidance and feedback utilizing a consultative approach to continually develop staff knowledge</li><li>Complete tickets to support Customer Care Team and Clinical RPh team</li><li>Maintain advanced understanding of all Amazon Pharmacy’s policies and procedures as well as Amazon Pharmacy products and services</li><li>Monitor and process all help desk assigned tasks on a daily basis</li><li>Act as primary point of contact for escalated calls by Customer Care Associates, handle escalated calls and follow through until resolution has been met</li><li>Manage reporting of customer complaints and provide resolution per set SLA’s, escalating as appropriate</li><li>Investigate and report pharmacy errors</li><li>Learn pharmacy laws and regulations nationwide</li><li>Serve as a point of contact for any system or technology/software outages and notify all appropriate parties for resolution</li><li>Maintain confidentiality of all customer information</li><li>Work autonomously and proactively identify areas in need of improvement</li><li>Constant collaboration with teammates</li><li>Customer-centric and commitment to quality</li><li>Work a flexible schedule - shifts will possibly start and end outside of normal business hours</li><li>Perform other tasks assigned while working in a fast paced environment<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong>Active and unrestricted in-state Board of Pharmacy License or ability to obtain a Pharmacy Technician<br/><br/>License through the State Board of Pharmacy within 30 days of start date (Reimbursement assistance<br/><br/>provided). Additional licenses may be required if domicile state differs from state of employment.<br/><br/><ul><li>High school or equivalent diploma<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong>National Pharmacy Technician Certification (PTCB or NHA)<br/><br/><ul><li>Experience recognizing and identifying patient medications</li><li>Demonstrated ability to work as an effective team member</li><li>Strong organization skills and attention to detail</li><li>6+ months of relevant experience working with computer and web based tools</li><li>Experience working under pressure in a fast-paced work environment while consistently meeting<br/><br/></li></ul>standards for productivity and quality<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/><br/><strong>Company</strong> - PillPack, LLC<br/><br/>Job ID: A2714434", "jobFunction": "Information Technology and Customer Service", "industry": "Software Development", "postedDate": "2 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3987196467"}