{"jobTitle": "Product Manager, VFX and Animation Infrastructure and Integrations", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>This role is part of Netflix’s Content Production &amp; Studio team, which is responsible for driving the strategy, prioritization, and execution of Netflix’s technology investments focused on producing content and managing the production of content. We are seeking a highly motivated Product Manager, someone with a proven track record of outstanding achievements, to become a vital member of our team. In this role, you will manage product development for computer graphics (CG) technologies and infrastructure, directly supporting Visual Effects (VFX) and Animation workflows within Netflix Studio.<br/><br/>As a Product Manager, you will collaborate with a cross-functional group of engineers, product managers, and studio stakeholders. Your mission will be to guide our computer graphics product strategy, ensuring that high-impact initiatives are effectively prioritized and delivered. You will drive innovative initiatives that advance Netflix’s hybrid infrastructure strategy by enabling our VFX and Animation studios to scale through seamless access to Netflix’s global production infrastructure. Additionally, you will seek opportunities to leverage established Netflix platform technologies to drive value and enhance efficiencies across VFX and Animation production.<br/><br/>To thrive in this role, you should bring hands-on production experience from a VFX or Animation studio, an understanding of studio production infrastructure, and a familiarity with essential third-party tools, open-source projects, and industry standards.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li>Develop and maintain strong partnerships with key technology and production stakeholders across Netflix Product and Technology, Netflix Studio, Scanline VFX, Eyeline Studios, and Feature Animation at Netflix </li><li>Collaborate with cross-functional and studio stakeholders to define project scope, objectives, and deliverables, ensuring alignment with studio goals and joint objectives</li><li>Partner with Product teams to ensure cohesion of hybrid infrastructure with platforms and foundational systems like Identity &amp; Access Management and Edge systems</li><li>Translate problem statements and user needs into a consistent set of requirements and product specifications to ensure successful, collaborative product development</li><li>Own the product management of innovative automation pipelines that drive enhancements in areas such as collaborative media review and standardization of 3D asset interchange and delivery</li><li>Develop regional infrastructure strategies that provide VFX and Animation production teams with access to optimized resources tailored to meet the demands of cutting-edge VFX and Animation workflows and tools</li><li>Balance short and long term perspectives, while relentlessly focusing on the best outcomes for the shows produced within Netflix’s VFX and Animation studios</li><li>Communicate project timelines, updates, and roadmaps and maintain accountability on deliverables</li><li>Collaborate with operational teams to roll out products and drive adoption<br/><br/></li></ul><strong>What We Are Looking For<br/><br/></strong><ul><li>3+ years of product management experience or senior technology leadership experience in VFX or Animation </li><li>Exposure and familiarity with industry-common creative tools (e.g. Houdini, Nuke), interchange formats (e.g. USD, OTIO), and production tracking toolsets (e.g. Flow Production Tracking f.k.a. ShotGrid)</li><li>A healthy blend of deep technical knowledge with a production-focused mindset and empathy for creative users</li><li>Ability to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision</li><li>Excellent communication skills, with the ability to effectively communicate and translate between studio and technology partners</li><li>Strong ability to dive into the unknown and create clarity amid ambiguity</li><li>Flexible amid an ever-changing and growing environment<br/><br/></li></ul>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "jobFunction": "Other", "industry": "Entertainment Providers", "postedDate": "4 days ago", "skills": ["Houdini", "Nuke", "USD", "OTIO", "Flow Production Tracking", "ShotGrid"], "url": "https://www.linkedin.com/jobs/view/3987424724"}