{"jobTitle": "Account Manager", "company": {"name": "Hybrid Apparel", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative, Customer Service, and Sales", "industry": "Retail Apparel and Fashion", "description": "Hybrid’s humble beginnings started in 1997 in the back of a print shop designing, selling, and printing tee shirts. Today, Hybrid is a global apparel industry powerhouse in brand and licensing management. Hybrid provides its expertise and fully vertical operations capability – design, merchandising, development, sourcing, production, and distribution – to a broad suite of branded, licensed, generic, and private label partners. Hybrid’s full-service apparel design and manufacturing expertise extends across the apparel category, including knits, woven tops, bottoms, tees, and accessories.\n\nAs our organization has evolved, so has our philosophy of doing business. We have made concerted efforts to remove ourselves from the antiquated approach of other apparel manufacturers and doing things differently has been our focus. We are building a company ethos that breeds innovation, collaboration, integrity, and excellence in customer service.\n\n**What is my role?**\nWork closely with Sales and Senior Account Manager in conjunction with other various departments to assist in the daily functions of managing the orders and accounts.\n\n**What You'll Do**\n<ul><li>Work with Order Management to and review weekly open order and sample reports.</li><li>Attend weekly production meetings.</li><li>Review worksheets processed from Sales to make sure detailed information is correct (i.e. style numbers, wash, treatment details, ground colors, etc.).</li><li>Follow up on testing if required.</li><li>Attend Production handoff meeting.</li><li>Track sample ETA’s and ensure arrivals and approvals are within the allotted lead-times.</li><li>Follow up with License Dept. on approvals, art status, and PP on licensed products</li><li>Communicate approvals to Pre-Pro Dept. and Prod Dept.</li><li>Work with Garment Wash Dept. for sample needs.</li><li>Ensure account specific forms are completed and sent with packages.</li><li>Complete cost sheet and upload into Unity.</li><li>Submit CAD request for order processing.</li><li>Process production order worksheets in Unity for full package; process via email for blanks with tear away.</li><li>Submit CAD request for order processing.</li><li>Enter information into sample portal.</li><li>Order blanks.</li><li>Submit pad print request and approve details of pad prints.</li><li>Organize and maintain sample racks for internal reference.</li><li>Prepare and send approval items to the customers (i.e. lab dips, fit samples, pp samples, bulk fabric, TOP’s, etc.).</li><li>Ship out samples (PP’s, TOP’s, Ad) and items for approval (lab dips, fit, bulk submissions, etc.) with correct internal references.</li><li>Other duties may be assigned in accordance with company needs</li></ul>\n\n**What You'll Need**\n<ul><li>BA or AA in a Fashion related field preferred</li><li>3+ years’ experience in account management within the apparel industry</li><li>Detail oriented and very organized</li><li>This position must push for results and constantly follow up with others.</li><li>Good communication skills</li><li>Proficient with MS Office and Excel. Computer comfort as all tasks are done on various programs (i.e. sample portal, unity, art portal, inventory portal)</li><li>Able to work in hectic environment and with tight deadlines</li><li>Need to be able to juggle many tasks simultaneously</li><li>Ability to work until the job is done. There are often extra hours spent at end of day.</li><li>Must be self-motivated and comfortable working without constant managerial follow up</li></ul>\n\nHybrid Apparel is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.", "responsibilities": "Work closely with Sales and Senior Account Manager in conjunction with other various departments to assist in the daily functions of managing the orders and accounts.\n\nWork with Order Management to and review weekly open order and sample reports.\nAttend weekly production meetings.\nReview worksheets processed from Sales to make sure detailed information is correct (i.e. style numbers, wash, treatment details, ground colors, etc.).\nFollow up on testing if required.\nAttend Production handoff meeting.\nTrack sample ETA’s and ensure arrivals and approvals are within the allotted lead-times.\nFollow up with License Dept. on approvals, art status, and PP on licensed products\nCommunicate approvals to Pre-Pro Dept. and Prod Dept.\nWork with Garment Wash Dept. for sample needs.\nEnsure account specific forms are completed and sent with packages.\nComplete cost sheet and upload into Unity.\nSubmit CAD request for order processing.\nProcess production order worksheets in Unity for full package; process via email for blanks with tear away.\nSubmit CAD request for order processing.\nEnter information into sample portal.\nOrder blanks.\nSubmit pad print request and approve details of pad prints.\nOrganize and maintain sample racks for internal reference.\nPrepare and send approval items to the customers (i.e. lab dips, fit samples, pp samples, bulk fabric, TOP’s, etc.).\nShip out samples (PP’s, TOP’s, Ad) and items for approval (lab dips, fit, bulk submissions, etc.) with correct internal references.\nOther duties may be assigned in accordance with company needs", "qualifications": {"required": "3+ years’ experience in account management within the apparel industry, Detail oriented and very organized, This position must push for results and constantly follow up with others., Good communication skills, Proficient with MS Office and Excel. Computer comfort as all tasks are done on various programs (i.e. sample portal, unity, art portal, inventory portal), Able to work in hectic environment and with tight deadlines, Need to be able to juggle many tasks simultaneously, Ability to work until the job is done. There are often extra hours spent at end of day., Must be self-motivated and comfortable working without constant managerial follow up", "preferred": "BA or AA in a Fashion related field"}, "skills": ["Order Management", "Production", "Sales", "Communication", "Excel", "MS Office", "Sample Management", "CAD", "Unity", "Apparel Industry"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987687805"}