{"jobTitle": "Supply Chain Analyst", "company": {"name": "Akkodis", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$74,000.00/yr - $99,000.00/yr", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "IT Services and IT Consulting", "description": "This role is responsible to develop regions Lowest Landed Operating Models from Ingredient, Packaging, Conversion and Distribution of finished products. This role includes the development and implementation of Supply Chain optimization initiatives to improve overall COGS and Distribution expenses, the role must focus on delivering Productivity. The individual will work with Procurement, Finance and Operations in the development of the Business Cases, development of long-tern CAPEX programs to deliver a sustainable and reliable operating model, participate in the supplier and co-manufacturing contracts.", "responsibilities": "Lead and develop Operating Models business cases and initiatives to lower the overall Supply Chain cost.\nDeliver Productivity Initiatives.\nBuild, implement and maintain optimization tools for Supply Chain Network Planning and work with Operations to tactically implement lowest cost scenarios.\nBuild, implement and maintain optimization tools for Procurement and work with Operations to strategically implement lowest cost scenarios across global regions.\nWork cross functionally to build and implement costing scenarios for new products and new markets.\nBased on customer destinations, determine optimal distribution sites based on production costs, ideal transportation lanes and applicable duties.\nWork closely with senior leadership to strategically model dynamic sourcing scenarios for new market distribution.\nWork closely with Logistics/Freight Forwarders to understand HTS codes and tax/duty rates for new markets, based on product formulation and regulatory compliance in order to model landed costs appropriately.\nBe an expert in Tax Code, Tariff and VAT.\nWork closely with Procurement to help drive cost savings.\nWork closely with the Regional VP of SC in growth/expansion capacity planning both domestic and international.\nDuties and responsibilities may be added, deleted or modified either formally or informally, either in writing or verbally at the discretion of Management.", "qualifications": {"required": "Bachelor of Supply Chain, Finance, Economics, Mathematics, Statistics or Related Field\n5-10 years’ experience in Supply Chain costing and/or analytics\nExperience working cross-functionally\nExcellent oral and written communication skills\nAnalytical and detailed-oriented\nStrong problem-solving skills\nAbility to lead and develop a team\nStrong follow up skills\nAdvanced skill with MS Office suite, especially Excel and ideally Access and MS PowerPoint", "preferred": "SAP Experience Preferred"}, "skills": ["Supply Chain", "Costing", "Analytics", "Procurement", "Finance", "Operations", "Business Cases", "CAPEX", "Supplier Contracts", "Network Planning", "Transportation", "HTS Codes", "Tax Code", "Tariff", "VAT", "MS Office", "Excel", "Access", "MS PowerPoint", "SAP"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987286802"}