{"jobTitle": "UK PR Associate (LA Based)", "company": {"name": "Princess Polly", "industry": "Retail", "size": "Not specified", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50-68k", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail", "description": "The PR Associate will facilitate collaborations with UK based social media influencers to increase company revenue through code sales, and establish authentic relationships with influencers on behalf of Princess Polly. IF YOU ARE INTERESTED, THIS IS WHAT SUCCESS LOOKS LIKE AS OUR PR ASSOCIATE: Within 30 days you will learn the ropes of our influencer program including collaborations, negotiations, and technical/analytical tools. Within 90 days you will establish key goals and metrics with our PR Manager. Once talent is identified and a roster created, you will manage and negotiate budgets and facilitate payments. All while maintaining strong relationships with UK influencers and agents. You will accurately document and track your influencer collaborations in the PR Tracker and analyze/report on performance regularly. Collaborating with Finance, Customer Experience, and our Distribution Center teams will contribute to timely payments and deliveries, leading to success in your role. You will attend and assist PR/marketing activations and events, including off site activations when required.", "responsibilities": "Facilitate collaborations with UK based social media influencers, manage budgets, maintain relationships with influencers, document collaborations, analyze performance, assist in PR/marketing events.", "qualifications": {"required": "Bachelor’s degree preferred, 1+ years minimum of experience in influencer marketing or public relations, preferably working with UK based talent, Strong proficiency in G-Suite and social media platforms (TikTok, Instagram, YouTube) required, Ability to thrive in a fast paced, data driven environment, Positive, optimistic attitude towards problem solving, Team player", "preferred": ""}, "skills": ["Influencer Marketing", "Public Relations", "Social Media Management", "G-Suite Proficiency", "Data Analysis"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3987119684"}