{"jobTitle": "Product Marketing Manager, Google Search", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "132,000.00/yr - 196,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Engineering", "industry": "Information Services and Technology, Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Mountain View, CA, USA; San Francisco, CA, USA; New York, NY, USA**. **Minimum qualifications:**<br/><br/> <ul><li>Bachelor's degree or equivalent practical experience.</li><li>5 years of experience in product or GTM marketing, including strategy or project management.</li><li>Experience managing cross-functional or cross-team projects.<br/><br/></li></ul> **Preferred qualifications:**<br/><br/> <ul><li>MBA degree.</li><li>5 years of experience in product or GTM marketing, including strategy and project management.</li><li>Experience in drawing user insights through deep user research to inform product positioning.</li><li>Experience working with product marketing to develop GTM strategies and align on hero features and how to position those features.</li><li>Experience with AI or passion for the AI space.</li><li>Excellent written work, including the ability to articulate products and features in language that is engaging and easy to understand.<br/><br/></li></ul> **About The Job**<br/><br/> Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the representation of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end.<br/><br/> In this role, you’ll be responsible to bring the Google Search's product magic to life by leading positioning and messaging work for generative AI in search. You’ll drive the user insights work and competitive analysis to inform our product experiences and narrative, ensuring our positioning is clear and differentiated. You’ll act as the source of the truth that brings together the narrative across the product experiences and external facing activities, and you'll do this efficiently and effectively through clear communication and scalable artifacts such as playbooks and messaging guidelines. This will ultimately help drive awareness and adoption of new AI features in Search and help us land great GTM moments. This work will scale across our product launches globally.<br/><br/> Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.<br/><br/> The US base salary range for this full-time position is $132,000-$196,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.<br/><br/> **Responsibilities**<br/><br/> <ul><li>Lead work to develop positioning and messaging of gen AI in Search with scalable processes and artifacts including playbooks, messaging guidance, and Go-To-Market (GTM) briefs.</li><li>Partner effectively with cross-functional partners including Product Management, Engineering, UX, and Public Relations to drive alignment on product strategy and messaging, and enable other marketing teams responsible for go-to-market, at global scale.</li><li>Ensure our products are properly represented and the narratives are cohesive in all external facing executions, and scale these efforts by proactively enabling GTM teams.</li><li>Develop user and market insights to inform our messaging and build narrative guidance. Operationalize a way to test messaging, new features and use cases on an ongoing basis, partnering closely with Marketing Insights and UX Researchers.</li><li>Measure the success of your work, share learnings and make fast improvements to drive operational efficiency.<br/><br/><br/></li></ul> Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Lead work to develop positioning and messaging of gen AI in Search with scalable processes and artifacts including playbooks, messaging guidance, and Go-To-Market (GTM) briefs.</li><li>Partner effectively with cross-functional partners including Product Management, Engineering, UX, and Public Relations to drive alignment on product strategy and messaging, and enable other marketing teams responsible for go-to-market, at global scale.</li><li>Ensure our products are properly represented and the narratives are cohesive in all external facing executions, and scale these efforts by proactively enabling GTM teams.</li><li>Develop user and market insights to inform our messaging and build narrative guidance. Operationalize a way to test messaging, new features and use cases on an ongoing basis, partnering closely with Marketing Insights and UX Researchers.</li><li>Measure the success of your work, share learnings and make fast improvements to drive operational efficiency.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n5 years of experience in product or GTM marketing, including strategy or project management.\nExperience managing cross-functional or cross-team projects.", "preferred": "MBA degree.\n5 years of experience in product or GTM marketing, including strategy and project management.\nExperience in drawing user insights through deep user research to inform product positioning.\nExperience working with product marketing to develop GTM strategies and align on hero features and how to position those features.\nExperience with AI or passion for the AI space.\nExcellent written work, including the ability to articulate products and features in language that is engaging and easy to understand."}, "skills": ["Product Marketing", "GTM", "Strategy", "Project Management", "Cross-functional", "Cross-team", "User Research", "AI", "Positioning", "Messaging", "Communication", "Playbooks", "Go-to-Market", "Product Management", "Engineering", "UX", "Public Relations", "Marketing Insights"], "postedDate": "10 hours ago", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3987932139"}