{"jobTitle": "Associate Creative Director, Art", "company": {"name": "Assembly Media, Inc", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$86,000.00 - $133,000.00", "currency": "USD"}, "jobFunction": "Public Relations, Art/Creative, and Design", "industry": "Public Relations and Communications Services and Design Services", "description": "Assembly Media, part of the Daniel J. Edelman (DJE) family of companies, has an amazing opportunity for an Associate Creative Director, Art to join its growing team. Built to thrive amid the full complexity of today's modern marketing, Edelman is the world’s largest independent communications agency. We help some of the world's most famous companies evolve, promote, and protect their brands.<br/><br/>At Assembly, we help Microsoft bring to life its mission: to help every person on the planet achieve more. We are experts in the products and offerings and tasked with helping them think beyond the product roadmap to find the best way to bring their unique stories to broad audiences. Our work is designed to capture the attention of the media landscape, and the ability to uncover a cultural tension is at the heart of our briefs. In this role, you’ll create groundbreaking, social first campaigns on one of the world’s greatest tech brands.<br/><br/>We’re looking for a creative that has a passion for pop culture, technology and social media. You’re someone who sees social trends before they are trending, and you’re eager to conceptualize, create and put things out into the world at the speed of culture. From Tiktoks to full-scale campaigns, we want someone who can take an idea from the concept to client presentation, and quickly to people’s feeds. We’re not just looking to make filler content, we want to make fun, witty, unexpected work that gets noticed. You will be joining a diverse team of creatives who are collaborative, curious, and kind.<br/><br/>Responsibilities:  <br/><br/>\n<ul><li>Work in partnership with an Associate Creative Director, Copywriter and at the direction of creative leadership to concept and plan execution of integrated campaigns and programs across a wide range of media and platforms, especially social, digital, video, experiences and content   </li><li>Create and design campaign ideas for client projects and new business pitches that are earned-first and social by design   </li><li>Work in concert with a wide range of specialties including account, strategy, project management, and influencer      </li><li>Develop tactics which bring creative concepts to life and achieve program objectives    </li><li>Manage multiple jobs simultaneously; managing and providing direction to other team members as needed  </li><li>Work closely with a project manager and production partners to schedule projects and coordinate production  </li><li>Prepare and present client creative presentations; Drive client approval process  </li><li>Work effectively with external vendors and internal colleagues to complete projects within timeframe and budget  <br/><br/><br/></li></ul>Basic Qualifications:  <br/><br/>\n<ul><li>At least 6 years experience managing day-to-day changes at every level of detail and handling them with a team oriented, entrepreneurial spirit  </li><li>A bachelor’s degree, preferably in Fine Arts, Advertising or Graphic Design <br/><br/><br/></li></ul>Particular Qualifications:<br/><br/>\n<ul><li>Experience maintaining client contact as needed and assist with budget and schedule development  </li><li>Ability to prioritize and manage work, adhering to critical project timelines in a fast-paced environment  </li><li>At least 6 years’ creative experience  </li><li>Previous roles in Advertising or Graphic Design, a portfolio of ideas and executions demonstrating strong layout and composition with a keen eye for typography and motion    </li><li>A professional-level mastery of industry standard design software and tools including the full suite of Adobe Creative Cloud    </li><li>Production experience in art direction and design for video, digital and social platforms  </li><li>Experience in influencer and or community management a plus  </li><li>Pride in your previous work and the ability to speak to it clearly and concisely during the interview process <br/><br/><br/></li></ul>$86,000 - $133,000 a year<br/><br/>An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.<br/><br/>Assembly is an integrated agency providing purpose-built communications to Microsoft – bringing strategy, creative, research, social and digital, and influencer marketing together to drive tangible business results and advance Microsoft’s mission to empower every person and organization on the planet to achieve more.<br/><br/>We advocate for ideas based on real audience insights and sound strategic opportunities and bring them to life with creative executions that earn attention. We are the team behind some of Microsoft’s most exciting work across Surface, Xbox, M365, and Windows to name a few. We are the lead agency for the Microsoft brand across social; the global PR agency of record for Xbox; and the influencer agency of record for Xbox, Surface, M365 and Windows. Assembly is also a strategic partner for executive communications across Microsoft Store and several executives across the company.<br/><br/>Our results are a direct reflection of our culture and people – we believe that bringing together diverse perspectives enhance creativity and innovation, and we embrace and celebrate differences both in our organization and through our work. We’ve partnered with Microsoft for 27 years, across 17 countries around the world. Come be a part of our collective story as we partner with Microsoft to enable each other to achieve more.<br/><br/>Assembly Media was founded in 2014 under DJE Holdings to exclusively service Microsoft. In 2019 our parent agency, Edelman, was recognized by AdAge as one of the top 10 creative companies in the U.S. and recognized as a 2019 Best Place to Work.<br/><br/>Assembly is committed to diversity, equity and inclusion and proud to be an equal opportunity employer. We welcome and encourage racially and ethnically diverse people, members of the LGBTQ community, veterans, parents, individuals with disabilities and members of any and all protected classes to apply.<br/><br/>", "responsibilities": "Work in partnership with an Associate Creative Director, Copywriter and at the direction of creative leadership to concept and plan execution of integrated campaigns and programs across a wide range of media and platforms, especially social, digital, video, experiences and content   Create and design campaign ideas for client projects and new business pitches that are earned-first and social by design   Work in concert with a wide range of specialties including account, strategy, project management, and influencer      Develop tactics which bring creative concepts to life and achieve program objectives    Manage multiple jobs simultaneously; managing and providing direction to other team members as needed  Work closely with a project manager and production partners to schedule projects and coordinate production  Prepare and present client creative presentations; Drive client approval process  Work effectively with external vendors and internal colleagues to complete projects within timeframe and budget  <br/><br/><br/>", "qualifications": {"required": "At least 6 years experience managing day-to-day changes at every level of detail and handling them with a team oriented, entrepreneurial spirit  A bachelor’s degree, preferably in Fine Arts, Advertising or Graphic Design <br/><br/><br/>", "preferred": "Experience maintaining client contact as needed and assist with budget and schedule development  Ability to prioritize and manage work, adhering to critical project timelines in a fast-paced environment  At least 6 years’ creative experience  Previous roles in Advertising or Graphic Design, a portfolio of ideas and executions demonstrating strong layout and composition with a keen eye for typography and motion    A professional-level mastery of industry standard design software and tools including the full suite of Adobe Creative Cloud    Production experience in art direction and design for video, digital and social platforms  Experience in influencer and or community management a plus  Pride in your previous work and the ability to speak to it clearly and concisely during the interview process <br/><br/><br/>"}, "skills": ["Adobe Creative Cloud", "Social Media", "Digital Marketing", "Art Direction", "Graphic Design", "Video Production", "Campaign Management", "Client Management", "Project Management", "Teamwork", "Communication", "Presentation Skills", "Problem Solving", "Time Management", "Budgeting", "Influencer Marketing"], "postedDate": "2 days ago", "benefits": "An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987644042"}