{"jobTitle": "Administrative Assistant III, Global Partnerships", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA", "industry": "Entertainment Providers"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "63,232.00/yr - 79,040.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "We are looking for an Administrative Assistant who can provide full range of support for three SVPs including handling phones, calendar, filing, meeting coordination, travel arrangements, handling correspondence.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Handle all administrative duties for three SVPs including managing calendars, answering phones, monthly expense reports, organizing conference calls and meetings, setting up domestic and international travel, drive-ons, etc.</li><li>Managing access for internal creative systems</li><li>Work with Legal on drafting NDAs for partners</li><li>Update data bases, lists, and sales/pitch decks as needed. Manage MediaBox access for domestic partners and exhibitors – save and file NDAs from portal</li><li>Research various Partnership related topics including competitive partnerships, new potential partners</li><li>Create Purchase Orders for incoming invoices as well as fulfill any new Vendor Requests/ track creative spend and budget</li><li>Coordinate scheduling with filmmakers for international virtual summits; manage Zoom waiting room; recording.</li><li>Work with the Story Department to get script access for partners</li><li>Create turnover documents for incoming Domestic deals</li><li>Help onboard new hires, interns and consultants -</li><li>Handle the meeting schedules for conferences/tradeshows and assist in preparation</li><li>Participate in brainstorms – Problem solve creative challenges &amp; brainstorm promotional ideas for potential partners</li><li>Miscellaneous departmental duties as required</li><li>Take meeting notes as required<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree required or relevant work experience preferred</li><li>Comfortable working with PowerPoint, Keynote, Outlook, Adobe, Excel, Photoshop</li><li>Exceptional organizational and communication skills</li><li>Must be thorough<br/><br/></li></ul>The anticipated base salary for this position is $63,232 to $79,040. This role may also qualify for annual incentive and/or comprehensive benefits. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, and if applicable, the location of the position.<br/><br/>Sony Pictures Entertainment is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, age, sexual orientation, gender identity, or other protected characteristics.<br/><br/>To request an accommodation for purposes of participating in the hiring process, you may contact us at SPE_Accommodation_Assistance@spe.sony.com.", "responsibilities": "Handle all administrative duties for three SVPs including managing calendars, answering phones, monthly expense reports, organizing conference calls and meetings, setting up domestic and international travel, drive-ons, etc. Managing access for internal creative systems Work with Legal on drafting NDAs for partners Update data bases, lists, and sales/pitch decks as needed. Manage MediaBox access for domestic partners and exhibitors – save and file NDAs from portal Research various Partnership related topics including competitive partnerships, new potential partners Create Purchase Orders for incoming invoices as well as fulfill any new Vendor Requests/ track creative spend and budget Coordinate scheduling with filmmakers for international virtual summits; manage Zoom waiting room; recording. Work with the Story Department to get script access for partners Create turnover documents for incoming Domestic deals Help onboard new hires, interns and consultants - Handle the meeting schedules for conferences/tradeshows and assist in preparation Participate in brainstorms – Problem solve creative challenges & brainstorm promotional ideas for potential partners Miscellaneous departmental duties as required Take meeting notes as required", "qualifications": {"required": "Bachelor's degree required or relevant work experience preferred Comfortable working with PowerPoint, Keynote, Outlook, Adobe, Excel, Photoshop Exceptional organizational and communication skills Must be thorough", "preferred": ""}, "skills": ["PowerPoint", "Keynote", "Outlook", "Adobe", "Excel", "Photoshop"], "postedDate": "1 day ago", "benefits": "This role may also qualify for annual incentive and/or comprehensive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987570054"}