{"jobTitle": "Executive Assistant, EVP Global Marketing (WB Games)", "company": {"name": "Warner Bros. Games", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Your New Role...<br/><br/></strong>The Executive Assistant will provide executive support to an EVP and VP and the administrative management of the department.<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><ul><li>Executive calendars and group meetings. Organizes and prioritizes critical issues and required information for the Executive to facilitate efficient decision making. May make decisions on behalf of Executives on the priority of the meeting requests and ensure schedules are optimized as best as possible</li><li>Schedule and manage meetings and/or conference calls as directed by Executive, including but not limited to booking rooms, catering, making copies, and arranging visitor access</li><li>Prepare draft correspondence, presentations, and analysis. Handle all materials that are needed by internal and external stakeholders such as meeting agendas, copies of documents</li><li>Plan, organize and coordinate the general operations of each Executive’s respective departments</li><li>Coordinate procurement process for technology and external staffing partnerships</li><li>Coordinate travel as needed for Executives, including accurate itinerary summaries, travel logistics, and scheduling of all transportation, hotels &amp; meetings. Provide planned itineraries well in advance of each trip. Process timely &amp; accurate expense reports for Executives after each business trip. Train new hires on internal T&amp;E processes and reconcile reimbursements as received. Manage vacation schedule for team and assist with work record approvals</li><li>Manage department expenses posted on the department P-card. Collaborate with appropriate groups as it relates to office planning, facility management, such as identifying individual work station set-up, relocation of work stations &amp; move logistics of assigned department. As part of the WBG SF administrative team, shares in the coverage of the front desk<br/><br/></li></ul><strong>Qualifications And Experience...<br/><br/></strong><ul><li>Minimum 3 years experience providing executive administrative support</li><li>Able to adapt to changing priorities and deadlines</li><li>Must have strong interpersonal and organizational skills<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $63,001.00 - $117,002.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "The Executive Assistant will provide executive support to an EVP and VP and the administrative management of the department.", "qualifications": {"required": "Minimum 3 years experience providing executive administrative support, Able to adapt to changing priorities and deadlines, Must have strong interpersonal and organizational skills"}, "skills": [], "postedDate": "8 hours ago", "benefits": "Pay Range: $63,001.00 - $117,002.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "remoteWork": "No", "salary": {"amount": "63,001.00 - 117,002.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3987651288"}