{"jobTitle": "Field Sales and Education Manager - West Region", "company": {"name": "E.L.F. BEAUTY", "industry": "Personal Care Product Manufacturing", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "95,000.00/yr - 110,000.00/yr", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Personal Care Product Manufacturing", "description": "<strong>About The Company<br/><br/></strong>e.l.f. Beauty, Inc. stands with every eye, lip, face and paw. Our deep commitment to clean, cruelty free beauty at an incredible value has fueled the success of our flagship brand e.l.f. Cosmetics since 2004 and driven our portfolio expansion. Today, our multi-brand portfolio includes e.l.f. Cosmetics, e.l.f. SKIN, pioneering clean beauty brand Well People, Keys Soulcare, a groundbreaking lifestyle beauty brand created with Alicia Keys and Naturium, high-performance, biocompatible, clinically-effective and accessible skincare.<br/><br/>In our Fiscal year 24, we had net sales of $1 Billion and our business performance has been nothing short of extraordinary with 22 consecutive quarters of net sales growth. We are the #2 mass cosmetics brand in the US and are the fastest growing mass cosmetics brand among the top 5. Our total compensation philosophy offers every new hire competitive pay and benefits, bonus eligibility (200% of target over the last four fiscal years), equity given to every full-time employee as a part of their new hire package, flexible time off, year-round half-day Fridays, and a hybrid 3 day in office, 2 day at home work environment. We believe the combination of our unique culture, total compensation, workplace flexibility and care for the team is unmatched across not just beauty but any industry.<br/><br/>Position Summary<br/><br/>The Field Sales Manager, West Region will lead the field execution of strategic business initiatives across all e.l.f. Beauty Brands including – e.l.f. Cosmetics, e.l.f. Skin, Well People and Naturium across retail stores in the West Region.<br/><br/>Key responsibilities include delivering retail sales goals, coaching and developing a team of Market Managers and Brand Specialists, building retailer partnerships, and driving brand market share while increasing our overall productivity.<br/><br/>The Sales Manager also owns organizational leadership and will be able to partner with all cross functional partners both internally and externally.<br/><br/>Responsibilities:<br/><br/>Retail Sales<br/><br/><ul><li> Achieve retail targets striving to improve brand ranking across country</li><li> Analyze sales weekly and identify business opportunities</li><li> Successfully execute brand and retailer promotional calendars at market &amp; door level</li><li> Review/Build team visit calendars prioritizing top doors</li><li> Sell side by side retailer partners &amp; selling team providing the best customer experience</li><li> Develop strong relationships with retailer leadership team, selling staff and other brand reps</li><li> Conduct Brand Business Reviews with retailer/store leadership &amp; build collaborative strategies to meet all goals</li><li> Ensure strong visual merchandising standards and brand presentation, elevate any inventory challenges</li><li> Execute monthly sales driven events to increase brand awareness and drive retail</li><li> Provide support for events wherever needed<br/><br/><br/></li></ul>Education &amp; On-Boarding<br/><br/><ul><li> Train and on-board new Market Managers and Brand Specialists on products, sales techniques, and Bullhorn</li><li> Execute best in class trainings at store level to increase store teams’ love for all e.l.f. Cosmetics Brands</li><li> Facilitate trainings as required to introduce new products</li><li> Provide excellent and courteous customer service to all partners internally and externally</li><li> Educate every day on the sales floor including store teams and customers<br/><br/><br/></li></ul>Management<br/><br/><ul><li> Review sales results weekly with sales team to monitor goal progress. If necessary, coach additional strategies to achieve sales goals</li><li> Continuous recruitment and development of sales team. Review and monitor their performance making changes in personnel when necessary</li><li> Establish relationships and communicate regularly with retailer management team to discuss brand performance and initiatives to surpass sales objectives at each point of sale</li><li> Laser focus organization of retailer training gratis, TOA’s and GWPs</li><li> Responsible for sending recaps of all events with successes and opportunities within 48 hours of event completion</li><li> Based on event performance, adjust staffing needs as necessary in the moment</li><li> Field Sales Managers are expected to be in-store 4 days each week, with 1 office day per week. Working days are Monday through Friday. During launch, holiday and promotional timeframes, Saturdays may be require<br/><br/><br/></li></ul>Additional Responsibilities:<br/><br/><ul><li> Work within Company expense budgets, following established guidelines and procedures</li><li> Additional duties may be assigned as needed, depending on skill set, market trends, and business needs</li><li> Ability to travel 50-70% of the time, including overnights and to brand conferences and events several times each year<br/><br/><br/></li></ul>Communication<br/><br/><ul><li> Communicate with FSD at least once weekly; collaborate on scheduled and objectives for the week/month</li><li> Communicate at least once bi-weekly with all team member to review objectives vs. performance</li><li> Alert FSD, Account Directors and retailer of all out of stocks as they occur</li><li> Provide all competitive activity to FSD weekly</li><li> Inform the store team of all seasonal activities (direct mail, catalog) well in advance to ensure proper set-up and preparation<br/><br/><br/></li></ul>Requirements:<br/><br/><ul><li> 5+ years of education and sales experience within the retail cosmetics field with a solid understanding of influencing sales, product knowledge, events, and operations</li><li> Strong understanding of Ulta company policies, procedures, and culture</li><li> Effective planning, organizational and time management skills</li><li> Exceptional communication and interpersonal skills</li><li> Demonstrated ability to drive sales through fostering relationships and providing exceptional brand partnership</li><li> Ability to work independently to prioritize and achieve results<br/><br/><br/></li></ul>This job description is intended to describe the general nature and level of work being performed in this position. It also reflects the general details considered necessary to describe the principal functions of the job identified, and shall not be considered, as detailed description of all the work required inherent in the job. It is not an exhaustive list of responsibilities, and it is subject to changes and exceptions at the supervisors’ discretion.<br/><br/>e.l.f. Beauty respects your privacy. Please see our Job Applicant Privacy Notice (www.elfbeauty.com/us-job-applicant-privacy-notice) for how your personal information is used and shared.", "responsibilities": "The Field Sales Manager, West Region will lead the field execution of strategic business initiatives across all e.l.f. Beauty Brands including – e.l.f. Cosmetics, e.l.f. Skin, Well People and Naturium across retail stores in the West Region.<br/><br/>Key responsibilities include delivering retail sales goals, coaching and developing a team of Market Managers and Brand Specialists, building retailer partnerships, and driving brand market share while increasing our overall productivity.<br/><br/>The Sales Manager also owns organizational leadership and will be able to partner with all cross functional partners both internally and externally.", "qualifications": {"required": "5+ years of education and sales experience within the retail cosmetics field with a solid understanding of influencing sales, product knowledge, events, and operations\nStrong understanding of Ulta company policies, procedures, and culture\nEffective planning, organizational and time management skills\nExceptional communication and interpersonal skills\nDemonstrated ability to drive sales through fostering relationships and providing exceptional brand partnership\nAbility to work independently to prioritize and achieve results"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Our total compensation philosophy offers every new hire competitive pay and benefits, bonus eligibility (200% of target over the last four fiscal years), equity given to every full-time employee as a part of their new hire package, flexible time off, year-round half-day Fridays, and a hybrid 3 day in office, 2 day at home work environment.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987329870"}