{"jobTitle": "Manager, Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "About The Team<br/><br/>DoorDash Drive is our company’s hypergrowth fulfillment platform serving restaurants, grocers, and retailers. DoorDash Drive allows restaurants, grocers, and retailers to enable ecommerce fulfillment for their first-party experiences. As part of the Drive Restaurants Strategy &amp; Operations team, the Manager will have the opportunity to lead, define, test, and scale Drive’s most profitable bets.<br/><br/>This is a rare opportunity for people who are excited about joining a fast-paced start-up and building something great! We’re looking for hustle, smarts, and deep market knowledge to enable us to best serve our consumers, Dashers, and merchants. Join our never-ending pursuit to better power economies in the US and across the globe.<br/><br/>About The Role<br/><br/>DoorDash is looking for a Manager to build and execute strategic initiatives to grow the Drive Restaurant verticals business. The DoorDash Drive team is responsible for the operations, development, and growth of the Drive product suite: our white-label solution that empowers Merchants to offer their own customers on-demand delivery through their own channels, utilizing DoorDash’s logistics network.<br/><br/>As a key member of the Restaurants verticals Drive Team, you’ll develop and deliver the growth strategy in the sector in a commercially viable way, be responsible for operational and financial metrics, build and scale processes to support fast onboarding of merchants, and empower sales teams to effectively sell Drive products and manage merchants.<br/><br/>On a typical day, you may create merchant growth strategies, run experiments to improve quality and catering delivery operations, use learnings to inform product strategy, dive into data to explain performance at the lowest level of detail and make sure we never stop growing. The ideal candidate for this role should be a self-starter with an entrepreneurial mindset, able to take ownership and create plans from scratch, and drive execution while obtaining cross-functional buy-in to achieve DoorDash Drive's strategic goals.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Strategise – Devise and execute the overall operational strategy for winning the same </li><li>Influence – Work cross-functionally with our Operations, Product, Engineering, Business Operations, Sales, Account Management, and BD teams to grow our business</li><li>Own the Market – You are ultimately responsible for hitting top line and profitability goals for your market segment. You must be able to diagnose &amp; address problems quickly, have foresight into potential issues and lead your team in hitting goals</li><li>Analyze – Build analysis to understand the segment’s strengths and weaknesses, competitive pressures and opportunity areas</li><li>Experiment – Use a data-driven approach and regional knowledge to identify improvement opportunities, run tests, and make our business 1% better everyday<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You have 6+ years of experience in consulting, strategy, operations, technology, banking, analytics or related experience</li><li>You have experience leading projects, hitting goals, and succeeding in a team environment</li><li>You oscillate easily from strategic considerations to tactical execution </li><li>You communicate precisely dependent on audience and level of detail necessary to share </li><li>You have Excel (can perform complex functions and modeling) and SQL knowledge (basic)</li><li>You are a problem solver – You have a talent for managing complex projects, driving high-level goals into actionable plans, and enjoy implementing processes</li><li>You are a relationship-builder – You can influence and motivate people at all levels across a variety of job functions<br/><br/></li></ul>We expect this position to be filled by 7/14/2024.<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$121,700—$179,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Strategise – Devise and execute the overall operational strategy for winning the same \nInfluence – Work cross-functionally with our Operations, Product, Engineering, Business Operations, Sales, Account Management, and BD teams to grow our business\nOwn the Market – You are ultimately responsible for hitting top line and profitability goals for your market segment. You must be able to diagnose &amp; address problems quickly, have foresight into potential issues and lead your team in hitting goals\nAnalyze – Build analysis to understand the segment’s strengths and weaknesses, competitive pressures and opportunity areas\nExperiment – Use a data-driven approach and regional knowledge to identify improvement opportunities, run tests, and make our business 1% better everyday", "qualifications": {"required": "You have 6+ years of experience in consulting, strategy, operations, technology, banking, analytics or related experience\nYou have experience leading projects, hitting goals, and succeeding in a team environment\nYou oscillate easily from strategic considerations to tactical execution \nYou communicate precisely dependent on audience and level of detail necessary to share \nYou have Excel (can perform complex functions and modeling) and SQL knowledge (basic)\nYou are a problem solver – You have a talent for managing complex projects, driving high-level goals into actionable plans, and enjoy implementing processes\nYou are a relationship-builder – You can influence and motivate people at all levels across a variety of job functions"}, "skills": ["Strategy", "Operations", "Consulting", "Technology", "Banking", "Analytics", "Project Management", "Teamwork", "Communication", "Excel", "SQL"], "postedDate": "3 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "salary": {"amount": "121,700—$179,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987288023"}