{"jobTitle": "SAINT LAURENT Assistant Store Director Century City Bloomingdales", "company": {"name": "Saint Laurent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Regular", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "80,000 – 90,000", "currency": "USD"}, "jobFunction": "Management and Customer Service", "industry": "Retail, Retail Luxury Goods and Jewelry, and Retail Apparel and Fashion", "description": "Founded in 1961, Yves Saint Laurent was the first couture house to introduce the concept of luxury prêt-à-porter in a 1966 collection called ‘Rive Gauche’, synonymous with youth and freedom. This shift represented a first critical step in the modernization of fashion and revolutionized the socio- cultural landscape.In 1999, the luxury goods division of the Kering Group acquired Yves Saint Laurent and, under the creative direction of Anthony Vaccarello since April2016, continues to position the house at the summit of the luxury universe.Today, Saint Laurent collections include women’s and men’s ready-to-wear, shoes, handbags, small leather goods, jewelry, scarves, ties and eyewear.<br/><br/>We are currently seeking an Assistant Store Director who will report to the Store Director as part of our dynamic team.<br/><br/>You will lead the Department Manager and store sales team to meet and exceed all sales goals and KPI’s. You will also be responsible for promoting brand engagement to customers, in order to guarantee the quantitative and qualitative goals assigned.<br/><br/>Ensure professional growth and training of the staff with a coaching approach<br/>Define targeted quantitative and qualitative goals and ensure they are achieved<br/>Assist the SD in overseeing floor coverage, driving sales, visual merchandising, customer service and operational functions within the store<br/>Be the training ambassador for all training needs<br/>Build a network of people who have an impact on local and international luxury business in order to promote customer loyalty<br/><br/>Significant experience in the sale of luxury goods or retail<br/>2 to 4 years of successful experience in a managerial retail position<br/>Excellent time management skills<br/>Bachelor’s Degree preferred<br/>Knowledge of Concur expense reporting is a plus<br/><br/>A reasonable estimate of the base compensation range for this position is $80,000 – 90,000 with bonus eligibility.<br/><br/>Saint Laurent is committed to building a diverse workforce. We believe diversity in all its forms – gender, age, nationality, culture, religious beliefs and sexual orientation – enriches the workplace. It opens up opportunities for people to express their talent, both individually and collectively and it helps foster our ability to adapt to a changing world. As an Equal Opportunity Employer, we welcome and consider applications from all qualified candidates, regardless of their background.<br/><br/>Job Type<br/>Regular<br/>Start Date<br/>2024-09-01<br/>Schedule<br/>Full time<br/>Organization<br/>YSL America Holding Inc.", "responsibilities": "You will lead the Department Manager and store sales team to meet and exceed all sales goals and KPI’s. You will also be responsible for promoting brand engagement to customers, in order to guarantee the quantitative and qualitative goals assigned.", "qualifications": {"required": "Significant experience in the sale of luxury goods or retail\n2 to 4 years of successful experience in a managerial retail position\nExcellent time management skills", "preferred": "Bachelor’s Degree preferred\nKnowledge of Concur expense reporting is a plus"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987105769"}