{"jobTitle": "UC Riverside Operations Manager", "company": {"name": "Barnes & Noble College", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Introduction <br/><br/></strong>Barnes & Noble College is a retail partner for nearly 800 colleges and universities nationwide. We offer a retail environment like no other – uniquely focused on delivering essential educational content, tools, and merchandise within a dynamic retail environment on campuses of higher education. Our teams interact directly with our customers including students, faculty, administration, alumni, and the general public to provide outstanding customer service to sell or rent books, general merchandise, and an array of products and services for an academic community.<br/><br/><strong>Overview<br/><br/></strong>Barnes & Noble College is seeking a resourceful, driven, adaptable, and customer-focused team member to work as a Department Manager. The Department Manager must be knowledgeable about department and store operations, to provide outstanding customer service to the academic and co-curricular community. You will ensure that your area of responsibility is maintained, properly merchandised, and operationally sound.<br/><br/><strong>Responsibilities<br/><br/></strong>As a Department Manager you will support all store operations and departments in partnership with the management team. You will provide direct oversight of one or more departments in the store or for specified operational functions. You must be knowledgeable about department and store operations, provide outstanding customer service to the academic and co-curricular community and ensure that your area of responsibility is maintained, properly merchandised and operationally sound.<br/><br/><strong>Expectations:<br/><br/></strong><ul><li>Assist in the daily operation of the store in partnership with the Store Manager, Assistant Store Manager and the management team.</li><li>Act as the Manager-on-Duty and maintain a working knowledge of all departments in the store to provide daily support, direction, and guidance to customers and team members to ensure compliance with all standards of operation.</li><li>Utilize analytical skills and knowledge of the campus you support to best manage the day to day operations and make decisions.</li><li>Assist with assigning work and providing focused direction to team members to manage and accomplish multiple projects to ensure the proper execution of the workload.</li><li>Maintain a presence on the sales floor to greet customers, answer questions, and assist with purchases of textbooks, merchandise, or services when necessary.</li><li>Maintain an appealing sales floor—tag, shelf, arrange, clean, and organize product or space within the store.</li><li>Assist with processing sales transactions involving cash, credit, or financial aid payments as needed.</li><li>Full-time positions require availability to work at least 30 hours on a weekly basis year round. Schedules may be set or vary to meet the needs of the store.<br/><br/></li></ul><strong>Physical Demands:<br/><br/></strong><ul><li>Frequent movement within the store to access various departments, areas, and/or products.</li><li>Ability to remain in a stationary position for extended periods.</li><li>Frequent lifting.</li><li>Occasional reaching, stooping, kneeling, crouching, and climbing ladders.<br/><br/></li></ul><strong>California Pay Transparency Information (Only applicable in California stores):<br/><br/></strong>Pay: Department Manager pay range $19.00 – $26.25/hour.<br/><br/><strong>Benefits available include:<br/><br/></strong><ul><li>Medical, Dental and Vision Insurance</li><li>Life Insurance</li><li>Short term and Long Term disability</li><li>Eligibility to participate in a 401k (after the completion of 1000 hours worked in a 12 month period)</li><li>Paid Time Off (Vacation, Sick and Flex Days)</li><li>Commuter Benefits</li><li>Employee Assistance Program</li><li>Employee Discount<br/><br/></li></ul>Eligibility for each plan may include a waiting period and may require the employee to enroll during a stated eligibility period.<br/><br/><strong>COVID-19 Considerations:<br/><br/></strong>Our stores comply with all applicable federal, state and local requirements and/or recommendations regarding social distancing and sanitizing. In accordance with individual campus requirements, positions may require confirmation of vaccination. The use of face masks throughout the day and while on campus may also be expected or required.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>2+ years’ experience in a retail setting as a manager or buyer preferred or a graduate of the Best Seller Program.</li><li>High school diploma/GED required.</li><li>Outstanding customer service skills to match customers to products that meet their needs.</li><li>Basic reading, writing and accounting skills required.</li><li>Excellent customer service and communication skills needed.</li><li>Strong interpersonal, communication, and problem solving skills.</li><li>Ability to work a flexible schedule including evenings, weekends, and holidays.<br/><br/></li></ul><strong> EEO Statement <br/><br/></strong><strong>Barnes & Noble College is an Equal Employment Opportunity and Affirmative Action Employer committed to diversity in the workplace. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.</strong>", "responsibilities": "As a Department Manager you will support all store operations and departments in partnership with the management team. You will provide direct oversight of one or more departments in the store or for specified operational functions. You must be knowledgeable about department and store operations, provide outstanding customer service to the academic and co-curricular community and ensure that your area of responsibility is maintained, properly merchandised and operationally sound.", "qualifications": {"required": "High school diploma/GED required.", "preferred": "2+ years’ experience in a retail setting as a manager or buyer preferred or a graduate of the Best Seller Program."}, "skills": ["Customer Service", "Retail", "Management"], "postedDate": "5 hours ago", "benefits": "Medical, Dental and Vision Insurance, Life Insurance, Short term and Long Term disability, Eligibility to participate in a 401k (after the completion of 1000 hours worked in a 12 month period), Paid Time Off (Vacation, Sick and Flex Days), Commuter Benefits, Employee Assistance Program, Employee Discount", "remoteWork": "No", "salary": {"amount": "19.00 – 26.25/hour", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3987104548"}