{"jobTitle": "Associate Brand Manager, Premium Fashion", "company": {"name": "Amazon", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing, Supply Chain, and Information Technology", "industry": "Software Development", "description": "Amazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon continues to grow and evolve as a world-class e-commerce platform. We set big goals and are looking for people who can help us reach and exceed them by working with suppliers to enhance our selection and maximize product availability.\n\nWe are looking for a strong Associate Brand Manager (ABM) to join Amazon Fashion's exciting and fast-paced team to on-board and manage strategic corporate priority selling partners within Premium Fashion.\n\nAmazon Fashion is building a team to support the growth of Premium Fashion in our stores. The Premium Fashion ABM will work closely with premium brands to grow their selection and enhance their brand storytelling through new onsite experiences, while helping define the shopping experience for all Premium Fashion customers. In this role, the ABM will build strategies for sustained long term growth, aid brands in driving improved operational performance, and develop programs that scale.\n\nA successful candidate will be motivated by an entrepreneurial, fast-paced and highly collaborative environment, have high quality standards, and be passionate about delivering best-in-class experiences for customers. They should also have a demonstrated ability to think strategically and analytically about a business, with the ability to build clear processes in the face of ambiguous circumstances, and work cross-organizationally to build consensus.\n\nA keen sense of ownership, drive, and ability to take ownership of execution end to end is a must.\n\n**Your Key Responsibilities Will Include**\n\n<ul><li> Building strong and sustainable relationships with key brand and internal partner team contacts (8 Priority Premium Brands)</li><li> Managing brand growth on Amazon, focusing on key inputs (catalog, customer CX, imagery on-site, buying execution) to drive the long-term success of each business</li><li> Creating playbook processes to define, simplify, improve, and expedite Premium brand growth</li><li> Creating Joint Business Plans with Premium vendors on an annual basis, then conducting business reviews with senior management regarding progress and roadblocks</li><li> Continuously seeking information to improve the customer experience and make recommendations to the business</li><li> Influencing partner teams to enhance tools and systems based on program findings<br/><br/></li></ul>**About The Team**\n\nYou will be joining a team of 5 Vendor Managers and Associate Vendor Managers on the Premium Fashion Concierge (PFC) Team. The PFC team was created in 2022 with the vision of improving brand experience for Premium selling partners when working with Amazon.\n\n**Basic Qualifications**\n\n<ul><li> 1+ years of account management, project or program management or buying experience</li><li> Bachelor's degree</li><li> Experience using Excel and other business analytic tools<br/><br/></li></ul>**Preferred Qualifications**\n\n<ul><li> Experience with software and editing tools (including HTML, Excel and SQL)</li><li> Experience in online retail</li><li> Experience using analytical specific tools such as Google Analytics, SQL or HTML<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $48,300/year in our lowest geographic market up to $103,400/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\n<br/><br/><br/>**Company** - Amazon.com Services LLC<br/><br/>Job ID: A2715615", "responsibilities": "Building strong and sustainable relationships with key brand and internal partner team contacts (8 Priority Premium Brands)\nManaging brand growth on Amazon, focusing on key inputs (catalog, customer CX, imagery on-site, buying execution) to drive the long-term success of each business\nCreating playbook processes to define, simplify, improve, and expedite Premium brand growth\nCreating Joint Business Plans with Premium vendors on an annual basis, then conducting business reviews with senior management regarding progress and roadblocks\nContinuously seeking information to improve the customer experience and make recommendations to the business\nInfluencing partner teams to enhance tools and systems based on program findings", "qualifications": {"required": "1+ years of account management, project or program management or buying experience\nBachelor's degree\nExperience using Excel and other business analytic tools", "preferred": "Experience with software and editing tools (including HTML, Excel and SQL)\nExperience in online retail\nExperience using analytical specific tools such as Google Analytics, SQL or HTML"}, "skills": ["Account Management", "Project Management", "Program Management", "Buying", "Excel", "HTML", "SQL", "Google Analytics"], "postedDate": "1 day ago", "salary": {"amount": "48,300.00/year - 103,400.00/year", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987824195"}