{"jobTitle": "Regional Sales Manager - San Diego/LA Region", "company": {"name": "Schwan's Company", "location": "Los Angeles, CA", "industry": "Food and Beverage Services and Manufacturing"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Food and Beverage Services and Manufacturing", "description": "At Schwan’s Company, the opportunities are real, and the sky is the limit; this isn’t just a job, it’s a seat at the table. Around here, every job matters, every voice counts, and every person contributes in a big way. As part of our front lines, we look to you to execute business, build relationships, and take pride in your work because at Schwan’s, you lead the way and we value what you bring. Our passion is our food. Our secret is our people.\n\nSchwan’s Company, a U.S. affiliate of the global lifestyle company, CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Our many popular brands include Red Baron®, Tony’s®, Big Daddy’s®, Villa Prima™ and Freschetta® pizza; Pagoda® and bibigo Asian-style snacks; and Mrs. Smith’s® and Edwards® desserts. Schwan’s is a place for people with an appetite for more. To learn about joining a team where you can belong, contribute, and thrive, visit www.schwanscompany.com\n\nWe are hiring a Regional Sales Manager for our Food Service team to be home office based in Southern California - Los Angeles or San Diego area. In this role you will execute sales programs designed to increase distribution of Schwan's products into Tier 1 & 2 foodservice distributors, Tier 1 K12 Districts, and Non-Commercial accounts in the assigned geography. This is an individual contributor role reporting to the Zone Sales Manager. You will work closely with the Zone Sales Manager to coordinate and deliver results, with a focus on K-12 schools, Colleges & Universities, Healthcare facilities, Business & Industry, Recreation & other non-commercial accounts.\n\nResponsibilities\n\n* Partner with Zone Sales Manager with K12 Bids and Commodities \n* Lead and execute assigned customer events (distributor & operator)\n* Manage the various aspects of the regional business by directing the activities of distributors to achieve annual sales quotas and business goals.\n* Plan and execute “Go to Market” strategies to deliver market growth, results measured in Salesforce.com.\n* Clearly demonstrate the quality and advantage of Schwan's products to clients to gain sales and account penetration.\n* Analyze sales statistics to determine sales potential, inventory requirements and customer preferences.\n* Partner with our Corporate Distribution Team to execute annual plans locally within market area\n* Quote prices and credit terms, prepare sales contracts, plan and prepare sales presentations and execute promotional events as needed.\n* Monitor and analyze sales promotion results to determine the cost effectiveness of the campaigns.\n* Manage and understand regional sales activities by preparing reports of business activities, managing expense accounts, entering new customer data and ensuring all assigned accounts are up-to date.\n* Confer with clients to provide any needed marketing & technical advice relating to our product(s) or services.\n* Develop and maintain working relationships with purchasing contacts and proactively investigate and resolve customer delivery issues.\n* Serve as primary contact with all key customers and represent the company at trade shows and association meetings to promote products and services\n* Assist Zone Sales Manager with recruiting, developing, and retaining results-oriented Sales Team members.\n* Travel: 25-50% in assigned market area. Home office based ideally in Southern California / San Diego Area. This role may require occasional support assignments in Northern California and Nevada.\n\n\nBasic Qualifications\n\n8+ years food sales experience\n\nPreferred Qualifications\n\nBachelor’s degree and 8+ years high level food or food service sales experience. Experience working with Tier 1 & 2 food service distributors, Tier 1 K12 Districts, and Non-Commercial accounts in the LA/San Diego area.\n\nKnowledge/Skills/Abilities\n\n* Demonstrated experience working across multiple foodservice channels both Commercial & non-commercial\n* Proven self-starter and results oriented individual who has demonstrated ability to deliver on sales plan goals\n* Proven ability to develop business relationships and direct sales activities.\n* Experience establishing sales quotas and planning market strategies.\n\n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin or other protected class.\n\nSalary And Benefits\n\nThe salary range for this position is 110K – 130K annually. You are also eligible to participate in an annual incentive program. At Schwan's we strive for each employee's pay at any point in their career to reflect their experiences performance and skills for their current role. The salary range for this role represents the numerous factors considered in the hiring decisions including, but not limited to, education, skills, work experience, certifications, etc. As such, pay for the successful candidate(s) could fall anywhere within the stated range. Beyond base salary, we are proud to offer a foundation of health benefits, retirement and financial wellbeing, time off programs, wellbeing support and perks.\n\nJob Type: Full-time Business Unit: Req #: 24-4202\n\n", "responsibilities": "Partner with Zone Sales Manager with K12 Bids and Commodities \nLead and execute assigned customer events (distributor & operator)\nManage the various aspects of the regional business by directing the activities of distributors to achieve annual sales quotas and business goals.\nPlan and execute “Go to Market” strategies to deliver market growth, results measured in Salesforce.com.\nClearly demonstrate the quality and advantage of Schwan's products to clients to gain sales and account penetration.\nAnalyze sales statistics to determine sales potential, inventory requirements and customer preferences.\nPartner with our Corporate Distribution Team to execute annual plans locally within market area\nQuote prices and credit terms, prepare sales contracts, plan and prepare sales presentations and execute promotional events as needed.\nMonitor and analyze sales promotion results to determine the cost effectiveness of the campaigns.\nManage and understand regional sales activities by preparing reports of business activities, managing expense accounts, entering new customer data and ensuring all assigned accounts are up-to date.\nConfer with clients to provide any needed marketing & technical advice relating to our product(s) or services.\nDevelop and maintain working relationships with purchasing contacts and proactively investigate and resolve customer delivery issues.\nServe as primary contact with all key customers and represent the company at trade shows and association meetings to promote products and services\nAssist Zone Sales Manager with recruiting, developing, and retaining results-oriented Sales Team members.\nTravel: 25-50% in assigned market area. Home office based ideally in Southern California / San Diego Area. This role may require occasional support assignments in Northern California and Nevada.", "qualifications": {"required": "8+ years food sales experience", "preferred": "Bachelor’s degree and 8+ years high level food or food service sales experience. Experience working with Tier 1 & 2 food service distributors, Tier 1 K12 Districts, and Non-Commercial accounts in the LA/San Diego area."}, "skills": ["Salesforce", "Sales", "Food Service", "Food Sales", "Business Development", "Sales Management", "Market Strategy", "Customer Service", "Relationship Building", "Sales Presentations", "Sales Analysis", "Sales Reporting", "Product Knowledge", "Marketing", "Technical Advice", "Customer Relationship Management", "Distributor Management", "Team Management", "Recruiting", "Training", "Retention"], "postedDate": "1 day ago", "benefits": "The salary range for this position is 110K – 130K annually. You are also eligible to participate in an annual incentive program. At Schwan's we strive for each employee's pay at any point in their career to reflect their experiences performance and skills for their current role. The salary range for this role represents the numerous factors considered in the hiring decisions including, but not limited to, education, skills, work experience, certifications, etc. As such, pay for the successful candidate(s) could fall anywhere within the stated range. Beyond base salary, we are proud to offer a foundation of health benefits, retirement and financial wellbeing, time off programs, wellbeing support and perks.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987613852"}