{"jobTitle": "BALENCIAGA Sales Associate |  South Coast Plaza", "company": {"name": "BALENCIAGA", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Regular", "employmentType": "Full-time", "industry": "Retail Luxury Goods and Jewelry", "jobFunction": "Customer Service, Sales, and Business Development", "description": "Job Description SummaryWe are currently seeking a Sales Associate who will report to the Store Director. \n\nYOUR OPPORTUNITY \n\nThe Balenciaga Sales Associate is responsible for providing our customers with top quality service by meeting their individual needs and expectations. This person will serve as a brand expert, promoting both the philosophy and values of Balenciaga.\n\nJob Description\n\nHOW YOU WILL CONTRIBUTE\n\n<ul><li>Ensure the achievement of individual sales and store goals, enhancing and developing the business</li><li>Provide an exceptional customer service experience and demonstrate a strong knowledge of the products as well as Balenciaga history and message in accordance with Balenciaga’s client journey</li><li>Maintain an active, accurate, and organized client book with meaningful data you have captured, contact clients regularly and provide appropriate follow-up on all sales or client requests</li><li>Procure information about current trends and fashion history and weave into selling ceremony to discuss with clients and provide advice</li><li>Participate in a team environment; foster open and constructive communication with team members, being always collaborative and proposing effective solutions</li><li>Contribute to the execution of daily operational tasks per company directives<br/><br/></li></ul>WHO YOU ARE<br/><br/><ul><li>3+ years of experience in a similar role, preferably within other retail or fashion companies</li><li>Ability to manage multiple tasks in a fast-paced and dynamic environment through excellent communication skills (both verbal and written)</li><li>Proven ability to drive results in a selling role, exceeding individual and store goals</li><li>Commercial awareness and strong business acumen through a genuine passion for the fashion industry</li><li>Strategic vision in order to develop the business and high level of personal performance<br/><br/></li></ul>COMPENSATION<br/><br/>For individuals assigned and/or hired to work in California, BALENCIAGA includes a reasonable estimate of the salary or hourly rate range for this role. This considers the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications. In addition, where a candidate falls within the disclosed range estimate may be dependent on the applicable geographic differential associated with the location in which the position may be filled.  <br/><br/>A reasonable estimate of the current hourly range is $18.00 USD to $22.00 USD.<br/><br/>WHY WORK WITH US?<br/>This is an exciting opportunity to join Balenciaga’s South Coast Plaza team as a Sales Associate who will drive the business and contribute to the brand philosophy. We invite you to become part of a team that offers possibilities to learn and grow. Balenciaga is committed to thriving your professional development within the House or in the Kering group. We empower leaders to create, build and sustain high performing teams that excel in execution. We guide every employee to reach their full potential in a stimulating and fulfilling workplace environment.<br/><br/>DIVERSITY COMMITMENT<br/>Balenciaga is committed to fostering a diverse workforce. We believe that diversity in all its forms; race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, disability, protected veteran status, or other characteristics protected by applicable law, enriches the workplace and our client experience. As an Equal Opportunity Employer, we welcome all applications and select our talents based on competencies and in alignment with our brand behaviors. Setting people for success is what we live for, and it is part of our interview process to discuss with you how to excel in our company.<br/><br/>Job Type<br/><br/>Regular<br/><br/>Start Date<br/><br/>2024-08-16<br/><br/>Schedule<br/><br/>Full time<br/><br/>Organization<br/><br/>Balenciaga America Inc.", "postedDate": "3 weeks ago", "experienceLevel": "Associate", "skills": [], "url": "https://www.linkedin.com/jobs/view/3987409612"}