{"jobTitle": "Human Resources Director", "company": {"name": "Confidential", "industry": "Retail Health and Personal Care Products and Business Consulting and Services", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$160,000.00 - $180,000.00", "currency": "USD"}, "jobFunction": "Human Resources, Supply Chain, and General Business", "industry": "Retail Health and Personal Care Products and Business Consulting and Services", "description": "<strong>Our confidential client is looking for a hands-on and experienced Director of People & Culture to join their growing team in their Los Angeles headquarters.</strong><p><br/></p><p><strong><u>Job Description: Director of People & Culture </u></strong></p><p><strong>Location</strong>: West Hollywood onsite 4x per week</p><p><strong>Salary</strong>: $160,000 - $180,000</p><p><br/></p><p>Our confidential client is looking for a hands-on and experienced Director of People & Culture to join their growing team in their Los Angeles headquarters. This role will assume leadership of a comprehensive range of HR functions, acting as the direct culture carrier and first line of employee relations. We are in builder mode and seeing an HR professional to take on a range of responsibilities that span HR benefit and payroll administration, Talent Acquisition/Retention, and recruitment strategy, as well as the development of policies, procedures, and programs. This position will be instrumental in overseeing and shaping our workplace culture, fostering an overall positive employee experience, and driving strategic business goals and programs. You’ll report directly to our C-Suite leadership team and focus on building and scaling our procedures as we grow. This position is for someone who enjoys creating process, can wear many hats in a lean environment, and overall will be a true driver of high expectations and outcomes for our firm.</p><p><br/></p><p><strong>Please submit your resume for consideration! </strong></p><p><br/></p><p><em>We will consider qualified candidates with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring. California applicants, please view our Privacy Notice here: https://careergroupcompanies.com/california-privacy-notice/.</em></p>", "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987903562"}