{"jobTitle": "Senior Director, International Sales - Beauty", "company": {"name": "Identified Talent Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$170,000.00/yr - $185,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion and Consumer Services", "description": "<strong>Overview<br/><br/></strong>The Senior Director, International Sales, reporting to the VP of International Sales, will spearhead the strategic planning and execution for expanding and enhancing the brand's presence in the UK, LATAM, and other global markets. This role focuses on developing partnerships with retailers and distributors, driving new market entry, and optimizing existing distribution channels to achieve sales targets and business growth.<br/><br/><strong>Job Details<br/><br/></strong><em>Distributors &amp; Markets<br/><br/></em><ul><li>Partner with UK retailers, LATAM, and global distributors to develop and execute comprehensive annual business plans, encompassing retail and gross sales targets, commercial agreements, promotional strategies, and marketing investments to bolster both new and core product lines.</li><li>Oversee and refine the Profit and Loss (P&amp;L) statements monthly to ensure alignment with financial objectives.</li><li>Establish and monitor Key Performance Indicators (KPIs) to enhance distributor efficiency and performance.</li><li>Share and implement best practices across all distribution markets.</li><li>Lead the strategic development of the UK market and oversee the local account management team.<br/><br/></li></ul><em>New Business Development<br/><br/></em><ul><li>Identify and evaluate new market and channel opportunities that align with the company's growth objectives.</li><li>Ensure effective communication and information flow regarding project responsibilities, timelines, and coordination across cross-functional teams.</li><li>Prepare and present monthly reports on expansion activities and project updates to senior management.</li><li>Assess the impact of changes in projects or plans on budget forecasts and develop contingency strategies.<br/><br/></li></ul><em>Reporting &amp; Analysis<br/><br/></em><ul><li>Provide regular sales reports and analyses to the VP of International Sales, including insights on best-selling products, business mix, store rankings, and sales performance versus forecasts.</li><li>Participate in weekly and monthly business reviews with the leadership team.</li><li>Engage in budget and forecast reviews with the VP of International Sales and CFO.<br/><br/></li></ul><em>Marketing &amp; Merchandising<br/><br/></em><ul><li>Stay informed about seasonal updates to in-store fixtures and collaborate with the Merchandising team to develop product assortment templates.</li><li>Communicate updates on promotional plans, assortment changes, and planograms to retailers and distributors.</li><li>Work closely with internal and external marketing teams to synchronize promotional activities, maximizing year-over-year growth and managing liabilities from previous years.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Strong analytical skills, attention to detail, and exceptional organizational and time management abilities.</li><li>Proven leadership skills with a collaborative approach, both internally and externally.</li><li>Extensive experience managing international distributors and direct-to-retail sales models.</li><li>Excellent verbal and written communication skills.</li><li>Strong negotiation capabilities and P&amp;L management proficiency.</li><li>Experience leading a team, ideally of 3 or more members.</li><li>Ability to work effectively across different time zones due to the global scope of the role.</li><li>Skilled in data analysis and translating insights into actionable business strategies.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).</li><li>Ability to interact with all organizational levels.</li><li>Bachelor’s Degree with at least 10 years of business experience in sales, including a minimum of 5 years in international sales, preferably within the beauty industry.<br/><br/></li></ul>Salary Range: $170-185k / plus bonus / full benefits + PTO<br/><br/>Location: This Senior Director, International Sales role is a US-based in either the Southern California or New York area. Remote US-based candidates will also be considered.", "responsibilities": "The Senior Director, International Sales, reporting to the VP of International Sales, will spearhead the strategic planning and execution for expanding and enhancing the brand's presence in the UK, LATAM, and other global markets. This role focuses on developing partnerships with retailers and distributors, driving new market entry, and optimizing existing distribution channels to achieve sales targets and business growth.", "qualifications": {"required": "Strong analytical skills, attention to detail, and exceptional organizational and time management abilities. Proven leadership skills with a collaborative approach, both internally and externally. Extensive experience managing international distributors and direct-to-retail sales models. Excellent verbal and written communication skills. Strong negotiation capabilities and P&amp;L management proficiency. Experience leading a team, ideally of 3 or more members. Ability to work effectively across different time zones due to the global scope of the role. Skilled in data analysis and translating insights into actionable business strategies. Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint). Ability to interact with all organizational levels. Bachelor’s Degree with at least 10 years of business experience in sales, including a minimum of 5 years in international sales, preferably within the beauty industry.", "preferred": ""}, "skills": ["Sales", "International Sales", "Business Development", "Retail", "Distribution", "Marketing", "Merchandising", "Data Analysis", "Microsoft Office Suite", "Leadership", "Communication", "Negotiation", "P&L Management"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "plus bonus / full benefits + PTO", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3987915548"}