{"jobTitle": "Senior Manager, Merchandise, Location Based Entertainment", "company": {"name": "Mattel, Inc.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$140,000 - $175,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Manufacturing, Design Services, and Entertainment Providers", "description": "CREATIVITY IS OUR SUPERPOWER. It’s our heritage and it’s also our future. Because we don’t just make toys. We create innovative products and experiences that inspire fans, entertain audiences and develop children through play. Mattel is at its best when every member of our team feels respected, included, and heard—when everyone can show up as themselves and do their best work every day. We value and share an infinite range of ideas and voices that evolve and broaden our perspectives with a reach that extends into all our brands, partners, and suppliers.<br/><br/><strong>The Opportunity:<br/></strong>The Senior Manager, Merchandise, Global Location Based Entertainment, is responsible for overseeing the Global merchandise business for LBE at Mattel. This role is responsible for the retail strategy, business development, product development, demand planning &amp; strategic vision for the global business for toy + non-toy categories within LBE. LBE has proven to be a key factor in increasing consumer engagement with our brands, and this role is integral to the success of attractions globally. The selected candidate will have an entrepreneurial spirit, with an ability to think outside the box and drive solutions. This role requires the candidate to maintain a pulse on the industry through research, networking and collaboration in order to create new opportunities, leverage trends, and work with external partners to grow the Live Events business.<br/><br/><strong>What Your Impact Will Be<br/><br/></strong><ul><li> Lead team of direct reports, maintaining a clear pulse on areas of responsibility and actively mentor and develop each team member’s skills to build strength and broaden career opportunities. </li><li>Oversee all global merchandise event activities, ensuring product arrivals, deadlines and inventory levels enable continual business activity.</li><li>Evaluate merchandise executions and react quickly to performance, trends + key takeaways which impact the larger LBE business.</li><li>Develop &amp; set global revenue projections, ensuring AOP goals are being met globally in order to achieve LBE growth goals. Drive the business with full accountability to revenue, partnerships, inventory, SKU mixes and more.</li><li>Taking ownership of account management and directly managing multiple LBE partnerships across the global portfolio of brands and experiences. </li><li>Oversee and approve pricing negotiations with suppliers + LBE partners, ensuring that margin goals are captured while delivering high quality product.</li><li>Research and develop new experiential retail models for events &amp; attractions, staying abreast of industry trends.</li><li>Oversee global demand planning for all Location Based Entertainment attractions, inputting into Mattel systems and tracking production through completion and arrival at Distribution Centers around the world</li><li>Diligently manage timelines, ensuring that launches are being met in tandem with operational attraction timelines &amp; needs</li><li>Lead all internal cross functional team meetings, expertly collaborating across a large organization to achieve LBE goals. Teams range from marketing, supply chain, customer service &amp; more.</li><li>Develop and maintain a thorough competency for all Mattel brands &amp; all Mattel branded attractions &amp; experience; understanding the target consumers and driving merchandise mixes based on varying attraction goals.<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>8-10 years of experience working in Project Management and business development, preferably within Location Based Entertainment</li><li>Leadership experience guiding and motivating hard-working teams with an excellent track record of achievement, advancement, and performance</li><li>Ability to synthesize financial information into a concise story and communicate the story to various levels of leadership</li><li>Demonstrable experience of product planning, demand planning, SKU management, inventory management &amp; partnership management</li><li>Ability to take ownership of projects, see projects through completion and deliver on deadline.</li><li>To be a flexible member of the team and the ability to develop and nurture strong relationships both internally and externally.</li><li>Ability to react and drive solutions in rapidly changing situations with flexibility, clarity and patience, structured and clear communicator with ability to react positively to all challenges. Excellent interpersonal skills and written and verbal communication is essential.</li><li>Advanced proficiency with Microsoft Outlook, Word, Excel, and PowerPoint is essential for use in project management, deck creation and some financial tracking.</li><li>Business acumen, Initiative and the desire to always go the extra mile.</li><li>Ability to multi-task and prioritize effectively in a pressurized, changing environment.</li><li>Can work independently and with a team.</li><li>Forward thinker; creative problem-solving &amp; solution oriented thinker is very important.</li><li>Occasional travel is required as part of this role. <br/><br/></li></ul>The annual base salary range for this position is between $140,000 and $175,000.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>Don’t meet every single requirement? At Mattel we are dedicated to building a diverse and inclusive workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.<br/><br/><strong>How We Work<br/><br/></strong>We are a purpose driven company aiming to empower generations to explore the wonder of childhood and reach their full potential. We live up to our purpose employing the following behaviors<br/><br/><ul><li>We collaborate Being a part of Mattel means being part of one team with shared values and common goals. Every person counts and working closely together always brings better results. Partnership is our process and our collective capabilities is our superpower.</li><li>We innovate At Mattel we always aim to find new and better ways to create innovative products and experiences. No matter where you work in the organization, you can always make a difference and have real impact. We welcome new ideas and value new initiatives that challenge conventional thinking.</li><li>We execute We are a performance-driven company. We strive for excellence and are focused on pursuing best-in-class outcomes. We believe in accountability and ownership and know that our people are at their best when they are empowered to create and deliver results.<br/><br/></li></ul><strong>Our Approach to Flexible Work:<br/></strong>We embrace a flexible work model designed to empower a culture of growth, optimism, and wellbeing, where every employee can reach their full potential. Combining purposeful in-person collaboration with flexibility, our focus is to optimize performance and drive connection for moments that matter.<br/><br/><strong>Who We Are<br/><br/></strong>Mattel is a leading global toy and family entertainment company and owner of one of the most iconic brand portfolios in the world. We engage consumers and fans through our franchise brands, including Barbie, Hot Wheels, Fisher-Price, American Girl, Thomas &amp; Friends, UNO, Masters of the Universe, Matchbox, Monster High, MEGA and Polly Pocket, as well as other popular properties that we own or license in partnership with global entertainment companies. Our offerings include toys, content, consumer products, digital and live experiences. Our products are sold in more than 195 countries in collaboration with the world’s leading retail and ecommerce companies.<br/><br/>Mattel is recognized as a Great Place to Work™ and as one of Fast Company’s Best Workplaces for Innovators in 2022.<br/><br/>Visit us at https //jobs.mattel.com/ and www.instagram.com/MattelCareers .<br/><br/>Mattel is an Affirmative Action/Equal Opportunity Employer where we want you to bring your authentic self to work every day. We welcome all job seekers including minorities, females, veterans, military spouses, individuals with disabilities, and those of all sexual orientations and gender identities.<br/><br/>Videos to watch<br/><br/>The Culture at Mattel<br/><br/>Mattel Investor Highlights", "responsibilities": "<ul><li> Lead team of direct reports, maintaining a clear pulse on areas of responsibility and actively mentor and develop each team member’s skills to build strength and broaden career opportunities. </li><li>Oversee all global merchandise event activities, ensuring product arrivals, deadlines and inventory levels enable continual business activity.</li><li>Evaluate merchandise executions and react quickly to performance, trends + key takeaways which impact the larger LBE business.</li><li>Develop &amp; set global revenue projections, ensuring AOP goals are being met globally in order to achieve LBE growth goals. Drive the business with full accountability to revenue, partnerships, inventory, SKU mixes and more.</li><li>Taking ownership of account management and directly managing multiple LBE partnerships across the global portfolio of brands and experiences. </li><li>Oversee and approve pricing negotiations with suppliers + LBE partners, ensuring that margin goals are captured while delivering high quality product.</li><li>Research and develop new experiential retail models for events &amp; attractions, staying abreast of industry trends.</li><li>Oversee global demand planning for all Location Based Entertainment attractions, inputting into Mattel systems and tracking production through completion and arrival at Distribution Centers around the world</li><li>Diligently manage timelines, ensuring that launches are being met in tandem with operational attraction timelines &amp; needs</li><li>Lead all internal cross functional team meetings, expertly collaborating across a large organization to achieve LBE goals. Teams range from marketing, supply chain, customer service &amp; more.</li><li>Develop and maintain a thorough competency for all Mattel brands &amp; all Mattel branded attractions &amp; experience; understanding the target consumers and driving merchandise mixes based on varying attraction goals.<br/><br/></li></ul>", "qualifications": {"required": "8-10 years of experience working in Project Management and business development, preferably within Location Based Entertainment\nLeadership experience guiding and motivating hard-working teams with an excellent track record of achievement, advancement, and performance\nAbility to synthesize financial information into a concise story and communicate the story to various levels of leadership\nDemonstrable experience of product planning, demand planning, SKU management, inventory management &amp; partnership management\nAbility to take ownership of projects, see projects through completion and deliver on deadline.\nTo be a flexible member of the team and the ability to develop and nurture strong relationships both internally and externally.\nAbility to react and drive solutions in rapidly changing situations with flexibility, clarity and patience, structured and clear communicator with ability to react positively to all challenges. Excellent interpersonal skills and written and verbal communication is essential.\nAdvanced proficiency with Microsoft Outlook, Word, Excel, and PowerPoint is essential for use in project management, deck creation and some financial tracking.\nBusiness acumen, Initiative and the desire to always go the extra mile.\nAbility to multi-task and prioritize effectively in a pressurized, changing environment.\nCan work independently and with a team.\nForward thinker; creative problem-solving &amp; solution oriented thinker is very important.\nOccasional travel is required as part of this role. ", "preferred": ""}, "skills": ["Project Management", "Business Development", "Location Based Entertainment", "Leadership", "Financial Analysis", "Product Planning", "Demand Planning", "SKU Management", "Inventory Management", "Partnership Management", "Relationship Building", "Communication", "Microsoft Outlook", "Word", "Excel", "PowerPoint"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "The annual base salary range for this position is between $140,000 and $175,000.<br/><br/><ul><li>This range is indicative of projected hiring range, however annual base salary will be determined based on a candidate’s work location, skills and experience.<br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3987191116"}