{"jobTitle": "Senior Ad Operations Associate", "company": {"name": "Roku", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00 - $128,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Teamwork makes the stream work.<br/><br/><strong>Roku Is Changing How The World Watches TV<br/><br/></strong>Roku is the #1 TV streaming platform in the US, and we've set our sights on powering every television in the world. Roku pioneered streaming to the TV. Our mission is to be the TV streaming platform that connects the entire TV ecosystem. We connect consumers to the content they love, enable content publishers to build and monetize large audiences, and provide advertisers unique capabilities to engage consumers.<br/><br/>From your first day at Roku, you'll make a valuable - and valued - contribution. We're a fast-growing public company where no one is a bystander. We offer you the opportunity to delight millions of TV streamers around the world while gaining meaningful experience across a variety of disciplines.<br/><br/><strong>About The Team<br/><br/></strong>The Brand Experiences team plays a crucial role in driving the success of Roku's cutting-edge sponsorships. The team is responsible for complex trafficking, quality assurance, and in-depth troubleshooting of all sponsorship products. This team operates across diverse platforms, owing to the intricate nature and tailored requirements of each project. Collaborating closely with Client Services and Product Marketing, team members spearhead the implementation of both new and established product offerings and packages. Members of this team have the unique opportunity to be at the forefront of innovation, gaining first-hand exposure to brand new executions built to meet customer objectives and delight our user base.<br/><br/><strong>About The Role<br/><br/></strong>Roku is seeking a Senior Ad Operations Associate to join our growing Brand Experiences team. In this role, this individual will help facilitate the launch and delivery of campaigns while ensuring compliance with standard processes and quality assurance practices. This position is highly cross functional and will use a combination of 3rd party and propriety platforms to create highly custom/complex executions to drive user engagement and delight.<br/><br/>This individual will work well in a fast-paced environment and be a natural self-starter. The ideal candidate isn’t a bystander. They are curious, hungry, and engaged, willing to jump in to solve problems and make data-driven decisions even when things feel very ambiguous. Our industry changes quickly, so we expect a great candidate to be comfortable responding quickly to changing business needs.<br/><br/>This position works alongside the Senior Ad Operations Brand Experience team and reports to the Senior Manager of Ad Operations, located in Boston, MA. This role is based in our Boston, NYC, or Santa Monica office.<br/><br/>For California Only - The estimated annual salary for this position is between $85,000 - $128,000 annually.<br/><br/>Compensation packages are based on factors unique to each candidate, including but not limited to skill set, certifications, and specific geographical location.<br/><br/>This role is eligible for health insurance, equity awards, life insurance, disability benefits, parental leave, wellness benefits, and paid time off.<br/><br/><strong>What you'll be doing:<br/><br/></strong><ul><li>Use 3rd party tools to ensure creatives running in our ad servers are in compliance with our ad specifications </li><li>Monitor and schedule campaigns, making any necessary optimizations to placements, tags, creatives and/or 3rd party technologies to ensure expected delivery </li><li>Accountable for the management and QA of high profile and time sensitive campaign launches </li><li>Build and launch custom ad experiences using proprietary toolsets and technical systems </li><li>Effectively act as a liaison between Account Management, Engineering, and Technical Operations teams using clear and consistent communication </li><li>Consults with Client Services on how to adjust tactics based on client goals and performance metrics </li><li>Contribute ideas on how enhancements to our proprietary systems and tools can benefit productivity and effectiveness </li><li>Proactively identify situations in which technical issues need to be escalated and take initiative to do so<br/><br/></li></ul><strong>We're excited if you have:<br/><br/></strong><ul><li>3-5 years of experience in digital ad operations or QA at a publisher, an ad tech company, ad agency, or ad network </li><li>Experience with GAM and digital ad serving tools for video and display </li><li>Experience in display and video advertising with a premium publisher or agency </li><li>Expert organization, attention to details and time management skills </li><li>Familiarity with Salesforce </li><li>Inquisitive, proactive, and process-oriented person with experience adhering to processes and standards </li><li>Ambitious self-starter who enjoys a good challenge and continuous learning </li><li>Understanding of digital advertising campaign management including strategies, tactics, execution (ad serving and pixels) and reporting </li><li>Ability to use analytical and technical skills to troubleshoot setup and delivery challenges </li><li>Creative problem solver and ability to work effectively in an emerging technology company <br/><br/></li></ul><strong>Benefits<br/><br/></strong>Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.<br/><br/><strong>The Roku Culture<br/><br/></strong>Roku is a great place for people who want to work in a fast-paced environment where everyone is focused on the company's success rather than their own. We try to surround ourselves with people who are great at their jobs, who are easy to work with, and who keep their egos in check. We appreciate a sense of humor. We believe a fewer number of very talented folks can do more for less cost than a larger number of less talented teams. We’re independent thinkers with big ideas who act boldly, move fast and accomplish extraordinary things through collaboration and trust. In short, at Roku you'll be part of a company that's changing how the world watches TV. <br/><br/>We have a unique culture that we are proud of. We think of ourselves primarily as problem-solvers, which itself is a two-part idea. We come up with the solution, but the solution isn't real until it is built and delivered to the customer. That penchant for action gives us a pragmatic approach to innovation, one that has served us well since 2002. <br/><br/>To learn more about Roku, our global footprint, and how we've grown, visit https://www.weareroku.com/factsheet.<br/><br/>By providing your information, you acknowledge that you have read our Applicant Privacy Notice and authorize Roku to process your data subject to those terms.<br/><br/>", "responsibilities": "Use 3rd party tools to ensure creatives running in our ad servers are in compliance with our ad specifications Monitor and schedule campaigns, making any necessary optimizations to placements, tags, creatives and/or 3rd party technologies to ensure expected delivery Accountable for the management and QA of high profile and time sensitive campaign launches Build and launch custom ad experiences using proprietary toolsets and technical systems Effectively act as a liaison between Account Management, Engineering, and Technical Operations teams using clear and consistent communication Consults with Client Services on how to adjust tactics based on client goals and performance metrics Contribute ideas on how enhancements to our proprietary systems and tools can benefit productivity and effectiveness Proactively identify situations in which technical issues need to be escalated and take initiative to do so", "qualifications": {"required": "3-5 years of experience in digital ad operations or QA at a publisher, an ad tech company, ad agency, or ad network Experience with GAM and digital ad serving tools for video and display Experience in display and video advertising with a premium publisher or agency Expert organization, attention to details and time management skills Familiarity with Salesforce Inquisitive, proactive, and process-oriented person with experience adhering to processes and standards Ambitious self-starter who enjoys a good challenge and continuous learning Understanding of digital advertising campaign management including strategies, tactics, execution (ad serving and pixels) and reporting Ability to use analytical and technical skills to troubleshoot setup and delivery challenges Creative problem solver and ability to work effectively in an emerging technology company ", "preferred": ""}, "skills": ["GAM", "digital ad serving", "video advertising", "display advertising", "Salesforce"], "postedDate": "1 hour ago", "applicationDeadline": "", "benefits": "Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987437456"}