{"jobTitle": "Central Operation Specialist 1", "company": {"name": "Farmers & Merchants Bank of Long Beach", "location": "Seal Beach, CA"}, "location": "Seal Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Banking", "description": "<strong>Job Summary<br/><br/></strong>The Central Operations Specialist is responsible for performing background operational duties and to support branch personnel with operational functions focusing on client service, operational integrity, and risk mitigation. This includes processing, reviewing and completing operational reports and performing operational tasks to fulfill client requests and regulatory/legal transactions. The Central Operations Specialist also provides guidance to branch staff to ensure compliance with Bank policy and procedures, prepares periodic reporting for operational performance and governance, provides quality customer service, and offers problem resolutions consistent with Bank needs and initiatives. The Central Operations Specialist must maintain a professional image in appearance and communications.<br/><br/><strong>Essential Duties<br/><br/></strong><ul><li>Accurately prepare and complete all operational reports required by the Bank within established deadlines</li><li>Effectively manage daily tasks to meet or exceed the expectations of department Service Level Agreements </li><li>Process incoming requests in compliance with the established procedures, through various communication and workflow systems </li><li>Ensure internal controls are maintained each day as necessary to protect the Bank appropriately for the processing of branch stop payments, alerts, and any other reports within the department’s responsibilities</li><li>Identify areas for improvement, seek solutions, and implement approved changes to increase efficiency and productivity</li><li>Process incoming legal attachment orders including, levies, writs and subpoenas </li><li>Perform review and completion of the JHA’s Positive Pay exception items</li><li>Perform IRS tax reporting corrections</li><li>Prepares and responds to verification of deposit requests</li><li>Perform maintenance input and verification as designated by Management</li><li>Perform rate changes to the system both at the account and service charge level</li><li>Analyze, calculate, and process interest rate adjustments </li><li>Submit periodic Federal and State Withholding payments and reporting, including the annual IRS 945 tax filing</li><li>Provide support to Branch Operations personnel with inquiries and issues, complying with Bank regulations and policies</li><li>Manage the Department email/e-fax inbox. This includes replying to emails, forwarding emails/e-faxes to appropriate staff members and filing emails/e-faxes per department procedures</li><li>Comply with federal &amp; state, internal regulations and bank security guidelines<br/><br/></li></ul><strong>Central Operations Specialist &amp; Classifications<br/><br/></strong>The Central Operations Specialist position has multiple levels, and each level is defined in the Central Operations Specialist Classifications document. The Central Operations Specialist Classifications document will include additional essential duties and required knowledge and skills for each level.<br/><br/>Complies with all State and Federal Banking regulatory requirements, including but not limited to: BSA, Anti-Money Laundering OFAC, CIP, Financial Elder Abuse Reporting, Sexual Harassment, Information Security and privacy requirements. This position will elevate suspicious activity to supervisory staff and/or BSA department. Completes compliance and other technical training workshops as assigned.<br/><br/>Non-Essential Duties<br/><br/><ul><li>Maintain department files, both paper and electronic</li><li>Assists in the department Tour of Duty; conducts training and provides feedback to the participants </li><li>Perform general clerical duties including but not limited to; photocopying, faxing, mailing, scanning, and filing</li><li>Actively participate in the Bank’s/department’s incentive plan and project initiatives<br/><br/></li></ul><strong>Required Knowledge<br/><br/></strong><ul><li>Bank Protection Act</li><li>Regulation CC</li><li>Bank Secrecy Act</li><li>Regulation D</li><li>Fair Credit Reporting Act Overview</li><li>Regulation DD</li><li>Privacy Act</li><li>Regulation E</li><li>FDIC Insurance</li><li>New Accounts Procedure</li><li>Operations Policy and Procedures</li><li>Teller Operations</li><li>Branch Operations (Teller, New Accounts, and Operations</li><li>Safe Deposit Box Procedures<br/><br/></li></ul><strong>Basic Knowledge, Skills And Abilities<br/><br/></strong><ul><li>Critical Thinking, Judgment &amp; Problem Solving Skills </li><li>Excellent Interpersonal Skills </li><li>Management Skills</li><li>Customer Service Skills </li><li>Planning Skills </li><li>Detail Oriented </li><li>Telephone Skills </li><li>Effective Process Improvement Skills</li><li>Working Knowledge of All Operations Software Programs (AS400, Synergy, Laserfiche)</li><li>Effective Time Management and Organizational Skills </li><li>Working Knowledge of Microsoft Excel, Outlook, Word and Visio</li><li>General Consulting Skills</li><li>Reporting Skills</li><li>Excellent Communication and Writing Skills</li><li>Quality Focus<br/><br/></li></ul><strong>Officer Title Eligibility<br/><br/></strong>For qualified positions, the Bank may designate an Officer Title to an employee who seeks and/or meets defined competencies for an eligible position. This position qualifies for the officer title(s) of Assistant Vice President.<br/><br/><strong>Equipment Operated<br/><br/></strong><ul><li>Desktop Computers</li><li>Laserfiche Scanners</li><li>Standard Office Equipment (copiers, fax machines, telephones)<br/><br/></li></ul><strong>Physical Requirements &amp; Work Environment<br/><br/></strong><ul><li>Requires sitting for prolonged periods of time</li><li>Requires viewing of computer monitors for prolonged periods of time</li><li>Requires lifting up to 25 lbs.</li><li>Office setting w/controlled temperature<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>Core Banking Systems knowledge desired, but not required</li><li>3+ plus years banking experience and excellent working knowledge of banking operations<br/><br/></li></ul>As a part of the Bank’s internal control systems, employees holding sensitive positions are required to be absent from their duties for a minimum of two consecutive weeks each year. This position has been deemed to meet the test for a sensitive position, and therefore you will be required to meet the minimum absence requirement each and every year.<br/><br/>This job description is not intended to be all-inclusive, and employees will be required to perform additional related work duties as assigned by their immediate supervisor and/or management.<br/><br/>Farmers and Merchants Bank of Long Beach reserves the right to revise or change job duties and responsibilities as the need arises. This job description does not constitute a written or implied contract of employment.", "postedDate": "3 weeks ago", "skills": ["AS400", "Synergy", "Laserfiche", "Microsoft Excel", "Outlook", "Word", "Visio", "Banking Operations", "Client Service", "Operational Integrity", "Risk Mitigation", "Compliance", "Customer Service", "Problem Resolution", "Process Improvement", "Time Management", "Organizational Skills", "Communication", "Writing Skills", "Quality Focus", "Interpersonal Skills", "Management Skills", "Planning Skills", "Telephone Skills", "Consulting Skills", "Reporting Skills", "Critical Thinking", "Judgment", "Problem Solving"], "url": "https://www.linkedin.com/jobs/view/3987287451"}