{"jobTitle": "Logistics Specialist", "company": {"name": "Theragent Inc", "location": "Arcadia, CA"}, "location": "Arcadia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Biotechnology Research", "description": "<strong>Position Summary:<br/><br/></strong>The Logistics Specialist will support the logistics team in executing material planning, scheduling, and delivery operations. This role involves handling the day-to-day logistics tasks, ensuring compliance with Quality cGMP standards, and assisting in the smooth flow of materials through the production process.<br/><br/><strong>Primary Responsibilities:<br/><br/></strong><ul><li>Develop and maintain standard operating procedures (SOPs) for clinical logistics activities, ensuring compliance with regulatory requirements and best practices. </li><li>Assist with the planning and scheduling of patient material requirements to support manufacturing schedules.</li><li>Lead and support the development and implementation of the company enterprise software. Standardize system/business nomenclature and associated SOPs. </li><li>Maintain accurate records of material transactions in the ERP system and report any discrepancies.</li><li>Monitor the movement of patient material through the production cycle, ensuring compliance with GMP and regulatory standards.</li><li>Assist in the coordination of material transfer and delivery to clinical dosing centers, collaborating with internal and external stakeholders.</li><li>Assist in the preparation and maintenance of production schedules, ensuring alignment with the master schedule.</li><li>Support the logistics team in addressing and resolving any issues that disrupt the production schedule.</li><li>Maintain a clean and organized work environment, adhering to safety and quality standards.</li><li>Provide general administrative support to the logistics team as needed.</li><li>Support cross-functional teams in the planning and execution of clinical trials, providing logistics expertise and ensuring alignment with study timelines and objectives.<br/><br/><br/></li></ul><strong>Reports to: </strong>Supervisor, Warehouse &amp; Logistics Operations<br/><br/><strong>FLSA Status: </strong>Exempt<br/><br/><strong>Location: </strong>Arcadia, CA<br/><br/><strong>Knowledge, Skills &amp; Abilities:<br/><br/></strong><ul><li>Familiar with software application and able to learn new systems</li><li>Basic understanding of GMP cold chain logistics.</li><li>Proficiency in Microsoft Office applications (Word, Excel, Outlook).</li><li>Ability to follow established policies and procedures.</li><li>Effective problem-solving skills.</li><li>Ability to work in a fast-paced environment.</li><li>Demonstrate attention to detail with a high degree of accuracy.</li><li>Demonstrates high reliability and professionalism.</li><li>Ability to work independently with minimal supervision.</li><li>Strong written and verbal communication skills.</li><li>Excellent interpersonal skills with experience dealing with a diverse workforce. </li><li>Initiative-taker with the ability to effectively manage multiple tasks and activities simultaneously and track project status to completion. </li><li>Strong organizational and time management skills.</li><li>Strong project-leading skills, with an excitement to both roll up your sleeves and provide strategic initiatives<br/><br/><br/></li></ul><strong>Education &amp; Professional Experience:<br/><br/></strong><ul><li>Bachelor’s degree in computer science, supply chain management, or a related field, with 0-2 years of experience, or an Associate’s degree with 3-5 years of relevant experience.</li><li>Prior experience in managing logistics or supply chain operations is a plus but not required.</li><li>Experience in a GMP environment is a plus.</li><li>Familiarity in logistics software and tools is a plus (e.g., ERP systems, clinical trial management systems).</li><li>Professional certification in logistics or supply chain management (e.g., APICS, CSCMP) is a plus.<br/><br/><br/></li></ul><strong>Working Conditions:<br/><br/></strong><ul><li>Primarily warehouse environment but will be required to enter laboratory or GMP process areas donning proper gowning / lab coats or PPE such as safety glasses and shoes </li><li>May be required to work in controlled or clean room environments</li><li>Able to lift 50-70 lbs. occasionally</li><li>Able to pull and push the pallets using pallet jack</li><li>Occasional stooping, bending, stretching, pushing, pulling, reaching and/or lifting up to 25lbs. </li><li>Ability to sit, stand, walk and move within workspace for extended periods. </li><li>Ability to perform repetitive tasks including hand to finger manipulations, grasping, pushing and pulling.</li><li>Ability to work safely and effectively when working alone or working with others.</li><li>Must be able to read, write, and converse in English<br/><br/><br/></li></ul><strong>Travel: </strong>Occasional. Less than 10%<br/><br/>This description outlines the basic responsibilities and requirements for the position noted. This is not a comprehensive listing of all job duties of position. Duties, responsibilities, and activities may change at any time with or without notice.<br/><br/>Theragent, Inc. is an equal opportunity employer and prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin or ancestry, age, disability, marital status, and veteran status. All qualified applicants will receive consideration for employment.<br/><br/>Theragent, Inc. requires employees to be vaccinated against COVID-19. To the extent permitted by applicable law, candidate must be able to provide proof of full vaccination or receipt of the first dose of a two-dose COVID-19 vaccine, or request an exemption due to a medical reason, a sincerely held religious belief of practice, or pregnancy, as of the first day of work, to be considered for a U.S.-based job.", "postedDate": "3 weeks ago", "skills": ["GMP", "ERP", "Microsoft Office", "Logistics", "Supply Chain Management", "Cold Chain Logistics", "Clinical Trial Management", "Project Management", "Communication", "Problem Solving", "Time Management", "Teamwork", "Safety", "Quality Assurance", "Software Application", "GMP Cold Chain Logistics", "Microsoft Office Applications", "GMP Environment", "Logistics Software", "Logistics Tools", "Clinical Trial Management Systems", "Professional Certification", "APICS", "CSCMP", "Warehouse Environment", "Laboratory", "GMP Process Areas", "PPE", "Safety Glasses", "Shoes", "Controlled Environments", "Clean Room Environments", "Lifting", "Pallet Jack", "Stooping", "Bending", "Stretching", "Pushing", "Pulling", "Reaching", "Repetitive Tasks", "Hand to Finger Manipulations", "Grasping", "English"], "url": "https://www.linkedin.com/jobs/view/3987816641"}