{"jobTitle": "Administrative Support Specialist - No Degree Required - Remote | WFH", "company": {"name": "Get.It Recruit - Administrative", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Human Resources Services", "description": "Are you a motivated and detail-oriented individual looking to join a dynamic team? We are seeking a Remote Administrative Support Specialist who will play a crucial role in providing exceptional administrative support and ensuring a seamless experience for gig workers on our innovative platform. This is an excellent opportunity to contribute to a company that values flexibility and convenience.<br/><br/>As a Remote Administrative Support Specialist, you will have the opportunity to work remotely and be part of a team dedicated to making gig work better for everyone. Your responsibilities will include liaising with gig workers, communicating shift opportunities, and addressing any queries or concerns they may have. Additionally, you will be responsible for maintaining accurate and up-to-date records, coordinating scheduling, and providing general administrative support.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Communicate effectively with gig workers to inform them of available shifts and opportunities in real-time.<br/><br/>Address gig worker queries and provide comprehensive support through various channels, including email, chat, and phone communication.<br/><br/>Maintain accurate and detailed records of gig workers, including contact information, availability, and preferences.<br/><br/>Coordinate shift scheduling and make adjustments as necessary to ensure efficient utilization of gig workers.<br/><br/>Provide administrative support by preparing reports, managing documentation, and assisting with data entry tasks.<br/><br/>Collaborate with internal teams to facilitate seamless communication and streamline processes.<br/><br/>Contribute to ongoing improvements of the gig worker experience by providing feedback and insights.<br/><br/><strong>Qualifications<br/><br/></strong>Proven experience in administrative support roles, preferably in the staffing and recruiting industry.<br/><br/>Proficient computer skills, including experience with Microsoft Office Suite and CRM software.<br/><br/>Strong organizational and time management skills with the ability to manage multiple tasks simultaneously.<br/><br/>Excellent communication skills, both written and verbal, to effectively interact with gig workers.<br/><br/>Detail-oriented mindset with a high level of accuracy in data entry and record-keeping.<br/><br/>Ability to work independently and remotely, demonstrating self-motivation and initiative.<br/><br/>Flexibility and adaptability to thrive in a fast-paced, dynamic environment.<br/><br/>Join us in revolutionizing the gig staffing industry by providing top-notch administrative support and enhancing the experience for gig workers. If you are passionate about making a difference and enjoy working in a collaborative, remote environment, we would love to hear from you!<br/><br/>Employment Type: Full-Time", "postedDate": "3 weeks ago", "remoteWork": "Yes", "skills": ["Microsoft Office Suite", "CRM software", "Communication", "Organization", "Time Management", "Data Entry", "Record-Keeping", "Remote Work", "Self-Motivation", "Initiative", "Flexibility", "Adaptability"], "url": "https://www.linkedin.com/jobs/view/3987440240"}