{"jobTitle": "Strategic Account Development Executive", "company": {"name": "DoorDash", "industry": "Software Development", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$136,800.00/yr - $180,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "On the Outside Account Development team, we expand on existing DoorDash partnerships, while identifying opportunities for further engagement, growth, and performance on our platform. We learn more about the merchant's business and growth goals, to build a path to success and increased ROI, while accommodating the variable needs of our partners.", "responsibilities": "Run your end-to-end sales process, with sales discovery and complex pipeline management skills. Excite our existing accounts on the potential to increase revenue share. Engage with strategic decision makers, including C-suite, VPs, and business owners, while using data to tell a compelling story. Close our partners on upgrades, upsells, and cross-sells of DoorDash platform products and marketing promotions. Use internal data and unit economics to explain forecasted revenue growth and how we offer customized sales packages to improve sales, growth, and brand perception. Build an internal guide for the team's sales process. Collaborate with our regional Strategic Partner Managers (5+ at a time, depending on regional needs) to close and re-negotiate sales terms. Travel across your region (up to 40%), while we offer flexible hours and options to work from home.", "qualifications": {"required": "5+ years of sales experience with at least 3+ years selling to existing client base (upsell, cross-sell, promotions, or expansions) or related experience. 3+ years of B2B and SaaS sales experience. Worked in an outside sales environment, leading an end-to-end sales cycle. Align company partners, while managing project timelines and expectations or related project management experience. Knowledge of Excel (can maintain complex spreadsheets) and related data skills to create sales presentations. Own client-facing conversations and complex negotiations.", "preferred": "Not specified"}, "skills": ["Sales", "Business Development", "B2B Sales", "SaaS Sales", "Negotiation", "Data Analysis"], "postedDate": "4 days ago", "applicationDeadline": "Not specified", "benefits": "Comprehensive benefits package including a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit, medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program.", "remoteWork": "Flexible with some time in-office (1-2 days/week), some time in the field (up to 40%), and some time working from home.", "url": "https://www.linkedin.com/jobs/view/3987281812"}