{"jobTitle": "Director, Digital Ordering, GM - Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "170,000—250,000", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "About The Team<br/><br/>DoorDash Platform Services is our company’s hyper growth business unit that serves restaurants, grocers, and retailers across the United States and abroad. DoorDash Platform Services allows restaurants, grocers, and retailers to enable ecommerce ordering fulfillment for their first-party experiences (ie, website and in-store). The Digital Ordering portfolio consists of Online Ordering, Tableside Order &amp; Pay, Loyalty, CRM, Mobile Apps, and Websites—all designed to maximize sales for merchants while fitting seamlessly into their existing restaurant operations and brand.<br/><br/>About The Role<br/><br/>As the Director/GM Digital Ordering, you will own a P&amp;L focused on growing penetration of our first party, digital products with SMB restaurants. Digital Ordering is one of Platform Services’s fastest growing businesses, but we are still in the early innings, and are looking for a world-class operator to lead us in our transformation to become a B2B SaaS powerhouse. The ideal candidate for this role has experience in B2B software product strategy, operations, GTM strategy, and is an exceptional people leader. We are looking for equal parts vision and execution—someone who can set a multi-year strategy but is able to surpass quarterly targets by leading a cross-functional team of 150+.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Strategize. From first principles, you’ll help develop the optimal strategy for DoorDash to enable merchants to build their first party channel. You’ll identify and quantify the biggest growth levers, set goals for cross functional teams, and manage operating cadences to create accountability and maximize learnings.</li><li>Build. You will identify and incubate new bets that solve merchant problems and identify greenshoots that will propel us into our next phase of growth, while creating the infrastructure to transform DoorDash into becoming a B2B SaaS business in addition to a consumer marketplace.</li><li>Scale. You will partner with Sales, tech, and centralized teams (Accounting, Compliance) to ensure the right processes and systems are in place to continue the team’s current growth trajectory. </li><li>Collaborate. You’ll lead a highly cross-functional team to drive growth by partnering with engineering, product, design, sales, operations, finance, and marketing. You will help the team maneuver through conflicting priorities and set a clear path forward to achieve a mutually beneficial outcome.</li><li>Lead. You’ll manage, develop and continue to build a high-performing team.<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You solve problems from first principles, starting with the customer. You’re excited to solve problems in innovative ways, and you resist “this is how it’s always been done” thinking. You start with a clear understanding of the customer's needs and measure success based on how well we deliver on those needs.</li><li>You’re equally comfortable operating at 10,000 feet and the lowest level of detail. You don’t hesitate to get in the weeds and work at the most basic level of detail, but you’re just as comfortable thinking long-term and inspiring a team. No job is beneath you.</li><li>You’re unafraid of ambiguity. You don’t need a playbook. You dive into difficult problems and come up with a plan. Rapid change and learning is exciting to you.</li><li>You’re analytical. You let data win arguments. You are an analytical thinker, able to leverage data and analytics to answer complex business questions and create a compelling narrative.</li><li>You’re relentless. You do what it takes to win, no matter what. You are comfortable with ambiguity &amp; embrace the challenge of having multiple paths forward and no right answer.</li><li>You have 15+ years of experience and have scaled a business or function. You’ve succeeded in high-performance cultures ( in tech, operations, strategy, consulting, finance, or a related experience), you’ve led teams to achieve audacious goals, and you have successfully scaled a business. Experience leading Customer Success is ideal.</li><li>You have 10+ years of team management experience. You have a proven track record of building, developing, and inspiring diverse teams who deliver results.<br/><br/></li></ul>We expect to fill this position by 8/10/2024.<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>Actual compensation within the pay range listed below will be decided based on factors including, but not limited to, skills, prior relevant experience, and specific work location. Base salary is localized according to employee work location.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants and sales commission. The estimated pay range for this position represents total on-target earnings (including base salary and on-target incentive pay). Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$170,000—$250,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Strategize. From first principles, you’ll help develop the optimal strategy for DoorDash to enable merchants to build their first party channel. You’ll identify and quantify the biggest growth levers, set goals for cross functional teams, and manage operating cadences to create accountability and maximize learnings.\nBuild. You will identify and incubate new bets that solve merchant problems and identify greenshoots that will propel us into our next phase of growth, while creating the infrastructure to transform DoorDash into becoming a B2B SaaS business in addition to a consumer marketplace.\nScale. You will partner with Sales, tech, and centralized teams (Accounting, Compliance) to ensure the right processes and systems are in place to continue the team’s current growth trajectory. \nCollaborate. You’ll lead a highly cross-functional team to drive growth by partnering with engineering, product, design, sales, operations, finance, and marketing. You will help the team maneuver through conflicting priorities and set a clear path forward to achieve a mutually beneficial outcome.\nLead. You’ll manage, develop and continue to build a high-performing team.", "qualifications": {"required": "You solve problems from first principles, starting with the customer. You’re excited to solve problems in innovative ways, and you resist “this is how it’s always been done” thinking. You start with a clear understanding of the customer's needs and measure success based on how well we deliver on those needs.\nYou’re equally comfortable operating at 10,000 feet and the lowest level of detail. You don’t hesitate to get in the weeds and work at the most basic level of detail, but you’re just as comfortable thinking long-term and inspiring a team. No job is beneath you.\nYou’re unafraid of ambiguity. You don’t need a playbook. You dive into difficult problems and come up with a plan. Rapid change and learning is exciting to you.\nYou’re analytical. You let data win arguments. You are an analytical thinker, able to leverage data and analytics to answer complex business questions and create a compelling narrative.\nYou’re relentless. You do what it takes to win, no matter what. You are comfortable with ambiguity &amp; embrace the challenge of having multiple paths forward and no right answer.\nYou have 15+ years of experience and have scaled a business or function. You’ve succeeded in high-performance cultures ( in tech, operations, strategy, consulting, finance, or a related experience), you’ve led teams to achieve audacious goals, and you have successfully scaled a business. Experience leading Customer Success is ideal.\nYou have 10+ years of team management experience. You have a proven track record of building, developing, and inspiring diverse teams who deliver results.", "preferred": ""}, "skills": ["Strategy", "Operations", "Product Strategy", "GTM Strategy", "Leadership", "Sales", "Customer Success", "Team Management", "Data Analysis", "Problem Solving"], "postedDate": "4 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefit and several paid holidays.\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match and a mental health program, among others.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3987288059"}