{"jobTitle": "Marketing Intern, Flighthouse", "company": {"name": "Create Music Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing and Sales", "industry": "Entertainment Providers", "description": "Create Music Group is a data-driven music and technology company focused on empowering artists and labels. We provide you with the resources of a major label with flexibility of being independent. Trusted by the world's largest artists, labels, and brands - we’re revolutionizing the music industry and how the world hears their favorite songs by maximizing opportunities to monetize content across all platforms. Clients include Gashi, DeeBaby, Troyboi, Teo, and more.<br/><br/>Flighthouse, a beacon in the Gen Z digital entertainment landscape, commands a following of over millions across our owned brands. As a titan in the digital media industry, we're synonymous with cutting-edge Gen Z culture. FH Media, our expansive new media company, includes original content brands like Flighthouse, Retirement House, Teenager Therapy, among others, an Instagram distribution network spanning 100+ pages in 16 unique verticals, and a comprehensive full-service creative agency. Our clientele includes music and entertainment luminaries as well as leading global brands, making us a pivotal player in influencer marketing, original content creation, account management, and beyond.<br/><br/><strong>SUMMARY:<br/><br/></strong>The Marketing Intern will support the Flighthouse team with the execution of marketing campaigns. This role will assist with setting up, researching, sourcing to ensure thorough project execution to meet deadlines for all clients of the company.<br/><br/><strong>RESPONSIBILITIES: <br/><br/></strong><ul><li>Support the process of execution, tracking, and reporting campaigns to meet the needs of all clients of the company.</li><li>Assist with setting up campaigns, researching and sourcing influencer and media outlets, etc. for successful execution for all clients.</li><li>Support and review progress on various campaigns such as tracking social media posts, ads and campaign performance</li><li>Assist with administrative tasks as needed (i.e. update spreadsheets, assist with invoices, etc.)<br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>Must be based in Los Angeles.</li><li>Strong knowledge of social media platforms Youtube, Instagram and TikTok</li><li>Knowledge of top streaming platforms Spotify and Apple Music</li><li>Excellent organization skills and ability to be detail oriented</li><li>Proficient in Microsoft Office Suite</li><li>Ability to problem solve and work independently and collaboratively as part of a team</li><li>Willing to learn marketing tactics and strategies</li><li>Experience or knowledge in music/marketing preferred</li><li>Strong interest in pop culture and following social media trends preferred<br/><br/></li></ul><strong>PAY SCALE:<br/><br/></strong><ul><li>This internship is for college credit</li><li>Must be enrolled in a university and continue to be enrolled for the duration of the internship.</li><li>Graduates are not eligible for the internship.</li><li>Must be able to provide documents/eligibility requirements in order to receive college credit or the applicant will be disqualified.<br/><br/></li></ul>Flighthouse is an equal opportunity employer dedicated to diversity and inclusion. We invite qualified candidates to apply by submitting a resume and/or a cover letter that highlights how they can contribute to the company's strategic and operational goals.", "responsibilities": "The Marketing Intern will support the Flighthouse team with the execution of marketing campaigns. This role will assist with setting up, researching, sourcing to ensure thorough project execution to meet deadlines for all clients of the company.<br/><br/><strong>RESPONSIBILITIES: <br/><br/></strong><ul><li>Support the process of execution, tracking, and reporting campaigns to meet the needs of all clients of the company.</li><li>Assist with setting up campaigns, researching and sourcing influencer and media outlets, etc. for successful execution for all clients.</li><li>Support and review progress on various campaigns such as tracking social media posts, ads and campaign performance</li><li>Assist with administrative tasks as needed (i.e. update spreadsheets, assist with invoices, etc.)<br/><br/></li></ul>", "qualifications": {"required": "Must be based in Los Angeles.<br/>Strong knowledge of social media platforms Youtube, Instagram and TikTok<br/>Knowledge of top streaming platforms Spotify and Apple Music<br/>Excellent organization skills and ability to be detail oriented<br/>Proficient in Microsoft Office Suite<br/>Ability to problem solve and work independently and collaboratively as part of a team<br/>Willing to learn marketing tactics and strategies", "preferred": "Experience or knowledge in music/marketing preferred<br/>Strong interest in pop culture and following social media trends preferred"}, "skills": ["Social Media", "Marketing", "YouTube", "Instagram", "TikTok", "Spotify", "Apple Music", "Microsoft Office Suite", "Problem Solving", "Teamwork"], "postedDate": "3 weeks ago", "url": "https://www.linkedin.com/jobs/view/3987313299"}