{"jobTitle": "Air Import Operation Agent", "company": {"name": "Advantage Technical", "location": "Inglewood, CA"}, "location": "Inglewood, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Job Title: Air Import Operation Agent <br/><br/></strong>FLSA: Non-Exempt, Temp<br/><br/>Reports To: Manager<br/><br/>Work Location: Inglewood, CA<br/><br/>Work Schedule : Monday to Friday, 7:00 AM to 4:00 PM (or 8:00 AM to 5:00 PM)<br/><br/><ul><li>Overtime and weekend work may be required based on business needs. <br/><br/><br/></li></ul><strong>Overview:<br/><br/></strong>A global freight forwarding and logistics company is looking for a diligent and motivated individual to join our team as the Air Import Operations Agent.<br/><br/>This role involves coordinating the timely delivery of air import shipments to customers by efficiently managing shipping documents, customs clearance, and transportation logistics.<br/><br/><strong>Essential Duties and Responsibilities Include but not limited to: <br/><br/></strong><ul><li> Communicate effectively with customers, customs brokers, airlines, and warehouses to ensure smooth shipment processing. </li><li> Create and distribute Arrival Notice forms through the KWE system. </li><li> Coordinate timely delivery of shipments from LAX Airport to customer locations. </li><li> Monitor and control trucking costs. </li><li> Accurately input data into the KWE system. </li><li> Manage inventory and damage reports from warehouses. </li><li> Prepare FedEx and UPS shipping labels as required.. <br/><br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li> Strong attention to detail and organizational skills. </li><li> Proficiency in Microsoft Excel. </li><li> Excellent typing speed and accuracy. </li><li> Ability to learn new systems and processes quickly. </li><li> Willingness to work overtime and weekends as needed. <br/><br/><br/></li></ul>The base pay range above represents the low and high end of the base compensation range we reasonably expect to pay for this position. Actual base compensation will vary and may be above or below the range based on various factors including, but not limited to, geographic location, actual experience, and job performance. This job posting is not a promise of any specific pay for any specific employee.<br/><br/>The range listed is just one component of the total compensation package for our employees. Based on the details of your position, we provide a variety of benefits to our employees, including medical, dental, and vision plans, pre-tax savings plans, pre-tax parking and commuter plans, supplemental health and welfare plans, a retirement savings plan, an employee assistance program, pet insurance, and paid holidays. Other rewards may include short-term incentives and paid time off.<br/><br/><strong>After you have applied, download our Staffmark Group WorkNOW App to receive real-time job offers and apply for additional opportunities. You can download it from the App Store or get it on Google Play. <br/><br/></strong><strong>About Advantage Technical<br/><br/></strong>With company roots going back over 30 years, Advantage Technical is an engineering and information technology services company and a national leader in the provision of technical resources today. These services include Staff Augmentation, Direct Placement, Project Resourcing and Outsourcing – delivered from 40 key market locations, by over 3500 specialized contractors, to over 500 clients across North America. Advantage Technical is a Best of Staffing Diamond Award winner for both Clients and Talent. For more information about the industries and services offered by Advantage Technical, please visit AdvantageTechnical.com.<br/><br/>Advantage Technical is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact your local branch. Advantage Technical is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment.<br/><br/>All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations.", "postedDate": "3 weeks ago", "skills": ["Microsoft Excel"], "url": "https://www.linkedin.com/jobs/view/3987454976"}