{"jobTitle": "Logistics & Fulfillment Assistant Manager", "company": {"name": "DoorDash", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Software Development", "description": "About The Team<br/><br/>We’re looking for an experienced operations specialist, to join the leadership team of a DoorDash fulfillment warehouse focused logistics and fulfillment operations. This role leads in a new and emerging business line- creative problem solving, flexibility, and willingness to experiment and scale will be keys to success.<br/><br/>About The Role<br/><br/>This is a newly created role supporting logistics and fulfillment operations and leading a team of employees at a DoorDash fulfillment warehouse. This role will be part of the onsite warehouse leadership team, reporting to an onsite Logistics and Fulfillment Manager. The goal of this role is to ensure we are building and scaling our team and operations to support a new and emerging business line in close partnership with the Logistics and Fulfillment Manager.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/><ul><li>Lead: You will recruit, manage, and retain a high-performing team of hourly Shift Leads and Operations Associates (30+ reports), build a positive team culture, promote employee engagement, and be accountable for operational results in partnership with your site leadership team.</li><li>Oversee: You will oversee the day-to-day outcomes for your team within the warehouse facility, ensuring all processes run smoothly, effectively, and safely, while iterating and driving experimentation to improve processes, bringing your team along.</li><li>Strategize: You'll strategize with the leadership team on resource allocation and efficient workflows, use data to identify pain-points or inefficiencies, develop and execute warehouse process improvement projects to improve operations and employee experience.</li><li>Delight Customers: Working with the site leadership team and central teams, you'll ensure your site offers the best experience to customers, including Merchant Partners and end recipients, on every order handled, while providing your team with the necessary tools, resources, and support to achieve these customer delight goals.<br/><br/></li></ul>We’re Excited About You Because…<br/><br/><ul><li>You approach problems with a fresh perspective, looking for solutions while remaining open to different ways of thinking.</li><li>You excel in productive environments where rapid change and continuous learning are embraced, navigating with confidence.</li><li>You are comfortable with operational changes, embracing speed and can your team up to speed with changes to the business.</li><li>You use data, letting numbers guide your decision-making process and applying Excel/data analysis skills productively.</li><li>You are tenacious and committed to achieving success, putting in the necessary effort to overcome challenges.</li><li>You have experience of at least 1 year of managing and guiding teams.</li><li>You take ownership and responsibility, doing what it takes to support a 24/7 business across multiple shifts.</li><li>You have at least 3 years of relevant experience in Operations, Fulfillment, Last-Mile Logistics, or Manufacturing.</li><li>You are available to provide support during late nights and weekends, as needs dictate.<br/><br/></li></ul>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$59,800—$88,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Lead: You will recruit, manage, and retain a high-performing team of hourly Shift Leads and Operations Associates (30+ reports), build a positive team culture, promote employee engagement, and be accountable for operational results in partnership with your site leadership team.\nOversee: You will oversee the day-to-day outcomes for your team within the warehouse facility, ensuring all processes run smoothly, effectively, and safely, while iterating and driving experimentation to improve processes, bringing your team along.\nStrategize: You'll strategize with the leadership team on resource allocation and efficient workflows, use data to identify pain-points or inefficiencies, develop and execute warehouse process improvement projects to improve operations and employee experience.\nDelight Customers: Working with the site leadership team and central teams, you'll ensure your site offers the best experience to customers, including Merchant Partners and end recipients, on every order handled, while providing your team with the necessary tools, resources, and support to achieve these customer delight goals.", "qualifications": {"required": "You approach problems with a fresh perspective, looking for solutions while remaining open to different ways of thinking.\nYou excel in productive environments where rapid change and continuous learning are embraced, navigating with confidence.\nYou are comfortable with operational changes, embracing speed and can your team up to speed with changes to the business.\nYou use data, letting numbers guide your decision-making process and applying Excel/data analysis skills productively.\nYou are tenacious and committed to achieving success, putting in the necessary effort to overcome challenges.\nYou have experience of at least 1 year of managing and guiding teams.\nYou take ownership and responsibility, doing what it takes to support a 24/7 business across multiple shifts.\nYou have at least 3 years of relevant experience in Operations, Fulfillment, Last-Mile Logistics, or Manufacturing.\nYou are available to provide support during late nights and weekends, as needs dictate."}, "skills": ["Operations", "Fulfillment", "Last-Mile Logistics", "Manufacturing", "Team Management", "Data Analysis", "Excel", "Problem Solving", "Customer Service"], "postedDate": "2 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "salary": {"amount": "59,800—$88,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987283369"}