{"jobTitle": "Paralegal, Music Business & Legal Affairs (Disney General Entertainment Content)", "company": {"name": "The Walt Disney Company", "industry": "Entertainment Providers", "size": "Large", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00 - $93,800.00", "currency": "USD"}, "jobFunction": "Legal", "industry": "Entertainment Providers", "description": "The Music Business and Legal Affairs Department of Disney General Entertainment Content is seeking an exceptional candidate for a Paralegal. Candidate will be working in both domestic and international matters for multiple lines of business including television, Disney+, Star/Star+, theme parks, Disney Online, digital distribution, Consumer Products, marketing and promotions, publicity, and other ancillary activities. Candidate must be extremely detail-oriented and organized with an ability to multitask and make quick decisions. Environment is demanding and fast-paced. The right candidate will be able to work closely with all levels of Business and Legal Affairs, internal and external clients, and business unit executives and staff. Great communication skills, ability to prioritize, and ability to deal with multiple deadlines is a must. Ideal candidate must have great credentials and an interest in learning about multiple businesses and music legal and business affairs.", "responsibilities": "Draft, review, redline and administer music agreements and standard forms for multiple lines of business including composer agreements, music supervisor agreements, songwriter agreements, artist and producer agreements, master use licenses, synchronization and master licenses, name and likeness releases, artist releases, record company and music publishing waivers, and music library agreements. Research rights, maintain standard forms and work with licensors and business units to ensure accurate negotiated forms are being used. Review, analyze, draft and redraft music licenses with licensors where there are no negotiated forms. Work directly with business units to help identify propose solutions for music related issues, and implement, maintain, and improve music clearance processes with various teams. Work directly with marketing teams on music licensing activities from securing quotes to final agreements. Interact with various internal executives and external talent and representatives including attorneys, managers, record labels and music publishers.", "qualifications": {"required": "3 years’ minimum of experience in the music industry, preferably with a law firm or major studio. Familiarity with music production and distribution in various types of media. Significant attention to detail. Excellent writing skills and superior contract law knowledge. Can confidently handle project ownership from start to finish. Capable of multi-tasking and meeting deadlines within a challenging, fast-paced, results-oriented environment. Ability to maintain a positive attitude while working under pressure. Must be a team player, self-starter and skilled in spotting issues and mistakes in legal documents. Proficient in Microsoft Word, Excel and office-related software.", "preferred": "Prior music business or legal affairs experience."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3987997965"}