{"jobTitle": "Production Director, Game Studio", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Production Director, Games<br/><br/>Night School Studio<br/><br/>Location: Los Angeles, CA, United States<br/><br/>About Night School Studio: We’re a group of developers, artists, and storytellers that make games full of wonder, danger, and humor. Everyone at our studio, whether an industry vet or new voice impacts each game through collaborative feedback, mutual respect, and creative empowerment. If you want to make games leave a meaningful impact on players: we want to hear from you.<br/><br/>We’re looking for new teammates who deeply care about the work they do, the stories they tell, and the people they create with. As part of the Netflix team, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration.<br/><br/>Role Overview: As a Production Director at Night School Studio, you will be the driving force behind getting our studio’s games out on time, of a high quality, and advancing our game production craft. You will make sure each team is running down risks and shining light into blind spots in a game’s schedule. You will be a bullish advocate for your teams to make sure that their ambitious goals are properly funded via resources or time.<br/><br/>You will report directly to the Studio Director, and will directly manage a Production and Operations team while collaborating closely with our Studio Technical Director and Creative Leadership to shape our production vision and framework. You will guide the Production team across all our product teams, ensuring they have the direction and support needed to excel in their roles.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Resource Management: Oversee estimation, load balancing, planning, and road-mapping of resources.</li><li>Leadership &amp; Mentorship: Lead the production and operations discipline of the studio. Mentor Producers and Operations personnel, helping them improve their professional skills and achieve their career goals.</li><li>Development Philosophy: Create and govern the development philosophy and framework of the studio. Ensure alignment of production practices throughout the studio.</li><li>KPI Alignment: Ensure all product teams are aligned on production KPIs related to quality, velocity, and other key metrics.</li><li>Agile Methodologies: Nurture and strengthen development culture and agile methodologies throughout the studio.</li><li>Task Management: Partner with department leads on prioritization, scheduling, communication, and day-to-day management.</li><li>Process Development: Develop and iterate on production pathways, ensuring efficient and effective workflows.</li><li>Release Management: Manage internal and external releases, coordinating across multiple stakeholders.</li><li>Team Building: Hire, mentor, and manage a team of production experts, fostering a collaborative and inclusive studio culture.</li><li>Cross-functional Collaboration: Work with partner teams within Netflix on shared development priorities and initiatives.</li><li>Strategic Planning: Collaborate with studio leadership team to create development strategies, execute key initiatives, measure progress, and iterate throughout the project.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Experience: At least 10 years of production experience, including 5+ years in a studio leadership role with multiple shipped high-quality, multi-platform games.</li><li>Narratively Rich Games: Strong experience in managing and launching high-quality, creatively charged games.</li><li>Technical Knowledge: Hands-on expertise with Jira and Confluence, including knowledge of plug-ins and best practices for smooth workflow management.</li><li>Leadership: Empathetic and attentive leader with proven leadership experience. Ability to lead inclusively and hold people accountable.</li><li>Agile Practices: Strong understanding and application of agile production methods and practices.</li><li>Matrix Environment: Experience working in a matrix environment and communicating seamlessly with other game development disciplines.</li><li>Creativity &amp; Innovation: Passion for creating structure and organization out of chaos, building systems to support creativity and innovation.</li><li>Feedback &amp; Collaboration: Demonstrable track record of providing and accepting feedback, with strong partnerships with creative and technical leadership.</li><li>Passion for Games: Deep passion for playing, incubating, building, and shipping video games.<br/><br/></li></ul>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "jobFunction": "Other", "postedDate": "2 days ago", "skills": ["Jira", "Confluence", "Agile"], "url": "https://www.linkedin.com/jobs/view/3987457851"}