{"jobTitle": "Media Coordinator - Integrated", "company": {"name": "Bloom Ads Global Media Group", "industry": "Advertising Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$38,000.00/yr - $45,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "We are looking for a Media Coordinator (MC) who is eager to jump in and contribute to the success of our growing group of clients. The MC assists in the day-to-day management of a wide range of projects from digital and traditional advertising and client relationship management to social ad campaigns and community education efforts. You will collaborate and coordinate across digital and offline teams supporting the Account Supervisors, Buyer/Planners and Executive team. If you feed off an exciting and high-pace environment and are able to stay organized and detailed against deadlines, we’d like to talk to you.", "responsibilities": "Traffic and QC client creative, Assist Media team in building and executing media plans, Update reports with campaign information and support presentation compilation, Assist Media team in compiling post analytic data and post reports, Manage advertising opportunity requests, Assist with TV/Digital/Radio/OOH/Print partnership communication", "qualifications": {"required": "College Degree Required – Emphasis in Marketing and/or Media Strategy a plus", "preferred": "1 – 2 years marketing and advertising or related experience, Media planning and/or experience with media analytics a plus, Self-starter, highly motivated, who takes initiative and has a positive demeanor, is an excellent collaborator and communicator, Strong team player, high level of attention to detail, able to juggle multiple assignments simultaneously, Must be able to communicate in an effective, concise, persuasive, articulate, and confident manner, Teamwork – Must show an ability to understand the media strategy and marketing process and be able to work efficiently and effectively with partners as directed by senior team members, Experience working with BluHorn software a plus, Must be proficient in Microsoft Word, Excel, and PowerPoint and Google suite."}, "skills": ["Media planning", "Client relationship management", "Digital advertising", "Social media campaigns", "Analytical skills"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Full medical benefits, including health, dental and vision coverage, Generous vacation policy, 12 Paid Holidays + WFH Fridays (workday ends at 2 pm), Company contribution to employee 401(K), Company-paid volunteer hours, Professional development program, Free snacks (mostly healthy), Sundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat, Monthly lunch and learns, Quarterly town hall meetings with lots of food and prizes, Team parties and celebrations.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3987835933"}