{"jobTitle": "Executive Assistant, Streaming Growth Product Team", "company": {"name": "Warner Bros. Discovery", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>About Us<br/><br/></strong>WBD’s Streaming group is the global leader in providing innovative and immersive digital products and content for iconic brands. We are working at the crossroads of technology, entertainment, and everyday utility. As content creators across the digital ecosystem, we leverage our technology to create immersive viewing and interactive experiences. We tell engaging stories to millions of viewers, and we are looking for an Executive Assistant to join the Global WBD Streaming Growth Product Team.<br/><br/><strong>Your New Role...<br/><br/></strong>The Executive Assistant will provide administrative support to multiple executives in the DTC streaming. This includes heavy schedule and travel management, expense reports, sensitive communications, and providing high level support to the broader team.<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><ul><li>Manage calendar for multiple executives.</li><li>Schedule and organize internal and external meetings, including preparation of meeting materials, conference room set up, and catering.</li><li>Arrange all meeting details, e.g., scheduling conference rooms, bridge lines, catering, and audio/visual/IT support.</li><li>Coordinate and prepare meeting materials, agendas, notes, handouts, presentation decks, etc.</li><li>Arrange travel itineraries and complete travel and expense reports.</li><li>Provide day to day support for the Digital team, including coordination of team meetings &amp; events. </li><li>Act as administrative liaison to department staff, internal partners, vendors, and consultants.</li><li>Assist with financial processing of invoices and purchase orders.</li><li>Partner closely with other Executive Assistants on team and provide back up support as needed. </li><li>Work on special projects and perform other related duties as assigned.<br/><br/></li></ul><strong>Qualifications &amp; Experience...<br/><br/></strong><ul><li>A minimum of 5 years of executive administrative experience within a fast paced, corporate environment.</li><li>Strong organizational and administrative management skills; must be articulate and detail oriented.</li><li>Self-motivated team player who thrives in collaborative environment.</li><li>Excellent written and verbal communications skills.</li><li>Proactive with ability to anticipate executive needs and ensure thorough follow-up.</li><li>Ability to assess priorities and maintain composure and diplomacy at all times. </li><li>Significant level of discretion due to exposure to confidential information.</li><li>Must be adaptable and flexible to an ever-changing environment.</li><li>Strong MS Outlook and MS Office skills (PowerPoint, Word and Excel).</li><li>Must have the legal right to work in the United States<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $0.00 - $0.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "The Executive Assistant will provide administrative support to multiple executives in the DTC streaming. This includes heavy schedule and travel management, expense reports, sensitive communications, and providing high level support to the broader team.", "qualifications": {"required": "A minimum of 5 years of executive administrative experience within a fast paced, corporate environment. Strong organizational and administrative management skills; must be articulate and detail oriented. Self-motivated team player who thrives in collaborative environment. Excellent written and verbal communications skills. Proactive with ability to anticipate executive needs and ensure thorough follow-up. Ability to assess priorities and maintain composure and diplomacy at all times. Significant level of discretion due to exposure to confidential information. Must be adaptable and flexible to an ever-changing environment. Strong MS Outlook and MS Office skills (PowerPoint, Word and Excel). Must have the legal right to work in the United States"}, "skills": ["MS Outlook", "MS Office", "PowerPoint", "Word", "Excel"], "postedDate": "2 days ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987186352"}