{"jobTitle": "Privacy Compliance Analyst - Remote", "company": {"name": "Harbor Freight Tools", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Legal", "industry": "Retail", "description": "The Privacy Compliance Analyst reports into the Enterprise Risk Management department to ensure continued compliance with state and federal privacy laws affecting Harbor Freight Tools. This role has knowledge of common privacy practices, laws, and regulatory frameworks as well as a solid understanding of various technologies necessary to support privacy operations. The Privacy Compliance Analyst partners with various departments within the organization including Marketing, IT, Retail Operations, etc. to understand their business needs and how privacy laws may affect their operations and strategy. The Privacy Compliance Analyst will facilitate operational processes, automation, and produce periodic reports related to privacy compliance.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Assist with the execution and maintenance of Harbor Freight’s privacy program. </li><li>Perform analysis on requests made within the privacy program to ensure timely and accurate verification of customer inquiries </li><li>Identify, create and facilitate process improvements within the privacy program by conducting business and systems process analysis as needed </li><li>Managing the process for handling Data Subject Requests (DSRs) such as access requests, rectification requests, and erasure requests as outlined in regulations like CPRA. </li><li>Maintain strong working relationships with privacy staff and business stakeholders </li><li>Assist the Company with meeting its legal obligations with the California Consumer Privacy Act (CCPA) and other state and federal privacy laws (as they become enacted) </li><li>Provide privacy guidance and support to various departments within the Company </li><li>Maintain privacy-related notices, policies, standards, guidelines, and processes </li><li>Assist in responding to privacy-related customer/public inquiries under the guidance of Legal </li><li>Analyzing and understanding applicable privacy regulations like CCPA, CPRA, and HIPAA to ensure the organization's compliance. This includes keeping abreast of any changes in these regulations that could impact the organization. </li><li>Participate in the regular privacy impact assessments (PIAs) to identify potential risks associated with how the company collects, stores, and uses personal data. </li><li>Assist in developing and delivering privacy awareness training programs for employees to educate them on their data handling responsibilities and relevant privacy regulations. </li><li>Working collaboratively with other departments like IT security and legal to ensure a comprehensive approach to privacy compliance.<br/><br/></li></ul><strong>Scope<br/><br/></strong><ul><li>Staff supervision and development: No</li><li>Decision making: Yes but limited</li><li>Travel: Up to 5%</li><li>Flex Designation: Anywhere<br/><br/></li></ul><strong>RequirementsEducation And Experience<br/><br/></strong><strong>Education Requirements<br/><br/></strong><ul><li>Bachelor’s degree preferred<br/><br/></li></ul><strong>Years Of Experience<br/><br/></strong><ul><li>Minimum of 2 years’ experience in Privacy, Law, Compliance, Technology or another relevant field<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Experience configuring and utilizing GRC software tool suites for governance, risk, and compliance management.</li><li>Knowledge of U.S. privacy laws</li><li>Understanding of data privacy principles</li><li>Excellent written and verbal communication skills</li><li>Strong analytical and problem-solving skills</li><li>Detail-oriented with the ability to perform projects with tight and evolving deadlines</li><li>Sound business acumen and decision making</li><li>Change agility – able to quickly adapt to changing priorities</li><li>Ability to work and communicate collaboratively / cross-functionally with multiple teams</li><li>Ability to take direction and work independently in a dynamic environment</li><li>Ability to work on multiple projects simultaneously and prioritize as needed</li><li>Strong interpersonal skills</li><li>Ability to use Microsoft office applications Word, Excel, Power Point and SharePoint, and a willingness to learn and use new tools and technologies<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong>Corporate - Remote - General office environment requiring ability to:<br/><br/><ul><li>Stand, walk, sit for extended periods of time .</li><li>Speak and listen to others in person and over the phone and video conferencing.</li><li>Use keyboard and read from computer screen and reports.</li><li>The ability to lift up to 15 lbs.<br/><br/></li></ul><strong>Safety<br/><br/></strong><ul><li>Must be able to perform this job safely in accordance with standard operating procedures and good manufacturing practices, without endangering the health or safety of self or others.</li></ul>", "responsibilities": "Assist with the execution and maintenance of Harbor Freight’s privacy program. Perform analysis on requests made within the privacy program to ensure timely and accurate verification of customer inquiries Identify, create and facilitate process improvements within the privacy program by conducting business and systems process analysis as needed Managing the process for handling Data Subject Requests (DSRs) such as access requests, rectification requests, and erasure requests as outlined in regulations like CPRA. Maintain strong working relationships with privacy staff and business stakeholders Assist the Company with meeting its legal obligations with the California Consumer Privacy Act (CCPA) and other state and federal privacy laws (as they become enacted) Provide privacy guidance and support to various departments within the Company Maintain privacy-related notices, policies, standards, guidelines, and processes Assist in responding to privacy-related customer/public inquiries under the guidance of Legal Analyzing and understanding applicable privacy regulations like CCPA, CPRA, and HIPAA to ensure the organization's compliance. This includes keeping abreast of any changes in these regulations that could impact the organization. Participate in the regular privacy impact assessments (PIAs) to identify potential risks associated with how the company collects, stores, and uses personal data. Assist in developing and delivering privacy awareness training programs for employees to educate them on their data handling responsibilities and relevant privacy regulations. Working collaboratively with other departments like IT security and legal to ensure a comprehensive approach to privacy compliance.", "qualifications": {"required": "Minimum of 2 years’ experience in Privacy, Law, Compliance, Technology or another relevant field", "preferred": "Bachelor’s degree"}, "skills": ["GRC software tool suites", "U.S. privacy laws", "data privacy principles", "written and verbal communication", "analytical and problem-solving skills", "detail-oriented", "business acumen", "change agility", "collaborative / cross-functional", "Microsoft office applications Word, Excel, Power Point and SharePoint"], "postedDate": "3 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3987292783"}