{"jobTitle": "Procurement Manager", "company": {"name": "Liquid I.V.", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "115,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Food and Beverage Services", "description": "<strong>About Liquid I.V.<br/><br/></strong>At Liquid I.V., our purpose is to elevate the vitality of people and the planet. An ambitious goal? Yes! But by playing to win, holding the bar higher, championing wellbeing, and always thinking with a pioneering mindset we can go further together to leave a lasting mark.<br/><br/>Our products are stocked in over 80,000 retail doors, including the world’s leading specialty, big box, and online retailers such as Costco, Walmart, Target, Amazon, and many more. In just over 10 years, our growth has been exponential. And as part of Unilever, we’re continuing the expansion of Liquid I.V. into a global brand.<br/><br/>We’re also passionate about cultivating solutions for equitable clean water access, a healthier planet, and thriving communities. We contribute over 1% of our company revenue to our Impact Program through which we provide partnerships and grants to organizations that expand access to clean and abundant water locally and globally. By 2026, our goal is to help ensure access to clean water for 2 million people around the world.<br/><br/><strong> About our Team: <br/><br/></strong>We are a world-class team of innovators and passionate changemakers, looking to develop transformative hydration solutions and make a meaningful impact on the world around us.<br/><br/>At Liquid I.V., we are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve.<br/><br/>Our team members enjoy a flexible and inclusive working environment, a highly collaborative and innovation-forward culture, generous benefits and perks that empower employees to champion their wellbeing every day, as well as an infinite supply of Liquid I.V. for extraordinary hydration.<br/><br/><strong> About the role: <br/><br/></strong>Liquid I.V. is looking for a motivated, fast, and strategic thinker who thrives in a fast-paced environment to join our Operations team as the Procurement Manager. This role is responsible for overseeing and managing the company’s supply chain operations for raw materials. You will collaborate with internal teams to forecast needs and manage costs effectively. This role will interface with internal Liquid I.V. stakeholders, Unilever, and external manufacturing partners.<br/><br/><strong> Functions and duties of this role include, but not limited to: <br/><br/></strong><ul><li>Lead and own open book costing for LIV network for raw materials ensuring cost adherence.</li><li>Partner closely with materials team to update current costs and rectify any costing issues between LIV and the supplier.</li><li>Maintain a LIV raw material approved supplier list.</li><li>Monitor raw material supplier performance.</li><li>Partner closely with Unilever on raw material sourcing and contract negotiation.</li><li>Lead fuel for growth projects for raw materials within the LIV portfolio.</li><li>Own raw material benchmarking analysis and partner closely with finance on financial benefits.</li><li>Support R&amp;D for ingredient sourcing and costing during development process.</li><li>Actively engage with R&amp;D partners during the early phase of innovation to identify suppliers for potential new ingredients.</li><li>Bridge the cross functional team and raw material supplier discussions to establish robust technical specifications, quality and compliance standards.</li><li>Collaborate with R&amp;D and QA teams on changes in raw material suppliers, materials, or processes that could impact product formulation and quality.</li><li>Work closely with cross-functional team on identifying and qualifying alternate suppliers for business resilience.</li><li>Performs other related duties as assigned.<br/><br/></li></ul><strong> Qualifications: <br/><br/></strong><ul><li>Bachelor’s Degree (preferably in business, economics, or another business-related field).</li><li>Minimum 5-7 years’ experience in CPG or beverage industry.</li><li>Prior experience managing raw material procurement.</li><li>Strong spend analytics skills Highly organized and dependable. </li><li>Verbal and demonstrated written communication skills.</li><li>High degree of accuracy and attention to detail.</li><li>Comfortable working in a very diverse, fast-paced environment, adhering to tight deadlines.</li><li>Must be flexible, work well under pressure, and can readily adapt to changing business needs.</li><li>Highly proficient in Microsoft Office (Excel, Word, and PowerPoint).</li><li>Demonstrated ability to interact with external partners and colleagues in a thoughtful and attentive manner.<br/><br/></li></ul><strong> What We Give: <br/><br/></strong><ul><li>100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options).</li><li>A 401k plan with company match, short and long-term disability coverage. </li><li>A generous PTO and sick policy that includes 13+ paid annual holidays. </li><li>Wellness classes (fitness, mental health, nutrition, finance, etc.). </li><li>An Employee Assistance Program, including membership for guided meditation for all employees. </li><li>Monthly tech and wellness reimbursement. </li><li>An infinite supply of Liquid I.V. for endless hydration! <br/><br/></li></ul><strong> Work Environment: <br/><br/></strong>Hybrid office environment with flexibility for industry events. Travel <br/><br/>Candidates must be authorized to work in the United States without sponsorship.<br/><br/>The expected salary range for this position is $115,000 - $130,000 annually. The exact salary is determined by various factors including experience, skills, education, geographic location, internal company equity, and budget.<br/><br/>This job description indicates in general the nature and levels of work, knowledge, skills, abilities and other essential functions expected of the role. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required. It is not intended to limit or in any way modify the right of any supervisor to assign, direct, and control the work of employees under his/her supervision. Ability to competently perform all the essential duties of the position, with or without reasonable accommodation, demonstrated commitment to the company’s mission, and the ability to work productively as a member of a team or work group are basic requirements of all positions at Liquid I.V.<br/><br/>We are committed to building an inclusive culture of belonging that not only embraces the diversity of our people but also reflects the diversity of the communities in which we work and the customers we serve. We know that the happiest and highest performing teams include people with diverse perspectives that encourage new ways of solving problems, so we strive to attract and develop talent from all backgrounds and create workplaces where everyone feels seen, heard, and empowered to bring their full, authentic selves to work.<br/><br/>Liquid I.V. is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.", "responsibilities": "Liquid I.V. is looking for a motivated, fast, and strategic thinker who thrives in a fast-paced environment to join our Operations team as the Procurement Manager. This role is responsible for overseeing and managing the company’s supply chain operations for raw materials. You will collaborate with internal teams to forecast needs and manage costs effectively. This role will interface with internal Liquid I.V. stakeholders, Unilever, and external manufacturing partners.<br/><br/><strong> Functions and duties of this role include, but not limited to: <br/><br/></strong><ul><li>Lead and own open book costing for LIV network for raw materials ensuring cost adherence.</li><li>Partner closely with materials team to update current costs and rectify any costing issues between LIV and the supplier.</li><li>Maintain a LIV raw material approved supplier list.</li><li>Monitor raw material supplier performance.</li><li>Partner closely with Unilever on raw material sourcing and contract negotiation.</li><li>Lead fuel for growth projects for raw materials within the LIV portfolio.</li><li>Own raw material benchmarking analysis and partner closely with finance on financial benefits.</li><li>Support R&amp;D for ingredient sourcing and costing during development process.</li><li>Actively engage with R&amp;D partners during the early phase of innovation to identify suppliers for potential new ingredients.</li><li>Bridge the cross functional team and raw material supplier discussions to establish robust technical specifications, quality and compliance standards.</li><li>Collaborate with R&amp;D and QA teams on changes in raw material suppliers, materials, or processes that could impact product formulation and quality.</li><li>Work closely with cross-functional team on identifying and qualifying alternate suppliers for business resilience.</li><li>Performs other related duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Minimum 5-7 years’ experience in CPG or beverage industry. Prior experience managing raw material procurement. Strong spend analytics skills Highly organized and dependable. Verbal and demonstrated written communication skills. High degree of accuracy and attention to detail. Comfortable working in a very diverse, fast-paced environment, adhering to tight deadlines. Must be flexible, work well under pressure, and can readily adapt to changing business needs. Highly proficient in Microsoft Office (Excel, Word, and PowerPoint). Demonstrated ability to interact with external partners and colleagues in a thoughtful and attentive manner.", "preferred": "Bachelor’s Degree (preferably in business, economics, or another business-related field)"}, "skills": ["CPG", "Beverage Industry", "Raw Material Procurement", "Spend Analytics", "Microsoft Office", "Excel", "Word", "PowerPoint"], "postedDate": "2 days ago", "benefits": "100% company-paid medical, dental and vision insurance for employees (PPO, HMO and Kaiser options). A 401k plan with company match, short and long-term disability coverage. A generous PTO and sick policy that includes 13+ paid annual holidays. Wellness classes (fitness, mental health, nutrition, finance, etc.). An Employee Assistance Program, including membership for guided meditation for all employees. Monthly tech and wellness reimbursement. An infinite supply of Liquid I.V. for endless hydration!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987129728"}