{"jobTitle": "District Inventory Manager", "company": {"name": "Graybar", "location": "Diamond Bar, CA"}, "location": "Diamond Bar, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "91,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale", "description": "Become part of the excitement.<br/><br/>As a District Inventory Manager, you will oversee the district's inventory investment and goals in conjunction with Corporate Purchasing and Inventory Management. You will develop and direct Company strategies to increase market penetration through stock inventory in support of sales and marketing initiatives.<br/><br/><strong>In This Role You Will<br/><br/></strong><ul><li>Evaluate inventory levels, and take steps to maintain the correct balance in all areas of responsibility</li><li>Recommend stock levels for existing and new items, eliminating excess, obsolete, Do Not Order (DNO), and unwanted merchandise by working with suppliers, Corporate Inventory Planners, Inventory Management, and National Product Managers</li><li>Evaluate and mitigate inventory service failures; ensure the correct product is in stock at critical times throughout the year; evaluate supplier performance, and make recommendations to product and field management based on history and performance</li><li>Track material shipped from zones; add to local inventory as sales warrant; maintain New Items in Stock report, and communicate with the field and customers</li><li>Maintain appropriate relationships with customers and suppliers as applicable; participate as a member in all branch Stock Committees<br/><br/><br/></li></ul><strong>What You Bring To The Table<br/><br/></strong><ul><li>Minimum 5 years experience required with general knowledge of wholesale distribution industry, 11+ years preferred</li><li>4 year degree preferred</li><li>Knowledge of product lines and suppliers</li><li>Knowledge of inventory turns and GMROI metrics</li><li>Knowledge of continuous improvement techniques and practices</li><li>Analytical and mathematical skills</li><li>Problem solving and conflict resolution skills</li><li>Leadership and communication skills</li><li>Ability to develop and maintain relationships with key customers, suppliers, and branch personnel</li><li>Ability to work effectively with other branch, district, and Corporate personnel</li><li>Ability to effectively present the Company's services and quality standards to suppliers and others<br/><br/><br/></li></ul><strong>Pay Details<br/><br/></strong>The expected salary for this position is $91,000 - $105,000 annually depending on experience. This position is also bonus eligible based on specific and relevant business metrics.<br/><br/><strong><strong>Why should you join Graybar?<br/><br/></strong></strong>At Graybar, our employees are the heart and soul of our company. We believe that employees with diverse perspectives bring the ideas and innovative thinking we need to solve our biggest challenges and compete in an ever-changing world. Consistent with our values, we welcome people from all backgrounds, cultures and experiences into our company because we believe it’s the right thing to do and the right way to run our business.<br/><br/>We want each of our employees to know that they matter and to feel a sense of belonging, ownership and inclusion at Graybar. We believe that everyone should be treated with dignity and respect, and we work to build a collaborative environment where our employees have the opportunity to grow, learn and make a difference, both as individuals and as part of the team.<br/><br/>That’s what our employee ownership culture is all about: working as one team and moving forward together, while honoring the unique value each person brings to our company.<br/><br/><strong><strong>Apply now and find out what’s next for you.<br/><br/></strong></strong>At Graybar, we are known for our comprehensive benefits and our employee stock ownership plan! As a full-time employee of Graybar, you will accrue THREE weeks of vacation during your first 12 months, and will have access to a wide variety of our benefits. Benefits include: Medical Insurance and Prescription Drug, Dental Insurance, Vision Plan, Life Insurance, Flexible Spending Accounts, Disability Benefits, Profit Sharing Plan, 401(k) Savings Plan, Paid Vacation, Sick Days and Holidays, Employee Recognition Program<br/><br/>Equal Opportunity Employer/Vet/Disabled<br/><br/><strong><strong><em>Not the right fit? Let us know you're interested in a future opportunity by clicking Introduce Yourself in the top-right corner of the page or create an account to set up email alerts as new job postings become available that meet your interest!</em></strong></strong>", "responsibilities": "As a District Inventory Manager, you will oversee the district's inventory investment and goals in conjunction with Corporate Purchasing and Inventory Management. You will develop and direct Company strategies to increase market penetration through stock inventory in support of sales and marketing initiatives.", "qualifications": {"required": "Minimum 5 years experience required with general knowledge of wholesale distribution industry, 11+ years preferred", "preferred": "4 year degree preferred"}, "skills": ["Inventory Management", "Wholesale Distribution", "Continuous Improvement", "Analytical Skills", "Problem Solving", "Conflict Resolution", "Leadership", "Communication", "Customer Relationship Management", "Supplier Management", "Relationship Building", "Presentation Skills"], "postedDate": "4 days ago", "benefits": "At Graybar, we are known for our comprehensive benefits and our employee stock ownership plan! As a full-time employee of Graybar, you will accrue THREE weeks of vacation during your first 12 months, and will have access to a wide variety of our benefits. Benefits include: Medical Insurance and Prescription Drug, Dental Insurance, Vision Plan, Life Insurance, Flexible Spending Accounts, Disability Benefits, Profit Sharing Plan, 401(k) Savings Plan, Paid Vacation, Sick Days and Holidays, Employee Recognition Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987316245"}