{"jobTitle": "Associate Manager, DashMart - Systems Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Software Development", "description": "About The Team<br/><br/>DoorDash’s New Verticals organization focuses on accelerating one of our strategic pillars ⁠— DashMart, our grocery and convenience delivery offering. We’re building and scaling new ways to delight our customers, leveraging the DoorDash platform. The Warehousing as a Service (WaaS) team brings the full power of DashMart to customers with new use cases and new lines of business that will operate within our real estate.<br/><br/>About The Role<br/><br/>As the Associate Manager over Systems, you will be responsible for leading a team that executes all technical builds and changes for our 1,000+ live Warehousing as a Service concepts. You will also be responsible for collaborating with product operations and engineering teams to build new capabilities for our team.<br/><br/>You will report into Manager, Operations & Systems on our DashMart Warehousing as a Service team in our New Verticals organization.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Work with stakeholders like engineering, product operations, and business owners to scope out, design, and launch new product enhancements that enable our team to deliver best-in-class customer experiences </li><li>Lead a team of specialists and associates that build, update, and maintain 1,000+ live Warehousing as a Service concepts</li><li>Iterate on the team’s operational model to improve speed to launch new concepts and reduce the amount of errors with launches</li><li>Work closely with Account Managers and Sales Directors to ensure new partnerships are set up from success from Day 1. This includes scoping & defining technical capabilities, assessing integration feasibility, and collaborating to build net new technical solutions as needed.</li><li>With your team, own the end-to-end processes and execution for 100s of menu changes, new storefront and business builds, and technical support requests on a weekly basis<br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You have at least 2 years of experience leading high-performing, technical teams. You have a passion for developing talent and training team members on new technologies and processes. </li><li>You have 4 years of experience in a technical, business-facing role akin to product management, technical account management, technical customer support</li><li>You have a Bachelor's Degree or higher in a business or technical discipline</li><li>You have experience performing data analysis on a regular basis and can quickly interpret data points to understand root causes and potential solutions</li><li>You have significant experience writing queries and formulas in google sheets & SQL, and can quickly learn new tools (i.e. internal inventory systems, internal database systems, internal reporting systems)</li><li>You can easily learn and understand the backend of internal systems and how they interplay with each other</li><li>You can write and interpret product requirements, and work closely with engineering partners to ensure new product features are build to meet all possible use cases</li><li>You’re comfortable creating content and presenting to senior leadership, including documentation that summarizes technical problems and solutions<br/><br/></li></ul>We expect this position to be filled by 9/9/24<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$91,800—$135,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "As the Associate Manager over Systems, you will be responsible for leading a team that executes all technical builds and changes for our 1,000+ live Warehousing as a Service concepts. You will also be responsible for collaborating with product operations and engineering teams to build new capabilities for our team.", "qualifications": {"required": "You have at least 2 years of experience leading high-performing, technical teams. You have a passion for developing talent and training team members on new technologies and processes. \nYou have 4 years of experience in a technical, business-facing role akin to product management, technical account management, technical customer support\nYou have a Bachelor's Degree or higher in a business or technical discipline\nYou have experience performing data analysis on a regular basis and can quickly interpret data points to understand root causes and potential solutions\nYou have significant experience writing queries and formulas in google sheets & SQL, and can quickly learn new tools (i.e. internal inventory systems, internal database systems, internal reporting systems)\nYou can easily learn and understand the backend of internal systems and how they interplay with each other\nYou can write and interpret product requirements, and work closely with engineering partners to ensure new product features are build to meet all possible use cases\nYou’re comfortable creating content and presenting to senior leadership, including documentation that summarizes technical problems and solutions", "preferred": ""}, "skills": ["Product Management", "Technical Account Management", "Technical Customer Support", "Data Analysis", "Google Sheets", "SQL"], "postedDate": "3 days ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "remoteWork": "No", "salary": {"amount": "91,800—$135,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3987284156"}