{"jobTitle": "Safety & Operation Coordinator", "company": {"name": "Safe Place for Youth", "industry": "Individual and Family Services", "size": "100+ employees", "location": "Los Angeles, CA"}, "location": "Santa Monica, CA", "jobType": "Full-Time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$23.00 - $25.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Individual and Family Services", "description": "JOB TITLE: Safety & Operation Coordinator\n\nREPORTS TO: Director of Operations\n\nSCHEDULE: Monday-Friday (8:00am-4:30pm)\n\nSTATUS: Full-Time, 40 hrs/wk, Non-Exempt\n\nCELL PHONE: Reimbursement for use\n\nDRIVER POSITION: Yes [if yes, please reference driving policy]\n\nAbout Us\nSafe Place for Youth (SPY) is the leading service provider for youth experiencing or at-risk of homelessness in West Los Angeles. Founded in 2011, our agency offers trauma-informed, low barrier programs that support young people in exiting the streets and achieving stability so that they can thrive, not just survive. Our robust continuum of care includes street outreach, drop-in services, health and wellness programming, case management, education and employment services, and housing programs.\n\nSPY is a unique social impact agency that is committed to overcoming structural barriers to equity, community collaboration, and innovative youth-focused programming. If you have the skills, passion and collaborative spirit, join our growing team of over 100 employees.\n\nSPY strives to attract and develop individuals who reflect a broad spectrum of diversity, including (but by no means limited to) racial, ethnic, gender identity and socioeconomic dimensions. We believe that inclusion of diverse perspectives is essential to achieving long-term, systemic change. We explicitly seek applications from those who self-identify as coming from historically marginalized populations to enrich and elevate our equity-centered approach to problem-solving.\n\nAbout The Role\nThe Safety & Operation Coordinator works under the supervision of the Director of Operations. The Safety & Operation Coordinator supports the organization’s operations team with a variety of administrative tasks, including but not limited to managing calendars, creating purchase orders and expense requests, corresponding with staff and external stakeholders, conducting administrative work, and planning meetings and events. To be successful in this role, you should be well-organized, have great time management skills, and be able to act without guidance.", "responsibilities": "A wide range of administrative tasks to support the Director of Operations. Define, maintain and refine internal processes that support to the operations team, coordinating internal and external resources to expedite workflow. Monitor SPY general phone line and email account; manage the flow of information in a timely and accurate manner. Manage the director’s email, phone correspondence, and calendar; schedule meetings and events. Log, open, sort and distribute incoming mail. Conduct onsite and offsite assignments, coordination and purchases. Prepare meeting agendas and materials, and take meeting minutes. Prepare contracts and agreements for execution. Prepare PowerPoint presentations. Monitor budget including developing tracking mechanisms, tracking expenditures, providing reports, and liaising with finance. Maintaining expenditures and reconciling accounts; use budget tracking tool. Create purchase orders and expense forms; track and file invoices and expense forms. Participate in meetings as directed: generate agendas, record minutes, and support with follow-up and deliverables. Creating presentations, documents, files, spreadsheets, and databases. Support the HR department with admin functions as needed. Perform administrative work such as scanning, filing, making copies, entering data, etc. Support with COVID-19 policy enforcement and tracking as needed. Support with Safety tasks such as site and vehicle inspections and safety correspondence as needed. Multitask across multiple projects, triaging as necessary to ensure success. Maintain professionalism and strict confidentiality with all information and materials; exercise discretion. Order business cards for staff and manage business card submissions. Other duties and responsibilities as assigned to support the mission of the program and organization.", "qualifications": {"required": "High school diploma or general education degree (GED) is required. 1-2 years of experience performing administrative tasks is required. 1-2 years of experience creating presentations, documents, files, spreadsheets, and databases is required. 1-2 years of experience developing tracking mechanisms, tracking expenditures, providing reports, and liaising with finance is required. An uncompromising sense of integrity and ethics, discretion and confidentiality. A high quality of character and be honest, trustworthy and reliable. Ability to establish and maintain cooperative and effective working relationships with others. Excellent knowledge of Microsoft Suite and Google Suite; knowledge of Slack, Asana, DocuSign, Zoom and preferred. Strong analytical, writing and organization skills. Excellent time management skills with a proven ability to meet deadlines. Strong initiative and leadership skills. Ability to communicate effectively. Self-starter attitude.", "preferred": "Bachelor’s degree in any related field is a plus. 1-2 years of experience as a safety or operations coordinator or any similar role is preferred."}, "skills": ["Microsoft Suite", "Google Suite", "Slack", "Asana", "DocuSign", "Zoom"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Safe Place for Youth offers a competitive benefit package including comprehensive health coverage, 403b with agency contribution, and vacation/sick time. We also offer unique perks including weekly meditation/mindfulness and professional development opportunities that are tailored to your individual career growth.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987977842"}