{"jobTitle": "Hershey Part-Time Territory Sales Associate (San Bernardino, CA)", "company": {"name": "The Hershey Company", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Manufacturing", "description": "Location: San Bernardino, CA<br/><br/>Flexible Schedules Available<br/><br/>To be considered for this role, candidates must reside in or be willing to commute to:  The recommended living city is San Bernardino, but anywhere around it works as well.<br/><br/>This is a remote position<br/><br/>This position will require you to drive your personal vehicle 30-40 miles per day in your assigned territory. Mileage may vary depending on where you live in comparison to the territory. No car allowance is provided; however, mileage for travel will be reimbursed at 62 cents per mile.<br/><br/>A Part-Time role as a Territory Sales Associate (TSA) is a great way for a relationship-oriented person to flex their selling skills while representing some of the biggest and most exciting brands in America! Our TSAs will sell and insure best in class merchandising to include building displays, increasing distribution of our top selling items, and replenishing permanent secondary displays.<br/><br/>Work Schedule<br/><br/>This position is considered “Continuous Part-Time” working 20-25 hours per week. On average, a TSA will visit between 6-10+ accounts per day. This role offers flexible work schedules based on personal needs, territory needs and being present in stores when key decision makers are available. Your workday should overlap the core hours of 6:00am to 4:00pm, Monday through Friday, unless otherwise required by business needs.<br/><br/>A TSA earns an hourly wage plus an annual cash bonus, 401k, and paid vacation.<br/><br/>Major Duties &amp; Responsibilities<br/><br/><ul><li>Sell and maintain 100% distribution of all “authorized” Hershey Items in assigned territory. Ensuring flawless retail execution of Headquarter Sales and Merchandising Plans (Retail Execution Plan) with various retailers.</li><li>Achieve all merchandising objectives through the effective use of Permanent Secondary Displays and other display vehicles established within the Retail Execution Plan.</li><li>Reporting of weekly activity, expenses, account changes, promotions and all administrative functions within assigned territory.</li><li>Reporting of Daily activities through the use of tablets, submitting upon completion of each day.</li><li>Responsible for Sales Territory - Varies due to territory size, number of retailers, and location.<br/><br/></li></ul>Job Requirements Needed:<br/><br/><ul><li>Must have a valid US state issued driver’s license</li><li>Must have a personal vehicle in sound operating condition</li><li>ust maintain personal auto insurance indicating minimum coverage of $100,000 per person / $100,000 per accident / $100,000 property damage. The policy must permit business use.</li><li>Must reside or be willing to commute within the territory boundaries as listed in the job description</li><li>Must be able to drive long distances to make multiple sales calls on a daily basis</li><li>Must be able to lift 10-40 lbs. on a regular basis with or without reasonable accommodations</li><li>Must be able to bend, kneel, stoop down and demonstrate manual dexterity on a frequent basis with or without reasonable accommodations</li><li>Must be able to use tablet technology</li><li>Must have daily access to wireless internet</li><li>Must have flexibility and adaptability to changes in territory coverage</li><li>Availability to work 20-25 hours per week</li><li>Education: High School Diploma or GED equivalent</li><li>Experience: 3-4 years food merchandising is preferred but not required<br/><br/></li></ul>So, what do you say? Would you like to represent fun brands like Reese’s, Hershey’s Kisses, Twizzlers and Jolly Ranchers in your spare time?<br/><br/>If so…apply today! We’d love to hear from you!<br/><br/>2/2023", "responsibilities": "<ul><li>Sell and maintain 100% distribution of all “authorized” Hershey Items in assigned territory. Ensuring flawless retail execution of Headquarter Sales and Merchandising Plans (Retail Execution Plan) with various retailers.</li><li>Achieve all merchandising objectives through the effective use of Permanent Secondary Displays and other display vehicles established within the Retail Execution Plan.</li><li>Reporting of weekly activity, expenses, account changes, promotions and all administrative functions within assigned territory.</li><li>Reporting of Daily activities through the use of tablets, submitting upon completion of each day.</li><li>Responsible for Sales Territory - Varies due to territory size, number of retailers, and location.<br/><br/></li></ul>", "qualifications": {"required": "Must have a valid US state issued driver’s license\nMust have a personal vehicle in sound operating condition\nust maintain personal auto insurance indicating minimum coverage of $100,000 per person / $100,000 per accident / $100,000 property damage. The policy must permit business use.\nMust reside or be willing to commute within the territory boundaries as listed in the job description\nMust be able to drive long distances to make multiple sales calls on a daily basis\nMust be able to lift 10-40 lbs. on a regular basis with or without reasonable accommodations\nMust be able to bend, kneel, stoop down and demonstrate manual dexterity on a frequent basis with or without reasonable accommodations\nMust be able to use tablet technology\nMust have daily access to wireless internet\nMust have flexibility and adaptability to changes in territory coverage\nAvailability to work 20-25 hours per week\nEducation: High School Diploma or GED equivalent", "preferred": "Experience: 3-4 years food merchandising is preferred but not required<br/><br/>"}, "skills": [], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988616130"}