{"jobTitle": "Product Designer", "company": {"name": "Meta", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "135,000.00/yr - 194,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Technology, Information and Internet", "description": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary design teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe. As a product designer at Meta, you’ll have the opportunity to play a central role in the way we build technologies — ensuring they are valuable, easy to use and of the highest level of craft and execution. You’ll be involved in every aspect of the product development process, from brainstorming the next great product innovation to tweaking pixels right before launch. We’ll expect you to utilize your full range of product design, interaction design and visual design skills, while contributing to high-level strategic decisions with product and executive partners. Join a diverse group of thinkers and do some of the most meaningful work of your career. This posting represents different full-time roles across the Meta company.<br/><br/>Product Designer Responsibilities:<br/><br/><ul><li>Take broad, conceptual ideas and turn them into something useful and valuable for our 2 billion plus users</li><li>Design flows and experiences that simplify and distill down complex actions into usable interfaces</li><li>Design new experiences or layouts that evolve and define visual systems</li><li>Contribute to strategic decisions around the future direction of Facebook products</li><li>Give and solicit feedback from designers and a broader product team in order to continually improve for quality</li><li>Drive a partnership with product managers, engineers, researchers and content strategists in order to oversee the user experience of a product from conception until launch</li><li>Willingness to represent work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>4+ years of experience building and shipping multiple features that are broad/ambiguous in scope and encompass an end-to-end experience across a variety of platforms.</li><li>4+ years of interaction design experience with knowledge to define how an experience should behave based on understanding people's needs, plus consideration of how this product will scale. Use appropriate prototyping tools to demonstrate how a particular flow or interaction will work.</li><li>4+ years of visual design experience with proficiency in typography, desktop/mobile UI, color, layout, iconography and aesthetic sense and how these elements impact product function.</li><li>4+ years of strategic product thinking with experience in developing product goals, identifying opportunities, and making decisions based on the impact to people and the company.<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience connecting your work with other related initiatives across the company while driving collaboration</li><li>Examples of leadership in non-product dimensions that have made a team stronger and positively impacted the work environment such as taking on mentorship opportunities<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$135,000/year to $194,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Take broad, conceptual ideas and turn them into something useful and valuable for our 2 billion plus users\nDesign flows and experiences that simplify and distill down complex actions into usable interfaces\nDesign new experiences or layouts that evolve and define visual systems\nContribute to strategic decisions around the future direction of Facebook products\nGive and solicit feedback from designers and a broader product team in order to continually improve for quality\nDrive a partnership with product managers, engineers, researchers and content strategists in order to oversee the user experience of a product from conception until launch\nWillingness to represent work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts.", "qualifications": {"required": "4+ years of experience building and shipping multiple features that are broad/ambiguous in scope and encompass an end-to-end experience across a variety of platforms.\n4+ years of interaction design experience with knowledge to define how an experience should behave based on understanding people's needs, plus consideration of how this product will scale. Use appropriate prototyping tools to demonstrate how a particular flow or interaction will work.\n4+ years of visual design experience with proficiency in typography, desktop/mobile UI, color, layout, iconography and aesthetic sense and how these elements impact product function.\n4+ years of strategic product thinking with experience in developing product goals, identifying opportunities, and making decisions based on the impact to people and the company.", "preferred": "Experience connecting your work with other related initiatives across the company while driving collaboration\nExamples of leadership in non-product dimensions that have made a team stronger and positively impacted the work environment such as taking on mentorship opportunities"}, "skills": [], "postedDate": "8 hours ago", "applicationDeadline": "", "benefits": "$135,000/year to $194,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3988530423"}