{"jobTitle": "Document Custody Operations - Vice President", "company": {"name": "Jobs via eFinancialCareers", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$107,500.00 to $167,625.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "You will be responsible for the operational management and support of current and future-state processes within Document Custody Operations. The Document Custody Operations team (750+ staff over multiple shifts in 2 locations) processes over 45,000 document related transactions daily. This includes the receipt of upwards of 5k packages containing upwards of 30k files daily, the sorting and directing of these files to the appropriate Operations' teams, for New Collateral Reviews, Loan file reinstatements and the accurate management and filing of these new files with over 23mm files in existing inventory for safekeeping and the fulfillment of 10k Release/shipping requests daily for over 100 clients. This Operation supports a rapidly growing Global Transaction Banking, Document Custody business requires an understanding of time sensitive operations due to the various intraday deadlines that are critical to the secondary market of funding mortgage loans.", "responsibilities": "Coordinates the operational activities for assigned functional areas. Monitor and manage various Service Level Agreements (SLA's) with the emphasis volumes and on hourly status assessment. Ensure quality service and effective operations support for all assigned internal and external customers. Accomplish results through the effective management of all staff that range various levels. Promote continuous improvement and driving group strategy and change across several initiatives, minimizing risks, mitigating issues, and escalating where appropriate, being commercial and identify opportunities to reduce costs for the function. Provide stakeholders with clear status updates to assist the delivery of timely, accurate, and compliant business requirement documentation.", "qualifications": {"required": "Bachelor's degree preferred, along with Moderate of work experience in Document Custody Operations or Loan Servicing environment. Moderate experience of Management. Ability to train team members in providing exceptional levels of service. Experience with embtrust application, Advanced computer skills, Microsoft skills. Ability to manage and prioritize numerous tasks concurrently.", "preferred": "Strong communication and leadership experience with an empowering mindset. Manages complexity - Analyzes a high volume of complex and sometime contradictory information to effectively solve problems and make informed decisions with calculated risk. Experience in managing mid-large-scale operations with a good understanding of either Document Custody, Loan Servicing, Fulfillment Operations and or in Records Management. Strong understanding of GSE's Fannie Mae, Freddie Mac, and Ginnie Mae custodial guide requirements. Ability to adapt to change in real time meeting demands while maintaining operational sustainability."}, "skills": ["Operational Management", "Service Level Agreements (SLA)", "Quality Service", "Continuous Improvement", "Leadership", "Communication", "Microsoft Skills"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "A diverse and inclusive environment that embraces change, innovation, and collaboration. Employee Resource Groups support an inclusive workplace for everyone and promote community engagement. Retirement Savings Plans, Parental Leave, and other family-friendly programs. Educational Resources including College Coaching, Sponsorship [Tuition and Test Prep] Programs, and Student Loan Refinancing. Competitive compensation packages including health and wellbeing benefits, retirement savings plans, parental leave, and family building benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988019370"}