{"jobTitle": "Senior Designer", "company": {"name": "SBH Fashion", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000 - $120,000", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Staffing and Recruiting", "description": "Young mens streetwear company looking for Senior Designer. The ideal candidate will have experience in designing for young mens / streetwear. Must be proficient in Adobe Creative Suite. Looking for creative individual strong on trend and graphics experience a plus. Must be able to work in a fast paced environment. 5 days in office.<br/><br/>Responsibilities:<br/><br/><ul><li>Assist Creative Director in developing seasonal collections </li><li>Ensure designs reflect current trends in the young men’s streetwear market</li><li>Oversee the entire design process from concept development to final product, including sketching, CADs, and tech packs.</li><li>Collaborate with cross-functional teams to align design objectives with merchandising, production, and sales strategies.</li><li>Mentor and provide guidance to junior designers, fostering their growth and development within the company.</li><li>Conduct trend research and analysis to inform design direction and product development.</li><li>Review and approve sample prototypes, providing feedback on fit, fabric, and construction.</li><li>Present design concepts and collections to senior management and key stakeholders.</li><li>Stay abreast of industry trends, competitor activity, and market dynamics to identify opportunities for innovation and growth.<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Bachelor's degree in Fashion Design or related field.</li><li>5+ years of experience in apparel design </li><li>Proficiency in Adobe Creative Suite and Microsoft Office Suite.</li><li>Strong sketching and illustration skills.</li><li>In-depth knowledge of garment construction, textiles, and production processes.</li><li>Excellent leadership, communication, and interpersonal skills.</li><li>Ability to inspire and motivate a creative team in a fast-paced environment.</li><li>Strategic thinking and a results-oriented mindset.</li><li>Passion for fashion and a deep understanding of consumer preferences and market trends.<br/><br/></li></ul>", "responsibilities": "Assist Creative Director in developing seasonal collections Ensure designs reflect current trends in the young men’s streetwear market Oversee the entire design process from concept development to final product, including sketching, CADs, and tech packs. Collaborate with cross-functional teams to align design objectives with merchandising, production, and sales strategies. Mentor and provide guidance to junior designers, fostering their growth and development within the company. Conduct trend research and analysis to inform design direction and product development. Review and approve sample prototypes, providing feedback on fit, fabric, and construction. Present design concepts and collections to senior management and key stakeholders. Stay abreast of industry trends, competitor activity, and market dynamics to identify opportunities for innovation and growth.", "qualifications": {"required": "Bachelor's degree in Fashion Design or related field. 5+ years of experience in apparel design Proficiency in Adobe Creative Suite and Microsoft Office Suite. Strong sketching and illustration skills. In-depth knowledge of garment construction, textiles, and production processes. Excellent leadership, communication, and interpersonal skills. Ability to inspire and motivate a creative team in a fast-paced environment. Strategic thinking and a results-oriented mindset. Passion for fashion and a deep understanding of consumer preferences and market trends.", "preferred": ""}, "skills": ["Adobe Creative Suite", "Fashion Design", "Apparel Design", "Sketching", "Illustration", "Garment Construction", "Textiles", "Production Processes", "Leadership", "Communication", "Interpersonal Skills", "Strategic Thinking", "Results-Oriented", "Fashion", "Consumer Preferences", "Market Trends"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988420402"}