{"jobTitle": "Chief Operating Officer", "company": {"name": "Acuity Eye Group", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management", "industry": "Hospitals and Health Care", "description": "The role of the Chief Operating Officer is to build high performing Operations teams that are focused on creating the optimal patient experience. This leader will serve as a role model for demonstrating the Acuity values and leadership competencies and will hold the Operations teams to these high standards. A primary responsibility is to ensure the overall financial performance of all Acuity operations, specifically revenue and profit growth for each medical clinic, surgery center, and Acuity Optical. Partnering closely with Acuity physicians and optometrists to ensure we are creating environments where they can practice as effectively and efficiently as possible is also a priority. Also partners with key external customers.", "responsibilities": "Will be responsible for operational strategy development and annual planning regarding objectives and incentive targets. Will hold leaders accountable to KPI’s and achieving established annual goals. Through consistent communication, will develop strong relationships with Acuity MD’s and OD’s to engage them in helping to improve Acuity operations and provider efficiency. Partners with key operations leaders to consistently implement standards and best operational practices. Ensures management creates an accountable environment where patient care comes first. Assists in helping practitioners have the support they need for a thriving practice. Coaches entire team to develop comprehensive, financially successful practices, improve encounter efficiency and ensure patient retention. Establishes, communicates, and implements operations-related policies and practices to ensure effective and consistent execution. Ensures that departmental decisions and project plans such as those for staffing, development, materials, and facilities are in line with approved budgets. Participates in the budget process to ensure departments establish targets and operate within approved budgets. Provides operational updates to executive team and board of directors. Participate in implementing contracts with payors, providers, healthcare systems, and vendors. Ensures Operations leaders are recruiting, selecting, and onboarding new team members that will result in an effective onboarding experience and strong employee loyalty. Will build strong relationships with external physicians to achieve revenue targets. Responsible for partnering with others to create training and development programs for teams to ensure skill development. Partners closely with Support Department leadership to ensure that each location achieves their objectives and maximizes the support they receive. Drives year-over-year revenue and profit growth for each practice/region assigned; meets/exceeds budgets for each practice assigned. Monitors schedules at all locations to ensure maximized encounters. Drives Optical sales in all locations where Optical is located. Manages staff costs to ensure efficient productivity and patient flow. Maintains an appropriate professional appearance and demeanor in accordance with Company policies. Keeps commitments and keeps President informed of work progress, timetables, and issues. Maintains strict compliance with State, Federal and other regulations (e.g., OSHA, WC, HIPAA, ADA, FEHA, DOL, HR policies and practices). Other duties as assigned by management.", "qualifications": {"required": "Bachelor’s degree in Business, Healthcare Administration or related degree. A minimum of 10 years of progressively responsible management experience in complex business environments. Prior experience in multi-unit businesses required.", "preferred": "Master’s degree in Business, Finance, or Healthcare Administration. Prior leadership experience in ophthalmology or healthcare leadership roles."}, "skills": ["Growing Revenue and Profit", "Developer of Staff", "Influencer of professionals", "Strategic Planner", "Business Acumen", "Effective Collaborator with Peers and Support Resources"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988737179"}