{"jobTitle": "Bookkeeper", "company": {"name": "TACSIS", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "55,000.00 - 65,000.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Accounting", "description": "at TACSIS<br/><br/>On-Site in Torrance, CA<br/><br/>TACSIS (https://www.tacsis.com/) takes dynamic companies, wealthy family groups and real estate professionals further, faster, by delivering specialized tax and accounting solutions and legal advisory at every stage of company growth. Versed in California's rapid pace and unique business environment, TACSIS has helped 100+ companies achieve success since 2005. Offering deep knowledge of both tax and accounting allows TACSIS to manage the most complex financial situations and give clients the experience and personal attention of a boutique firm.<br/><br/>TACSIS is seeking on-site **Bookkeeper** to join the team and help drive the firm’s next stage of growth. This role is an excellent opportunity for a bookkeeper with experience managing financial statements and client communications to join an established boutique firm as it prepares to scale its impact. If you enjoy reconciling complex real estate and investment portfolios, possess the organization and communication skill to help clients succeed financially, and value a collaborative and cross-functional working culture, the TACSIS team wants to hear from you!<br/><br/>**Responsibilities<br/><br/>**The Bookkeeper’s primary objective is to manage regular bookkeeping responsibilities on behalf of clients to ensure their financial compliance and success. Job responsibilities include the following:<br/><br/><ul><li>Manage monthly bookkeeping for clients with real estate and investment portfolios </li><li>Reconcile bank accounts </li><li>Oversee journal entries </li><li>Contribute to payroll, accounts receivable, accounts payable, and general ledger </li><li>Coordinate with tax and accounting colleagues </li><li>Communicate and follow up with clients as necessary </li><li>Successfully utilize bookkeeping software tools to perform tasks <br/><br/></li></ul>**Qualifications<br/><br/>**<ul><li>Three years of bookkeeping experience </li><li>Proficiency in QuickBooks accounting software </li><li>Proficiency in cash, accrual, and equity methods of accounting </li><li>Familiarity with common financial statements (income statement, balance sheets, etc.) </li><li>Familiarity with investment concepts (K-1 Schedules, rolling retained earnings, etc.) </li><li>Familiarity with bill.com and XERO software platforms </li><li>Strong client-service orientation </li><li>Professionalism in verbal and written communications </li><li>Willing to “wear many hats” as a necessary in a collaborative, boutique firm </li><li>Able to work on-site from TACSIS offices in Torrance, CA <br/><br/></li></ul>**Compensation And Benefits<br/><br/>**The expected base compensation range begins at $55,000 - $65,000 annually.<br/><br/>TACSIS provides employees with competitive benefits including healthcare coverage (medical, dental), 401k retirement matching, and paid time off (holidays, PTO, sick time).<br/><br/>This role is a full-time, at-will role.<br/><br/>**Application process<br/><br/>**To be considered for this role, please complete the online application, including submission of the following documents:<br/><br/><ul><li>Resume including contact information </li><li>A brief statement of interest in the role </li><li>A list of bookkeeping software tools with which you are familiar <br/><br/></li></ul>To inquire further about the role, please contact Luke Anthony Peña at luke@tacsis.com.", "responsibilities": "The Bookkeeper’s primary objective is to manage regular bookkeeping responsibilities on behalf of clients to ensure their financial compliance and success. Job responsibilities include the following:<br/><br/><ul><li>Manage monthly bookkeeping for clients with real estate and investment portfolios </li><li>Reconcile bank accounts </li><li>Oversee journal entries </li><li>Contribute to payroll, accounts receivable, accounts payable, and general ledger </li><li>Coordinate with tax and accounting colleagues </li><li>Communicate and follow up with clients as necessary </li><li>Successfully utilize bookkeeping software tools to perform tasks <br/><br/></li></ul>", "qualifications": {"required": "Three years of bookkeeping experience, Proficiency in QuickBooks accounting software, Proficiency in cash, accrual, and equity methods of accounting, Familiarity with common financial statements (income statement, balance sheets, etc.), Familiarity with investment concepts (K-1 Schedules, rolling retained earnings, etc.), Familiarity with bill.com and XERO software platforms, Strong client-service orientation, Professionalism in verbal and written communications, Willing to “wear many hats” as a necessary in a collaborative, boutique firm, Able to work on-site from TACSIS offices in Torrance, CA"}, "skills": ["QuickBooks", "bill.com", "XERO"], "postedDate": "3 weeks ago", "benefits": "TACSIS provides employees with competitive benefits including healthcare coverage (medical, dental), 401k retirement matching, and paid time off (holidays, PTO, sick time).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988887333"}