{"jobTitle": "Inside Sales Associate - Remote", "company": {"name": "Local Splash - Local SEO Company", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "salary": {"amount": "$10.00/hr - $18.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>Company Overview<br/><br/></strong>Are you a hungry sales professional looking for warm leads to be provided for you?<br/><br/>Are you looking for a career where you can grow?<br/><br/>Does the thought of selling a product you believe in while working 100% remote excite you?<br/><br/>Then we want to meet you! Join our Local Splash family and love where you work!<br/><br/>We are growing quickly as we expand to new territories and are looking for hungry and talented sales professionals to help drive that growth! If you are someone who thrives in a fast-paced environment, enjoys working with people and has a strong student mentality - read on!<br/><br/>We provide an amazing opportunity with a company that has upward career opportunities, a phenomenal sales compensation structure and a fun and laid back atmosphere. This is a full-time work from home opportunity from Monday to Friday, 7:00am to 4:00pm (PST).<br/><br/>Responsibilities and Duties<br/><br/><ul><li>Connect via phone with 150 - 200 cold prospects on a daily basis (autodialer)</li><li>Receive inbound calls through an automated dialer system</li><li>Conduct outbound follow-up calls to warm prospective clients</li><li>Generate interest in business owners and qualify their businesses</li><li>Gather information to help determine right-sized solutions for clients<br/><br/></li></ul><strong>Qualifications And Skills<br/><br/></strong><ul><li>1+ years of experience with: Inside sales, phone sales, cold calling, SaaS</li><li>1+ years of experience working remotely and or/ work from home environment</li><li>1+ years of SEO experience and/or Google Ads preferred</li><li>Demonstrate technical proficiency with virtual communication tools and G Suite</li><li>Excellent communication and organizational skills, outgoing and ambitious</li><li>Goal driven, self-starter, student mentally, detail-oriented and punctual</li><li>Ability to build rapport with small and medium sized, service-based business owners</li><li>Demonstrate integrity in interactions with clients and coworkers</li><li>Display a mature, professional and positive demeanor</li><li>Demonstrate our core values when handling confidential client information</li><li>Strive to meet and exceed weekly and monthly metrics and goals</li><li>Must have proficient computer and multi-tasking skills</li><li>Experience with Vicidial, Paylocity, Zoiper (or similar) and VPN preferred<br/><br/></li></ul>Technical Requirements<br/><br/><ul><li>Ethernet connection from computer to modem required</li><li>Reliable power and High Speed internet service (fiber service ideal)</li><li>Ability to quickly multitask between multiple tabs</li><li>Ability to use hotkeys and shortcuts</li><li>Workstation ready; to include Windows based PC, headset, keyboard and mouse<br/><br/></li></ul>Benefits and Perks<br/><br/><ul><li>UNCAPPED bonuses!</li><li>Base introductory hourly rate $10 ~ $18</li><li>OTE: $35,000 ~ $45,000 a year</li><li>Full-time opportunity: Monday - Friday 7:00am - 4:00pm (PST). No weekends!</li><li>Incentives such as spiffs, prizes, contests, bonuses, etc</li><li>Fantastic benefits: medical, dental (CA Residents), paid holidays and 401(k)</li><li>Paid time off: vacation, personal and sick time</li><li>Employee Referral bonus program - up to $300 per referral<br/><br/></li></ul>Local Splash is an equal opportunity employer. We embrace diversity and we are committed to creating a versatile and fun environment for all employees.<br/><br/>Powered by JazzHR<br/><br/>s7fgcWPEWN", "responsibilities": "Responsibilities and Duties<br/><br/><ul><li>Connect via phone with 150 - 200 cold prospects on a daily basis (autodialer)</li><li>Receive inbound calls through an automated dialer system</li><li>Conduct outbound follow-up calls to warm prospective clients</li><li>Generate interest in business owners and qualify their businesses</li><li>Gather information to help determine right-sized solutions for clients<br/><br/></li></ul>", "qualifications": {"required": "1+ years of experience with: Inside sales, phone sales, cold calling, SaaS, 1+ years of experience working remotely and or/ work from home environment, Demonstrate technical proficiency with virtual communication tools and G Suite, Excellent communication and organizational skills, outgoing and ambitious, Goal driven, self-starter, student mentally, detail-oriented and punctual, Ability to build rapport with small and medium sized, service-based business owners, Demonstrate integrity in interactions with clients and coworkers, Display a mature, professional and positive demeanor, Demonstrate our core values when handling confidential client information, Strive to meet and exceed weekly and monthly metrics and goals, Must have proficient computer and multi-tasking skills, Experience with Vicidial, Paylocity, Zoiper (or similar) and VPN preferred", "preferred": "1+ years of SEO experience and/or Google Ads preferred"}, "skills": ["Inside sales", "phone sales", "cold calling", "SaaS", "SEO", "Google Ads", "virtual communication tools", "G Suite", "communication", "organizational skills", "goal driven", "self-starter", "detail-oriented", "punctual", "rapport building", "integrity", "professionalism", "confidential information handling", "metrics", "computer skills", "multi-tasking", "Vicidial", "Paylocity", "Zoiper", "VPN"], "postedDate": "3 weeks ago", "benefits": "UNCAPPED bonuses!, Base introductory hourly rate $10 ~ $18, OTE: $35,000 ~ $45,000 a year, Full-time opportunity: Monday - Friday 7:00am - 4:00pm (PST). No weekends!, Incentives such as spiffs, prizes, contests, bonuses, etc, Fantastic benefits: medical, dental (CA Residents), paid holidays and 401(k), Paid time off: vacation, personal and sick time, Employee Referral bonus program - up to $300 per referral", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988803521"}