{"jobTitle": "Policy Specialist, Legal Investigations Support (English, Hindi)", "company": {"name": "Google", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>Experience, including internships, in a policy, legal, Trust and Safety, or technology environment.</li><li>Experience working in law enforcement, data disclosure, compliance, or a related field.</li><li>Ability to communicate in Hindi and English fluently to translate legal requests and interpret flagged content.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience with the implementation and maintenance of policy.</li><li>Experience collaborating within a team setting through knowledge sharing of policy or process procedure and implementation.</li><li>Ability to work independently while also being able to quickly pivot and adapt to new tasks/responsibilities with limited guidance or supervision.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>The Legal Investigations Support (LIS) team handles requests for user data received from Government agencies, courts, and parties in criminal and civil litigation. LIS handles a high-volume of these legal requests, processing them through internal tools based on complex internal policy and workflows utilizing queue management and metric performance.<br/><br/>In this role, you will work with sensitive content or situations and may be exposed to graphic, controversial, and/or upsetting topics or content. Some of those investigations will be routine, others may very well be on the news. This team needs people who respect confidentiality, and are sensitive to legal requirements and user privacy laws.<br/><br/>The US base salary range for this full-time position is $84,000-$123,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Apply standard tools, resources, and processes to respond to inquiries and escalations from law enforcement agencies or third-party attorneys.</li><li>Review, process, and respond to legal requests, related to real-world investigations on Google users, utilizing queue management and metric performance workflows and procedures.</li><li>Deliver impactful and meaningful contributions by illustrating understanding of policies and workflows through trend analysis and clear documentation to drive change and/or adapted guidance, engaging with stakeholders and partners cross-functionally when appropriate.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "jobFunction": "Legal and Public Relations", "industry": "Information Services and Technology, Information and Internet", "postedDate": "12 hours ago", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\nExperience, including internships, in a policy, legal, Trust and Safety, or technology environment.\nExperience working in law enforcement, data disclosure, compliance, or a related field.\nAbility to communicate in Hindi and English fluently to translate legal requests and interpret flagged content.", "preferred": "Experience with the implementation and maintenance of policy.\nExperience collaborating within a team setting through knowledge sharing of policy or process procedure and implementation.\nAbility to work independently while also being able to quickly pivot and adapt to new tasks/responsibilities with limited guidance or supervision."}, "salary": {"amount": "84,000.00/yr - $123,000.00/yr", "currency": "USD"}, "skills": ["Policy", "Legal", "Trust and Safety", "Technology", "Law Enforcement", "Data Disclosure", "Compliance", "Hindi", "English", "Translation", "Interpretation", "Teamwork", "Knowledge Sharing", "Independence", "Adaptability", "Queue Management", "Metric Performance", "Confidentiality", "User Privacy Laws"], "url": "https://www.linkedin.com/jobs/view/3988743554"}