{"jobTitle": "Business Analyst - Health Plan / Managed Care", "company": {"name": "ShiftCode Analytics, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Information Technology & Services", "description": "We need a Business Analyst with Health Plan / Managed Care experience for a 6+ month contract role for a Healthcare client in Los Angeles, CA.<br/><br/>This role will be Remote full time for the first several months, but will convert to being a HYBRID remote/onsite role in the future. This means we strongly prefer someone who lives in CA . The role may also convert to Full Time Equivalent (FTE) status after 6 months, so we strongly prefer candidates who have a Green Card or are a US Citizen .<br/><br/><strong>Job Summary<br/><br/></strong>The Enterprise Portfolio Management Office Solutions Analyst is accountable for intake, execution, and managing the oversight of strategic programs and projects approved and budgeted by Leadership. These programs and projects span multiple functions and departments, and are enterprise investments in infrastructure and process excellence. The portfolio, program, and project management resources within the ePMO are uniquely positioned to support business units in the planning and delivery of large-scale programs and projects. The Shared Services team within the ePMO operates as a center of excellence for portfolio management, and will provide leadership and support in ensuring the ePMO leverages project management best practices when initiating projects, and while monitoring and reporting the status of those projects to project and business leadership. Under the general direction of the Manager, and following best practices based on BABOK and other authoritative bodies, the Solutions Analyst is a critical thinker who is responsible for eliciting, analyzing, communicating, testing and verifying functional and non-functional business requirements for strategic initiatives, assisting with the definition of Acceptance Test Criteria, and ensuring requirements are specific, testable, and in alignment with business goals and architecture. This position will work with business and technology resources to temper and align preferences to develop collective and valuable solutions to business needs.<br/><br/>Duties<br/><br/>Leads analysis and requirements gathering sessions using methodologies such as JAD, JAR, SCRUM, etc., to define, analyze, and document business needs and requirements in support of strategic initiatives. Documents functional and non-functional business needs and requirements, ensuring requirements are usable, specific and testable, and in alignment to business goals and overall business architecture. Assists in defining Acceptance Test Criteria, tracing back to documented business requirements. Follows defined best practices for the organization based on BABOK or other authoritative bodies of knowledge. Creates and updates as-is and future state business workflows to enable the documentation of business process needs and production of requirements for all related business, and operational systems critical to the project or program. Makes recommendations for solutions or improvements that can be accomplished through new process or technology, or alternative uses of existing processes or technology. Researches and analyzes data in support of business functions, process knowledge, and systems requirements. Tracks maintenance of business need and requirements to ensure they are not attenuated or discarded during the execution and delivery phases. Supports the Project Manager by providing more detailed project objectives; clear structured, and useable requirements; tradeoff analysis; requirement feasibility; and risk analysis to improve the execution of the project plan. Conducts analysis in support of the entire ePMO. Perform other duties as assigned.<br/><br/>Education Required<br/><br/>Bachelor's Degree in Related Field<br/><br/>In lieu of degree, equivalent education and/or experience may be considered.<br/><br/><strong>Education Preferred<br/><br/></strong>Master's Degree in Related Field<br/><br/><strong>Required Experience<br/><br/></strong>The position requires extensive business requirements writing experience<br/><br/>Minimum of 5 years of experience eliciting and documenting business and systems requirements using techniques such as JAR/JAD, SCRUM, etc. OR minimum of 5 years of experience developing, implementing, and evaluating workflow processes, policies, and procedures. Minimum of 7 years of experience in managed healthcare environment with strong domain expertise in at least one of the following disciplines: Claims/EDI, Membership, Provider, Care Management, or Finance.<br/><br/><strong>Preferred Experience<br/><br/></strong>Experience with JIRA, Confluence, Tableau and Requirements Management software.<br/><br/><strong>Skills<br/><br/></strong>Required:<br/><br/>Proven ability to work with a diverse group of people, including leadership, support staff, coworkers and department management. Demonstrated ability to research issues and bring about resolution either directly or with the assistance of others. Demonstrated critical thinking and problem solving skills. Strong elicitation and process documentation skills. Strong organizational and communication skills to build and foster effective relationships. Excellent computer skills; MS Office Suite (Word, Excel, Visio, PowerPoint) skills required. Excellent customer service skills with the ability to make independent judgments, handle multiple projects simultaneously, adapt to shifting priorities and utilize time management skills to meet deadlines. Must have excellent written and verbal communications skills and the ability to communicate effectively with management and non-management personnel. Ability to maintain a professional and mature demeanor at all times. Ability to work in a fast-paced department independently or in a team, and handle multiple tasks with competing priorities; work with interruptions and deal effectively with confidential information.", "postedDate": "3 weeks ago", "skills": ["JIRA", "Confluence", "Tableau", "Requirements Management", "MS Office Suite", "Word", "Excel", "Visio", "PowerPoint", "Critical Thinking", "Problem Solving", "Elicitation", "Process Documentation", "Organizational Skills", "Communication Skills", "Customer Service", "Time Management", "Written Communication", "Verbal Communication"], "url": "https://www.linkedin.com/jobs/view/3988762188"}