{"jobTitle": "Supply Chain Operations Analyst I (Customs/Brokerage)", "company": {"name": "CEVA Logistics", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "CEVA Logistics provides global supply chain solutions to connect people, products and providers all around the world. Present in 170 countries and with more than 110,000 employees spread over 1,300 sites, we are well on our way to achieving our vision: to be a Top 5 global 3PL.<br/><br/>We believe that our employees are the key to our success. We want to engage and empower our diverse, global team to co-create value with our customers through our solutions in contract logistics and air, ocean, ground, and finished vehicle transport. That is why CEVA Logistics offers a dynamic and exceptional work environment that fosters personal growth, innovation, and continuous improvement.<br/><br/>DARE TO GROW! Join CEVA Logistics, and you will be part of a team that values imagination, encourages boldness and exemplarity, and is committed to excellence in everything we do. Join us in our mission to shape the future of global logistics as we become a global leader in the logistics industry. As we continue growing at a fast pace, will you “Dare to Grow” with us?<br/><br/>Salary Pay Range: $67,367 to $96,095<br/><br/>YOUR ROLE<br/><br/>Are you known for your attention to detail and analytical skills? Are you passionate about delivering innovative support to supply chain customers? If so, we have an opportunity that would allow you to execute valuable responsibilities and contribute to delivering superior supply chain services. <br/><br/>WHAT ARE YOU GOING TO DO?<br/><ul><li>Manage complete daily, weekly, and monthly reporting requirements for performance, compliance and invoicing, which requires report development and analytics. Perform a variety of calculations, analyses and audits of financial and operational results; typically involves fundamental professional related supply chain principles. </li><li>Analyze operational or transportation details to identify potential areas for improvement, savings or efficiency; including innovative solutions. </li><li>Oversee data integrity - review, classify, audit and record information within the appropriate systems or files; requires knowledge of professional related supply chain principles.</li><li>Ensure processes and operations comply with applicable laws, rules and regulations; seeking advice and interpretation when required. </li><li>Develop metrics and goals for programs, present information to customers or leaders and prepare templates or details to ensure operations are meeting expectations. </li><li>Review operational claims, failures or damages, perform root cause and other reviews to determine responsible parties, and present to leaders or internal and external customers. </li><li>Assist with reviewing and responding to customer requests, which includes applying transportation principles, drafting responses and outlines, and other professional support. <br/><br/></li></ul>WHAT ARE WE LOOKING FOR? <br/><ul><li>Education and Experience: Bachelor’s Degree in Transportation, Operations or Supply Chain Management or equivalent education and experience. Master’s Degree in related field preferred. Less than one year related experience required.</li><li>Credentials: Professional certification may be required in some areas.</li><li>Skills: Ability to develop analytics, reports and communications related to transportation and logistics. Awareness of common systems and databases used for transportation and logistics management.</li><li>Characteristics: Capable of identifying areas to drive efficiency and operational effectiveness and ability to identify and communicate potential operational or analytical concerns. <br/><br/></li></ul>WHAT DO WE HAVE TO OFFER? <br/><br/>With a genuine culture of recognition, we want our employees to grow, develop and be part of our journey. We offer a benefits package with a focus on your wellbeing. This includes competitive Paid Time Off, 401(k), health insurance and an employee benefits platform that offers discounts on gym memberships and a diverse range of retail, travel, car and hospitality brands, including important offerings like pet insurance. <br/><br/>We are a team in every sense, and we support each other and work collaboratively to achieve our goals together.<br/><br/>It is our goal that you will be compensated for your hard work and commitment, so if you’d like to work for one of the top Logistics providers in the world then let’s work together to help you find your new role.<br/><br/>ABOUT TOMORROW<br/><br/>We value your professional and personal growth. That’s why we share plenty of career opportunities for you to thrive within CEVA. This role can be the first step on your career path with us. You can stay in the same job family, find a new family to grow in (an almost limitless number of options) or find your own path. Join CEVA for a challenging and rewarding career.<br/><br/>As a global organization, and partof the CMA CGM group, diversity is critical to our business success; only when we can reflect the cultures, languages, attitudes and local knowledge of our customers, can we succeed. By employing people with different experiences and abilities, we expand our knowledge and increase our creativity and innovation.<br/><br/>Please note: Legitimate CEVA Logistics recruitment processes include communication with candidates through recognized professional networks, such as LinkedIn or via an official company email address: firstname.lastname@cevalogistics.com. We recommend that you do not respond to unsolicited business propositions and/or offers from people with whom you are unfamiliar.", "responsibilities": "<ul><li>Manage complete daily, weekly, and monthly reporting requirements for performance, compliance and invoicing, which requires report development and analytics. Perform a variety of calculations, analyses and audits of financial and operational results; typically involves fundamental professional related supply chain principles. </li><li>Analyze operational or transportation details to identify potential areas for improvement, savings or efficiency; including innovative solutions. </li><li>Oversee data integrity - review, classify, audit and record information within the appropriate systems or files; requires knowledge of professional related supply chain principles.</li><li>Ensure processes and operations comply with applicable laws, rules and regulations; seeking advice and interpretation when required. </li><li>Develop metrics and goals for programs, present information to customers or leaders and prepare templates or details to ensure operations are meeting expectations. </li><li>Review operational claims, failures or damages, perform root cause and other reviews to determine responsible parties, and present to leaders or internal and external customers. </li><li>Assist with reviewing and responding to customer requests, which includes applying transportation principles, drafting responses and outlines, and other professional support. <br/><br/></li></ul>", "qualifications": {"required": "Education and Experience: Bachelor’s Degree in Transportation, Operations or Supply Chain Management or equivalent education and experience. Master’s Degree in related field preferred. Less than one year related experience required.", "preferred": "Credentials: Professional certification may be required in some areas."}, "skills": ["Transportation", "Operations", "Supply Chain Management", "Analytics", "Reports", "Communications", "Systems", "Databases", "Transportation and Logistics Management", "Efficiency", "Operational Effectiveness"], "postedDate": "1 day ago", "benefits": "With a genuine culture of recognition, we want our employees to grow, develop and be part of our journey. We offer a benefits package with a focus on your wellbeing. This includes competitive Paid Time Off, 401(k), health insurance and an employee benefits platform that offers discounts on gym memberships and a diverse range of retail, travel, car and hospitality brands, including important offerings like pet insurance. <br/><br/>We are a team in every sense, and we support each other and work collaboratively to achieve our goals together.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988204608"}