{"jobTitle": "Head of Strategy", "company": {"name": "Passes", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "description": "About Passes<br/><br/>Passes is a leading platform dedicated to empowering creators and fostering meaningful connections with their audiences. We are committed to providing innovative solutions that help creators grow and thrive in the digital landscape. Join us and be a part of a team that is shaping the future of the creator economy.<br/><br/><strong>Position Overview<br/><br/></strong>Passes is seeking a strategic and innovative Head of Strategy to lead our strategic initiatives and growth efforts. This individual will be responsible for developing and executing strategies to engage and grow our creator base, as well as vetting and managing third-party partners. The ideal candidate will have a strong background in strategic planning, analytics, and a deep understanding of the creator economy.<br/><br/><strong>Key Responsibilities</strong> <br/><br/><ul><li>Strategic Planning and Execution:</li><ul><li>Develop and implement strategies to enhance our understanding of the creator base and drive engagement and growth.</li><li>Collaborate with executive leadership to define and execute the company’s strategic vision.</li><li>Analyze market trends, competitive landscape, and industry developments to identify opportunities and threats.</li></ul><li>Creator Base Engagement:</li><ul><li>Develop strategies to enhance creator engagement, retention, and growth through data insights.</li><li>Lead cross-functional teams in the execution of data-driven projects and initiatives.</li><li>Utilize data analytics to inform and optimize creator engagement strategies.</li></ul><li>Partnership Management:</li><ul><li>Identify, evaluate, and vet potential third-party partners and vendors.</li><li>Establish and maintain relationships with key partners to support the company’s strategic goals.</li><li>Negotiate contracts and agreements to ensure favorable terms and conditions for the company.</li><li>Monitor partner performance and ensure alignment with the company’s objectives.<br/></li></ul></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in Business Administration, Marketing, Strategy, or a related field; advanced degree preferred.</li><li>Minimum of 7-10 years of experience in strategic planning and analytics roles, with at least 3 years in a leadership position.</li><li>Proven experience in developing and executing strategic initiatives.</li><li>Strong analytical and problem-solving skills.</li><li>Excellent communication and interpersonal skills, with the ability to influence and lead cross-functional teams.</li><li>Experience in the creator economy or digital content industry is highly desirable.</li><li>Ability to thrive in a fast-paced, dynamic environment and manage multiple priorities.<br/><br/></li></ul><strong>Key Competencies<br/><br/></strong><ul><li>Leadership and Team Management</li><li>Strategic Planning and Analytical Skills</li><li>Creator Engagement and Growth</li><li>Partnership and Relationship Management</li><li>Communication and Negotiation Skills<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive salary and equity package.</li><li>Comprehensive health, dental, and vision insurance.</li><li>401(k) plan.</li><li>Unlimited PTO.</li><li>Professional development opportunities and continuous learning support.</li><li>Flexible work environment with opportunities for remote work.</li><li>Passes is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</li></ul>", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "postedDate": "5 days ago", "benefits": "Competitive salary and equity package. Comprehensive health, dental, and vision insurance. 401(k) plan. Unlimited PTO. Professional development opportunities and continuous learning support. Flexible work environment with opportunities for remote work. Passes is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "qualifications": {"required": "Bachelor's degree in Business Administration, Marketing, Strategy, or a related field; advanced degree preferred. Minimum of 7-10 years of experience in strategic planning and analytics roles, with at least 3 years in a leadership position. Proven experience in developing and executing strategic initiatives. Strong analytical and problem-solving skills. Excellent communication and interpersonal skills, with the ability to influence and lead cross-functional teams. Experience in the creator economy or digital content industry is highly desirable. Ability to thrive in a fast-paced, dynamic environment and manage multiple priorities.", "preferred": ""}, "skills": [], "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3988027883"}