{"jobTitle": "Vice President – Business Development & Innovation", "company": {"name": "Unibail-Rodamco-Westfield", "industry": "Real Estate, Retail, and Construction", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$200,000.00 - $250,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Real Estate, Retail, and Construction", "description": "Do you want to help revolutionize a major industry? At Unibail-Rodamco-Westfield (URW), you’ll have the opportunity to impact the future of real estate by developing innovative and engaging places that reinvent being together. Come join a team that builds excitement about working at URW. You’ll get to work with leaders who are passionate about tackling changing consumer behavior with innovative experiences. All this bold vision means the company culture embraces evolution and change. We believe there is no \"perfect\" candidate and want to encourage applying even if all the requirements listed aren’t met. If you're passionate about URW and looking to learn and grow, then we look forward to reviewing your application!", "responsibilities": "Develop and implement an innovative go-to-market strategy on developing powerful vertical sales and product roadmap narratives, strategies, and products to support the sales team to acquire new partnerships, monetizing existing partnerships and generating new revenue channels.", "qualifications": {"required": "Minimum of fifteen years’ experience working in Marketing, Media, and Partnerships. Highly experienced in building go to market strategy and narratives, supporting sales organizations or marketing teams. Proven success driving innovation through business development, product innovation, and new partnerships to drive revenue. History of thriving in a rapidly changing environment. Reputation for being able to make informed and sound decisions that propel the business forward. Able to leverage key industry relationships to uncover new product and revenue opportunities. Experience working with cross-functional teams to build new product solutions. Exceptional PowerPoint abilities. Outstanding written and oral presentation skills. Excellent analytical skills and a data-driven mindset. Four-year college degree.", "preferred": ""}, "skills": ["Business Development", "Sales Strategy", "Marketing", "Partnerships", "Innovation", "Leadership"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988097803"}