{"jobTitle": "Law Clerk Trial Team (Lemon Law)", "company": {"name": "Adams & Martin Group", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$30.00/hr - $33.00/hr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Legal Services", "description": "Working as a law clerk on a trial team at a lemon law firm would be an exciting and dynamic role. Lemon law deals with consumer protection statutes that provide remedies for purchasers of defective vehicles. As a law clerk on the trial team, you'd likely be involved in various aspects of litigation related to lemon law cases.\n\nDuring trial preparation and proceedings, you'd provide support to the trial team. This could involve organizing exhibits, assisting with witness preparation, and helping to develop trial strategies.\n\nLemon law cases often involve extensive documentation, including vehicle purchase contracts, repair records, and correspondence between the consumer and the manufacturer. You'd review and analyze these documents to identify key facts and evidence to support your clients' claims.\n\nTOP THREE THINGS:\n1. Trial Preparation (organize trial binders, organize exhibits, and documents).\n2. Drafting support for trial documents and subpoena's.\n3. Multi-task, strong attention to detail, knows the importance of urgent vs important (911 or 411)\n\n<em>All qualified applicants will receive consideration for employment without regard to</em> <em>race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status.</em> <em>We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.</em>", "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "responsibilities": "", "qualifications": {"required": "", "preferred": ""}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3988638023"}