{"jobTitle": "Label Relations Manager", "company": {"name": "SoundCloud", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000 - 85,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Entertainment Providers", "description": "SoundCloud empowers artists and fans to connect and share through music. Founded in 2007, SoundCloud is an artist-first platform empowering artists to build and grow their careers by providing them with the most progressive tools, services, and resources. With over 400+ million tracks from 40+ million artists, the future of music is SoundCloud.<br/><br/>SoundCloud is looking for a dedicated, energetic Label Relations team member based in Los Angeles. In this role you’ll be part of the Soundcloud Music Team who focus on maintaining and expanding relationships with our Label partners. We use these relationships to further Soundcloud’s marketing and distribution initiatives, ensuring that we remain the #1 destination for artist development, promotion and monetization. This position will be based in Los Angeles.<br/><br/>As an ideal candidate, in addition to outstanding analytical and organizational skills, you will be incredibly passionate and knowledgeable about music culture at the grassroots level and open to working with all genres of music. This is an externally facing role, reporting to the Head of Industry<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Develop, cultivate, and leverage relationships with label partners within the US music industry.</li><li>Collaborate with label partners to create, implement, and evaluate strategic plans for music content release and catalog amplification to increase platform engagement, monthly active usage (MAU), listening time, and overall streaming performance.</li><li>Work with SoundCloud team members to align global label priorities.</li><li>Collaborate cross-functionally with teams including music marketing, brand marketing, product, platform, communications, and data science/analytics.</li><li>Partner with label executives at all levels to evaluate the effectiveness of on-platform campaigns.</li><li>Analyze research data to draw accurate and insightful conclusions, presenting recommendations for improvement in the US market.</li><li>Develop creative plans rooted in strategic analysis and insights.</li><li>Host monthly and quarterly label reviews to assess and enhance productivity, including release promotion, song marketing, and curation performance.</li><li>Increase SoundCloud’s visibility, awareness, and sentiment within the music industry.<br/><br/></li></ul><strong>Experience And Background<br/><br/></strong><ul><li>Minimum of 5-7 years of relevant experience working within label and/or distributor communities.</li><li>Deep knowledge of current music, digital, and industry trends, and a passionate SoundCloud user familiar with the platform and its tools.</li><li>Proficient in Google Docs and creating presentation decks.</li><li>Digitally savvy, with a strong interest in new technology and creators.</li><li>Exceptional attention to detail and strong organizational skills.</li><li>Ability to manage multiple priorities simultaneously within tight deadlines.</li><li>Effective communication skills with all levels of management.</li><li>Exceptional written and verbal communication skills, along with strong interpersonal and team collaboration abilities.</li><li>Able to work under pressure in a fast-paced, rapidly changing environment across various time zones.</li><li>Results-driven, proactive, and resourceful team player with a talent for identifying opportunities, developing creative plans, and driving them to completion.</li><li>Strong analytical and critical thinking abilities.</li><li>Genuine passion for the music industry and the digital media sector.<br/><br/></li></ul>The salary range for this role is $75,000 - $85,000 annually. The final salary offered will be determined based on relative experience, skills, internal equity, and location. We also offer a generous total rewards program - read more about additional benefits and perks below!<br/><br/><strong>About Us<br/><br/></strong><ul><li> We are a multinational company with offices in the US (New York and Los Angeles), Germany (Berlin), and the UK (London) </li><li> We provide a flexible work culture that offers the opportunity to collaborate and connect in person at our offices as well as accommodating work from home </li><li> We are deeply committed to ensuring diversity, equity and inclusion at all levels of our organization and fostering a community where everyone’s voice, perspective and experience is respected and heard </li><li> We believe a strong team is made by investing in employees through mentorship, workshops and enrichment opportunities <br/><br/></li></ul><strong><strong>Benefits:<br/><br/></strong></strong><ul><li> Comprehensive health benefits including medical, dental, and vision plans, as well as mental health resources </li><li> Robust 401k program </li><li> Employee Stock Ownership Plan </li><li> Generous professional development allowance </li><li> Interested in a gym membership, photography course or book? We have a Creativity and Wellness benefit! </li><li> Flexible vacation and public holiday policy where you can take up to 35 days of PTO annually </li><li> 16 paid weeks for all parents (birthing and non-birthing), regardless of gender, to welcome newborns, adopted and foster children </li><li> Various snacks, goodies, and 2 free lunches weekly when at the office <br/><br/></li></ul><strong><strong>Diversity, Equity and Inclusion at SoundCloud<br/><br/></strong></strong>SoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us lead what’s next in music by understanding and empowering our creators and fans, no matter their identity. We acknowledge the challenges in the music industry, and strive to influence an inclusive culture where everyone can contribute respectfully and thrive, especially the historically marginalized communities that many of our creators, fans and SoundClouders identify with. We are dedicated to creating an inclusive environment at SoundCloud for everyone, regardless of gender identity, sexual orientation, race, ethnicity, migration background, national origin, age, disability status, or care-giver status.<br/><br/>At SoundCloud you can find your community or elevate your allyship by joining a Diversity Resource Group. Diversity Resource Groups are employee-organized groups focused on supporting and promoting the interests of a particular underrepresented community in order to build a more inclusive culture at SoundCloud. Anyone can join, whether you share the identity or strive to be an ally.", "responsibilities": "Develop, cultivate, and leverage relationships with label partners within the US music industry.\nCollaborate with label partners to create, implement, and evaluate strategic plans for music content release and catalog amplification to increase platform engagement, monthly active usage (MAU), listening time, and overall streaming performance.\nWork with SoundCloud team members to align global label priorities.\nCollaborate cross-functionally with teams including music marketing, brand marketing, product, platform, communications, and data science/analytics.\nPartner with label executives at all levels to evaluate the effectiveness of on-platform campaigns.\nAnalyze research data to draw accurate and insightful conclusions, presenting recommendations for improvement in the US market.\nDevelop creative plans rooted in strategic analysis and insights.\nHost monthly and quarterly label reviews to assess and enhance productivity, including release promotion, song marketing, and curation performance.\nIncrease SoundCloud’s visibility, awareness, and sentiment within the music industry.", "qualifications": {"required": "Minimum of 5-7 years of relevant experience working within label and/or distributor communities.\nDeep knowledge of current music, digital, and industry trends, and a passionate SoundCloud user familiar with the platform and its tools.\nProficient in Google Docs and creating presentation decks.\nDigitally savvy, with a strong interest in new technology and creators.\nExceptional attention to detail and strong organizational skills.\nAbility to manage multiple priorities simultaneously within tight deadlines.\nEffective communication skills with all levels of management.\nExceptional written and verbal communication skills, along with strong interpersonal and team collaboration abilities.\nAble to work under pressure in a fast-paced, rapidly changing environment across various time zones.\nResults-driven, proactive, and resourceful team player with a talent for identifying opportunities, developing creative plans, and driving them to completion.\nStrong analytical and critical thinking abilities.\nGenuine passion for the music industry and the digital media sector.", "preferred": ""}, "skills": ["Music Industry", "Label Relations", "Digital Marketing", "Strategic Planning", "Relationship Management", "Music Content", "Analytics", "Data Analysis", "Presentation Skills", "Cross-Functional Collaboration", "Communication", "Teamwork", "Time Management", "Problem Solving", "Google Docs", "Presentation Decks"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Comprehensive health benefits including medical, dental, and vision plans, as well as mental health resources\nRobust 401k program\nEmployee Stock Ownership Plan\nGenerous professional development allowance\nInterested in a gym membership, photography course or book? We have a Creativity and Wellness benefit!\nFlexible vacation and public holiday policy where you can take up to 35 days of PTO annually\n16 paid weeks for all parents (birthing and non-birthing), regardless of gender, to welcome newborns, adopted and foster children\nVarious snacks, goodies, and 2 free lunches weekly when at the office", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988160585"}