{"jobTitle": "Sales Specialist, South Coast Plaza", "company": {"name": "Hermès", "industry": "Retail Luxury Goods and Jewelry"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23.72/hr - 29.30/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>The Team:<br/><br/></strong>The Hermès South Coast Plaza Boutique opened in 1997 and focuses on providing extraordinary service to clients as a part of the Western Region. This position will report to the Floor Director and will work collaboratively with the sales team and selling support teams to support the client experience in a fast-paced, luxury environment.<br/><br/><strong>The Opportunity:<br/><br/></strong>The primary responsibilities of a Sales Specialist are to achieve selling and customer service objectives while adhering to the operational asset protection standards of the boutique.<br/><br/><strong>About the Role:<br/><br/></strong><strong>Sales Objectives<br/><br/></strong><ul><li>Accountable for meeting monthly and annual individual sales goals while working as part of a team for the boutique to achieve its collective target.</li><li>Organize and prioritize the selling floor to support the sales effort and overall customer experience. Ensure all items (bags, boxes, note cards, ribbon, stationary and the like) are stored at all times. Maintain selling floor to meet standards to including straightening, filling in and replenishment of new receipts following VM guidelines, physical EAS tagging, ticketing, etc.</li><li>Provides assistance as needed in inventory preparation.<br/><br/></li></ul><strong>POS<br/><br/></strong><ul><li>Responsible for processing and ensuring the accuracy of all transactions including receipts, CRM files (which provide meaningful detail of purchase history and sales analysis, SKUs, monetary payment and client verification), and the administrative support of after sales service when needed.</li><li>Partners with management on POS decisions and communicates discrepancies, should they occur, during the opening, closing and general POS variances by end of business day.</li><li>Maintain cleanliness and organization of workstation at all times.<br/><br/></li></ul><strong>Asset Protection<br/><br/></strong><ul><li>Responsible for complying with all asset protection procedures such as employee sign in sheets, bag checks in conjunction with AP as application. Practice appropriate AP techniques and follows all guidelines for key control and merchandise security. Respects physical EAS tagging guidelines and ensure all products are properly ticketed (on floor, back of house and merchandise returns). Properly prepares for physical inventory and participates in monthly cycle counts (or as directed by management).<br/><br/></li></ul><strong>Customer Service<br/><br/></strong><ul><li>Consistently provide high levels of service to our clients within the Hermès standard of service: prompt and friendly greeting, offer to assist and answer questions, and assistance with wrapping and packaging at POS<br/><br/></li></ul><strong>Supervisory Responsibility:<br/><br/></strong><ul><li>NO<br/><br/></li></ul><strong>Budget Responsibility:<br/><br/></strong><ul><li>NO<br/><br/></li></ul><strong>Decision Making Responsibility:<br/><br/></strong><ul><li>NO<br/><br/></li></ul><strong>About You:<br/><br/></strong><ul><li>2+ years of experience in sales, experience in a luxury environment preferred</li><li>Strong relationship development and impeccable communication skills</li><li>Even-tempered with ability to continuously multi-task</li><li>Self-starter and able to work independently while balancing collaboration with a team</li><li>Strong organizational skills</li><li>Open availability to accommodate needs of the business</li><li>Ability to lift between 0-25 lbs. without assistance<br/><br/></li></ul>The range for this position is $23.72 - $29.30 per hour. Actual rates are determined based on the job, location, and individual experience.<br/><br/>We are looking for a candidate who has a combination of the above attributes and can perform the key functions of the role with or without reasonable accommodations.<br/><br/><strong>Company Overview<br/><br/></strong>Since 1837, Hermès has remained faithful to its artisan business model and humanist values. We place people at the heart of what we do and aspire to make a positive impact on the world. The freedom to create, the constant search for beautiful materials, the transmission of a savoir-faire of excellence and the aesthetic of functionality define the singularity of Hermès, a house dedicated to making highly-crafted, beautiful objects made to stand the test of time .<br/><br/>An independent, family-owned company, Hermès is dedicated to keeping production in France through its 42 workshops, The Hermès organization is also a truly global community with a network of 310 stores in 49 countries. Hermès employs more than 15,000 people worldwide with over 6,000 of the workforce being Hermès craftspeople engaged in making artisanal products, nurturing a 180+ year tradition of creativity and innovation.<br/><br/>At Hermès, our actions for sustainable development and corporate social responsibility are founded in values passed down by generations of humble artisans who have shaped the story of our house and the integrity of our objects. The roots of Hermès' success and longevity lie in a sense of responsibility; a quest for authenticity and respect for time and preservation of natural resources. All at Hermès wish to leave a positive footprint on the world, a mission that's at the heart of our commitment to progress. This narrative can be experienced in a series of short films “Footsteps Across the World” available on our website.<br/><br/><strong>OUR COMMITMENT<br/><br/></strong>Family is at the heart of Hermès. At Hermès of Paris, we are committed to being a Maison for All, a home where we make efforts to generate, support and advance the values of diversity, inclusion and family both within our own walls and in the wider world. At Hermès of Paris we look to create a diverse workforce of talented and unique individuals with different backgrounds, skillsets and worldviews that will enrich our Hermès of Paris family. We support our individual team members personal and professional success through a culture that values equality, individuality and fairness and through an environment where individuals can thrive and feel comfortable being their authentic selves. Beyond the walls of our Maison, we advance our DIF values through the work that we do in partnership with our community and non-profit partners.<br/><br/>At Hermès of Paris, we are proud to be an equal opportunity workplace. It is the policy of Hermès of Paris, Inc. that applicants for employment are recruited, selected and hired on the basis of individual merit and ability with respect to positions being filled and potential for promotion or transfer which may be expected to develop. Applicants are recruited, selected and hired without discrimination because of race, color, religion, sex, age, national origin, disability, genetic information, sexual orientation, citizenship, military or veteran status or any other basis prohibited by applicable law. In addition, personnel procedures and practices with regard to training, promotion, transfer, compensation, demotion, lay off or termination are to be administered with due regard to job performance, experience and qualifications, but without discrimination because of race, color, religion, sex, age, national origin, disability, genetic information, sexual orientation, citizenship, military or veteran status or any other basis prohibited by applicable law. Hermès of Paris, Inc. also provides reasonable accommodations to qualified individuals with disabilities, in accordance with applicable laws.<br/><br/>We collect personal information (PI) from you in connection with your application for employment with Hermes, including the following categories of PI: identifiers, personal records, commercial information, professional or employment information, non-public education records, and inferences drawn from your PI. We collect your PI for our purposes, including performing services and operations related to your potential employment. For additional details or if you have questions, contact us at ccpa@hermes.com. Please do not submit resumes or applications to this email address.", "responsibilities": "The primary responsibilities of a Sales Specialist are to achieve selling and customer service objectives while adhering to the operational asset protection standards of the boutique.", "qualifications": {"required": "2+ years of experience in sales, experience in a luxury environment preferred, Strong relationship development and impeccable communication skills, Even-tempered with ability to continuously multi-task, Self-starter and able to work independently while balancing collaboration with a team, Strong organizational skills, Open availability to accommodate needs of the business, Ability to lift between 0-25 lbs. without assistance"}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3988108919"}