{"jobTitle": "Sr. Manager, HR Business Partner", "company": {"name": "Shockwave Medical", "location": "Los Angeles, CA", "industry": "Medical Equipment Manufacturing"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Medical Equipment Manufacturing", "description": "Shockwave Medical, Inc. is a pioneer in the development and commercialization of Intravascular Lithotripsy (IVL) to treat complex calcified cardiovascular disease. Shockwave Medical aims to establish a new standard of care for medical device treatment of atherosclerotic cardiovascular disease through its differentiated and proprietary local delivery of sonic pressure waves for the treatment of calcified plaque.<br/><br/><strong>Description<br/><br/></strong><strong> Position Overview <br/><br/></strong>This position serves as a business partner to employees and management on HR-related issues and partners with Sr. Leaders on the people strategies for their teams. The Sr. Manager, HR Business Partner assesses and anticipates HR-related requests for employees and proactively prepares to respond to needs and issues when they arise. Communicating needs proactively with our HR department and business management, the Sr. Manager, HR Business Partner works to develop integrated solutions that can apply across the business, not just functionally. The Sr. Manager, HR Business Partner formulates partnerships across the HR function to deliver value-added support to management and employees that reflect the business objectives of the organization. The Sr. Manager, HR Business Partner maintains an expert level of business literacy about the business position, plans, culture and competition.<br/><br/><strong>Our ideal candidate is based in central, mountain, or pacific time zones. This is a fully remote position supporting a growing commercial team, including field sales.<br/><br/></strong><strong>Essential Job Functions<br/><br/></strong><ul><li> Works with functional leaders on the resourcing needs for their functions for short and long-term strategies </li><li> Proactively supports the delivery of all HR processes in a consistent manner within the business </li><li> Manages complex and difficult HR projects cross-functionally </li><li> Builds a strong business relationship with business partners to become an integral part of the teams they are responsible for supporting </li><li> Analyzes trends and metrics in partnership with HR team to develop solutions, programs and policies </li><li> Actively identifies gaps, proposes and implement changes necessary to alleviate risks </li><li> Works with employees and management to drive performance improvement and promotes positive change in people management </li><li> Consults with management by providing HR guidance and balancing individual and company needs </li><li> Ensures legal compliance by monitoring and implementing applicable HR federal and state requirements, conducting investigations, and maintaining records </li><li> Assists hiring managers with recruiting efforts, which can include postings, recruiting, resume screening, interviews, candidate selection and offers </li><li> Supports efforts in onboarding and offboarding processes </li><li> Works with all members of the HR team in a collaborative manner </li><li> Consistently exhibits high levels of confidentiality, initiative, and quick learning capability </li><li> Helps develop, drive, and foster a culture in which employees are engaged, motivated and feel appreciated </li><li> Other duties as needed <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Bachelor’s degree highly preferred or equivalent work experience </li><li> Minimum of 12 years’ experience in HR with at least 5 years’ experience in Business Partnering, supporting a growing commercial / field sales function across all levels of the organization. </li><li> Working knowledge of multiple HR disciplines, HRIS implementation, employee relations, diversity, performance management, benefits, immigration, federal and state respective employment laws, etc. </li><li> Demonstrated track record of managing processes and programs that resulted in improved efficiency and measurable results for the organization </li><li> Extremely organized with a strong attention to detail </li><li> Flexible and adaptable to changing priorities with good project management skills </li><li> Negotiation &amp; interpersonal Skills </li><li> Polished written and verbal communication and a strong ethical mindset </li><li> Strong business acumen </li><li> Adept with critical problem-solving skills and conflict management </li><li> Must be able to travel up to 30% (domestically). <br/><br/></li></ul><strong>Market Range<br/><br/></strong><strong>San Francisco Bay Area (SFBA) Market Range:</strong> 172,000 - 215,000<br/><br/><strong> <strong>All Other US Locations (Outside of SFBA)</strong>: </strong> 146,000 - 183,000<br/><br/>Exact compensation may vary based on skills, experience, and location.<br/><br/><strong>Benefits<br/><br/></strong>Shockwave Medical offers a competitive total compensation package as well as the following benefits and perks:<br/><br/><strong>Core Benefits</strong>: Medical, Dental, Vision, Pre-tax and Roth 401k options with a fully vested match, Short-Term and Long-Term Disability, and Life Insurance, Employer contribution toward Health Savings Account (HSA), Competitive PTO balance<br/><br/><strong>Perks</strong>: ESPP, Calm App, Pet Insurance, Student Loan Refinancing, Spot Bonus awards<br/><br/><strong>EEO Employer</strong>", "responsibilities": "Works with functional leaders on the resourcing needs for their functions for short and long-term strategies, Proactively supports the delivery of all HR processes in a consistent manner within the business, Manages complex and difficult HR projects cross-functionally, Builds a strong business relationship with business partners to become an integral part of the teams they are responsible for supporting, Analyzes trends and metrics in partnership with HR team to develop solutions, programs and policies, Actively identifies gaps, proposes and implement changes necessary to alleviate risks, Works with employees and management to drive performance improvement and promotes positive change in people management, Consults with management by providing HR guidance and balancing individual and company needs, Ensures legal compliance by monitoring and implementing applicable HR federal and state requirements, conducting investigations, and maintaining records, Assists hiring managers with recruiting efforts, which can include postings, recruiting, resume screening, interviews, candidate selection and offers, Supports efforts in onboarding and offboarding processes, Works with all members of the HR team in a collaborative manner, Consistently exhibits high levels of confidentiality, initiative, and quick learning capability, Helps develop, drive, and foster a culture in which employees are engaged, motivated and feel appreciated, Other duties as needed", "qualifications": {"required": "Bachelor’s degree highly preferred or equivalent work experience, Minimum of 12 years’ experience in HR with at least 5 years’ experience in Business Partnering, supporting a growing commercial / field sales function across all levels of the organization., Working knowledge of multiple HR disciplines, HRIS implementation, employee relations, diversity, performance management, benefits, immigration, federal and state respective employment laws, etc., Demonstrated track record of managing processes and programs that resulted in improved efficiency and measurable results for the organization, Extremely organized with a strong attention to detail, Flexible and adaptable to changing priorities with good project management skills, Negotiation & interpersonal Skills, Polished written and verbal communication and a strong ethical mindset, Strong business acumen, Adept with critical problem-solving skills and conflict management, Must be able to travel up to 30% (domestically).", "preferred": ""}, "skills": ["HRIS", "Employee Relations", "Diversity", "Performance Management", "Benefits", "Immigration", "Federal and State Employment Laws", "Project Management", "Negotiation", "Interpersonal Skills", "Communication", "Business Acumen", "Problem Solving", "Conflict Management"], "postedDate": "1 day ago", "benefits": "Shockwave Medical offers a competitive total compensation package as well as the following benefits and perks:<br/><br/><strong>Core Benefits</strong>: Medical, Dental, Vision, Pre-tax and Roth 401k options with a fully vested match, Short-Term and Long-Term Disability, and Life Insurance, Employer contribution toward Health Savings Account (HSA), Competitive PTO balance<br/><br/><strong>Perks</strong>: ESPP, Calm App, Pet Insurance, Student Loan Refinancing, Spot Bonus awards", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988477276"}