{"jobTitle": "Regional Sales Manager", "company": {"name": "Blue Signal Search", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $225,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Electric Lighting Equipment Manufacturing", "description": "<strong>Regional Sales Manager</strong> <p>Our client is a leading provider of advanced lighting solutions with a commitment to innovation and quality. Their expert team, equipped with deep technical knowledge and industry experience, works closely with designers, specifiers, and contractors to ensure the successful implementation of their solutions. </p><p> </p><p>They are seeking a dynamic, motivated, and well-organized individual to join their team as a Regional Sales Manager (RSM). The ideal candidate will possess extensive knowledge in identifying, cultivating, and sustaining robust relationships within the architectural lighting and specifications industry. A successful track record of selling complex lighting solutions and a strong knowledge of technical products and controls is essential for this role. </p><p> </p><p><strong>This Role Offers:</strong> </p><ul><li>Comprehensive Health Coverage </li><li>401(k) plan with company match to help you plan for your future. </li><li>Generous PTO, including vacation, sick leave, and holidays. </li><li>Opportunities for growth and career advancement through continuous learning and development programs. </li><li>Flexible work schedules and remote work options to support a healthy work-life balance. </li><li>Access to wellness resources and initiatives to promote a healthy lifestyle. </li><li>Reimbursement for business travel expenses. </li><li>Employee recognition and rewards for outstanding performance. </li><li>Life and Disability Insurance. </li><li>Commitment to diversity, equity, and inclusion, ensuring a supportive and welcoming workplace for all employees. </li></ul><p> </p><p> </p><p><strong>Focus:</strong> </p><ul><li>Develop and execute strategies to drive business in new and existing markets, growing revenue and meeting or exceeding stated goals. </li><li>Oversee all assigned sales activities in the region, coordinating commercial sales activity within assigned verticals. </li><li>Supervise and support outside independent sales representatives, resellers, specifiers, and key accounts in the assigned territory. </li><li>Engage with lighting designers and specifiers to build and maintain strong relationships. </li><li>Work with all personnel and outside contacts to satisfy clients and achieve company goals. Coordinate with other RSMs to maximize business within the territory and globally. </li><li>Identify areas of improvement within the company, assisting in creating and implementing solutions. Act as a conduit of customer feedback to marketing and professional service teams. </li><li>Report weekly sales activities and market intelligence via the company CRM reporting function. Forecast sales and achieve monthly sales targets for the assigned region. </li><li>Answer incoming calls from customers and sales reps to assist with their project support needs. Collect and report post-sales customer information and issues to the after-sales support team. </li><li>Become an expert on the company’s products and processes. </li></ul><p> </p><p><strong>Skill Set:</strong> </p><ul><li>5+ years of sales experience within the architectural lighting market. </li><li>Bachelor's degree or 10 years of equivalent experience in business or a comparable field in increasingly responsible positions in the related industry. </li><li>Knowledge and experience with commercial lighting control systems preferred. </li><li>Motivated contributor with problem-solving and diplomacy skills. </li><li>Excellent written and verbal communication, organizational, and interpersonal skills, including comfort presenting to large groups. </li><li>Excellent customer service skills and knowledge of company policies. </li><li>Proficiency with Microsoft Office, database management, and CRM systems. </li></ul><p> </p><p> </p><p><strong>About Blue Signal: </strong> </p><p> </p><p>Blue Signal is an award-winning, executive search firm specializing in sales &amp; business development recruiting. We have a strong track record of finding top-performing talent in areas such as sales leadership, account management, and business development strategy. Learn more at<strong> bit.ly/3NNY1wM</strong></p>", "responsibilities": "Develop and execute strategies to drive business in new and existing markets, growing revenue and meeting or exceeding stated goals. Oversee all assigned sales activities in the region, coordinating commercial sales activity within assigned verticals. Supervise and support outside independent sales representatives, resellers, specifiers, and key accounts in the assigned territory. Engage with lighting designers and specifiers to build and maintain strong relationships. Work with all personnel and outside contacts to satisfy clients and achieve company goals. Coordinate with other RSMs to maximize business within the territory and globally. Identify areas of improvement within the company, assisting in creating and implementing solutions. Act as a conduit of customer feedback to marketing and professional service teams. Report weekly sales activities and market intelligence via the company CRM reporting function. Forecast sales and achieve monthly sales targets for the assigned region. Answer incoming calls from customers and sales reps to assist with their project support needs. Collect and report post-sales customer information and issues to the after-sales support team. Become an expert on the company’s products and processes.", "qualifications": {"required": "5+ years of sales experience within the architectural lighting market. Bachelor's degree or 10 years of equivalent experience in business or a comparable field in increasingly responsible positions in the related industry. Motivated contributor with problem-solving and diplomacy skills. Excellent written and verbal communication, organizational, and interpersonal skills, including comfort presenting to large groups. Excellent customer service skills and knowledge of company policies. Proficiency with Microsoft Office, database management, and CRM systems.", "preferred": "Knowledge and experience with commercial lighting control systems preferred."}, "skills": ["Sales", "Business Development", "Lighting", "CRM", "Microsoft Office"], "postedDate": "1 week ago", "benefits": "Comprehensive Health Coverage, 401(k) plan with company match, Generous PTO, Opportunities for growth and career advancement, Flexible work schedules and remote work options, Access to wellness resources and initiatives, Reimbursement for business travel expenses, Employee recognition and rewards, Life and Disability Insurance, Commitment to diversity, equity, and inclusion", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988061105"}