{"jobTitle": "Senior Accountant", "company": {"name": "Coast Energy", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing and Finance", "industry": "Technology, Information and Internet", "description": "<strong>Job Title: </strong>Senior Accountant<br/><br/><strong>Location:</strong> El Segundo, CA or Remote (preference for Pacific or Mountain time Zones, USA)<br/><br/><strong>Start Date: </strong>Immediate<br/><br/><strong>Compensation:</strong> $110k - $135k/year + annual performance bonus<br/><br/><strong>ABOUT COAST<br/><br/></strong>Coast (\"Coast\" or the \"Company\") is a rapidly growing, PE-backed commercial and industrial (\"C&amp;I\") solar energy development firm. By offering innovative solutions to finance and operate solar energy for commercial businesses, Coast is disrupting the way commercial building owners purchase electricity.<br/><br/>Through the backing of its financial sponsor, Crosstimbers Capital Group, Coast is on a path to develop, finance and operate $300+ million of commercial solar projects across the United States over the next several years. Coast owns the solar systems installed on the roofs of commercial buildings and sells solar electricity to building owners at a rate that is typically less than their current electricity provider. We are looking for talented, results-oriented, self-starters who will consistently deliver exceptional results to our customers and investors in pursuit of becoming the leading C&amp;I solar provider in the United States.<br/><br/><strong>COAST'S BELIEVES IN PEOPLE<br/><br/></strong>We believe people should feel appreciated and part of a broader—mission-based organization—where their experience and talents are nurtured, and their full potential is realized.  Coast seeks to cultivate a culture that enables talented individuals to thrive by autonomously utilizing their unique abilities and extraordinary work ethic within a highly collaborative environment that fosters innovation, creativity, and teamwork. We view it as one of our greatest responsibilities to enable, lead, and help individuals grow into the best versions of themselves. Our team shares a common vision of becoming the best version of ourselves and building the best company we can create, while transitioning our country to clean, renewable energy.<br/><br/><strong>EXPECTED OUTCOMES AND REQUIREMENTS<br/><br/></strong>Coast is excited to hire its first Senior Accountant to help the business navigate its continued rapid growth. Reporting to the Controller (and strong \"dotted line\" to CFO), this individual will be responsible for tackling complicated accounting for multiple solar project entities. As a Senior Accountant, you will handle a wide range of day-to-day accounting functions along with month-end, quarterly, and annual tasks. Your responsibilities include reviewing transactions, creating journal entries, financial reporting, account reconciliations, process improvements, and other routine functions. A summary of the position's key responsibilities include:<br/><br/>General Accounting<br/><br/><ul><li>Perform daily transactional accounting activities including cash management, purchase requisitions and account reconciliations.</li><li>Review and approve A/P transactions.</li><li>Analyze, manage and record journal entries for invoices, disbursements and other transactions.</li><li>Create and record solar project cost allocations.</li><li>Provide support to internal employees and management as needed, and perform tasks related to special projects.<br/><br/></li></ul>Closing and Reporting<br/><br/><ul><li>Prepare monthly internal financial reports, bank and GL reconciliations and consolidated financial statements.</li><li>Execute month-end, quarter-end, and year-end closing activities, including variance reports and trend analysis.</li><li>Assist with preparing financial statements and reports, such as profit and loss statements, balance sheets, and cash flow statements.</li><li>Prepare for and help execute a successful annual audit of corporate and project-entity financial statements.<br/><br/></li></ul>Process and System Improvements<br/><br/><ul><li>Assist in the implementation and rollout of our new accounting system (NetSuite).</li><li>Identify potential improvements to processes.<br/><br/></li></ul><strong>QUALIFICATIONS AND EXPERIENCE<br/><br/></strong><ul><li>8+ years of accounting experience, including at least 5 years as a senior accountant (or equivalent role)</li><li>3+ years of solar development and/or related financing or construction industry experience; strong preference for experience accounting for project development and construction within the commercial and industrial sector</li><li>Strong NetSuite system experience (and recent)</li><li>Strong operational accounting experience including management of policies and procedures related to multiple special purpose entities cash management, multiple entity management accounting policies, procedures and controls</li><li>Strong technical accounting experience including US GAAP compliance, tax oversight and audit</li><li>Detail-oriented with a high degree of accuracy</li><li>CPA preferred</li></ul>", "postedDate": "3 weeks ago", "skills": ["NetSuite"], "url": "https://www.linkedin.com/jobs/view/3988808535"}