{"jobTitle": "Aircraft Group Planning Analyst", "company": {"name": "Moog Inc.", "industry": "Aviation and Aerospace Component Manufacturing, Defense and Space Manufacturing, Appliances, Electrical, and Electronics Manufacturing", "size": "13,000 employees", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Internship", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,080.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Aviation and Aerospace Component Manufacturing, Defense and Space Manufacturing, Appliances, Electrical, and Electronics Manufacturing", "description": "Moog Aircraft Group is the world-wide leader of advanced flight controls and actuation for commercial and military aircraft. We are positioned on virtually every aircraft flying today, supplying highly reliable systems that are supportable and add significant value for our customers. Moog Aircraft Group is looking for a Planning Analyst to integrate production planning processes with business and planning systems. In this role, you will use your expertise in production planning, data analytics and planning systems. This position is located at our aerospace manufacturing plant in Torrance, CA.", "responsibilities": "Responsible for the analysis and maintenance of part planning parameters in line with the established materials strategy, inventory plan, and demand profile of the business. Responsible for conversion of demand signals into Work Orders in accordance with defined Planning systems and processes. Track & action material shortages and lead times to mitigate all risks to the production plan. Develop achievable & balanced production plans that align with Customer demands / schedules, through capacity analysis and collaboration with appropriate team members. Escalate impacts to plan or customer. Determine Engineering Order change effectiveness and impacts on schedules or obsolescence management. Participate in meetings with cross-functional teams to discuss individual piece part/program status, and support audits as needed for customer owned inventory. Responsible for WIP on planner code and maintain optimal levels for the value stream. Responsible for providing work center scheduling method/clear to build status. Facilitate the analysis, review & update of Planning Bill of Materials (PBOMs) in accordance with demand changes. Construct Line of Balance (LOBs). Communicate identified gaps and priorities. Monitors progress to completion. Participate in continuous improvement initiatives, within the functional Planning department as well as the Value Stream teams. The scope of responsibility in terms of parts/suppliers or level of complexity is higher relative to the Associate Planner Buyer responsibilities. Plans, coordinates, schedules, and suggests changes to program plans. Provides delivery information to Master Scheduling based on lead time computations. Determines Engineering Order change effectivities and impacts on schedules, monitors flow of parts and initiates kit pulls to A&T. Prepares line of balance charts. Resolves own program plan problems independently. Coordinates with other departments to provide a workable production schedule and assist in correcting work center load imbalances, analyzes part requirements, orders, schedules reschedule and expedites assigned items. Provides part number data to information services (order policy, type, estimated usage, lead time) for assigned parts.", "qualifications": {"required": "Bachelor's Degree with a minimum of 2 years related experience or Direct Co-Op experience; or associate degree with a minimum of 7 years’ experience; or Progressive Experience directly related to the position or field with 10 years’ experience. Possess good communication/organizational skills and be able to demonstrate an understanding of complex regulations/procedures. Be able to prioritize a variety of tasks at any one time and be able to work under pressure to meet deadlines. This position require access to export-controlled information. Analytical Skills, Business Writing, Advanced manufacturing scheduling techniques (pull systems, Heijunka, process flow, etc.), Self-motivated, Ability to relocate to the Torrance, CA (Los Angeles County area).", "preferred": "APICS certification or coursework or other industry standard certifications are a plus. Knowledge of Demand Driven Process, DDMRP experience a strong plus. Supply chain experience, SQL programming experience, SAP experience, Team Leader experience, A planning, operations or technical background is preferable. Experience making professional presentations to upper management. Strong analytical skills: ability to collect data and present in run charts or bi-modal type distributions. Strong statistical background is a plus. Experience in the aerospace industry, Production Planning experience in a machine shop environment, Proficiency with advanced Excel functions (Pivot tables, VLOOKUP), Have the sound understanding of general material control systems: master schedule, requirements planning, inventory control, kitting, and shop floor control. Have the personal drive and human relations skills to cope with the conflicting objectives of maximum shipments and minimum inventories. Ability to obtain a security clearance or can obtain a security clearance."}, "skills": ["Production Planning", "Data Analytics", "Planning Systems", "Communication Skills", "Organizational Skills", "Analytical Skills", "Business Writing", "Manufacturing Scheduling Techniques", "SQL Programming", "SAP"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Annual bonuses, employee stock purchase plan, open paid time off policy, competitive 401K plan with enhanced matching program, and many region-specific benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988442760"}