{"jobTitle": "Human Resources Manager", "company": {"name": "Barksdale Control Products", "location": "Los Angeles, CA", "industry": "Manufacturing, Motor Vehicle Manufacturing, and Oil and Gas"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "110,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources and Engineering", "industry": "Manufacturing", "description": "<strong><u>ABOUT US</u></strong><p><br/></p><p>Barksdale, founded in 1949, is a leading manufacturer of highly engineered control products. As a subsidiary of Crane Co. a $3B industrial conglomerate, Barksdale has a leading brand position in instrumentation, with focus on General Industrial, Oil &amp; Gas and Transportation end markets. With proprietary technologies, Barksdale’s valves, regulators, pressure switches electronic and speed instrumentation products have carved a niche for themselves in demanding applications. Supported by strong financial standing, the business is positioned to continue double-digit annual growth over the next 5 – 10 years.</p><p><br/></p><p><strong><u>JOB SUMMARY</u></strong></p><p><br/></p><p>The Human Resources Manager will lead day-to-day operations of the Los Angeles Human Resources function encompassing over 200 associates, including professional staff and union manufacturing workforce. The Human Resources Manager will work more closely with the Sales, Engineering and Finance team in providing guidance, coaching, and development planning to both managers and associates. This position will take ownership of all HR matters across the assigned areas, from recruitment to performance reviews, wage reviews, disciplinary action, and learning and development.</p><p><br/></p><p><strong><u>KEY RESPONSIBILITIES</u></strong></p><p><br/></p><p><strong>Recruitment and Onboarding</strong>: Effectively drive the talent acquisition process: sourcing, screening and applying the CIDS process to develop a robust candidate funnel. Create and maintain necessary documentation that supports the decision to select the recommended candidate. Onboard new employees to ensure compliance with human resources, safety, and quality policies and standards. Develop creative sourcing strategies to identify and successfully recruit top talent in the global employment market, with a focus on campus recruiting; Create a Crane/Barksdale employment brand and experience that differentiates from other companies.</p><p><strong>Talent Development: </strong>Work closely with managers to drive the IC Process to ensure career development plans and career progression for associates and grow the company’s intellectual capital. Provide guidance and counsel to managers and associates<strong>. </strong>Identifies training needs and assists in securing training for associates; Obtains available State funds for annual training budget</p><p><strong>Employee Relations: </strong>Advise and counsel managers and directors on staffing and performance challenges<strong>; </strong>Provide guidance to resolve disputes and employee concerns in the most fair and equitable fashion. Interpret policies and procedures and render decisions<strong>; </strong>Review and assesses competitiveness of associate compensation<strong>; </strong>Ensure the cadence of employee communication is maintained including announcements and employee events.</p><p><strong>HR Administration:</strong> Ensure proper administration of benefits and recognition programs. Drive the salary appraisal process for consistency, fairness, timeliness and effective utilization of the tool by coaching leaders. Ensure fair and equitable merit increase administration. Conduct job analysis and prepare, maintain, and update position descriptions. Administer LMS and Peoplesoft systems.</p><p><strong>Retention</strong>: Develop and refresh retention strategies to retain top talent; Collaborate with managers to identify retention risks and develop retention strategies; Provide feedback to managers on retention issues and risks</p><p><strong>Employment practices and Labor Law</strong>: Stay abreast of changing employment laws at the State and Federal level; Educate organization and managers on current employment practices; Inform managers of pending labor law changes that may affect them. Assist in the creation of company policy and enforce policy administration ownership through the organization.</p><p><br/></p><p><strong><u>PROFESSIONAL EXPERIENCE / QUALIFICATIONS</u></strong></p><p><br/></p><ul><li>Bachelor's Degree in Human Resources Management, Business Administration, or related field (Advanced education, training, and/or PHR, SPHR certification highly desired).</li><li>Minimum of 2-3 years human resources management experience preferred.</li><li>5+ years of total experience in Human Resources. Successful track record in Union relations management experience is a plus.</li><li>Broad knowledge of fair employment, non-discrimination and safety laws and regulations; broad knowledge of HR policies, employee relations practices and procedures; broad knowledge of the principles and practices of human resources management including employment, classification, compensation, benefits, performance appraisal, risk management and safety; considerable knowledge of management theory and the principles of supervision. Knowledge of Employment practices and Regulations specific to the state of California.</li><li>Strong Microsoft Office skills required. Knowledge of People Soft and ADP preferred.</li><li>Strong and effective verbal and written communication skills. Must have excellent influencing skills, interpersonal skills, analytical and problem-solving skills.</li><li>Ability to operate across the business and in different environments and cultures.</li><li>Integrity, confidentiality and ethical qualities of the highest standard.</li><li>Highly motivated and innovative.</li></ul>", "responsibilities": "The Human Resources Manager will lead day-to-day operations of the Los Angeles Human Resources function encompassing over 200 associates, including professional staff and union manufacturing workforce. The Human Resources Manager will work more closely with the Sales, Engineering and Finance team in providing guidance, coaching, and development planning to both managers and associates. This position will take ownership of all HR matters across the assigned areas, from recruitment to performance reviews, wage reviews, disciplinary action, and learning and development.", "qualifications": {"required": "Bachelor's Degree in Human Resources Management, Business Administration, or related field (Advanced education, training, and/or PHR, SPHR certification highly desired). Minimum of 2-3 years human resources management experience preferred. 5+ years of total experience in Human Resources. Successful track record in Union relations management experience is a plus. Broad knowledge of fair employment, non-discrimination and safety laws and regulations; broad knowledge of HR policies, employee relations practices and procedures; broad knowledge of the principles and practices of human resources management including employment, classification, compensation, benefits, performance appraisal, risk management and safety; considerable knowledge of management theory and the principles of supervision. Knowledge of Employment practices and Regulations specific to the state of California. Strong Microsoft Office skills required. Knowledge of People Soft and ADP preferred. Strong and effective verbal and written communication skills. Must have excellent influencing skills, interpersonal skills, analytical and problem-solving skills. Ability to operate across the business and in different environments and cultures. Integrity, confidentiality and ethical qualities of the highest standard. Highly motivated and innovative.", "preferred": "Advanced education, training, and/or PHR, SPHR certification"}, "skills": ["Microsoft Office", "PeopleSoft", "ADP", "Union Relations", "Talent Acquisition", "Employee Relations", "Compensation and Benefits", "Performance Management", "Training and Development", "HRIS", "Labor Law", "Employment Law", "HR Policies and Procedures", "Management Theory", "Supervision", "Communication", "Interpersonal Skills", "Analytical Skills", "Problem Solving", "Influencing Skills", "Integrity", "Confidentiality", "Ethics", "Motivation", "Innovation"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988399471"}