{"jobTitle": "Head of Moderation & Support", "company": {"name": "Passes", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "About Passes<br/><br/>Passes is a leading platform dedicated to empowering creators and fostering meaningful connections with their audiences. We are committed to providing innovative solutions that help creators grow and thrive in the digital landscape. Join us and be a part of a team that is shaping the future of the creator economy.<br/><br/><strong>Position Overview<br/><br/></strong>The Head of Creator Support will be responsible for leading and managing the Creator Support and Moderation process and teams at Passes. This role requires a strategic and hands-on leader who can develop and implement support and moderation strategies, optimize processes, and ensure our creators receive top-notch support while maintaining a safe and positive environment. The ideal candidate will have a strong background in customer support, content moderation, team management, and a passion for the creator economy.<br/><br/><strong>Key Responsibilities</strong> <br/><br/><ul><li>Leadership and Management:</li><ul><li>Lead, mentor, and manage the Creator Support and Moderation teams to ensure high performance and professional growth.</li><li>Develop and implement support and moderation strategies and processes to enhance the creator experience.</li><li>Foster a positive and collaborative team culture.</li></ul><li>Support Strategy and Optimization:</li><ul><li>Analyze support metrics and feedback to identify areas for improvement.</li><li>Implement best practices and innovative solutions to improve support efficiency and effectiveness.</li><li>Collaborate with other departments to ensure seamless communication and support for creators.</li></ul><li>Moderation and Safety:</li><ul><li>Develop and enforce community guidelines to ensure a safe and respectful environment for all users.</li><li>Monitor platform content and user interactions to identify and address violations of community standards.</li><li>Work with the Moderation team to handle reports of inappropriate content and behavior swiftly and fairly.</li></ul><li>BPO Management:</li><ul><li>Oversee and manage BPO partners to scale support and moderation efforts efficiently.</li><li>Ensure BPO partners meet performance and quality standards.</li><li>Develop and maintain strong relationships with BPO partners to ensure alignment with Passes' goals and values.</li></ul><li>Creator Experience:</li><ul><li>Ensure creators receive timely, accurate, and empathetic support.</li><li>Develop and maintain strong relationships with top creators to understand their needs and challenges.</li><li>Act as an advocate for creators within the company, ensuring their feedback is heard and addressed.</li></ul><li>Process Improvement:</li><ul><li>Continuously review and refine support and moderation processes to enhance efficiency and quality.</li><li>Implement and manage support and moderation tools and technologies to improve service delivery.</li><li>Ensure compliance with company policies and industry regulations.</li></ul><li>Performance Tracking and Reporting:</li><ul><li>Monitor and report on key support and moderation metrics and KPIs.</li><li>Provide regular updates to senior management on team performance, creator satisfaction, and platform safety.</li><li>Use data-driven insights to drive decision-making and strategy development.<br/></li></ul></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in Business, Communications, or a related field; Master's degree preferred.</li><li>7+ years of experience in customer support and/or content moderation, with at least 3 years in a leadership role.</li><li>Proven experience in developing and implementing support and moderation strategies.</li><li>Strong understanding of the creator economy and passion for supporting creators.</li><li>Excellent leadership, communication, and interpersonal skills.</li><li>Ability to analyze data and use insights to drive improvements.</li><li>Experience in managing BPO partners and scaling support solutions.</li><li>Proficiency with support and moderation tools and technologies.<br/><br/></li></ul><strong>Why Join Passes<br/><br/></strong><ul><li>Competitive salary and commission structure.</li><li>Equity options in a growing company.</li><li>Comprehensive benefits package, including health, dental, and vision insurance.</li><li>401(k) plan.</li><li>Opportunities for professional growth and development.</li><li>A collaborative and innovative work environment.</li><li>Passes is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</li></ul>", "jobFunction": "Other", "industry": "Technology, Information and Internet", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3988029692"}