{"jobTitle": "Senior Manager", "company": {"name": "Northwest Administrators, Inc", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "10,544.00/mo - 14,266.00/mo", "currency": "USD"}, "jobFunction": "Accounting/Auditing, Management, and Quality Assurance", "industry": "Financial Services", "description": "Do you enjoy resolving complex issues and presenting the results to clients and stakeholders? Do you get excited to lead and teach a great team of professionals? Do you want to work for a company that truly values their employees and work/life balance? If your answer to these questions is a resounding “Yes!”, then our Senior Manager, Payroll Audit position may be a great match for your interests and strengths. <br/>\n<br/>\nWhat you'll be doing...\n<br/>\nThe Senior Manager’s top priority is to seamlessly integrate operations of the Payroll Audit and Pension Accounting Departments. This position is responsible for overseeing and supervising the activities of the Pasadena office Audit and Pension Accounting functions. You will; <ul><li>Supervise and mentor a team of local supervisors and 40+ audit and accounting professionals</li><li>Create and manage department goals, policies and procedures</li><li>Develop and implement training programs</li><li>Analyze department and system workflow and performance metrics. </li><li>Produce, analyze, and disseminate departmental reports</li></ul><br/>\n<br/>\nWho you are...\n<br/>\n<ul><li>Educated. Bachelor’s Degree or equivalent/relevant work experience</li><li>Expertise. Compliance/audit, process improvement, workflow documentation </li><li>Leadership. Min. 5+ years’ supervisory experience leading, developing, and motivating teams</li><li>Communication. Excellent interpersonal, presentation, and communication skills</li><li>Experience. Demonstrated ability to resolve complex business problems</li><li>Tech Savvy. Strong computer skills and ability to learn new systems quickly</li></ul><li></li>This position can be based in the Pasadena, CA or Seattle, WA office with frequent travel to Pasadena.<br/>\n<br/>\nWho we are...\n<br/>\nNorthwest Administrators, Inc. is an industry leader in third-party administration of employee benefits. We administer one of the largest multi-employer pension plans in the country, along with numerous large health and welfare plans. As part of our team, you will benefit from many training and development opportunities and can expect a better-than-market benefits package.<br/>\n<br/>\nIf hired, you can expect...\n<br/>\nStarting salary range of $10,544 - $14,266 per month. Pay is dependent on experience, skills, and qualifications. Excellent Medical, Dental (w/Ortho), Vision, Rx benefits, disability, life and pet insurancePaid Vacation (10 days), Sick Leave (10 days) and Holidays (10 days)Generous 401k plan with company base contribution &amp; match Work-Life Balance<br/>\n<br/>\nEqual Employment OpportunityNWA is proud to be an Equal Employment Opportunity employer. All employment decisions are based on business needs, job requirements and individual qualifications, without regard to race, color, religion, national origin, sex, sexual orientation, gender identity or expression, age, physical or mental disability, marital status, amnesty, veteran status, citizenship, family medical history or genetic information or any other characteristic protected by local, state, or federal laws. NWA prohibits any discrimination or harassment based on any of these characteristics. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact Human Resources at HR@nwadmin.com to request accommodation.Northwest Administrators Inc. | Privacy Policy (nwadmin.com)", "responsibilities": "The Senior Manager’s top priority is to seamlessly integrate operations of the Payroll Audit and Pension Accounting Departments. This position is responsible for overseeing and supervising the activities of the Pasadena office Audit and Pension Accounting functions. You will; <ul><li>Supervise and mentor a team of local supervisors and 40+ audit and accounting professionals</li><li>Create and manage department goals, policies and procedures</li><li>Develop and implement training programs</li><li>Analyze department and system workflow and performance metrics. </li><li>Produce, analyze, and disseminate departmental reports</li></ul>", "qualifications": {"required": "Bachelor’s Degree or equivalent/relevant work experience, Compliance/audit, process improvement, workflow documentation, Min. 5+ years’ supervisory experience leading, developing, and motivating teams, Excellent interpersonal, presentation, and communication skills, Demonstrated ability to resolve complex business problems, Strong computer skills and ability to learn new systems quickly"}, "skills": ["Compliance", "Audit", "Process Improvement", "Workflow Documentation", "Leadership", "Team Management", "Communication", "Presentation Skills", "Problem Solving", "Computer Skills"], "postedDate": "3 weeks ago", "benefits": "Excellent Medical, Dental (w/Ortho), Vision, Rx benefits, disability, life and pet insurancePaid Vacation (10 days), Sick Leave (10 days) and Holidays (10 days)Generous 401k plan with company base contribution &amp; match Work-Life Balance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988611093"}