{"jobTitle": "Shipping Clerk", "company": {"name": "Ardmore Home Design, Inc.", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "19.00 - 21.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale Furniture and Home Furnishings", "description": "<strong>Job Description<br/><br/></strong><strong>About the Company<br/><br/></strong>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).<br/><br/><strong>Job Summary<br/><br/></strong>The <strong>Shipping Clerk</strong> is responsible for processing shipping orders within our ERP and shipping software systems. Additional responsibilities include providing administrative and clerical support for the shipping function of the distribution center. The position is based in the Warehouse setting.<br/><br/><strong>What you can do for us:<br/><br/></strong><ul><li> Prepare outbound shipping documents and verify order shipment information of product count, weights and measures of items against bills of lading, sales orders, invoices and other applicable records</li><li> Complete mailing labels accurately with all requisite information</li><li> Affixes shipping labels on packaged cartons</li><li> Consolidate shipping orders as appropriate</li><li> Coordinate with carriers to schedule pick-up of goods</li><li> Ensure that carrier drivers depart with all necessary paperwork</li><li> Complete warehouse closing duties (including but not limited to checking in drivers, closing/locking dock doors and loading pallets as needed)</li><li> Audit shipments against corresponding documents for order processing accuracy</li><li> Answer and route all telephone calls in a professional manner, taking messages and routing to proper individual in a timely manner</li><li> Maintain shipping stations in good working order and stocked with shipping materials</li><li> Monitor the supply of packaging materials and complete requisition for additional supplies when needed</li><li> Complete necessary summary reports as required for management review</li><li> Additional duties as assigned<br/><br/></li></ul><strong>What we can do for you: <br/><br/></strong><ul><li> Play a pivotal role in our company’s transformation and growth</li><li> Maintain work/life balance working for wholesale distribution business</li><li> Training and career development opportunities</li><li> 3 weeks paid time off and 6 paid holidays per year</li><li> Relaxed and collaborative work environment</li><li> Up to 6% 401k employer contributions</li><li> Team building company sponsored events</li><li> Employee discount and bi-annual sample sale<br/><br/></li></ul><strong>Required Qualifications:<br/><br/></strong><ul><li> Prior experience with warehousing processes (i.e. materials movement, order fulfillment and packaging, outbound shipping preparations, etc.)</li><li> Proficient in computer skills for data entry; knowledge of Excel software helpful</li><li> Good mathematical skills with strong interpersonal &amp; communication skills (Must be able to read, write and speak in English)</li><li> Professional attitude required when dealing with vendors, truck drivers, delivery personnel, etc. </li><li> Highly organized, detail-oriented and self-motivated with a proactive attitude</li><li> Ability to work in fast-paced environment to learn quickly and follow established processes</li><li> Previous WMS experience (knowledge of SAGE X3 extra helpful)</li><li> High School Diploma or equivalent</li><li> Able to lift up to 50 pounds<br/><br/></li></ul><strong>Physical Requirements:<br/><br/></strong>The physical demands described here are representative of those that are required by an employee to successfully perform the essential functions of this job.<br/><br/><ul><li> While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms. </li><li> The employee must frequently lift and/or move up to 15 pounds and occasionally lift and/or move up to 35 pounds. Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus. </li><li> Ability to work in open environment with fluctuating temperatures and standard lighting. </li><li> Ability to work on computer and mobile phone for multiple hours; with frequent interruptions. </li><li> Required to use stairwells to attend meetings and engage with employees on multiple floors throughout building. <br/><br/></li></ul><strong>Other Considerations: <br/><br/></strong>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Reasonable accommodations may be made to qualified individuals with disabilities to enable them to perform the essential functions of the role.<br/><br/><strong>Compensation<br/><br/></strong>Starting base pay: $19.00 - $21.00 per hour. Exact compensation may vary based on skills, experience, and location.<br/><br/><strong>Company Description<br/><br/></strong>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, founder-led entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).<br/><br/>Ardmore Home Design (AHD), founded in 2008, is a privately-owned, fast-paced, founder-led entrepreneurial company where we value people with strong skills to make our products and processes better every day. We design, sell and distribute luxury home décor to interior designers as well as boutique/luxury retailers globally. The AHD family of wholesale brands includes Made Goods (flagship furniture made from unique materials); Pigeon &amp; Poodle (home and bath accessories); Blue Pheasant (handcrafted tabletop products) and Thucassi (artisanal candles and fragrances).", "responsibilities": "The <strong>Shipping Clerk</strong> is responsible for processing shipping orders within our ERP and shipping software systems. Additional responsibilities include providing administrative and clerical support for the shipping function of the distribution center. The position is based in the Warehouse setting.<br/><br/><strong>What you can do for us:<br/><br/></strong><ul><li> Prepare outbound shipping documents and verify order shipment information of product count, weights and measures of items against bills of lading, sales orders, invoices and other applicable records</li><li> Complete mailing labels accurately with all requisite information</li><li> Affixes shipping labels on packaged cartons</li><li> Consolidate shipping orders as appropriate</li><li> Coordinate with carriers to schedule pick-up of goods</li><li> Ensure that carrier drivers depart with all necessary paperwork</li><li> Complete warehouse closing duties (including but not limited to checking in drivers, closing/locking dock doors and loading pallets as needed)</li><li> Audit shipments against corresponding documents for order processing accuracy</li><li> Answer and route all telephone calls in a professional manner, taking messages and routing to proper individual in a timely manner</li><li> Maintain shipping stations in good working order and stocked with shipping materials</li><li> Monitor the supply of packaging materials and complete requisition for additional supplies when needed</li><li> Complete necessary summary reports as required for management review</li><li> Additional duties as assigned<br/><br/></li></ul>", "qualifications": {"required": "Prior experience with warehousing processes (i.e. materials movement, order fulfillment and packaging, outbound shipping preparations, etc.), Proficient in computer skills for data entry; knowledge of Excel software helpful, Good mathematical skills with strong interpersonal &amp; communication skills (Must be able to read, write and speak in English), Professional attitude required when dealing with vendors, truck drivers, delivery personnel, etc., Highly organized, detail-oriented and self-motivated with a proactive attitude, Ability to work in fast-paced environment to learn quickly and follow established processes, Previous WMS experience (knowledge of SAGE X3 extra helpful), High School Diploma or equivalent, Able to lift up to 50 pounds<br/><br/>", "preferred": ""}, "skills": ["WMS", "ERP", "Excel", "Data Entry", "Communication", "Warehousing", "Order Fulfillment", "Packaging", "Outbound Shipping", "Materials Movement"], "postedDate": "3 weeks ago", "benefits": "3 weeks paid time off and 6 paid holidays per year, Relaxed and collaborative work environment, Up to 6% 401k employer contributions, Team building company sponsored events, Employee discount and bi-annual sample sale<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988553600"}