{"jobTitle": "Logistics Analyst", "company": {"name": "LATICRETE International", "industry": "Wholesale Building Materials", "size": "Not specified", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "Are you looking for a new challenge? Passionate about innovation? Want to work for a global company that values integrity, teamwork, and loyalty? At LATICRETE International, we aim to be the leading construction brand trusted globally for high-performance tile and stone installation systems and building finishing solutions. We’ve been in business for over 65 years, family-owned for three generations, and can be found in over 100 countries. The Hartford Business Journal even named us one of Connecticut’s top family-owned companies in 2017! We don't just make innovative, industry-leading products. Our purpose is to improve the built world and the lives of those who build it. We strive to connect with, engage with and improve the lives of our employees, our customers, our partners, and the global communities in which we operate. We are seeking passionate and ambitious employees who want to make a difference not just within our organization, but within their communities, our industry, and the world. If that sounds like you, then what are you waiting for? Join the family and expand your horizons!", "responsibilities": "This role is responsible for transportation and logistics analytics, seeking out accurate data sources, building analyses from scratch, and telling compelling stories of how Laticrete can improve its logistics operations with data. The Logistics Analyst will work closely with the logistics team, finance, procurement, and business stakeholders to build analysis on transportation spend management and areas of opportunity across Laticrete’s plant locations.", "qualifications": {"required": "High School Diploma required. Bachelor’s degree in supply chain management, Business, or equivalent work experience.", "preferred": "At least two years of logistics, supply chain, or finance analysis. Proven experience in data analysis, preferably within a logistics or supply chain context. Previous experience with JD Edwards, Microsoft Excel, and Power BI. Strong understanding of logistics and supply chain operations. Excellent problem-solving and critical thinking skills. Project management experience is a plus. Demonstrated ability to work on multiple projects simultaneously, set timelines, and independently prioritize workload. Ability to work closely with cross-functional teams."}, "skills": ["Data Analysis", "Logistics", "Supply Chain Management", "Microsoft Excel", "Power BI"], "postedDate": "2 days ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental, Vision, 401k, Tuition reimbursement, 13 paid holidays, Paid vacation and sick time, Flexible spending, Life Insurance, AD&D and Supplemental Insurance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988715200"}