{"jobTitle": "Production Supervisor", "company": {"name": "Arrowhead Products", "location": "Los Alamitos, CA"}, "location": "Los Alamitos, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Aviation & Aerospace", "description": "<strong>Job Summary<br/><br/></strong>The Production Supervisor will be responsible for the daily management of a fabrication or sub-assembly production area including the management of SQDC (Safety, Quality, Delivery, and Cost). The candidate will direct and support the hourly employees to achieve production targets and overall Company goals.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Supervise, coach, and support all direct reports </li><li>Uses Problem Solving Process to identify root cause of an issue and works to assign proper team to implement countermeasure in assembly, welding and fabrication of components, sub-assemblies or final assemblies</li><li>Consistently uses daily management to ensure continuous flow through their area for 1st and 2nd shift</li><li>Actively uses visual management to monitor day to day productivity on the floor and is able to quickly identify potential issues that may disrupt flow</li><li>Defines and recommends production objectives through development of short and long term goals</li><li>Supervises installation and maintenance of all equipment used in manufacturing</li><li>Ensures prompt, cost-effective, and on time delivery of finished products to customers</li><li>Coordinates and collaborates with other departments to ensure top quality and service is provided to customers</li><li>Formulates and instills standard manufacturing practices based on comparative studies of methods, costs, and production figures</li><li>Keeps accurate and timely records on all employees and programs for their department.</li><li>Comprehend and execute the Union agreement </li><li>Enforces safety regulations; promotes all safety programs</li><li>This job description is not all inclusive of all duties. Other duties may be assigned<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>A High School Diploma </li><li>2-3 years of Supervisory experience, preferable in an Aerospace Manufacturing environment </li><li>Experience in a collective bargaining environment and with lean manufacturing is highly desirable<br/><br/></li></ul><strong>Knowledge, Skill And Abilities<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions:<br/><br/><ul><li>Excellent interpersonal skills</li><li>Exceptional planning and organizational skills</li><li>Proficient with Microsoft products (Word, Excel, Outlook)</li><li>Metal Forming (Shear, Punch, Brake Press, Bending)</li><li>Metal Fitting (Alignment, Welding)</li><li>Metal Machining (CNC)</li><li>Composite Fabrication </li><li>Bellows forming</li><li>Sub-assembly Test (Dye Pen, X-Ray, Water)</li><li>Other (Oven-Bake, Autoclave, Insulation)</li><li>Excellent verbal and written communication skills<br/><br/></li></ul><strong>Supervisory Responsibilities<br/><br/></strong><ul><li>Ability to oversee, monitor and lead employees to ensure goals are met successfully.<br/><br/></li></ul><strong>Core Behaviors<br/><br/></strong><ul><li>Teamwork/Collaboration</li><li>Accountability</li><li>Sense of Urgency</li><li>Communication</li><li>Persistence<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Lift up to 35 lbs.</li><li>Push and pull 35 lbs.</li><li>Bend Occasionally </li><li>Sit, Stand, and Walk Frequently</li><li>Talk and Listen Frequently</li><li>Frequent Use of Computer Monitor <br/><br/></li></ul><strong>Special Requirements<br/><br/></strong>FAA-safety sensitive. Employees are subject to a pre-employment drug screening for Marijuana (THC metabolite), Cocaine, Amphetamines, Opiates, and Phencyclidine (PCP); then random screenings for alcohol, Marijuana (THC metabolite), Cocaine, Amphetamines, Opiates, and Phencyclidine (PCP) after hire.<br/><br/>Limitations and Disclaimer<br/><br/>The statements herein are intended to describe the general nature and level of work being performed by employees and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified. Furthermore, this job description does not establish a contract for employment and the content is subject to be changed, modified, or deleted at the discretion of the Company. In compliance with the Americans with Disability Act (ADA) of 1990, the Company will make reasonable accommodations with those individuals with a disability as defined by the ADA.", "responsibilities": "The Production Supervisor will be responsible for the daily management of a fabrication or sub-assembly production area including the management of SQDC (Safety, Quality, Delivery, and Cost). The candidate will direct and support the hourly employees to achieve production targets and overall Company goals.", "qualifications": {"required": "A High School Diploma, 2-3 years of Supervisory experience, preferable in an Aerospace Manufacturing environment, Experience in a collective bargaining environment and with lean manufacturing is highly desirable", "preferred": null}, "skills": ["Problem Solving", "Microsoft Office", "Teamwork", "Communication", "Supervisory Skills", "Lean Manufacturing", "Safety", "Quality", "Delivery", "Cost", "Metal Forming", "Metal Fitting", "Metal Machining", "Composite Fabrication", "Bellows forming", "Sub-assembly Test", "Oven-Bake", "Autoclave", "Insulation"], "postedDate": "3 weeks ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3988469316"}