{"jobTitle": "Maintenance Repair, and Operations (MRO) Coordinator", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.00 - 30.00", "currency": "USD"}, "jobFunction": "General Business", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br><br>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br><br><strong>Job Description<br><br></strong>NBCUniversal is looking for an <strong>MRO Coordinator</strong>! In this role, you will work closely with our Maintenance Repair Operations team in the areas of Asset Management, Preventative Maintenance Scheduling, and Materials Requests. You will also work with a wide range of internal and corporate teams, Production and external vendors.<br><br><strong>What You’ll Do<br><br></strong><strong>Manage the Enterprise MRO Program<br><br></strong><ul><li>Drive all aspects of the Facilities MRO day-to-day programs supporting all West Coast sites, New York sites, Telemundo-Center in Miami FL, as well as international sites</li><li>MRO Programs include but not limited to (Preventive Maintenance, compliance management, inspections, zone maintenance & inventory management)</li><li>Utilize the Integrated Workplace Management System (IWMS), asset database and associated processes & Tools for MRO Operations</li><li>Work with Purchasing and Storeroom teams to establish BOM and materials kitting procedures for all scheduled PMs</li><li>Become lead SME for Equipment Focus Teams</li><li>Create / Run reports for teams to help them manage their workload</li><li>Support Enterprise Asset Management programs with enhancing the Archibus IWMS fields and coding to improve reporting and usability of the system</li><li>Assist with Production materials requests as needed<br><br/></li></ul><strong>Assist the Enterprise Facilities Asset Management Program<br><br></strong><ul><li>Assisting with asset identification, tagging, verification, photo cataloging, and database management</li><li>Assist with Capital Project planning, including presentation preparation, project tracking and pre/post project follow up</li><li>Assist with the commissioning/decommissioning of equipment within the IWMS system<br><br/></li></ul><strong>Qualifications<br><br></strong><strong>Let’s Talk About You…<br><br></strong><ul><li>Master of calendars, scheduling and tracking. The Facilities team is fast-paced and focused on efficiency. Assisting them with achieving this goal enterprise wide is essential</li><li>Self-starter – You are motivated, can work with minimal guidance, and can identify helpful resources to get the job done</li><li>Interpersonal-savvy – You have a strong customer focused mindset and the ability to communicate effectively and build solid working relationships with co-workers at all levels</li><li>Impeccable attention to detail – You bring the Facilities PM program to life by organizing and managing the team’s daily / weekly PMs and work plans</li><li>Tech-savvy – You are an MS Office whiz and can take on analytics and data preparation / reporting with ease</li><li>Motivated by a fast-paced corporate Facilities environment<br><br/></li></ul><strong>What You Have…<br><br></strong><ul><li>Bachelor’s Degree in Facilities Management, Engineering, or equivalent work experience</li><li>2+ years of related work experience with demonstrated success<br><br/></li></ul><strong>What You Maybe Have…<br><br></strong><ul><li>Certifications in Facilities Management or relevant programs</li><li>Familiarity with film/TV, theme parks, broadcast, data centers, or studio business segments</li><li>Familiarity with IWMS software, such as Archibus</li><li>Experience working within a lean but focused internal organization that relies on efficiency, and setting and meeting expectations with each other to drive progress and deliver results</li><li>Experience communicating with people at all levels, both written and verbal, creating scheduling efficiency, team cohesion, organization of the team initiatives and sharing the work of the team with others<br><br/></li></ul><strong>Additional Requirements<br><br></strong><ul><li>Required On-Site: This position is required to be performed full-time from an NBCUniversal-designated worksite.<br><br/></li></ul>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $21.00 - $30.00 Hourly<br><br><strong>Additional Information<br><br></strong>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br><br>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br><br>marital status, pregnancy, veteran status, membership in the uniformed services,<br><br>genetic information, or any other basis protected by applicable law.<br><br>NBCUniversal will consider for employment qualified applicants with criminal histories,<br><br>or arrest or conviction records, in a manner consistent with relevant legal<br><br>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br><br>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br><br>If you are a qualified individual with a disability or a disabled veteran, you have the<br><br>right to request a reasonable accommodation if you are unable or limited in your<br><br>ability to use or access nbcunicareers.com as a result of your disability. You can<br><br>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "Manage the Enterprise MRO Program\n\n* Drive all aspects of the Facilities MRO day-to-day programs supporting all West Coast sites, New York sites, Telemundo-Center in Miami FL, as well as international sites\n* MRO Programs include but not limited to (Preventive Maintenance, compliance management, inspections, zone maintenance & inventory management)\n* Utilize the Integrated Workplace Management System (IWMS), asset database and associated processes & Tools for MRO Operations\n* Work with Purchasing and Storeroom teams to establish BOM and materials kitting procedures for all scheduled PMs\n* Become lead SME for Equipment Focus Teams\n* Create / Run reports for teams to help them manage their workload\n* Support Enterprise Asset Management programs with enhancing the Archibus IWMS fields and coding to improve reporting and usability of the system\n* Assist with Production materials requests as needed\n\nAssist the Enterprise Facilities Asset Management Program\n\n* Assisting with asset identification, tagging, verification, photo cataloging, and database management\n* Assist with Capital Project planning, including presentation preparation, project tracking and pre/post project follow up\n* Assist with the commissioning/decommissioning of equipment within the IWMS system", "qualifications": {"required": "Master of calendars, scheduling and tracking. The Facilities team is fast-paced and focused on efficiency. Assisting them with achieving this goal enterprise wide is essential\nSelf-starter – You are motivated, can work with minimal guidance, and can identify helpful resources to get the job done\nInterpersonal-savvy – You have a strong customer focused mindset and the ability to communicate effectively and build solid working relationships with co-workers at all levels\nImpeccable attention to detail – You bring the Facilities PM program to life by organizing and managing the team’s daily / weekly PMs and work plans\nTech-savvy – You are an MS Office whiz and can take on analytics and data preparation / reporting with ease\nMotivated by a fast-paced corporate Facilities environment", "preferred": "Bachelor’s Degree in Facilities Management, Engineering, or equivalent work experience\n2+ years of related work experience with demonstrated success\nCertifications in Facilities Management or relevant programs\nFamiliarity with film/TV, theme parks, broadcast, data centers, or studio business segments\nFamiliarity with IWMS software, such as Archibus\nExperience working within a lean but focused internal organization that relies on efficiency, and setting and meeting expectations with each other to drive progress and deliver results\nExperience communicating with people at all levels, both written and verbal, creating scheduling efficiency, team cohesion, organization of the team initiatives and sharing the work of the team with others"}, "skills": ["Asset Management", "Preventative Maintenance", "Materials Requests", "IWMS", "Archibus", "MS Office", "Communication", "Teamwork", "Customer Service"], "postedDate": "1 day ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988603784"}