{"jobTitle": "Senior Product Manager, Payments", "company": {"name": "SimplePractice", "industry": "Software Development", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$150,000 - $175,000", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "At SimplePractice, our team is dedicated to improving the health and wellness industry by building a suite of innovative solutions for practitioners and their clients. Our product supports practitioners on their clinical journey to becoming licensed, helps them manage their business and practice once they’re up and running, and enables new clients to discover and interact with practitioners. Taking a practitioner-first approach in everything we do makes it possible for health and wellness practitioners to devote more time to their clients while they use SimplePractice to start, grow, and maintain a successful private practice.", "responsibilities": "Define payments roadmap based on business goals, customer impact, and broader payments/ fintech landscape. Partner closely with SimplePractice’s payment service provider to understand and influence their roadmap based on our strategy, address real-time payment issues, and roll out new functionality. Test and roll-out new payments functionality or financial products to our customers including partnering with Marketing on pricing. Gain buy-in for the vision and roadmap from diverse team and stakeholders including engineering, design, data, marketing, finance, operations, and customer success. Define and track payment metrics to understand the health of our payments processing system. Apply a combination of qualitative and quantitative research, competitive intelligence, customer understanding, and product intuition to identify opportunities for product enhancements, growth, and customer value. Create business cases to make prioritization trade-off decisions. Lead the development and execution of the product roadmap including managing the backlog, prioritizing feature requests, and creating product briefs.", "qualifications": {"required": "7+ years of experience in fintech and/ or customer payments. Experience working closely or managing relationships with payment processors such as Stripe, PayPal, Square. Demonstrated experience rolling out new payment systems, methods, or fintech features to customers. Strong analytical and problem-solving skills, with extensive experience using data to inform decisions, segment user populations, build business cases, and prioritize initiatives. Experience collaborating with cross-functional teams and managing product development from ideation to execution. Excellent communication skills with the ability to clearly communicate and present complicated topics to a range of audiences.", "preferred": ""}, "skills": ["Fintech", "Customer Payments", "Payment Processors", "Analytical Skills", "Problem-Solving", "Cross-Functional Collaboration", "Communication Skills"], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "We offer a competitive benefits program including: Medical, dental, vision, life & disability insurance; 401(k) plan with company match; Flexible Time Off (FTO), wellbeing days, paid holidays, and summer Fridays; Mental health resources; Paid parental leave & Backup Care; Tuition reimbursement; Employee Resource Groups (ERGs).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988640172"}