{"jobTitle": "Strategic People Business Partner", "company": {"name": "GOBankingRates", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "GOBankingRates.com is a personal finance news and features website dedicated to helping visitors Live Richer™<br/><br/>From tips on saving money to investing for retirement or finding a good interest rate, GOBankingRates helps turn financial goals into milestones and money dreams into realities. Its content is regularly featured on top-tier media outlets, including MSN, Yahoo!, FOX Business, CNBC, Business Insider, USA Today and dozens of others. GOBankingRates specializes in connecting consumers with the financial institutions and products that best match their needs<br/><br/><strong>What's interesting about this role?<br/><br/></strong>The People Business Partner will act as a strategic advisor and partner to our people and leaders, driving strategic human resources initiatives that align with the company's goals and foster a high-performance culture. This role will optimize talent management, increase employee productivity, and maintain the company's competitive edge. The ideal candidate will bring a blend of strategic vision, operational expertise, and a passion for developing talent.<br/><br/><strong>How will you make an impact?<br/><br/></strong><ul><li>Partner with management to align human resources (HR) strategies with business objectives, ensuring the talent supports the company's goals.</li><li>Analyze HR metrics and provide insights on talent trends and issues for decision-making.</li><li>Participate in talent planning and organizational development.</li><li>Improve employee productivity through regular feedback, performance reviews, and development plans.</li><li>Support managers in identifying and addressing performance issues, and implementing performance improvement plans to drive change.</li><li>Drive recruitment needs by proactively partnering with hiring managers and the Talent Acquisition team based on analysis and turnover trends.</li><li>Effectively manage employee relations, resolve conflicts, and foster a positive work environment to increase employee satisfaction and reduce turnover rates.</li><li>Conduct regular compensation analyses for internal employees and potential new hires to ensure the company remains competitive in the job market.</li><li>Present a strategic approach and cadence to maintain the company's competitive edge to support long-term growth.</li><li>Identify training needs and organize programs that enhance employees' skills and career development, contributing to a more capable and motivated workforce.<br/><br/></li></ul><strong>How Will You Make an Impact?<br/><br/></strong><ul><li>Minimum of 7-10 years of HR experience, with at least 4 years in a strategic HRBP role.</li><li>Bachelor's degree in Human Resources, Business Administration, or related field (Master's degree preferred).</li><li>Professional HR certification (e.g., SHRM-CP, SHRM-SCP, PHR, SPHR) preferred.</li><li>Strong knowledge of HR best practices and employment laws.</li><li>Excellent communication and interpersonal skills.</li><li>Proven ability to influence and build relationships with senior leaders.</li><li>Experience with HRIS systems and data analysis tools.</li><li>Strategic thinking and problem-solving abilities.</li><li>Strong leadership and project management skills.</li><li>High level of integrity and confidentiality.</li><li>Ability to manage multiple priorities in a fast-paced environment.<br/><br/></li></ul>The salary range for this role is $100,000-$120,000 per year, depending on job-related knowledge, skills, experience, and location.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity and passion.</li><li>Awesome medical, dental and vision plans with heavy employer contribution</li><li>Paid maternity leave and paternity leave programs</li><li>Paid vacation, sick days and holidays</li><li>Company funding for outside classes and conferences to help you improve your skills</li><li>Contribution to student loan debt payments after the first year of employment</li><li>401(k) -- employees can start contributing immediately. After the first year, GOBankingRates matches your contribution up to 4% of your salary<br/><br/></li></ul>A note about our new norm: The world has changed and we know it's important to adapt and to do our part to do what's best for our team. Our number one priority is to have our team feel safe, balanced and connected. We're committed to providing our teams with the best resources and tools to navigate this new virtual world that we're living in. We've also reinvented the ways in which we recognize, celebrate, and engage with each other to keep our culture strong!<br/><br/>Here's a peek into our world at GOBankingRates - <br/><br/><ul><li>Our teams are working remotely 100% for the foreseeable future. We're in the digital media space, so we're mobile and flexible!</li><ul><li>*Option to work from an office (if you need to get away!)</li></ul><li>Tools &amp; resources are available to keep our team connected across North America. (JIRA, Trello, Slack, Zoom and so much more!)</li><li>To keep our community engaged and connected, virtual team building events are held weekly and monthly.</li><li>For wellness and balance, weekly virtual fitness classes such as yoga are available.</li><li>To care for the local communities that we're a part of across the U.S our team members host socially distanced philanthropic events every quarter.</li><li>And most importantly, we've committed to consistent and transparent communication to help us all stay informed, engaged and to keep us on our path to success and #greatness.<br/></li></ul><em>We are an equal-opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</em>", "responsibilities": "The People Business Partner will act as a strategic advisor and partner to our people and leaders, driving strategic human resources initiatives that align with the company's goals and foster a high-performance culture. This role will optimize talent management, increase employee productivity, and maintain the company's competitive edge. The ideal candidate will bring a blend of strategic vision, operational expertise, and a passion for developing talent.", "qualifications": {"required": "Minimum of 7-10 years of HR experience, with at least 4 years in a strategic HRBP role.\nBachelor's degree in Human Resources, Business Administration, or related field (Master's degree preferred).\nProfessional HR certification (e.g., SHRM-CP, SHRM-SCP, PHR, SPHR) preferred.\nStrong knowledge of HR best practices and employment laws.\nExcellent communication and interpersonal skills.\nProven ability to influence and build relationships with senior leaders.\nExperience with HRIS systems and data analysis tools.\nStrategic thinking and problem-solving abilities.\nStrong leadership and project management skills.\nHigh level of integrity and confidentiality.\nAbility to manage multiple priorities in a fast-paced environment.", "preferred": ""}, "skills": ["HR", "HRBP", "Talent Management", "Employee Productivity", "HRIS", "Data Analysis", "Strategic Thinking", "Problem Solving", "Leadership", "Project Management"], "postedDate": "3 weeks ago", "benefits": "Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity and passion.\nAwesome medical, dental and vision plans with heavy employer contribution\nPaid maternity leave and paternity leave programs\nPaid vacation, sick days and holidays\nCompany funding for outside classes and conferences to help you improve your skills\nContribution to student loan debt payments after the first year of employment\n401(k) -- employees can start contributing immediately. After the first year, GOBankingRates matches your contribution up to 4% of your salary", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988812315"}