{"jobTitle": "Buyer/Planner", "company": {"name": "AG Jeans", "location": "South Gate, CA"}, "location": "South Gate, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$100,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Sales, and Other", "industry": "Retail Apparel and Fashion", "description": "AG Jeans is a pioneer and industry leader in the premium denim industry. It is a vertically integrated company committed to making a difference and pursuing socially active and responsible alternatives through the manufacturing process. Rooted in denim, AG Jeans has grown to be recognized as a contemporary lifestyle brand encompassing a full range of premium apparel and accessories.\n<br/>\nThe Buyer/Planner is responsible for developing merchandising solutions that will represent the brand and drive revenues within our full-price retail Stores as well as Online channels. The role consistently focuses on being an effective and efficient merchant while being a strong partner and supporting all brand initiatives. This role will lead the inventory management responsibilities within the DTC Channels (Physical Retail Locations and Online). The Buyer/Planner will apply strong analytics and financial acumen that support Revenue Growth, Profitability, and Brand Objectives.\n<br/>\nThis position reports to the Head of Retail.\n<br/>\n**Buying Responsibilities:**\n<ul><li>Create merchandise assortments in accordance with financial goals that will drive revenues and best reflect brand initiatives. </li><li>Analyze merchandise reports on an annual, seasonal, monthly, and weekly basis to assess and act on opportunities in the business in-season and future seasons and share knowledge with cross-functional teams.</li><li>Have a strong eye for fashion trends, brand knowledge, market research and integrate knowledge into actionable recommendations for the business.</li><li>Partner with visual merchandising, online merchandising, marketing, store allocation, and photo studio stylists to deliver the best-in-market business strategy/execution.</li><li>Partner with cross-functional teams, such as merchandising and design teams, to communicate quantitative and qualitative feedback that will ensure brand and business growth.</li><li>Partner with store locations to identify the specific needs of that market/consumer base.</li><li>Create and deliver effective product knowledge to store teams.</li></ul>\n<br/>\n**Planning Responsibilities: **\n<ul><li>Manage Open to Buy (creating category plans and actualizing)</li><li>Develop seasonal financial merchandise plans at the category and product level that align to company sales, inventory, turn, and profit targets</li><li>Partner with the Director of Retail and E-Commerce to forecast monthly topline plans.</li><li>Actualize topline performance by channel and by store</li><li>Maintain communication with field management and stores to action through inventory challenges at the store level and action accordingly.</li><li>Partner with and develop the Assistant Merchandise Planner on initial distribution and replenishment strategies with retail stores.</li><li>Partner with the Outlet Business Manager and Store teams on transferring products between full-price to outlet stores at the end of the season</li><li>Partner with appropriate teams on the promotional calendar and product lifecycle </li><li>Manage core/carryover replenishment business. </li></ul>\n<br/>\n**Requirements:**\n<ul><li>College education required</li><li>Minimum 4+ years of Buying/Planning Experience with an emphasis in apparel within Luxury and/or Contemporary environment(s). Denim experience preferred</li><li>Excellent communication and training skills</li><li>Well versed in retail math</li><li>Superior knowledge of fashion trends and fabrics</li><li>Ability to organize, prioritize, delegate, and follow up on projects</li><li>Must have the ability to make inferences by combining quantitative and qualitative data</li><li>Experience with Microsoft Suite (Excel, Word, PowerPoint, Outlook)</li><li>Ability to work daytime, evenings, and weekends.</li><li>Travel (approximately +10%).</li></ul>", "responsibilities": "The Buyer/Planner is responsible for developing merchandising solutions that will represent the brand and drive revenues within our full-price retail Stores as well as Online channels. The role consistently focuses on being an effective and efficient merchant while being a strong partner and supporting all brand initiatives. This role will lead the inventory management responsibilities within the DTC Channels (Physical Retail Locations and Online). The Buyer/Planner will apply strong analytics and financial acumen that support Revenue Growth, Profitability, and Brand Objectives.", "qualifications": {"required": "College education required\nMinimum 4+ years of Buying/Planning Experience with an emphasis in apparel within Luxury and/or Contemporary environment(s). Denim experience preferred\nExcellent communication and training skills\nWell versed in retail math\nSuperior knowledge of fashion trends and fabrics\nAbility to organize, prioritize, delegate, and follow up on projects\nMust have the ability to make inferences by combining quantitative and qualitative data\nExperience with Microsoft Suite (Excel, Word, PowerPoint, Outlook)\nAbility to work daytime, evenings, and weekends.\nTravel (approximately +10%)."}, "skills": ["Retail Math", "Fashion Trends", "Merchandising", "Inventory Management", "Microsoft Suite", "Communication", "Training"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988629616"}