{"jobTitle": "Warehouse Assistant", "company": {"name": "Nextech", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "USD $20.00/Hr. - USD $22.00/Hr.", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Facilities Services", "description": "Join the best in the industry at Nextech and embark on a rewarding career journey! For over 30 years, we've built our success on a foundation of Quality, Value, and Integrity, fostering enduring partnerships with thousands of satisfied customers. With over 2,000 team members nationwide, Nextech sets itself apart from other companies by being America’s largest HVAC/R service provider.<br/><br/>As we continue to grow, we're committed to offering an exceptional work experience for our employees with numerous opportunities for development and advancement. If you pride yourself on quality work, integrity, and dedication, we want you on our team. Nextech boasts outstanding review ratings on Indeed and Glassdoor, making it the premier destination for HVAC professionals. Elevate your career by joining Nextech today!<br/><br/>Role<br/><br/>The primary role of the Warehouse Assistant includes the receiving and processing of incoming and outgoing stock and materials, picking and filling orders from stock, packing and shipping orders and managing, organizing, and retrieving stock in the warehouse. This role understands transfers and cycle counting and participates in on-site fleet maintenance. The Warehouse Assistant has an understanding of safety regulations and adheres to all safety procedures and policies.<br/><br/>Benefits<br/><br/><ul><li>Excellent Health Insurance options including a FREE employee only option</li><li>Dental, Vision, Accident, Critical Illness, Disability and Supplemental Life Insurance options</li><li>FREE life insurance equal to your annualized pay rate<br/><br/><br/></li></ul>USD $20.00/Hr.<br/><br/>USD $22.00/Hr.<br/><br/><ul><li>Sorts, organize, and store inventory in proper location </li><li>Ensures the workspace is free of debris and remove safety hazards </li><li>Follows all health and safety procedures and regulations as dictated by the organization </li><li>Assists with loading and unloading delivery trucks at Company warehouse </li><li>Assists with receiving of materials, equipment and supplies, checks items received against purchase orders for accuracy and inspects merchandise for damage </li><li>Assists in counting and stocking inventory in the warehouse, including equipment and parts received </li><li>General office clean up and maintenance including weekly office trash removal to the onsite dumpster </li><li>Maintains a safe and clean work environment </li><li>Washes/cleans company vehicles and forklifts and assisting with the scheduling of maintenance as needed </li><li>Moves inventory and materials throughout the warehouse </li><li>Handles products with utmost care </li><li>Packages items and label correctly </li><li>Reports damaged or missing inventory to supervisors </li><li>Stacks and organizes large bulk items </li><li>Handles and operate necessary tools and accessories in maintaining and managing a warehouse </li><li>Works as an active team member to complete team goals </li><li>Assists in organizing and maintaining up to date records of inventory </li><li>Prepares documentation and inventory for audits </li><li>Drives to pick up HVAC/R parts and equipment from supply warehouses and facility warehouses, deliver parts and equipment to field technicians, as needed </li><li>Directs other forklift drivers to store goods in identified areas, as needed </li><li>Integrates best practices in handling warehouse materials </li><li>Other related duties as assigned <br/><br/><br/></li></ul>Required Knowledge, Skills, and Abilities<br/><br/><ul><li>Excellent verbal and written communication skills</li><li>Able to work in a fast-paced environment, at times</li><li>Able to work independently</li><li>High attention to detail and monitors quality/quantity of inventory</li><li>Highly organized and able to store items efficiently</li><li>Must follow all health and safety procedure and regulations as dictated by the organization and the state<br/><br/><br/></li></ul>Education and Experience<br/><br/><ul><li>High school degree or equivalent (Preferred)</li><li>Forklift Certified (Preferred)<br/><br/><br/></li></ul>Physical requirements<br/><br/><ul><li>Continuously requires vision, hearing, twisting, and talking </li><li>Continuously able to stand, sit, move, squat, walk, climb, lift, carry, reach, kneel, push/pull, bend, and crouch during the course of the shift</li><li>Physically able to lift up to 50 pounds or more</li><li>Must be able to climb ladders, multiple times</li><li>Able to operate a computer and other office machinery, such as a copy machine, telephone, computer printer, etc.</li></ul>", "responsibilities": "The primary role of the Warehouse Assistant includes the receiving and processing of incoming and outgoing stock and materials, picking and filling orders from stock, packing and shipping orders and managing, organizing, and retrieving stock in the warehouse. This role understands transfers and cycle counting and participates in on-site fleet maintenance. The Warehouse Assistant has an understanding of safety regulations and adheres to all safety procedures and policies.", "qualifications": {"required": "Excellent verbal and written communication skills, Able to work in a fast-paced environment, at times, Able to work independently, High attention to detail and monitors quality/quantity of inventory, Highly organized and able to store items efficiently, Must follow all health and safety procedure and regulations as dictated by the organization and the state", "preferred": "High school degree or equivalent, Forklift Certified"}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Excellent Health Insurance options including a FREE employee only option, Dental, Vision, Accident, Critical Illness, Disability and Supplemental Life Insurance options, FREE life insurance equal to your annualized pay rate", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988511073"}