{"jobTitle": "Customer Support Program Manager, Google Store Retail", "company": {"name": "Google", "location": "Mountain View, CA"}, "location": "Mountain View, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "139,000.00/yr - 207,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management, Strategy/Planning, and Other", "industry": "Information Services and Technology, Information and Internet", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience. </li><li>5 years of experience in program or project management. <br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>5 years of experience managing cross-functional or cross-team projects.</li><li>Experience providing a high-level of service to internal and external customers in a retail support environment.</li><li>Ability to multitask competing priorities and shift focus as determined by the changing needs of the business.</li><li>Ability to identify a problem and use systems processes to create an effective solution.</li><li>Excellent problem solving skills.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Program Manager at Google, you’ll lead complex, multi-disciplinary projects from start to finish — working with stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your job to coordinate the players and keep them up to date on progress and deadlines.<br/><br/>Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.<br/><br/>The Retail Operations is the driving team behind bringing Google's hardware products and services directly to consumers through a first-party physical retail store experience. Our mission is to create engaging and informative spaces where customers can explore, learn about, and purchase the latest Google technology.<br/><br/>The Retail Operations team is dedicated to delivering exceptional retail experiences that showcase the best of Google's hardware products and services. We are passionate about innovation, customer satisfaction, and operational excellence. Through our collaborative efforts and unwavering commitment, we strive to create a retail environment that inspires and delights customers, reinforces Google's brand image, and drives business growth.<br/><br/>Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices &amp; Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices &amp; Services team is making people's lives better through technology.<br/><br/>The US base salary range for this full-time position is $139,000-$207,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Partner with cross-functional teams to plan and deliver programs, capabilities, and systems that contribute to the in-store customer support/repair operations function.</li><li>Monitor service inventory run rates and set inventory thresholds to drive an optimal in-store experience for our customers and in-store teams.</li><li>Provide daily operational support for employees and track/reroute inquiries to the correct cross-functional business partners.</li><li>Develop and update policies and procedures that support customer support and repair operations in Google’s network of first-party retail store locations.</li><li>Support and assist store teams in the successful execution of critical activities such as new store openings, product launches, and seasonal campaigns.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Partner with cross-functional teams to plan and deliver programs, capabilities, and systems that contribute to the in-store customer support/repair operations function.</li><li>Monitor service inventory run rates and set inventory thresholds to drive an optimal in-store experience for our customers and in-store teams.</li><li>Provide daily operational support for employees and track/reroute inquiries to the correct cross-functional business partners.</li><li>Develop and update policies and procedures that support customer support and repair operations in Google’s network of first-party retail store locations.</li><li>Support and assist store teams in the successful execution of critical activities such as new store openings, product launches, and seasonal campaigns.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 5 years of experience in program or project management.", "preferred": "5 years of experience managing cross-functional or cross-team projects. Experience providing a high-level of service to internal and external customers in a retail support environment. Ability to multitask competing priorities and shift focus as determined by the changing needs of the business. Ability to identify a problem and use systems processes to create an effective solution. Excellent problem solving skills."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3988376023"}