{"jobTitle": "Director Health System Alliances (West)", "company": {"name": "Nihon Kohden America", "industry": "Medical Equipment Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$140,000", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Medical Equipment Manufacturing", "description": "The Director Health System Alliances provides leadership in the identification, prioritization, evaluation, negotiation and relationship management of complex, strategic relationships with the company’s IDN/IDHN/IHS customers. Essential Functions And Main Duties: Generate new business and develop a solid strategy to create and maintain effective relationships with key executives within Integrated Delivery Networks, including “C” suite Administrators, and Physicians including, Neurologist that will result in increased market share across all of Nihon Kohden Neurology product portfolios. Develop sales strategies to produce growth and make sales presentations to IDN and/or their members. This includes RFP responses and contract negotiations. Work with the Sales and Marketing departments and Regional Vice Presidents (RVPs) to identify targets and create forecasting models. Monitor sales performance across all Nihon Kohden product portfolios that have been set for IDNs, handle key account relationship management, develop partner relationships with sales channels, perform product demonstrations and foster collaborative relationships with luminary hospital sites. Work with Finance, Customer Care, Operations, Marketing, Sales and other internal departments to understand their strategic priorities and creatively identify partnership opportunities to support those priorities. Establishing metrics to analyze and track performance of partner initiatives. Develop actions to adjust sales strategy as needed. Become the corporate lead for the customer with dotted line management of all key responsibilities including but not limited to Sales, Project Management, Installation, Service, and Clinical. Adhere to all company policies, procedures, and business ethics codes. Duties may be modified or assigned at any time based on business need.", "responsibilities": "Generate new business and develop a solid strategy to create and maintain effective relationships with key executives within Integrated Delivery Networks, including “C” suite Administrators, and Physicians including, Neurologist that will result in increased market share across all of Nihon Kohden Neurology product portfolios. Develop sales strategies to produce growth and make sales presentations to IDN and/or their members. This includes RFP responses and contract negotiations. Work with the Sales and Marketing departments and Regional Vice Presidents (RVPs) to identify targets and create forecasting models. Monitor sales performance across all Nihon Kohden product portfolios that have been set for IDNs, handle key account relationship management, develop partner relationships with sales channels, perform product demonstrations and foster collaborative relationships with luminary hospital sites. Work with Finance, Customer Care, Operations, Marketing, Sales and other internal departments to understand their strategic priorities and creatively identify partnership opportunities to support those priorities. Establishing metrics to analyze and track performance of partner initiatives. Develop actions to adjust sales strategy as needed. Become the corporate lead for the customer with dotted line management of all key responsibilities including but not limited to Sales, Project Management, Installation, Service, and Clinical. Adhere to all company policies, procedures, and business ethics codes. Duties may be modified or assigned at any time based on business need.", "qualifications": {"required": "Bachelor’s degree in marketing, engineering or business-related discipline; MBA preferred. 5+ years of experience in healthcare in a commercial sales, national accounts or business development capacity with an OEM selling diagnostic capital equipment, preferably in the patient monitoring space with companies such as Natus, Cadwell, Nihon Kohden, Philips, GE Healthcare, Siemens Healthcare, Cerner, or similar companies. Deep knowledge and experience working with IDN, IDHN, HIS professionals at an executive level in a complex matrix selling environment. Current regional or national relationships with IDN’s. such as Tenet, Prime, UHS, Ascension Health, Partners, Sentara, NYU, MedStar, HHS, Geisinger Health (not a complete list).", "preferred": "Familiarity with the HIS, EMR, Neurology, and medical technology marketplace. Successful work history with particular focus on negotiation skills involving multi-modality deals, forecasting, ASP management, and revenue and market share enhancement. Must be able to communicate verbally and in writing, and to receive and understand verbal and written instructions in English. Able to work effectively both independently and in a collaborative team environment."}, "skills": ["Leadership", "Sales Strategy", "Negotiation", "Relationship Management", "Market Analysis"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Visit our Career page to learn more about Perks & Benefits and working at Nihon Kohden America", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988112363"}