{"jobTitle": "SVP, Relationship Manager Team Lead", "company": {"name": "Enterprise Bank & Trust", "industry": "Banking", "size": "Not specified", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$149,503 - $224,254", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Banking", "description": "Enterprise Bank & Trust was founded in the spirit of entrepreneurship and community. From the small mom-and-pop coffee shop to the large construction company that employs local people, our goal is to help businesses succeed and our communities thrive. With offices in Arizona, California, Florida, Kansas, Missouri, New Mexico, Nevada and Texas, we’re strong, growing and committed to supporting the communities we serve. We extend this commitment to the community to our associates, offering annual paid volunteer time off and charitable-matching opportunities. Voted a Best Bank to Work For by American Banker for multiple years, we offer our associates an array of benefits and the opportunity to chart their own career path with us. Join us in the pursuit of our mission to guide people to a lifetime of financial success, and enjoy a career filled with professional growth opportunities, interesting colleagues and the satisfaction of supporting our communities. Together, there’s no stopping you!", "responsibilities": "Leads a team of lenders that develops and manages new commercial deposit and loan accounts and client relationships while enhancing existing relationships. To achieve this, it is expected that the role be proactive in providing financial solutions to both existing and prospective clients. Also responsible for increasing the bank’s deposit base through various products, developing sound and profitable business relationships, credit assessment and exceeding customer needs and expectations while complying with regulatory requirements. Essential Duties And Responsibilities include: Identify deposit driven commercial relationships and present solutions using treasury management, wealth products and other services. Lead a team of lenders, providing day-to-day guidance and feedback on a variety of issues and projects. Hold the team accountable for results. Manages and services commercial relationships by interviewing applicants and obtaining pertinent financial data. Analyzes pertinent financial information and determines whether a credit is an acceptable risk. Approves loans within assigned lending authority, and company policies and procedures. Recommends credits outside lending authority to the next level or presents to Loan Committee in accordance with established procedures. Ongoing monitoring of existing loans for conformity to terms and conditions. Actively participates with and assists other lending officers on larger, more complex credits. Monitors market conditions, observing competitor impact and makes recommendations to maintain a competitive and profitable product line. Develop and maintain comprehensive knowledge of all commercial products including loans, treasury management, trade service products and deposits to facilitate cross-selling and enhance the client experience.", "qualifications": {"required": "Must have demonstrated skills in commercial credit underwriting, business development and portfolio management for mid-sized companies. Minimum of seven or more years of Commercial Lending experience preferred. Must have excellent communication, presentation and tactful interpersonal skills. Superb people skills to work within a team environment and successfully develop and retain client relationships. Proven ability to cross-sell other banking products, including loans, deposits and treasury management. Self-motivated to work independently and take ownership. Bachelor’s degree in Finance or Business with emphasis in financial banking preferred. Effective time management and organizational skills are required. Must be attentive to detail and accurate when analyzing financial statements and presenting a credit package for formal approval. This position requires the use of sound business discretion, good judgment, and excellent problem solving skills. Basic knowledge of personal computer hardware and software skills including MS Word and Excel. Strong working knowledge of regulations, compliance standards, market trends and products relating to the banking industry. Superior analytical and decision making skills based on a thoughtful assessment of risk.", "preferred": ""}, "skills": ["Commercial Lending", "Business Development", "Portfolio Management", "Credit Underwriting", "Communication", "Interpersonal Skills", "Time Management", "Analytical Skills"], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Annual paid volunteer time off, charitable-matching opportunities, array of benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988469566"}