{"jobTitle": "Project Manager", "company": {"name": "Tappan", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Project Management and Information Technology", "industry": "Artists and Writers", "description": "<strong>Location:</strong> Los Angeles<p><br/></p><p><strong>Company:</strong> Tappan</p><p><br/></p><p><strong>About Us:</strong> Tappan is a leading art advisory and curatorial firm specializing in delivering exceptional art experiences for hospitality and commercial clients. Our mission is to curate and procure the finest artworks, ensuring they meet the aesthetic and cultural needs of our clients.</p><p><br/></p><p><strong>Position Overview:</strong> We are seeking a dynamic and detail-oriented Project Manager to join our team. The ideal candidate will be responsible for managing projects for our hospitality and commercial clients from inception to completion. This role involves art curation, procurement, budgeting, and negotiation to ensure seamless project delivery and client satisfaction.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ol><li><strong>Project Management:</strong></li></ol><ul><li>Oversee and manage multiple projects for hospitality and commercial clients.</li><li>Develop and maintain project timelines, ensuring all milestones are met.</li><li>Coordinate with internal teams and external stakeholders to ensure project objectives are achieve</li></ul><ol><li><strong>Art Curation:</strong></li></ol><ul><li>Collaborate with clients to understand their vision and aesthetic preferences.</li><li>Curate art collections that align with client needs and project requirements.</li><li>Conduct research to identify emerging artists and trends in the art world.</li></ul><ol><li><strong>Procurement:</strong></li></ol><ul><li>Source and procure artworks, ensuring they meet quality and budgetary requirements.</li><li>Establish and maintain relationships with artists, galleries, and vendors.</li><li>Manage the logistics of art procurement, including shipping and installation.</li></ul><ol><li><strong>Budgeting:</strong></li></ol><ul><li>Develop and manage project budgets, ensuring financial objectives are met.</li><li>Monitor project expenses and provide regular financial reports to clients and senior management.</li><li>Identify cost-saving opportunities without compromising on quality.</li></ul><ol><li><strong>Negotiation:</strong></li></ol><ul><li>Negotiate contracts and agreements with artists, galleries, and vendors.</li><li>Ensure all contractual terms are met and resolve any disputes that arise.</li><li>Advocate for the best interests of Tappan and our clients in all negotiations.</li></ul><ol><li><strong>Project Completion:</strong></li></ol><ul><li>Oversee the final stages of project execution, including installation and client handover.</li><li>Ensure all deliverables meet the highest standards of quality and client satisfaction.</li><li>Conduct post-project evaluations to identify areas for improvement.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Bachelor's degree in Art, Business Administration, Project Management, or a related field.</li><li>Proven experience in project management, preferably in the art or hospitality industry.</li><li>Strong knowledge of art curation and procurement processes.</li><li>Excellent budgeting and financial management skills.</li><li>Exceptional negotiation and communication abilities.</li><li>Detail-oriented with strong organizational skills.</li><li>Ability to manage multiple projects simultaneously and meet deadlines.</li><li>Proficiency in project management software and tools.</li></ul><p><br/></p><p><strong>What We Offer:</strong></p><ul><li>Competitive salary and benefits package.</li><li>Opportunities for professional development and career growth.</li><li>A creative and collaborative work environment.</li><li>The chance to work with a passionate team dedicated to delivering outstanding art experiences.</li></ul><p><br/></p>", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3988635333"}