{"jobTitle": "Human Resources Generalist", "company": {"name": "Neuro Wellness Spa", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "66,560.00/yr - 69,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "We are looking for an efficient Human Resources (HR) Generalist to undertake a variety of HR administrative and recruitment duties. You will facilitate daily HR functions like keeping track of employees’ records and supporting the interview process. Your role involves performing tasks with a focus to grow our company’s talent pipeline and improve our sourcing tactics. The ideal candidate will have a broad knowledge of Human Resources as well as general administrative responsibilities. He/She will be able to work autonomously and efficiently to ensure the end-to-end running of HR projects and operations. To succeed in this role, you should be familiar using HR software and tools. Ultimately, you should be able to contribute to the attainment of specific goals and results of the HR department and the organization.", "responsibilities": "Perform orientations, onboarding and update records with new hires\nRespond to internal and external HR related inquiries or requests and provide assistance\nRedirect HR related calls or distribute correspondence to the appropriate person of the team\nMaintain records of personnel-related data (payroll, personal information, leaves, turnover rates etc.) in both paper and the database and ensure all employment requirements are met\nLiaise with other departments or functions (payroll, benefits etc.)\nCreate job postings to be listed on Indeed, Ziprecruiter, etc.\ninterviews, HR events etc. and maintain the team’s agenda\nCoordinate training sessions and seminars\nProduce and submit reports on general HR activity\nAssist in ad-hoc HR projects, like collection of employee feedback\nSupport other functions as assigned\nMonitor and organize applicant listings\nSchedule Interviews\nRecruit healthcare professionals via LinkedIn, etc.\nPrepare and execute job offers\nCoordinate onboarding with the HR department", "qualifications": {"required": "Proven experience as an HR coordinator or relevant human resources/administrative position\nKnowledge of human resources processes and best practices\nStrong ability in using MS Office (MS Excel and MS Powerpoint, in particular)\nExperience with HR databases and HRIS systems (e.g. Virtual Edge)\nOutstanding communication and interpersonal skills\nAbility to handle data with confidentiality\nGood organizational and time management skills", "preferred": "BSc/BA in Business Administration or relevant field; additional education in Human Resource Management will be a plus"}, "skills": ["HR", "MS Office", "HRIS", "Communication", "Interpersonal Skills", "Data Confidentiality", "Organizational Skills", "Time Management"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988374956"}