{"jobTitle": "Program Manager I", "company": {"name": "Herbalife", "industry": "Wellness and Fitness Services", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "148,170.00 to 165,440.00", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Wellness and Fitness Services", "description": "Overview\n\nTHE ROLE: \nThe Program Manager Level One defines the objectives and develops suitable strategies for the program. The career progression begins with assignments to formulate, prioritize, supervisor inter-connected projects and gradually shift towards assessing program performance in order to improve return on investment, controlling deadlines, budgets, etc. and evaluating project managers and other staff\n\nHOW YOU WOULD CONTRIBUTE: \nLevel I\n\nPlans the delivery of the overall program and its activities in accordance with the mission and goals of the organization\nDevelops an annual budget and operating plan to support the program\nEnsures that program activities operate within the policies and procedures of the organization\nEnsures that program activities stay in sync with all relevant legislation and professional standards\nLeads all aspects of the collection and maintenance of records on the clients of the program for statistical purposes according to the confidentiality/privacy policy of the organization\nSupervises program staff by providing direction, input, and feedback\nCoordinates the delivery of services among different program activities to increase efficiency\nMonitors and approves all budgeted program expenditures\nIdentifies and evaluates the risks associated with program activities and take appropriate action to control the risks\n\nSUPERVISORY RESPONSIBILITIES: \nLeads a team 0-2 (increases with level)\n\nQualifications\n\nSKILLS AND BACKGROUND REQUIRED TO BE SUCCESSFUL: \nStrong communication (both business and technical) and interpersonal skills\nMeticulous, project management skills\nAbility to support large, cross-functional projects\nAbility to tackle program issues and lead risks optimally\nAbility to break down problems and estimate effort\nAbility to establish reporting cadence, reports, and metrics\nDeep Knowledge of Project Management Tools and Processes\nFamiliarity with Scaled Agile Framework (SAFe)/ Agile / Scrum principles\n\nCertificates / Training:\nPreferred: Project Management Professional (PMP) certification\nPreferred: SAFe Agile/Scrum certification\n\nExperience:\nLevel I\n7+ years of technology experience\n1+ years of program management experience or equivalent\n\nEducation:\nBachelor's in Information Technology, Business or equivalent\n\nAt Herbalife, we value doing what’s right. We are proud to be an equal opportunity employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected characteristic. We value diversity, strive for inclusivity, and believe the differences among our teammates is a key contributor to Herbalife’s ongoing success.\n\nHerbalife offers a variety of benefits to eligible employees in the U.S. (limited to the 50 States and the District of Columbia), which includes Group Health Programs, other Voluntary Benefit Programs, and Paid Time Off. Group Health Programs include Medical, Dental, Vision, Health Savings Account (HSA), Flexible Spending Accounts (FSA), Basic Life/AD&D; Short-Term and Long-Term Disability and an Employee Assistance Program (EAP). Other Voluntary Benefit Programs include a 401(k) plan, Wellness Incentive Program, Employee Stock Purchase Plan (ESPP), Supplemental Life/Critical Illness/Hospitalization/Accident Insurance, and Pet Insurance. Paid time off includes Company-observed U.S. Holidays, Floating Holidays, Vacation, Sick Time, a Volunteer Program, Paid Maternity and Paternity Leave, Bereavement Leave, Personal Leave and time off for voting.\n\nIf reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please email your request to [email protected].", "responsibilities": "Plans the delivery of the overall program and its activities in accordance with the mission and goals of the organization. Develops an annual budget and operating plan to support the program. Ensures that program activities operate within the policies and procedures of the organization. Ensures that program activities stay in sync with all relevant legislation and professional standards. Leads all aspects of the collection and maintenance of records on the clients of the program for statistical purposes according to the confidentiality/privacy policy of the organization. Supervises program staff by providing direction, input, and feedback. Coordinates the delivery of services among different program activities to increase efficiency. Monitors and approves all budgeted program expenditures. Identifies and evaluates the risks associated with program activities and take appropriate action to control the risks.", "qualifications": {"required": "7+ years of technology experience, 1+ years of program management experience or equivalent, Bachelor's in Information Technology, Business or equivalent", "preferred": "Project Management Professional (PMP) certification, SAFe Agile/Scrum certification"}, "skills": ["Strong communication (both business and technical) and interpersonal skills", "Meticulous, project management skills", "Ability to support large, cross-functional projects", "Ability to tackle program issues and lead risks optimally", "Ability to break down problems and estimate effort", "Ability to establish reporting cadence, reports, and metrics", "Deep Knowledge of Project Management Tools and Processes", "Familiarity with Scaled Agile Framework (SAFe)/ Agile / Scrum principles"], "postedDate": "3 days ago", "applicationDeadline": "Not specified", "benefits": "Group Health Programs, other Voluntary Benefit Programs, and Paid Time Off. Group Health Programs include Medical, Dental, Vision, Health Savings Account (HSA), Flexible Spending Accounts (FSA), Basic Life/AD&D; Short-Term and Long-Term Disability and an Employee Assistance Program (EAP). Other Voluntary Benefit Programs include a 401(k) plan, Wellness Incentive Program, Employee Stock Purchase Plan (ESPP), Supplemental Life/Critical Illness/Hospitalization/Accident Insurance, and Pet Insurance. Paid time off includes Company-observed U.S. Holidays, Floating Holidays, Vacation, Sick Time, a Volunteer Program, Paid Maternity and Paternity Leave, Bereavement Leave, Personal Leave and time off for voting.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988468435"}