{"jobTitle": "Senior Partnerships Manager- LA", "company": {"name": "Global-e", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "Global-e (Nasdaq: GLBE) is the world’s leading platform to enable and accelerate global, direct-to-consumer cross-border e-commerce growth. We make selling internationally as simple as selling domestically for hundreds of retailers and brands worldwide. As a Senior Partnerships Manager, you will be instrumental in fostering and enhancing relationships with our eCommerce partners to drive sales growth and maximize revenue. This role involves managing daily operations of partner accounts, ensuring seamless collaboration, and devising strategies for mutual growth and success. Your expertise in eCommerce, business development, communication and partner ecosystem development will be critical in achieving our objectives.", "responsibilities": "Partnership Management: Cultivate and sustain relationships with key eCommerce partners, including digital agencies, online marketplaces, payment service providers, platforms, and third-party logistics (3PL) providers. Collaborate with partners to uncover growth opportunities, align business goals, and execute joint marketing campaigns. Maintain regular communication with partners to update them on referral performance, product advancements, promotions, and other relevant developments. Monitor partner performance, analyze data, and offer recommendations to enhance sales and revenue. Business Development: Negotiate partnership agreements and contracts to ensure mutually beneficial terms. Identify and pursue new expansion opportunities, including new market entries and innovative partnership programs. Collaborate with Global-e’s marketing team to develop high-impact promotions, events, and co-sponsorship opportunities. Create compelling presentations and collateral to showcase the benefits of partnering with Global-e. Strategic Planning: Formulate and execute strategic plans to achieve growth targets in line with business objectives. Analyze market trends and competitor activities to identify potential opportunities and challenges. Partner with cross-functional teams, including marketing, sales, customer success, and product development, to align strategies and drive results. Performance Analysis: Track key performance indicators (KPIs) for eCommerce partnerships, such as referrals, demos, average contract size, and total contracts. Analyze data to generate actionable insights and optimize partner performance. Prepare and present regular reports to internal stakeholders and partners, highlighting findings and recommendations. Relationship Building: Develop strong relationships with internal teams such as Marketing, Sales, and Solutions to ensure effective support for partnership activities. Serve as the primary point of contact for eCommerce partners, addressing their needs, resolving issues, and delivering exceptional service.", "qualifications": {"required": "Bachelor’s degree in business, Marketing, or a related field, or at least 3 years of equivalent work experience. Proven track record in eCommerce partnership management or a similar commercial role, ideally within the eCommerce industry. Strong business and financial acumen, with excellent time management and organizational skills. Highly motivated, entrepreneurial, and results-driven, with the ability to work both independently and collaboratively. In-depth understanding of Direct-to-Consumer (DTC) eCommerce platforms, logistics, and digital marketing channels. Outstanding communication, negotiation, and relationship-building skills. Analytical mindset with the capability to interpret data, derive insights, and make data-driven decisions. Proficiency in CRM systems, project management tools, and Microsoft Office Suite. Demonstrated ability to communicate, present, and influence effectively at all organizational levels, including executive and C-level.", "preferred": "Not specified"}, "skills": ["eCommerce", "Business Development", "Communication", "Partner Ecosystem Development", "Negotiation", "Strategic Planning", "Performance Analysis", "Relationship Building"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Global-e is an equal opportunity employer. Our team is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and welcome applications from people of all walks of life.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988608868"}