{"jobTitle": "Chief of Staff (to CEO)", "company": {"name": "Passes", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Administrative", "industry": "Technology, Information and Internet", "description": "<strong>About Passes:<br/><br/></strong>Passes is a leading platform dedicated to empowering creators and fostering meaningful connections with their audiences. We are committed to providing innovative solutions that help creators grow and thrive in the digital landscape. Join us and be a part of a team that is shaping the future of the creator economy.<br/><br/><strong>Position Overview:<br/><br/></strong>We’re hiring for a Chief of Staff for Lucy Guo, our CEO. The goal of this role is to be Lucy’s right hand person to make her the most effective CEO possible. We’re looking for someone technical, analytical and relationships driven - a swiss army knife. You’ll be working on a wide range of projects that range from consumer facing partnerships to internal financial modeling.<br/><br/><strong>Key Responsibilities: <br/><br/></strong><ul><li>Architecting payment and payout systems, including understanding how online banking works and how to find/vet/negotiate with vendors, managing external partnerships with talent agencies and brands.</li><li>Creator and fan customer support.</li><li>Sourcing and closing creators.</li><li>Managing our budget and financial forecasts.</li><li>Underwriting creators with minimum guarantees.</li><li>Writing SQL queries to create and maintain KPI dashboards.</li><li>Drafting blog posts/press releases.</li><li>Working closely with design and engineering on product solutions for creators and fans.</li><li>Preparing board decks.</li><li>Reviewing/preparing contracts especially with creators and talent managers.</li><li>Supporting executive hiring.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>High EQ — You are able to read a room and present effectively to different audiences. We work with creators, business owners, agents and more. We are a relationships driven business and first impressions matter a lot.</li><li>Analytical – You are data driven. You know SQL and can use data to test assumptions and inform strategies.</li><li>Direct Communicator — You tell things straight. Even if it’s bad news. You won’t sugarcoat it.</li><li>Proactive – You don’t need to be told what to do. You find things that are broken on your own and work on solutions.</li><li>Protect your executive’s time and energy by triaging things before they get to her.</li><li>Detail oriented – You double check your work. You pay attention to quality.</li><li>Growth mindset — You’re curious, quick to learn, open-minded and seek out feedback.</li><li>Organized — You are able to track and prioritize on your own.<br/><br/></li></ul><strong>Things To Know:<br/><br/></strong><ul><li>You will be a swiss army knife but sometimes that work is more mundane (such as customer support).</li><li>Priorities change and your job each day may be unpredictable. Feedback will be quickly given and exceptionally blunt. You will always know if you’re performing at standard.</li><li>The work is in-person in LA. You may travel a lot.<br/><br/></li></ul><strong>What You Can Expect To Gain From This Role:<br/><br/></strong><ul><li>Be surrounded by some of the smartest operators in the industry.</li><li>Experience building in multiple functions at one of the fastest growing rocketship companies.</li><li>Learn about the ins and outs of the creator economy.</li><li>Learn about managing investor relationships / fundraising.</li><li>Build a wide network ranging from celebrities to agency owners to angel investors.</li><li>Learn about hiring in different functions.</li><li>Learn about product-market fit.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>You’re based in LA or willing to relocate.</li><li>You’re hungry and have an extreme bias to action.</li><li>You are technical and can work your way around SQL and spreadsheets.<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Competitive salary and equity package.</li><li>Comprehensive health, dental, and vision insurance.</li><li>401(k) plan.</li><li>Unlimited PTO.</li><li>Professional development opportunities and continuous learning support.</li><li>Flexible work environment with opportunities for remote work.</li><li>Passes is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</li></ul>", "postedDate": "2 days ago", "skills": ["SQL"], "url": "https://www.linkedin.com/jobs/view/3988028759"}