{"jobTitle": "Executive Administrative Assistant", "company": {"name": "LHH", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "35.00/hr - 45.00/hr", "currency": "USD"}, "jobFunction": "Administrative and Management", "industry": "Business Consulting and Services", "description": "Executive Assistant<br/><br/><br/>We are seeking a detail-oriented and resourceful Executive Assistant to provide comprehensive administrative support to our executive team. The ideal candidate will have exceptional organizational skills, the ability to manage multiple priorities, and a proactive approach to problem-solving.<br/><strong>Key Responsibilities</strong>:<br/><ul><li><strong>Administrative Support</strong>: Provide high-level administrative support to the executive team, including managing calendars, scheduling meetings, and handling correspondence.</li><li><strong>Meeting Coordination</strong>: Organize and coordinate meetings, including preparing agendas, taking minutes, and ensuring follow-up on action items.</li><li><strong>Travel Arrangements</strong>: Arrange travel plans, itineraries, and accommodations for executives.</li><li><strong>Communication Management</strong>: Handle incoming and outgoing communications, ensuring timely and accurate responses.</li><li><strong>Document Preparation</strong>: Prepare and edit reports, presentations, and other documents as needed.</li><li><strong>Confidentiality</strong>: Handle sensitive information with the utmost discretion and maintain confidentiality at all times.</li><li><strong>Office Management</strong>: Assist with general office management tasks, including ordering supplies and maintaining office equipment.</li><li><strong>Project Support</strong>: Assist with special projects and initiatives as assigned by the executive team.</li></ul><br/><strong>Qualifications</strong>:<br/><ul><li><strong>Education</strong>: Bachelor’s degree in Business Administration, Communications, or a related field is preferred.</li><li><strong>Experience</strong>: Minimum of 3 years of experience as an Executive Assistant or in a similar role.</li><li><strong>Technical Skills</strong>: Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and other relevant software.</li><li><strong>Organizational Skills</strong>: Exceptional organizational and time-management skills with the ability to manage multiple tasks and priorities.</li><li><strong>Communication Skills</strong>: Excellent verbal and written communication skills.</li><li><strong>Interpersonal Skills</strong>: Strong interpersonal skills with the ability to interact professionally with all levels of staff and external contacts.</li><li><strong>Problem-Solving</strong>: Proactive approach to problem-solving and the ability to make sound decisions independently.</li><li><strong>Attention to Detail</strong>: High level of attention to detail and accuracy</li></ul><br/>", "responsibilities": "Provide high-level administrative support to the executive team, including managing calendars, scheduling meetings, and handling correspondence. Organize and coordinate meetings, including preparing agendas, taking minutes, and ensuring follow-up on action items. Arrange travel plans, itineraries, and accommodations for executives. Handle incoming and outgoing communications, ensuring timely and accurate responses. Prepare and edit reports, presentations, and other documents as needed. Handle sensitive information with the utmost discretion and maintain confidentiality at all times. Assist with general office management tasks, including ordering supplies and maintaining office equipment. Assist with special projects and initiatives as assigned by the executive team.", "qualifications": {"required": "Minimum of 3 years of experience as an Executive Assistant or in a similar role. Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and other relevant software. Exceptional organizational and time-management skills with the ability to manage multiple tasks and priorities. Excellent verbal and written communication skills. Strong interpersonal skills with the ability to interact professionally with all levels of staff and external contacts. Proactive approach to problem-solving and the ability to make sound decisions independently. High level of attention to detail and accuracy", "preferred": "Bachelor’s degree in Business Administration, Communications, or a related field"}, "skills": ["Microsoft Office", "Calendar Management", "Meeting Coordination", "Travel Arrangements", "Communication", "Document Preparation", "Confidentiality", "Office Management", "Project Support"], "postedDate": "2 weeks ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988643707"}