{"jobTitle": "Appeals and Grievances Supervisor", "company": {"name": "Mitchell Martin Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Accounting/Auditing, Administrative, and Customer Service", "industry": "Hospitals and Health Care and Public Health", "description": "<strong>Job summary:</strong>\n<p>The Supervisor, Customer Solution Center Appeals &amp; Grievances is responsible for direct supervision and support of the team responsible for the intake, research, resolution, tracking, trending and reporting within the Appeals &amp; Grievances department.</p>\n<p>This position will be accountable for leading and directing the work for the Appeals &amp; Grievances department by monitoring the research, negotiation and resolution of all types of appeals and grievances to ensure thorough investigations are completed as outlined in the company policies and procedures.</p>\n<p>Provides support and ownership of cases identified as escalated, complex and/or multi-issue appeals and grievances on an as needed basis.</p>\n<p>Collaborates with internal departments to ensure timely resolution.</p>\n<p>This position will be responsible for analyzing and trending for all appeals and grievances.</p>\n<p>Responsible for the development and maintenance of the appeal and grievance Policies and Procedures, workflows, Member correspondence, and training as needed, or on an annual basis.</p>\n<p><br/></p>\n<p><strong>Duties</strong></p>\n<p>Evaluates daily reports to ensure individual and team Key Performance Indicators (KPIs), SLAs, Performance Scorecards meet regulatory requirements.</p>\n<p>Provide direction to staff for complex/sensitive member and provider inquiries, concerns, complaints, appeals, and grievances.</p>\n<p>Conduct weekly 1:1s with direct reports.</p>\n<p>Builds and maintains strong working relationships with internal departments involved in appeal and grievance resolution.</p>\n<p>Development, maintenance and implementation of P&amp;Ps, workflow and training.</p>\n<p>Audit preparation and providing recommendations for Corrective Action Plans from state regulatory agencies.</p>\n<p>Performs other duties as assigned.</p>\n<p><br/></p>\n<p><strong>Qualifications:</strong></p>\n<p><strong>Education:</strong></p>\n<p>Master's Degree Preferred</p>\n<p><br/></p>\n<p><strong>Experience</strong></p>\n<p><strong>Required:</strong></p>\n<p>At least 3-5 years in a healthcare setting in Grievances and Appeals, Compliance, Claims or Call Center.</p>\n<p>At least 2-3 years lead/supervisory experience.</p>\n<p><br/></p>\n<p><strong>Preferred:</strong></p>\n<p>Previous experience in Managed Health, preferably in Customer Service, Appeals and Grievances and/or Claims.</p>\n<p><br/></p>\n<p><strong>Skills</strong></p>\n<p><strong>Required:</strong></p>\n<p>Ability to manage and organize large volumes of data.</p>\n<p>Knowledge of regulatory and accreditation entities and their requirements.</p>\n<p>Excellent verbal and written communication skills and interpersonal skills.</p>\n<p>Good working knowledge of licensure and regulatory requirements, and accreditation standards.</p>\n<p>Ability to work independently.</p>\n<p>Ability to solve complex issues and identify creative solutions.</p>\n<p>Computer ease and literacy with Microsoft Office (Word, Excel, Power Point, Access, and Visio).</p>", "postedDate": "3 weeks ago", "skills": ["Microsoft Office", "Data Management", "Compliance", "Customer Service", "Healthcare", "Communication", "Interpersonal Skills", "Regulatory Requirements", "Accreditation Standards", "Problem Solving", "Leadership", "Supervisory Experience", "Managed Health", "Appeals and Grievances", "Claims", "Call Center"], "url": "https://www.linkedin.com/jobs/view/3988307977"}