{"jobTitle": "Personal Injury Attorney - Fully Remote", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$250,000.00/yr - $350,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Legal Services", "description": "<strong>Litigation Attorney Position Overview<br/><br/></strong>We are seeking a highly-skilled and experienced Litigation Attorney to join our team. The successful candidate will be responsible for providing legal advice and representation to clients in a variety of litigation matters, including personal injury and other civil claims. You will be responsible for analyzing data, conducting legal research, preparing pleadings and motions, as well as representing clients in court proceedings.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Analyze and review legal documents, such as contracts, pleadings, motions, court decisions, and other legal materials</li><li> Research legal issues, applicable laws, and regulations</li><li> Prepare pleadings and motions for filing with the court</li><li> Review and draft contracts and other legal documents</li><li> Prepare legal memoranda and briefs</li><li> Negotiate settlements and other legal agreements</li><li> Advise clients on legal issues and possible courses of action</li><li> Keep abreast of developments in the law<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Strong knowledge of personal injury litigation</li><li> Excellent legal research and analysis skills</li><li> Detail-oriented, organized, reliable, and punctual</li><li> Excellent written and verbal communication skills</li><li> Ability to work independently and as part of a team</li><li> Strong problem-solving and decision-making skills</li><li> Proficient in MS Office Suite and other relevant software<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> PTO</li><li> Health, Dental, and Vision Insurance</li><li> 401K</li><li> Commision/Bonus<br/><br/></li></ul>So, if you are a Litigation Attorney with Personal Injury experience, please apply today or email me directly at brad.trombly@cybercoders.com<br/><br/><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>brad.trombly@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BT8-1812963 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Brad Trombly - Executive Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.<br/><br/>", "responsibilities": "Analyze and review legal documents, such as contracts, pleadings, motions, court decisions, and other legal materialsResearch legal issues, applicable laws, and regulationsPrepare pleadings and motions for filing with the courtReview and draft contracts and other legal documentsPrepare legal memoranda and briefsNegotiate settlements and other legal agreementsAdvise clients on legal issues and possible courses of actionKeep abreast of developments in the law", "qualifications": {"required": "Strong knowledge of personal injury litigationExcellent legal research and analysis skillsDetail-oriented, organized, reliable, and punctualExcellent written and verbal communication skillsAbility to work independently and as part of a teamStrong problem-solving and decision-making skillsProficient in MS Office Suite and other relevant software", "preferred": null}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": null, "benefits": "PTOHealth, Dental, and Vision Insurance401KCommision/Bonus", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988855375"}