{"jobTitle": "Senior Manager, Business Development", "company": {"name": "Nexxen", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "90,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Advertising Services", "description": "Who is Nexxen?<br/><br/>One platform. Endless opportunities. In an ecosystem where everyone’s trying to get closer – buyers to sellers, platforms to clients, brands to consumers – Nexxen bridges new opportunities in ways that others cannot. Data, service, and planning capabilities are our superpowers, enabling our clients to better reach and understand audiences across screens. Nexxen brings new and distinct opportunities to our partners, giving our employees the chance to expand and grow their skills.<br/><br/>Why join the Nexxen team?<br/><br/>With a global footprint, you can be part of a team that is transforming advertising through our creative, flexible and unified solutions. Employees hustle, commit and dedicate themselves to pillars that make up the Nexxen Way – the 3Cs - Customer Centric, Curious Mindset, Collaborative with No Ego.<br/><br/>What You’ll Do<br/><br/>As the <em>Senior Business Development Manager</em>, you will support the Director, Business Development to build and nurture strategic partnerships across a portfolio of solutions to ensure Nexxen has innovative partner-powered products to offer our customers. Please note - We have a hybrid work model with the expectation of 3 days minimum in the local office to collaborate, innovate, and celebrate.<br/><br/>Each Day Can Be Different Here At Nexxen, But Some Of The Things You Can Expect To Be Doing Daily Are<br/><br/><ul><li>Identifying and engaging with potential partners to broker deals that align with client &amp; product objectives </li><li>Negotiating and executing deals with strategic partnership structures </li><li>Cultivate and maintain strong relationships with existing partners to restructure partnership deals to ensure mutually beneficial arrangements </li><li>Work closely with partners and Legal to redline agreements and facilitate the contracting process </li><li>Negotiate and execute legal agreements with key partners including, but not limited to MSAs, SOWs, amendments, and renewals </li><li>Work cross-functionally across business development, product, partner operations, finance, sales, and other areas of the organization to develop and execute business strategy </li><li>Conduct ROI modeling to drive internal alignment and progress successful negotiations <br/><br/></li></ul>What will I bring?<br/><br/><ul><li>BA/BS and 3+ years of AdTech / Media experience focused on business development and strategic partnerships. </li><li>Demonstrated experience in partner offerings across audiences, verification, measurement, creative solutions, and ad serving. </li><li>A successful track record of developing, negotiating, and signing industry-leading strategic deals with a wealth of creative partnership structures. </li><li>Strong internal and external communicator. </li><li>Ability to work with and understand complex advertising and marketing landscape and drive deep relationships with stakeholders to deliver results. </li><li>Strong leadership skills with the ability to effectively manage, coach, and develop others. </li><li>Adept at leading large-scale initiatives. Ability to gain trust and build relationships. <br/><br/></li></ul>At Nexxen, we value our differences, varied experiences, and collective contribution. We know that not everyone takes the same career path, so if you don’t match this job description perfectly, don’t worry! We would rather see your application than risk missing out on your potential to make an impact.<br/><br/>In support of pay transparency and equity, the minimum and maximum full-time annual base salary for this role in New York or Los Angeles is $90,000 - $120,000 at the time of posting, with the potential of an incentive or bonus. While this is our reasonable expectation this is not a guarantee of compensation or salary, actual compensation is influenced by a wide range of factors including but not limited to skill set, level of experience, education, certifications, responsibility, and geographic location. Candidates hired to work in other locations will be subject to the pay range associated with that location. We offer a variety of benefits including medical, dental, vision, disability insurance, 401(k), EAP, parental leave, unlimited vacation, and company-paid holidays. The specific programs and options available will vary depending on the state, start date, and employment type. Our Talent Acquisition team will be happy to answer any questions you may have.<br/><br/>", "responsibilities": "Identifying and engaging with potential partners to broker deals that align with client &amp; product objectives, Negotiating and executing deals with strategic partnership structures, Cultivate and maintain strong relationships with existing partners to restructure partnership deals to ensure mutually beneficial arrangements, Work closely with partners and Legal to redline agreements and facilitate the contracting process, Negotiate and execute legal agreements with key partners including, but not limited to MSAs, SOWs, amendments, and renewals, Work cross-functionally across business development, product, partner operations, finance, sales, and other areas of the organization to develop and execute business strategy, Conduct ROI modeling to drive internal alignment and progress successful negotiations", "qualifications": {"required": "BA/BS and 3+ years of AdTech / Media experience focused on business development and strategic partnerships., Demonstrated experience in partner offerings across audiences, verification, measurement, creative solutions, and ad serving., A successful track record of developing, negotiating, and signing industry-leading strategic deals with a wealth of creative partnership structures., Strong internal and external communicator., Ability to work with and understand complex advertising and marketing landscape and drive deep relationships with stakeholders to deliver results., Strong leadership skills with the ability to effectively manage, coach, and develop others., Adept at leading large-scale initiatives. Ability to gain trust and build relationships.", "preferred": ""}, "skills": ["AdTech", "Media", "Business Development", "Strategic Partnerships", "Partner Offerings", "Audiences", "Verification", "Measurement", "Creative Solutions", "Ad Serving", "Negotiation", "Deal Structuring", "Relationship Management", "Legal Agreements", "MSAs", "SOWs", "Amendments", "Renewals", "Cross-Functional Collaboration", "Business Strategy", "ROI Modeling", "Communication", "Leadership", "Team Management", "Coaching", "Development"], "postedDate": "3 days ago", "benefits": "We offer a variety of benefits including medical, dental, vision, disability insurance, 401(k), EAP, parental leave, unlimited vacation, and company-paid holidays. The specific programs and options available will vary depending on the state, start date, and employment type. Our Talent Acquisition team will be happy to answer any questions you may have.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988442254"}