{"jobTitle": "Chief Operating Officer", "company": {"name": "AltaSeads Conservancy", "industry": "Conservation Programs", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Salary commensurate with experience", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Conservation Programs", "description": "About AltaSeads Conservancy\n\nAltaSeads Conservancy, founded in 2022, is an emerging and dynamic non-profit organization with a pioneering vision. Our mission is to facilitate the preservation, protection, and restoration of the genetic diversity of marine macroalgae (seaweed), which is currently facing multiple existential threats. To counter these threats, AltaSeads Conservancy is establishing a globally recognized seaweed seed bank. At the heart of our work is building an inclusive collection of biodiverse seed stocks, focusing on keystone species and high-potential seaweed farm crops, so that wild seaweed-bed restorers and seaweed farmers have a reliable source of “seed” in the future. AltaSeads’ approach is designed to facilitate easy, equitable, and transparent access to our seed collection.\n\nOur ultimate goal is to harness the potential of seaweed to address globally significant societal challenges, paving the way for a more sustainable and biodiverse future.", "responsibilities": "Effectively communicate the vision, mission, objectives, and strategy to funders and stakeholders. Identify organizational resource needs and secure funding to build the organization’s capability and capacity. Develop processes and organizational policies and programs to drive operating capabilities that support the growth and long-term sustainability of the organization. Oversee day-to-day operations, including managing teams across various functions to ensure that the company is operating efficiently and effectively. Set employee goals to align and focus the organization and assess team and employee performance. Work with legal advisors to ensure regulatory compliance and oversee legal and compliance-related matters.", "qualifications": {"required": "Bachelor's degree in business administration, management, or related field. At least ten years of experience in an operational leadership role, preferably in a non-profit start up or other high-growth environments. Proven track record of developing and implementing business strategies that align with company goals and objectives. Excellent oral and written communication and interpersonal skills. Ability to think strategically and adapt to changing business environments. Entrepreneurial mindset and passion for building and growing innovative organizations. Data-driven analytical skills. Must be a US resident with US citizenship or a Green Card.", "preferred": "Experience in ocean conservation. Experience in biodiversity preservation and restoration. Experience in aquaculture or mariculture."}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "August 15, 2024", "benefits": "Comprehensive benefits package, including medical, dental, and vision coverage.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988625959"}