{"jobTitle": "Retail Merchandiser  California", "company": {"name": "SPAR South Africa", "industry": "Retail", "size": "Not specified", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "SPAR is growing and we are expanding our Part Time Retail Merchandiser team in your area. As a SPAR Merchandiser, know that you are with the leaders in the business that provides the best support in the industry. Most of the merchandising work performed for our clients is set around a client’s window of time rather than specific hours, allowing you enjoy a flexible schedule. As a Merchandiser, you can service various products, conduct resets, product cut-ins, returns, POP placement and other general merchandising activities. We have available part-time, on-going work servicing a wide-variety of clients/retailers for weekly, bi-weekly, and monthly visits. Come join the best in the merchandising business, APPLY TODAY!", "responsibilities": "Meet with Site or Department Manager (as applicable) to review the objectives of your service call, Locate the displays, Remove old product from displays, Complete Full Inventory/scanning, Validate the product stocking, merchandising and display systems using planograms, Maintain quality results by following and enforcing standards, Possibly Traveling from store to store, managing setup, display of Merchandise, or current promotions, Complete call form and upload photos taken.", "qualifications": {"required": "Merchandising and/or retail experience, Available weekday daytime hours, Able to understand plan-o-grams, Able to carry and lift up to 40 lbs. repeatedly, Able to bend, stoop and stand for extended periods, Internet access with an active email address, Android or iOS smart phone and/or tablet for wireless reporting, Report client work completions on the same day as service, Reliable transportation, some travel involved", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive Pay, DailyPay – work today get paid tomorrow, Flexible work hours, Training and Career Advancement, Ability to increase hours if available", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988340424"}