{"jobTitle": "Senior Conflicts Attorney", "company": {"name": "Gunderson Dettmer", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$175,000.00 - $225,000.00", "currency": "USD"}, "jobFunction": "Legal", "industry": "Internet Publishing", "description": "<strong>Gunderson Dettmer</strong>is the only business law firm of its kind - exclusively serving the global venture capital and emerging technology marketplace. With 350 attorneys in eleven offices - from Silicon Valley to Singapore - we innovate for innovators, accelerate entrepreneurship, and help build companies at every stage of the growth lifecycle. We are committed to being the employer of choice by working together to create an environment, in which each of our people can grow, take initiative, and develop a fun, fulfilling and financially rewarding career.<br/><br/><strong>Benefits<br/><br/></strong>In addition to offering competitive salaries, we also offer an excellent benefit package, which includes full medical, dental and vision coverage; 401(k) Profit Sharing Plan; Flexible Spending Account and Paid Time Off.<br/><br/><strong>Job Description<br/><br/></strong>The firm is seeking a full-time <strong>Senior Conflicts Attorney</strong>to join us as a firm-wide resource to review, clear and consult on conflicts of interest and new business intake matters. This position reports directly to the Assistant General Counsel – Compliance, and works in partnership with the Director of New Business Intake. The Senior Conflicts Attorney will provide the leadership and oversight of the firm’s Business Acceptance Department, which clears complex conflicts of interest and provides legal ethics services for the Firm. The Senior Conflicts Attorney ensures business alignment and effective risk management procedures through integrity, creativity, knowledge of ethics rules and best practices, and an ability to influence and build strong working relationships with internal clients and colleagues in a collaborative and supportive manner.<br/><br/>The<strong> Senior Conflicts Attorney Role</strong> works in concert with the Conflicts/New Business Intake Department:<br/><br/><ul><li>Supervise the Business Acceptance Department, ensuring Department staff effectively meet firm needs. Provide supportive coaching; set achievable, challenging team goals; develop skills of team members to ensure achievement of client service priorities</li><li>Prepare timely, substantive and strategically aligned performance evaluations</li><li>Reviews client, related party and adverse party data for new matters to determine whether these proposed engagements involve conflicts of interest. This entails identifying possible conflicts from conflict reports containing that data, contacting the attorneys responsible for relevant matters, and drafting and seeking conflict waivers from select clients to resolve those possible conflicts</li><li>Consults with the Conflicts team and client team, or with the Office of General Counsel to resolve complex engagement or conflicts issues</li><li>Reviews and resolves restricted party screening results and consults with the responsible attorney as necessary</li><li>Reviews new client/matter requests to determine the need for ethical walls or screens and drafts and reviews waiver letters for compliance with screening procedures</li><li>Oversees the technical ethical wall process in conjunction with other teams using department software</li><li>Reviews and provides edits/comments on non-standard engagement letters, conflict waivers, outside counsel guidelines and client or law firm-tendered engagement letters in conjunction with others, including the Office of General Counsel</li><li>As needed, analyzes and resolves conflict of interest issues arising from the firm’s hiring of new lawyers</li><li>Assists in maintaining thorough, accurate and current records of all conflicts resolutions in database to ensure integrity of the database and assist in identification and clearing of future conflicts of interest</li><li>Works with the Conflicts team to investigate and resolve erroneous, outdated or otherwise incomplete data on conflicts reports and ensure corrections are made in database and other records to ensure integrity of information</li><li>Assist Firm personnel in understanding the firm’s new matter intake, conflicts, anti-money laundering, and other compliance procedures</li><li>As needed, assists with updating client lifecycle form documents (engagement letters, non-engagement letters, waivers, disengagement letters, transfer letters, etc.)</li><li>Working with various teams, assist in streamlining and increasing the speed of our business acceptance process without a degradation in quality of service and or a negative impact to our risk posture</li><li>Stays current on, and verifies the Firm’s compliance with, relevant legal ethics opinions and jurisdictional changes in ethics or licensing rules in jurisdictions where the Firm has offices. Maintains a sophisticated, relevant base of knowledge in these areas</li><li>Stays current on, and verifies the Firm’s adherence to guidance from our malpractice insurance providers. Attend conferences whenever possible</li><li>Acts as a resource to the pro bono Committee and Attorney Development. <br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>Candidates must have a J.D. with strong academic credentials</li><li>Active CA, NY or MA licensure preferred, however, a strong candidate admitted to the bar of any US state in which Gunderson Dettmer has an office will be considered. License must be active and in good standing at all times</li><li>Conflicts experience required, preferably in a mid to large law firm</li><li>Minimum of 2 to 5 years of relevant law firm or legal department work experience<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li>Excellent communicator able to both write and converse technically and eloquently</li><li>Enthusiastic and willing to work with lawyers and support staff at all levels and in differing jurisdictions</li><li>Superior attention to detail together with a methodical and organized approach to daily work and projects. Able to manage workload effectively and move projects forward</li><li>Excellent interpersonal skills, a sense of humor and the ability to respond to time critical and complex situations calmly and positively</li><li>Able to influence and build strong working relationships with internal clients and colleagues in a collaborative and supportive manner</li><li>Able to work with a strong team of Conflicts and New Business Intake and Business Acceptance professionals</li><li>Strong ethics and compliance aptitude with an ability to issue spot and find ways to resolve. Creative problem-solving ability</li><li>Solutions focused, proven initiative, pro-active approach and independent thought. Knowledge of legal regulatory and legislative requirements for law firms, and an understanding of risk in the legal services environment, would therefore be beneficial<br/><br/></li></ul><strong>Status<br/><br/></strong><ul><li> Full Time, Exempt, Remote<br/><br/></li></ul>The expected starting salary for this position is $175,000 - $225,000, dependent upon qualifications, experience and location.<br/><br/>Gunderson Dettmer is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class.<br/><br/><em>By applying to this job you acknowledge that you have read the California Consumer Privacy Act Applicant Notice<br/><br/></em>View <strong>HERE<br/><br/></strong>Powered by JazzHR<br/><br/>8nkysP9gqR", "responsibilities": "The firm is seeking a full-time Senior Conflicts Attorneyto join us as a firm-wide resource to review, clear and consult on conflicts of interest and new business intake matters. This position reports directly to the Assistant General Counsel – Compliance, and works in partnership with the Director of New Business Intake. The Senior Conflicts Attorney will provide the leadership and oversight of the firm’s Business Acceptance Department, which clears complex conflicts of interest and provides legal ethics services for the Firm. The Senior Conflicts Attorney ensures business alignment and effective risk management procedures through integrity, creativity, knowledge of ethics rules and best practices, and an ability to influence and build strong working relationships with internal clients and colleagues in a collaborative and supportive manner.<br/><br/>The Senior Conflicts Attorney Role works in concert with the Conflicts/New Business Intake Department:<br/><br/><ul><li>Supervise the Business Acceptance Department, ensuring Department staff effectively meet firm needs. Provide supportive coaching; set achievable, challenging team goals; develop skills of team members to ensure achievement of client service priorities</li><li>Prepare timely, substantive and strategically aligned performance evaluations</li><li>Reviews client, related party and adverse party data for new matters to determine whether these proposed engagements involve conflicts of interest. This entails identifying possible conflicts from conflict reports containing that data, contacting the attorneys responsible for relevant matters, and drafting and seeking conflict waivers from select clients to resolve those possible conflicts</li><li>Consults with the Conflicts team and client team, or with the Office of General Counsel to resolve complex engagement or conflicts issues</li><li>Reviews and resolves restricted party screening results and consults with the responsible attorney as necessary</li><li>Reviews new client/matter requests to determine the need for ethical walls or screens and drafts and reviews waiver letters for compliance with screening procedures</li><li>Oversees the technical ethical wall process in conjunction with other teams using department software</li><li>Reviews and provides edits/comments on non-standard engagement letters, conflict waivers, outside counsel guidelines and client or law firm-tendered engagement letters in conjunction with others, including the Office of General Counsel</li><li>As needed, analyzes and resolves conflict of interest issues arising from the firm’s hiring of new lawyers</li><li>Assists in maintaining thorough, accurate and current records of all conflicts resolutions in database to ensure integrity of the database and assist in identification and clearing of future conflicts of interest</li><li>Works with the Conflicts team to investigate and resolve erroneous, outdated or otherwise incomplete data on conflicts reports and ensure corrections are made in database and other records to ensure integrity of information</li><li>Assist Firm personnel in understanding the firm’s new matter intake, conflicts, anti-money laundering, and other compliance procedures</li><li>As needed, assists with updating client lifecycle form documents (engagement letters, non-engagement letters, waivers, disengagement letters, transfer letters, etc.)</li><li>Working with various teams, assist in streamlining and increasing the speed of our business acceptance process without a degradation in quality of service and or a negative impact to our risk posture</li><li>Stays current on, and verifies the Firm’s compliance with, relevant legal ethics opinions and jurisdictional changes in ethics or licensing rules in jurisdictions where the Firm has offices. Maintains a sophisticated, relevant base of knowledge in these areas</li><li>Stays current on, and verifies the Firm’s adherence to guidance from our malpractice insurance providers. Attend conferences whenever possible</li><li>Acts as a resource to the pro bono Committee and Attorney Development. <br/><br/></li></ul>", "qualifications": {"required": "Candidates must have a J.D. with strong academic credentials, Active CA, NY or MA licensure preferred, however, a strong candidate admitted to the bar of any US state in which Gunderson Dettmer has an office will be considered. License must be active and in good standing at all times, Conflicts experience required, preferably in a mid to large law firm, Minimum of 2 to 5 years of relevant law firm or legal department work experience, Excellent communicator able to both write and converse technically and eloquently, Enthusiastic and willing to work with lawyers and support staff at all levels and in differing jurisdictions, Superior attention to detail together with a methodical and organized approach to daily work and projects. Able to manage workload effectively and move projects forward, Excellent interpersonal skills, a sense of humor and the ability to respond to time critical and complex situations calmly and positively, Able to influence and build strong working relationships with internal clients and colleagues in a collaborative and supportive manner, Able to work with a strong team of Conflicts and New Business Intake and Business Acceptance professionals, Strong ethics and compliance aptitude with an ability to issue spot and find ways to resolve. Creative problem-solving ability, Solutions focused, proven initiative, pro-active approach and independent thought. Knowledge of legal regulatory and legislative requirements for law firms, and an understanding of risk in the legal services environment, would therefore be beneficial", "preferred": "Active CA, NY or MA licensure preferred, however, a strong candidate admitted to the bar of any US state in which Gunderson Dettmer has an office will be considered. License must be active and in good standing at all times"}, "skills": ["Communication", "Legal Ethics", "Risk Management", "Compliance", "Conflict Resolution", "Legal Research", "Legal Writing", "Legal Analysis", "Client Management", "Teamwork", "Problem Solving"], "postedDate": "3 weeks ago", "benefits": "In addition to offering competitive salaries, we also offer an excellent benefit package, which includes full medical, dental and vision coverage; 401(k) Profit Sharing Plan; Flexible Spending Account and Paid Time Off.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988805256"}