{"jobTitle": "Human Resources Business Partner", "company": {"name": "LHH", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "HR Business Partner\nHybrid- Ontario, CA\n<br/>\nWe are seeking a strategic and experienced HR Business Partner to support our growing organization. The ideal candidate will be a proactive problem solver with a strong background in HR practices and employee relations. This role requires a deep understanding of business needs and the ability to translate those needs into HR initiatives that improve performance, employee engagement, and organizational effectiveness.\n\n**Key Responsibilities**:\n<ul><li>**Strategic HR Management**: Partner with business leaders to develop and implement HR strategies that align with business goals.</li><li>**Employee Relations**: Manage employee relations issues, conduct investigations, and provide guidance on disciplinary actions.</li><li>**Talent Management**: Oversee talent management processes, including performance reviews, succession planning, and employee development programs.</li><li>**Recruitment and Onboarding**: Support recruitment efforts by collaborating with hiring managers, conducting interviews, and ensuring a smooth onboarding process for new hires.</li><li>**Policy Development**: Develop, implement, and maintain HR policies and procedures in compliance with legal requirements.</li><li>**HR Metrics and Reporting**: Analyze HR metrics and provide insights to management to support decision-making.</li><li>**Compensation and Benefits**: Collaborate with the compensation and benefits team to ensure competitive and equitable compensation practices.</li><li>**Training and Development**: Identify training needs and coordinate professional development programs for employees.</li><li>**Change Management**: Support organizational change initiatives and help manage the impact on employees.</li></ul>\n\n**Qualifications**:\n<ul><li>**Education**: Bachelor’s degree in Human Resources, Business Administration, or a related field. Master’s degree or HR certification (e.g., SHRM-CP, PHR) is a plus.</li><li>**Experience**: Minimum of 5 years of experience in an HR business partner or similar role.</li><li>**HR Knowledge**: Strong knowledge of HR best practices, employment laws, and regulations.</li><li>**Communication Skills**: Excellent verbal and written communication skills.</li><li>**Interpersonal Skills**: Strong interpersonal and relationship-building skills.</li><li>**Analytical Skills**: Ability to analyze data and provide insights to inform HR strategies.</li><li>**Problem-Solving**: Proven ability to solve complex HR issues and make sound decisions.</li><li>**Adaptability**: Ability to work in a fast-paced environment and manage multiple priorities.</li></ul>\n<p></p>", "postedDate": "3 weeks ago", "salary": {"amount": "50.00/hr - 65.00/hr", "currency": "USD"}, "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988638944"}