{"jobTitle": "Talent Coordinator", "company": {"name": "Night", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "65,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Marketing", "industry": "Entertainment Providers and Technology, Information and Media", "description": "Night is a next-gen representation platform that serves as a talent management company for some of the world's most influential artists, including Kai Cenat, Safiya Nygaard, Hasan Piker, and more. Our platform comprises of Night Labs, Ventures, and Studios, offering a unique blend of talent management, venture capital, content development, and startup incubation.\n\nWe are seeking a dynamic and experienced professional to join our team as a Talent Coordinator based in the Los Angeles Metropolitan Area. As a Talent Coordinator at Night, you will play a key role in managing sponsorship deals, brand outreach, creator support, and more.\n\n**Responsibilities**: \n\n* Represent Night as the point of contact for external brand/agency partners.\n* Execute on select client-facing duties, including business procurement, as well as fostering ongoing business relationships and negotiating service agreements.\n* Create and maintain reports on agencies & brands that are active in the industry.\n* Support clients in the coordinator’s respective vertical on a daily basis.\n* Identify inbound opportunities across all Night clients.\n* Generate market research identifying popular trends.\n* Track and process multiple deals using internal systems.\n* Assist other coordinators and managers in day-to-day operations.\n\n**Qualifications:**\n\n* 1+ years of talent management or influencer marketing experience, working with brands and agencies.\n* Bachelor’s degree or equivalent industry experience.\n* Deep knowledge of YouTube and new media platforms from a business and consumer perspective.\n* Extreme discretion; ability to handle confidential information.\n* Superb communication & teamwork skills, both oral and written.\n* Eagerness to learn from one of the top digital talent managers in the industry.\n* Work hour flexibility (not your typical 9-5).\n\nIf you are an individual with a passion for the creator economy as well as a desire to contribute to the success of top-tier artists in the digital landscape, we invite you to apply for the position of Talent Coordinator at Night.\n\nPlease include a cover letter or a video application. We look forward to speaking with you!\n\nNight is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "responsibilities": "Represent Night as the point of contact for external brand/agency partners. Execute on select client-facing duties, including business procurement, as well as fostering ongoing business relationships and negotiating service agreements. Create and maintain reports on agencies & brands that are active in the industry. Support clients in the coordinator’s respective vertical on a daily basis. Identify inbound opportunities across all Night clients. Generate market research identifying popular trends. Track and process multiple deals using internal systems. Assist other coordinators and managers in day-to-day operations.", "qualifications": {"required": "1+ years of talent management or influencer marketing experience, working with brands and agencies. Bachelor’s degree or equivalent industry experience. Deep knowledge of YouTube and new media platforms from a business and consumer perspective. Extreme discretion; ability to handle confidential information. Superb communication & teamwork skills, both oral and written. Eagerness to learn from one of the top digital talent managers in the industry. Work hour flexibility (not your typical 9-5)."}, "skills": ["Talent Management", "Influencer Marketing", "YouTube", "Brand Management", "Communication", "Teamwork"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid paternity leave, Paid maternity leave, Commuter benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988432569"}