{"jobTitle": "Deal/Middle Office Operations Position", "company": {"name": "Atlas Search", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00/yr - $155,000.00/yr", "currency": "USD"}, "jobFunction": "Finance", "industry": "Financial Services", "description": "This is a highly visible position in a recently created Deal Operations team that has been tasked with centralizing and standardizing the operational model for private deals at the firm This position will work closely with investment professionals and various stakeholders across the firm to support and drive the end-to-end operational workflow of private deals. As such, this position is expected to comprehensively understand the full lifecycle of all private asset classes, which includes but is not limited to private credit, real assets, private placements, and derivatives. This position is expected to be in daily communication with the investment teams and be able to independently contribute by fully understanding private deals through various communication methods, including comprehending deal documents, and translating deal information to appropriate transaction record-keeping. This position is involved in the private deal workflow “end to end”, from pre-close, closing/settlements, and maintenance of both IBOR and ABOR requirements.  As this is a relatively new team, this role also involves working with various stakeholders on key initiatives and identifying process improvement opportunities with the objective of centralizing and creating scale while minimizing operational risk. The expectation of this role is to recommend tactical and strategic transformational initiatives and fully execute the objectives while working in collaboration with various other stakeholders, including technology.", "responsibilities": "Supporting the Investment Team on private deal transactions by ensuring operational readiness for deal transaction closing;Ability to comprehend and translate deal documents into a transaction processing event;Facilitate the middle office function by working with various stakeholders by leading navigation on highly complex deals;Processing all private deals accurately and timely onto the firms accounting system;Ensuring settlement and closing of private deal transactions;Spearheading cross-functional initiatives relating to the private deal workflow;Reporting KPIs to senior leadership and analyzing trends and identifying strategic opportunities;Proposing recommendations and executing transformational change initiatives;Coordinating with Funds’ independent auditors, custodians, fund administrators, counterparties for private deal-related inquiries and requests;Performing other tasks as required.", "qualifications": {"required": "7+ years of relevant investment operations, investment accounting, or middle office experience;Strong knowledge of reconciliation and direct experience navigating an accounting system or order management system;Strong knowledge of various asset classes, with an emphasis on private credit or alternative investments;Solid analytical skills and ability to understand and resolve complex problems;Microsoft Excel “power user”, able to independently analyze data, create pivot tables, charts, formulas, and;High proficiency in Microsoft Excel, Word, and PowerPoint.", "preferred": ""}, "skills": ["Investment Operations", "Investment Accounting", "Middle Office", "Reconciliation", "Accounting System", "Order Management System", "Private Credit", "Alternative Investments", "Analytical Skills", "Problem Solving", "Microsoft Excel", "Word", "PowerPoint"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988548595"}