{"jobTitle": "Data Analyst, Production Finance Operations & Innovation", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The Production Finance Operations and Innovation (O&amp;I) Data Analyst will play a critical role in supporting the Production Finance team and cross-functional partners across a range of data-related projects. O&amp;I drives informed decision-making by providing analysis for a range of stakeholders, including senior leadership and cross-functional partners. Ad hoc reporting with same-day turnaround is common. Other projects involve long-term analysis, strategic thinking, and stakeholder management.<br/><br/>The ideal candidate will have strong data-related skills, a passion for driving innovation, and an interest in Production Finance specifically or Entertainment more broadly. This position requires the ability to thrive in a highly collaborative and fast-paced environment, a love for working with data, and the ability to learn quickly.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Data Analysis &amp; Visualization: Analyze structured datasets to develop metrics, reports, and trend patterns using data visualization tools and techniques.</li><li>Cross-functional Business Collaboration: Collaborate frequently with various teams and stakeholders, work with business end-users to understand complex data and analysis needs and act as a proactive thought partner.</li><li>Data Model Adaptation: Explore and utilize data tables owned by adjacent business partners. Respond to changes in data models and identify and investigate issues.</li><li>High-Profile Data Support: Support high-profile and urgent business requests for data to be communicated broadly both internally and externally. Problem-solve urgent data coverage or quality issues as needed.</li><li>Strategic Data Work: Perform both ad-hoc data pulls and long-term analysis involving strategic thinking and stakeholder management.</li><li>Self-Training &amp; Tool Experimentation: Engage in self-training on new tools and experiment with new workflows on Netflix’s Big Data Platform.</li><li>Production Finance team support: Guide Production Finance executives with timely requests regarding how to pull and analyze Production Finance data</li><li>Innovation: Focus on technical development and workflow improvements, and drive innovation by identifying creative solutions to complex challenges.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong><em>Education &amp; Experience<br/><br/></em></strong><ul><li>Bachelor's degree in finance, business administration, entertainment, or data-related fields is helpful but not required</li><li>3+ years of experience working with data</li><li>Experience in Production Finance, Production Accounting, or other Entertainment Industry areas preferred<br/><br/></li></ul><strong>Skills &amp; Abilities<br/><br/></strong><ul><li>Advanced SQL proficiency and database infrastructure knowledge required</li><li>Advanced G Sheets proficiency required</li><li>Experience with Python/R or other statistical programming language is preferred</li><li>Excellent data analysis and visualization skills</li><li>Strong written and verbal communication</li><li>Strong interpersonal skills, with the ability to build relationships with key stakeholders</li><li>Ability to communicate effectively with global teams</li><li>Ability to show flexibility in re-prioritizing as situations arise through the day</li><li>Detail oriented but also interested in understanding the bigger picture<br/><br/></li></ul><strong><em>Personal Attributes<br/><br/></em></strong><ul><li>Must thrive in a fast-paced and collaborative team environment</li><li>Flexible and open to different perspectives</li><li>Curious, with a focus on generating results</li><li>Must be self-motivated, disciplined, highly organized and able to prioritize tasks</li><li>Exhibit the highest personal and professional standards of integrity and ethics<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000-240,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "industry": "Entertainment Providers", "skills": ["SQL", "G Sheets", "Python", "Data Analysis", "Data Visualization", "Communication", "Interpersonal Skills", "Global Teams", "Prioritization", "Integrity", "Ethics"], "postedDate": "12 hours ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988759367"}