{"jobTitle": "Contract Manager", "company": {"name": "Teledyne Reynolds Inc", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Legal", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Teledyne Reynolds (a business unit of Teledyne Defense Electronics, LLC) has over 60 years of heritage supplying the highest quality, high voltage interconnect solutions to the most demanding of applications in the Military/Defense, High-end Industrial, Medical, Energy and Space industries. We are looking for a dynamic individual to join our team! In this role, the Contracts Manager will be responsible for oversight of Contracts Management for the Interconnects business units. This role will be managing all contracts from negotiation through order entry. The person in this position will have an attention to detail, reference/review prior contracts (if available) and evaluate potential benefits as well as risks about a particular contract. This position reports to the President of Defense Electronics. Essential Duties and Responsibilities include the following. (Other duties may be assigned): Craft, evaluate, negotiate and execute a wide variety of contracts covering a range of transactions. Create and maintain relationships with customers and serve as the single point of contact for matters concerning contracts. Maintain records of correspondence and documentation in relation to established contracts and those in progress. Communicate and present information to stakeholders about all contract-related matters. Monitor contracts and move forward with close-out, extension or renewal; making recommendations. Solve any contract-related issues that may arise with parties internally & externally. Manages long-term and short-term goals by working with stakeholders to align goals and projects into roadmaps. Owns project delivery across departments - works with other departments and Vendors to plan and manage execution of committed targets. Assist in design support, resource coordination, and technology delivery. Monitors and manages scope, time and resource needs to achieve customer delivery targets. Obtain, maintain, and manage the complete contractual reports. Create and present financial monthly decks. Supports audit process and participates as required. Interacts with functional peer groups regarding exchange or presentation of information.", "responsibilities": "Craft, evaluate, negotiate and execute a wide variety of contracts covering a range of transactions. Create and maintain relationships with customers and serve as the single point of contact for matters concerning contracts. Maintain records of correspondence and documentation in relation to established contracts and those in progress. Communicate and present information to stakeholders about all contract-related matters. Monitor contracts and move forward with close-out, extension or renewal; making recommendations. Solve any contract-related issues that may arise with parties internally & externally. Manages long-term and short-term goals by working with stakeholders to align goals and projects into roadmaps. Owns project delivery across departments - works with other departments and Vendors to plan and manage execution of committed targets. Assist in design support, resource coordination, and technology delivery. Monitors and manages scope, time and resource needs to achieve customer delivery targets. Obtain, maintain, and manage the complete contractual reports. Create and present financial monthly decks. Supports audit process and participates as required. Interacts with functional peer groups regarding exchange or presentation of information.", "qualifications": {"required": "Minimum of 5 years of professional experience managing contracts preferably in a manufacturing environment Background in Operations, Aerospace, and Engineering is a plus. Bachelor's degree in Business Administration, Finance, Economics or other related field is required. Master's Degree a plus. Excellent communication and interpersonal skills with the ability to explain analytical findings clearly and succinctly to a wide range of audiences. Advanced Excel skills strongly needed.", "preferred": "Not specified"}, "skills": ["Contracts Management", "Negotiation", "Communication", "Interpersonal Skills", "Excel"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Commuter benefits, Disability insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3988609525"}