{"jobTitle": "Event Producer (Temp, Remote)", "company": {"name": "Rescue | The Behavior Change Agency", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Advertising Services", "description": "<strong>The Company<br/><br/></strong>Rescue is a full-service marketing agency with a mission to make healthy behaviors easier and more appealing. Since our founding in 2001, Rescue has been exclusively focused on researching, developing, and implementing positive social change campaigns in public health. We provide research, strategy, creative, production, web, traditional media, social media, policy change, youth engagement, and experiential marketing services to government, non-profit, and healthcare clients in over 35 states and provinces, as well as to federal government agencies.<br/><br/>Rescue’s health behavior change marketing campaigns focus on topics such as tobacco, obesity, substance and alcohol prevention; the promotion of exercise, eating healthy foods, early childhood development, and after-school programs; and other topics that promote healthy living. Rescue’s behavior change campaigns focus on diverse populations within teen (13 - 17), young adult (18 - 26), and adult (18+) populations in both rural and urban areas, resulting in a wide variety of campaign styles and strategies.<br/><br/>We believe that marketing can do more than sell goods, it can create good, and we are looking for team members who are ready to work hard to create a healthier world.<br/><br/><strong>The Job<br/><br/></strong>We are looking for a dynamic, high-performing Event Manager with experience producing a large education-focused conference and ensuring a seamless experience for attendees, from registration to on-site attendance. The ideal candidate has a passion for behavior change and a history of serving as the most senior on-site point person for all attendees and vendors from start to finish for questions, concerns, and escalations. They excel in providing clear, concierge-style communication with executive teams and high-profile mainstage keynote speakers.<br/><br/><em><strong>Day-To-Day Activities: <br/><br/></strong></em><ul><li>Lead production of biennial Agents of Change Summit, manage potential issues and provide clear directions.</li><li>Manage conference vendors (e.g. venues, caterers, A/V, decorators) and oversee on-site vendor management.</li><li>Proactively manage planning tools, generate and maintain necessary documents (e.g., schedules, room grids, etc.), coordinate breakout rooms and speaker schedules, and conduct pre-conference site visits.</li><li>Work with the event and executive team to manage budget/expense tracking, lead communication within the planning team, and conduct weekly planning meetings.</li><li>Coordinate with the marketing team to ensure on-time and on-budget printing and procurement of all conference materials and collateral.<br/><br/><br/></li></ul><em><strong>Other:<br/><br/></strong></em><ul><li>Exercise discretion and independent judgment with respect to matters of significance; and</li><li>Other duties as required. <br/><br/><br/></li></ul><em><strong>Required Qualifications: <br/><br/></strong></em><ul><li>Bachelor's Degree +5 years relevant experience OR 10 years relevant experience </li><li>Experience producing a conference, or large corporate event (500+ attendees);</li><li>Experience overseeing a mains stage Run of Show working with an outside AV team;</li><li>Experience supervising a large team of on-site staff for a seamless event experience;</li><li>Proven project and team management experience;</li><li>Proven ability to work across multiple teams (video, event, executive, vendors) in the production of a final work product;</li><li>Proven ability to stay on the cutting edge of the event marketing domain.<br/><br/><br/></li></ul><strong>Location:</strong> San Diego and Los Angeles preferred, but remote work is allowed on a case-by-case basis.<br/><br/><strong>Status:</strong> Temporary, 6 Months. Will work 30 hours a week from September to November and 40 hours a week from December through March 14.<br/><br/><strong>Pay Range:</strong> $45 - $50 per hour.<br/><br/><strong>Benefits:</strong> Learn more about the benefits of working at Rescue through the Benefits and Perks section on our careers page: http://rescueagency.com/careers/. Benefits include generous health plans for medical and mental health services, dental, and vision; paid time off; life and short-term disability insurance, and 401(k) with employer matching.<br/><br/><strong>Travel:</strong> Will be required to conduct at least 1 pre-event site visit to San Diego, and required to attend the Summit in San Diego<br/><br/>If you’re ready to join our team of mission-driven talent challenging the status quo, we’d love to meet you! Check out our Careers page at rescueagency.com/careers for more information about what it’s like to work at Rescue and the benefits that we offer to our team members.<br/><br/><strong>The Fine Print<br/><br/></strong><em><strong>Environment:<br/><br/></strong></em>All business-related environments are tobacco-free.<br/><br/><em><strong>Physical Requirements:<br/><br/></strong></em>Able to remain in a sitting position for prolonged periods of time for the performance of duties. Able to read from a computer, laptop monitor, or tablet for a full workday and for long periods of time (typically 8 hours) including fonts of various sizes from a variety of sources. If working from a Rescue office location, able to stoop, bend, reach, climb stairs, and move freely throughout the building. Able to travel nationwide as needed to meet with clients, coworkers, or attend meetings and seminars. Must be able to move boxed work documents, up to 40 pounds, in and out of office for travel by car and by air.<br/><br/><strong>The Application<br/><br/></strong>All applications must be submitted through Rescue’s online careers system (unless you qualify to request a reasonable accommodation, as detailed at RescueAgency.com/careers). We do not accept applications via email, mail, fax or in-person delivery. Please send questions to careers@rescueagency.com. All applicants must include links to an online portfolio or to direct examples of past work, where applicable. Applications without portfolio links will not be reviewed. All applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status or on the basis of disability.<br/><br/>PLEASE NOTE: All email correspondence that you receive from Rescue Agency will be sent through an ‘@rescueagency.com’ email address. We recommend that you disregard any emails posing as authentic Rescue Agency accounts (e.g. @rescueaggency.com or rescueagency.jobs@gmail.com). If you receive a message from a Rescue employee, you can verify the legitimacy of the message by contacting us at careers@rescueagency.com.<br/><br/>By providing a telephone number and submitting the form you are consenting to be contacted by SMS text message. Message &amp; data rates may apply. Reply STOP to opt out of further messaging.<br/><br/><strong>Rescue | The Behavior Change Agency is an EEO/Minority/Female/Disability/Protected Veteran Employer<br/><br/></strong><strong> #REMOTE<br/><br/></strong>", "responsibilities": "Lead production of biennial Agents of Change Summit, manage potential issues and provide clear directions. Manage conference vendors (e.g. venues, caterers, A/V, decorators) and oversee on-site vendor management. Proactively manage planning tools, generate and maintain necessary documents (e.g., schedules, room grids, etc.), coordinate breakout rooms and speaker schedules, and conduct pre-conference site visits. Work with the event and executive team to manage budget/expense tracking, lead communication within the planning team, and conduct weekly planning meetings. Coordinate with the marketing team to ensure on-time and on-budget printing and procurement of all conference materials and collateral. Exercise discretion and independent judgment with respect to matters of significance; and Other duties as required.", "qualifications": {"required": "Bachelor's Degree +5 years relevant experience OR 10 years relevant experience Experience producing a conference, or large corporate event (500+ attendees); Experience overseeing a mains stage Run of Show working with an outside AV team; Experience supervising a large team of on-site staff for a seamless event experience; Proven project and team management experience; Proven ability to work across multiple teams (video, event, executive, vendors) in the production of a final work product; Proven ability to stay on the cutting edge of the event marketing domain.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Learn more about the benefits of working at Rescue through the Benefits and Perks section on our careers page: http://rescueagency.com/careers/. Benefits include generous health plans for medical and mental health services, dental, and vision; paid time off; life and short-term disability insurance, and 401(k) with employer matching.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988891404"}