{"jobTitle": "Supervisor, Supply Chain (Evening Shift)", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>Supervises team applying best standards and practices in Supply Chain and Logistics and monitors team compliance to relevant guidelines. Manages the resolution of inventory, asset, and vendor/suppliers deficiencies. Implements recommendations suggested to streamline current systems to optimize, maintain, and transform current processes, and oversees the creation of research plans to streamline new/existing business operating models according to supply chain future state. Manages the audits of suppliers, conducts corrective actions based on interpreting needs identified from audits, and facilitates business reviews. Facilitates strategic decisions making based on results on utilization, quality, inventory levels, and courier routes for projects, while assessing customer satisfaction levels.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Recommends developmental opportunities for others; builds collaborative, cross-functional relationships. Solicits and acts on performance feedback; provides team members with feedback; and mentors and coaches to drive performance improvement. Pursues professional growth; provides training and development to talent for growth opportunities; supports execution of performance management guidelines and expectations . Implements, adapts, and stays up to date with organizational change, challenges, feedback, best practices and processes. Fosters open dialogue, supports, mentors, engages, and motivates team members on collaboration . Delegates tasks and decisions as appropriate; provides appropriate support, guidance and scope. </li><li>Supervises and coordinates daily activities of designated work team or unit by monitoring the execution and completion of tactical action items and work assignments; ensures all policies and procedures are followed. Aligns team efforts and standards, and measures progress in achieving results; determines and carries out processes and methodologies; resolves escalated issues as appropriate. Develops work plans to meet business priorities and deadlines; coordinates, obtains and distributes resources. Removes obstacles that impact performance; identifies and recommends improvement opportunities; influences teams to execute in alignment with operational objectives. </li><li>Ensures asset accounting by: guiding and providing support, when needed, for the asset approval (e.g., vehicles, medical equipment), transfer, and disposal processes; supervising the dispositions in the accounting system; supervising the compliance with policies and procedures that achieve accountability by proposing strategies for cost reduction for the misuse of assets; and maintaining an ongoing process to identify, evaluate, and implement cost restructuring and cost reductions. </li><li>Ensures ongoing quality customer services by: supervising the resolution of customer issues pertaining to vendors/suppliers reporting, billing, and merchandise while building and managing relationships with key customer; coordinating the resolution of backorder problems, delivery delays, repairs, designing route changes, customer concerns, and returns; supervising product returns and recalls; and reviewing reports (e.g., key metrics, cost and daily analysis) for customers. </li><li>Ensures adequate levels of inventory are maintained by: supervising the resolution of the receipt and distribution of inventory, and developing processes for the transactions and requests for supplies, equipment, and services; reviewing results from quantitative/qualitative analyses to forecast demand to minimize obsolescence or expiration; widely applying strategies for maintaining automated inventory and ordering systems to support inventory reconciliation and supervising routine inventory counts; confirming a wide range of complex reorder levels are updated, maintained, and adhered to so that proper product rotation remains valid, and inventory levels are accurate; and working collaboratively with contacts internal and external to the organization to maintain the inventory control system (e.g., ensure accuracy of product line, proper level of stock, rotation of product, cleanliness of product/carts). </li><li>Maintains and improves supply chain and operations by: supervising wide range of complex activities (i.e., shipping logistics, carrier, and inventory system evaluation) to optimize, maintain, and transform current processes for increased efficiency; developing and supervising research plans to identify new/existing business operating models according to supply chain future state functional and technical design; and, with contacts internal and external to the organization, implementing and monitoring processes to determine end-to-end sourcing, procurement, and logistics. </li><li>Ensures purchasing strategy is consistent with the overall national sourcing strategy by: supervising the processing of purchase requests; supervising the development of purchase standardization, quality, amounts, or equivalency; supervising the resolution of purchase-related problems and identifying and implementing cost savings opportunities, acting as a key contact for suppliers; supervising and recommending order quantities, while also coordinating product evaluations and trials; and coordinating efforts to select new products, disseminating information to the appropriate team, and equipment. </li><li>Provides direct oversight of compliance with state and federal regulations, and company policy/procedures pertaining to purchasing, inventory management, and distribution by: supervising the application of best standards and practices; supervising quotations for new stock and non-standard items, and fulfilling contracts to ensure compliance; implementing ongoing compliance monitoring (e.g., Joint commission, Sarbanes-Oxley [SOX]) and performance management audits to ensure staff performance is consistent with established standards; coordinating corrective action and the resolution of deficiencies as necessary on a timely basis and in accordance with company policy; and supervising the administration of programs of information, data, training, and education for managers/product users on standards programs, product selection, and expected compliance. </li><li>Maintains suppliers/vendors performance and relationships by: supervising the development of audit processes of suppliers/vendors, ensuring they comply with policies and regulations; supervising programs for enabling the onboarding of new suppliers/vendors and supporting contract negotiations with suppliers/vendors; coordinating corrective actions at scale; supervising the resolution of suppliers/vendor issues; and coordinating efforts to broadly improve strategies for meeting operational and cost targets across suppliers/vendors. </li><li>Provides technical analysis and reporting services for others by: coordinating analyses and monitoring results on utilization, quality, inventory levels, and courier routes for a wide range of complex projects; overseeing customer satisfaction levels, rounding member sites on monthly basis to check on open issues and improvement opportunities, and monitoring the implementation of proven quality improvement procedures; evaluating tools, techniques, and assumptions to ensure complex analyses are appropriate to support operational and business decisions; and coordinating reports in response to business needs for selected departments documenting a wide range of complex analytical results. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Minimum two (2) years of experience with databases and spreadsheets. </li><li>Minimum one (1) years of experience in a leadership role with or without direct reports. </li><li>Bachelors degree in Business Administration, Economics, Finance, Material Management, Operations Research, or related field AND minimum four (4) years of experience in purchasing, contracting, negotiations, material management, logistics, finance, or a directly related field OR Minimum seven (7) years of experience in Materials and Inventory Control/Management, Logistics, Finance, Distribution, or a directly related field.</li></ul>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3989179691"}