{"jobTitle": "Finance Assistant Cashier", "company": {"name": "Los Angeles Philharmonic", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20", "currency": "USD"}, "jobFunction": "Other", "industry": "Musicians", "description": "<strong>Job Description<br/><br/></strong>Position: Finance Assistant Cashier (Part-Time)<br/><br/>Department: Accounting<br/><br/>FLSA Grade: Non-Exempt<br/><br/>Salary: $20 hourly<br/><br/><strong>Position Summary<br/><br/></strong>To assist with balancing and preparing for deposit all parking sales along with receipts from merchandise, program sales and cushion rentals. This includes verifying funds, preparing change banks, and entering data into spreadsheets. Assist with reporting revenue from these operations to the accounting department.<br/><br/>5 to 25 hours a week. Starting shift is 4:30 PM to approximately 10:15 PM. Available to work flexible hours and on most weekdays, including weekends and holidays.<br/><br/><strong>Position Elements<br/><br/></strong><ul><li>Track incoming money from Parking Lot Cashiers, as well as program sales and cushion rental receipts</li><li>Verify daily sales collected and maintain revenue schedule</li><li>Provide change for Parking Lot Cashiers, Box Office, Bowl Store, and Museum</li><li>Prepare next day change funds for Parking Lot Cashiers</li><li>Prepare cash deposits and balance vault nightly</li><li>Ad hoc tasks<br/><br/></li></ul><strong>Relationships<br/><br/></strong>Reports To: Venue Accounting Supervisor<br/><br/>Interacts with: Vault Employees<br/><br/>Parking Cashiers &amp; Manager<br/><br/>Box Office Employees<br/><br/>Retail Employees<br/><br/><strong>Job Requirements<br/><br/></strong>Position Requirements:<br/><br/><ul><li>Prior money handling experience</li><li>Ability to operate money counting machines</li><li>Proficient in Microsoft Office</li><li>Attention to detail</li><li>Dependable</li><li>Strong work ethic</li><li>Ability to follow-through on instructions</li><li>Consistency</li><li>Leadership skills</li><li>High school graduate<br/><br/></li></ul>The Los Angeles Philharmonic Association will consider for employment qualified Applicants with Criminal Histories in a manner consistent with the requirements of the FCIHO.<br/><br/>EQUAL EMPLOYMENT OPPORTUNITY POLICY<br/><br/>It is the Los Angeles Philharmonic Association’s policy to provide equal employment opportunity for all applicants and employees. The Association does not discriminate on the basis of race, color, religion, religious creed (including religious dress and religious grooming), sex (including pregnancy, perceived pregnancy, childbirth, breastfeeding, or related medical conditions), sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition or information, genetic information, marital status, gender, gender identity, gender expression, military status, veteran status, or any other basis protected by federal, state, or local law. Consistent with the law, the Association also provides reasonable accommodation for disabled applicants and employees in accordance with the Americans with Disabilities Act (ADA) and the California Fair Employment and Housing Act, for pregnant employees who request an accommodation with the advice of their health care providers, for pregnancy, childbirth or related medical conditions; for employees who are victims of domestic violence, sexual assault or stalking; and for applicants and employees based on their religious beliefs and practices.", "responsibilities": "To assist with balancing and preparing for deposit all parking sales along with receipts from merchandise, program sales and cushion rentals. This includes verifying funds, preparing change banks, and entering data into spreadsheets. Assist with reporting revenue from these operations to the accounting department.", "qualifications": {"required": "Prior money handling experience, Ability to operate money counting machines, Proficient in Microsoft Office, Attention to detail, Dependable, Strong work ethic, Ability to follow-through on instructions, Consistency, Leadership skills, High school graduate"}, "skills": ["Microsoft Office"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989843556"}