{"jobTitle": "Operations Manager - Service", "company": {"name": "Restaurant Technologies", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Food and Beverage Services", "description": "The Operations Manager, in partnership with General Manager, is responsible for achieving depot results through leading high performance team within assigned depot.<br/><br/><strong>RATE OF PAY:</strong> $60,000 - $110,000 depending on experience<br/><br/><strong>SCHEDULE:</strong> Monday - Friday, 6:00 am start time most days<br/><br/><strong>Primary Job Accountabilities:<br/><br/></strong><ul><li>People Leadership: Responsible for leading and developing team to drive high performance and Restaurant Technologies values. Responsible for developing, managing and coaching depot employees in person and virtually. Accountable for workforce planning, training and on as well as workforce engagement, performance management, recognition, development and coaching. Leads the implementation of systems and processes to maintain a highly engaged workforce. Accountable for actively addressing engagement and individual performance issues. </li><li>Customer Service &amp; Reliability: Responsible for executing high levels of customer service in an efficient manner. Collaborates with Regional Planner, Ops Support Admin and other functional partners to ensure ability to meet customer demand. Ensures that customers are satisfied and any inquiries, incidents and issues are resolved in timely manner. </li><li>Operational Performance: Responsible for achieving depot operations performance through continuous improvement practices and leading Operational Excellence. Specific responsibilities include: managing depot expenses, service and distribution performance through efficient operations. Responsible for leading the overall safety, DOT and quality control management practices within a depot. <br/><br/></li></ul><strong>Education, Requirements &amp; Competencies:<br/><br/></strong><ul><li>5+ years’ experience in operations</li><li>2+ years of management experience</li><li>Proven track record in managing customer service challenges which result in mutual wins</li><li>Comfortable working in fast paced, growth environment</li><li>Ability to motivate others and build highly engaged and effective teams</li><li>Experienced in leading teams for high performance, including managing performance, coaching, handling conflict and developing employees</li><li>Self- aware- knows strengths and weaknesses and actively pursues ways to improve</li><li>Possesses Managerial courage to say what needs to be said, address poor performance and lead courageously</li><li>Strong interpersonal communication skills and the ability to influence across the organization</li><li>Strong business acumen and proven track record in achieving financial and operational results<br/><br/></li></ul><strong>% of Time Traveling: </strong>~20%<br/><br/><strong>Inclusive Employer<br/><br/></strong>At Restaurant Technologies, we celebrate diversity, believe in equity<strong>,</strong> and are committed to creating an inclusive environment for all employees; we’re proud to be an Equal Employment Opportunity and Affirmative Action employer. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.”<br/><br/>If you need assistance or an accommodation due to a disability, please contact us by email at RTCareers@rti-inc.com or call 1-888-796-4997.<br/><br/><strong>Culture &amp; </strong><strong>Benefits<br/><br/></strong>Our employees are the foundation of our success and we take care of them! Our comprehensive benefits include professional development, competitive health care coverage, incentives and a healthy work and life balance. We’ve cultivated an award-winning workplace for driven team members who enjoy a fast pace and rapid growth balanced by a flexible and supportive environment. We’ve earned recognition as a “Best Place to Work,” by the Minneapolis/St. Paul Business Journal along with The Minnesota Work Life Champions Award while consistently earning a spot on Minnesota’s Fastest Growing Companies list. In addition, we’ve earned numerous awards from our customer base who consider Restaurant Technologies a valued strategic partner.<br/><br/><strong>Who We Are<br/><br/></strong>Restaurant Technologies is the leading provider of highly innovative and value-enhancing bulk cooking oil management services to the food service industry. Our solution is environmentally sound, highly efficient and creates a safer, more productive work environment for restaurant personnel. With over 35,000 existing customers we are an established, profitable mid-sized company poised for double-digit growth in the coming year. We are headquartered in suburban Minneapolis, Minnesota with a growing number of sites strategically located across the U.S. serving over 41 metropolitan markets.", "responsibilities": "The Operations Manager, in partnership with General Manager, is responsible for achieving depot results through leading high performance team within assigned depot.", "qualifications": {"required": "5+ years’ experience in operations, 2+ years of management experience, Proven track record in managing customer service challenges which result in mutual wins, Comfortable working in fast paced, growth environment, Ability to motivate others and build highly engaged and effective teams, Experienced in leading teams for high performance, including managing performance, coaching, handling conflict and developing employees, Self- aware- knows strengths and weaknesses and actively pursues ways to improve, Possesses Managerial courage to say what needs to be said, address poor performance and lead courageously, Strong interpersonal communication skills and the ability to influence across the organization, Strong business acumen and proven track record in achieving financial and operational results"}, "skills": ["Operations", "Customer Service", "Management", "Team Leadership", "Performance Management", "Training", "Coaching", "Operational Excellence", "Continuous Improvement", "Safety", "DOT", "Quality Control", "Business Acumen", "Financial Results", "Communication", "Influence"], "postedDate": "3 weeks ago", "benefits": "Our employees are the foundation of our success and we take care of them! Our comprehensive benefits include professional development, competitive health care coverage, incentives and a healthy work and life balance. We’ve cultivated an award-winning workplace for driven team members who enjoy a fast pace and rapid growth balanced by a flexible and supportive environment. We’ve earned recognition as a “Best Place to Work,” by the Minneapolis/St. Paul Business Journal along with The Minnesota Work Life Champions Award while consistently earning a spot on Minnesota’s Fastest Growing Companies list. In addition, we’ve earned numerous awards from our customer base who consider Restaurant Technologies a valued strategic partner.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989635824"}