{"jobTitle": "Business Analyst - Insurance Operations - REMOTE", "company": {"name": "WAHVE LLC", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Staffing and Recruiting", "description": "<strong><em>Put your Insurance Experience to work - FROM HOME!<br/><br/></em></strong>At <strong>WAHVE</strong>, we value significant insurance experience and want to revolutionize the way people think about <strong><em>phasing into</em> <em>retirement</em></strong> by offering qualified candidates the opportunity to continue their career working from home. As we say - <strong><em>retire from the office but not from work</em></strong>. Our unique platform provides you with <em>real</em> work/life balance and allows you to customize your own work schedule while continuing to utilize your insurance expertise in <strong><em>a remote, long-term position which includes company benefits! <br/><br/></em></strong><strong>What You’ll Love About Wahve<br/><br/></strong>We created a welcoming place to work with friendly and professional leadership. We are known for the great care we take with our staff and our clients. We are passionate and determined about delivering the best customer service, preserving insurance industry knowledge, and making a difference by the work that we do.<br/><br/><strong>What We Are Seeking<br/><br/></strong>We have assignments available to help our <em>insurance carrier or MGA </em>clients in <strong>Operations Business Analyst positions. Responsibilities <em>may include</em>:<br/><br/></strong><ul><li>Liaise with various operational areas such as underwriting, accounting, compliance, audit, information technology, etc. </li><li>Translate conceptual customer requirements into functional requirements in a clear manner that is comprehensible to technicians. </li><li>Become proficient managing multi-state, multi-line accounts throughout the policy life cycle which could include rating/pricing, quoting, and issuing policies as well as handling related account activity. </li><li>Participate and understand the development of operational KPI’s and service standards. </li><li>Process transactions and follow varied workflows dependent upon line of business, company, state, specific rules, and regulations. </li><li>Ability to analyze and interpret various bureaus (ISO, AAIS, and/or NCCI) and/or company proprietary rate, rules, and forms - preferred but not required. </li><li>High demand for current knowledge of Cyber, Technology Errors and Omissions, and/or Privacy/Security Liability. <br/><br/></li></ul><strong>TO BECOME A WORK-AT-HOME VINTAGE EXPERT, WE REQUIRE<br/><br/></strong><ul><li>25 years of full-time work experience</li><li>10 recent years of insurance industry experience<br/><br/></li></ul><strong>Benefits Of Becoming a Wahve Vintage Expert<br/><br/></strong><ul><li>Health insurance based on eligibility. </li><li>401(k) with a 4% match. </li><li>Retire from the office but not from work. </li><li>Eliminate the office stress and the commute. </li><li>Choose the work you would like to do now. </li><li>Customize your schedule - full or part time. </li><li>Utilize your years of insurance industry knowledge. </li><li>Be part of our dynamic yet virtual team environment and connect with other experienced insurance professionals like yourself!<br/><br/></li></ul><strong>How To Get Started<br/><br/></strong>Click <strong><em>APPLY NOW</em></strong> to complete our simple preliminary profile. Be sure to include your preferred contact information as one of our Qualification Specialists will connect with you promptly.<br/><br/><strong>WE LOOK FORWARD TO MEETING YOU!</strong>", "responsibilities": "Responsibilities <em>may include</em>:<br/><br/>", "qualifications": {"required": "25 years of full-time work experience\n10 recent years of insurance industry experience"}, "skills": [], "postedDate": "3 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3989280885"}