{"jobTitle": "General Manager", "company": {"name": "IB Hospitality", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Restaurants", "description": "Margot - General Manager<br/><br/>Margot restaurant is searching for General Manager candidates. We are looking for a strong leader with a team forward attitude. Applicants must have prior restaurant and GM experience. Please email a resume for review.<br/><br/>Who We Are<br/><br/>IB Hospitality is a rapidly expanding hospitality group, currently owning and managing two restaurants in Los Angeles: margot and Juliet. We pride ourselves on our customer-focused experience in a fun and welcoming atmosphere. We hold our employees to the highest standards and strive to have a communal experience. We are market-driven and eclectic, with European and other global influences on both the service and our menus. Our beautifully designed indoor and outdoor spaces provide a variety of dining experiences for all occasions and events. We also work hard to provide great benefits and competitive salaries for our employees with many opportunities to grow and expand.<br/><br/>With a market-driven menu inspired by coastal mediterranean cuisine, regional wines and craft cocktails, margot offers an elegant dining experience. situated at the stunning rooftop of Platform in Culver City.<br/><br/>What We’re Looking for in a Candidate<br/><br/>An ideal candidate has a broad hospitality background with experience in a similar role. Some experience in corporate is a plus but is not required. Candidates with demonstrated technical or organizational skill sets are well-suited for this position. Candidates should have keen organizational and interpersonal skills as well as a strong work ethic.<br/><br/>Prior GM experience<br/><br/>Prior restaurant management experience<br/><br/>History of staff training<br/><br/>Payroll/HR experience<br/><br/>Organizational skills a must<br/><br/>Extensive wine knowledge<br/><br/>Global food and beverage knowledge<br/><br/>Team first attitude<br/><br/>Ability to multi-task gracefully under pressure<br/><br/>A nice human with a positive attitude<br/><br/>Equal Employment Opportunity Policy<br/><br/>IB Hospitality provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion age, sex (including pregnancy), national origin, disability status, genetics (including family medical history), protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/>More detail about Margot part of IB Hospitality, please visit https://culinaryagents.com/entities/155016-Margot", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3989827305"}