{"jobTitle": "Project Coordinator", "company": {"name": "E2 Consulting Engineers, Inc.", "industry": "Engineering Services", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00 - $115,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Engineering Services", "description": "E2 Consulting Engineers, Inc. (E2) is a professional services firm established in 1988 specializing in a full spectrum of engineering services including, project engineering and design, federal base operations and infrastructure support services, gas pipeline construction and inspection services, environmental consulting and remediation, and information technology services. At E2, we value safety, innovation and collaboration, and we are dedicated to excellence.", "responsibilities": "Aerospace and construction experience is a plus. Providing tracking and documentation of work standards, contractor schedules, work discrepancies, contractor personnel and communications, purposes, and goals of the organization at the direction of Program or Project Manager. Track schedules and allocated work tasks, training schedules, project GANTT Charts and performance. Tracks and supports program/technical support operations involving multiple project/task orders and personnel at diverse locations. Tracks planning and execution of all program/technical support activities. Maintains management structure supporting documentation technical support activities. Tracks meeting minutes, arranges meeting schedules, provides support for tracking risk, issues and action items.", "qualifications": {"required": "BS. in Engineering, Computer Engineering, or Business Management or equivalent field. 3-5+ years’ experience providing direct project coordination support to Program or Project Managers on IT technical and/or civil Programs and/or Projects. Power BI/Data Analytics experience preferred. Communication skills: Multi-platform and Multi-level. Navigate and analyze info from dashboards. SAP experience a plus. Intermediate plus level in Excel. Understanding of financials/schedules: PMP, Gantts, Critical path, Patterns. PMP, Agile or other Program Management certifications, training or demonstrated experience. IEEE, IEC participating member. Adept at MS Project, Primavera (P6), or equivalent project management planning tools. In-depth knowledge of cost management and controls, budget forecasting, demonstrated risk management and mitigation with exceptional communication skills. Proven aptitude and demonstrated experience for high volume, complex projects and program management. Detail oriented. Proactive. Task-Oriented: Follow through, timely completion. Able to work in fast-paced environments. Facilitate meetings. Eager to help. Able to progress.", "preferred": ""}, "skills": ["Project Management", "Communication", "Excel", "Power BI", "Data Analytics", "SAP", "MS Project", "Primavera (P6)"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "E2 Consulting Engineers, Inc. offers an excellent benefits package including health, dental, vision, and life insurance, 401(k) with employer match, paid time off.", "remoteWork": "In-office/in-field 2-3 times a week with monthly in-person meetings.", "url": "https://www.linkedin.com/jobs/view/3989445973"}