{"jobTitle": "Director of Engineering", "company": {"name": "Accor", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "120,000.00 to 130,000.00 per year", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Hospitality", "description": "<strong>Company Description<br/><br/></strong>Mondrian is a way of travel. With its groundbreaking design and progressive programming, it is a “must” destination for locals or travelers. Mondrian is always at the heart of the most exciting cultural scenes in the world, serving up innovation and creativity for everyone. Mondrian provides a playful framework so that guests and locals alike can immerse themselves in the culture of each city it inhabits. Perfectly nestled in the base of the glittering Hollywood Hills, Mondrian LA has made a name for itself as an icon in its own right. Enter through Mondrian’s 30-foot mahogany doors and settle into your luxurious retreat while discovering the wild within. Welcome to a world of effortless sophistication and vibrant culture.<br/><br/><strong>Job Description<br/><br/></strong>The Director of Engineering is responsible for maintaining the overall operation of the maintenance department, the appearance, and working order of the hotel. This position will work with the General Manager to ensure proper operations, maintenance, service, and repair of all equipment, while supporting the property’s goals of guest satisfaction, cost control, and profitability.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Review contracts and negotiate revisions, changes and additions to contractual agreements with vendors, consultants, clients, suppliers and subcontractors.</li><li>24/7 availability to cover work shifts/emergencies and safety concerns</li><li>Answering phone calls for any work emergencies and safety concern.</li><li>Must uphold the department and company standards of uniform and grooming compliance</li><li>Managing, assigning, and monitoring work projects assigned by the General Manager</li><li>Requisition supplies and materials to complete construction and remodeling projects.</li><li>Plan, organize, and direct activities related to with the maintenance of structures, facilities, and systems.</li><li>Strategically manage daily, weekly, monthly and annual engineering labor hours.</li><li>Strategically manage the engineering budget unless it’s an emergency.</li><li>Develop and implement quality control programs for efficient cost reduction of labor as well as quality of work.</li><li>Delegate and ensure all critical Preventative Maintenance on equipment / projects are performed by hotel Standards</li><li>Strategically plan to ensure Preventative Maintenance of the rooms are set to be performed within the 90 day window.</li><li>Delegate in establishing, implementing, maintaining preventative maintenance schedule.</li><li>Direct the Asst. Manager of Engineering to monitor and control parts and labor expenditures.</li><li>Strategically work with People &amp; Culture to select, train, supervise, develop, discipline, and counseling employees according to Hotel policies and procedures.</li><li>Communicate with direct supervisor regarding all aspects of engineering operations in a proactive matter and without constant follow up.</li><li>Demonstrate positive leadership characteristics, which inspire employees and other department leaders to meet and exceed standards.</li><li>Direct and maintain all record keeping process and systems.</li><li>Ensure all life systems are operational and meet all requirements.</li><li>Fulfill risk control duties as assigned.</li><li>Work closely with Security Manager concerning safety, EPA, HazCom, OSHA procedures.</li><li>Inspect / document physical plant, equipment, hazards, systems, and the general engineering operation.</li><li>Maintain work areas in a safe, clean and organized manner.</li><li>Report all unsafe conditions immediately and develop immediate solutions for safety compliance.</li><li>Respond to all life system alarms.</li><li>Direct in prioritizing all work requests ensuring handling of guest problems, staff problems and inner hotel challenges.</li><li>Order and receive all supplies, materials, maintain all purchase orders, and budgetary data.</li><li>Manage performance appraisals.</li><li>Attend all mandatory meetings.</li><li>Support all Safety Programs and Initiatives as needed.</li><li>Perform any other job-related duties as assigned.<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>8 years or more of progressive hotel or building management experience</li><li>With opening hotels, previous hotel pre-opening experience preferred.</li><li>At least 5 years’ experience in a senior role within facility management.</li><li>Working knowledge of electrical, mechanical, life safety systems, preventative maintenance systems and all related engineering disciplines.<br/><br/></li></ul><strong>Education<br/><br/></strong><ul><li>Bachelor Degree in Engineering or Facilities Management in Business with 5 years of management experience preferred.<br/><br/></li></ul><strong>Working Conditions &amp; Physical Work Demands<br/><br/></strong><ul><li>Able to sit and work at a computer keyboard for extended periods of time.</li><li>Able to stoop, kneel, bend at the waist and reach on a daily basis.</li><li>Able to lift and move up to 50 pounds occasionally.</li><li>Regular and on-time attendance is critical.</li><li>Hours occasionally exceed 40 hours per week.</li><li>Ability to stand during shifts<br/><br/></li></ul><strong>Other<br/><br/></strong><ul><li>Other duties as assigned. <br/><br/></li></ul><strong>Note: </strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required and is not intended to be an exhaustive list of all duties, responsibilities or qualifications associated with this job.<br/><br/><strong>Salary:</strong> $120,000.00 to $130,000.00 per year.<br/><br/>Additional Information<br/><br/>Assimilate into Ennismore’s culture through understanding, supporting, and participating in all Ennismore elements. Demonstrate working knowledge of the service standards. Regular attendance in conformance with the standards, which may be established by Ennismore from time to time, is essential to the successful performance of this position.<br/><br/>Due to the cyclical nature of the hospitality industry, employees may be required to work varying schedules to reflect the business needs of the property.", "responsibilities": "The Director of Engineering is responsible for maintaining the overall operation of the maintenance department, the appearance, and working order of the hotel. This position will work with the General Manager to ensure proper operations, maintenance, service, and repair of all equipment, while supporting the property’s goals of guest satisfaction, cost control, and profitability.", "qualifications": {"required": "8 years or more of progressive hotel or building management experience\nWith opening hotels, previous hotel pre-opening experience preferred.\nAt least 5 years’ experience in a senior role within facility management.\nWorking knowledge of electrical, mechanical, life safety systems, preventative maintenance systems and all related engineering disciplines.", "preferred": "Bachelor Degree in Engineering or Facilities Management in Business with 5 years of management experience preferred."}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989429916"}