{"jobTitle": "Logistics Team Leader - Fluid Systems Division", "company": {"name": "Parker Hannifin", "industry": "Aviation and Aerospace Component Manufacturing, Appliances, Electrical, and Electronics Manufacturing, and Automation Machinery Manufacturing", "size": "Fortune 250", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$101,874.00/yr - $169,885.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing, Appliances, Electrical, and Electronics Manufacturing, and Automation Machinery Manufacturing", "description": "Parker Hannifin is a Fortune 250 global leader in motion and control technologies. For more than a century, the company has been enabling engineering breakthroughs that lead to a better tomorrow. Parker Aerospace, an operating segment of Parker Hannifin Corporation, develops technologies and innovative solutions that enable reliable, efficient, and increasingly sustainable flight for the lifecycle of the aircraft, including aftermarket support. As a member of our team, you are instrumental in fulfilling our mission: 'Enabling Engineering Breakthroughs that Lead to a Better Tomorrow.' Pursuing a career at Parker presents unlimited opportunities for both professional and personal development. Working with some of the most brilliant minds in the industry, your contributions will be pivotal in developing innovative technologies and products, significantly contributing to Parker’s goal of addressing the world’s most pressing engineering challenges. At Parker, our team members belong, matter, and make a difference. We believe that the key to bringing talented new team members into our organization by focusing on everyone’s talents and potential rather than the job specification. If you have innovative ideas and a commitment to excellence, we are more than happy to consider you for other roles in Parker that may be a good fit.", "responsibilities": "We are seeking a dynamic and experienced Logistics Team Leader to join our Fluid Systems team in Irvine, CA. This role is pivotal in driving materials management activities to optimize business outcomes. The ideal candidate will collaborate with cross functional teams to strategically manage the flow of materials and information from receiving to the production floor. Key responsibilities include working cross-functionally to manage receiving and inventory functions and providing direct leadership to the Receiving and Stockroom teams to ensure efficient daily operations and plan for future growth. Logistics Team Leader will oversee the productivity of the Receiving and Stockroom teams, implementing strategies for continuous improvement.", "qualifications": {"required": "B.A./B.S. degree in a related technical or business discipline, professional level experience of six or more years applicable distribution/logistics experience in a world-class, high volume manufacturing environment. Proven competency in a team leader role for two or more years, and/or demonstrated leadership of major projects or programs in a team environment. Thorough knowledge of products, manufacturing processes and technology, information systems, and/or specialty areas, and general business practices. Demonstrated teamwork and team building skills in producing results and meeting organizational objectives. Capable of assessing and developing individual and team skills and capabilities. Able to create and maintain enthusiasm for new and challenging goals. Serve as a role model by promoting new ideas and positive change.", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Comprehensive medical, dental, and vision coverage from day one, including Health Savings and Reimbursement Accounts. Wellness incentive credits leading to reduced healthcare premiums. On-site facilities: 24/7 Onsite Fitness Center, A wide array of food options at our mini mart and Farmers Fridge kiosk, EV Charging Stations, Espresso and Coffee machines, Access to Employee Assistance Program (EAP) for health and well-being support. Participation in health and emotional well-being challenges with rewards. Competitive salary with an annual bonus incentive plan. Retirement benefits: 401(k) with a 5% matching contribution with immediate vesting in addition to a 3% Retirement Income Account (RIA) match per year (3-year vesting period). Income Protection, Life Insurance, Accidental Life & Dismemberment Insurance, Short and Long-Term Disability insurance. Complimentary financial planning services available through EY. Generous Paid Time Off: 15 days, plus up to 13 paid holidays including a company-wide shut down between Christmas and New Year’s. We believe in the importance of work-life integration and support an optional 9/80 Alternative Work Schedule (AWS). Parental Leave: 4 weeks at 100% pay for new family additions. Extras like Adoption Assistance, financial guidance resources, paid jury duty, bereavement time, and time off for citizenship testing, marriage, and birth. Various career development opportunities including but not limited to mentoring programs, leadership development training, and opportunities for advancement. Support for ongoing education through our Educational Reimbursement program ($10,000 per calendar year). Business Resource Groups promoting diversity, equity, and inclusion. Volunteer time off (VTO) up to 8 hours per year and social committee activities throughout the year. Employee Perks on various services (car purchases, computer purchases, life adventures, etc.) Employee Referral program - Refer a family member or friend and receive a generous award for referrals that are hired (up to $4,000) Dress for Your Day policy, offering flexible work attire options.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989247981"}