{"jobTitle": "Specialist, Games Communications", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "60,000.00 - 234,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries, enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. The Opportunity Do you live and breathe games and pop culture? Do you follow the games industry and play games across different genres and platforms? Are you interested in the executives, deals, and developers who make it happen? Do you thrive in a fast-paced, ever-changing environment? Are you a creative thinker who loves finding solutions to tricky problems or new angles to pitch stories? If this sounds like you, we are looking for you to join our team! The Role The Specialist, Games Communications, is a key contributor on the team responsible for building, promoting, and protecting Netflix’s reputation in games. In addition to helping define the Netflix narrative, this role will work on communications plans, announcements, pitches, executive briefings, and more. This role is based out of the Los Angeles office and reports to the Manager of Games Communications. The ideal candidate will have a finger on the pulse of culture with experience in entertainment and games companies, including working directly with developers, game executives, and the press. They will be creative and proactive, able to make wise decisions and exercise sound judgment even when faced with ambiguity, collaborative team players, resourceful, optimistic, and solution-oriented. Responsibilities<br/><br/><ul><li>Track, vet, and respond to media requests.</li><li>Draft communications plans, announcements, briefing materials, and messaging documents.</li><li>Assemble and keep press lists up to date; developing and nurturing media contacts.</li><li>Identify impactful story angles, craft pitches, and secure stories centered around Netflix’s entertainment content – primarily focused on games with an opportunity to work on series, films, franchises, and related consumer products as needed. </li><li>Track, analyze and circulate press coverage reports and competitive research.<br/><br/></li></ul>Qualifications<br/><br/><ul><li>4+ years of experience in corporate or agency setting with a focus on games.</li><li>Working media relationships at traditional and emerging games, entertainment, consumer, trade, and business outlets.</li><li>Strong ability to work cross-functionally to drive comms programs.</li><li>Experience handling a high volume of complex projects and tasks for multiple people and teams while simultaneously managing competing priorities.</li><li>Ability to leverage insights, develop and secure stories aligned to company priorities.</li><li>Clear and concise communication style; strong written and verbal skills that can effectively convey complex ideas.</li><li>Meticulous organizational skills, good judgment of brand and comms risks, and effective time management.</li><li>A curious and ambitious self-starter with an interest in what drives cultural conversation and how Netflix can be at the forefront.</li><li>Passionate about the evolving entertainment landscape with a strong working knowledge of social platforms and trends.</li><li>Have a point of view, and be able to offer a unique perspective and voice.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $60,000 - $234,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Track, vet, and respond to media requests.\nDraft communications plans, announcements, briefing materials, and messaging documents.\nAssemble and keep press lists up to date; developing and nurturing media contacts.\nIdentify impactful story angles, craft pitches, and secure stories centered around Netflix’s entertainment content – primarily focused on games with an opportunity to work on series, films, franchises, and related consumer products as needed. \nTrack, analyze and circulate press coverage reports and competitive research.", "qualifications": {"required": "4+ years of experience in corporate or agency setting with a focus on games.\nWorking media relationships at traditional and emerging games, entertainment, consumer, trade, and business outlets.\nStrong ability to work cross-functionally to drive comms programs.\nExperience handling a high volume of complex projects and tasks for multiple people and teams while simultaneously managing competing priorities.\nAbility to leverage insights, develop and secure stories aligned to company priorities.\nClear and concise communication style; strong written and verbal skills that can effectively convey complex ideas.\nMeticulous organizational skills, good judgment of brand and comms risks, and effective time management.\nA curious and ambitious self-starter with an interest in what drives cultural conversation and how Netflix can be at the forefront.\nPassionate about the evolving entertainment landscape with a strong working knowledge of social platforms and trends.\nHave a point of view, and be able to offer a unique perspective and voice."}, "skills": [], "postedDate": "11 hours ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3989334711"}