{"jobTitle": "Senior Financial Analyst, Foreign Exchange (FX) Accounting", "company": {"name": "Amazon", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60,200.00/year - $128,800.00/year", "currency": "USD"}, "jobFunction": "Finance, Information Technology, and Accounting/Auditing", "industry": "Software Development", "description": "The Foreign Exchange (FX) accounting team is looking for a Senior Financial Analyst to support operational close activities and various accounting teams (AWS, digital, store, payments, advertising, international accounting team, etc.) by providing FX guidance and FX requirements on accounting projects that have FX impact.\n\nThe ideal candidate has a willingness to learn new areas, systems, and skills and will thrive in a complex, high-growth environment, collaborating with teams such as Accounting, Treasury, Tax, Technology, and Corporate Reporting Systems to provide FX guidance on projects involving FX implications. Strong oral and written communication skills are crucial, as well as the ability to think clearly, and analyze quantitatively, and problem-solve issues.\n\nKey job responsibilities\n\n<ul><li> Become a subject matter expert, providing FX requirements and guidance to accounting and technology teams.</li><li> Articulate and provide clarification on FX accounting requirements to non-accounting business stakeholders.</li><li> Perform month end activities and prepare the SEC quarterly deliverable for manager review.</li><li> Identify process improvement opportunities, and initiate and drive process improvement initiatives.</li><li> Perform GAAP research to assess FX accounting implications as needed.<br/><br/></li></ul>About The Team<br/><br/>The FX Accounting team is responsible for the preparation of \"Other Comprehensive Income\" (OCI) and \"Other Income and Expense\" (OI&E) deliverables, as well as reviewing the reasonableness of Amazon’s foreign currency results. Additionally, the FX team provides FX guidance for new business and system launches with FX implications. FX accounting continues to grow in complexity due to the expanding number of countries in which Amazon operates. With Amazon operating in over 90 countries and dealing with over 1,000 currency pairs, the FX team works with a diverse range of FX matters, exposures, and impacted systems.\n\nBasic Qualifications<br/><br/><ul><li> 5+ years of finance or a related analytical field experience</li><li> Bachelor's degree in accounting or related field<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li> CPA</li><li> Knowledge of internal control framework (specifically COSO) to assess control design and operational efficiency</li><li> Knowledge of GAAP research tools and the FASB codification</li><li> Experience in accounting management in Big Four with Fortune 500 clients</li><li> Experience researching and documenting support for accounting conclusions<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $60,200/year in our lowest geographic market up to $128,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/>Company - Amazon.com Services LLC<br/><br/>Job ID: A2719309", "responsibilities": "<ul><li> Become a subject matter expert, providing FX requirements and guidance to accounting and technology teams.</li><li> Articulate and provide clarification on FX accounting requirements to non-accounting business stakeholders.</li><li> Perform month end activities and prepare the SEC quarterly deliverable for manager review.</li><li> Identify process improvement opportunities, and initiate and drive process improvement initiatives.</li><li> Perform GAAP research to assess FX accounting implications as needed.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of finance or a related analytical field experience\nBachelor's degree in accounting or related field", "preferred": "CPA\nKnowledge of internal control framework (specifically COSO) to assess control design and operational efficiency\nKnowledge of GAAP research tools and the FASB codification\nExperience in accounting management in Big Four with Fortune 500 clients\nExperience researching and documenting support for accounting conclusions"}, "skills": ["FX", "GAAP", "COSO", "SEC", "Accounting", "Treasury", "Tax", "Technology", "Corporate Reporting Systems", "Process Improvement", "Communication"], "postedDate": "1 hour ago", "benefits": "Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $60,200/year in our lowest geographic market up to $128,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989934953"}