{"jobTitle": "Learning Designer", "company": {"name": "Meta", "industry": "Technology, Information and Internet", "size": "Large", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$177,000.00 - $245,000.00", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Technology, Information and Internet", "description": "The Learning Designer will partner across Skills Development to develop and implement a strategy to support our role specific skill development priorities. This work will span across onboarding & ongoing functional learning, remaining agile across priorities, regardless of audience. This position will guide design and facilitation excellence for Skills Development priority programs. This role will also be responsible for the relationships needed for designing best in class learning initiatives, managing SME relationships, and facilitating programs as necessary. This role will be involved in consulting on new ideas, crafting ways forward and moving it through to the maintenance phase.", "responsibilities": "Conducts needs analysis, proactively obtaining company-wide business signal, and industry insights to identify priority skill development opportunities. Owns full life-cycle of learning content design and creation, including: setting success metrics, designing course content, identifying, negotiating, and managing vendors, managing stakeholders, developing content to meet stakeholder needs, and partnering across the team to regularly evaluate program health to ensure participants are meeting program outcomes. Gathers and analyzes quantitative and qualitative data critical to solutions development. Partners across Skills Development to develop program strategy for priority learning initiatives. Leads communication by setting tone, voice, and key messages of the program, and leads socialization with key stakeholders to ensure cross-functional (XFN) alignment and buy-in. Partners cross-functionally to build effective learning measurement plans, aligning on cadence of maintenance, and acting as core point-of-contact (POC) for reporting insights back to stakeholders. Partners with members of the project team to improve efficiency and effectiveness as it relates to learning content, consistently pushing the boundary on how we approach learning, testing new methodologies or modalities to ensure the best learning experiences. Acts as core POC for LDBP & HRBP for any overlapping audience, ensuring skills development opportunities are built into broader people initiatives. Facilitation will be a key part of this function, with responsibility falling to this role for facilitation or training-the-trainer (T3’ing) of facilitators for in-house developed programs.", "qualifications": {"required": "12+ years of experience managing complex internal and external facing projects (sales development/strategy, training, communications, marketing, account management) within a highly matrixed organization through regular communications & meetings. Experience delivering full life-cycle of learning content design, creation, and facilitation. Proven facilitation skills. Experience collaborating, sharing and driving best practices cross-functionally and globally. Proven problem solving and creative solution development skills. Effective communication and presentation skills with proven history of success working across functions and teams. Resourceful, action-orientated with experience to get things done independently and overcome obstacles by developing creative solutions to problems. Experience working in a fast-paced, scrappy environment, thriving amidst ambiguity while ensuring executional excellence.", "preferred": "Experience building Learning Solutions to address technical skill gaps in emerging and disruptive technologies. Knowledge of Meta products and operations. Experience in utilizing a multitude of learning modalities, including but not limited to, virtual instructor led sessions, eLearn creation, video scripting, live-led sessions."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Meta offers benefits. Learn more about benefits at Meta.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3989324456"}