{"jobTitle": "Membership Organizer I", "company": {"name": "SEIU Local 2015", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Political Organizations", "description": "Under the direction of the Membership Director, the position is responsible for the execution of Organizational and Department goals. The position reports to the MSD Director.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong>Any one position may not include all of the specific duties and responsibilities listed. Examples provide a general summary of the work required and should not be treated as a total and complete list of expected duties to be performed by employees in the classification.<br/><br/><ul><li>The Organizer will attend to walk ins, MAC escalations, and the goals and objectives of Membership Department. </li><li>The Organizer may oversee various member related activities including but not limited to Internship Programs; recruitment, development, and coordination of Volunteers assisting the Department; Developing Leaders; New Member Orientations, and Timesheet/ETS/Violations Trainings, in person or via Zoom or like platforms</li><li>Conducting membership and COPE sign ups. </li><li>The Organizer will be expected to develop a weekly work plan to advance the goals of the Union and Membership Department, as well as provide regular reports on the outcomes of the work</li><li>Creating and or maintaining various data systems for tracking and monitoring compliance with department and Union programs such as COPE and membership drive, petition drives, and membership mobilization.</li><li>Creates spreadsheets, updates and maintains Local 2015 databases which include entering of membership cards, entering COPE cards, activities reporting, organizing lists, and leadership lists.</li><li>Maintaining and updating both the Registry Membership data base and Salesforce.</li><li>Have the ability to create pertinent flyers</li><li>They will be expected to coordinate member committees that advance the goals and objectives of the Department and Local 2015.</li><li>Works on special projects as assigned by immediate supervisor.</li><li>Perform other duties as required to support the department and mission of the organization. </li><li>The Organizer will be part of a team managing our Maintenance of Check off operation</li><li>Processes all mail in regards to member cancellations and scan all such communication into our Member Data base.</li><li>Will establish and set up files for investigations where necessary with regard to membership claims.</li><li>Will close Investigatory files upon receiving Investigatory files from Member Strength or Membership Department Directors recommendations for disposition of the member claim.</li><li>Will send out appropriate form letters to members wishing to cancel their membership, concerning their windows to do so, or members who have initiated claims in regards to signing the membership card and thus are having those claims investigated<br/><br/></li></ul><strong>Required Skills, Abilities And Experience<br/><br/></strong><ul><li>Ability to work effectively as part of a team</li><li>Ability to work with people from diverse backgrounds and cultures</li><li>Excellent oral and written communication skills</li><li>Strong initiative and ability to work under pressure, with minimal supervision.</li><li>Strong personal planning and time management skills</li><li>Ability to exercise discretion and good independent judgment</li><li>Ability to make effective use of union resources, technology and other available tools</li><li>Basic computer literacy on Windows-based computer programs in order to perform necessary campaign data management and administrative work (create spreadsheets, data reports, and various presentations).</li><li>At least one years’ experience in development and delivery of training and education programs for union members and staff is required.</li><li>At least 3 years’ experience in labor or non-profit organizations related to social and economic causes. Related experience will be given consideration.</li><li>Willingness to work long and irregular hours, including nights and weekends.</li><li>Willingness and ability to travel</li><li>Proficiency using the Internet as a research tool </li><li>Excellent organizational skills </li><li>Ability to communicate and relate respectfully with a diverse membership and staff </li><li>Commitment to provide accurate, efficient and friendly service to staff and members </li><li>Ability to exercise strong problem solving skills </li><li>Ability to multi-task and must work well under pressure </li><li>Able to prioritize and complete workload </li><li>Excellent punctuality and attendance </li><li>Bilingual skills highly desirable <br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong>Long and extended hours and travel may be required.<br/><br/><strong>Scope And Nature Of Supervision<br/><br/></strong>Membership Organizer will report to the Membership Director, or any other assigned supervisor. Supervision and direction often changes on a campaign-by-campaign or project-by-project basis. Membership Organizers are frequently expected to operate without day-to-day supervision, to develop their own work plans and goals, and to act with a great degree of discretion and independent judgment. Accordingly, they must be strong self-starters and have a commitment to fulfill the objectives of the organization.<br/><br/>Job descriptions are not designed to cover or contain a comprehensive listing of every activity or responsibility that is required for each role.<br/><br/>Salary Range: $71,481.82 to $75,1000.58<br/><br/>SEIU Local 2015 is an equal employment opportunity employer committed to recruiting and hiring without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other characteristic protected by law.", "responsibilities": "Under the direction of the Membership Director, the position is responsible for the execution of Organizational and Department goals. The position reports to the MSD Director.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong>Any one position may not include all of the specific duties and responsibilities listed. Examples provide a general summary of the work required and should not be treated as a total and complete list of expected duties to be performed by employees in the classification.<br/><br/><ul><li>The Organizer will attend to walk ins, MAC escalations, and the goals and objectives of Membership Department. </li><li>The Organizer may oversee various member related activities including but not limited to Internship Programs; recruitment, development, and coordination of Volunteers assisting the Department; Developing Leaders; New Member Orientations, and Timesheet/ETS/Violations Trainings, in person or via Zoom or like platforms</li><li>Conducting membership and COPE sign ups. </li><li>The Organizer will be expected to develop a weekly work plan to advance the goals of the Union and Membership Department, as well as provide regular reports on the outcomes of the work</li><li>Creating and or maintaining various data systems for tracking and monitoring compliance with department and Union programs such as COPE and membership drive, petition drives, and membership mobilization.</li><li>Creates spreadsheets, updates and maintains Local 2015 databases which include entering of membership cards, entering COPE cards, activities reporting, organizing lists, and leadership lists.</li><li>Maintaining and updating both the Registry Membership data base and Salesforce.</li><li>Have the ability to create pertinent flyers</li><li>They will be expected to coordinate member committees that advance the goals and objectives of the Department and Local 2015.</li><li>Works on special projects as assigned by immediate supervisor.</li><li>Perform other duties as required to support the department and mission of the organization. </li><li>The Organizer will be part of a team managing our Maintenance of Check off operation</li><li>Processes all mail in regards to member cancellations and scan all such communication into our Member Data base.</li><li>Will establish and set up files for investigations where necessary with regard to membership claims.</li><li>Will close Investigatory files upon receiving Investigatory files from Member Strength or Membership Department Directors recommendations for disposition of the member claim.</li><li>Will send out appropriate form letters to members wishing to cancel their membership, concerning their windows to do so, or members who have initiated claims in regards to signing the membership card and thus are having those claims investigated<br/><br/></li></ul>", "qualifications": {"required": "Ability to work effectively as part of a team, Ability to work with people from diverse backgrounds and cultures, Excellent oral and written communication skills, Strong initiative and ability to work under pressure, with minimal supervision., Strong personal planning and time management skills, Ability to exercise discretion and good independent judgment, Ability to make effective use of union resources, technology and other available tools, Basic computer literacy on Windows-based computer programs in order to perform necessary campaign data management and administrative work (create spreadsheets, data reports, and various presentations)., At least one years’ experience in development and delivery of training and education programs for union members and staff is required., At least 3 years’ experience in labor or non-profit organizations related to social and economic causes. Related experience will be given consideration., Willingness to work long and irregular hours, including nights and weekends., Willingness and ability to travel, Proficiency using the Internet as a research tool , Excellent organizational skills , Ability to communicate and relate respectfully with a diverse membership and staff , Commitment to provide accurate, efficient and friendly service to staff and members , Ability to exercise strong problem solving skills , Ability to multi-task and must work well under pressure , Able to prioritize and complete workload , Excellent punctuality and attendance , Bilingual skills highly desirable <br/><br/>", "preferred": ""}, "skills": ["Teamwork", "Communication", "Time Management", "Problem Solving", "Computer Skills", "Training", "Labor Relations", "Non-profit", "Travel"], "postedDate": "3 weeks ago", "salary": {"amount": "71,481.82 to 75,1000.58", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3989020147"}