{"jobTitle": "Chief of Staff", "company": {"name": "The California State University", "location": "Long Beach, CA", "industry": "Higher Education"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "14,167.00/yr - 21,066.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Higher Education", "description": "Chancellor's Office Statement<br/><br/>Join our team at the California State University, Office of the Chancellor, and make a difference in providing access to higher education. We are currently seeking experienced candidates for the position of Chief of Staff. The CSU Chancellor's Office, located on the waterfront adjacent to the Aquarium of the Pacific in downtown Long Beach, is the headquarters for the nation's largest and most diverse system of higher education. The CSU Chancellor's Office offers a premium benefit package that includes outstanding vacation, health, and dental plans; a fee waiver education program; membership in the California Public Employees Retirement System (PERS); and 15 paid holidays a year.<br/><br/>Salary<br/><br/>The anticipated salary hiring range is up to $14,167 per month, commensurate with qualifications and experience.<br/><br/>The salary range for this classification is $6,563 to $21,066 per month.<br/><br/>Classification<br/><br/>Administrator III<br/><br/>Position Information<br/><br/>The California State University, Office of the Chancellor, is seeking a Chief of Staff to be responsible for providing high-level strategic advising and direction to the DVC. The Chief of Staff will serve as the principal advisor on policy development and strategies to accomplish the priorities, goals and objectives of the CSU and the Division of Academic and Student Affairs. The Chief of Staff serves as a key member of the division leadership team providing insight and support and collaborates with division leadership to identify and shape strategic priorities. The incumbent will monitor and ensure effective resolution of projects by Associate and Assistant Vice Chancellors and ensure that the DVC is optimally prepared and briefed on current and emerging matters in academic and student affairs.<br/><br/>The Chief of Staff works in close collaboration with leaders external to the Office of the Chancellor including Presidents, Provosts, Vice Presidents of Student Affairs, the Academic Senate of the CSU leadership, California State Student Association leadership, and state officials regarding academic and student affairs matters. The Chief of Staff represents the Division of ASA in the absence of the DVC.<br/><br/>This position is approved for telecommuting (two days telecommuting, three days in office (in-person)) with onsite work at the main headquarters located in Long Beach, California.<br/><br/>Responsibilities<br/><br/>Under the general direction of the Deputy Vice Chancellor, Academic and Student Affairs, the Chief of Staff will perform duties as outlined below:<br/><br/>Principal Strategic Advisor and Support to the Deputy Vice Chancellor:<br/><br/><ul><li>Serve as principal advisor to the Deputy Vice Chancellor (DVC) on academic and student affairs matters essential to the campuses and to the strategic priorities of the CSU.</li><li>Support the DVC by strategically managing projects as they are assigned to Academic and Student Affairs (ASA) from the Trustees, Governor, Legislature or Chancellor to assure all critical parties are consulted from within the Division of ASA and across other divisions within the Chancellor's Office (CO). Lead and executive project in collaboration with other senior ASA staff.</li><li>Facilitate the ability of the DVC to manage executive functions by advising, providing context and background information on issues, and ensure execution of initiatives and projects by division staff.</li><li>Work in collaboration with executive assistants to ensure DVC is optimally prepared for meetings, executive functions, and bi-monthly Board of Trustees sessions. Be thoughtful of upcoming projects and initiatives.</li><li>Research, analyze, and interpret information, issues, and proposals for the DVC. Ensure proposals align with division goals, communicate directive to staff on behalf of the DVC, and ensure effective follow-through on applicable action items.</li><li>Manage and coordinate special projects/initiatives as needed, including research, evaluation, analysis, and written or oral reports with recommendations for action that have internal or systemwide implications; and evaluates, researches, and develops specific systemwide and/or CO policies and procedures.</li><li>Develop, prepare, and/or review high-level correspondence, reports, scripts, or presentations, dealing with issues and subject matter that requires considerable sensitivity, discretion, judgment or negotiation in replying to inquiries and/or presenting or requesting information with CO or campus staff.</li><li>Serve in a highly visible capacity presenting and/or facilitating conferences and various system-wide meetings with senior leaders from across the system and external partners.</li><li>DVC liaison to Chancellor's Executive Staff, Provosts/Vice Presidents, CSU Deans, Academic Senate, CSSA, and Academic Affairs division as a whole.</li><li>Serve as the DVC principal point of contact to advise, communicate, and support internal and external parties in the absence of the DVC. Represent the DVC in various settings and meetings as needed.<br/><br/></li></ul>Leadership And Strategic Guidance To Division<br/><br/><ul><li>Anticipate systemwide academic and student affairs developments, function as a high-level point of resolution, develop alternative approaches, propose strategies, and implement courses of action through the Associate and Assistant Vice Chancellors (AVCs).</li><li>Manage projects and relationships with other CO divisions to ensure their senior leaders (DVC/AVCs) are abreast of decisions affecting their areas. Provide ASA perspective across CO teams.</li><li>Assist division AVCs and department leaders with understanding of assignments and help ensure they are completed in a timely manner.</li><li>Work in collaboration with ASA leadership to identify and shape strategic priorities, facilitate and conduct strategic planning activities to update division mission and goals as needed.</li><li>Interface with leadership and staff at all levels throughout the division, CO, and CSU campuses to coordinate initiatives and resolve issues.</li><li>Assist in orchestrating and synchronizing strategic communications across ASA departments to achieve desired effects and cohesive messaging.</li><li>Serve as the chair and facilitator of bi-weekly leadership team meetings and monthly Division-wide gatherings. Strategic development and planning of agenda that promote cohesion and collaboration.<br/><br/></li></ul>Policy Development And State Leadership<br/><br/><ul><li>Academic and student affairs policy development, including system and initiative resource allocation.</li><li>Engagement with state leadership on matters related to CSU academic and student affairs.</li><li>Understand and interpret organizational policies and procedures necessary to ensure appropriate decision-making protocols are followed, make recommendations for change. Evaluate, research, and develop specific CSU systemwide and/or CO policies and procedures.</li><li>Serves as primary point of contact on matters related to CSU academic and student affairs for legislative, state administration and national engagement.</li><li>Function as a system liaison on academic and student affairs matters with other educational segments and organizations.<br/><br/></li></ul>Emerging Trends and Best Practices in Academic and Student Affairs:<br/><br/><ul><li>Keep abreast of trends and best practices in academic and student affairs on the national/global levels. Provide recommendations and guidance for ASA-wide efforts in response to its impact.</li><li>Conduct research and analysis, facilitate training and information sessions with ASA, leaders from across the system, and external audiences<br/><br/></li></ul>Management Of Board Of Trustees Activities<br/><br/><ul><li>Oversee all necessary activities related to Board of Trustees (BOT) meetings, identify trends and track issues raised by Trustees that require follow up by the DVC and/or ASA leadership.</li><li>In partnership with the ASA Communications lead, collaborate with division leadership to allow for accurate submission of required materials. Develop and/or review materials using discretion and judgment in messaging and content. Provide recommendation for action that may have internal or systemwide implications.</li><li>Attend bimonthly and special pre-BOT meetings to identify and track issues and requests raised by BOT Trustees and staff.<br/><br/></li></ul>Other Duties As Assigned<br/><br/><ul><li>Perform other related duties as assigned, required, and deemed appropriate in support of Division goals, priorities, and mission.</li><li>Understand and interpret organizational policies and procedures necessary to ensure appropriate decision-making protocols are followed.</li><li>Travel to the CSU campuses and other agencies/organizations as required for the management and support of Academic and Student Affairs projects.<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Earned baccalaureate degree from an accredited four-year college or university; or an equivalent combination of education and 10 years related experience.</li><li>A minimum of 7 years of high-level project or program management experience with demonstrated progressive growth in responsibilities.</li><li>A minimum of 5 year of progressively responsible experience working for a high-level executive or administrator in a complex work environment is required.</li><li>Experience working in a higher education environment is required.</li><li>Prior experience providing support to a high-level executive that involved overseeing commitments and ensuring priorities were met and logistics were efficiently addressed in an intense, dynamic environment.</li><li>Demonstrated understanding of universities that are part of a large state system.</li><li>Strong project management experience to include developing or managing projects and initiatives.</li><li>Excellent organizational skills and demonstrated ability to plan, organize, coordinate and direct multiple projects and activities with competing deadlines, and to set and manage timelines and priorities.</li><li>Ability to set and manage timelines and priorities; utilize sound judgment, and ensure the utmost discretion and confidentiality in all matters.</li><li>Excel in working across multiple departments/divisions.</li><li>Strong problem-solving and conflict resolution skills, including the ability to manage complex assignments and/or those that require balancing interests that may be at variance with each other.</li><li>Strong administrative and analytical skills, including the ability to research, evaluate, analyze, and strong attention to detail.</li><li>Strong written and oral communication skills and the ability to interpret and communicate policies and procedures and prepare important correspondence and other documents.</li><li>Excellent interpersonal skills with ability to work collaboratively with diverse internal and external constituents.</li><li>Knowledge of current computer platforms and software applications to include Microsoft Word, Excel, PowerPoint, Outlook and multimedia.<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Graduate degree from an accredited university is highly preferred.</li><li>Experience working in academic affairs and student affairs is highly preferred.<br/><br/></li></ul>Application Period<br/><br/>Priority consideration will be given to candidates who apply by August 19, 2024. Applications will be accepted until the job posting is removed.<br/><br/>How To Apply<br/><br/>Please click \"Apply Now\" to complete the California State University, Chancellor's Office online employment application.<br/><br/>Equal Employment Opportunity<br/><br/>The university is an Equal Opportunity Employer and does not discriminate against persons on the basis of race, religion, color, ancestry, age, disability, genetic information, gender, gender identity, gender expression, marital status, medical condition, National origin, sex, sexual orientation, covered veteran status, or any other protected status. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting the Senior Human Resources Manager at (562) 951-4070.<br/><br/>Title IX<br/><br/>Please view the Notice of Non-Discrimination on the Basis of Gender or Sex and Contact Information for Title IX Coordinator at: https://www2.calstate.edu/titleix<br/><br/>E-Verify<br/><br/>This position requires new hire employment verification to be processed through the E-Verify program administered by the Department of Homeland Security, U.S. Citizenship and Immigration Services (DHSUSCIS)' in partnership with the Social Security Administration (SSA).<br/><br/>If hired, you will be required to furnish proof that you are legally authorized to work in the United States. The CSU Chancellor’s Office is not a sponsoring agency for staff and Management positions (i.e., H1-B VISAS).<br/><br/>COVID19 Vaccination Policy<br/><br/>Per the CSU COVID-19 Vaccination Policy , it is strongly recommended that all Chancellor’s Office employees who are accessing office and campus facilities follow COVID-19 vaccine recommendations adopted by the U.S. Centers for Disease Control and Prevention (CDC) and the California Department of Public Health (CDPH) applicable to their age, medical condition, and other relevant indications.<br/><br/>Mandated Reporter Per CANRA<br/><br/>The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.<br/><br/>Conflict of Interest<br/><br/>The duties of this position will include participation in decisions that may have a material financial benefit to the incumbent. Therefore, the selected candidate will be required to file Conflict of Interest Form 700: Statement of Economic Interest when they first occupy the position, and on an annual basis, complete ethics training within 6 months of appointment, and attend this training every other year thereafter.<br/><br/>CSU Out of State Employment Policy <br/><br/>California State University, Office of the Chancellor, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022, the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/>Background<br/><br/>The Chancellor's Office policy requires that the selected candidate successfully complete a full background check (including a criminal records check) prior to assuming this position.", "responsibilities": "Under the general direction of the Deputy Vice Chancellor, Academic and Student Affairs, the Chief of Staff will perform duties as outlined below:<br/><br/>Principal Strategic Advisor and Support to the Deputy Vice Chancellor:<br/><br/><ul><li>Serve as principal advisor to the Deputy Vice Chancellor (DVC) on academic and student affairs matters essential to the campuses and to the strategic priorities of the CSU.</li><li>Support the DVC by strategically managing projects as they are assigned to Academic and Student Affairs (ASA) from the Trustees, Governor, Legislature or Chancellor to assure all critical parties are consulted from within the Division of ASA and across other divisions within the Chancellor's Office (CO). Lead and executive project in collaboration with other senior ASA staff.</li><li>Facilitate the ability of the DVC to manage executive functions by advising, providing context and background information on issues, and ensure execution of initiatives and projects by division staff.</li><li>Work in collaboration with executive assistants to ensure DVC is optimally prepared for meetings, executive functions, and bi-monthly Board of Trustees sessions. Be thoughtful of upcoming projects and initiatives.</li><li>Research, analyze, and interpret information, issues, and proposals for the DVC. Ensure proposals align with division goals, communicate directive to staff on behalf of the DVC, and ensure effective follow-through on applicable action items.</li><li>Manage and coordinate special projects/initiatives as needed, including research, evaluation, analysis, and written or oral reports with recommendations for action that have internal or systemwide implications; and evaluates, researches, and develops specific systemwide and/or CO policies and procedures.</li><li>Develop, prepare, and/or review high-level correspondence, reports, scripts, or presentations, dealing with issues and subject matter that requires considerable sensitivity, discretion, judgment or negotiation in replying to inquiries and/or presenting or requesting information with CO or campus staff.</li><li>Serve in a highly visible capacity presenting and/or facilitating conferences and various system-wide meetings with senior leaders from across the system and external partners.</li><li>DVC liaison to Chancellor's Executive Staff, Provosts/Vice Presidents, CSU Deans, Academic Senate, CSSA, and Academic Affairs division as a whole.</li><li>Serve as the DVC principal point of contact to advise, communicate, and support internal and external parties in the absence of the DVC. Represent the DVC in various settings and meetings as needed.<br/><br/></li></ul>Leadership And Strategic Guidance To Division<br/><br/><ul><li>Anticipate systemwide academic and student affairs developments, function as a high-level point of resolution, develop alternative approaches, propose strategies, and implement courses of action through the Associate and Assistant Vice Chancellors (AVCs).</li><li>Manage projects and relationships with other CO divisions to ensure their senior leaders (DVC/AVCs) are abreast of decisions affecting their areas. Provide ASA perspective across CO teams.</li><li>Assist division AVCs and department leaders with understanding of assignments and help ensure they are completed in a timely manner.</li><li>Work in collaboration with ASA leadership to identify and shape strategic priorities, facilitate and conduct strategic planning activities to update division mission and goals as needed.</li><li>Interface with leadership and staff at all levels throughout the division, CO, and CSU campuses to coordinate initiatives and resolve issues.</li><li>Assist in orchestrating and synchronizing strategic communications across ASA departments to achieve desired effects and cohesive messaging.</li><li>Serve as the chair and facilitator of bi-weekly leadership team meetings and monthly Division-wide gatherings. Strategic development and planning of agenda that promote cohesion and collaboration.<br/><br/></li></ul>Policy Development And State Leadership<br/><br/><ul><li>Academic and student affairs policy development, including system and initiative resource allocation.</li><li>Engagement with state leadership on matters related to CSU academic and student affairs.</li><li>Understand and interpret organizational policies and procedures necessary to ensure appropriate decision-making protocols are followed, make recommendations for change. Evaluate, research, and develop specific CSU systemwide and/or CO policies and procedures.</li><li>Serves as primary point of contact on matters related to CSU academic and student affairs for legislative, state administration and national engagement.</li><li>Function as a system liaison on academic and student affairs matters with other educational segments and organizations.<br/><br/></li></ul>Emerging Trends and Best Practices in Academic and Student Affairs:<br/><br/><ul><li>Keep abreast of trends and best practices in academic and student affairs on the national/global levels. Provide recommendations and guidance for ASA-wide efforts in response to its impact.</li><li>Conduct research and analysis, facilitate training and information sessions with ASA, leaders from across the system, and external audiences<br/><br/></li></ul>Management Of Board Of Trustees Activities<br/><br/><ul><li>Oversee all necessary activities related to Board of Trustees (BOT) meetings, identify trends and track issues raised by Trustees that require follow up by the DVC and/or ASA leadership.</li><li>In partnership with the ASA Communications lead, collaborate with division leadership to allow for accurate submission of required materials. Develop and/or review materials using discretion and judgment in messaging and content. Provide recommendation for action that may have internal or systemwide implications.</li><li>Attend bimonthly and special pre-BOT meetings to identify and track issues and requests raised by BOT Trustees and staff.<br/><br/></li></ul>Other Duties As Assigned<br/><br/><ul><li>Perform other related duties as assigned, required, and deemed appropriate in support of Division goals, priorities, and mission.</li><li>Understand and interpret organizational policies and procedures necessary to ensure appropriate decision-making protocols are followed.</li><li>Travel to the CSU campuses and other agencies/organizations as required for the management and support of Academic and Student Affairs projects.<br/><br/></li></ul>", "qualifications": {"required": "Earned baccalaureate degree from an accredited four-year college or university; or an equivalent combination of education and 10 years related experience.\nA minimum of 7 years of high-level project or program management experience with demonstrated progressive growth in responsibilities.\nA minimum of 5 year of progressively responsible experience working for a high-level executive or administrator in a complex work environment is required.\nExperience working in a higher education environment is required.\nPrior experience providing support to a high-level executive that involved overseeing commitments and ensuring priorities were met and logistics were efficiently addressed in an intense, dynamic environment.\nDemonstrated understanding of universities that are part of a large state system.\nStrong project management experience to include developing or managing projects and initiatives.\nExcellent organizational skills and demonstrated ability to plan, organize, coordinate and direct multiple projects and activities with competing deadlines, and to set and manage timelines and priorities.\nAbility to set and manage timelines and priorities; utilize sound judgment, and ensure the utmost discretion and confidentiality in all matters.\nExcel in working across multiple departments/divisions.\nStrong problem-solving and conflict resolution skills, including the ability to manage complex assignments and/or those that require balancing interests that may be at variance with each other.\nStrong administrative and analytical skills, including the ability to research, evaluate, analyze, and strong attention to detail.\nStrong written and oral communication skills and the ability to interpret and communicate policies and procedures and prepare important correspondence and other documents.\nExcellent interpersonal skills with ability to work collaboratively with diverse internal and external constituents.\nKnowledge of current computer platforms and software applications to include Microsoft Word, Excel, PowerPoint, Outlook and multimedia.<br/><br/>", "preferred": "Graduate degree from an accredited university is highly preferred.\nExperience working in academic affairs and student affairs is highly preferred.<br/><br/>"}, "postedDate": "3 weeks ago", "remoteWork": "Yes", "skills": ["Project Management", "Policy Development", "Strategic Planning", "Communication", "Leadership", "Higher Education", "Research", "Analysis", "Problem Solving", "Conflict Resolution", "Microsoft Word", "Excel", "PowerPoint", "Outlook", "Multimedia"], "url": "https://www.linkedin.com/jobs/view/3989326498"}