{"jobTitle": "Social Media Manager - Sports", "company": {"name": "Solomon Page", "industry": "Entertainment Providers, Spectator Sports, and Sports Teams and Clubs", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Marketing and Strategy/Planning", "industry": "Entertainment Providers, Spectator Sports, and Sports Teams and Clubs", "description": "Our client, a large entertainment company in Culver City, is looking for a Social Media Manager with a strong background in sports for a long-term hybrid contract that requires 3-days/week onsite. In this role, you will oversee, contribute to, and execute social editorial and promotional calendars for sporting events and original sports content. You will be responsible for advising social leadership on go-to-market planning for upcoming campaigns and pitching, developing, and planning social creative strategies to drive engagement before, during, and after live events.", "responsibilities": "Develop and execute comprehensive social media strategies for sporting events and sports original content. Oversee the creation and management of social editorial and promotional calendars. Advise social leadership on go-to-market planning for upcoming campaigns. Pitch, develop, and plan social creative that drives engagement before, during, and after live events. Monitor and analyze social media metrics to optimize performance and inform future strategies. Collaborate with cross-functional teams to ensure cohesive messaging across all social platforms. Stay updated on the latest social media trends, tools, and best practices in the sports industry. Engage with the online community and respond to inquiries in a timely manner. Manage social media advertising campaigns to enhance reach and engagement.", "qualifications": {"required": "Minimum of 4 years of experience in social media management, with a focus on sports. Proven track record of developing and executing successful social media campaigns. Strong understanding of social media platforms, algorithms, and best practices. Excellent writing, editing, and communication skills. Ability to work well under pressure and manage multiple projects simultaneously. Creative mindset with a passion for sports and storytelling. Proficiency in social media analytics tools and the ability to interpret data to drive decisions. Experience with social media advertising and paid promotions. Ability to work flexible hours, including evenings and weekends, to cover live sporting events.", "preferred": "Not specified"}, "skills": ["Social Media Management", "Content Creation", "Marketing Strategy", "Analytics", "Communication", "Project Management"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "Hybrid (3 days onsite)", "url": "https://www.linkedin.com/jobs/view/3989702179"}