{"jobTitle": "Apparel Production Assistant", "company": {"name": "Karen Kane", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We’re looking for a Production Assistant to support the planning and production of all women's apparel products that we manufacture. We take pride in the quality of our clothing and want to find an individual who will ensure that we meet the high standards we set for ourselves. This is a full-time 40 hour a week position including full benefits, paid sick time, with the potential for paid time off and an array of additional employee benefits: merchandise discounts, monthly educational wellness/health seminars, discounted gym and at-home fitness memberships, and other perks. This position is based in Los Angeles, CA.\n\nThe ideal candidate for this job is engaging, focused on finding solutions, and a great problem-solver.\n\n**<u>Job Responsibilities Include:</u>**\n<ul><li>Organize and process seasonal information to vendors and management through the production process.</li><li>Assist with import tech packs and coordinating with overseas vendors.</li><li>Help issue domestic production cuts.</li><li>Issue production paperwork - purchase orders, cut tickets, etc.</li><li>Help maintain and update fabric library and inventory.</li><li>Maintain &amp; update quality assurance information for garments and fabric.</li><li>Assist Production team – and help update if needed.</li><li>Measure and inspect garments for quality; cross-reference with standards.</li><li>Handle send-outs - communicate regularly with vendors and follow-up as needed for information on prodution &amp; fit samples. Send-outs include, but not limited to elastic shirring, eyelets, tie dye, garment dye &amp; wash, welt pockets.</li><li>Adhere to production calendar and assist department in achieving all deadline goals.</li></ul>\n\n**<u>Candidate Requirements:</u>**\n<ul><li>Strong time-management from organization, multi-tasking, and prioritization skills.</li><li>Minimum 2 years in women’s apparel</li><li>Proficient in Excel, Word, email</li><li>Knowledge &amp; experience in POM, measuring garments, import tech packs</li><li>Experience with send-outs, duplicates</li><li>Ability to complete document filing and other clerical duties</li><li>Excellent organizational &amp; communication skills</li></ul>\n\nBenefits:\n<ul><li>401k plan with partial company match.</li><li>Comprehensive healthcare, dental, and vision plan.</li><li>Clothing discount.</li><li>Voluntary life insurance, as well as short-term and long-term disability policies.</li><li>Voluntary free annual biometric health test.</li><li>Early access to company sample sales.</li><li>Company-sponsored Wellness program.</li><li>Access to free monthly health &amp; mindfulness webinars.</li><li>Seasonal monetary awards for participation in company Fitness Challenges.</li><li>Partial healthcare-subsidized fitness membership to 10,000 gym locations across the country.</li><li>Company-subsidized discounts to theme parks &amp; local attractions, including Disneyland, Knotts Berry Farm, Universal Studios, Legoland, Six Flags, Sea World, and Southern California sports teams; discounts to brands including Vitamix, Sonos, and others.</li></ul>", "jobFunction": "Production, Manufacturing, and Administrative", "industry": "Retail Apparel and Fashion, Wholesale, and Wholesale Apparel and Sewing Supplies", "postedDate": "3 weeks ago", "qualifications": {"required": "Strong time-management from organization, multi-tasking, and prioritization skills. Minimum 2 years in women’s apparel Proficient in Excel, Word, email Knowledge &amp; experience in POM, measuring garments, import tech packs Experience with send-outs, duplicates Ability to complete document filing and other clerical duties Excellent organizational &amp; communication skills", "preferred": ""}, "skills": ["Excel", "Word", "email", "POM", "measuring garments", "import tech packs", "send-outs", "duplicates", "document filing", "clerical duties", "organizational skills", "communication skills"], "benefits": "401k plan with partial company match. Comprehensive healthcare, dental, and vision plan. Clothing discount. Voluntary life insurance, as well as short-term and long-term disability policies. Voluntary free annual biometric health test. Early access to company sample sales. Company-sponsored Wellness program. Access to free monthly health &amp; mindfulness webinars. Seasonal monetary awards for participation in company Fitness Challenges. Partial healthcare-subsidized fitness membership to 10,000 gym locations across the country. Company-subsidized discounts to theme parks &amp; local attractions, including Disneyland, Knotts Berry Farm, Universal Studios, Legoland, Six Flags, Sea World, and Southern California sports teams; discounts to brands including Vitamix, Sonos, and others.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989724395"}