{"jobTitle": "Data Analytics Manager", "company": {"name": "Veo", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "145,000 - 160,000 + Annual Performance Bonus + Equity (Stock Options) + Full Range of Benefits", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "At Veo, we are on a mission to end car dependency by making clean transportation accessible to all and advancing the next generation of fully electric micro-mobility systems. Our fleets are constantly evolving and feature a range of vehicles - from pedal and electric bicycles, to standing and seated e-scooters, e-cargo bikes, and ADA accessible devices. We design and build our own vehicles, hardware, and software systems in house and run all our local operations to provide safe, efficient, and responsive mobility services that make communities more sustainable and livable. We are looking for exceptionally talented individuals who are ready to develop and implement new solutions to these exciting challenges. We are headquartered in Santa Monica, CA, but are hiring across the U.S. Join us!<br/><br/>VeoRide is at the forefront of transforming urban mobility through innovative solutions. Our mission is to make transportation smarter, safer, and more accessible to everyone. We are looking for a Data Analytics Manager to lead our data-driven strategy and harness the power of data to propel us into the future of urban mobility. <br/><br/>As the Data Analytics Manager, you will be responsible for leading the data analytics team, developing and executing data strategies that support VeoRide's business goals. You will play a crucial role in decision-making processes, optimizing operations, and enhancing customer satisfaction through insights derived from data. This role is a hybrid role and you will be required to go into the office 3 days a week.<br/><br/>Responsibilities: <br/><br/><ul><li>Lead and develop a team of data analysts and scientists to support business objectives.</li><li>Oversee the collection, analysis, and interpretation of data to drive strategic decisions.</li><li>Develop and maintain robust reporting functions using Looker, ensuring that the team supports and optimizes Looker for comprehensive reporting and analytics across the company.</li><li>Responsible for the development, maintenance, and optimization of DBT pipelines to ensure efficient and reliable data transformation and loading processes, supporting data analytics and reporting.</li><li>Develop and monitor key performance indicators (KPIs) to measure effectiveness and identify areas for improvement.</li><li>Collaborate with various departments to understand data needs and provide actionable insights through advanced reporting and analytics.</li><li>Stay abreast of industry trends and advancements in data analytics and technology.</li><li>Ensure data privacy and compliance with relevant regulations.</li><li>Responsible for data reporting to send to selective cities of operation<br/><br/></li></ul>Competencies<br/><br/><ul><li>Bachelor's or Master's degree in Data Science, Computer Science, Statistics, Mathematics, or a related field.</li><li>Minimum of 6 years of experience in data analytics, with at least 2 years in a leadership role.</li><li>Proficiency in data analytics tools and software (e.g., SQL, Looker, Python, R, Tableau, Power BI).</li><li>Strong understanding of predictive modeling and statistical analysis.</li><li>Excellent leadership and team management skills.</li><li>Proven ability to translate data insights into actionable business strategies.</li><li>Exceptional communication and interpersonal skills, with the ability to explain complex concepts to non-technical stakeholders.<br/><br/></li></ul>Compensation:<br/><br/>The base salary range for this full-time position is $145,000 - $160,000 + Annual Performance Bonus + Equity (Stock Options) + Full Range of Benefits. Veo is a total compensation company, and pay is determined by geographic cost of labor and additional factors, including job-related skills, experience, and relevant education or training - so not all candidates will be eligible for the upper end of the salary range. Our total compensation package for this role, including bonus potential, ranges from $150,000 to $170,000 per year. While this is our expected range, bonuses for this role are designed to have unlimited upside potential, so additional earning opportunities may be available.<br/><br/>Note: Veo benefit, bonus and stock programs may be subject to eligibility requirements and other terms of the applicable plan or program. The listed range is a good faith estimate, and exact compensation and total package may vary depending on market conditions and performance.<br/><br/>Below is the expected salary range for this position. The listed range is a good faith estimate, and exact compensation and total package may vary depending on market conditions and candidate qualifications.<br/><br/>Pay Range<br/><br/>$140,000—$160,000 USD", "responsibilities": "<ul><li>Lead and develop a team of data analysts and scientists to support business objectives.</li><li>Oversee the collection, analysis, and interpretation of data to drive strategic decisions.</li><li>Develop and maintain robust reporting functions using Looker, ensuring that the team supports and optimizes Looker for comprehensive reporting and analytics across the company.</li><li>Responsible for the development, maintenance, and optimization of DBT pipelines to ensure efficient and reliable data transformation and loading processes, supporting data analytics and reporting.</li><li>Develop and monitor key performance indicators (KPIs) to measure effectiveness and identify areas for improvement.</li><li>Collaborate with various departments to understand data needs and provide actionable insights through advanced reporting and analytics.</li><li>Stay abreast of industry trends and advancements in data analytics and technology.</li><li>Ensure data privacy and compliance with relevant regulations.</li><li>Responsible for data reporting to send to selective cities of operation<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's or Master's degree in Data Science, Computer Science, Statistics, Mathematics, or a related field.\nMinimum of 6 years of experience in data analytics, with at least 2 years in a leadership role.\nProficiency in data analytics tools and software (e.g., SQL, Looker, Python, R, Tableau, Power BI).\nStrong understanding of predictive modeling and statistical analysis.\nExcellent leadership and team management skills.\nProven ability to translate data insights into actionable business strategies.\nExceptional communication and interpersonal skills, with the ability to explain complex concepts to non-technical stakeholders.", "preferred": ""}, "skills": ["SQL", "Looker", "Python", "R", "Tableau", "Power BI", "predictive modeling", "statistical analysis", "leadership", "team management", "communication", "interpersonal skills"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Annual Performance Bonus + Equity (Stock Options) + Full Range of Benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989299524"}