{"jobTitle": "Production Associate, The Ford", "company": {"name": "Los Angeles Philharmonic", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "26.00/hr - 29.00/hr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Musicians", "description": "<strong>Job Description<br/><br/></strong><strong>Position: </strong>Production Associate (Part Time), The Ford<br/><br/><strong>Department: </strong>Production<br/><br/><strong>Salary Grade: </strong>Non-Exempt<br/><br/><strong>Salary Range:</strong> $26-$29<br/><br/><strong>Position Summary<br/><br/></strong>Work with the Production Team to manage backstage operations for all concert presentations at The Ford.<br/><br/><strong>Job Requirements<br/><br/></strong><strong>Production Elements:<br/><br/></strong><ul><li>Assist the Production team in disseminating any information, production needs, or instructions to the Crew as needed before and during performances.</li><li>Compile, input and distribute show schedules and daily information for stage crew.</li><li>Coordinate and distribute information for production and artistic staff as needed, including day-of show schedules, set lists, etc.</li><li>Coordinate and distribute Crew parking memos and passes as well as visiting vendors and guests.</li><li>Distribute backstage credentials to crew, visiting vendors, plus other departments as requested.</li><li>Create and distribute timing sheets for concerts. During concerts, keep timings, finalize and distribute to necessary departments after the performance.</li><li>When the Media Initiatives Staff are not working a performance - Coordinate visiting Photographers with Promoter and provide instruction on appropriate photo locations.</li><li>Complete and archive Photo and Video Documentation Waiver paperwork, and credentialing.</li><li>Liaise with Operations Staff and oversee the fulfillment of show-specific needs per department.</li><li>Manage and order Crew, Stage and Backstage Supplies as needed.</li><li>Maintain and notify proper departments for fixes and updates regarding facilities</li><li>Work with Security Team (CSC) to coordinate any specific artist requests, day-of show needs, and advise on where best to locate their staff.</li><li>Open Backstage and Stage Work Areas each day for Crew and Production to begin work. Close and lock after all work is done and visiting artists have left.</li><li>Notify Housekeeping staff of all cleaning needs from stage and Production departments whether in dressing rooms or shared spaces.</li><li>Order and maintain coffee supply inventory throughout season working with vendor to keep supplies stocked.</li><li>Order and maintain towel inventory throughout season. Work with laundry vendor to send out in a timely manner.</li><li>Order and coordinate crew meals; Distribute Meal Tickets as needed.</li><li>For Production Meetings, coordinate table/chair set-ups with crew; attend production meetings, take production notes &amp; distribute.</li><li>Alert Operations when EMT or ambulance needed. Provide First Aid as necessary, complete and submit injury reports as needed.</li><li>Assist Production Administrator and Associate with all other duties as required.<br/><br/></li></ul><strong>Relationships<br/><br/></strong>Reports To: Technical Director<br/><br/><strong>Interacts With<br/><br/></strong>Production<br/><br/>Orchestra Management<br/><br/>Programming<br/><br/>Stage Crew<br/><br/>Public Relations<br/><br/>Ford Operations<br/><br/>Learning Department<br/><br/>Visiting Artists &amp; Artist Production<br/><br/>The Los Angeles Philharmonic Association will consider for employment qualified Applicants with Criminal Histories in a manner consistent with the requirements of the FCIHO.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY POLICY<br/><br/></strong>It is the Los Angeles Philharmonic Association’s policy to provide equal employment opportunity for all applicants and employees. The Association does not discriminate on the basis of race, color, religion, religious creed (including religious dress and religious grooming), sex (including pregnancy, perceived pregnancy, childbirth, breastfeeding, or related medical conditions), sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition or information, genetic information, marital status, gender, gender identity, gender expression, military status, veteran status, or any other basis protected by federal, state, or local law. Consistent with the law, the Association also provides reasonable accommodation for disabled applicants and employees in accordance with the Americans with Disabilities Act (ADA) and the California Fair Employment and Housing Act, for pregnant employees who request an accommodation with the advice of their health care providers, for pregnancy, childbirth or related medical conditions; for employees who are victims of domestic violence, sexual assault or stalking; and for applicants and employees based on their religious beliefs and practices.", "responsibilities": "Work with the Production Team to manage backstage operations for all concert presentations at The Ford.", "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989840774"}