{"jobTitle": "RETAIL DISTRICT MANAGER UNASSIGNED CALIFORNIA", "company": {"name": "Dollar General", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "At Dollar General, our mission is Serving Others! We value each and every one of our employees. Whether you are looking to launch a new career in one of our many convenient Store locations, Distribution Centers, Store Support Center or with our Private Fleet Team, we are proud to provide a wide range of career opportunities. We are not just a retail company; we are a company that values the unique strengths and perspectives that each individual brings. Your difference truly makes a difference at Dollar General. How would you like to Serve? Join the Dollar General Journey and see how your career can thrive.<br/><br/><strong>Company Overview<br/><br/></strong>Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations. Learn more about Dollar General at www.dollargeneral.com/about-us.html .<br/><br/><strong> Job Details <br/><br/></strong><strong>General Summary<br/><br/></strong>Plan and lead the activities of all stores within the assigned area of operation, including full profit and loss responsibility, while acting within the scope of company objectives and policies to accomplish divisional and regional goals.<br/><br/><strong>DUTIES And ESSENTIAL JOB FUNCTIONS<br/><br/></strong>Lead store teams by ensuring:<br/><br/><ul><li> A culture that fosters Dollar General’s mission and values. </li><li> Fair administration of human resources policies &amp; practices. </li><li> Superior customer service through fun, friendly stores. </li><li> Area annual sales growth that meets or exceeds company targets through quality orders and efficient flow processes. </li><li> All tools are effectively utilized in each store and market resulting in superior inventory presentation and management. </li><li> Effective planning &amp; execution of company objectives. </li><li> Maximization of performance &amp; productivity through a commitment to sensible store scheduling. </li><li> Total development of human capital through proactive recruitment, selection and education of employees and customers. </li><li> Protection of company assets through loss prevention and expense efficiencies. </li><li> Identify and develop new business opportunities within operational area (i.e., distribution flow improvements, merchandising display efforts, store growth and real estate site selection, recruiting strategy, training and development priorities, employee Relations, customer service, systems implementation, etc.). </li><li> Consistent and effective communication of divisional and regional priorities to store teams. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> KNOWLEDGE and SKILLS: <br/><br/></strong><ul><li> Demonstrated results-oriented leadership including the ability to model total development and serve as a steward of Dollar General’s mission and values. </li><li> Demonstrated record of achieving performance goals and objectives. </li><li> Financial analysis skills sufficient to interpret operating statements and other financial reporting data, manage budgets, and control inventory. </li><li> Demonstrated ability to produce desired results by leveraging resources, maintaining tough expense control, managing merchandise effectively, and defining and communicating clear expectations. </li><li> Demonstrated ability to manage multiple tasks in a fast-paced environment while demonstrating flexibility and adaptability. </li><li> Demonstrated strong interpersonal and leadership skills including a willingness to consistently provide superior customer service, the ability to react appropriately under pressure, and the ability to apply good judgment in ambiguous situations. </li><li> Demonstrated ability to effectively work in collaboration with team to achieve objectives in a participative management style. <br/><br/></li></ul><strong>WORK EXPERIENCE And/or EDUCATION<br/><br/></strong><ul><li> Four+ years retail management experience with progressively more responsibility, managing multi-unit operations in retail, grocery or convenience store operations with full P&amp;L responsibility. </li><li> Bachelor’s degree preferred. </li><li> “Big-box” retail management and/or equivalent education and experience combination will be considered. <br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li> Drives results by identifying opportunities to improve performance. </li><li> Works efficiently by planning and organizing work to achieve goals and objectives. </li><li> Focuses on customers by anticipating customer need, overcoming obstacles, and continually striving to improve customer satisfaction. </li><li> Applies effective analytical skills by integrating complex information, while balancing tactical and strategic initiatives. </li><li> Provides effective leadership by maintaining an environment that promotes teamwork and maximizes individual potential. </li><li> Communicates effectively by providing clear and timely communication and demonstrating effective listening skills. </li><li> Demonstrates adaptability by adjusting to changing business priorities. <br/><br/></li></ul>Note: This position requires weekly travel in a company-provided vehicle with limited overnight stays; a current driver's license and acceptable driving history is required.<br/><br/><strong> _ <br/><br/></strong>Starting Salary Range $95,000 - $117,000", "responsibilities": "Plan and lead the activities of all stores within the assigned area of operation, including full profit and loss responsibility, while acting within the scope of company objectives and policies to accomplish divisional and regional goals.", "qualifications": {"required": "Demonstrated results-oriented leadership including the ability to model total development and serve as a steward of Dollar General’s mission and values. Demonstrated record of achieving performance goals and objectives. Financial analysis skills sufficient to interpret operating statements and other financial reporting data, manage budgets, and control inventory. Demonstrated ability to produce desired results by leveraging resources, maintaining tough expense control, managing merchandise effectively, and defining and communicating clear expectations. Demonstrated ability to manage multiple tasks in a fast-paced environment while demonstrating flexibility and adaptability. Demonstrated strong interpersonal and leadership skills including a willingness to consistently provide superior customer service, the ability to react appropriately under pressure, and the ability to apply good judgment in ambiguous situations. Demonstrated ability to effectively work in collaboration with team to achieve objectives in a participative management style.", "preferred": "Four+ years retail management experience with progressively more responsibility, managing multi-unit operations in retail, grocery or convenience store operations with full P&amp;L responsibility. Bachelor’s degree preferred. “Big-box” retail management and/or equivalent education and experience combination will be considered."}, "skills": ["Leadership", "Financial Analysis", "Customer Service", "Teamwork", "Communication"], "postedDate": "3 weeks ago", "benefits": null, "remoteWork": null, "salary": {"amount": "$95,000 - $117,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3989732387"}