{"jobTitle": "Operations Associate", "company": {"name": "KITH", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.00-$18.00/hr + Commission(s)", "currency": "USD"}, "jobFunction": "Customer Service and General Business", "industry": "Retail, Retail Luxury Goods and Jewelry, and Retail Apparel and Fashion", "description": "ABOUT THE ROLE\nLocation: Rodeo Drive Store\nStatus: Part-Time\nCompensation: $17.00-$18.00/hr + Commission(s)\n\nPosition Summary: The Kith Operations Associate is responsible for the flow of merchandise from the central point of delivery to the retail sales floor. The Stock associate works on a team lead by the Operations Management team. They are a part of the backbone that keeps the retail store operating at an operationally efficient and effective capacity. They are the gatekeepers of the back house, product organization and upkeep.\n\nRESPONSIBILITIES\nPrimary Responsibilities:\nPartner with Store Leadership to execute tasks that streamline the product cycle.\nFollow Standard Operating Procedures to ensure product is readily available for clients.\nEnsure assigned tasks are completed in an efficient and accurate manner.\nProvide a friendly and welcoming environment to both our external and internal clients.\nConsistently work with sales-floor team to ensure customers are receiving product in a timely manner.\nAssist in Operations Management in maintaining a clean and safe workspace.\nExecuting any necessary assigned tasks before or after regular store operating hours.\nEnsure adherence to all company policy and procedures.\nPromote and maintain an environment that is sharply focused on consistently delivering exceptional, positive, in-store customer service.\nDisplay expert product knowledge of product, company history, company policies and store/company strategies\n\nSpecial Projects:\nParticipate and assist in Physical Inventories as required by the business.\nAssist Merchandising team during visual initiatives as required by the business.\n\nREQUIREMENTS\nExperience:\n1-2 years working in a retail operations position\n1+ years in a retail/apparel environment is a plus\n\nSkills:\nBasic computer skills\nAbility to meet the physical requirements of the job\nStanding/Walking for prolonged periods of time\nLifting or moving up to 30 pounds\nBending, twisting as well as climbing of ladders and other physical tasks related to standard retail operations\nEfficient time management skills\nAbility to multi-task and manage multiple projects at once\nEfficient communication with customers, peers, or Direct-Reports\n\nWHO YOU ARE\nProfessional Characteristics:\nTeam-Player\nSupportive\nSelf-starter\nGoal oriented\n\nPersonal Characteristics:\nOrganized\nCommunicative\nReliable & trustworthy\n\nWHO WE ARE\nEstablished in 2011, Kith is a leading lifestyle brand and progressive retail concept that’s celebrated globally for its ability to tell stories, evoke nostalgia, and connect product to the passion it’s woven with. Now in its eleventh year of business, Kith has in-house apparel lines for men, women and children, an ice cream parlor in every flagship, a full-service restaurant, and a retail footprint in three continents.\n\nBorn and raised in Queens, New York, Kith Founder Ronnie Fieg rose the ranks from 13-year-old stock boy at footwear franchise David Z. to the company’s chief buyer, earning him a profound understanding of the retail landscape and a network of powerful brand relationships. As the brand’s CEO and Creative Director, Fieg is known for his ability to create premium products and deliver unparalleled experiences, with a personal philosophy of giving the consumer more than what they pay for. Using Kith as a vehicle, Fieg has applied his signature lens to an impressive list of collaborators, including Coca-Cola, Nike, Versace, BMW, and many others.\n\nKith is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.", "responsibilities": "Partner with Store Leadership to execute tasks that streamline the product cycle.\nFollow Standard Operating Procedures to ensure product is readily available for clients.\nEnsure assigned tasks are completed in an efficient and accurate manner.\nProvide a friendly and welcoming environment to both our external and internal clients.\nConsistently work with sales-floor team to ensure customers are receiving product in a timely manner.\nAssist in Operations Management in maintaining a clean and safe workspace.\nExecuting any necessary assigned tasks before or after regular store operating hours.\nEnsure adherence to all company policy and procedures.\nPromote and maintain an environment that is sharply focused on consistently delivering exceptional, positive, in-store customer service.\nDisplay expert product knowledge of product, company history, company policies and store/company strategies\n\nParticipate and assist in Physical Inventories as required by the business.\nAssist Merchandising team during visual initiatives as required by the business.", "qualifications": {"required": "1-2 years working in a retail operations position\n1+ years in a retail/apparel environment is a plus\nBasic computer skills\nAbility to meet the physical requirements of the job\nStanding/Walking for prolonged periods of time\nLifting or moving up to 30 pounds\nBending, twisting as well as climbing of ladders and other physical tasks related to standard retail operations\nEfficient time management skills\nAbility to multi-task and manage multiple projects at once\nEfficient communication with customers, peers, or Direct-Reports"}, "skills": ["Retail Operations", "Customer Service", "Product Knowledge", "Time Management", "Multitasking", "Communication"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989725596"}