{"jobTitle": "HR Payroll Coordinator", "company": {"name": "Colburn School", "location": "Los Angeles Metropolitan Area", "industry": "Performing Arts, Non-profit Organizations, and Higher Education"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26.00/hr - 29.00/hr", "currency": "USD"}, "jobFunction": "Human Resources and Administrative", "industry": "Performing Arts, Non-profit Organizations, and Higher Education", "description": "<strong>Position Summary: </strong>The HR Payroll Coordinator role is a great opportunity to be exposed to every area of both the HR and Payroll functions and is a great training ground to become a well-rounded HR Generalist or Payroll Administrator. This role will support the members of the HR and Payroll team in a wide variety of activities including new hire onboarding, maintenance of employee files and records, job postings, administration of benefits and leave of absence, new hire and termination processes, personnel data entry and management, in addition to being cross trained on the entire payroll process for both Staff and Faculty payroll in order to serve as a backup for payroll when needed.", "responsibilities": "<strong>Duties and Responsibilities:</strong><br/><strong>1) Assist the Sr. HR Generalist in the following areas:</strong><br/><u>New Hire Process</u><br/>-Assisting hiring managers with completion of New Employee Requisition Forms and job descriptions.<br/>-Obtaining the required approvals and signatures.<br/>-Posting job openings on Colburn careers page and various job boards.<br/>-Drafting offer letters.<br/>-Setting up background checks and fingerprinting.<br/>-Entering new hire data into HRIS system (UKG).<br/>-Employee Onboarding.<br/>-Setting up required online training sessions for each new hire.<br/>-Arranging for equipment, network access, ID badge, etc.<br/><br/><u>Benefits </u><br/>-Assist new hires with benefits enrollment process.<br/>-Add new enrollee information on each vender portal.<br/>-Assist with annual open enrollment activities and responding to employee benefit questions.<br/><br/><u>Status Changes (promotions, pay increase, title changes, department changes)</u><br/>-Assisting Supervisors with the completion of Status Change Request Forms.<br/>-Obtaining approvals and signatures.<br/>-Preparing Status Change Memos for employee signature.<br/>-Processing the changes in UKG.<br/><br/><u>Leave of Absence</u><br/>-Assist with leaves of absence administration in compliance with federal and state regulations and Colburn policies.<br/>-Maintain communication with employees on leave.<br/>-Work with supervisors to coordinate employees return to work as scheduled.<br/><br/><u>Termination Process </u><br/>-Notify payroll for final paycheck.<br/>-Collect resignation letters.<br/>-Set up exit interviews.<br/>-Process all termination tasks in the Termination Checklist.<br/>-Provide termination paperwork and unemployment information to employee.<br/>-Process termination in UKG.<br/>-Terminate benefits online and notify COBRA administrator.<br/><br/><u>Faculty contracts </u><br/>-Completing contract templates and annual renewal letters.<br/>-Obtaining signatures through DocuSign.<br/>-Ensure signed contracts are properly saved and labeled.<br/><br/><u>Invoice Processing through Accounts Payable </u><br/>-Audit monthly benefits billing to match new enrollees and terminations.<br/>-Process vendor bills for payment.<br/>-Assist with processing expense reimbursements for VP of HR.<br/><br/><u>Employee Support</u><br/>-Respond to employee calls, emails, and in person inquiries where possible.<br/>-Connect employee to appropriate team member for resolution and follow up to ensure issue is fully resolved.<br/><br/><u>Personnel Files</u><br/>-Maintenance of confidential personnel files in accordance with established guidelines and policies.<br/>-Set up files for new employees.<br/>-Ensures proper handling, maintenance, or storage of files of terminated employees.<br/>-Ensures that employee and applicant records are legally and procedurally correct in regard to data required and record retention.<br/>-Scanning of hard copies to ensure a complete electronic personnel file is maintained.<br/><br/><u>General</u><br/>-Monitors and tracks workers compensation and disability matters as needed.<br/>-Participate in organization-wide initiatives focused on wellness, training, health and safety, culture, and communications.<br/>-Participate in planning and organizing events for employees.<br/>-Assist with report preparation.<br/>-Perform other related duties as assigned.<br/><br/><strong>2) Support Payroll Manager with “Staff” Payroll Process:</strong><br/><br/><u>Serve as Payroll Process “back up</u>” for Staff Payroll:<br/>-Learn the Staff payroll process to serve as a backup for the Payroll Manager (learn the full payroll process from beginning to end).<br/><br/><u>Staff Payroll Process Tasks</u>:<br/><br/>Audit for each payroll:<br/>-Hourly Rates (for new hires and status changes)<br/>-Timesheets – Confirm correct Hour/OT/DT/and Union rates calculations<br/><br/>Audit for New Hires or Status Changes:<br/>-Deductions – Confirm correct/new deductions if applicable.<br/>-Earnings – Confirm monthly payments (Tech stipend, Moving Reimbursement, etc.)<br/><br/>Honoraria – Confirm the work performed, pay rate, and total hours.<br/>-Faculty – primarily.<br/>-Staff – as needed by Payroll Manager<br/><br/>Respond to/follow up on emails and questions from Supervisors and Employees regarding the current payroll in process.<br/><br/>Pay Adjustments/Retro Pay Calculations for:<br/>-New Hires starting mid pay period<br/>-Rate changes starting mid pay period, or an effective date that is retroactive.<br/>-Terminations/resignations – final paycheck calculations<br/>-Create Overpayment calculation, schedules, and agreement if needed.<br/><br/><strong>Cross-train as back up for HRIS Manager on the “Faculty” Payroll Process and other payroll areas and may eventually take over some of these tasks when ready. </strong> <br/><br/><u>Faculty Payroll Process:</u><br/>-Cross train on process beginning to end<br/>-Audit Faculty Salaries on a monthly basis<br/>-Audit Hourly Rates - (with Payroll Manager)<br/>-Update and Maintain Faculty Pay workbook<br/>-New Hires/Terms updated monthly<br/>-Meet with each unit’s Admin to confirm faculty work hours reported.<br/><br/><u>Staff Payroll Process:</u><br/>-Off cycle payrolls if needed (beginning to end)<br/><br/><u>Benefits:</u><br/>-Confirming correct payroll codes and amounts<br/>-Benefits Audit – quarterly (payroll vs invoice amounts)", "qualifications": {"required": "Experience:\n-2-3 years of experience working in a Human Resources Department\n-Will consider candidates with only one full year in a Human Resources Department if they also have a bachelor’s degree in human resources management, or any bachelor’s degree in addition to an HR Certificate such as PHR or SHRM-CP.\n\nEducation:\n-Bachelor’s degree in human resources management is preferred; or\n-Business Degree with an HR concentration.\n-For degrees outside of HR, preferably also have an HR certificate: PHR or SHRM-CP.\n\nSkills and Abilities:\n-Strong computer skills and intermediate to advanced skill level in Word, Excel, Outlook, and PowerPoint.\n-Experience using and knowledge of HRIS and Payroll systems (UKG preferred)\n-Excellent writing skills and verbal communication skills.\n-Strong problem-solving skills.\n-Excellent interpersonal skills.\n-Ability to maintain absolute confidentiality regarding employee information.\n-Demonstrated attention to detail and excellent analytical skills.\n-Demonstrated ability to work with diverse employee groups and departments.\n-Knowledge of and interest in the arts: orchestra, bands, piano, ballet.\n-Knowledge of and interest in educational environments, colleges, youth services organizations, and after school arts programs.", "preferred": ""}, "skills": ["UKG", "HRIS", "Payroll", "Word", "Excel", "Outlook", "PowerPoint", "Communication", "Problem Solving", "Interpersonal Skills", "Confidentiality", "Attention to Detail", "Analytical Skills", "Diversity", "Arts", "Education"], "postedDate": "3 weeks ago", "benefits": "The Colburn School offers excellent benefits including: medical, dental and vision insurance plans; Long Term Disability, Short Term Disability and Life Insurance plans; paid sick leave and vacation; a 403(b)-retirement plan with a generous employer matching contribution.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989296867"}