{"jobTitle": "Care Coordinator", "company": {"name": "Prospect Medical Systems", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "industry": "Hospitals and Health Care, Medical Practices, and Mental Health Care", "description": "We are hospitals and affiliated medical groups, working closely together for the benefit of every person who comes to us for care. We build comprehensive networks of quality healthcare services that are designed to offer our patients highly coordinated, personalized care and help them live healthier lives. Through collaboration, we strive to provide all of our patients and medical group members with the quality, affordable healthcare they need and deserve. New Genesis Medical Associates, Inc (NGMA)- Residential Care Program is a home-based patient care program that provides health care services in the comfort and convenience of the patient's home. It's like an old-fashioned house-call for patients who are eligible to join. The program provides medical care, social support, and help with nutrition and medications. Responsible for managing and coordinating high quality, evidenced based care to complex and high-risk patients with the primary goal and objectives of providing best-in-class patient care, reducing avoidable hospitalizations, and decreasing unnecessary emergency department utilization. The Care Coordinator I is responsible for timely processing, managing, and coordinating care of high-risk patient panel cases including but not limited to, facilitation of appointments with Field Physicians and Advanced Practice Providers (Physician Assistant and Nurse Practitioner), Specialist, and transportation if needed, gathering of pertinent medical records, validation of eligibility, requesting authorizations, and others.Comply with all HIPAA regulations and maintain security of protected health information (PHI).<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Conducts telephonic outreach to members to discuss and offer Residential Care Programs.</li><li> Requests and gathers necessary medical records as needed.</li><li> Validates patient eligibility, benefits, and medical group affiliation.</li><li> Add new patient demographics to EMR Practice Management System and schedule appointments.</li><li> Collaborates with the health plan, PCP, and health care team to ensure timely communication of member's clinical information.</li><li> Communicate by phone, in-person, in-writing, and/or electronically with the NGMA-RCP team, Prospect teams, PCPs, Specialists, patients and/or caregivers in order to provide comprehensive patient care.</li><li> Generates letters and faxes to PCPs, Specialists, patients, and other health care team members.</li><li> Fax or upload provider notes to PCPs, Specialists, Case Management platform, and other health care team members.</li><li> Facilitates warm transfers to patient's assigned case manager in accordance with patient’s needs, when appropriate.</li><li> Maintain turn-around-time compliance with all referrals.</li><li> Oversee patent panel based on provider assignment.</li><li> Coordinate care for patients as appropriate such as scheduling appointments, creating authorizations to facilitate/expedite patient’s requests based on provider’s orders.</li><li> Facilitates completion of quality measures through education and coordination and scheduling of AWVs.</li><li> Timely processing of incoming referrals to RCP programs per set timeframes.</li><li> Completes post-discharge calls and appointments for patients per set timeframe.</li><li> Schedule and coordinate case reviews meetings with providers, case management teams, PCPs and others as needed.</li><li> Facilitates warm transfers to patient's assigned case manager in accordance with patient’s needs, when appropriate.</li><li> Compile clinical documentation as required per health plan and/or requested as needed by other members of the health care team.</li><li> Participate in patient education regarding urgent care, hospice, flu vaccinations and other issues related to Chronic Care management.</li><li> Maintains compliance with established departmental productivity<br/><br/></li></ul>guidelines.<br/><br/><ul><li> Maintain internal department trackers and reports.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Knowledge of HIPAA regulations preferred</li><li>Excellent written and verbal communication skills (60 WPM)</li><li>Exceptional customer service and conflict resolution skills</li><li>Must be able to work independently.</li><li>Must be proficient in Microsoft Office navigation, Excel, Outlook, Teams, and Word and/or IDX knowledge. </li><li>A high degree of organizational skills, ability to set priorities, manage multiple demands and the ability to complete tasks under strict timelines is required.</li><li>Ability to establish therapeutic relationships with patients and families. </li><li>Effective written and verbal communication skills. </li><li>Demonstrated ability to be self-directed and motivated<br/><br/></li></ul>Required Education/Experience<br/><br/><ul><li> High School diploma required. </li><li> At least 2-3 years of health care management/administration experience in customer service, call center, scheduling and patient care coordination required. </li><li>Prior experience with managed care organizations. </li><li>Electronic Medical Records experience<br/><br/></li></ul>Preferred Education/Experience<br/><br/><ul><li>Bilingual Spanish preferred. </li><li>Associate degree or higher preferred.</li><li>Medical Assistant Certification preferred.</li><li>Medical Terminology certificate.<br/><br/></li></ul><strong>About Us<br/><br/></strong>With approximately 9,000 physicians to serve our 260,000 members, Prospect Medical Systems is proud to be among the most innovative medical systems in California, Texas and Rhode Island. Our extensive care services range from primary care and specialty physician services to acute care hospital and skilled nursing facilities to behavioral health and wellness services. Each of our Independent Physician Associations (IPAs) and networks support the use of advanced diagnostic and treatment tools to provide our members with convenient access to state-of-the-art healthcare. For 25+ years, Prospect Medical has been focused on our mission of supporting independent physicians where, through risk arrangements, we work closely together with health plans, facilities and healthcare physicians for the benefit of every person who comes to us for care. We provide quality healthcare services that are designed to offer our patients highly coordinated, personalized care and that help them live healthier lives. Prospect Medical Systems manages highly successful IPAs by leveraging our best-practices, results-driven administrative services to manage patients under risk arrangements with health plans/CMS.", "jobFunction": "Other", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3989259554"}