{"jobTitle": "Production Supervisor - 2nd Shift", "company": {"name": "The Lubrizol Corporation", "industry": "Chemical Manufacturing and Research Services", "location": "Corona, CA"}, "location": "Corona, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Chemical Manufacturing and Research Services", "description": "<strong>Job Title: </strong>Production Supervisor - 2nd Shift (1:00 PM - 10:00 PM)<br/><br/><strong>Job Location: </strong>Corona, California<br/><br/><strong>Job Type:</strong> Full-Time<br/><br/><strong>Type of Role:</strong> On-site<br/><br/><strong>Salary Range:</strong> $90,000.00 - $100,000.00<br/><br/><strong>About Lubrizol<br/><br/></strong><em>The Lubrizol Corporation, a Berkshire Hathaway company, is a specialty chemical company whose science delivers sustainable solutions to advance mobility, improve wellbeing and enhance modern life. Founded in 1928, Lubrizol owns and operates more than 100 manufacturing facilities, sales, and technical offices around the world and has about 8,000 employees. For more information, visit </em><em>www.Lubrizol.com</em><em>. <br/><br/></em><em>We value diversity in professional backgrounds and life experiences. By enabling a consistent, unbiased, and transparent recruitment process, Lubrizol seeks to create a positive experience for candidates so we can get to know them at their best. We recognize unique work and life situations and offer flexibility, ensuring our employees feel engaged and fulfilled in every aspect of life.<br/><br/></em><strong>Join Our Thriving Team at Lubrizol as Production Supervisor - 2nd Shift<br/><br/></strong>Unleash Your Potential. At Lubrizol we're transforming the Medical Device, Pharmaceutical, and Nutraceutical industries. We're looking for exceptional talent to join us on this journey. If you are ready to join an international company with talent around the world, and want to make a real impact, we want you on our team.<br/><br/><strong>What You'll Do<br/><br/></strong>As a Production Supervisor - 2nd Shift, you'll be at the forefront of our innovation of leading the manufacturing of thermoplastic extruded tubing products. The Production Supervisor - 2nd Shift can supervise up to 50 Lubrizol employees through the assistance of departmental lead persons. Production Supervisor - 2nd Shift is responsible for monitoring the daily production of assemblers and/or machine operators. In addition, responsible for adherence to Good Manufacturing Practices (GMPs), Good Documentation Practices (GDPs), and the manufacture of high quality products that conform to individual customer specifications. Monitors employee productivity, quality, efficiencies, teamwork, attendance and attention to detail. Completes timely employee performance reviews, and time and attendance reports. Responsible for effectively communicating with employees to maintain a healthy and positive working environment and union-free workforce. Investigates non-conformances and customer complaints regarding products and recommends permanent manufacturing improvements to correct and prevent recurrences. Production Supervisor - 2nd Shift can include Extrusion, Braiding and Secondary Operations.<br/><br/><strong>What We're Looking For<br/><br/></strong><ul><li>Complete shift oversite including safety and wellbeing of all personnel and facility.</li><li> Manage LEAN method and practice.</li><li>Reinforce LEAN and reporting actions / needs / daily objectives, instill philosophies - i.e., SMED, Value Stream Team Execution, OEE, schedule attainment.</li><li>GDP, GMP compliance when conducting work routines. </li><li>Monitoring / Reporting of employees’ daily manufacturing ensuring production of rate / volume, quality, yield coupled with risk / cost avoidance management of non-conforming product whereby minimization of NCRs with concentration placed on limiting non-value-added work – i.e., re-runs and sorting, excess waste.</li><li>Works closely with Planning / Scheduling department to ensure that customer orders are shipped in a timely manner.</li><li>Managing performance efficiencies and performance of employee workforce through effective communication and timely performance management. </li><li>Work with engineering to diagnose manufacturing problems and recommending corrective and preventive actions where appropriate. </li><li>Reinforce adherence / compliance / training to all SOP’s pertaining to core operations tasks by department.</li><li>Reinforce adherence / compliance / training to all Work Instructions for focused task execution. </li><li>Ensures employee training records are accurate and kept up to date.</li><li>Performs or coordinates training effectiveness verification. </li><li>Works closely with the Operations Manager on maximizing improvement targets and efficiencies product and process work with his or her people.</li><li>When appropriate, reporting of manufacturing inventories and scrap of key goals and objectives.</li><li>Develop Value Stream Department Lead Persons to act as supervisory assistants in running manufacturing.</li><li>Team with Quality Control Department in the disposition of non-conforming product and resolution of quality problems.</li><li>Identify opportunities for Value Improvement Projects (VIP’s) to reduce manufacturing costs with other LEAN members, sponsors, and stakeholders.</li><li>As required, work with product development function and process engineering to ensure smooth transition of R&amp;D product to production.</li><li>Maintains standards for housekeeping, ergonomics, and safety at all times.</li><li>Other duties as assigned. <br/><br/></li></ul><strong>Direct And Indirect Reports<br/><br/></strong><ul><li>Extrusion Machine Operators</li><li>Department Leads</li><li>Braiding Operators</li><li>Secondary Operations Technicians</li><li>Packaging Operators </li><li>Tool Room Attendants</li><li>Quality Technicians<br/><br/></li></ul><strong>Skills That Make a Difference<br/><br/></strong><ul><li>Successful completion of four-years of high school, or equivalent, plus completion of two years of college or graduation from a two-year technical college with an associate’s degree (bachelor’s degree preferred) with a concentration in either manufacturing, operations, engineering or business manufacturing.</li><li>5+ years of experience in manufacturing, or any combination of education and experience that provides equivalent knowledge, skills, and abilities.</li><li>Experience supervising personnel in a medical device manufacturing setting to include distribution of work, scheduling, training, answering of questions related to work, assistance in problem solving, performance management and discipline.</li><li>Experience with deploying LEAN. Lean Manufacturing Green Belt Certification or higher preferred.</li><li>Experience with case studies, statistics and mathematical analysis and conclusion. Understanding and use of Software tools familiarity of use - i.e., product / process analysis equipment (Microsoft, MiniTab, Zumbach, MicroVu, Pivot tables).</li><li>Able to effectively make presentations in both large and small group settings. </li><li>Considered a plus:</li><ul><li>Extrusion experience.</li><li>Injection Molding experience. <br/></li></ul></ul><strong>Other Guidelines<br/><br/></strong><ul><li>Knowledge of advanced statistical concepts </li><li>Able to calculate product cost breakdowns such as: piece per hour, hours per piece, total cost of manufacture, piece part cost, machine and manufacturing cycle times, manufacturing costs by operation, machine, equipment capacity and efficiencies.</li><li>Excellent (written and verbal) communication and effective human interaction skills. </li><li>Flexible to change and possess a high degree level of integrity and “can do attitude”. </li><li>Willing to work in a team environment and contribute to group goals. </li><li>Ability to receive and provide instructions in a positive manner. </li><li>Able to work all shifts as required by management. <br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>The physical demands described here are representatives of those that must be met by an employee to successfully perform the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential function. The phrases “occasionally”, “frequently” and “constantly” correspond to the following definitions: “occasionally” means up to 33% of working time, “frequently” means between 34%-66% of working time, and “constantly” means 67% and more of working time. Additionally vision requirement definitions are as follows: close vision-clear vision at 20 inches or less, distance vision—clear vision at 20 feet or more, color vision-ability to identify and distinguish colors, peripheral vision-ability to observe an area that can be seen up and down or to the left and right while eyes are fixed on a given point, depth perception-three-dimensional vision-ability to judge distances and spatial relationships and ability to focus—ability to adjust the eye to bring an object into sharp focus. </li><li>This physical demand level for this job is considered medium with frequently lifting 10-25 pounds and occasionally lifting up to 50lbs when moving carts of product, moving or lifting bags of raw material and/or product, lifting and moving manufacturing equipment and/or fixtures from floor or shelving to work benches, or moving trays of product in/out of the curing ovens. On occasion employee may be subject to lifting up to 100 lbs. when moving work benches, chairs, tables and other work station components from work station to work station on the manufacturing floor. Exposure to lifting more than 100 pounds is rare (if ever). </li><li>The employee may frequently be subject to use hands to finger or handle/touch with occasional exposure to static standing/sitting, dynamic standing/walking, pushing/pulling, floor to knuckle lift/lower, knuckle to shoulder lift/lower, shoulder to overhead lift/lower, sustained bending, use foot/feet to operate machine, stoop, kneel, crouch or crawl, reach above shoulders or repetitive bending or squatting. The employee will rarely (if ever) be exposed to climbing or balancing.<br/><br/></li></ul><strong>Work Environment<br/><br/></strong><ul><li>The work environment characteristics described here are representative of those an employee may encounter while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities. </li><li>The employee will occasionally be exposed to working near moving mechanical parts, fumes or airborne particles, risk of electrical shock or travel on company business. The employee will rarely (if ever) be subject to wet humid conditions, working in high precarious places, toxic or caustic chemicals, outdoor weather conditions or extreme cold or heat. The noise level is considered moderate when on the production floor and occasionally considered loud if near operating production equipment. </li><li>The employee will be required to wear appropriate Personal Protective Equipment such as: safety glasses in the designated areas, hairnet/beard net, shoe covers and smock when on production floor.<br/><br/></li></ul><strong>Tools, Equipment, Computer Software<br/><br/></strong><ul><li>The employee will occasionally use a PC with Microsoft Office products, extrusion equipment, assembly cutting, punching, pad printing fixtures and other equipment, microscope and magnification light fixtures, inspection equipment time and attendance, inventory control and production reporting software applications. </li><li>The above statements reflect the general details necessary to describe the principle functions of the occupation described and shall not be construed as a detailed description of all the work requirements that may be inherent in the occupation.<br/><br/></li></ul><strong>Perks And Rewards That Inspire<br/><br/></strong><ul><li>Competitive salary with performance-based bonus plans</li><li>401K Match plus Age Weighted Defined Contribution</li><li>Competitive medical, dental &amp; vision offerings</li><li>Health Savings Account</li><li>Paid Holidays, Vacation, Parental Leave</li><li>Flexible work environment</li><li>Learn more at benefits.lubrizol.com<br/><br/></li></ul><strong>Ready for your next career step? Apply today and let's shape the future together! <br/><br/></strong>It’s an exciting time to be part of Lubrizol. Lubrizol is not staying put. We are continually learning and evolving. Our passion delivers our success — not only for Lubrizol but for those who count on us every day: our employees, customers and communities.<br/><br/>We work with a relentless commitment to operate safely and responsibly, keeping safety, sustainability, ethics, and compliance at the forefront of everything we do. The well-being of our employees, customers and communities is paramount to our culture and in the way we approach our work.<br/><br/>As a diverse, global team, we work together to solve some of the world’s most pressing challenges. We impact everyday lives through science only Lubrizol can deliver, and we never stop pushing to do it better.<br/><br/>One of the founding principles of The Lubrizol Corporation more than 90 years ago was treating every employee with dignity and respect. That same commitment is only stronger today.<br/><br/>More than that, we are committed to providing an environment where every employee can be the best they can be, no matter their race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other characteristic.", "responsibilities": "Complete shift oversite including safety and wellbeing of all personnel and facility.\n Manage LEAN method and practice.\nReinforce LEAN and reporting actions / needs / daily objectives, instill philosophies - i.e., SMED, Value Stream Team Execution, OEE, schedule attainment.\nGDP, GMP compliance when conducting work routines. \nMonitoring / Reporting of employees’ daily manufacturing ensuring production of rate / volume, quality, yield coupled with risk / cost avoidance management of non-conforming product whereby minimization of NCRs with concentration placed on limiting non-value-added work – i.e., re-runs and sorting, excess waste.\nWorks closely with Planning / Scheduling department to ensure that customer orders are shipped in a timely manner.\nManaging performance efficiencies and performance of employee workforce through effective communication and timely performance management. \nWork with engineering to diagnose manufacturing problems and recommending corrective and preventive actions where appropriate. \nReinforce adherence / compliance / training to all SOP’s pertaining to core operations tasks by department.\nReinforce adherence / compliance / training to all Work Instructions for focused task execution. \nEnsures employee training records are accurate and kept up to date.\nPerforms or coordinates training effectiveness verification. \nWorks closely with the Operations Manager on maximizing improvement targets and efficiencies product and process work with his or her people.\nWhen appropriate, reporting of manufacturing inventories and scrap of key goals and objectives.\nDevelop Value Stream Department Lead Persons to act as supervisory assistants in running manufacturing.\nTeam with Quality Control Department in the disposition of non-conforming product and resolution of quality problems.\nIdentify opportunities for Value Improvement Projects (VIP’s) to reduce manufacturing costs with other LEAN members, sponsors, and stakeholders.\nAs required, work with product development function and process engineering to ensure smooth transition of R&D product to production.\nMaintains standards for housekeeping, ergonomics, and safety at all times.\nOther duties as assigned. ", "qualifications": {"required": "Successful completion of four-years of high school, or equivalent, plus completion of two years of college or graduation from a two-year technical college with an associate’s degree (bachelor’s degree preferred) with a concentration in either manufacturing, operations, engineering or business manufacturing.\n5+ years of experience in manufacturing, or any combination of education and experience that provides equivalent knowledge, skills, and abilities.\nExperience supervising personnel in a medical device manufacturing setting to include distribution of work, scheduling, training, answering of questions related to work, assistance in problem solving, performance management and discipline.\nExperience with deploying LEAN. Lean Manufacturing Green Belt Certification or higher preferred.\nExperience with case studies, statistics and mathematical analysis and conclusion. Understanding and use of Software tools familiarity of use - i.e., product / process analysis equipment (Microsoft, MiniTab, Zumbach, MicroVu, Pivot tables).\nAble to effectively make presentations in both large and small group settings. ", "preferred": "Extrusion experience.\nInjection Molding experience."}, "skills": ["LEAN", "GMP", "GDP", "SMED", "OEE", "Microsoft", "MiniTab", "Zumbach", "MicroVu", "Pivot tables", "Presentations"], "postedDate": "4 hours ago", "benefits": "Competitive salary with performance-based bonus plans\n401K Match plus Age Weighted Defined Contribution\nCompetitive medical, dental &amp; vision offerings\nHealth Savings Account\nPaid Holidays, Vacation, Parental Leave\nFlexible work environment\nLearn more at benefits.lubrizol.com", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989738377"}