{"jobTitle": "Warehouse Clerk (Monday to Friday 9:00am to 6:00pm)", "company": {"name": "Glidewell Dental", "industry": "Medical Equipment Manufacturing", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$17.00/hr - $17.50/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Medical Equipment Manufacturing", "description": "Position at Glidewell Dental\n\nEssential Functions\n\n- Unloads and loads trucks with packages, bulk materials, or other products.\n- Opens and unpacks shipments of goods received by warehouse.\n- Examines deliveries to ensure shipments contain correct products and are in good condition.\n- Arranges and packs goods to distribute into shipping containers.\n- Moves materials using equipment and machines, including but not limited to hand trucks, forklifts, and golf carts.\n- Maintains and updates receiving and distribution shipment logs with shipment information.\n- Enters receiving data into various databases through manual data entry or bar code scanner.\n- Assists in storage and retrieval of departments’ products within warehouse for internal customers. Performs count of inventory supply levels and verifies against expected levels. Reports discrepancies between physical counts and database records.\n- Maintains organization within the warehouse by arranging and moving goods to designated locations. Ensures inventory are at accurate levels.\n- Gathers defected, poor quality, and/or non-working materials and equipment back to the warehouse. Inspects gathered materials and equipment to determine if items can be repurposed.\n- Assists with assembly of incoming products including but not limited to chairs, wire carts, etc.\n- Replenishes first aid cabinets.\n- Replenishes alcohol supply. Separates bulk gallons into smaller sizes for distribution.\n- Checks and maintains equipment and tools to ensure good working conditions.\n- Oversees incoming warehouse order requests. Responds and executes order requests/deliveries in a timely manner. Maintains contact with requestor with updates and/or discrepancies.\n- Processes all order requests/transfers on a reoccurring and timely basis for all supply rooms.\n- Processes reoccurring and/or as-needed transfers, replenishment, and deliveries per each department’s request to avoid discrepancies and/or delays to production.\n- Performs other related duties and projects as business needs require at direction of management.", "responsibilities": "Unloads and loads trucks with packages, bulk materials, or other products. Opens and unpacks shipments of goods received by warehouse. Examines deliveries to ensure shipments contain correct products and are in good condition. Arranges and packs goods to distribute into shipping containers. Moves materials using equipment and machines, including but not limited to hand trucks, forklifts, and golf carts. Maintains and updates receiving and distribution shipment logs with shipment information. Enters receiving data into various databases through manual data entry or bar code scanner. Assists in storage and retrieval of departments’ products within warehouse for internal customers. Performs count of inventory supply levels and verifies against expected levels. Reports discrepancies between physical counts and database records. Maintains organization within the warehouse by arranging and moving goods to designated locations. Ensures inventory are at accurate levels. Gathers defected, poor quality, and/or non-working materials and equipment back to the warehouse. Inspects gathered materials and equipment to determine if items can be repurposed. Assists with assembly of incoming products including but not limited to chairs, wire carts, etc. Replenishes first aid cabinets. Replenishes alcohol supply. Separates bulk gallons into smaller sizes for distribution. Checks and maintains equipment and tools to ensure good working conditions. Oversees incoming warehouse order requests. Responds and executes order requests/deliveries in a timely manner. Maintains contact with requestor with updates and/or discrepancies. Processes all order requests/transfers on a reoccurring and timely basis for all supply rooms. Processes reoccurring and/or as-needed transfers, replenishment, and deliveries per each department’s request to avoid discrepancies and/or delays to production. Performs other related duties and projects as business needs require at direction of management.", "qualifications": {"required": "High School diploma or equivalent. Minimum one (1) year of experience in a warehouse or purchasing environment.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Medical, Dental, Vision, 401K with company match, company-paid life insurance, additional onsite dental services, vacation, holiday, and sick time, employee gym (with fitness classes and meditation room), employee medical/wellness center (with massage therapy and acupuncture), two company subsidized cafes, Internet cafes, employee lounges with big screen TVs, game tables, fun company sponsored events, a diverse work environment with over forty nationalities represented, and much more!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3989241843"}