{"jobTitle": "Project Coordinator", "company": {"name": "Randstad USA", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Full-time", "experienceLevel": "Experienced", "salary": {"amount": "$23.00/hr - $25.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Randstad is looking for a business professional with a knowledge and proficiency working in the Project Coordinator. We have an onsite role that we are looking to fill for a contract position with a top tier company. If you are interested in becoming part of a team where you can contribute to drive both personal and organizational goals, this may be the right fit for you! For further information on the role, and job responsibilities, please read and apply below!", "responsibilities": "Manage audit requests, submit, and track all audits sent to audit firms and provide scheduling pushback support, including Virtual Audits and Spot Checks. Manage daily audit requests in Gensuite through reporting and track all CAP eligible audits. Update Salesforce by pulling daily reports from Gensuite. Managing batch updates and data uploads between Gensuite and Salesforce using Excel SQL reporting. Accurately update Licensee and factory information in internal database. Generate accurate approved factory lists. Promptly issue waiver and audit approval letters while ensuring accuracy at high volume. Promptly identify and escalate issues to Licensee support and supervisor. Support supervisor on team projects and other duties as assigned. Create waiver assessments in Salesforce and assign to correct regional manager for review.", "qualifications": {"required": "2 years of experience", "preferred": ""}, "skills": ["Organizational Skills", "Communication", "Customer service skills", "Salesforce"], "postedDate": "3 weeks ago", "applicationDeadline": "30 days", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3989715615"}