{"jobTitle": "Land Partnership Manager", "company": {"name": "Cypress Creek Renewables", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "<strong>The Company<br/><br/></strong>Cypress Creek Renewables is powering a sustainable future, one project at a time. We develop, finance, own and operate utility-scale and distributed solar and storage projects across the country. Fostering a diverse group of innovative thinkers from all backgrounds, Cypress people are drawn to work in a purpose-driven organization. We hope you will join us.<br/><br/><strong>Overview<br/><br/></strong>Cypress Creek Renewables (CCR) is seeking a motivated candidate for a Land Partnership Manager position to join our Development team. The Land Partnership Manager will be at the core of Cypress Creek's growth and business development strategy and will be primarily responsible for land acquisition activities, including developing and managing internal land campaigns, managing subcontractors and land acquisition companies, crafting strategic land partnerships, and negotiating real estate contracts. <br/><br/>The intent of this role is to manage our land acquisition efforts across the United States, serving as the primary coordinator between our development teams working in specific markets, our internal subject matter expert teams including the GIS team, and our external land partners to successfully acquire land to support transmission scale solar and storage projects. The position offers a unique opportunity to join the rapidly growing renewable power and storage industry at the forefront of our development business, driving the expansion of our project pipeline in support of our medium and long-term growth strategy.<br/><br/>An effective candidate will demonstrate excellent organizational habits, comprehensive external communication skills, a desire to solve complex problems, enthusiastic initiative, negotiation acumen, and an excellent ability to work with others across multiple teams. Essential functions of the position include, but, are not limited to:<br/><br/><ul><li>Coordinating with Development and Geoanalytics teams to identify prospective sites </li><li>Coordinating with subject matter expert teams, including our revenue, interconnection, and modeling teams, to determine site suitability </li><li>Performing desktop diligence on prospective sites to determine site suitability </li><li>Manage land acquisition vendors, varying from singular landman to corporate land acquisition companies, and consider suite of options for each potential campaign </li><li>Understanding value proposition of target sites to inform and prioritize negotiations </li><li>Negotiating ground lease and purchase agreements </li><li>Negotiating terms and conditions for collection and transmission lines, access roads and right of way easements </li><li>Managing data sets and customer relationship management platform to track leads </li><li>Vetting and onboarding new land acquisition vendors <br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>3-5+ years working experience in land acquisition or real estate development work, with preference for experience in renewable energy related land acquisition </li><li>BA degree preferred, with focus on real estate, energy, business or marketing a plus </li><li>Ability to travel approximately 25-50% of the time </li><li>Strong work ethic and ability to self-start in a fast-paced environment </li><li>Results driven and solutions oriented </li><li>Strong organization, communication skills and attention to detail </li><li>Excellent negotiation, and influencing skills </li><li>Ability to work with little supervision and to seek help when needed </li><li>Embrace and live by the mission and values of Cypress Creek Renewables <br/><br/></li></ul><strong>Locations:</strong> The preferred location for this position is in one of our offices located in Asheville, Durham, Santa Monica, or San Francisco. However, remote candidates will be considered.<br/><br/><strong>Compensation:</strong> The salary range for the position is $90,000-140,000 plus bonus and benefits. Compensation may vary outside of this range depending on a number of factors, including a candidate's qualifications, skills, competencies and experience, and location.<br/><br/><strong>Benefits:<br/><br/></strong><ul><li>15 days of Paid Time Off, accrual up to 20 days, 11 observed holidays.</li><li>401(k) Match</li><li>Comprehensive package including medical, dental, vision and health insurance</li><li>Wellness stipend, family planning stipend, and generous parental leave</li><li>Tuition Reimbursement</li><li>Phone Bill Reimbursement</li><li>Fully expensed company travel, mileage reimbursement</li><li>Company Swag<br/><br/></li></ul><strong>A note to Recruiting Agencies Cypress Creek Renewables Human Resources team does not accept unsolicited resumes from third party recruiters, staffing firms, or related agencies. The Human Resources team coordinates all recruiting and hiring at our company. We do not accept resumes from third-party recruiters unless authorized by the Human Resources team and if a signed agreement is in place. Any unsolicited resumes will be considered property of CCR and we are not responsible for any related fees. All communication related to recruiting partnerships should ONLY be directed to the Human Resources team. <br/><br/></strong><strong>Cypress Creek Renewables is an equal opportunity employer and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status. We are committed to providing a workplace that is inclusive and values diversity, and we encourage candidates from all backgrounds to apply.</strong>", "responsibilities": "<ul><li>Coordinating with Development and Geoanalytics teams to identify prospective sites </li><li>Coordinating with subject matter expert teams, including our revenue, interconnection, and modeling teams, to determine site suitability </li><li>Performing desktop diligence on prospective sites to determine site suitability </li><li>Manage land acquisition vendors, varying from singular landman to corporate land acquisition companies, and consider suite of options for each potential campaign </li><li>Understanding value proposition of target sites to inform and prioritize negotiations </li><li>Negotiating ground lease and purchase agreements </li><li>Negotiating terms and conditions for collection and transmission lines, access roads and right of way easements </li><li>Managing data sets and customer relationship management platform to track leads </li><li>Vetting and onboarding new land acquisition vendors <br/><br/></li></ul>", "qualifications": {"required": "3-5+ years working experience in land acquisition or real estate development work, with preference for experience in renewable energy related land acquisition ", "preferred": "BA degree preferred, with focus on real estate, energy, business or marketing a plus "}, "skills": ["Land Acquisition", "Real Estate Development", "Renewable Energy", "Business Development", "Negotiation", "Communication", "GIS", "Project Management", "Data Management", "Customer Relationship Management"], "postedDate": "3 weeks ago", "benefits": "<ul><li>15 days of Paid Time Off, accrual up to 20 days, 11 observed holidays.</li><li>401(k) Match</li><li>Comprehensive package including medical, dental, vision and health insurance</li><li>Wellness stipend, family planning stipend, and generous parental leave</li><li>Tuition Reimbursement</li><li>Phone Bill Reimbursement</li><li>Fully expensed company travel, mileage reimbursement</li><li>Company Swag<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3989670819"}