{"jobTitle": "Program Manager", "company": {"name": "Los Angeles Philharmonic", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000 - $90,000", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Musicians", "description": "<strong>Job Description<br/><br/></strong>Position: Programming Manager<br/><br/>Department: Programming / Presentations<br/><br/>FLSA STATUS: Full-Time, Exempt<br/><br/>Compensation: $80,000 - $90,000<br/><br/>Position Summary: Under the supervision of the Vice President of Programming, this position is responsible for acting as a liaison between the programming team and a wide array of internal and external agents, artist managers, publicists, marketing teams, vendors, and internal teams. The Program Manager will provide a high-level of concert support and serve as a promoter and representative for concerts across the three venues. This position will also serve as a line producer as needed, including concerts, festivals, holiday shows, etc.<br/><br/><strong>Essential Functions<br/><br/></strong>Marketing<br/><br/><ul><li>Serve as main point of contact for all artist marketing teams (all non-classical artists at Hollywood Bowl, Walt Disney Concert Hall, and The Ford).</li><li>Advises internal teams on all artist confirmations and coordinates all announce/on-sale timelines.</li><li>Manage all artist asset requests, handle all marketing routings for artists’ approvals, manage special promo requests, advise marketing team on guidelines and sensitivities.</li><li>Schedule meetings with marketing team and external artist teams, provide promoter insight as needed.</li><li>Work with Digital team to develop promo ideas (social media content, interviews, video shoots, etc).</li><li>Work closely with studios for approvals on any branded content for movie nights or similar.<br/><br/></li></ul>Contracting<br/><br/><ul><li>Manage progress of all Presentations contracts with Contract Administrator. </li><li>Draft offers and deal memos as assigned.</li><li>Communicate deal terms and venue policies to agent teams as requested.</li><li>Negotiate terms and offer solutions as needed to bookers and external contracting teams.<br/><br/></li></ul>Settlement<br/><br/><ul><li>Coordinate with Settlement Specialist, Contract Administrator, and Finance team to process all artist settlements.</li><li>Work with internal teams to track expenses for any necessary artist settlements and/or agreements.</li><li>Advise on any unique payment terms, payment schedules, track deductions and bonuses for final settlement.<br/><br/></li></ul>Staff Management<br/><br/><ul><li>Oversee all hospitality advancing including ticketing, travel and accommodations for guest artists, catering and ground transportation arrangements.</li><li>Oversee interviewing, hiring, and training of all seasonal staff. </li><li>Develop annual training plan, summer schedule, and coordinate all training sessions with internal departments.</li><li>Assign all concert shifts for Artist Venue Assistants, Coordinators, Hospitality Assistants, and Ticketing staff, while ensuring compliance with HR Policies. </li><li>Process weekly payroll for all hourly employees. </li><li>Serve as onsite manager for seasonal staff. Provide conflict resolution and support as needed. </li><li>Work with internal team managers and supervisors to improve efficiencies and address any issues as they arise during various seasons.</li><li>Advise and communicate to Production team on deal points, rundowns, artist needs, etc.<br/><br/></li></ul>Administrative<br/><br/><ul><li>Oversee coding and submission of invoices and expenses.</li><li>Maintain relationships with outside producers and vendors, process contracts and payments as needed.</li><li>Process high volume of department receipts, work with seasonal staff to track and substantiate all expenses.</li><li>Provide occasional support to VP of department, arranging travel and meetings as assigned. <br/><br/></li></ul>Reports To: Vice President of Programming<br/><br/>Relationships: Chief Content Officer<br/><br/>Guest artists<br/><br/>Artist agents and managements<br/><br/>Director of Ford Theater<br/><br/>Production<br/><br/>Other LAPA departments<br/><br/><strong>Requirements<br/><br/></strong><strong>Job Requirements<br/><br/></strong><ul><li>Bachelor’s Degree or equivalent work experience in the arts, arts administration or concert production</li><li>Extensive knowledge of and passion for music and artists</li><li>Strong skills in project management, organization, information synthesis and problem-solving</li><li>Proven negotiation and contract management skills </li><li>Excellent written and verbal communication skills</li><li>Ability to manage budgets and meet goals </li><li>Ability to work proactively, independently, and reliably on multiple projects under tight timelines and in a fast-paced environment </li><li>Ability to develop and sustain professional relationships and collaborate both internally and externally for the benefit of the organization </li><li>Strong attention to detail </li><li>Fluency in all Microsoft suites components and remote working tools (Slack, Google, Zoom, etc.)</li><li>Flexible schedule which includes ability to provide weekend and evening concert coverage as needed in addition to business day responsibilities.</li><li>Dedication and commitment to engage in and promote diversity, equity, and inclusion within the staff, vendors, and within interactions with the surrounding community is a must</li><li>Recent equity, diversity and inclusion training preferred</li><li>Second language fluency is a plus </li><li>Regular and reliable attendance<br/><br/></li></ul>The Los Angeles Philharmonic Association will consider for employment qualified Applicants with Criminal Histories in a manner consistent with the requirements of the FCIHO.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY POLICY<br/><br/></strong>The Los Angeles Philharmonic Association embraces and is committed to diversity and inclusion within our staff, musicians, guest artists, audiences, and surrounding communities. The Association does not discriminate on the basis of race, color, religion, religious creed (including religious dress and religious grooming), sex (including pregnancy, perceived pregnancy, childbirth, breastfeeding, or related medical conditions), sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition or information, genetic information, marital status, gender, gender identity, gender expression, military status, veteran status, or any other basis protected by federal, state, or local law. Consistent with the law, the Association also provides reasonable accommodation for disabled applicants and employees in accordance with the Americans with Disabilities Act (ADA) and the California Fair Employment and Housing Act, for pregnant employees who request an accommodation with the advice of their health care providers, for pregnancy, childbirth or related medical conditions; for employees who are victims of domestic violence, sexual assault or stalking; and for applicants and employees based on their religious beliefs and practices.", "responsibilities": "Marketing<br/><br/><ul><li>Serve as main point of contact for all artist marketing teams (all non-classical artists at Hollywood Bowl, Walt Disney Concert Hall, and The Ford).</li><li>Advises internal teams on all artist confirmations and coordinates all announce/on-sale timelines.</li><li>Manage all artist asset requests, handle all marketing routings for artists’ approvals, manage special promo requests, advise marketing team on guidelines and sensitivities.</li><li>Schedule meetings with marketing team and external artist teams, provide promoter insight as needed.</li><li>Work with Digital team to develop promo ideas (social media content, interviews, video shoots, etc).</li><li>Work closely with studios for approvals on any branded content for movie nights or similar.<br/><br/></li></ul>Contracting<br/><br/><ul><li>Manage progress of all Presentations contracts with Contract Administrator. </li><li>Draft offers and deal memos as assigned.</li><li>Communicate deal terms and venue policies to agent teams as requested.</li><li>Negotiate terms and offer solutions as needed to bookers and external contracting teams.<br/><br/></li></ul>Settlement<br/><br/><ul><li>Coordinate with Settlement Specialist, Contract Administrator, and Finance team to process all artist settlements.</li><li>Work with internal teams to track expenses for any necessary artist settlements and/or agreements.</li><li>Advise on any unique payment terms, payment schedules, track deductions and bonuses for final settlement.<br/><br/></li></ul>Staff Management<br/><br/><ul><li>Oversee all hospitality advancing including ticketing, travel and accommodations for guest artists, catering and ground transportation arrangements.</li><li>Oversee interviewing, hiring, and training of all seasonal staff. </li><li>Develop annual training plan, summer schedule, and coordinate all training sessions with internal departments.</li><li>Assign all concert shifts for Artist Venue Assistants, Coordinators, Hospitality Assistants, and Ticketing staff, while ensuring compliance with HR Policies. </li><li>Process weekly payroll for all hourly employees. </li><li>Serve as onsite manager for seasonal staff. Provide conflict resolution and support as needed. </li><li>Work with internal team managers and supervisors to improve efficiencies and address any issues as they arise during various seasons.</li><li>Advise and communicate to Production team on deal points, rundowns, artist needs, etc.<br/><br/></li></ul>Administrative<br/><br/><ul><li>Oversee coding and submission of invoices and expenses.</li><li>Maintain relationships with outside producers and vendors, process contracts and payments as needed.</li><li>Process high volume of department receipts, work with seasonal staff to track and substantiate all expenses.</li><li>Provide occasional support to VP of department, arranging travel and meetings as assigned. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s Degree or equivalent work experience in the arts, arts administration or concert production, Extensive knowledge of and passion for music and artists, Strong skills in project management, organization, information synthesis and problem-solving, Proven negotiation and contract management skills, Excellent written and verbal communication skills, Ability to manage budgets and meet goals, Ability to work proactively, independently, and reliably on multiple projects under tight timelines and in a fast-paced environment, Ability to develop and sustain professional relationships and collaborate both internally and externally for the benefit of the organization, Strong attention to detail, Fluency in all Microsoft suites components and remote working tools (Slack, Google, Zoom, etc.), Flexible schedule which includes ability to provide weekend and evening concert coverage as needed in addition to business day responsibilities., Dedication and commitment to engage in and promote diversity, equity, and inclusion within the staff, vendors, and within interactions with the surrounding community is a must, Regular and reliable attendance", "preferred": "Recent equity, diversity and inclusion training, Second language fluency"}, "skills": ["Project Management", "Music", "Arts Administration", "Concert Production", "Negotiation", "Contract Management", "Communication", "Budget Management", "Microsoft Office", "Slack", "Google", "Zoom"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3989842551"}