{"jobTitle": "Administrative Clerk", "company": {"name": "Wood, Smith, Henning & Berman LLP", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Legal", "industry": "Legal Services, Law Practice, and Professional Services", "description": "National law firm seeks an Administrative Clerk for its Los Angeles office. This position is a full-time, onsite position Monday-Friday.\n\nPosition Responsibilities:\n\n* Assist with document management, file organization, and e-filing document and media downloads/uploads.\n* Assist with trial preparation (creating trial binders, making copies, etc.)\n* Assist attorneys and staff with daily administrative tasks.\n* Greet clients and guests in a professional manner.\n* Replenish Kitchen with supplies and keeping orderly.\n* Assist with the processing of daily incoming and outgoing mail.\n* Scanning, copying and saving of documents.\n* Assist with document management and physical file organization.\n* Set up and take down of Conference Rooms for depositions and meetings.\n* Interact with maintenance crews and vendors when Office Administrator is unavailable.\n* Ordering of supplies through Staples.\n* Assist with processing of invoices and maintaining of invoice matrix.\n* Assist with document retrieval for attorneys and staff.\n* Assist paralegals with processing of medical records and radiology imaging.\n* Assist with downloading and saving of deposition transcripts.\n* Assist with downloading and saving Court documents.\n* Assist with copying of CD/DVD’s of imaging, medical records and pleadings for distribution.\n* Assist with voluminous mailings.\n\nPosition Requirements:\n\n* Minimum of 2 years law firm experience.\n* Proficient in MS Office (specifically, MS Word, MS Excel & Outlook).\n* Must be a self-starter who is well organized and can handle multiple tasks with the ability to prioritize work.\n* Must be a team player with a positive attitude.\n* Must be reliable and responsible.\n* Must be flexible and open-minded.\n* Ability to operate standard office equipment such as a computer, photocopier, postage machine, and scanner.\n* Excellent communication skills, both verbal and written.\n* Ability to work in fast paced environment while paying close attention to detail.\n* Professional appearance and demeanor.\n* Ability to work 8:00 a.m. – 5:00 p.m. Monday – Friday with exceptional attendance.\n\nRecruiters - Please do not contact us as we are not using external recruiters to fill this position at this time.", "responsibilities": "Assist with document management, file organization, and e-filing document and media downloads/uploads. Assist with trial preparation (creating trial binders, making copies, etc.) Assist attorneys and staff with daily administrative tasks. Greet clients and guests in a professional manner. Replenish Kitchen with supplies and keeping orderly. Assist with the processing of daily incoming and outgoing mail. Scanning, copying and saving of documents. Assist with document management and physical file organization. Set up and take down of Conference Rooms for depositions and meetings. Interact with maintenance crews and vendors when Office Administrator is unavailable. Ordering of supplies through Staples. Assist with processing of invoices and maintaining of invoice matrix. Assist with document retrieval for attorneys and staff. Assist paralegals with processing of medical records and radiology imaging. Assist with downloading and saving of deposition transcripts. Assist with downloading and saving Court documents. Assist with copying of CD/DVD’s of imaging, medical records and pleadings for distribution. Assist with voluminous mailings.", "qualifications": {"required": "Minimum of 2 years law firm experience. Proficient in MS Office (specifically, MS Word, MS Excel & Outlook). Must be a self-starter who is well organized and can handle multiple tasks with the ability to prioritize work. Must be a team player with a positive attitude. Must be reliable and responsible. Must be flexible and open-minded. Ability to operate standard office equipment such as a computer, photocopier, postage machine, and scanner. Excellent communication skills, both verbal and written. Ability to work in fast paced environment while paying close attention to detail. Professional appearance and demeanor. Ability to work 8:00 a.m. – 5:00 p.m. Monday – Friday with exceptional attendance."}, "skills": ["MS Office", "Word", "Excel", "Outlook", "Communication"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989855286"}