{"jobTitle": "Executive Personal Assistant", "company": {"name": "Career Group", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "90,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Individual and Family Services", "description": "Our client is seeking a highly skilled Mandarin-fluent Executive Personal Assistant to play a key role in supporting an established businessman, investor, and philanthropist within their Family Office. This position offers the unique opportunity to handle a wide array of administrative and personal tasks, demanding exceptional flexibility, a strong eagerness to learn, and the ability to thrive independently in a dynamic, fast-paced environment. The role is based on the Westside of Los Angeles.", "responsibilities": "Support the development and management of the Family's administrative operations. Coordinate and prioritize complex calendar schedules, meetings, and personal travel, both international and domestic. Create travel itineraries and manage local and international accommodation and dining arrangements. Oversee home vendors, including coordinating maintenance, supervising repairs, and managing internal communications. Plan, organize, and execute events of all sizes, handling all related logistics. Draft, proofread, and finalize written correspondence, including letters and thank-you notes, ensuring accuracy. Manage resources for the Family. Schedule meetings and handle all associated logistics, including answering phones and filing. Prepare expense reports and manage reimbursements. Handle special projects as required.", "qualifications": {"required": "Bilingual in Mandarin Chinese and English, with fluency (speaking, reading, and writing) in Mandarin. Proven ability to manage multiple high-volume projects while meeting strict deadlines. Experience coordinating both business and personal calendars effectively. Sophisticated communicator with exceptional verbal and written communication skills. Outstanding interpersonal skills, demonstrating the ability to interact positively and professionally. Exhibits exceptional service and responsiveness in all interactions. Impeccable attention to detail and accuracy in all tasks. Maintains the highest level of discretion, with strong independent judgment and high integrity. Proactive and initiative-driven, with a demonstrated ability to get things done. Adaptable, motivated, and driven work ethic. Skilled in the Microsoft Office Suite, including Outlook, Word, Excel, and other applications.", "preferred": ""}, "skills": ["Mandarin"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989733191"}