{"jobTitle": "Administrative Business Partner III", "company": {"name": "Google", "industry": "Information Services and Technology", "location": "Reston, VA, USA"}, "location": "Reston, VA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "90,500.00/yr - $132,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information and Internet", "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: **Reston, VA, USA; Washington D.C., DC, USA**.**Minimum qualifications:**<br/><br/>\n<ul><li>3 years of administrative experience in a high-tech or international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.).<br/><br/></li></ul>\n**Preferred qualifications:**<br/><br/>\n<ul><li>6 years of administrative experience supporting executive-level management in a corporate environment, and managing small-scale projects and events from pre-planning to execution.<br/><br/></li></ul>\n**About The Job**<br/><br/>\nAs an Administrative Business Partner, you're at the heart of your team's business operations and activities and the soul that keeps your team moving forward. You anticipate the needs of your managers and team members and help them stay focused on their projects by resolving operational and administrative issues before they arise. You move quickly with the changing environment and are up to date with the latest Google products and services. You also use that knowledge to strategically support your team's projects. In addition to being organized and analytical, you possess the strong business judgment and communication skills needed to interact with a variety of people and job functions.<br/><br/>\nAdministrative jobs at Google are staffed by organized and dependable people driven by a common company goal: to help us accomplish great things. Working behind the scenes, we make a significant impact on the people we support as well as on Google users around the world. We're adept at leading and managing a variety of simultaneous projects, which requires the particular talent of being able to communicate effectively with all levels of the organization.<br/><br/>\nThe US base salary range for this full-time position is $90,500-$132,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/>\n**Responsibilities**<br/><br/>\n<ul><li>Schedule, maintain, and update calendar events, with minimal guidance. Prepare meetings for the executive or team with minimal guidance. </li><li>Execute expense management activities with minimal guidance. </li><li>Assess and advocate for office space needs with minimal guidance. </li><li>Plan and organize internal and external programs and events and manage event logistics in collaboration with internal partners and external vendors. </li><li>Complete travel coordination tasks with minimal guidance.<br/><br/><br/></li></ul>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Schedule, maintain, and update calendar events, with minimal guidance. Prepare meetings for the executive or team with minimal guidance. </li><li>Execute expense management activities with minimal guidance. </li><li>Assess and advocate for office space needs with minimal guidance. </li><li>Plan and organize internal and external programs and events and manage event logistics in collaboration with internal partners and external vendors. </li><li>Complete travel coordination tasks with minimal guidance.<br/><br/><br/></li></ul>", "qualifications": {"required": "3 years of administrative experience in a high-tech or international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.).", "preferred": "6 years of administrative experience supporting executive-level management in a corporate environment, and managing small-scale projects and events from pre-planning to execution."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The US base salary range for this full-time position is $90,500-$132,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3989719246"}