{"jobTitle": "Full Time Coach Manager, Soccer Program", "company": {"name": "Super Soccer Stars", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60,000.00 - $80,000.00", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Soccer Stars is the parent company of three premier children's sports development programs, holding over 1,000 classes each week for early childhood, elementary, and middle school children. We believe that every child is an athlete! Our range of programs provides children with access to multiple sports so they can experience a fun learning environment.", "responsibilities": "Identifying, screening, interviewing, and onboarding coaches. Represent a position of being an ambassador, to mentor and guide the coaching team. Supervise and evaluate educators and coaches through written review to ensure the overall quality of the program. Create and implement the development of a staff training program. Lead, provide materials for and participate in coach training. Oversee equipment distribution and maintain inventory. Liaise with parents and locations to receive feedback on staff performance and program content.", "qualifications": {"required": "Minimum 5 years in a supervisory position. Proficiency in project management and communication platforms (Slack, Smartsheet, Google sheets, etc.). Aptitude for effectively preparing and delivering presentations to a large group. Customer service oriented. Exceptional organizational skills.", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "Experience managing and staff development. Deep understanding of curriculum implementation across multiple sports. Salary range $60,000 - 80,000 USD, dependent on relevant job experience.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3989987082"}