{"jobTitle": "Event Production Assistant", "company": {"name": "Los Angeles Philharmonic", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "salary": {"amount": "25-27", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Musicians", "description": "<strong>Job Description<br/><br/></strong><strong>POSITION</strong><strong>: EVENT PRODUCTION ASSISTANT – TEMPORARY THROUGH 10/4/24<br/><br/></strong><strong>DEPARTMENT</strong>: PHILANTHROPY<br/><br/><strong>REPORTS TO</strong>: DIRECTOR, SPECIAL EVENTS<br/><br/><strong>FLSA </strong><strong>Grade:</strong> Non-Exempt, Part-Time<br/><br/><strong>SALARY</strong>: $25-$27 PER HOUR<br/><br/><strong>Position Summary<br/><br/></strong>LA Philharmonic Philanthropy team is for an Event Production Assistant to support for the Special Events team in planning of our major fundraising Gala at Walt Disney Concert Hall. Event PA will work 15-25 hours per week. Must be available to work additional hours the week leading up to gala taking place Tuesday, October 1, 2024.<br/><br/><strong>Position Elements<br/><br/></strong><ul><li> Provide administrative and logistical support for large-scale events including the two annual fundraising galas and other fundraising events.</li><li> Assist with all aspect of event production, such as securing credentials, managing vendor load in/load out, maintaining organized and clean event spaces.</li><li> Coordinate with internal staff, vendors, suppliers, and contractors to ensure seamless execution of event plans. Collaborate effectively with internal operations &amp; technical teams as well as other production associate managers/assistants to streamline workflows across all apps and content teams.</li><li> Build agendas, participate in or lead production kick-offs and ongoing production meetings for all gala productions. Provide clear communications and instructions to vendor and production staff to ensure timely completion within set deadlines.</li><li> Support Special Events staff in taking reservations for the Galas, guest digital and printed communications, seating arrangements diagrams.</li><li> Gather, track and enter various production data among multiple platforms. Assist with mailing lists for the Gala mailings, including coordinating and updating lists and committee contacts.</li><li> Coordinate mailings for gala invitations and print marketing collateral in a timely manner.<br/><br/></li></ul><strong>Relationships<br/><br/></strong>Direct Report: Director, Special Events<br/><br/>Interacts with: Philanthropy Department<br/><br/>Hollywood Bowl Operations<br/><br/>The Music Center Staff<br/><br/>External Vendor, Production and Contract Staff<br/><br/>Donors<br/><br/>Other LAPA departments and Staff, as needed<br/><br/><strong>Qualifications<br/><br/></strong><strong>Job Requirements<br/><br/></strong><ul><li> Minimum of two years of experience in Event Production for large-scale programs.</li><li> Excellent interpersonal, written, and oral communications skills.</li><li> Exceptional and detail-oriented project management skills with the ability to multi-task and work within deadlines.</li><li> Ability to build collaborative working relationships with vendors, volunteers, donors and internal teams exercising discretion and good judgment.</li><li> Strong computer skills including experience with Microsoft 365, Zoom, and Slack.</li><li> Fundraising experience with a background in the Arts is a plus.<br/><br/></li></ul>The Los Angeles Philharmonic Association will consider for employment qualified Applicants with Criminal Histories in a manner consistent with the requirements of the FCIHO.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY POLICY<br/><br/></strong>The Los Angeles Philharmonic Association embraces and is committed to diversity and inclusion within our staff, musicians, guest artists, audiences, and surrounding communities. The Association does not discriminate on the basis of race, color, religion, religious creed (including religious dress and religious grooming), sex (including pregnancy, perceived pregnancy, childbirth, breastfeeding, or related medical conditions), sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition or information, genetic information, marital status, gender, gender identity, gender expression, military status, veteran status, or any other basis protected by federal, state, or local law. Consistent with the law, the Association also provides reasonable accommodation for disabled applicants and employees in accordance with the Americans with Disabilities Act (ADA) and the California Fair Employment and Housing Act, for pregnant employees who request an accommodation with the advice of their health care providers, for pregnancy, childbirth or related medical conditions; for employees who are victims of domestic violence, sexual assault or stalking; and for applicants and employees based on their religious beliefs and practices.", "responsibilities": "Provide administrative and logistical support for large-scale events including the two annual fundraising galas and other fundraising events. Assist with all aspect of event production, such as securing credentials, managing vendor load in/load out, maintaining organized and clean event spaces. Coordinate with internal staff, vendors, suppliers, and contractors to ensure seamless execution of event plans. Collaborate effectively with internal operations & technical teams as well as other production associate managers/assistants to streamline workflows across all apps and content teams. Build agendas, participate in or lead production kick-offs and ongoing production meetings for all gala productions. Provide clear communications and instructions to vendor and production staff to ensure timely completion within set deadlines. Support Special Events staff in taking reservations for the Galas, guest digital and printed communications, seating arrangements diagrams. Gather, track and enter various production data among multiple platforms. Assist with mailing lists for the Gala mailings, including coordinating and updating lists and committee contacts. Coordinate mailings for gala invitations and print marketing collateral in a timely manner.", "qualifications": {"required": "Minimum of two years of experience in Event Production for large-scale programs. Excellent interpersonal, written, and oral communications skills. Exceptional and detail-oriented project management skills with the ability to multi-task and work within deadlines. Ability to build collaborative working relationships with vendors, volunteers, donors and internal teams exercising discretion and good judgment. Strong computer skills including experience with Microsoft 365, Zoom, and Slack.", "preferred": "Fundraising experience with a background in the Arts is a plus."}, "skills": ["Event Production", "Project Management", "Communication", "Microsoft 365", "Zoom", "Slack", "Fundraising"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989846442"}