{"jobTitle": "Division Operations Officer", "company": {"name": "Caltech", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "235,800.00/yr - 272,100.00/yr", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Research Services", "description": "Caltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.<br/><br/><strong>Job Summary<br/><br/></strong>The Division of Biology and Biological Engineering (BBE) focuses on advancing investigations of and expanding knowledge about the nature of life—from a single molecule to an entire organism—and advancing engineering methods applied to biological systems. Through interdisciplinary programs of study and research, faculty and students address complex questions related to how living things evolve, develop, and function, and then use their findings to engineer innovative biological systems as well as medicines and other therapies. The Division includes more than 50 faculty research laboratories—labs headed by renowned leaders in their fields.<br/><br/>The Division Operations Officer (DOO) will provide broad leadership, management, direction, and oversight for administrative, human resources, finance, and infrastructure activities within the Division. In conjunction with the Division Chair, the DOO will establish and implement policies and procedures to support research and teaching, as well as act as a liaison with other campus units and departments. The successful candidate will utilize excellent leadership skills to support, develop, and motivate teams within the Division; will work to create an environment to empower BBE staff to work efficiently and productively; and will foster collaboration within and outside the Division.<br/><br/>This is an Organizational Critical position. An employee designated as organizational critical is expected to report to Campus as soon as possible to assist in division/department response and recovery efforts.<br/><br/><strong>Essential Job Duties<br/><br/></strong>Human Resources<br/><br/><ul><li>Manages the Division's business and administrative functions, with significant responsibility for staffing, training, career development, and organization structure.</li><li>Partners with Caltech Human Resources to oversee all non-faculty human resources activity, including hires, terminations, and disciplinary actions.</li><li>Oversees and ensures compliance with all Institute policies and government regulations.</li><li>Provides guidance and support to Division managers, helping them develop their skills and build effective teams. <br/><br/></li></ul>Finance<br/><br/><ul><li>Oversees all financial activity within the Division, specifically the management of the general budget as well as gift and endowment funds. Works closely with the Division grants managers who are responsible for all aspects of research administration for the Division.</li><li>Utilizes data and analytics to inform strategic decisions, assess program effectiveness, and identify opportunities for improvement.</li><li>Monitors and evaluates key performance indicators related to operational goals, using insights to drive continuous improvement.<br/><br/></li></ul>Infrastructure Management<br/><br/><ul><li>Coordinates all major facilities and infrastructure projects, including the development and execution of new construction or renovations of existing labs/offices. Collaborates with facilities groups on campus, as well as faculty and researchers, to make effective use of division space.</li><li>Provides broad oversight and direction to research centers and facilities in BBE, including the off-campus Kerckhoff Marine Laboratory.</li><li>Working with research group safety officers, develops and implements laboratory safety programs, including identifying proper equipment, procedures, and training.<br/><br/></li></ul>Collaboration and Communication<br/><br/><ul><li>Fosters strong relationships with internal stakeholders to promote a collaborative and supportive research and work environment.</li><li>Serves on Institute-wide planning and policy committees. Represents the Division during the formation and evaluation of new Institute practices and policies, including new IT and business solutions.</li><li>Coordinates communication and outreach activities that portray the Division to various constituencies, using webpages, social media, print media, and special events.</li><li>Recommends and develops new policies, procedures, and processes to improve the overall effectiveness of the Division.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s degree or equivalent combination of education and experience.</li><li>10 or more years of administrative and/or management experience.</li><li>Comprehensive knowledge and overall understanding of multiple business functions, including the use of modern IT methods for data-driven analysis and decision-making.</li><li>Exceptional written and verbal communication skills.</li><li>Proven skills in areas of project management, human resources, and finance.</li><li>Demonstrated leadership, team building, problem-solving, and change management abilities.</li><li>Proven ability to partner, communicate, and interact with faculty and staff, and resolve challenging issues.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Master of Business Administration or equivalent combination of education and experience.</li><li>An interest or knowledge in science and technology is strongly desired.</li><li>Prior Caltech and/or JPL experience is strongly preferred.<br/><br/></li></ul><strong>Required Documents<br/><br/></strong><ul><li>Resume</li><li>Cover Letter<br/><br/></li></ul><strong> Hiring Range <br/><br/></strong>$235,800 - $272,100 per year<br/><br/>The salary of the finalist(s) selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training.<br/><br/>As one of the largest employers in Pasadena, CA, Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time. Learn more about our<br/><br/><strong> EEO Statement <br/><br/></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, or national origin, disability status, protected veteran status, or any other characteristic protected by law.<br/><br/>Caltech is a VEVRAA Federal Contractor.<br/><br/>To read more Equal Employment Opportunity (EEO) go to eeoc_self_print_poster.pdf.<br/><br/><strong> Disability Accommodations <br/><br/></strong>If you would like to request an accommodation in completing this application, interviewing, or otherwise participating in the employee selection process, please direct your inquiries to Caltech Recruiting at", "responsibilities": "The Division Operations Officer (DOO) will provide broad leadership, management, direction, and oversight for administrative, human resources, finance, and infrastructure activities within the Division. In conjunction with the Division Chair, the DOO will establish and implement policies and procedures to support research and teaching, as well as act as a liaison with other campus units and departments. The successful candidate will utilize excellent leadership skills to support, develop, and motivate teams within the Division; will work to create an environment to empower BBE staff to work efficiently and productively; and will foster collaboration within and outside the Division.", "qualifications": {"required": "Bachelor’s degree or equivalent combination of education and experience. 10 or more years of administrative and/or management experience. Comprehensive knowledge and overall understanding of multiple business functions, including the use of modern IT methods for data-driven analysis and decision-making. Exceptional written and verbal communication skills. Proven skills in areas of project management, human resources, and finance. Demonstrated leadership, team building, problem-solving, and change management abilities. Proven ability to partner, communicate, and interact with faculty and staff, and resolve challenging issues.", "preferred": "Master of Business Administration or equivalent combination of education and experience. An interest or knowledge in science and technology is strongly desired. Prior Caltech and/or JPL experience is strongly preferred."}, "skills": ["Project Management", "Human Resources", "Finance", "Leadership", "Team Building", "Problem Solving", "Change Management", "Communication", "Data Analysis", "Decision Making"], "postedDate": "3 weeks ago", "benefits": "As one of the largest employers in Pasadena, CA, Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989320043"}