{"jobTitle": "Assistant Manager, Guest Experience | Culver City (12-month Contract)", "company": {"name": "lululemon", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "26.26- $35.54/hour", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail", "description": "<strong>Requirements<br/><br/></strong><strong> Description &amp; Requirements <br/><br/></strong><strong>Who We Are<br/><br/></strong>lululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative product, emphasis on stores, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people.<br/><br/><strong>Job Summary<br/><br/></strong>The Assistant Manager, Guest Experience role is an essential part of the store leadership team, ensuring our team members and guests (i.e., customers) receive a quality experience in our stores every day. Assistant Managers, Guest Experience are responsible for leading from the floor to build, manage, and develop team members. Assistant Managers, Guest Experience create an environment and a team culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their team delivers outstanding guest experience in line with company values and directives.<br/><br/><strong>Core Responsibilities Of The Job<br/><br/></strong><strong>Leadership and People Management<br/><br/></strong><ul><li>Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members.</li><li>Engage team members by helping them understand how their work supports the success of the store and of lululemon overall. </li><li>Implement the Store Manager’s People vision for the store and cascade to team members.</li><li>Support Store Manager in hiring and building a strong and diverse team that includes team members with various experiences, backgrounds, and skillsets to drive key results and performance.</li><li>Support ongoing learning and development of team members consistently and equitably by providing direct feedback, coaching, mentoring, and continuous development check-ins.</li><li>Lead performance management activities, including direct feedback and continuous check-ins, facilitating team acknowledgement and rewards, managing performance documentation, and addressing performance concerns.</li><li>Address employee concerns or issues, including knowing when to partner with internal support to take appropriate action.<br/><br/></li></ul><strong>Guest Experience And Community<br/><br/></strong><ul><li>Lead an exceptional guest (customer) experience on the floor through assessing the level of guest connection and technical product education and supporting team members to address gaps through feedback and coaching.</li><li>Provide retail floor leadership to team members, including making in-the-moment decisions to maintain efficiency and effectiveness of retail floor coverage and operations. </li><li>Resolve guest feedback and address emergent issues, including guest escalations and urgent requests, helping to “make it right” for guests.<br/><br/></li></ul><strong>Operations, Product, and Strategy <br/><br/></strong><ul><li>Partner with other managers to review business data and metrics (e.g., profit and loss [P&amp;L] statement) to inform planning processes (e.g., quarterly business review, sales planning, and hiring strategy).</li><li>Maintain strategic product presentation/visual merchandising by ensuring product recovery, restock (e.g., pant wall, size store), destock, or minor visual merchandizing changes are accomplished.</li><li>Open and close the store in accordance with the opening and closing procedures.</li><li>Understand and adhere to people safety policies and procedures to maintain a safe work environment.</li><li>Perform work in accordance with applicable policies, procedures, and laws or regulations.<br/><br/></li></ul><strong>Budget Responsibility <br/><br/></strong><ul><li>Accountable for delegated aspects of controllable budget and labor hours<br/><br/></li></ul><strong>People Management<br/><br/></strong><ul><li>Leadership role directly responsible for subset of store employees as delegated by Store Manager<br/><br/></li></ul><strong>What We Look For<br/><br/></strong><ul><li>Inclusion &amp; Diversity: Creates/supports an inclusive environment that values/celebrates differences </li><li>Integrity: Behaves in an honest, fair, and ethical manner</li><li>Leadership: Is able and desires to lead and inspire others; motivates, empowers, develops, and directs people as they work </li><li>Guest Experience: Actively creates an inclusive, high-caliber experience and connection for every guest through team members</li><li>Team Building: Creates and develops teams that maximize accomplishments; encourages unique contributions and different perspectives</li><li>Decision Making/Problem Solving: Uses logic and reasoning to evaluate alternatives and make effective, timely decisions</li><li>Strategic Thinking: Sets strategies that are aligned to vision and values of the company to achieve goals/vision/further the mission; considers the 'big picture' implications of decisions</li><li>Change Management Leadership: Leads others through change processes and uncertainty</li><li>Interactive Communication: Conveys information effectively and understands information shared while interacting with others<br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><strong>Eligibility<br/><br/></strong><ul><li>Must be legally authorized to work in the country in which the store is located</li><li>Must have the ability to travel to assigned store with reliable transportation methods<br/><br/></li></ul><strong>Schedule/Availability<br/><br/></strong><ul><li>Work occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays<br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>1 year people management experience</li><li>1 year leadership experience, including experience managing business operations and administration and managing projects or processes<br/><br/></li></ul><strong>Job Assets (i.e., nice to have; not required)<br/><br/></strong><ul><li>Education: High school diploma, GED, or equivalent</li><li>Education: Bachelor’s degree or equivalent</li><li>Experience: 1 year retail or sales specific management experience</li><li>Experience: 1 year recruiting, hiring, or training employees<br/><br/></li></ul><strong>Work Context (e.g., environment, interactions, physical)<br/><br/></strong><ul><li>Work occurs in an environment with bright lights and loud music</li><li>Work is accomplished as part of a team and also independently</li><li>Work may involve managing conflict or mediating problems between others or deescalating guest issues</li><li>Work involves reaching out to meet and build relationships with strangers/new people, and to strengthen existing community partnerships</li><li>Work is sometimes conducted on a computer or other technical devices, including to meet with others virtually</li><li>Work involves moving through a store for most of a shift to help guests and accomplish work, but can also involve sitting for extended periods of time (i.e., more than 1 hour)</li><li>Work may occasionally involve moving boxes weighing up to 30 lbs (13.6 kg)<br/><br/></li></ul><strong>Compensation &amp; Benefits Package<br/><br/></strong>lululemon’s compensation offerings are grounded in a pay-for-performance philosophy that recognizes exceptional team performance. The base pay range for this position is from <strong>$26.26- $35.54/hour</strong> subject to minimum wage in the location. The base pay offered is based on market location and may vary depending on job-related knowledge, skills, experience, and internal equity. This position has a target bonus of an additional <strong>25%</strong>, subject to certain requirements and the Company’s discretion, bringing the total target compensation range between <strong>$32.83- $44.43/ hour</strong>.<br/><br/>At Lululemon, Investing In Our People Is a Top Priority. We Believe That When Life Works, Work Works. We Strive To Be The Place Where Inclusive Leaders Come To Develop And Enable All To Be Well. Recognizing Our Teams For Their Performance And Dedication, Other Components Of Our Total Rewards Offerings Include Support Of Career Development, Wellbeing, And Personal Growth<br/><br/><ul><li>Extended health and dental benefits, and mental health plans </li><li>Paid time off </li><li>Savings and retirement plan matching </li><li>Generous employee discount</li><li>Fitness &amp; yoga classes</li><li>Parenthood top-up</li><li>Extensive catalog of development course offerings </li><li>People networks, mentorship programs, and leadership series (to name a few)<br/><br/></li></ul>Note: The incentive programs, benefits, and perks have certain eligibility requirements. The Company reserves the right to alter these incentive programs, benefits, and perks in whole or in part at any time without advance notice.", "responsibilities": "The Assistant Manager, Guest Experience role is an essential part of the store leadership team, ensuring our team members and guests (i.e., customers) receive a quality experience in our stores every day. Assistant Managers, Guest Experience are responsible for leading from the floor to build, manage, and develop team members. Assistant Managers, Guest Experience create an environment and a team culture where people feel a deep sense of belonging and have the opportunity to grow. As a result, they ensure their team delivers outstanding guest experience in line with company values and directives.", "qualifications": {"required": "Must be legally authorized to work in the country in which the store is located\nMust have the ability to travel to assigned store with reliable transportation methods\nWork occurs on a variable schedule which could include early mornings, mornings, afternoons, evenings, late nights or overnights as well as weekends and holidays\n1 year people management experience\n1 year leadership experience, including experience managing business operations and administration and managing projects or processes", "preferred": "Education: High school diploma, GED, or equivalent\nEducation: Bachelor’s degree or equivalent\nExperience: 1 year retail or sales specific management experience\nExperience: 1 year recruiting, hiring, or training employees"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Extended health and dental benefits, and mental health plans \nPaid time off \nSavings and retirement plan matching \nGenerous employee discount\nFitness &amp; yoga classes\nParenthood top-up\nExtensive catalog of development course offerings \nPeople networks, mentorship programs, and leadership series (to name a few)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989175004"}