{"jobTitle": "Buying Analyst", "company": {"name": "REVOLVE", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst, Sales, and Other", "industry": "Retail Apparel and Fashion", "description": "<strong><u>Meet REVOLVE:</u></strong>\n<p><em>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand, and a go-to online source for discovery and inspiration, we deliver an engaging customer experience from a vast yet curated offering totaling over 45,000 apparel, footwear, accessories and beauty styles. Our dynamic platform connects a deeply engaged community of millions of consumers, thousands of global fashion influencers, and more than 500 emerging, established and owned brands. Through 16 years of continued investment in technology, data analytics, and innovative marketing and merchandising strategies, we have built a powerful platform and brand that we believe is connecting with the next generation of consumers and is redefining fashion retail for the 21st century. For more information please visit www.revolve.com.</em></p><p><br/></p><p>At REVOLVE the most successful team members have a thirst and the creativity to make this the top e-commerce brand in the world. With a team of 1,000+ based out of Cerritos, California we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment. In return, we promise to keep REVOLVE a company where inspired people will always thrive. </p><p><br/></p><p>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or #lifeatrevolve.</p><p><strong>Are you ready to set the standard for Premium apparel?</strong></p><p><br/></p><p><strong><u>Main purpose of the role:</u></strong></p><p>The Buying Analyst is responsible for gathering, analyzing, and interpreting sales data to provide actionable insights to support the buying team in achieving business objectives. This role involves evaluating sales performance, identifying trends, and creating reports to guide strategic decision-making. The Buying Analyst collaborates with various departments to ensure data accuracy and drive continuous improvement in sales processes. </p><p><br/></p><p><strong><u>Major Responsibilities:</u></strong></p><p>Essential Duties and Responsibilities include the following. Other duties may be assigned.</p><p>• Collect, compile, and analyze sales data from various sources</p><p>• Evaluate sales performance by analyzing key metrics such as sales volume, revenue, profitability, and turns</p><p>• Generate regular and ad-hoc reports on sales performance, trends, and projections</p><p>• Identify underperforming areas and suggest actionable strategies to improve sales results</p><p>• Present findings and recommendations in a clear, concise, and actionable manner</p><p><br/></p><p><strong><u>Required Competencies:</u></strong></p><p>To perform the job successfully, an individual should demonstrate the following competencies:</p><p>• An understanding and interest in the contemporary and luxury fashion space</p><p>• Strong organizational skills - ability to manage multiple projects, prioritize, and meet deadlines</p><p>• Ability to communicate clearly and responsibly across a team of multiple analysts</p><p>• Excels in team environments and in building / developing strong interpersonal relationships, while maintaining an individual determination to accomplish goals</p><p>• Ability to demonstrate logical thinking and problem-solving skills multi-tasking, time management, self-motivation, persistence, and takes full ownership of their success</p><p><br/></p><p><strong><u>Minimum Qualifications:</u></strong></p><p>• Bachelor's degree in Business, Economics, Statistics, or a related field</p><p>• Proven experience as a Merchandise Planner or in a similar analytical role (1-3 years)</p><p>• Proficiency in data analysis and utilization of Excel</p><p>• Strong analytical, critical thinking, and problem-solving skills.</p><p>• Excellent communication and presentation abilities.</p><p>• Detail-oriented with a high degree of accuracy in work.</p><p>• Ability to work independently and as part of a team</p><p><br/></p><p><strong><u>Preferred Qualifications:</u></strong></p><p>• Experience in the fashion retail experience</p><p>• Ecommerce experience</p><p>• Interest and knowledge in contemporary, aspiring-luxury, and luxury fashion</p><p><br/></p><p>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day. </p><p>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.</p><p><br/></p><p>A reasonable estimate of the current base hourly/salary range is $75-80K. </p><p><br/></p><p><strong><u>ATTENTION:</u></strong></p><p>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.</p><p></p>", "responsibilities": "• Collect, compile, and analyze sales data from various sources\n• Evaluate sales performance by analyzing key metrics such as sales volume, revenue, profitability, and turns\n• Generate regular and ad-hoc reports on sales performance, trends, and projections\n• Identify underperforming areas and suggest actionable strategies to improve sales results\n• Present findings and recommendations in a clear, concise, and actionable manner", "qualifications": {"required": "• Bachelor's degree in Business, Economics, Statistics, or a related field\n• Proven experience as a Merchandise Planner or in a similar analytical role (1-3 years)\n• Proficiency in data analysis and utilization of Excel\n• Strong analytical, critical thinking, and problem-solving skills.\n• Excellent communication and presentation abilities.\n• Detail-oriented with a high degree of accuracy in work.\n• Ability to work independently and as part of a team", "preferred": "• Experience in the fashion retail experience\n• Ecommerce experience\n• Interest and knowledge in contemporary, aspiring-luxury, and luxury fashion"}, "skills": ["Excel", "Data Analysis", "Sales", "Fashion", "Retail", "Ecommerce", "Communication", "Presentation Skills", "Problem Solving", "Analytical Skills"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989701298"}