{"jobTitle": "LA Galaxy, PR & Communications Manager", "company": {"name": "LA Galaxy", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Musicians, Entertainment Providers, and Advertising Services", "description": "For more than 20 years, AEG has played a pivotal role in transforming sports and live entertainment. Annually, we host more than 160 million guests, promote more than 10,000 shows and present more than 22,000 events around the world. We are committed to innovation, artistry, and community, and leverage the power of our 300+ venues, leading sports franchises, marquee music brands, integrated entertainment districts, premier ticketing platform and global sponsorship activations, to create memorable moments that give the world reason to cheer.<br/><br/>Our business is interwoven with the human mind and heart, and we strive to build a diverse and inclusive company that reflects the artists, athletes, and fans that we host; reach beyond traditional boundaries to support the communities in which we operate; and minimize our impact on the environment by adopting sustainable practices throughout our business operations.<br/><br/>If you want to be challenged to up your game and make a difference, then join us in giving the world reason to cheer!<br/><br/><strong>Job Summary<br/><br/></strong>The PR and Communications Manager works closely with the VP and Director of PR and Communications to develop media relations strategies and plans related to the LA Galaxy and Dignity Health Sports Park's events, to support the company's goals and initiatives, leading to increased brand awareness and builds reputation. In addition, will be responsible for media activities, including identification of new opportunities and feature story ideas, and collaborating with local and national journalist on story content and tracking their release.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Work closely with the VP and Director of PR and Communications to develop and implement comprehensive media relations strategies and plans for LA Galaxy and Dignity Health Sports Park events.</li><li>Lead all front office media activities, including identifying new opportunities and crafting feature story ideas. Responsible for writing and distributing news releases and media advisories, pitching stories to targeted media outlets, and responding to media inquiries</li><li>Manage and execute PR support for the LA Galaxy &amp; Dignity Health Sports Park Foundation and oversee all public relations needs related to these entities.</li><li>Supervise media operations for ancillary events at Dignity Health Sports Park, including matchday preparation and post-match responsibilities. This encompasses managing credentials, photo marshaling, press box operations, media inquiries, and post-match media availabilities.</li><li>Identify and foster relationships with national and local journalists, bloggers, and other influencers to broaden outreach and enhance coverage.</li><li>Oversee and manage outside PR agencies in the development and execution of PR plans for assigned projects, ensuring alignment with corporate goals and objectives and promoting positive exposure for AEG's image and brand.</li><li>Develop and maintain comprehensive editorial calendars, media lists, and asset calendars to ensure coordinated and efficient communications efforts.</li><li>Monitor and track communication metrics and key performance indicators (KPIs), and provide detailed reports to leadership to inform strategic decisions.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>BA/BS Degree (4-year): BA/BS in Public Relations, Marketing, Communications, English or Journalism is preferred)</li><li>4-6 years of related work experience in communications</li><li>2-4 years of supervisory experience</li><li>Prior supervisory experience</li><li>Excellent written, verbal, and interpersonal communication skills, including the ability to professionally communicate and interact with all levels of management, staff, etc.</li><li>Must be self-directed and reliable in planning and completing of tasks</li><li>Detail-oriented, highly organized with an ability to think clearly under pressure and manage multiple tasks and projects simultaneously</li><li>Ability to perform in a fast-paced environment and adapt to change without notice</li><li>Understanding of media monitoring and analytics tools</li><li>Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook), Adobe Creative Suite, including PhotoShop, InDesign and ability to lean other business systems as necessary</li><li>Ability to travel and work flexible hours, on numerous weekends, and on various holidays, due to the nature of professional sports</li><li>Team player with professional demeanor demonstrating responsibility, initiative and dependability, all with positive attitude</li><li>High ethical standards and strong sense of confidentiality</li><li>Ability to speak, read, and write in Spanish Preferred (but not required)<br/><br/></li></ul><strong>Pay Scale:</strong> $75,000- $80,000<br/><br/>AEG reserves the right to change or modify the employee’s job description whether orally or in writing, at any time during the employment relationship. AEG may require an employee to perform duties outside their normal description.", "responsibilities": "The PR and Communications Manager works closely with the VP and Director of PR and Communications to develop media relations strategies and plans related to the LA Galaxy and Dignity Health Sports Park's events, to support the company's goals and initiatives, leading to increased brand awareness and builds reputation. In addition, will be responsible for media activities, including identification of new opportunities and feature story ideas, and collaborating with local and national journalist on story content and tracking their release.", "qualifications": {"required": "BA/BS Degree (4-year): BA/BS in Public Relations, Marketing, Communications, English or Journalism is preferred)\n4-6 years of related work experience in communications\n2-4 years of supervisory experience\nPrior supervisory experience\nExcellent written, verbal, and interpersonal communication skills, including the ability to professionally communicate and interact with all levels of management, staff, etc.\nMust be self-directed and reliable in planning and completing of tasks\nDetail-oriented, highly organized with an ability to think clearly under pressure and manage multiple tasks and projects simultaneously\nAbility to perform in a fast-paced environment and adapt to change without notice\nUnderstanding of media monitoring and analytics tools\nProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook), Adobe Creative Suite, including PhotoShop, InDesign and ability to lean other business systems as necessary\nAbility to travel and work flexible hours, on numerous weekends, and on various holidays, due to the nature of professional sports\nTeam player with professional demeanor demonstrating responsibility, initiative and dependability, all with positive attitude\nHigh ethical standards and strong sense of confidentiality\nAbility to speak, read, and write in Spanish Preferred (but not required)", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "salary": {"amount": "75,000.00- 80,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989282079"}