{"jobTitle": "Business Analyst - Insurance Operations – REMOTE", "company": {"name": "WAHVE LLC", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Staffing and Recruiting", "description": "Put your Insurance Experience to work - FROM HOME! At WAHVE, we value significant insurance experience and want to revolutionize the way people think about phasing into retirement by offering qualified candidates the opportunity to continue their career working from home. As we say - retire from the office but not from work. Our unique platform provides you with real work/life balance and allows you to customize your own work schedule while continuing to utilize your insurance expertise in a remote, long-term position which includes company benefits! What You’ll Love About Wahve We created a welcoming place to work with friendly and professional leadership. We are known for the great care we take with our staff and our clients. We are passionate and determined about delivering the best customer service, preserving insurance industry knowledge, and making a difference by the work that we do. What We Are Seeking We have assignments available to help our insurance carrier or MGA clients in Operations Business Analyst positions. Responsibilities may include: Liaise with various operational areas such as underwriting, accounting, compliance, audit, information technology, etc. Translate conceptual customer requirements into functional requirements in a clear manner that is comprehensible to technicians. Become proficient managing multi-state, multi-line accounts throughout the policy life cycle which could include rating/pricing, quoting, and issuing policies as well as handling related account activity. Participate and understand the development of operational KPI’s and service standards. Process transactions and follow varied workflows dependent upon line of business, company, state, specific rules, and regulations. Ability to analyze and interpret various bureaus (ISO, AAIS, and/or NCCI) and/or company proprietary rate, rules, and forms - preferred but not required. High demand for current knowledge of Cyber, Technology Errors and Omissions, and/or Privacy/Security Liability. TO BECOME A WORK-AT-HOME VINTAGE EXPERT, WE REQUIRE 25 years of full-time work experience 10 recent years of insurance industry experience. Benefits Of Becoming a Wahve Vintage Expert Health insurance based on eligibility. 401(k) with a 4% match. Retire from the office but not from work. Eliminate the office stress and the commute. Choose the work you would like to do now. Customize your schedule - full or part time. Utilize your years of insurance industry knowledge. Be part of our dynamic yet virtual team environment and connect with other experienced insurance professionals like yourself! How To Get Started Click APPLY NOW to complete our simple preliminary profile. Be sure to include your preferred contact information as one of our Qualification Specialists will connect with you promptly. WE LOOK FORWARD TO MEETING YOU!", "responsibilities": "Liaise with various operational areas such as underwriting, accounting, compliance, audit, information technology, etc. Translate conceptual customer requirements into functional requirements in a clear manner that is comprehensible to technicians. Become proficient managing multi-state, multi-line accounts throughout the policy life cycle which could include rating/pricing, quoting, and issuing policies as well as handling related account activity. Participate and understand the development of operational KPI’s and service standards. Process transactions and follow varied workflows dependent upon line of business, company, state, specific rules, and regulations. Ability to analyze and interpret various bureaus (ISO, AAIS, and/or NCCI) and/or company proprietary rate, rules, and forms - preferred but not required. High demand for current knowledge of Cyber, Technology Errors and Omissions, and/or Privacy/Security Liability.", "qualifications": {"required": "25 years of full-time work experience, 10 recent years of insurance industry experience", "preferred": "Ability to analyze and interpret various bureaus (ISO, AAIS, and/or NCCI) and/or company proprietary rate, rules, and forms - preferred but not required."}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Health insurance based on eligibility, 401(k) with a 4% match, customize your schedule - full or part time, utilize your years of insurance industry knowledge.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3989284409"}