{"jobTitle": "Game Material Coordinator", "company": {"name": "Sony Pictures Entertainment", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "23.56/hr - 31.25/hr", "currency": "USD"}, "jobFunction": "Administrative and Design", "industry": "Entertainment Providers", "description": "The Game Material Coordinator is a vital member of the Jeopardy! the graphics production team, responsible for logging and managing assets as well as creating visually engaging content for the nation’s top-rated quiz show, Jeopardy! Working under the guidance of the Segment Producer and Senior Designer, the Game Material Coordinator plays a crucial role in the organization and creation of visual material that enhances the viewer experience.", "responsibilities": "Support the Production Process\nTrack and organize files, manage assets, and prepare material for production\nAssist with project coordination and document preparation, ensuring all deadlines are met efficiently\nContribute to Team Organization\nMaintain and organize the design team, including managing file systems and asset libraries to ensure accessibility and efficiency\nCollaborate on Creative Development\nBrainstorm ideas and develop concepts collaboratively with the team\nTransform creative visions into tangible visual assets that align with the show's aesthetic and brand\nAssist with Image Editing\nUtilize Photoshop for photo editing, retouching, and image manipulation to enhance visual content", "qualifications": {"required": "Highly organized with excellent time management skills and a proven ability to meet deadlines consistently\nStrong proficiency in Adobe Creative Suite, particularly in Photoshop, with knowledge of After Effects and/or Premiere considered a plus\nDetail-oriented with the ability to multitask effectively while maintaining strict attention to detail\nExcellent communication and interpersonal skills, with the ability to collaborate effectively in a team environment\nDemonstrated design sense and the ability to translate concepts into visually appealing content\nCreative thinker with a passion for exploring new ideas and pushing creative boundaries", "preferred": ""}, "skills": ["Photoshop", "Adobe Creative Suite", "After Effects", "Premiere"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "At Jeopardy! We foster a collaborative and dynamic work environment where creativity and innovation thrive. As part of our team, you'll have the opportunity to contribute to an iconic television show while working alongside passionate and talented individuals. We offer competitive compensation packages, opportunities for professional development, and access to exclusive events and experiences.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989713691"}