{"jobTitle": "Supply Chain Analyst II, Transportation (Variable Shift)", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>In addition to the responsibilities listed below, this position is responsible for ensuring proper maintenance by scheduling vehicle inspection, maintenance and repairs with some guidance; investigating vehicle accidents, interviewing drivers and any third parties involved with some supervision; filing, reviewing, and guiding others in the filling of accident reports; initiating vehicle reassignments and replacements, with some direction; receiving complaints regarding maintenance of vehicles, resolving standard issues; maintaining the maintenance systems database, with some guidance; managing drivers to meet safety, performance, and regulatory expectations by scheduling daily driving assignments to guarantee coverage for all routes and updating driver schedules, with some guidance; conducting dispatch instruction to drivers to communicate customer needs, with some direction; addressing traffic problems, such as construction areas, accidents, congestion, weather conditions, or other hazards to drivers, under some supervision; receiving questions, problems, or requests from drivers and resolving standard issues; instructing drivers to ensure high on-time delivery performance and fleet profitability with some guidance; training drivers to ensure compliance with driver safety procedure, following some directions; operating vehicle fleet dispatcher services by reviewing list of available drivers and equipment to match to a load plan and start time, with some directions; scheduling standard delivery with drivers; coordinating transportation schedules, with some instructions; performing standard communications with drivers throughout shifts, recording driver/equipment location and job status; resolving standard transportation issues (e.g., damaged products); and monitoring regular contact with team members and drivers regarding matters of operational concern.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Pursues effective relationships with others by sharing resources, information, and knowledge with coworkers and members. Listens to, addresses, and seeks performance feedback. Pursues self-development; acknowledges strengths and weaknesses based on career goals and takes appropriate development action to leverage / improve them. Adapts to and learns from change, challenges, and feedback; demonstrates flexibility in approaches to work. Assesses and responds to the needs of others to support a business outcome. </li><li>Completes work assignments by applying up-to-date knowledge in subject area to meet deadlines; follows procedures and policies, and applies data and resources to support projects or initiatives with limited guidance and/or sponsorship. Collaborates with others to solve business problems; escalates issues or risks as appropriate; communicates progress and information. Supports the completion of priorities, deadlines, and expectations. Identifies and speaks up for ways to address improvement opportunities. </li><li>Performs asset accounting tasks by: performing support tasks to guide, transfers and disposals, with some guidance; recording dispositions in the accounting system with some guidance; implementing policies and procedures to achieve accountability for the misuse of assets with some guidance; and identifying cost reduction opportunities. </li><li>Ensures ongoing quality customer services by: resolving standard customer issues pertaining to vendors/suppliers reporting, billing, and merchandise with some guidance; resolving standard backorder problems, delivery delays, repairs, customer concerns, and returns; processing product returns for credit or exchange and recalls with some guidance; and preparing reports (e.g., key metrics, cost and daily analysis) to customers with some guidance. </li><li>Ensures adequate levels of inventory are maintained by: resolving standard problems in the receipt, coordinating the distribution of inventory, and administering transactions and requests for supplies, equipment, and services, with some guidance; conducting quantitative/qualitative analyses to forecast demand to minimize obsolescence or expiration with oversight by others; maintaining automated inventory and ordering systems to support standard inventory reconciliation, using standard strategies; confirming standard reorder levels are updated, maintained, and adhered to so that proper product rotation remains valid, and inventory levels are accurate; and working collaboratively with others in the broader organization to maintain the inventory control system (e.g., ensure accuracy of product line, proper level of stock, rotation of product, cleanliness of product/carts). </li><li>Maintains and improves supply chain and operations by: supporting standard activities (i.e., shipping logistics, carrier, and inventory system evaluation) to optimize, maintain, and transform current processes for increased efficiency; supporting the implementation of research plans to identify new/existing business operating models according to supply chain future state functional and technical design; and, with others in the broader organization, supporting processes to determine end-to-end sourcing, procurement, and logistics. </li><li>Exercises purchasing strategy that is consistent with the overall national sourcing strategy by: facilitating standard purchase requests and sourcing substitute items if needed immediately by requesting department; providing information for purchase standardization, quality, amounts, or equivalency; and resolving standard purchase-related problems and implementing cost savings procedures, with some guidance. </li><li>Complies with state and federal regulations, and company policy/procedures pertaining to purchasing, inventory management, and distribution by: applying best standards, practices, and enforcing relevant guidelines (e.g., parking and shuttle); soliciting quotations for new stock and non-standard items to ensure compliance, and fulfilling routine contracts with some guidance; producing standard reports for compliance monitoring (e.g., Joint commission, Sarbanes-Oxley [SOX]) and audits with some guidance; implementing corrective action and resolving deficiencies as necessary on a timely basis and in accordance with company policy with some guidance; and administering programs of information, collecting data, training, and education for managers/product users on standards programs, product selection, and expected compliance with some guidance. </li><li>Manages suppliers/vendors performance and relationships by: resolving problems and communicating with suppliers/vendors, ensuring they comply with policies and regulations, with some guidance; supporting the onboarding of new suppliers/vendors and supporting contract administration with suppliers/vendors, with some guidance; assisting with corrective actions based on needs identified from audits with some guidance; resolving standard suppliers/vendor issues; and facilitating business reviews to ensure suppliers/vendors meet operational and cost targets with some guidance. </li><li>Provides technical analysis and reporting services for others by: supporting analyses and preparing results on utilization, quality, inventory levels, and courier routes for standard projects; administering customer service survey tools to assess satisfaction levels and collect feedback for quality improvement, with some guidance; leveraging tools, techniques, and assumptions to ensure standard analyses are appropriate to support operational and business decisions; and preparing reports in response to business needs for selected departments documenting standard analytical results. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Minimum one (1) year of experience with databases and spreadsheets. </li><li>Bachelors degree in Business Administration, Economics, Finance, Material Management, Operations Research, or related field OR Minimum three (3) years of experience in Materials and Inventory Control/Management, Logistics, Finance, Distribution, or a directly related field.</li></ul>", "postedDate": "2 weeks ago", "url": "https://www.linkedin.com/jobs/view/3990776330"}