{"jobTitle": "Business Analyst, CS Workforce Management", "company": {"name": "Netflix", "location": "Los Gatos, CA"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00/yr - $190,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is one of the world’s leading entertainment services with over 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>The Business Analyst in Workforce Management plays a critical role in analyzing and optimizing workforce strategies to improve efficiency, productivity, and customer service. This position involves conducting data analysis, developing forecasting models, and collaborating with various departments to ensure optimal staffing levels, resource allocation, and enhanced customer service outcomes. Additionally, the Business Analyst will support strategic planning initiatives, with a focus on BPO global outsourcing and headcount planning.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Collect, analyze, and interpret complex data sets related to workforce metrics to identify trends, patterns, and correlations that inform business decisions.</li><li>Create and maintain workforce forecasting models that predict future staffing needs, focusing on customer service demands.</li><li>Develop new methodologies to improve data analysis and predictive modeling. </li><li>Develop and maintain global headcount plans, ensuring alignment with business objectives and market demands.</li><li>Analyze performance trends and feedback to identify areas for improvement in workforce management.</li><li>Monitor and report on KPIs, ensuring alignment with workforce management strategies.</li><li>Develop reports, visualizations, and presentations to communicate strategic findings and present these insights as recommendations to key stakeholders to aid business decisions.</li><li>Work closely with Finance and Operations teams to conduct cost-benefit analysis on initiatives designed to maximize the CS organization’s performance while achieving business objectives and customer service goals.</li><li>Facilitate cross-functional meetings to discuss workforce planning, resource allocation, and customer service improvements.<br/><br/></li></ul><strong>Qualifications And Competencies<br/><br/></strong><ul><li>Minimum of 3-5 years of experience in business analysis, workforce management, finance, customer service, or a related field.</li><li>Proven experience with data analysis, predictive forecast modeling, and customer service metrics.</li><li>Experience in strategic planning, BPO outsourcing, and global headcount planning is highly desirable.</li><li>Strong analytical and problem-solving skills.</li><li>Proficiency in data analysis using tools such as Excel and SQL</li><li>Excellent written communication, presentation and interpersonal skills.</li><li>Ability to work independently and as part of a team.</li><li>Strong understanding of customer service principles and metrics.</li><li>Knowledge of strategic planning frameworks and tools.</li><li>Familiarity with BPO practices and vendor management.</li><li>Understanding of global workforce dynamics and planning.</li><li>Experience using data visualization tools such as [Tableau, Power BI] to create compelling visualizations and reports.<br/><br/></li></ul><em>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/></em>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $190,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "The Business Analyst in Workforce Management plays a critical role in analyzing and optimizing workforce strategies to improve efficiency, productivity, and customer service. This position involves conducting data analysis, developing forecasting models, and collaborating with various departments to ensure optimal staffing levels, resource allocation, and enhanced customer service outcomes. Additionally, the Business Analyst will support strategic planning initiatives, with a focus on BPO global outsourcing and headcount planning.", "qualifications": {"required": "Minimum of 3-5 years of experience in business analysis, workforce management, finance, customer service, or a related field.\nProven experience with data analysis, predictive forecast modeling, and customer service metrics.\nStrong analytical and problem-solving skills.\nProficiency in data analysis using tools such as Excel and SQL\nExcellent written communication, presentation and interpersonal skills.\nAbility to work independently and as part of a team.\nStrong understanding of customer service principles and metrics.\nKnowledge of strategic planning frameworks and tools.\nFamiliarity with BPO practices and vendor management.\nUnderstanding of global workforce dynamics and planning.\nExperience using data visualization tools such as [Tableau, Power BI] to create compelling visualizations and reports.", "preferred": "Experience in strategic planning, BPO outsourcing, and global headcount planning is highly desirable."}, "skills": ["Data Analysis", "Predictive Modeling", "Customer Service Metrics", "Excel", "SQL", "Strategic Planning", "BPO Outsourcing", "Global Headcount Planning", "Tableau", "Power BI"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3990122580"}