{"jobTitle": "Remote Territory Manager - Must Live in Los Angeles", "company": {"name": "CyberCoders", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Legal", "industry": "Construction", "description": "<strong>Job Title: </strong>Territory Manager (Roofing Industry)<br/><br/><strong>Location:</strong> Los Angeles, CA (Remote and Traveling to meetings); Must be OK with training onsite in Irvine, CA first 2 months<br/><br/><strong>Salary: </strong>$70,000 - $80,000 Annual Base Salary; OTE $150,000 and up (Uncapped Commissions); Medical, Dental, and Vision Benefits; PTO; 401K with match; FSA; Life Insurance; PTO; Vehicle; Credit Card for business expenses; Laptop<br/><br/><strong>Requirements:</strong> 2+ years with B2B Sales; Outside sales experience; Working directly with Board Members; Working with sales larger than 25K (One sale could be 100K and up); Drivers License<br/><br/><strong>Position Overview<br/><br/></strong>We are a <strong>well-known construction company</strong> that has been around for <strong>30+ years in Southern California</strong> and specializes in services to homeowner associations roofing services.<br/><br/>We recently are looking for an<strong> energetic</strong> <strong>Territory Manager in Los Angeles</strong>! As a Territory Manager, you will spearhead sales of repair, maintenance, waterproofing, and re-roofing services within our existing customer base and expand our reach through your own lead generation. This role involves a mix of phone and in-person sales calls, preparing and delivering presentations, participating in board meetings, and hosting client-focused events. Your top-notch communication and presentation skills will be crucial in engaging with clients and stakeholders.<br/><br/>We are looking for someone who is <strong>ambitious and loves sales but also has everyone's best interest at heart</strong>! We are a <strong>fun, supportive team</strong> that is open to helping each other out. We value a strong culture fit and ability to learn more than many years of experience- but if you have both than you ae a perfect fit!<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Utilize Salesforce software to track new and repeat clients</li><li>Find strong opportunities for the company</li><li>Completed 24 hour of videos for training in the roofing industry and role</li><li>Meet with key decision makers to present to our company for client's key needs and criteria via zoom, in person or onsite at a project </li><li>Prepare presentations to support proposals</li><li>Obtain client exposure through luncheons, entertainment events, board meetings, serving on a CAI committee and lunch and learn presentations</li><li>Collaborate with Sales Assistant to make sure client relationship data is up to date and accurate in Salesforce</li><li>Assist finance with past due invoices from clients</li><li>Regular checks in with managers we sold to to make sure it is completed and client is happy </li><li>Communicate issues with jobs in the field or scheduling to Manager for resolution</li><li>Schedule and attend weekly lunches with managers and key decision makers to build relationships</li><li>Communicate what is sold during the meetings and share the information with productions team so they can deliver proper items that we promised during meetings</li><li>Prepare proper information for monthly review with executive team</li><li>Attend board meetings for any projects or communities that are using us or considering partnering with us</li><li>Help put simple proposals together during rainy season (busiest season) to assis influx of estimate requests as needed<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>2+ years with B2B, outside sales</li><li>Construction Industry (Preferred)</li><li>Ability to work with modern office technology such as computer, printers, copiers, etc</li><li>Utilize Windows - Excel, Word, PowerPoint, Outlook, and OneNote</li><li>Valid driver's license and reliable transportation<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health, Dental, and Vision Insurance</li><li>Life Insurance</li><li>FSA</li><li>PTO</li><li>Referral Program</li><li>401K with matching</li><li>Potential for Bonuses and Commissions</li><li>Pet Insurance</li><li>Wellness Programs </li><li>CPR Programs &amp; Trainings<br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>wendy.warner@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : WW2-1813449L705 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Wendy Warner - Lead Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.<br/><br/>", "responsibilities": "<ul><li>Utilize Salesforce software to track new and repeat clients</li><li>Find strong opportunities for the company</li><li>Completed 24 hour of videos for training in the roofing industry and role</li><li>Meet with key decision makers to present to our company for client's key needs and criteria via zoom, in person or onsite at a project </li><li>Prepare presentations to support proposals</li><li>Obtain client exposure through luncheons, entertainment events, board meetings, serving on a CAI committee and lunch and learn presentations</li><li>Collaborate with Sales Assistant to make sure client relationship data is up to date and accurate in Salesforce</li><li>Assist finance with past due invoices from clients</li><li>Regular checks in with managers we sold to to make sure it is completed and client is happy </li><li>Communicate issues with jobs in the field or scheduling to Manager for resolution</li><li>Schedule and attend weekly lunches with managers and key decision makers to build relationships</li><li>Communicate what is sold during the meetings and share the information with productions team so they can deliver proper items that we promised during meetings</li><li>Prepare proper information for monthly review with executive team</li><li>Attend board meetings for any projects or communities that are using us or considering partnering with us</li><li>Help put simple proposals together during rainy season (busiest season) to assis influx of estimate requests as needed<br/><br/></li></ul>", "qualifications": {"required": "2+ years with B2B Sales; Outside sales experience; Working directly with Board Members; Working with sales larger than 25K (One sale could be 100K and up); Drivers License", "preferred": "Construction Industry"}, "skills": ["Salesforce", "Sales", "Presentation Skills", "Communication", "Client Relationship Management", "Microsoft Excel", "Microsoft Word", "Microsoft PowerPoint", "Microsoft Outlook", "Microsoft OneNote"], "postedDate": "1 day ago", "benefits": "Medical, Dental, and Vision Benefits; PTO; 401K with match; FSA; Life Insurance; PTO; Vehicle; Credit Card for business expenses; Laptop", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3990917755"}