{"jobTitle": "Information Security Analyst (Remote)", "company": {"name": "SMBC MANUBANK", "location": "Los Angeles, CA", "industry": "Banking"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$73,000.00 - $93,000.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Banking", "description": "<strong>About The Organization<br/><br/></strong>SMBC MANUBANK was formed by a group of banking entrepreneurs in June 1962. Our scope is to serve the specialized needs of California middle-market businesses, manufacturers, wholesalers, distributors, importers, exporters, and service companies, including small businesses and professionals.<br/><br/>The anticipated salary range for this role is between $73,000.00 and $93,000.00. The specific salary offered to an applicant will be based on their individual qualifications, experiences, and an analysis of the current compensation paid in their geography and the market for similar roles at the time of hire. The role may also be eligible for an annual discretionary incentive award. In addition to cash compensation, SMBC offers a competitive portfolio of benefits to its employees.<br/><br/>Our mission is to be \"the bank of choice\" for middle market and professional service companies by establishing long term customer relationships and loyalty, providing superior products and services through a core of highly skilled and seasoned bankers.<br/><br/>To achieve our mission to be the 'bank of choice' for middle market and professional services companies, we are focused on our vision to be the premier California regional business bank that can provide the sophistication and expertise of a larger institution with the personal 'high touch' services of a smaller bank.<br/><br/><strong>Specialties<br/><br/></strong>Commercial Loans and Lines of Credit, Asset-Based Financing, SBA Loans, and Specialized Financing, Real Estate Loans, Cash Management Services, International Services<br/><br/><strong>Summary<br/><br/></strong>Information Security Analysts, under supervision, will support the day-to-day administration and operations of the Bank’s Information Security program by performing a broad spectrum of activities. Information Security Analysts must be able to quickly and accurately interpret actionable signals, intelligence, alerts, requests, and directives to make sure appropriate actions are being performed across the identify, protect, detect, respond, and recover phases of the program. The analyst will assist in the support additionally support projects, research, and other administrative tasks as deemed necessary by Information Security management.<br/><br/><strong>Principal Duties &amp; Responsibilities<br/><br/></strong><ul><li>Monitor and respond to security alerts, escalations, and open tickets as part of the programs continuous monitoring strategy.</li><li>User administration and account management including defining, entitling, assessing, and removing access from employees based on job function.</li><li>Configuration and validation that bank systems security controls such as encryption, password policies, and logging are appropriate and operating effectively.</li><li>Will assist in documenting risk, control, and technical documents to assist in consistent management of the program.</li><li>Research and brief management on emerging threats, bulletins, and other threat </li><li>intelligence activities as assigned. Support audit requests by obtaining documentation and responding to inquiries.</li><li>Perform other duties as assigned, including projects, incident response, and business continuity events.</li><li>Represent the department and/or be able to lead projects on behalf of the department.<br/><br/></li></ul><strong>Position Specifications<br/><br/></strong><ul><li>Education: Bachelor’s degree or equivalent </li><li>2+ years of experience in Information Security </li><li>Relevant certifications including Security+, PenTest+, CySa+, CASP+, CISM, CISA, CISSP, GSEC, CEH, OSCP, CCSP, SSCP, is desirable. </li><li>Familiarity with NIST CSF, CIS Critical Security Controls, CRI PROFILE, FFIEC Handbooks &amp; CAT, GLBA, or other information security frameworks / standards. </li><li>Strong verbal and written communication skills </li><li>Highly developed sense of personal accountability and follow-through skills </li><li>High collaborative and strong teamwork mentality<br/><br/></li></ul><strong>EOE STATEMENT<br/><br/></strong>We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.<br/><br/><strong>CCPA DISCLOSURE<br/><br/></strong>Personal Information Collection Notice: This notice contains information under the California Consumer Privacy Act (CCPA) about the categories of personal information (PI) of California residents that SMBC MANUBANK collects and the business or commercial purpose(s) for which the PI may be used. We do not sell PI. More information about our collection and use of PI may be found in our CCPA Privacy Policy at https://www.smbcmanubank.com/privacy/ccpa-disclosure. Persons with disabilities may contact our Customer Contact Center toll-free at (877) 560-9812 to request the information in this Notice in an alternative format.", "responsibilities": "Information Security Analysts, under supervision, will support the day-to-day administration and operations of the Bank’s Information Security program by performing a broad spectrum of activities. Information Security Analysts must be able to quickly and accurately interpret actionable signals, intelligence, alerts, requests, and directives to make sure appropriate actions are being performed across the identify, protect, detect, respond, and recover phases of the program. The analyst will assist in the support additionally support projects, research, and other administrative tasks as deemed necessary by Information Security management.", "qualifications": {"required": "Education: Bachelor’s degree or equivalent \n2+ years of experience in Information Security \nRelevant certifications including Security+, PenTest+, CySa+, CASP+, CISM, CISA, CISSP, GSEC, CEH, OSCP, CCSP, SSCP, is desirable. \nFamiliarity with NIST CSF, CIS Critical Security Controls, CRI PROFILE, FFIEC Handbooks & CAT, GLBA, or other information security frameworks / standards. \nStrong verbal and written communication skills \nHighly developed sense of personal accountability and follow-through skills \nHigh collaborative and strong teamwork mentality", "preferred": ""}, "skills": ["Security+", "PenTest+", "CySa+", "CASP+", "CISM", "CISA", "CISSP", "GSEC", "CEH", "OSCP", "CCSP", "SSCP", "NIST CSF", "CIS Critical Security Controls", "CRI PROFILE", "FFIEC Handbooks & CAT", "GLBA", "Information Security", "Communication"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3990857783"}