{"jobTitle": "Event Coordinator", "company": {"name": "Schaffer", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Events Services", "description": "<strong>Summary/Objective</strong>\nPossess a good knowledge/understanding of the local catering market including the wedding, corporate and social markets. Creativity and passion are essential. Work is performed in an office and venue environment that is very fast paced. Role requires the ability to multi-task and complete tasks in a timely and accurate manner. The event coordinator must be very organized, personable and enthusiastic. The Event Coordinator represents the company to our clients and other business partners, and as such must comport themselves with the highest level of professionalism and customer service. The Event Coordinator is responsible for generating all documents needed to produce all items on the event contract as sold by the Sales Manager.\n<br/>\n<strong>Essential Functions</strong>\n<br/>\n•        Creates BEO’s for distribution of assigned events. Responsible for follow-up circulation and timely communication with proper departments.\n•        Attends walkthroughs and assign the best placement for catering execution including kitchen location(s), scullery, service stations, guest seating options, etc.\n•        Creates rental orders for all event elements needed including kitchen equipment, serving vessels, etc.\n•        Creates Pack Sheet for internal items. \n•        Prescribes service flow and layout for different types of services (plated serve outs, buffet and station service, family style service, etc).\n•        Creates accurate station layout diagrams. \n•        Communicates event details with all departments and is comfortable discussing food, beverage and service elements with various department heads. \n•        Coordinates and organizes travel, accommodations, transportation and itinerary for out of town events while managing a budget.\n*Must be able to commute to Los Angeles office site daily.", "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990093138"}