{"jobTitle": "Manager, Strategy & Operations", "company": {"name": "Modern Animal", "industry": "Veterinary Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $140,000.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Veterinary Services", "description": "Modern Animal is looking for an analytical, high horsepower, and collaborative individual to join our Experience team. As a team, we are responsible for the end to end journey of Modern Animal members, including member strategy and experience and our omnichannel business lines. Reporting directly to the Director of Experience, you will be the Strategy & Operations lead for our omnichannel business lines, which currently include virtual care and pharmacy. You will work deeply with Product, Engineering, Operations, Analytics, and Finance to enable growth, improve profitability, drive operational excellence, and influence the progression of our business.", "responsibilities": "Own Strategy & Operations for our omnichannel business lines: analyze operational/financial data, strategize risks and opportunities, and quarterback the execution of your ideas. Unlock meaningful growth in our pharmacy business, partnering with Product, Engineering, Finance, and Brand to test and learn and make it a truly best-in-class experience. Drive labor management and forecasting, growth and monetization for our virtual care business, collaborating closely with Virtual Care Operations to ideate and execute. Lead as the operational champion of our most complex omnichannel workflows (prescriptions, diagnostics testing, and more), working at the intersection of Product, Virtual Care, and Clinic Operations to drive continuous improvements and simplicity as we scale. Quarterback cross-functional launches of new product lines and additional revenue expansion opportunities, setting the bar for execution cross-functionally.", "qualifications": {"required": "3+ years of experience in a high performance culture, whether in consulting, tech, investment banking/private equity, or related. Strong business and financial acumen, outstanding critical thinking skills, and ability to work with data and people to identify opportunities.", "preferred": "Based in San Francisco or Los Angeles, or willing to relocate."}, "skills": ["Analytical skills", "Business acumen", "Financial acumen", "Critical thinking", "Data analysis", "Project management", "Communication skills"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "A sign-on bonus and equity grant units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990241737"}