{"jobTitle": "Project Coordinator", "company": {"name": "Ledgent Technology", "industry": "Amusement Parks and Arcades", "size": "Not specified", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Amusement Parks and Arcades", "description": "Seeking Top Talent in Glendale, CA: Our Clients Need Qualified Candidates! Respond promptly and accurately to new screening requests and stakeholder inquiries. Process virtual screener requests independently, ensuring compliance with audience confidentiality requirements through documented signatures. Evaluate current processes and identify opportunities for efficiency improvements. Assist in onboarding third-party supply chain vendor personnel for high-security projects, managing communications, online training, and application license setup. Generate monthly reports summarizing support activities and providing insights into security impacts on key titles.", "responsibilities": "Respond to screening requests and stakeholder inquiries promptly and accurately. Independently process virtual screening requests, ensuring compliance with confidentiality requirements through required document signatures. Evaluate processes and identify opportunities for improvement and efficiency. Facilitate onboarding of third-party supply chain vendor personnel for high-security projects. Manage communication, online training assignments, and application license setup. Develop monthly reports summarizing support activities and security impact on key titles.", "qualifications": {"required": "Minimum 1 year of administrative experience, preferably in media & entertainment or related fields. Strong project management skills, ability to multitask against deadlines. Independent worker with exceptional time management skills. Detail-oriented, highly organized, capable of managing high-volume inbox and prioritizing responses. Experience handling confidential information and time-sensitive assignments. Comfortable learning new software applications. Working knowledge of Microsoft Office suite and Google Apps. Strong business writing and executive communication skills.", "preferred": "Strong interpersonal skills, comfortable interacting with professionals at all levels. Project coordination/management experience. Proficiency in Excel (pivot tables) and Office suite. Experience in data and ad hoc reporting. Flexibility to provide off-hours support."}, "skills": ["Project Management", "Communication", "Time Management", "Microsoft Office", "Google Apps"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990079023"}