{"jobTitle": "Area Manager", "company": {"name": "SUGARED + BRONZED", "industry": "Retail", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000 - 85,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "SUGARED + BRONZED revolutionized airbrush tanning with a proprietary solution and revived an all-natural, ancient Egyptian form of hair removal called sugaring. S+B is a one-stop shop to prepare for any vacation, wedding, red carpet event — or to simply feel like your best self. We’re extremely passionate about providing exceptional services in beautiful, upbeat, and welcoming spaces that make your appointment something to look forward to!", "responsibilities": "Effectively communicating and executing new operational initiatives in your locations, Driving KPIs and service excellence in each location, Attract, hire, and retain a diverse team of top talent, Responsible for shop level utilization- monitoring demand + labor trends and staffing accordingly for specific locations, Maintaining and managing scheduling + booking softwares, Working shifts alongside Managers through weekly store visits, Lead with managers and associate development through training, feedback, coaching, performance reviews, growth planning, and individual development plans., Ensure new and ongoing training for Store Directors, including brand and category education, for continuous professional development and sales performance., Creating a warm, fun + friendly environment for all Team Members + clients alike", "qualifications": {"required": "2-3 years of multi-unit management experience in a retail or salon environment, A passion for the beauty industry (esthetics/cosmo experience preferred, but not required), An interest in growing with S+B, A positive attitude that cultivates a great work environment for all, Open + flexible (full time) availability, Travel between designated region", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Quarterly bonuses for personal and regional performance, Competitive benefits package including health insurance, dental insurance, vision insurance, 401K with company match, and paid vacation and holidays., Complimentary Sugaring + Tanning services + Products. Get ready for the glow, Opportunities for future role mobility and professional development.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990993922"}