{"jobTitle": "District Manager", "company": {"name": "Public Storage", "location": "Northridge, CA"}, "location": "Northridge, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Real Estate", "description": "<strong>Job Description<br/><br/></strong><strong>Lead, Manage and Develop People, Brand Ambassador &amp; Operational Excellence<br/><br/></strong><strong>Lead An Engaged Team<br/><br/></strong><ul><li>Recruit, motivate and retain a dedicated team of customer facing customer front line employees</li><li>Drive your team with effective communication and provide coaching on customer service and sales strategies<br/><br/></li></ul><strong>Brand Ambassador &amp; Operational Excellence<br/><br/></strong><ul><li>Managing physical assets including repair and maintenance systems and processes, vendor management and cleaning standards.</li><li>Oversee delinquent tenant processes including auctions by coaching your team to reduce delinquency rates and improve customer retention.</li><li>Conduct monthly property audits and ensure operational standards and safety compliance are met.<br/><br/></li></ul><strong>Deliver Outstanding Customer Service<br/><br/></strong><ul><li>Provide a welcoming and well-maintained environment to customers through your team, effective facility maintenance and vendor management</li><li>Address customer inquiries and concerns promptly in a professional manner<br/><br/></li></ul><strong>Grow And Maintain a Robust Business<br/><br/></strong><ul><li>Drive business forward using analytics to identify trends, develop and implement strategies to capitalize on opportunities in your district.</li><li>Communicate effectively with customers, colleagues and team-members<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>$121,000 first year annual total compensation award opportunity including base, guaranteed bonus (paid quarterly), and restricted stock units.</li><ul><li>Second year bonus potential increase to $20,000 performance-based bonus</li><li>Participation in company stock program that includes dividends paid quarterly</li></ul><li>Internal promotional and career opportunities throughout the United States</li><li>Extensive training and coaching plans – we want you to succeed!</li><li>Comprehensive group healthcare programs</li><li>401(k) with generous employer match</li><li>Paid time off</li><li>Monday thru Friday work schedule</li></ul>", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3990992519"}