{"jobTitle": "Sr. Business Systems Analyst", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Your New Role...<br/><br/></strong>This Sr. Business System Analyst position will work with the Product Manager Solution Architect and end users to ensure the delivery of Consumer Product applications that meet the business needs and align with the business and technology strategic vision<br/><br/><strong>Your Role Accountabilities...<br/><br/></strong><strong>Business Analysis &amp; Change Mgmt </strong>This role will develop and maintain deep domain expertise of the Monetization &amp; Studio Tech application portfolio for Consumer Products, DC Comics, and WB Games and collaborate with various team members to understand the product roadmaps from requirements gathering and design through the development cycles. They will understand the release schedule to help coordinate change management activities that align with the technology roadmap. This role will work with Change Management Lead &amp; Training Leads to define and execute change management and training plans effectively sharing information with stakeholders throughout the project life cycle. Develop and deploy user adoption/training initiatives to support change related to technology implementations. 40%<br/><br/><strong>Documentation: </strong> This role is responsible for change management, testing and training plans as well as all associated deliverables. This role should create best-in-class templates that can be leveraged by Product Teams (Product Mangers &amp; Business Analysts) across multiple technology initiatives. 60%<br/><br/><strong>Qualifications &amp; Experiences...<br/><br/></strong><ul><li>Bachelor’s degree and 4+ years of relevant experience</li><li>Strong customer service, problem solving, organizational and conflict management skills.</li><li>Exercise mature judgment and make independent decisions in accordance with established policies, rules, and procedures.</li><li>Excellent organizational skills</li><li>Proven ability to learn new business processes and systems quickly.</li><li>Ability to explain system functionality to end user</li><li>Provide input, documenting requirements and supporting the design and delivery of change management and training deliverables</li><li>Develop and deploy user adoption/training initiatives to support change related to project implementations</li><li>Define and execute communication strategies to effectively share information with stakeholders throughout the project life cycle</li><li>Experience with OCM models, tools and frameworks to support improved organizational adoption of new technology enabled business processes.</li><li>Attention to detail; is thorough when performing work and conscientious about attending to detail.</li><li>Self-driven and have demonstrated the ability to work independently with minimum guidance.</li><li>Proven experience working the Technical Project Managers and Product Manger to develop and implement following tech strategy deliverables:</li><ul><li>Stakeholder Analysis</li><li>Internal &amp; External Communications/Outreach Plans</li><li>Testing &amp; Training Plan</li><li>User Adoption Metrics Tracker and intervention plan to increase adoption as necessary.</li><li>In-app adoption tools (i.e., WalkMe)</li><li>System FAQs<br/></li></ul></ul><strong>Not Required But Preferred Experience...<br/><br/></strong><ul><li>Media &amp; Entertainment Experience</li><li>Consumer Product Interactive Entertainment or Publishing Operations experience<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $83,090.00 - $154,310.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "This Sr. Business System Analyst position will work with the Product Manager Solution Architect and end users to ensure the delivery of Consumer Product applications that meet the business needs and align with the business and technology strategic vision", "qualifications": {"required": "Bachelor’s degree and 4+ years of relevant experience, Strong customer service, problem solving, organizational and conflict management skills., Exercise mature judgment and make independent decisions in accordance with established policies, rules, and procedures., Excellent organizational skills, Proven ability to learn new business processes and systems quickly., Ability to explain system functionality to end user, Provide input, documenting requirements and supporting the design and delivery of change management and training deliverables, Develop and deploy user adoption/training initiatives to support change related to project implementations, Define and execute communication strategies to effectively share information with stakeholders throughout the project life cycle, Experience with OCM models, tools and frameworks to support improved organizational adoption of new technology enabled business processes., Attention to detail; is thorough when performing work and conscientious about attending to detail., Self-driven and have demonstrated the ability to work independently with minimum guidance., Proven experience working the Technical Project Managers and Product Manger to develop and implement following tech strategy deliverables:, Stakeholder Analysis, Internal &amp; External Communications/Outreach Plans, Testing &amp; Training Plan, User Adoption Metrics Tracker and intervention plan to increase adoption as necessary., In-app adoption tools (i.e., WalkMe), System FAQs", "preferred": "Media &amp; Entertainment Experience, Consumer Product Interactive Entertainment or Publishing Operations experience"}, "skills": [], "postedDate": "57 minutes ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "salary": {"amount": "83,090.00 - 154,310.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3990926459"}