{"jobTitle": "Supervisor de Operaciones de Almacén", "company": {"name": "NFI", "industry": "Transportation, Logistics, Supply Chain and Storage", "size": "Not specified", "location": "Eastvale, CA"}, "location": "Eastvale, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "El Supervisor de Operaciones de Almacén es responsable de la operación diaria eficiente del almacén con especial énfasis en la supervisión del personal del almacén y el logro de los objetivos de producción diarios.", "responsibilities": "Desarrolla e implementa asignaciones y cronogramas de trabajo de envío y recepción para garantizar operaciones efectivas y eficientes para cumplir con los objetivos. Brinda supervisión directa al personal del almacén que combina las habilidades y los antecedentes del personal con el trabajo requerido. Supervisa todos los envíos entrantes y salientes para garantizar que sean correctos y se lleven a cabo de manera oportuna. Garantiza que el equipo se utilice de la manera más eficiente. Coordina el mantenimiento de los equipos con la gerencia. Revisa el objetivo de trabajo diario y determina los requisitos de productividad para producir durante el turno para cumplir con los objetivos generales del edificio. Se asocia con otros líderes para equilibrar el trabajo asegurando niveles adecuados de dotación de personal. Redacta y envía el informe diario de fin de turno. Hace recomendaciones a la gerencia sobre iniciativas y programas para mejorar las operaciones y trabaja en esos programas. Lleva a cabo las reuniones diarias previas al turno que cubren la productividad de los turnos anteriores, los problemas operativos, la carga de trabajo prevista y cualquier otra información pertinente de la empresa. Ayuda en el desarrollo de un programa para capacitar y motivar al personal para una mayor eficacia. Ayuda a desarrollar un programa para todo el personal nuevo y garantiza que se siga el programa de incorporación. Administra y mantiene buenas prácticas de recursos humanos con informes directos y el cumplimiento de las políticas y procedimientos corporativos y departamentales establecidos. Trabaja con la Gerencia y Recursos Humanos para resolver problemas de relación con los empleados, medidas disciplinarias, resolución de problemas y despidos. Brinda retroalimentación, entrenamiento, orientación y reconocimiento para mejorar el desarrollo de habilidades del personal. Desempeña un papel activo en el desarrollo de los empleados y la selección de talentos. Brinda entrenamiento regular y comentarios constructivos sobre el desempeño, prepara y entrega revisiones de desempeño por hora. Mantiene registros precisos de cronometraje. Muestra un compromiso con el autodesarrollo al mantenerse al día con la información, las herramientas y los sistemas. Viaja a otros almacenes y participa en reuniones del departamento o de la empresa, según sea necesario.", "qualifications": {"required": "Licenciatura en Cadena de Suministro, Negocios o campo relacionado, o al menos 1-5 años de experiencia en supervisión. Se requiere diploma de escuela secundaria. Experiencia con sistemas de gestión de almacenes (preferiblemente Manhattan). Capacidad para trabajar en un entorno acelerado y que cambia rápidamente. Habilidad para manejar prioridades cambiantes y usar el buen juicio en situaciones estresantes. La experiencia con fuerzas de trabajo estacionales es una ventaja, pero no es un requisito. Experiencia o deseo de aprender métricas de rendimiento, mejora de procesos y herramientas Lean/Six Sigma. Conocimiento práctico de las aplicaciones de Microsoft Office. Conocimiento práctico del almacén / equipo mecánico. Conocimiento práctico de las regulaciones de OSHA, DOT, HAZMAT, FDA y la voluntad de obtener la certificación en una o más de estas áreas según sea necesario. Excelente gestión del talento y habilidades de trabajo en equipo. Excelentes habilidades de comunicación verbal, no verbal y escrita. Excelentes habilidades de servicio al cliente específicamente con clientes externos. Excelentes habilidades analíticas y matemáticas. Preferiblemente bilingüe inglés/español, puede ser necesario en algunos lugares. Capacidad y disponibilidad para trabajar horas irregulares o extendidas, incluidas noches, fines de semana y días festivos, según lo necesite el cliente. Debe poder pararse/caminar hasta por 10-12 horas. Levante y mueva bolsas de hasta 50 libras. Flexiones, levantamientos, estiramientos y alcances regulares tanto por debajo de la cintura como por encima de la cabeza. Caminar en el centro de distribución y en los alrededores con mucha frecuencia; Las instalaciones tienen más de un cuarto de milla de largo. Debe ser capaz de trabajar en entornos con niveles de ruido, condiciones de iluminación y variación de temperatura variables y poder acceder a todas las áreas del edificio sin limitaciones.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Los empleados también son elegibles para un sólido programa de beneficios, que incluye cobertura médica, dental, oftalmológica, de medicamentos recetados, plan 401k, programa de bienestar, seguro de vida, tiempo libre remunerado y licencia parental remunerada, entre otras opciones de planes de beneficios.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990998250"}