{"jobTitle": "Project Specialist II", "company": {"name": "L.A. Care Health Plan", "industry": "Hospitals and Health Care", "size": "N/A", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "N/A", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$67,186.00/yr - $107,498.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Hospitals and Health Care", "description": "Established in 1997, L.A. Care Health Plan is an independent public agency created by the state of California to provide health coverage to low-income Los Angeles County residents. We are the nation’s largest publicly operated health plan. Serving more than 2 million members, we make sure our members get the right care at the right place at the right time. Mission: L.A. Care’s mission is to provide access to quality health care for Los Angeles County's vulnerable and low-income communities and residents and to support the safety net required to achieve that purpose.", "responsibilities": "The Project Specialist II is responsible for assisting the project manager and/or management with various tasks related to the department projects. This position also provides administrative support related to projects. Provides regular support to complete project functions in support of project manager and teams. Creates and maintains project timelines with buy-ins from key stakeholders. Conducts research and analysis to identify the project scope, objectives and requirements. Develops project plans work plans and schedules for multiple projects. Checks that the strategy laid out by the project manager is being adhered. Works with immediate manager to identify resources need for projects and define roles and responsibilities for the resources. Identifies, defines and develops reporting systems that accurately represent the status of projects. Ensures that project documents are continuously up to date to allow each project team to assess the current state of their project in relation to timelines and deliverables. Effectively prioritizes work and meet deadlines while managing multiple competing tasks. Completes timely high quality work that is key to the company initiatives and business units. Works with Business Units to ensure that subject matter experts are available to the project teams when necessary. Ensures the project deliverables remain within scope and meet the needs of business units. Works with Business units to facilitate the development of business cases to complex projects. Analyzes work plans and project documents to ensure that the project will meet the stated deliverables of requesting department. Works with the documentation specialist to facilitate the updating of relevant policies and procedures. Spots knowledge and training gaps and recommends actions to resolve them. Organizes and facilitates meetings or sessions and documents outcomes. Perform other duties as assigned.", "qualifications": {"required": "Minimum of 4 years documented experience working with multiple complex projects. Prior experience in managing multiple schedules and work plans is required.", "preferred": "At least 7 years of experience managing healthcare related projects and deliverables within a Health Plan setting. Previous work in a managed care environment serving Medicare, Medical or commercial population desired. Experience working within healthcare. Prior experience working with databases with expertise in maintaining and querying the databases are highly desired."}, "skills": ["Excellent verbal and written communication and organizational skills", "Excellent organizational skills", "Ability to interact with internal and external stakeholders at all levels", "Ability to prioritize workload, and effectively manage competing priorities", "Apply critical thinking in anticipating problems and providing creative alternative solutions to improve processes", "Must be detail-oriented with strong accuracy and analytical skills", "Ability to work in a fast-paced, multi-task oriented team environment", "Intermediate knowledge of Microsoft applications (Word, Excel, Project, PowerPoint, Visio)", "Must have excellent follow through on actionable items; analysis, synthesis, and problem solving skills deductive and inductive thinking skills", "Ability to assimilate and articulate simple business solutions and project approach", "Ability to create and manage budgets"], "postedDate": "16 hours ago", "applicationDeadline": "N/A", "benefits": "Paid Time Off (PTO), Tuition Reimbursement, Retirement Plans, Medical, Dental and Vision, Wellness Program, Volunteer Time Off (VTO)", "remoteWork": "N/A", "url": "https://www.linkedin.com/jobs/view/3990896907"}