{"jobTitle": "Data Analyst - Insurance - REMOTE", "company": {"name": "WAHVE LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "<strong><em>Put your Insurance Experience to work - FROM HOME!<br/><br/></em></strong>At <strong>WAHVE</strong> we value significant insurance experience and want to revolutionize the way people think about <strong><em>phasing into</em> <em>retirement</em></strong> by offering qualified candidates the opportunity to continue their career working from home. As we say - <strong><em>retire from the office but not from work</em></strong>. Our unique platform provides you with <em>real</em> work/life balance and allows you to customize your own work schedule while continuing to utilize your insurance expertise in <strong><em>a remote, long-term position which includes company benefits! <br/><br/></em></strong><strong>What You’ll Love About Wahve<br/><br/></strong>We created a welcoming place to work with friendly and professional leadership. We are known for the great care we take with our staff and our clients. We are passionate and determined about delivering the best customer service, preserving insurance industry knowledge, and making a difference by the work that we do.<br/><br/><strong>What We Are Seeking<br/><br/></strong>We have assignments available to help our <em>insurance industry</em> clients in <strong>Data Analyst positions. Responsibilities include:<br/><br/></strong><ul><li>Build and maintain data warehouse, new reports, and ad hoc reports. </li><li>Work with user groups to identify reporting issues/enhancements and document business requirements. </li><li>Will serve as a member of a project team and/or work independently on projects. </li><li>Support and train internal users as needed. </li><li>Compile and prepare data for customer analysis. </li><li>Experience in C#, Visual Studio, JavaScript, CSS, and current web technologies such as .NET, ASP, JSON, and XML. </li><li>Experience with ANY of the following technologies: SQL Server Reporting Services (SSRS), SSIS Reporting, Power BI, Dynamics CRM, Dynamics GP, Share point, Excel, Power Query, Power Pivot. </li><li>Ability to compile data results and author commentary on industry studies is a plus. </li><li>Insurance or financial services industry experience required. <br/><br/></li></ul><strong>TO BECOME A WORK-AT-HOME VINTAGE EXPERT, WE REQUIRE<br/><br/></strong><ul><li>25 years of full-time work experience</li><li>Experience working in a data analysis role in the insurance or financial services industry - required<br/><br/></li></ul><strong>Benefits Of Becoming a Wahve Vintage Expert<br/><br/></strong><ul><li>Health insurance based on eligibility. </li><li>401(k) with a 4% match. </li><li>Retire from the office but not from work. </li><li>Eliminate the office stress and the commute. </li><li>Choose the work you would like to do now. </li><li>Customize your schedule - full or part time. </li><li>Utilize your years of insurance industry knowledge. </li><li>Be part of our dynamic yet virtual team environment and connect with other experienced insurance professionals like yourself!<br/><br/></li></ul><strong>How To Get Started<br/><br/></strong>Click <strong><em>APPLY NOW</em></strong> to complete our simple preliminary profile. Be sure to include your preferred contact information as one of our Qualification Specialists will connect with you promptly.<br/><br/><strong>WE LOOK FORWARD TO MEETING YOU!</strong>", "skills": ["C#", "Visual Studio", "JavaScript", "CSS", ".NET", "ASP", "JSON", "XML", "SQL Server Reporting Services", "SSRS", "SSIS Reporting", "Power BI", "Dynamics CRM", "Dynamics GP", "Share point", "Excel", "Power Query", "Power Pivot"], "postedDate": "3 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3990464123"}