{"jobTitle": "Senior Project Manager - Security", "company": {"name": "Paladin Technologies", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "IT Services and IT Consulting", "description": "The Senior Project Manager role at Paladin is a position created to oversee the more complex projects we have. These jobs include projects with significant project value or projects involving two or more departments. The Project Manager will have control over assigned projects and is responsible for managing each project from initiation to close out. The position requires a person that is professional, knowledgeable, and dedicated. This position is an exempt position and may require after hours and weekend work.<br/><br/><strong>GENERAL ACCOUNTABILITIES:</strong>", "responsibilities": "Represent Company in a business-like professional manner in both conduct and appearance, to maximize client satisfactionMaintain knowledge of current industry standards and emerging technologies as well as the latest products and services offered by the Company.Available to work outside of, or in addition to, normal businesses hours.Work in compliance with the Company’s polices and procedures including safety manual with safety of self and others in mind at all times.Maintain and protect assigned Company assets.Accurate written record keeping, submitted on time and complete,Prepare proposals, RFP’s, and/or assist with bid proposals that: identify and distinguish the features/benefits of the Company, meet Company GPM, and operational requirements.Develop and implement an assertive methodology for follow-up communication and proposal generation of all prospects.Complete Sales Order, scope, plans, and other project documentation timely, in accordance with Company procedures, and within applicable contract requirements.Solicit equipment upgrades, replacement projects, and/or Company promotions for existing clients.Identify Client security requirements and effectively communicate the Company’s applicable services and products to meet those requirements.Assist in the selling of Service Contracts to existing Clients and 2nd year Service Contracts for system upgrades/replacements.Present final contract to Client for signature and ensure requirements such as deposit retainer, appropriate taxes, invoicing information, and project information are complete.Plans and schedules engineering, installation, and subcontracting activities on projects or service installed jobs.Prepares, implements, and manages project installation plan and procedures.Coordinates the procurement of materials, supplies and services and controls timely delivery to job site.Determines necessary changes in design, contract price, installation plan or other activity and implements same.Maintains construction schedule and coordinates task scheduling with other trades.Monitors the performance and quality of the field labor including selection and monitoring of the performance and quality of contract labor.Effective communication with all stakeholders on project progress, escalating issues as needed to Operations Manager Maintains accurate records of job status, changes, material flow and other:Routinely walks job sites to ensure quality installation of Company productsImplements quality assurance program to continuously improve customer satisfactionPresent a professional image of Company when speaking to customers (all levels)Develops a relationship with the decision maker of our customerResponsible for customer satisfaction on projectsEnsures proper job management and cost control Supervises the preparation of base data required for monthly project invoicingMonitors time logged to projects by all resourcesMonitors project invoices and receipts for accuracy and validity.Identify project problems, develop and implement plans to assure project profitability while providing exceptional customer service and communication to all stakeholders.Responsible for Completing As-BuildsResponsible for completing all paperwork, POs are all completed, Notice of Completions (NOC) is sent, and jobs are turned over to ServiceJob is 100% billed and revenue is taken, Job close out report is completedAbility to work in a high volume atmosphereAbility to solve practical problems and carry out responsibilities under minimal supervision.Ability to organize workload for effective implementation, including the ability to multi-task while under deadlines or time constraintsExcellent interpersonal skills including customer service skillsAbility to write simple correspondence and present information in one-on-one and small group situations.Ability to interact effectively at all levels and across diverse cultures.Ability to function as an effective team member.Ability to adapt as the external environment and organization evolves.Has a strong knowledge of engineering fundamentals, security system functions and operations. Good subcontracting skills required. An understanding of job financial reports and the ability control costs in the handling of projects.", "qualifications": {"required": "Minimum of 8years of experience working within the low voltage industry6 years of experience within project management, security integration or field experience", "preferred": "Minimum of 8years of experience working within the low voltage industryMinimum of an Associate’s degree (2 year)PMI certifiedAdditional industry certifications (AVIXA or BICSI)"}, "skills": ["Project Management", "Security", "Engineering", "Low Voltage", "Subcontracting", "Cost Control", "Customer Service", "Communication", "Teamwork", "Adaptability"], "postedDate": "3 weeks ago", "benefits": "Colleagues and their families are covered by medical, dental, vision, company provided basic life insurance and AD&amp;D and short-term disability, telemedicine &amp; virtual counseling. Voluntary insurances offered include life insurance and AD&amp;D, short-term disability (buy-up option), long-term disability, accident, critical illness, and hospital indemnity insurance, and HSA &amp; FSA accounts. Colleagues may also enroll in the company’s 401(k) plan. Colleagues will also receive PTO (paid time off), sick leave, and 7 paid holidays.", "salary": {"amount": "$100,000-$150,000", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990118105"}