{"jobTitle": "Manager, Communications", "company": {"name": "Hourglass Cosmetics", "industry": "Personal Care Product Manufacturing", "size": "51-200 employees", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Personal Care Product Manufacturing", "description": "HOURGLASS COSMETICS — Manager, Communications Connected by creativity and driven by purpose. Hourglass Cosmetics is a vegan and cruelty-free beauty brand, redefining luxury cosmetics with high-performance products, innovative formulas, and award-winning franchises. Recognized by Forbes, Fast Company and Time Magazine as one of the most inventive beauty companies, Hourglass leads the industry with its breakthrough products and its commitment to animal welfare. Founded in 2004, Hourglass is globally available in 32 markets and 2,600 doors including Sephora, Ulta, Bergdorf Goodman, Nordstrom, Space NK and more. Hourglass became part of the Unilever Prestige division in 2017. Discover more about the Hourglass brand story and mission on our website hourglasscosmetics.com. In this role, you will assist the Communications team in driving brand awareness and building brand equity for Hourglass Cosmetics through strategic external and internal communications, compelling storytelling, brand experiences and events. Reporting into the Director, Communications, you will support the development and execution of the global PR strategy, with a focus on growing share of voice in the U.S. market. You will work closely with our U.S. PR team and agencies day-to-day to maximize best-in-class earned media coverage, elevate our positioning in the industry, and grow new audiences for the brand. In addition, you will contribute to the development and management of an internal communications plan to share news and announcements within the Hourglass organization. This is an exciting opportunity to learn and expand your skillset within the field of PR and Communications for a prestigious, global luxury beauty brand. The ideal candidate is a strong writer, has a well-rounded knowledge of the media landscape, an interest in brand storytelling, and experience in beauty and lifestyle industry. Success in this role requires an ability to thrive in a fast-paced culture.", "responsibilities": "Assist with creating compelling PR launch strategies and materials for all new product launches including key messages, launch event concepts, media strategy, talent and make-up artist briefs, etc. Support the creation of all global PR materials including press releases, PR mailers, toolkits, asset packs, press sheets, talent briefs and event concepts / guidelines. Coordinate and track gifting and seeding to Media, VIPs and MUA’s to build our community and foster new relationships on behalf of the brand. Day-to-day administrative support for agency partners in building strong media relationships and securing best in-class media placements in lifestyle, business, beauty and industry/trade outlets. Contribute to the planning of any major events and PR activations, including new market and retailer openings, and larger brand moments. Collaborate with the Brand Marketing team on campaign development and go-to market activation planning. Help with the development and management of internal communications plan, inclusive of drafting newsletter content, internal announcements, thought leadership events. Maintain and execute content calendar to support Hourglass LinkedIn.", "qualifications": {"required": "Minimum 4 years in PR or Communications experience in beauty or related industry. Experience with Microsoft Office Suite and Smartsheet. Extremely detailed oriented and organized. Strong communicator and proactive problem solver. Must be able to work from Corporate Office at least 60% of the time.", "preferred": ""}, "skills": ["PR Strategy", "Media Relations", "Content Creation", "Event Planning", "Internal Communications", "Brand Storytelling", "Microsoft Office Suite", "Smartsheet"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "In addition to base salary, Hourglass Cosmetics offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990425440"}