{"jobTitle": "Project Manager, QC Operations, Prime Video Global Operations", "company": {"name": "Prime Video & Amazon MGM Studios", "industry": "Entertainment Providers", "size": "Not specified", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$58,500.00 - $125,100.00", "currency": "USD"}, "jobFunction": "Project Management, Management, and Product Management", "industry": "Entertainment Providers", "description": "Prime Video (PV) brings together the world’s best creators with the most passionate communities in a way that no other entertainment brand can. Not only are we a one-stop hub for distinctive, critically-acclaimed and award-winning original programming including TV series such as The Boys, The Marvelous Mrs. Maisel and Jack Ryan and movies like Air, Saltburn, The Idea of You, and Road House, but we offer a multi-dimensional experience that allows subscribers to fully immerse themselves in their fandom: to read the book, to listen to the soundtrack, to buy the costume, to replay live sports in real time, and more. And that breadth and connection to the Amazon family of brands, along with the support of a passionate and diverse global team, makes Prime Video a company where creators and makers of all kinds can build their future.\n\nJoining the Prime Video Global Operations team as a Project Manager for Localization Quality Control (QC), you will play a crucial role in enhancing our product’s global reach and appeal, working on behalf of customers around the globe. Your responsibilities will include driving project-specific objectives, managing quality control initiatives, and ensuring the successful delivery of projects that align with Prime Video's global business priorities in the US. Your role will be pivotal in converting program goals into practical project plans, directly enhancing the customer experience and contributing to our commitment to operational excellence.", "responsibilities": "Project Leadership: Manage the delivery of straightforward product marketing strategies and their measurement, facilitating progress, identifying blockers, and increasing the visibility of issues, to ensure milestones and deliverables meet our high standards and stakeholder expectations. Data Management & Reporting: Oversee the collection, analysis, and reporting of key performance indicators (KPIs) to ensure data integrity and relevance. Leverage analytics to extract insights that bolster project goals. Craft and deliver comprehensive reports on customer experience quality, resource distribution, and vendor efficacy, ensuring clear communication with all stakeholders. Vendor Management: Oversee vendor training, monitor performance against metrics and SLAs, and conduct regular performance reviews. Operational Excellence: Recommend and promote best practices and improvements to quality control processes, customer journeys, and team tools to elevate product marketing execution. This includes the creation and maintenance of SOPs and Style Guides. Stakeholder Management: Collaborate with internal and external stakeholders to define project requirements, provide updates, and gather feedback, ensuring alignment and satisfaction. Risk Management: Identify and mitigate potential project risks to ensure seamless execution and delivery.", "qualifications": {"required": "Experience using data and metrics to measure impact and determine improvements; 2+ years of non-internship project management experience", "preferred": "Bachelor’s degree in Business Administration, Project Management, or a related field; Project management experience in quality control, localization, the technology sector, a creative agency or entertainment studio; Understanding of global operations and the nuances of delivering content to an international audience; Exceptional communication and interpersonal skills, capable of managing cross-functional teams and engaging with stakeholders at all levels; Strong analytical skills, with a keen eye for detail and the ability to process and analyze significant data volumes; Ability to adapt to changing priorities and manage multiple projects simultaneously in a fast-paced environment."}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $58,500/year in our lowest geographic market up to $125,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990431225"}