{"jobTitle": "HR Business Partner (Fixed Term)", "company": {"name": "Snap Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Software Development", "description": "Snap Inc is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are Snapchat, a visual messaging app that enhances your relationships with friends, family, and the world; Lens Studio, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses, Spectacles.<br/><br/>The People Team drives our values of being kind, smart and creative across Snap's global workforce. We work together to empower our teams to hire thoughtful and passionate innovators, help people do their best work, grow their careers and build healthy and productive workspaces in a safe, and cohesive community. Together, we are Talent, Total Rewards, IDEA, HR Tech, People Analytics, People Operations, People Services, Council, Learning &amp; Development, Employer Brand and Employee Relations.<br/><br/>We’re looking for an HRBP to join the People Team! This is a 12-month Fixed Term opportunity.<br/><br/>What you’ll do:<br/><br/><ul><li>Serve as the key HR leader supporting various teams across multiple locations</li><li>Partner with stakeholders to ensure employee and business needs are met, focusing on organizational design, change leadership, and talent management in a rapidly growing company</li><li>Recommend, develop, and implement new HR processes as required to grow the business</li><li>Influence business and talent initiatives that support our short and long-term business goals, including driving practices that enable high performance and operational excellence</li><li>Provide counsel and guidance on complex employee matters </li><li>Act as an executive coach for key clients and leaders; hold a high bar for leadership values and behaviors</li><li>Influence and/or deploy practices to increase employee engagement and satisfaction</li><li>Model and reinforce our cultural values of being kind, smart, and creative <br/><br/></li></ul>Knowledge, Skills &amp; Abilities:<br/><br/><ul><li>Experience influencing and advising executive leadership on talent and employment matters</li><li>Experience with people data analytics; ability to influence with data</li><li>Ability to coach leaders on personal and team development</li><li>Ability to prioritize workload and self-manage projects; demonstrates initiative and manages multiple, competing priorities</li><li>Experience in HRLDP or similar development program experience</li><li>Experience providing HR business partner support to engineering, technical, and/or design teams</li><li>Experience designing and deploying HR systems and processes</li><li>Experience with core HR domains, including performance management, organizational design, talent management, compensation, and employee relations<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Bachelor’s degree in human resource management or related field or equivalent years of experience</li><li>5+ years HR related experience<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>HR experience in a tech start-up or high growth company</li><li>Knowledge of and experience with Snap Inc products<br/><br/></li></ul>If you have a disability or special need that requires accommodation, please don’t be shy and provide us some information.<br/><br/>\"Default Together\" Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office 4+ days per week.<br/><br/>At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. EOE, including disability/vets.<br/><br/>Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!<br/><br/><strong>Compensation<br/><br/></strong>In the United States, work locations are assigned a pay zone which determines the salary range for the position. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. The starting pay may be negotiable within the salary range for the position. These pay zones may be modified in the future.<br/><br/>Zone A (CA, WA, NYC):<br/><br/>The base salary range for this position is $126,000-$189,000 annually.<br/><br/>Zone B:<br/><br/>The base salary range for this position is $120,000-$179,000 annually.<br/><br/>Zone C:<br/><br/>The base salary range for this position is $107,000-$161,000 annually.", "responsibilities": "<ul><li>Serve as the key HR leader supporting various teams across multiple locations</li><li>Partner with stakeholders to ensure employee and business needs are met, focusing on organizational design, change leadership, and talent management in a rapidly growing company</li><li>Recommend, develop, and implement new HR processes as required to grow the business</li><li>Influence business and talent initiatives that support our short and long-term business goals, including driving practices that enable high performance and operational excellence</li><li>Provide counsel and guidance on complex employee matters </li><li>Act as an executive coach for key clients and leaders; hold a high bar for leadership values and behaviors</li><li>Influence and/or deploy practices to increase employee engagement and satisfaction</li><li>Model and reinforce our cultural values of being kind, smart, and creative <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s degree in human resource management or related field or equivalent years of experience</li><li>5+ years HR related experience<br/><br/></li></ul>", "preferred": "<ul><li>HR experience in a tech start-up or high growth company</li><li>Knowledge of and experience with Snap Inc products<br/><br/></li></ul>"}, "skills": ["HR", "Talent Management", "Organizational Design", "Change Leadership", "Employee Relations", "Performance Management", "Compensation", "Executive Coaching", "HR Business Partner", "HRBP", "HR Systems", "HR Processes", "Data Analytics", "Tech Start-up", "High Growth Company", "Snap Inc Products"], "postedDate": "3 weeks ago", "benefits": "Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!", "remoteWork": "No", "salary": {"amount": "107,000.00 - 161,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3990448263"}