{"jobTitle": "Vice President of Sales", "company": {"name": "Jeeter - a DreamFields Brand", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Sales and Business Development", "industry": "Manufacturing", "description": "<strong>Job Title: </strong>Vice President of Sales<br/><br/><strong>Department: </strong>Sales<br/><br/><strong>Reports to: </strong>Chief Sales Officer<br/><br/><strong>Effective Date: </strong>7/18/2024<br/><br/><em>DreamFields</em><strong><em> </em></strong><em>is one of the top 5</em> cannabis companies in the industry through our leading #1 pre-roll brand, <em>Jeeter</em><strong><em>. </em></strong>The company is very passionate about producing world-class marketing, high quality, innovative products, delivering unprecedented customer experiences, having cutting-edge operations, and curating an amazing company culture &amp; thriving work environment. With over 1500+ employees we are proud to be one of the most loved employers in the industry. The company continues to experience exponential month-over-month growth as one of the fastest-growing companies in the cannabis industry and we have begun our aggressive national expansion to all the legalized cannabis states in the USA.<br/><br/><strong>Job Summary<br/><br/></strong>The Vice President of Sales will be responsible for developing and executing our sales strategies, driving revenue growth, and expanding our market share. Reporting directly to the Executive Team, The Vice President of Sales will lead a skilled sales team, foster a collaborative and customer-centric sales culture, and optimize sales operations for maximum efficiency and success.<br/><br/><strong>Primary Responsibilities<br/><br/></strong><ul><li>Sales Strategy Development: Collaborate with the executive team to formulate a comprehensive sales strategy tailored to the Cannabis industry. Conduct market research, assess customer needs, and analyze competitors to identify new opportunities and revenue streams.</li><li>Owns the development and execution of an annual national strategy to grow the sales volume. And improve costs in line with budgetary constraints.</li><li>Sales Team Leadership: Lead, mentor, and motivate the sales team to achieve and exceed sales targets. Provide guidance, training, and ongoing support to enhance their skills and professional development.</li><li>Revenue Growth: Establish ambitious sales goals, monitor sales metrics and KPIs, and implement effective sales forecasting and planning processes.</li><li>Customer Relationship Management: Cultivate and maintain strong relationships with key customers and strategic partners.</li><li>Sales Process Optimization: Continuously improve the sales process to enhance productivity and streamline workflows. While Identifying opportunities for automation and implementing tools to improve efficiency.</li><li>Market Expansion: Identify and pursue opportunities to expand our market presence. Evaluate potential partnerships, acquisitions, or collaborations to accelerate growth.</li><li>Reporting and Analysis: Regularly analyze sales data and performance metrics to provide insights to the executive team. Present comprehensive sales reports and updates to drive informed decision-making.</li><li>Sales Training and Development: Organize and execute training programs to enhance the sales team's expertise in Flexible Packaging. Foster a culture of continuous learning to stay abreast of industry trends and best practices.</li><li>Budget Management: Collaborate with the finance department to develop and manage the sales budget. Ensure responsible spending while achieving sales objectives.</li><li>Manage local Account Executives with the goal of meeting/exceeding revenue, prospecting, and new business targets</li><li>Oversee advertising sales activities in the assigned market; is accountable for achieving/ exceeding targeted advertising sales revenues for the market and for controlling sales expenses</li><li>Drive results through others, manage team performance, and hold the team accountable against business metrics</li><li>Direct sales activities and processes that generate new business and deepen existing relationships</li><li>Obtain, allocate, and adjust operations resources to achieve sales and service goals</li><li>Oversee management of available advertising inventory to drive the most profitable sales</li><li>Review and adjust sales territories and assigned call lists</li><li>Work with marketing and finance to understand and model pricing and customer sensitivities for both floor and ceiling product pricing</li><li>Identify where improvements can be made, develop sales plans, and strategies to achieve sales goals.</li><li>Manage all quota and capacity planning in partnership with finance and sales leadership, including territory planning, quota planning, capacity planning, and compensation planning</li><li>Provide objective sales forecasting based on insights from pipelines and attainment, including \"in the moment\" updates, tracking historical data, and seasonality to provide accurate insights to the broader organization</li><li>Find and scale best practices, including identification and monitoring of meaningful metrics to drive sales efficiency, identifying and filling gaps</li><li>Liaising with product and marketing teams to develop sales training programs, materials, and plans, ensuring that all representatives understand product, pricing, and motion of sales</li><li>Assess current operating processes and business model relative to the dynamics of the current market and position</li><li>Actively partner to drive new models around sales tools and support to ensure efficiency and consistency in coaching, performance, and reporting<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor's degree in business administration, marketing, or a related field. </li><li>5 + years' experience at an Executive Level in sales </li><li>Proven work experience as a VP of Sales or a similar role</li><li>In-depth knowledge of selling strategies and methods, as well as employee motivation techniques</li><li>Extensive experience in strategic sales planning, market analysis, and customer relationship management </li><li>Strong analytical and critical thinking skills, with a data-driven approach to decision-making.</li><li>Entrepreneurial mindset with a passion for innovation and driving business growth.</li><li>Ability to thrive in a fast-paced, dynamic environment and adapt to evolving market conditions.</li><li>Experience in the manufacturing industry.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Advanced Degree: MBA or Masters in human resources, Business Administration, or related field<br/><br/></li></ul><strong>Ability To Travel/relocate<br/><br/></strong><ul><li>Greater Los Angeles Area: Reliably commute or planning to relocate before starting work (Required)</li><li>Ability to travel up to 50%<br/><br/></li></ul><strong>EEOC:</strong> DreamFields is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status.", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3990453177"}