{"jobTitle": "Data Product Analyst", "company": {"name": "Capital Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "\"I can succeed as a Data Product Analyst at Capital Group.\"<br/><br/>As a Data Product Analyst, you will identify customer needs and take responsibility to define features to meet them. Once their product has launched, you will collaborate with the Data Product Manager, data governance, architects, and data engineers to measure product and business metrics to increase adoption and drive business value. You are the voice of the customer within the data product organization. You will work with other teams to unblock roadblocks, escalate to senior leadership when necessary.<br/><br/>\"I am the person Capital Group is looking for.\"<br/><br/><ul><li>You have 3+ years of Data Analysis experience, preferably in Business-to-Business or Financial Services industry.</li><li>You must have experience with SQL. Experience with python is a plus.</li><li>You must have experience with database query languages like SQL, and familiarity with programming languages like python</li><li>You will own and drive gathering, understanding &amp; documenting customer needs.</li><li>You can define customer goals and business requirements for product release(s)</li><li>You have experience creating customer functional requirements and can deliver to the development team.</li><li>You will be often involved in QA/testing of the product before releasing to customers.</li><li>You will identify data sources and perform data profiling</li><li>You will develop customer requirements (user stories) and business requirements for features or small product. </li><li>Your role will support the go-to-market plan, monitors and reports on customer effect of the plan.</li><li>You will support and participate in post-launch reviews and ensures feedback is reincorporated into the feature or product.</li><li>You can troubleshoot reported data quality issues identified by downstream users and on-going data quality monitoring; Leverage strong SQL and data analysis skills to identify potential root causes.</li><li>You have an understanding of data modelling, and you will acquire knowledge of the data model for your assigned data products so you can represent the team in collaboration meetings.</li><li>You have the ability to interact with data architects, engineers, and peers to evaluate solution approach options.</li><li>You will contribute to problem solving and discovery efforts by conducting internal stakeholder interviews. </li><li>You have a significant hands-on experience with data analysis techniques, pattern identification in structured and semi-structured datasets, and data transformation techniques.<br/><br/></li></ul>Southern California Base Salary Range $103,977-$166,363<br/><br/>In addition to a highly competitive base salary, per plan guidelines, restrictions and vesting requirements, you also will be eligible for an individual annual performance bonus, plus Capital's annual profitability bonus plus a retirement plan where Capital contributes 15% of your eligible earnings.<br/><br/>You can learn more about our compensation and benefits here .<br/><br/><ul><li> Temporary positions in Canada and the United States are excluded from the above mentioned compensation and benefit plans.<br/><br/></li></ul>We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law.", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Financial Services and Investment Management", "postedDate": "2 weeks ago", "skills": ["SQL", "python", "data analysis", "data profiling", "data modelling", "data quality monitoring", "stakeholder interviews"], "url": "https://www.linkedin.com/jobs/view/3990411350"}