{"jobTitle": "Logistics Manager", "company": {"name": "Precision Castparts", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $126,900.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation & Aerospace", "description": "With more than 120 operations and approximately 20,000 employees worldwide, Precision Castparts Corp. is the market leader in manufacturing large, complex structural investment castings, airfoil castings, forged components, aerostructures and highly engineered, critical fasteners for aerospace applications. In addition, we are the leading producer of airfoil castings for the industrial gas turbine market. We also manufacture extruded seamless pipe, fittings, and forgings for power generation and oil & gas applications; commercial and military airframe aerostructures; and metal alloys and other materials for the casting and forging industries. With such critical applications, we insist on quality and dependability – not just in the materials and products we make, but in the people we recruit.<br/><br/>PCC is relentless in its dedication to being a high-quality, low-cost and on-time producer; delivering the highest value to its customers while continually pursuing strategic, profitable growth.<br/><br/>In 2016, Berkshire Hathaway, led by Chairman and CEO Warren E. Buffett, acquired Precision Castparts Corp.<br/><br/><strong>Job Description<br/><br/></strong>Location Profile:<br/><br/>Located in North Hollywood, CA, Avibank Manufacturing, Inc., a PCC Company, a part of the Engineered Products Group, is among the world's leading manufacturers specializing in the design and production of sophisticated fasteners and multi-component fastening systems and devices, solving difficult engineering and critical performance problems.<br/><br/>Position Summary:<br/><br/>The Logistics Manager is responsible for all movement and storage of inventory, including Stores, Shipping, and Receiving. This position monitors inventory accuracy rates, movement of material throughout Production, material receipts, and ensuring customer shipments are met daily. Responsible for resolving any issues preventing shipment or receipt of property. Participates in planning meetings, provides dock and shipment updates, and advises of any support needed from other functions.<br/><br/>Primary Duties &amp; Responsibilities:<br/><br/><ul><li>Maintains and practices the safety culture, putting safety first.</li><li>Is a champion for 6S in the warehouse and with team.</li><li>Daily cycle counts in accordance with SOX compliance and to ensure accurate inventory at all times.</li><li>Monitors Shipping delivery times and transport costs.</li><li>Coordinates with Sales and Procurement to process customer RMA’s and procurement RTV’s</li><li>Regularly review Available to Ship Report to reduce waiting time on dock</li><li>Manage schedules for shipping, receiving, and stockroom personnel to ensure coverage for 1st and 2nd shift, as well as the weekend</li><li>Ensure team is fully cross trained to support flex work when needed to support the business needs</li><li>Provide excellent customer service to both internal and external customers</li><li>Ensures cost, productivity, accuracy, and timeliness targets are met</li><li>Collaborate with other departments to integrate logistics with business systems or processes such as customer sales, order management, job completion, accounting and shipping.</li><li>Implement customer specific requirements such as packaging, labeling, and shipping methods.</li><li>Ensure several members of team are trained for customer shipping portals</li><li>Create work instructions for all functions and provide training to the team</li><li>Institute daily targets and goals for logistics personnel to maintain accurate inventory levels and meet customer need dates.</li><li>Ensure compliance with all procedures while meeting customer requirements.</li><li>Establish daily reports to identify missed shipments and support recovery plans to get the customer what they need.</li><li>Maintain metrics and analyzes data to assess performance and implement improvements.</li><li>Comply with all Federal, State, and Local laws, regulations, and company policies / requirements.<br/><br/></li></ul>Required Skills:<br/><br/><ul><li>Attention to detail.</li><li>Ability to grow and maintain a positive team environment.</li><li>Effective in time-constrained, fast-paced environments</li><li>Works well with others to meet customer and business objectives.</li><li>Flexibility in the work schedule and willingness to work weekends.</li><li>Previous people management experience</li><li>Strong sense of ownership over success of the area<br/><br/></li></ul>Required Experience:<br/><br/><ul><li>5 to 10 years’ experience in Shipping/Receiving/Stockroom supervision.</li><li>SOX compliance experience required</li><li>Previous people management experience required</li><li>Experience with industry standard Inventory Management practices and Logistics required<br/><br/></li></ul>Level of Education:<br/><br/><ul><li>Bachelor’s degree or equivalent experience</li><li>ASCM (APICS) certification or course experience preferred<br/><br/></li></ul><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.<br/><br/></em>For informational purposes only, the range of pay for this role is $90,000 to $126,900 US Dollar (USD) Salaried based on a variety of factors. For informational purposes only, this role is eligible to participate in the Company’s Quarterly Cash Bonus Plan, paid out at the quarterly bonus factor of 3X the Company’s bonus multiple, based on the Company’s performance in the applicable quarter. Employees will receive 120 hours paid time off every year. Employees will also receive 10 paid holidays. Employees (and their families) are eligible to participate in the company's medical, dental, vision, and basic life insurance. Employees are eligible to enroll in the Company’s 401(k) plan.<br/><br/><em>This position requires use of information or access to production processes subject to national security controls under U.S. export control laws and regulations (including, but not limited to the International Traffic in Arms Regulations (ITAR) and the Export Administration Regulations (EAR)). To be qualified to work in this facility, a successful applicant must be a U.S. Person, as defined in those regulations, and able to supply evidence of that qualification prior to starting work or be authorized to receive controlled information under a specific license or permission from the relevant government agency. The U.S. export control regulations define a U.S. person as a U.S. Citizen, U.S. National, U.S. Permanent Resident (i.e. 'Green Card Holder'), and certain categories of Asylees and Refugees.</em>", "responsibilities": "<ul><li>Maintains and practices the safety culture, putting safety first.</li><li>Is a champion for 6S in the warehouse and with team.</li><li>Daily cycle counts in accordance with SOX compliance and to ensure accurate inventory at all times.</li><li>Monitors Shipping delivery times and transport costs.</li><li>Coordinates with Sales and Procurement to process customer RMA’s and procurement RTV’s</li><li>Regularly review Available to Ship Report to reduce waiting time on dock</li><li>Manage schedules for shipping, receiving, and stockroom personnel to ensure coverage for 1st and 2nd shift, as well as the weekend</li><li>Ensure team is fully cross trained to support flex work when needed to support the business needs</li><li>Provide excellent customer service to both internal and external customers</li><li>Ensures cost, productivity, accuracy, and timeliness targets are met</li><li>Collaborate with other departments to integrate logistics with business systems or processes such as customer sales, order management, job completion, accounting and shipping.</li><li>Implement customer specific requirements such as packaging, labeling, and shipping methods.</li><li>Ensure several members of team are trained for customer shipping portals</li><li>Create work instructions for all functions and provide training to the team</li><li>Institute daily targets and goals for logistics personnel to maintain accurate inventory levels and meet customer need dates.</li><li>Ensure compliance with all procedures while meeting customer requirements.</li><li>Establish daily reports to identify missed shipments and support recovery plans to get the customer what they need.</li><li>Maintain metrics and analyzes data to assess performance and implement improvements.</li><li>Comply with all Federal, State, and Local laws, regulations, and company policies / requirements.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Attention to detail.</li><li>Ability to grow and maintain a positive team environment.</li><li>Effective in time-constrained, fast-paced environments</li><li>Works well with others to meet customer and business objectives.</li><li>Flexibility in the work schedule and willingness to work weekends.</li><li>Previous people management experience</li><li>Strong sense of ownership over success of the area<br/><br/></li></ul>", "preferred": "<ul><li>Bachelor’s degree or equivalent experience</li><li>ASCM (APICS) certification or course experience preferred<br/><br/></li></ul>"}, "skills": ["SOX compliance", "Inventory Management", "Logistics", "Shipping", "Receiving", "Stockroom", "Customer Service", "Team Management", "Safety", "6S"], "postedDate": "2 weeks ago", "benefits": "For informational purposes only, the range of pay for this role is $90,000 to $126,900 US Dollar (USD) Salaried based on a variety of factors. For informational purposes only, this role is eligible to participate in the Company’s Quarterly Cash Bonus Plan, paid out at the quarterly bonus factor of 3X the Company’s bonus multiple, based on the Company’s performance in the applicable quarter. Employees will receive 120 hours paid time off every year. Employees will also receive 10 paid holidays. Employees (and their families) are eligible to participate in the company's medical, dental, vision, and basic life insurance. Employees are eligible to enroll in the Company’s 401(k) plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990914811"}