{"jobTitle": "Government Relations Representative Principal - Level 6", "company": {"name": "Lockheed Martin", "industry": "Defense and Space Manufacturing", "size": "Large", "location": "Palmdale, CA"}, "location": "Palmdale, CA", "jobType": "Full-Time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,400 - $269,100", "currency": "USD"}, "jobFunction": "Legal", "industry": "Defense and Space Manufacturing", "description": "The Government Relations Principal reports directly to the Director of Government Relations in Business Development. The primary accountability of this position is to provide leadership and direction for the site operation’s involvement in all political and legislative processes as it affects current programs and new business opportunities.", "responsibilities": "Develop Comprehensive Understanding of the Company. Interface with Vice President and General Manager as well as Vice President of Business Development and site leadership, along with program directors to obtain full understanding of company culture, strategic objectives, values, business issues, problems and opportunities. Direct and manage state and local government action plans focused on public policy activities which will enhance company competitiveness, create business opportunities and promote U.S. government procurement for LM Aeronautics. Develop Comprehensive and Integrated Legislative Strategy and Action Plan. Develop legislative strategy and action/contact plan consistent with and in support of the site operation’s strategic plan and business development objectives. Actively support and influence the success of the Business Development’s and Legislative Economic Development pursuits and capture process of new business opportunities through the legislative and political process. Seek opportunities to become actively involved with key industry advocacy organizations which are active participants in state public policy development and management. Develop responsive working relationship with the relevant plant site officials and staff, encouraging them to notify and/or consult government relations on all issues that a have a political/legislative impact. Develop and Maintain Positive Relationship with Key Participants in the Legislative Process. Develop and communicate an intense understanding of customers and their values at the local, state, and national level involved in the legislative process. Lead and coordinate at the plant site activities to create a strong constituency among company leadership, union leadership, and suppliers. Represent LM Aero through effective external relations at local and state political events. Manage the LMEPAC Fund within all legal and ethical guidelines. Establish/cultivate effective working relationships with key state legislators and senior leadership within state government. Lead all Company Government Relations, in consultation with Director, at the local, state, and federal levels. Develop, lead, and implement at the site operations the political and legislative strategy for all programs. Develop and maintain key political relationships to allow insight and access in support of company goals. Support the Lockheed Martin Government Affairs (LMGA) office on message development, contact satellite plants, and grassroots outreach as needed and as requested. Lead, support, and be the Point of Contact for all site visits by local, state, and federally elected officials and staff. Actively support corporate political goals with expert government relations advice in the state of the operation. Establish/cultivate effective working relationships with local Georgia congressional members and staff.", "qualifications": {"required": "Bachelors degree or higher from an accredited college. Knowledgeable of the California legislative process. Experience at any level of local, state, or federal government and/or government relations experience.", "preferred": "Minimum of 9 years experience at any level of local, state, or federal government and/or government relations experience. Understanding of the City of Palmdale and County elected officials and staff."}, "skills": ["Government Relations", "Legislative Strategy", "Public Policy", "Business Development", "Political Advocacy"], "postedDate": "1 month ago", "applicationDeadline": "90 days from posting", "benefits": "Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.", "remoteWork": "Part-time Remote Telework: The employee selected for this position will work part of their work schedule remotely and part of their work schedule at a designated Lockheed Martin facility.", "url": "https://www.linkedin.com/jobs/view/3990104162"}