{"jobTitle": "MEP Project Manager", "company": {"name": "Schnackel Engineers, Inc.", "industry": "Engineering Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$90,000.00/yr - $125,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Engineering Services", "description": "Schnackel Engineers, Inc. is a leading Mechanical, Electrical, Plumbing, Fire Protection, and Information Technology consulting firm with offices in New York, Miami, Omaha, Los Angeles, Seattle, and Honolulu. Specializing in providing innovative and cost-effective MEP/FP/IT services to the retail, shopping center, and mixed-use development markets, Schnackel Engineers has designed millions of square feet of commercial and retail property across over 20,000 projects. The company has also introduced AI for MEP®, a groundbreaking design process utilizing Artificial Intelligence software to revolutionize MEP engineering.", "responsibilities": "The MEP Project Manager will be responsible for overseeing the mechanical, electrical, plumbing, fire protection, and information technology components of projects. Day-to-day tasks include project planning, project management, client communication and managing team and project processes to ensure successful project delivery.", "qualifications": {"required": "Bachelor's degree in Engineering or related field, MEP (Mechanical Electrical and Plumbing), Plumbing skills, Project Management skills, Project budgeting/planning skills, Experience with managing MEP projects and delivery, Strong analytical and problem-solving abilities, Excellent communication and teamwork skills, Ability to work well with clients and meet deadlines.", "preferred": "Engineering certifications are preferred and very much valued."}, "skills": ["MEP", "Plumbing", "Project Management", "Project budgeting", "Analytical skills", "Problem-solving", "Communication", "Teamwork"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990200774"}