{"jobTitle": "Administrative Assistant, Product Metadata & Ratings", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$60,000.00 - $240,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>The Role<br/><br/></strong>We are seeking a California office-based (Los Angeles or Los Gatos) seasoned career Administrative Assistant to partner with three to four Directors on the Product Metadata &amp; Ratings team. This team is globally distributed and culturally diverse, doing foundational work that fuels outputs across the Product org.<br/><br/>A successful candidate will be self-motivated, proactive, quick-thinking, flexible, and able to juggle an array of diverse responsibilities. They will need to have a strong emphasis on organization and unwavering attention to detail at all times and strong ability to problem solve. In this global fast-paced, high volume environment, the individual will need to be comfortable operating with ambiguity and autonomy, quick to learn and able to take initiative with good judgment along the way.<br/><br/>The ideal candidate is someone who can manage an ever-evolving list of tasks and also think strategically about the needs of each leader, the team, and the impacts of our work in the wider org. They are confident &amp; courageous to take a seat at the table but humble &amp; curious about the diversity in experiences held by those around them.<br/><br/><strong>Responsibilities Include<br/><br/></strong><ul><li>Frequent &amp; complex calendar management for multiple globally dispersed Directors which can involve collaborative complex calendaring across time zones and competing schedules</li><li>Frequent international travel planning across Netflix locations</li><li>Large scale global event and onsite planning, sourcing &amp; logistics for up to 100 guests, including office or venue coordination, hotel accommodations, organizing activities &amp; project managing run of show</li><li>Keep leaders and team organized through document management and upkeep</li><li>Partner with other admins on org-wide initiatives </li><li>Project management of recurring team meetings (can include preparing agendas, presentations, materials and post meeting action item coordination)</li><li>Liaise with workplace teams and represent PMR for space planning needs in every office where team sits</li><li>Heavy internal communications</li><li>Create necessary operational efficiencies to keep team running smoothly and effectively</li><li>Relationship building with leaders, cross-functional partners, and other admins</li><li>Maintaining digital communication channels for the team <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>5+ years of experience as an administrative professional supporting multiple leaders with globally dispersed teams</li><li>Must have mastery in Google Suite. Preferred working knowledge in Airtable, Canva, Miro, Slack</li><li>Strong written and verbal communication skills </li><li>High level of discretion and maturity</li><li>Extensive experience within a technology or rapidly-scaling company</li><li>Strong business acumen; able to understand and prioritize according to shifting needs of the business and the just-do work of the day-to-day</li><li>Can organize chaos of competing opinions, priorities, and last-minute changes</li><li>Event planning experience is necessary</li><li>Ability to travel domestically and internationally for team offsites &amp; events</li><li>Operational background; success in designing and implementing processes based on the needs of leaders and teams</li><li>Startup experience; has been encouraged to challenge the status quo, take risks, share in the vision as a participant on the leadership layer<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $60,000- $240,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Frequent &amp; complex calendar management for multiple globally dispersed Directors which can involve collaborative complex calendaring across time zones and competing schedules\nFrequent international travel planning across Netflix locations\nLarge scale global event and onsite planning, sourcing &amp; logistics for up to 100 guests, including office or venue coordination, hotel accommodations, organizing activities &amp; project managing run of show\nKeep leaders and team organized through document management and upkeep\nPartner with other admins on org-wide initiatives \nProject management of recurring team meetings (can include preparing agendas, presentations, materials and post meeting action item coordination)\nLiaise with workplace teams and represent PMR for space planning needs in every office where team sits\nHeavy internal communications\nCreate necessary operational efficiencies to keep team running smoothly and effectively\nRelationship building with leaders, cross-functional partners, and other admins\nMaintaining digital communication channels for the team", "qualifications": {"required": "5+ years of experience as an administrative professional supporting multiple leaders with globally dispersed teams\nMust have mastery in Google Suite. Preferred working knowledge in Airtable, Canva, Miro, Slack\nStrong written and verbal communication skills \nHigh level of discretion and maturity\nExtensive experience within a technology or rapidly-scaling company\nStrong business acumen; able to understand and prioritize according to shifting needs of the business and the just-do work of the day-to-day\nCan organize chaos of competing opinions, priorities, and last-minute changes\nEvent planning experience is necessary\nAbility to travel domestically and internationally for team offsites &amp; events\nOperational background; success in designing and implementing processes based on the needs of leaders and teams\nStartup experience; has been encouraged to challenge the status quo, take risks, share in the vision as a participant on the leadership layer", "preferred": ""}, "skills": ["Google Suite", "Airtable", "Canva", "Miro", "Slack", "Event Planning", "Travel Planning", "Calendar Management", "Communication", "Organization", "Problem Solving"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990862979"}