{"jobTitle": "Client Solutions Manager, Fashion Luxury - Los Angeles", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "70800 - $100000 annually", "currency": "USD"}, "jobFunction": "Sales, Strategy/Planning, and Marketing", "industry": "Entertainment Providers", "description": "<strong>Responsibilities<br/><br/></strong> Company Overview:<br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.<br/><br/>Why Join Us:<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. Join us.<br/><br/>About the Team:<br/>The enterprise ad sales team works with some of the largest organizations across all categories. They are responsible for enabling advertising on the platform and connecting users with brands.<br/><br/>About the Role:<br/>The Client Solutions Manager (CSM) will work closely with the sales team to provide support and expertise in meeting client objectives and providing best in class customer service to both internal and external clients. The CSM will be responsible for negotiating and optimizing complex opportunities and use data and analytics to build a consultative solution for our clients. They will establish and strengthen key client relationships with a focus on driving revenue, advertiser education &amp; advertiser satisfaction. Success in this position requires a great focus on client service, ability to thrive in an ever-changing work environment, and provide custom solutions for advertisers leveraging our unique suite of ad products.<br/><br/>Responsibilities:<br/>- Manage and grow post-sale client relationships and revenue for advertisers <br/>- Become an expert in TikTok solutions for businesses of all sizes and adapt recommendations quickly to suit varying client needs<br/>- Grow revenue, educate and lead upsell conversations with clients post initial sale<br/>- Spearhead client education on products and product updates to advise on the best approach to drive business outcomes for clients and agencies<br/>- Outline and oversee all measurement strategies for clients in relation to tracking metrics and delivering results<br/>- Identify optimization opportunities for improving performance<br/>- Demonstrate expertise in all matters relevant to your book of business, including escalation and troubleshooting to resolve client issues<br/>- Consult and coach clients and agencies to achieve greater results on TikTok solutions <br/><br/><strong>Qualifications<br/><br/></strong> Minimum Qualifications:<br/>- 4+ years of experience in account management / client services roles in digital marketing or ad tech – experience with auction-based ad networks<br/>- Must be willing to work in Los Angeles<br/><br/>Preferred Qualifications:<br/>- Experience prioritizing and managing tasks within a fast-paced environment<br/>- Ability to analyze data and identify insights<br/>- Track record of supporting revenue goals<br/>- Experience in performance advertising and managing significant, complex and scaling challenges<br/>- Experience diagnosing and solving technical problems with product and engineering teams<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 <br/><br/><strong>Job Information:<br/><br/></strong>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $70800 - $100000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- Manage and grow post-sale client relationships and revenue for advertisers \n- Become an expert in TikTok solutions for businesses of all sizes and adapt recommendations quickly to suit varying client needs\n- Grow revenue, educate and lead upsell conversations with clients post initial sale\n- Spearhead client education on products and product updates to advise on the best approach to drive business outcomes for clients and agencies\n- Outline and oversee all measurement strategies for clients in relation to tracking metrics and delivering results\n- Identify optimization opportunities for improving performance\n- Demonstrate expertise in all matters relevant to your book of business, including escalation and troubleshooting to resolve client issues\n- Consult and coach clients and agencies to achieve greater results on TikTok solutions ", "qualifications": {"required": "- 4+ years of experience in account management / client services roles in digital marketing or ad tech – experience with auction-based ad networks\n- Must be willing to work in Los Angeles", "preferred": "- Experience prioritizing and managing tasks within a fast-paced environment\n- Ability to analyze data and identify insights\n- Track record of supporting revenue goals\n- Experience in performance advertising and managing significant, complex and scaling challenges\n- Experience diagnosing and solving technical problems with product and engineering teams"}, "skills": [], "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990940983"}