{"jobTitle": "Brand Partnerships Manager, Entertainment - Global Business Solutions - Los Angeles", "company": {"name": "TikTok", "industry": "Entertainment Providers", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$118,560.00/yr - $220,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Marketing", "industry": "Entertainment Providers", "description": "Company Overview:\nTikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.\n\nWhy Join Us:\nCreation is the core of TikTok's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nAbout the Role and Team:\nThe Brand Partnerships Manager (BPM) is responsible for hitting revenue goals, building relationships with key enterprise accounts and helping clients drive business results on TikTok through product consultation, education, and support. Success as a BPM requires strong sales skills, strong partnership with Client Solutions Manager (CSM), problem-solving skills, attention to detail, and the ability to thrive in an ever-changing environment.", "responsibilities": "- Analyze account performance data to offer clients data-driven business insights, and at the same time, use those insights to improve our account and advertising offerings.\n- Sustain close communication and alignment with clients and internal stakeholders to maximize client strategies and foster trust and collaboration.\n- Develop and maintain C-level relationships with regional executives at a portfolio of global brands to educate and inform on the power of TikTok's platform and drive revenue opportunities.\n- Conduct regular business reviews and take a consultative, long-term approach to building productive relationships with clients, in collaboration with the global sales teams, sales operations, and other key cross functional stakeholders. \n- Work and collaborate with a diverse group of internal cross-functional teams across the Consumer, Content, Product, and Revenue business units to drive organizational KPIs.\n- Lead account planning process that aligns brand and TikTok resources to maximize opportunities\n- Grow revenue, educate and lead strategic conversations with clients and navigate complex relationships", "qualifications": {"required": "8+ Experience in media sales, digital marketing, brand advertising, and/or online advertising experience\n- Must be willing to work in Los Angeles, CA", "preferred": "- Experience with digital media (i.e.- Digital TV CTV, OTT, social media, etc.)\n- Track record of building compelling presentations leveraging industry and internal proof points\n- Knowledge of the self-serve platform, auction, and biddable form of digital advertising buying\n- Proven ability to establish relationships with advertisers, agency and C-level relationships\n- Track record of delivering and exceeding revenue goals\n- Creative, outside-the-box thinker and strategist\n- A team player and collaborator"}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "Not specified", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3990947066"}