{"jobTitle": "Data Engineer I (Remote)", "company": {"name": "RemoteWorker CA", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$50.00 - $55.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>We have an immediate need for a Data Engineer I to join a premier management consulting firm for a 6-month contract. The Data Engineer I will utilize expertise in the methods of Kimball data modeling, data profiling, star schema creation as well as the tools Snowflake, SQL, DBT to design data models and develop solutions for analysis<br/><br/>Location: Remote working Eastern Time Zone hours.<br/><br/>This job expects to pay about $50 - 55 W2 per hour plus benefits. Corp-to-corp is not open for this contract.<br/><br/>What You Will Do<br/><br/><ul><li>Collaborate with service lines and teams to identify data requirements for use cases and enable data-driven decision-making capabilities</li><li>Design, develop, optimize, and maintain data architecture and pipelines that adhere to business goals</li><li>Collaborate with teams to track efforts and provide updates in development and eventual delivery</li><li>Conduct trainings for end-users on utilizing data warehouse effectively</li><li>Create and manage dashboards within PowerBI</li><li>Create documentation detailing various role activities such as: data architecture, pipelines, models, dashboards, root cause analyses, ADRs and more<br/><br/></li></ul>What Gets You The Job<br/><br/><ul><li>Bachelor's degree in quantitative field like Computer Science, Engineering, Statistics, Mathematics or related field required. Advanced degree is a strong plus</li><li>Minimum 2 years of experience in a data engineering role</li><li>Data warehouse experience</li><li>Expertise in data profiling and data modeling (Kimball preferred)</li><li>Proficiency in communication, collaborating with various stakeholders, and problem-solving with the ability to create scalable solutions</li><li>Experience with: SQL, Snowflake, DBT, PowerBI, Python</li><li>Proficiency in communication, collaborating with various stakeholders, and problem-solving<br/><br/></li></ul>Irvine Technology Corporation (ITC)  is a leading provider of technology and staffing solutions for IT, Security, Engineering, and Interactive Design disciplines servicing startups to enterprise clients, nationally. We pride ourselves in the ability to introduce you to our intimate network of business and technology leaders – bringing you opportunity coupled with personal growth, and professional development! Join us. Let us catapult your career!<br/><br/><em>Irvine Technology Corporation provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Irvine Technology Corporation complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.</em>", "responsibilities": "<ul><li>Collaborate with service lines and teams to identify data requirements for use cases and enable data-driven decision-making capabilities</li><li>Design, develop, optimize, and maintain data architecture and pipelines that adhere to business goals</li><li>Collaborate with teams to track efforts and provide updates in development and eventual delivery</li><li>Conduct trainings for end-users on utilizing data warehouse effectively</li><li>Create and manage dashboards within PowerBI</li><li>Create documentation detailing various role activities such as: data architecture, pipelines, models, dashboards, root cause analyses, ADRs and more<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in quantitative field like Computer Science, Engineering, Statistics, Mathematics or related field required. Advanced degree is a strong plus\nMinimum 2 years of experience in a data engineering role\nData warehouse experience\nExpertise in data profiling and data modeling (Kimball preferred)\nProficiency in communication, collaborating with various stakeholders, and problem-solving with the ability to create scalable solutions\nExperience with: SQL, Snowflake, DBT, PowerBI, Python\nProficiency in communication, collaborating with various stakeholders, and problem-solving"}, "skills": ["Snowflake", "SQL", "DBT", "PowerBI", "Python", "Data warehouse", "Data modeling", "Data profiling", "Kimball"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3990782536"}