{"jobTitle": "Associate, FS&A, Ads Revenue & Yield Analytics", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000.00 - $240,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>It's an exciting time to join Netflix as we continue to transform entertainment globally. We bring entertainment to over 260 million subscribers in over 190 countries. This requires great content, a frictionless choosing experience and engaging conversation. As we continue to grow, we’re increasingly focusing on Commerce as well. We have ambitious plans, an enormous growth opportunity and the passion to be the best in customer experience - which now includes a new ad-supported plan at a more affordable price point for members.<br/><br/>Within the broader Finance &amp; Strategy (F&amp;S) organization, we’re building out our Ads Revenue &amp; Yield Analytics team, who will help steward and support our Ads go-to-market strategy. In this role, you will support the Ads business in the UCAN region, inclusive of Sales &amp; Account Management, with specialization across Ad Sales pricing, inventory management &amp; revenue analytics. This position reports to the Sr. Manager, F&amp;S, Ads Revenue &amp; Yield Analytics (UCAN).<br/><br/>In tandem, you will have the opportunity to learn and grow quickly in this space, working closely with a global, cross-functional team across F&amp;S, Partnerships, Consumer, Marketing &amp; Content to help build a cohesive understanding and unified approach to advertising at Netflix.<br/><br/>Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.<br/><br/><strong>Your Responsibilities Will Include<br/><br/></strong><ul><li>Support the UCAN commercial strategy for agency &amp; brand development </li><li>Design scalable templates and dashboards that support pricing &amp; packaging strategies, revenue forecasting, and inventory management</li><li>Work cross-functionally to generate supply &amp; demand reporting and support ad hoc requests</li><li>Steward market-level &amp; program-level inventory avails across the product suite, inclusive of live events, sponsorships, and programmatic</li><li>Provide insights and recommendations to support programmatic deal setup</li><li>Analyze and optimize campaign executions across managed service and auction-based programmatic channels </li><li>Administer business requirements in support of the development of our 1st party Ad Stack</li><li>Partner with Revenue Accounting to ensure accurate reconciliation of discount promotions and incentive programs</li><li>Create clear and concise presentation materials for internal and external stakeholders </li><li>Build onboarding and training materials for new hires and lead training sessions<br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>3+ years of experience in Revenue Management, Pricing &amp; Planning, and/or Advertising Strategy</li><li>Familiarity with programmatic advertising, auction dynamics, and/or ad tech is a plus </li><li>Embodies Netflix’s cultural values and is excited to work in a high-performance culture </li><li>Knowledge of the streaming advertising and ad tech ecosystem is highly preferred</li><li>Strong modeling skills and comfort with manipulating large datasets in Google Sheets, Excel, Tableau, and other data visualization tools</li><li>A strong attention to detail and eye toward using the 80/20 rule to address problems</li><li>Proactive and works independently, thriving in a fast-paced, always-changing environment</li><li>Strong interpersonal skills, with proven ability to build successful relationships with XFN stakeholders</li><li>Respectfully and effectively expresses opinion and engages in debate in group forums</li><li>Excellent communication and presentation skills; ability to present complex analyses to executives/senior management</li><li>Very strong project management, including the ability to handle multiple projects simultaneously and to deliver under tight timelines<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $240,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Support the UCAN commercial strategy for agency & brand development \nDesign scalable templates and dashboards that support pricing & packaging strategies, revenue forecasting, and inventory management\nWork cross-functionally to generate supply & demand reporting and support ad hoc requests\nSteward market-level & program-level inventory avails across the product suite, inclusive of live events, sponsorships, and programmatic\nProvide insights and recommendations to support programmatic deal setup\nAnalyze and optimize campaign executions across managed service and auction-based programmatic channels \nAdminister business requirements in support of the development of our 1st party Ad Stack\nPartner with Revenue Accounting to ensure accurate reconciliation of discount promotions and incentive programs\nCreate clear and concise presentation materials for internal and external stakeholders \nBuild onboarding and training materials for new hires and lead training sessions", "qualifications": {"required": "3+ years of experience in Revenue Management, Pricing & Planning, and/or Advertising Strategy\nFamiliarity with programmatic advertising, auction dynamics, and/or ad tech is a plus \nEmbodies Netflix’s cultural values and is excited to work in a high-performance culture \nKnowledge of the streaming advertising and ad tech ecosystem is highly preferred\nStrong modeling skills and comfort with manipulating large datasets in Google Sheets, Excel, Tableau, and other data visualization tools\nA strong attention to detail and eye toward using the 80/20 rule to address problems\nProactive and works independently, thriving in a fast-paced, always-changing environment\nStrong interpersonal skills, with proven ability to build successful relationships with XFN stakeholders\nRespectfully and effectively expresses opinion and engages in debate in group forums\nExcellent communication and presentation skills; ability to present complex analyses to executives/senior management\nVery strong project management, including the ability to handle multiple projects simultaneously and to deliver under tight timelines"}, "skills": ["Revenue Management", "Pricing & Planning", "Advertising Strategy", "Programmatic Advertising", "Auction Dynamics", "Ad Tech", "Streaming Advertising", "Ad Tech Ecosystem", "Modeling", "Google Sheets", "Excel", "Tableau", "Data Visualization", "Project Management"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3990127361"}