{"jobTitle": "Receptionist", "company": {"name": "Cornerstone Research", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "43,600.00/yr - 53,900.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Business Consulting and Services", "description": "<strong>Overview<br/><br/></strong><strong> RECEPTIONIST (ON-SITE, LOS ANGELES) <br/><br/></strong>If you are looking for an opportunity to showcase your organizational skills and personable demeanor, then we would like to meet with you!<br/><br/>Join a collaborative team who makes top-tier client service and delivery their mission. As a Receptionist, you will maintain the front desk area, including handling initial contact with employees and clients upon arrival, answering phone inquiries, coordinating catering orders, maintaining conference room schedules and a variety of other administrative duties to support day to day operations in the Los Angeles office. Our ideal candidate will embody a deep sense of teamwork, pride themselves on providing superior client service and have a keen eye for detail. Working hours for this position will be from 8:00am to 5:00pm.<br/><br/>At Cornerstone Research, you will be part of a thriving, 900-strong team that spans nine offices, comprises more than 55 nationalities, and leads the industry in its commitment to develop team members across all levels. Inc. Magazine has recognized Cornerstone Research three times as a Best Workplace for its outstanding employee engagement, collaborative culture, and professional growth opportunities.<br/><br/><strong> You’ll Love It Here If You <br/><br/></strong><ul><li> Embrace learning and continuous improvement </li><li> Set and strive for a high bar of excellence </li><li> Believe that teamwork leads to success: ask us what it means to be #onefirmfirm! </li><li> Take pride in always doing your best work, even if it’s harder or takes longer </li><li> Are passionate about what you do <br/><br/></li></ul><strong>How You’ll Help Our Team Succeed<br/><br/></strong><ul><li> Greet staff, clients, vendors, and all guests and direct them to or notify the appropriate parties of arrival </li><li> Coordinate catering orders for firm and client meetings and assist with room set up and clean up </li><li> Answer all incoming calls in a timely and professional manner, takes complete and accurate messages and follows up accordingly </li><li> Prepare the office for opening and closing each day; perform regular visual checks to ensure an orderly office </li><li> Schedule conference rooms using scheduling software and resolve scheduling conflicts </li><li> Provide general administrative support (meeting scheduling, filing, data entry, etc.) as needed </li><li> Review, allocate, prepare and research invoices for manager’s review and approval </li><li> Monitors incoming and outgoing faxes </li><li> Makes reservations for clients and staff as requested, including hotels, private cars, taxis, restaurants, and airlines </li><li> Process and track all incoming and outgoing mail/packages using online shipping software and our standard shipping protocol </li><li> Run errands, handle pick-ups and deliveries, and courier case documents as needed while ensuring confidentiality of materials <br/><br/></li></ul><strong> What You’ll Need to Be Successful <br/><br/></strong><ul><li> 1+ years of experience in a related role; professional services experience preferred </li><li> The desire to take initiative and actively contribute to the team and the firm </li><li> The ability to communicate effectively and professionally </li><li> Strong business acumen and the ability to learn the firm’s financial and operational functions </li><li> The mindset to provide superior service </li><li> Experience using meeting and conference room scheduling software a plus </li><li> Intermediate knowledge of MS Office (Outlook, Word, Excel) required </li><li> High school diploma <br/><br/></li></ul><strong> Who We Are <br/><br/></strong>Cornerstone Research provides economic and financial analysis and expert testimony in all phases of commercial litigation and regulatory proceedings.<br/><br/>We work with a broad network of testifying experts, including leaders from academia and industry, who are recognized for their depth of knowledge, accomplishments, and research. Our staff consultants contribute expertise in economics, finance, accounting, and marketing, as well as business acumen, familiarity with the litigation process, and a commitment to produce outstanding results.<br/><br/>The firm’s uniquely collegial and supportive atmosphere makes Cornerstone Research a great place to work. We invest in our people in a host of ways, from providing meaningful learning and development opportunities to organizing memorable social events. To many, our culture and our people are the most exciting and enriching aspects of a career at Cornerstone Research.<br/><br/>For Los Angeles candidates only: Cornerstone Research is offering a competitive market base salary for this position between $43,600 and $53,900. A job offer will depend on how closely a candidate’s skills, experience and education match the requirements for the role. In addition to base salary, we offer a total compensation package that includes annual performance bonus and generous benefits.<br/><br/><strong> Equal Employment Opportunity <br/><br/></strong>Cornerstone Research is an equal employee opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, age, national origin, disability, sexual orientation, gender identity or expression, marital status, genetic information, protected veteran status, or other factors protected by law.", "responsibilities": "<ul><li> Greet staff, clients, vendors, and all guests and direct them to or notify the appropriate parties of arrival </li><li> Coordinate catering orders for firm and client meetings and assist with room set up and clean up </li><li> Answer all incoming calls in a timely and professional manner, takes complete and accurate messages and follows up accordingly </li><li> Prepare the office for opening and closing each day; perform regular visual checks to ensure an orderly office </li><li> Schedule conference rooms using scheduling software and resolve scheduling conflicts </li><li> Provide general administrative support (meeting scheduling, filing, data entry, etc.) as needed </li><li> Review, allocate, prepare and research invoices for manager’s review and approval </li><li> Monitors incoming and outgoing faxes </li><li> Makes reservations for clients and staff as requested, including hotels, private cars, taxis, restaurants, and airlines </li><li> Process and track all incoming and outgoing mail/packages using online shipping software and our standard shipping protocol </li><li> Run errands, handle pick-ups and deliveries, and courier case documents as needed while ensuring confidentiality of materials <br/><br/></li></ul>", "qualifications": {"required": "<ul><li> 1+ years of experience in a related role; professional services experience preferred </li><li> The desire to take initiative and actively contribute to the team and the firm </li><li> The ability to communicate effectively and professionally </li><li> Strong business acumen and the ability to learn the firm’s financial and operational functions </li><li> The mindset to provide superior service </li><li> Experience using meeting and conference room scheduling software a plus </li><li> Intermediate knowledge of MS Office (Outlook, Word, Excel) required </li><li> High school diploma <br/><br/></li></ul>", "preferred": ""}, "skills": ["Client Service", "Teamwork", "Communication", "Microsoft Office", "Scheduling", "Administrative Support", "Invoice Processing", "Fax", "Reservations", "Shipping", "Courier"], "postedDate": "2 weeks ago", "benefits": "Cornerstone Research is offering a competitive market base salary for this position between $43,600 and $53,900. A job offer will depend on how closely a candidate’s skills, experience and education match the requirements for the role. In addition to base salary, we offer a total compensation package that includes annual performance bonus and generous benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990850341"}