{"jobTitle": "Sr. Manager, Influencer Marketing", "company": {"name": "Hourglass Cosmetics", "industry": "Personal Care Product Manufacturing", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "<strong>HOURGLASS COSMETICS – Sr. Manager, Influencer Marketing<br/><br/></strong>Connected by creativity and driven by purpose. Hourglass Cosmetics is a vegan and cruelty-free beauty brand, redefining luxury cosmetics with high-performance products, innovative formulas, and award-winning franchises. Recognized by Forbes, Fast Company and Time Magazine as one of the most inventive beauty companies, Hourglass leads the industry with its breakthrough products and its commitment to animal welfare. Founded in 2004, Hourglass is globally available in 32 markets and 2,600 doors including Sephora, Ulta, Bergdorf Goodman, Nordstrom, Space NK and more. Hourglass became part of the Unilever Prestige division in 2017. Discover more about the Hourglass brand story and mission on our website hourglasscosmetics.com<br/><br/>Reporting to the VP, Social &amp; Influencer Marketing, in this role, you'll take ownership and lead the day-to-day strategy and campaign execution for Hourglass’ current and growing influencer marketing program. The ideal candidate will have proven experience identifying and engaging influencers, managing outreach programs, and creating engaging, brand worthy content. You should have a deep-rooted interest in beauty and lifestyle with the ability to thrive in a fast-paced, entrepreneurial culture. You will possess a strong attention to detail, passion for social, emerging platforms and technologies, and a creative, open-minded, and collaborative personality.<br/><br/><strong>What You Do<br/><br/></strong><ul><li>Reporting into the VP, Social &amp; Influencer Marketing you’ll take ownership and lead the strategy and execution of the global influencer marketing program.</li><li>Manage and oversee the development of a team of 3 (influencer assistant, coordinator, and assistant manager).</li><li>Responsible for talent discovery, building and maintaining influencer relationships within various verticals, and social platforms.</li><li>Manage the organic seeding talent program, including target list development, outreach and identifying sampling/partnership opportunities</li><li>Manage revenue and affiliate driving paid activations, including sourcing talent, program management and cross-functional communication with Digital/ Ecommerce</li><li>Lead execution of global mailer program, including logistics, market management, and reporting</li><li>Partner with key regional marketing teams, and PR agencies on influencer/ talent activations and recommendations</li><li>Partner with Social/ PR leadership on paid talent programming, from discovery, outreach through to content execution and contracting/ negotiation</li><li>Manage relationships with all external talent agency partners, ongoing or special project basis</li><li>Act as main POC for all influencers, talent, agents and their teams as needed</li><li>Pitch and execute brand aligned community building experiences and events</li><li>Analyze and report the effectiveness of programs and competitive analysis for management using social listening tools such as Creator IQ, Tribe, Dash Hudson etc.</li><li>Responsible for tracking and maintaining the influencer database to ensure it is up to date</li><li>Collaborate with social media leads to track and leverage influencer related content daily</li><li>Manage social media programming with influencers, including outreach and developing content around brand and business goals, and ensuring deliverables are executed on time and to brand standard</li><li>Use data and knowledge of space to identify talent for integrated marketing campaigns, meeting brand and business goals</li><li>Lead development of competitor analysis, and influencer/ talent industry trends and insights to keep the wider marketing informed, and stay on top of social evolution</li><li>Demonstrate ability to think both creatively and critically, willing to think outside the box and challenge the status quo while demonstrating sound judgement in strategic decision making.<br/><br/></li></ul><strong>What You’ll Gain<br/><br/></strong><ul><li>Develop the skills to take ownership of Hourglass’ fast-growing influencer marketing program.</li><li>In-depth understanding of influencer and social marketing within a modern luxury brand.</li><li>A holistic and cross-functional understanding of the luxury beauty industry beyond Influencer Marketing: from sales to product development to e-commerce, education to visual merchandising.<br/><br/></li></ul><strong>You’ll Love This Job If<br/><br/></strong><ul><li>You are extremely ORGANIZED: You’re not overwhelmed by the thought of tackling multiple tasks at a time.</li><li>You are DETAIL ORIENTED: You appreciate the importance of having detailed and precise information.</li><li>You are a strong COMMUNICATOR: You are a people person and collaborate well with others.</li><li>You are AGILE: You adapt well to changing needs and priorities and can pivot easily to achieve goals and deadlines.</li><li>You are PASSIONATE about beauty and influencers: You are eager to learn and absorb all things related to beauty and social media. No job is too small and you’re willing to take on larger projects.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum 6 years of beauty influencer marketing, talent relations and/or PR experience preferred</li><li>Established relationships with influencers, industry players and understanding of the digital beauty landscape</li><li>Must be an excellent communicator, natural networker, team player and highly-organized</li><li>Must have a college degree</li><li>Knowledge of international influencers is a plus<br/><br/></li></ul>The expected base salary range for this position is $95,000.00 to $105,000.00. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget. This position is also eligible for participation in the company discretionary bonus plan, based on personal performance and company results.<br/><br/>In addition to base salary, Hourglass Cosmetics offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.<br/><br/>Hourglass is an organization committed to diversity and inclusion to drive its business results and to create a better future every day for its diverse employees, global consumers, partners and communities. If you are an individual with a disability and need accommodation in order to apply for a job listing, please contact us at 310-392-7799 or careers@hourglasscosmetics.com.<br/><br/>Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities.<br/><br/>Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law.", "responsibilities": "Reporting into the VP, Social &amp; Influencer Marketing you’ll take ownership and lead the strategy and execution of the global influencer marketing program.\nManage and oversee the development of a team of 3 (influencer assistant, coordinator, and assistant manager).\nResponsible for talent discovery, building and maintaining influencer relationships within various verticals, and social platforms.\nManage the organic seeding talent program, including target list development, outreach and identifying sampling/partnership opportunities\nManage revenue and affiliate driving paid activations, including sourcing talent, program management and cross-functional communication with Digital/ Ecommerce\nLead execution of global mailer program, including logistics, market management, and reporting\nPartner with key regional marketing teams, and PR agencies on influencer/ talent activations and recommendations\nPartner with Social/ PR leadership on paid talent programming, from discovery, outreach through to content execution and contracting/ negotiation\nManage relationships with all external talent agency partners, ongoing or special project basis\nAct as main POC for all influencers, talent, agents and their teams as needed\nPitch and execute brand aligned community building experiences and events\nAnalyze and report the effectiveness of programs and competitive analysis for management using social listening tools such as Creator IQ, Tribe, Dash Hudson etc.\nResponsible for tracking and maintaining the influencer database to ensure it is up to date\nCollaborate with social media leads to track and leverage influencer related content daily\nManage social media programming with influencers, including outreach and developing content around brand and business goals, and ensuring deliverables are executed on time and to brand standard\nUse data and knowledge of space to identify talent for integrated marketing campaigns, meeting brand and business goals\nLead development of competitor analysis, and influencer/ talent industry trends and insights to keep the wider marketing informed, and stay on top of social evolution\nDemonstrate ability to think both creatively and critically, willing to think outside the box and challenge the status quo while demonstrating sound judgement in strategic decision making.", "qualifications": {"required": "Minimum 6 years of beauty influencer marketing, talent relations and/or PR experience preferred\nEstablished relationships with influencers, industry players and understanding of the digital beauty landscape\nMust be an excellent communicator, natural networker, team player and highly-organized\nMust have a college degree\nKnowledge of international influencers is a plus", "preferred": ""}, "skills": ["Influencer Marketing", "Talent Relations", "PR", "Digital Beauty Landscape", "Communication", "Networking", "Teamwork", "Organization"], "postedDate": "1 day ago", "benefits": "The expected base salary range for this position is $95,000.00 to $105,000.00. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget. This position is also eligible for participation in the company discretionary bonus plan, based on personal performance and company results.\n\nIn addition to base salary, Hourglass Cosmetics offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3990420949"}