{"jobTitle": "Stock Associate - FT - Santa Monica", "company": {"name": "AllSaints", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18/hr - $19/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Apparel & Fashion", "description": "THE ALLSAINTS TEAM\n\nAt AllSaints we are in the business of feelings - making our customers feel cool and confident. If, like us, you believe in the power of a great outfit, we'd love to talk to you.\n\nWe're a global brand made up of a very diverse mix of talented people in a huge variety of roles. Our products are designed in house and made by a small number of suppliers and artisans around the world to sustainable standards.\n\nWe are a brand embarking on a very exciting plan and we are seeking new members of the team who want to contribute to this.\n\nTHE ROLE\n\n<ul><li>Responsible for the process of replenishment</li><li>Ensure all procedures are followed to minimize stock loss</li><li>Ensure stock rotation processes are adhered to</li><li>Ensure stock level information is communicated effectively</li><li>Responsibility for deliveries into the store being managed effectively</li><li>Responsible for stock delivery and merchandising</li><li>Ensuring correct swing ticket information is on all products</li><li>Ensuring tag check procedures are adhered to</li><li>Responsible for ensuring tagging procedures are followed</li><li>Ensure all fire exits/ walkways are free from boxes of delivery/ combustibles</li><li>Ensuring lifting and handling of deliveries are dealt with in the correct manner<br/><br/></li></ul>Pay Range in LA, CA<br/><br/>Exact compensation may vary based on skills, experience, and location<br/><br/>Hourly Rate:<br/><br/>$18/hr - $19/hr (plus potential to earn additional from our team commission scheme)<br/><br/>WHAT SKILLS DO I NEED FOR THIS ROLE?<br/><br/><ul><li>Good organization skills</li><li>Ability to prioritize</li><li>Good team player who works well with others to achieve goals</li><li>Strives to achieve and drive the best results possible</li><li>Able to communicate with others clearly, effectively and with respect</li><li>Follows instruction and direction accurately</li><li>Proactive and able to think innovatively</li><li>Ensures personal presentation is in line with the expectations of the business</li><li>Reliable and acts in a timely manner</li><li>Able to manage conflict</li><li>Motivational skills</li><li>Flexible in order to meet needs of the business<br/><br/></li></ul>ABOUT THE LOCATION<br/><br/>Our North America region is made up of 76 retail locations across the US and Canada with our flagship store in SoHo, New York City. We are primarily based out of our Los Angeles studios, bringing our brand infamous aesthetic to the West Hollywood hills.<br/><br/><strong>What We Stand For<br/><br/></strong><strong>The Customer is the Boss</strong> We work as one proud team to get the best for our customers<br/><br/><strong>One Team</strong> We are joined up and encourage others to share their ideas<br/><br/><strong>We Do What We Say We Will</strong> We know our goals, and we work with clear outcomes in mind<br/><br/><strong>We Are Responsible</strong> We are self aware, understand the impact we have on others and are positive about the future", "responsibilities": "<ul><li>Responsible for the process of replenishment</li><li>Ensure all procedures are followed to minimize stock loss</li><li>Ensure stock rotation processes are adhered to</li><li>Ensure stock level information is communicated effectively</li><li>Responsibility for deliveries into the store being managed effectively</li><li>Responsible for stock delivery and merchandising</li><li>Ensuring correct swing ticket information is on all products</li><li>Ensuring tag check procedures are adhered to</li><li>Responsible for ensuring tagging procedures are followed</li><li>Ensure all fire exits/ walkways are free from boxes of delivery/ combustibles</li><li>Ensuring lifting and handling of deliveries are dealt with in the correct manner<br/><br/></li></ul>", "qualifications": {"required": "Good organization skills, Ability to prioritize, Good team player who works well with others to achieve goals, Strives to achieve and drive the best results possible, Able to communicate with others clearly, effectively and with respect, Follows instruction and direction accurately, Proactive and able to think innovatively, Ensures personal presentation is in line with the expectations of the business, Reliable and acts in a timely manner, Able to manage conflict, Motivational skills, Flexible in order to meet needs of the business"}, "skills": ["Organization", "Prioritization", "Teamwork", "Communication", "Instruction Following", "Proactivity", "Presentation", "Reliability", "Conflict Management", "Motivation", "Flexibility"], "postedDate": "2 weeks ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3990122591"}