{"jobTitle": "Brand Manager", "company": {"name": "Ritual", "industry": "Wellness and Fitness Services", "size": "120+", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$82,000 - $135,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Wellness and Fitness Services", "description": "Ritual is a personal health brand that is building the future of daily essentials. Our mission is simple: we help turn healthy habits into a Ritual. We started by creating the first visible supply chain of its kind and reinventing the daily multivitamin from the ground up. Now, together with some of the world’s leading scientists, researchers and advisors, we’re developing a new standard of high-quality, traceable daily products across new categories. Hundreds of thousands of customers across generations trust us, and we are growing quickly. We’ve built a team of over 120 (and counting) curious skeptics, world-class scientists, unconventional artists, expert marketers, and analytical strategists. We’re venture-backed and based in sunny Los Angeles. If you’re looking to challenge the status quo and be challenged to do the best work of your career, join us.", "responsibilities": "Lead omni-channel marketing strategy and planning for select Ritual products. Lead integrated marketing campaigns with Acquisition and Customer that drive revenue & sales growth, product NPS, and product retention and LTV. Lead go-to-market of new products, including integrated marketing strategy, creative briefing, and campaign execution to deliver against marketing goals. Lead ongoing messaging optimization to drive ad effectiveness, hook rate and CPA’s across products & persona segments. Lead monthly omni-channel deep dives of our sales performance across DTC, wholesale, & Amazon, and provide actionable insights and recommendations for optimization. Manage product renovations, including expansions, reformulations, and packaging refreshes. Partner with Consumer Insights and Product Innovation to assess the needs of existing customers and prospects and identify new product opportunities. Oversee company objectives & strategies, providing monthly reporting against KPI’s, and propose and lead projects to ensure goals are achieved.", "qualifications": {"required": "Education: BS/BA, preferably in Marketing, Business or Communications field. Equivalent experience also accepted. Experience: 3+ years of experience in Brand Management preferably in CPG or VMS. Expertise guiding strategic decisions and gaining buy-in across multidisciplinary teams. Deep understanding of DTC businesses, performance marketing, and digital KPIs. Exceptional writing and presentation skills.", "preferred": ""}, "skills": ["Strategic thinking", "Creatively minded", "Results oriented", "Exceptional collaboration skills", "Strong communication skills", "Self motivated"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "401k Match - Up to 4%, Medical/Dental/Vision/Life Insurance, Healthcare & Dependent Care FSA, 20 Weeks of 100% paid Parental Leave + 4 weeks of flex time upon return for birthing people, Talkspace access for mental health support, Pet Insurance discount, Unlimited PTO Policy - 2 weeks (10 days) minimum to keep you fresh, 11 paid holidays, 7 additional paid days off around holidays, 12 “Fourth Fridays” off - Days the entire company takes off each month to recharge, 4 “Ritual Days of Action” - Days the entire company volunteers, Focus Fridays - No meeting days to focus on heads-down work and development, Free Ritual Products, Annual Wellness stipend, Monthly Childcare stipend, New hire Work from Home stipend, Bi-Annual Performance Reviews, Bi-Annual in-person company events, Monthly wellness activities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990964271"}