{"jobTitle": "Creative Design Manager, Product Development - Consumer Products", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "170,000.00/yr - 360,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>We are pursuing consumer products because we believe it will amplify our stories with our fans. Extending the impact of our content both on and off the platform, CP makes the intangible tangible and creates ways for our fans to interact with our brand and titles in a way that makes sense to them. We want merchandise, interactive games, and experiences to help promote and extend stories for our titles, so ideally they become part of the zeitgeist and at the very least give joy - our primary focus.<br/><br/>That’s where you come in. We are looking for a unique individual who can lead the vision, tone, and graphic strategy around our global titles. Provide clarity in the fast-moving nascent stages of product development activations and pre-production of our content. The successful individual is someone, who can anticipate challenges, actively listen, and provide creative solutions for any style or story. You’ll challenge the status quo and you’ll stop at nothing to best represent content creators, Netflix and, of course, the fans.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Lead creative strategy and asset development across our consumer products portfolio, consisting of a wide range of titles and brands.</li><li>Be an integral part of the Global Product Development &amp; Creative team overseeing all aspects of creative asset development through creative strategy, planning and development of creative assets for titles and activations globally through style guides and other creative assets.</li><li>Ensure best-in-class creative output and consistently evolve our creative approach on all our titles and brands, constantly challenging process and status quo.</li><li>Lead a team of in-house designers as well as direct external freelancers and design agencies. </li><li>Partner with a planner, product development teams, and cross-functional peers to define and maintain timelines and budgets to ensure projects run smoothly and on time. </li><li>In partnership with the Creative Planner, collaborate with x-functional partners and stakeholders across content makers, brand partnerships, legal, creative marketing and regional marketing teams where applicable to maximize the impact of our strategies.<br/><br/></li></ul><strong>What We Need From You<br/><br/></strong><ul><li>Experienced creative with 7+ years of experience in managing the development of productive development style guides and design portfolios. Branding guides are a plus but not necessary.</li><li>Strong understanding of the process of product development in all categories.</li><li>Excellent communication skills, both verbal and digital including the ability to communicate clearly and effectively with all levels.</li><li>Confident liaising with stakeholders, making decisions where necessary and escalating problems or project blockers.</li><li>Agile approach; a love for solving problems and dealing with challenges and changes.</li><li>Overwhelming excitement for innovative creative assets - both hands on and strong directional skills.</li><li>Strong people management skills with lots of positive energy.</li><li>Great project, organization and time management skills.</li><li>Adobe Suite fluency is essential.</li><li>An existing network of freelancers/agencies/production partners would be advantageous.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $360,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Lead creative strategy and asset development across our consumer products portfolio, consisting of a wide range of titles and brands.\nBe an integral part of the Global Product Development & Creative team overseeing all aspects of creative asset development through creative strategy, planning and development of creative assets for titles and activations globally through style guides and other creative assets.\nEnsure best-in-class creative output and consistently evolve our creative approach on all our titles and brands, constantly challenging process and status quo.\nLead a team of in-house designers as well as direct external freelancers and design agencies.\nPartner with a planner, product development teams, and cross-functional peers to define and maintain timelines and budgets to ensure projects run smoothly and on time.\nIn partnership with the Creative Planner, collaborate with x-functional partners and stakeholders across content makers, brand partnerships, legal, creative marketing and regional marketing teams where applicable to maximize the impact of our strategies.", "qualifications": {"required": "Experienced creative with 7+ years of experience in managing the development of productive development style guides and design portfolios. Branding guides are a plus but not necessary.\nStrong understanding of the process of product development in all categories.\nExcellent communication skills, both verbal and digital including the ability to communicate clearly and effectively with all levels.\nConfident liaising with stakeholders, making decisions where necessary and escalating problems or project blockers.\nAgile approach; a love for solving problems and dealing with challenges and changes.\nOverwhelming excitement for innovative creative assets - both hands on and strong directional skills.\nStrong people management skills with lots of positive energy.\nGreat project, organization and time management skills.\nAdobe Suite fluency is essential.\nAn existing network of freelancers/agencies/production partners would be advantageous.", "preferred": ""}, "skills": ["Creative Strategy", "Asset Development", "Product Development", "Communication", "Stakeholder Management", "Adobe Suite", "Freelancer Management", "Design Agency Management", "Project Management", "Time Management", "Branding"], "postedDate": "3 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3990121624"}