{"jobTitle": "Sr Manager, Executive Search", "company": {"name": "Warner Bros. Discovery", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Entertainment Providers", "description": "<strong><em>Welcome to Warner Bros. Discovery… the stuff dreams are made of.<br/><br/></em></strong><strong>Who We Are…<br/><br/></strong>When we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the <em>storytellers</em> bringing our characters to life, the<em> creators</em> bringing them to your living rooms and the <em>dreamers</em> creating what’s next…<br/><br/>From brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.<br/><br/><strong>Your New Role<br/><br/></strong>This position will manage and execute high level, cross divisional executive searches supporting LOB hiring needs and WBD’s enterprise-wide talent acquisition objectives. Based in Burbank, the Sr Manager will be a ‘specialized generalist’ ideally with facility in line with our west coast creative businesses<br/><br/><strong>Your Role Accountabilities<br/><br/></strong><ul><li>Execute specific senior-level searches while serving as a key member of the team on all the US search assignments, projects, and other talent activities. Partner proactively and strategically with the Global Research function on all executive search activity, and continually increase presence of both diverse and internal candidates for all searches.</li><li>Partner proactively and strategically with key P&amp;C partners: P&amp;C Business Partners and COEs.</li><li>Manage and develop deep and sophisticated internal and external relations with senior executives across the WBD portfolio and key competitors to “know’ and be “known” by key talent both within the company and our competitive set.</li><li>Work successfully and collaboratively as a strategic business partner with participating client divisions and members of the GES team to provide a seamless and effective executive search experience.</li><li>Engage in business development activity across the company in deepening existing relationships and building new relationships through our multiple service offerings.<br/><br/></li></ul><strong>Qualifications &amp; Experience<br/><br/></strong><ul><li>The ideal candidate will have a proven track record as a successful executive recruiter either with a reputable executive search firm or within the Recruiting department of a well-regarded global corporation.</li><li>Undergraduate degree required.</li><li>This executive will have extensive executive search experience in execution, team leadership, and client management.</li><li>Specific media/ entertainment/digital experience is highly preferred.</li><li>Experience ideally should include a combination of agency (retained and contingency) and corporate recruitment in a global company.</li><li>Must have the ability to build strong business partnerships internally and externally and partner with multiple stakeholders, including P&amp;C Partners, Compensation Partners, and Senior Management, to influence and guide the recruitment process.</li><li>Ability to present solutions to senior management promptly and concisely.<br/><br/></li></ul><strong>How We Get Things Done…<br/><br/></strong>This last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.<br/><br/><strong>Championing Inclusion at WBD<br/><br/></strong>Warner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.<br/><br/>If you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com.<br/><br/>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $109,900.00 - $204,100.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.", "responsibilities": "This position will manage and execute high level, cross divisional executive searches supporting LOB hiring needs and WBD’s enterprise-wide talent acquisition objectives. Based in Burbank, the Sr Manager will be a ‘specialized generalist’ ideally with facility in line with our west coast creative businesses", "qualifications": {"required": "The ideal candidate will have a proven track record as a successful executive recruiter either with a reputable executive search firm or within the Recruiting department of a well-regarded global corporation.\nUndergraduate degree required.\nThis executive will have extensive executive search experience in execution, team leadership, and client management.\nSpecific media/ entertainment/digital experience is highly preferred.\nExperience ideally should include a combination of agency (retained and contingency) and corporate recruitment in a global company.\nMust have the ability to build strong business partnerships internally and externally and partner with multiple stakeholders, including P&amp;C Partners, Compensation Partners, and Senior Management, to influence and guide the recruitment process.\nAbility to present solutions to senior management promptly and concisely.", "preferred": "Specific media/ entertainment/digital experience is highly preferred."}, "skills": [], "postedDate": "3 days ago", "benefits": "WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.", "remoteWork": "No", "salary": {"amount": "109,900.00 - 204,100.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3990925527"}