{"jobTitle": "Product Manager, Content Promotion and Distribution, Live Promotional Media", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Now is an amazing time to join Netflix as we seek to entertain the world. We have over 275 million paid members in over 190 countries, and we won’t stop there. As we grow globally, we have increasing opportunities to entertain and delight our members in new ways. As the Product Manager, Live Promotional Media you will create technology that enables our partners to create great promotional assets (still image and video) at scale for our growing Live content catalog, including WWE, NFL, and more. At Netflix, our product team is small so you have the opportunity to make a big impact.<br/><br/>Content Promotion and Distribution sits at the intersection of the consumer experience and the Netflix Studio. Our team is integral to making the Netflix experience feel personal and relevant by developing innovative approaches to how we promote, localize, and distribute content. Because our products touch both members and content creators, we seek someone who can fluidly move among both worlds, applying strong product principles and strategic frameworks to the member experience, while deeply empathizing with the art and craft required to create great content.<br/><br/><strong>As a Product Manager At Netflix You Will<br/><br/></strong><ul><li>Build a strategic roadmap and take product concepts from idea through validation, shipping, measurement, and iteration.</li><li>Author strategy memos and presentations and represent your team’s work to senior executives.</li><li>Lead a team of stunning colleagues across design, engineering, and data science to deliver outstanding products to our customers. </li><li>Build business cases and measure the impact of your product innovation.</li><li>Deeply understand and socialize the evolving needs of our customers, with your design partners.<br/><br/></li></ul><strong>As the Product Manager, Live Promotional Media you will be responsible for:<br/><br/></strong><ul><li>Being the product manager that owns our promotional media technology strategy for Live content experiences</li><li>Being the lead product manager partnering with our Product Creative Studio partners who are responsible for the the promotional assets for Live content experiences</li><li>Developing and delivering a roadmap that balances the needs of our partner teams and prioritizes what is most impactful for our members and the business</li><li>Leading cross-functional teams including design, engineering, and data science to discover and execute opportunities</li><li>Communicating your strategy broadly throughout the organization<br/><br/></li></ul><strong>Our wish list for the person in this role (remember, no one ever gets everything on their wish list!):<br/><br/></strong><ul><li>Experience working with creative teams and/or building products for creative teams</li><li>Experience working with creation of promotional media (image and video)</li><li>Experience building operational workflow products</li><li>Experience working on a product team with a proven record of prioritizing and successfully launching products or platforms</li><li>Worked in a direct-to-consumer business, where the consumer is paying for the service</li><li>Ability to inspire, motivate and lead a cross-functional team - your ability to build strong relationships is critical to success</li><li>Deep experience using data to inform priorities and evaluate impact of initiatives</li><li>Excellent verbal and written communication skills - you will write a lot!</li><li>Experience working on internal products or B2B enterprise products</li><li>Has strong instincts for outstanding customer experience</li><li>Embodies the Netflix real values while also bringing a new perspective to improve our culture. We strongly believe that diversity of experiences, perspectives, and backgrounds will lead to a better environment for our employees and better products for our customers. <br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120k - $515k.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "jobFunction": "Other", "industry": "Entertainment Providers", "salary": {"amount": "120,000.00 - 515,000.00", "currency": "USD"}, "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "remoteWork": "No", "skills": ["Product Management", "Strategy", "Leadership", "Cross-functional Collaboration", "Data Analysis", "Communication", "Customer Experience", "Creative Teams", "Promotional Media", "Workflow Products", "Direct-to-consumer", "Netflix Culture"], "url": "https://www.linkedin.com/jobs/view/3991020378"}