{"jobTitle": "Senior Manager, Sales Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$136,000—$200,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>Our Account Development Strategy &amp; Operations team is responsible for designing, building, and running a world-class sales organization to successfully grow our SMB restaurants through leading product solutions. It supports the sales specialist team that focuses on DoorDash Platform Services: our company’s hyper growth business unit that allows restaurants to enable ecommerce ordering fulfillment for their first-party experiences (i.e., website and in-store). The Platform product portfolio consists of Online Ordering, Tableside Order &amp; Pay, CRM, Mobile Apps, and Websites — all designed to maximize sales for merchants while fitting seamlessly into their existing operations and brand.<br/><br/>About The Role<br/><br/>As a Senior Manager of Sales Strategy &amp; Operations at DoorDash, you will play a pivotal role in accelerating growth via DoorDash’s Platform suite for SMB restaurants. You will be responsible for leading a team in driving increased sales productivity, optimized sales allocation, and best-in-class operational excellence to achieve ambitious growth goals in partnership with our SMB Sales organization. The ideal candidate will bring a blend of both strategy and execution – setting the sales vision to enable DoorDash to become a B2B SaaS powerhouse, while driving operational rigor to problem solve and enable our sales team’s success. You will report to the Director of Sales Strategy &amp; Operations, working closely with cross-functional teams to strategize how we grow DoorDash merchants’ first-party business at scale through products, drive strategic pushes into key opportunities, and operationalize our go-to-market efforts.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>\n<ul><li>Lead post-sales strategy for top company priorities. DoorDash built its lead in restaurant selection through a cohesive and scaled sales effort. We now see an exciting opportunity to catapult our restaurant partners’ first-party growth via DoorDash’s Platform Services. This role will develop a clear strategic vision for Platform sales strategy, aligning it with DoorDash's overarching business goals.</li><li>Build a high-performing sales strategy function. The AD Platform S&amp;O lead will bring operational excellence in forecasting and rigorous pipeline tracking, improve sales performance, optimize sales productivity, identify opportunities for growth, and lead data-driven decision-making.</li><li>Partner with our cross-functional teams to elevate our offering. To optimize the existing and win the next tier of SMBs, we must evolve our service. This role will harness sales teams’ feedback and our technology to give voice to the merchant, guiding our roadmap with our Product teams. </li><li>Look around corners for the team. Whether planning for the next quarter, for the next year with new products, or for several years down with new organizations, this role will be responsible for shepherding our Account Development Platform team into the future. <br/><br/></li></ul>We’re Excited About You Because…<br/><br/>\n<ul><li>You’re a high achieving strategy and operations leader. You provide strategic leadership to your cross-functional team, ensuring that every aspect of the sales operations is aligned with the overarching business strategy. You have worked with sales teams to build and execute pipeline strategies. You know how to deep dive sales teams’ challenges, both to understand and resolve their pain points at an individual level and to create system-wide solutions. You demonstrate ownership by taking responsibility for the outcomes of your business, adapting to challenges, and ruthlessly prioritizing to meet goals.</li><li>You’re accustomed to complex and multi-stakeholder environments. This will include Sales for org structure and attainment, Product for roadmaps and feedback, Sales Planning for goals and tracking, Analytics for dashboard resources, to name a few. You embody our “one team, one fight” mentality in partnering with our Account Management counterparts, who own the relationship with our restaurant partners.</li><li>You find and lead 0 to 1 opportunities. We are constantly enhancing existing products and introducing new products to our suite of services. We are looking for someone who loves to get to the lowest level of detail to help find product-market fit and scale small businesses within large organizations.</li><li>You look for the win win wins. The scale of our ambition is great and we look to our leaders to balance unbridled optimism in finding the wins for our customers, their team, DoorDash and truth-seeking challenger mindset to guide the team towards those wins.<br/><br/></li></ul>We expect this position to be filled by 9/30/2024.<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Compensation<br/><br/>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.<br/><br/>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.<br/><br/>Additionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.<br/><br/>To learn more about our benefits, visit our careers page here.<br/><br/>The base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.<br/><br/>$136,000—$200,000 USD<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "Lead post-sales strategy for top company priorities. DoorDash built its lead in restaurant selection through a cohesive and scaled sales effort. We now see an exciting opportunity to catapult our restaurant partners’ first-party growth via DoorDash’s Platform Services. This role will develop a clear strategic vision for Platform sales strategy, aligning it with DoorDash's overarching business goals.\nBuild a high-performing sales strategy function. The AD Platform S&amp;O lead will bring operational excellence in forecasting and rigorous pipeline tracking, improve sales performance, optimize sales productivity, identify opportunities for growth, and lead data-driven decision-making.\nPartner with our cross-functional teams to elevate our offering. To optimize the existing and win the next tier of SMBs, we must evolve our service. This role will harness sales teams’ feedback and our technology to give voice to the merchant, guiding our roadmap with our Product teams. \nLook around corners for the team. Whether planning for the next quarter, for the next year with new products, or for several years down with new organizations, this role will be responsible for shepherding our Account Development Platform team into the future. ", "qualifications": {"required": "You’re a high achieving strategy and operations leader. You provide strategic leadership to your cross-functional team, ensuring that every aspect of the sales operations is aligned with the overarching business strategy. You have worked with sales teams to build and execute pipeline strategies. You know how to deep dive sales teams’ challenges, both to understand and resolve their pain points at an individual level and to create system-wide solutions. You demonstrate ownership by taking responsibility for the outcomes of your business, adapting to challenges, and ruthlessly prioritizing to meet goals.\nYou’re accustomed to complex and multi-stakeholder environments. This will include Sales for org structure and attainment, Product for roadmaps and feedback, Sales Planning for goals and tracking, Analytics for dashboard resources, to name a few. You embody our “one team, one fight” mentality in partnering with our Account Management counterparts, who own the relationship with our restaurant partners.\nYou find and lead 0 to 1 opportunities. We are constantly enhancing existing products and introducing new products to our suite of services. We are looking for someone who loves to get to the lowest level of detail to help find product-market fit and scale small businesses within large organizations.\nYou look for the win win wins. The scale of our ambition is great and we look to our leaders to balance unbridled optimism in finding the wins for our customers, their team, DoorDash and truth-seeking challenger mindset to guide the team towards those wins."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.\nTo learn more about our benefits, visit our careers page here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3991024120"}