{"jobTitle": "xLab Principal Director", "company": {"name": "The Aerospace Corporation", "location": "El Segundo, CA", "industry": "Defense and Space Manufacturing"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$240,000 - $280,000", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Defense and Space Manufacturing", "description": "The Aerospace Corporation is the trusted partner to the nation’s space programs, solving the hardest problems and providing unmatched technical expertise. As the operator of a federally funded research and development center (FFRDC), we are broadly engaged across all aspects of space— delivering innovative solutions that span satellite, launch, ground, and cyber systems for defense, civil and commercial customers. When you join our team, you’ll be part of a special collection of problem solvers, thought leaders, and innovators. Join us and take your place in space.<br/><br/>At Aerospace, we are committed to providing an inclusive and diverse workplace for all employees to share in our common passion and aspiration – to carry out a mission much bigger than ourselves.<br/><br/><strong>About The Landscape<br/><br/></strong>The Aerospace Corporation’s Experiments Lab, xLab, develops prototypes, instruments, pathfinders, and demonstration systems that target our customers’ hardest problems at a time of increasing strategic importance. We engage with our customers to conceptualize and deliver innovative and impactful solutions (products) for ground and space and everything in between. xLab’s multi-disciplinary engineers and technical staff have a passion for design, a commitment to teamwork and a desire to help Aerospace make a difference to today’s challenges. The 80+ xLab staff comprise many decades of experience that has resulted in hundreds of deliverable instruments and systems.<br/><br/><strong>About The Role<br/><br/></strong>We are seeking an innovative <strong>Principal Director </strong>to lead the xLab, who will report to the Vice President &amp; Chief Technology Officer (CTO), of The Aerospace Corporation. The xLab Principal Director (PD) leads a diverse organization of multi-disciplinary <em>hands-on</em> project managers, engineers and technical staff located primarily in El Segundo, CA and a small but growing contingent in Chantilly, VA. xLab’s $115+M portfolio comprises 20+ projects (at any given time) that span mission areas critical to national security space and to Aerospace’s strategic objectives.<br/><br/>The Principal Director is responsible for executing and evolving the FY24 – FY26 xLab strategies consistent with corporate and CTO objectives, including<br/><br/><ul><li>Evolution of our small satellites to new orbit regimes and form factors to support novel and rapid customer first-of-a kind demonstration missions</li><li>Extend space testbed to support algorithm development for autonomous operation, rendezvous and proximity operations, special sensors</li><li>Demonstration of low SWAP-C sensors, including miniaturization, for remote sensing, area search, space and terrestrial climatology, computing at the edge</li><li>Exploit COTS for rapid responses<br/><br/></li></ul>You should have a strong technical acumen and business development experience, a big-picture vision for impact to our customers, and the ability to drive and develop strong collaborations between xLab, Aerospace’s Engineering &amp; Technology Group (ETG), program offices, and external customers, including SSC, NRO, the intelligence community, NASA and other partners. This position requires a dynamic and collaborative leader who recognizes the unique nature of xLab to design, build, test and deliver first article prototypes, and who will continue the trajectory of the highly successful xLab into the future.<br/><br/><strong>Work Model</strong>: This is a full-time, 100% on-site position based in El Segundo, CA.<br/><br/><strong>What You’ll Be Doing<br/><br/></strong><ul><li>Manage/oversee operation and execution budgets for $30M-$35M annual revenue to deliver impactful prototypes to multiple internal and external customers</li><li>Effectively lead, manage, and direct resources and overall operations of a dynamic and geographically dispersed team of world class engineers, project managers, and technical support team</li><li>Work across xLab and Aerospace to develop solutions that enable enterprise mission success, deliver technical excellence, people excellence, and operational excellence</li><li>Execute and evolve xLab strategies, objectives, etc. within framework of the Office of the Chief Technology Office (OCTO)</li><li>Evolve internal Investments with focus on growing/enhancing xLab’s contribution to corporate success (meet the increasing demand for prototypes delivered on rapid timelines with transition plans)</li><li>Foster and support team development for successful project execution</li><li>Maintain, stimulate, and grow effective partnerships across the enterprise (ETG, NSG, DSG, CSG, and the new Solution Accelerator)</li><li>Develop internal and external relationships through outreach with ETG, customers, industry partners and other FFRDCs, UARCs, and USG Labs</li><li>Lean into challenging work, take responsible risks</li><li>Work with xLab leaders to assign resources, estimate staffing needs, coordinate activities, and connect with requisite stakeholders (laboratory management, safety, budgets, facilities, personnel, equipment, capital, operation efficiencies)</li><li>Grow, develop, and oversee a world class organization that delivers and sustains a diverse, equitable and inclusive environment committed to excellence<br/><br/></li></ul><strong>Minimum Requirements<br/><br/></strong><strong>What You Need to be Successful<br/><br/></strong><ul><li>Bachelors degree in engineering, physical/space science or equivalent</li><li>Ten or more years related, progressive experience</li><li>Demonstrated experience leading, managing, and overseeing highly technical, multi-disciplinary and geographically-distributed, teams to execute a project portfolio</li><li>Engineering and program management experience in delivering complex, technical solutions as deliverable products</li><li>Experience executing and defining strategy, developing and communicating implementation plans, executing plans and/or directing individuals in partner organizations to support their execution</li><li>Comfort with ambiguity, and ability to drive results in a rapidly evolving internal corporate and customer environment</li><li>Outstanding interpersonal, verbal, and written communication skills, and ability to effectively work with all levels of management and support organizations, including customers and contractors.</li><li>Demonstrated management skills across budgeting, planning, and recruiting and developing top technical diverse talent</li><li>Ability to obtain and maintain a US TS/SCI security clearance, which is issued by the US government. US citizenship is required</li><li>Ability to travel regularly<br/><br/></li></ul><strong>How You Can Stand Out<br/><br/></strong><em>It would be impressive if you have one or more of these:<br/><br/></em><li>An advanced STEM degree; a degree in business administration</li><li>Experience demonstrating success leading, managing, and overseeing highly technical cross-discipline teams to execute an extensive prototype project portfolio (multi-discipline, multi-mission, concurrent execution and operation)</li><li>Demonstrated thought leadership, strategic thinking, and entrepreneurial skills applied to managing, maintaining and growing a business </li><li>Proven capability of effectively interacting with senior government officials and corporate executives </li><li>Business operations experience (procurement, facilities, safety, lab management and maintenance)</li>Breadth of cradle to grave experience in systems engineering, programmatics (cost, schedule, technical performance) for rapid projects (<li>Experience developing and delivering federally funded science, technology, and engineering solutions for an FFRDC or federally funded laboratory</li><li>Recognition as a subject matter expert with publications, presentations, or contributions to the broader community of practice</li><li>Familiarity with Aerospace Corporation’s customers and working in a classified environment</li><li>A track record of successful change management</li><li>Current active TS/SCI<br/><br/></li>We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. The grade-based pay range for this job is listed below. Individual salaries within that range are determined through a wide variety of factors including but not limited to education, experience, knowledge and skills.<br/><br/>(Min - Max)<br/><br/>$240,000 - $280,000<br/><br/>Pay Basis: Annual<br/><br/><strong>Leadership Competencies<br/><br/></strong>Our leadership philosophy is simple: every employee, regardless of level and role, can demonstrate leadership. At Aerospace, our commitment is our people. To cultivate our talent and ensure that we have a strong pipeline of future leaders, we want individuals who:<br/><br/><ul><li>Operate Strategically</li><li>Lead Change   </li><li>Engage with Impact   </li><li>Foster Innovation   </li><li>Deliver Results <br/><br/></li></ul><strong>Ways We Reward Our Employees <br/><br/></strong>During your interview process, our team will provide details of our industry-leading benefits.<br/><br/>Benefits vary and are applicable based on Job Type. <em>A few highlights include:<br/><br/></em><ul><li>Comprehensive health care and wellness plans</li><li>Paid holidays, sick time, and vacation</li><li>Standard and alternate work schedules, including telework options</li><li>401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire</li><li>Flexible spending accounts</li><li>Variable pay program for exceptional contributions</li><li>Relocation assistance</li><li>Professional growth and development programs to help advance your career</li><li>Education assistance programs</li><li>An inclusive work environment built on teamwork, flexibility, and respect<br/><br/></li></ul>We are all unique, from diverse backgrounds and all walks of life, yet one thing bonds all of us to each other—the belief that we can make a difference. This core belief empowers us to do our best work at The Aerospace Corporation.<br/><br/><strong>Equal Opportunity Commitment <br/><br/></strong>The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, age, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender, gender identity or expression, color, religion, genetic information, marital status, ancestry, national origin, protected veteran status, physical disability, medical condition, mental disability, or disability status and any other characteristic protected by state or federal law. If you’re an individual with a disability or a disabled veteran who needs assistance using our online job search and application tools or need reasonable accommodation to complete the job application process, please contact us by phone at 310.336.5432 or by email at ieo.mailbox@aero.org. You can also review Know Your Rights: Workplace Discrimination is Illegal, as well as the Pay Transparency Policy Statement.", "responsibilities": "The Principal Director is responsible for executing and evolving the FY24 – FY26 xLab strategies consistent with corporate and CTO objectives, including<br/><br/><ul><li>Evolution of our small satellites to new orbit regimes and form factors to support novel and rapid customer first-of-a kind demonstration missions</li><li>Extend space testbed to support algorithm development for autonomous operation, rendezvous and proximity operations, special sensors</li><li>Demonstration of low SWAP-C sensors, including miniaturization, for remote sensing, area search, space and terrestrial climatology, computing at the edge</li><li>Exploit COTS for rapid responses<br/><br/></li></ul>You should have a strong technical acumen and business development experience, a big-picture vision for impact to our customers, and the ability to drive and develop strong collaborations between xLab, Aerospace’s Engineering &amp; Technology Group (ETG), program offices, and external customers, including SSC, NRO, the intelligence community, NASA and other partners. This position requires a dynamic and collaborative leader who recognizes the unique nature of xLab to design, build, test and deliver first article prototypes, and who will continue the trajectory of the highly successful xLab into the future.<br/><br/><strong>Work Model</strong>: This is a full-time, 100% on-site position based in El Segundo, CA.<br/><br/><strong>What You’ll Be Doing<br/><br/></strong><ul><li>Manage/oversee operation and execution budgets for $30M-$35M annual revenue to deliver impactful prototypes to multiple internal and external customers</li><li>Effectively lead, manage, and direct resources and overall operations of a dynamic and geographically dispersed team of world class engineers, project managers, and technical support team</li><li>Work across xLab and Aerospace to develop solutions that enable enterprise mission success, deliver technical excellence, people excellence, and operational excellence</li><li>Execute and evolve xLab strategies, objectives, etc. within framework of the Office of the Chief Technology Office (OCTO)</li><li>Evolve internal Investments with focus on growing/enhancing xLab’s contribution to corporate success (meet the increasing demand for prototypes delivered on rapid timelines with transition plans)</li><li>Foster and support team development for successful project execution</li><li>Maintain, stimulate, and grow effective partnerships across the enterprise (ETG, NSG, DSG, CSG, and the new Solution Accelerator)</li><li>Develop internal and external relationships through outreach with ETG, customers, industry partners and other FFRDCs, UARCs, and USG Labs</li><li>Lean into challenging work, take responsible risks</li><li>Work with xLab leaders to assign resources, estimate staffing needs, coordinate activities, and connect with requisite stakeholders (laboratory management, safety, budgets, facilities, personnel, equipment, capital, operation efficiencies)</li><li>Grow, develop, and oversee a world class organization that delivers and sustains a diverse, equitable and inclusive environment committed to excellence<br/><br/></li></ul>", "qualifications": {"required": "Bachelors degree in engineering, physical/space science or equivalent, Ten or more years related, progressive experience, Demonstrated experience leading, managing, and overseeing highly technical, multi-disciplinary and geographically-distributed, teams to execute a project portfolio, Engineering and program management experience in delivering complex, technical solutions as deliverable products, Experience executing and defining strategy, developing and communicating implementation plans, executing plans and/or directing individuals in partner organizations to support their execution, Comfort with ambiguity, and ability to drive results in a rapidly evolving internal corporate and customer environment, Outstanding interpersonal, verbal, and written communication skills, and ability to effectively work with all levels of management and support organizations, including customers and contractors., Demonstrated management skills across budgeting, planning, and recruiting and developing top technical diverse talent, Ability to obtain and maintain a US TS/SCI security clearance, which is issued by the US government. US citizenship is required, Ability to travel regularly", "preferred": "An advanced STEM degree; a degree in business administration, Experience demonstrating success leading, managing, and overseeing highly technical cross-discipline teams to execute an extensive prototype project portfolio (multi-discipline, multi-mission, concurrent execution and operation), Demonstrated thought leadership, strategic thinking, and entrepreneurial skills applied to managing, maintaining and growing a business , Proven capability of effectively interacting with senior government officials and corporate executives , Business operations experience (procurement, facilities, safety, lab management and maintenance), Breadth of cradle to grave experience in systems engineering, programmatics (cost, schedule, technical performance) for rapid projects (Experience developing and delivering federally funded science, technology, and engineering solutions for an FFRDC or federally funded laboratory, Recognition as a subject matter expert with publications, presentations, or contributions to the broader community of practice, Familiarity with Aerospace Corporation’s customers and working in a classified environment, A track record of successful change management, Current active TS/SCI"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. The grade-based pay range for this job is listed below. Individual salaries within that range are determined through a wide variety of factors including but not limited to education, experience, knowledge and skills.<br/><br/>(Min - Max)<br/><br/>$240,000 - $280,000<br/><br/>Pay Basis: Annual<br/><br/><strong>Leadership Competencies<br/><br/></strong>Our leadership philosophy is simple: every employee, regardless of level and role, can demonstrate leadership. At Aerospace, our commitment is our people. To cultivate our talent and ensure that we have a strong pipeline of future leaders, we want individuals who:<br/><br/><ul><li>Operate Strategically</li><li>Lead Change   </li><li>Engage with Impact   </li><li>Foster Innovation   </li><li>Deliver Results <br/><br/></li></ul><strong>Ways We Reward Our Employees <br/><br/></strong>During your interview process, our team will provide details of our industry-leading benefits.<br/><br/>Benefits vary and are applicable based on Job Type. <em>A few highlights include:<br/><br/></em><ul><li>Comprehensive health care and wellness plans</li><li>Paid holidays, sick time, and vacation</li><li>Standard and alternate work schedules, including telework options</li><li>401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire</li><li>Flexible spending accounts</li><li>Variable pay program for exceptional contributions</li><li>Relocation assistance</li><li>Professional growth and development programs to help advance your career</li><li>Education assistance programs</li><li>An inclusive work environment built on teamwork, flexibility, and respect<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991449531"}