{"jobTitle": "Market Merchandising Specialist", "company": {"name": "Suja Life", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Food and Beverage Services", "description": "<strong>Position Summary<br/><br/></strong>The Market Merchandising Specialist will maximize Suja Life’s availability and visibility, within assigned retail outlets in the North Los Angeles market. This candidate will be the Suja Life brand expert, focusing on our top volume retail partners within the grocery and natural class of trade. Primary activities include minimizing out of stock conditions, assuring schematic compliance, optimizing product merchandising, and selling incremental displays and other activities to drive sales volume.<br/><br/><strong>Merchandising<br/><br/></strong><strong>Essential Duties and Responsibilities<br/><br/></strong><ul><li> Complete daily in-store merchandising calls in assigned retail targets within the market geography, focusing on account development to achieve maximum brand potential. </li><li> Maximize merchandising opportunities by eliminating out of stock conditions and increasing brand presence, and in all assigned retailers. </li><li> Activate and implement strategic sales and marketing initiatives; ensuring account plans address promotions, displays, distribution availability, execution of price and package plans that deliver account objectives. </li><li> Monitor Suja Life’s inventory levels at each location and communicate all potential challenges to your internal and external support team and selling partners (Director of Retail, Sales Lead, Customer Solutions, and any appropriate Distributors or Brokers). <br/><br/></li></ul><strong>Sales<br/><br/></strong><ul><li> Sell-in secondary placement opportunities to individual retail locations, using tools provided by the company. </li><li> Analyze and utilize sales scan, and syndicated data to identify opportunity gaps and increase overall market sales. </li><li> Build and cultivate relationships with all retail level leadership key contacts in produce, and operations to expand reach within store to maximize brand potential in each location and chain covered. </li><li> Develop effective communication and working relationships with applicable selling partners such as distributors and/or broker teams. <br/><br/></li></ul><strong>Communication<br/><br/></strong><ul><li> Effectively communicate all successes, opportunities, and challenges equally via weekly sales recaps and expand as appropriate during standing check-ins and meetings. </li><li> Report daily activities through company provided CRM mobile app. <br/><br/></li></ul><strong>Job Qualifications<br/><br/></strong><ul><li> Bachelor’s Degree highly preferred or 2-5-year successful track record selling consumer products in current area. </li><li> Must possess internal drive and fortitude, high energy, resourceful, responsible, flexible, and excellent organization skills. </li><li> Ability to work in a mobile environment and navigate assigned territory (extensive local travel with some overnight trips based on territory needs). </li><li> Excellent verbal and written communication skills. </li><li> Thrives in both teamwork and independent initiative work environments. </li><li> Capable of analyzing information and assembling sales data for buyers and store managers. </li><li> Proficient in Microsoft Office (Excel, PowerPoint, Word, &amp; Outlook) and ability to learn proprietary software applications. <br/><br/></li></ul><strong>Physical Demands<br/><br/></strong>Must be able to lift 25lbs, move in and out of a car multiple times per day and lift arms above head to place product as needed. This job requires light to medium computer use and standing for extended periods of time.<br/><br/><strong>Benefits<br/><br/></strong>Come join the Suja Life! We offer a competitive benefits package including:<br/><br/><ul><li>Medical, dental, vision, life insurance and other ancillary benefits</li><li>Matching 401k</li><li>Vacation, sick and holiday time off</li><li>Juice Benefits<br/><br/></li></ul><strong>Compensation<br/><br/></strong>$31.00 - $33.00 per hour<br/><br/>Suja Life is proud to be an equal-opportunity employer seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, ancestry, physical or mental disability, medical condition, marital status, genetics, age, or veteran status or any other applicable legally protected status or characteristic. The Company complies with all federal/local/state regulations regarding pay.<br/><br/>#INDHP", "responsibilities": "The Market Merchandising Specialist will maximize Suja Life’s availability and visibility, within assigned retail outlets in the North Los Angeles market. This candidate will be the Suja Life brand expert, focusing on our top volume retail partners within the grocery and natural class of trade. Primary activities include minimizing out of stock conditions, assuring schematic compliance, optimizing product merchandising, and selling incremental displays and other activities to drive sales volume.", "qualifications": {"required": "Must possess internal drive and fortitude, high energy, resourceful, responsible, flexible, and excellent organization skills. Ability to work in a mobile environment and navigate assigned territory (extensive local travel with some overnight trips based on territory needs). Excellent verbal and written communication skills. Thrives in both teamwork and independent initiative work environments. Capable of analyzing information and assembling sales data for buyers and store managers. Proficient in Microsoft Office (Excel, PowerPoint, Word, &amp; Outlook) and ability to learn proprietary software applications.", "preferred": "Bachelor’s Degree highly preferred or 2-5-year successful track record selling consumer products in current area."}, "skills": ["Microsoft Office", "Excel", "PowerPoint", "Word", "Outlook"], "postedDate": "3 weeks ago", "benefits": "Come join the Suja Life! We offer a competitive benefits package including:<br/><br/><ul><li>Medical, dental, vision, life insurance and other ancillary benefits</li><li>Matching 401k</li><li>Vacation, sick and holiday time off</li><li>Juice Benefits<br/><br/></li></ul>", "salary": {"amount": "31.00 - 33.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3991559816"}