{"jobTitle": "xLab Manufacturing Operations Director", "company": {"name": "The Aerospace Corporation", "location": "El Segundo, CA", "industry": "Defense and Space Manufacturing"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$168,200 - $252,400", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing", "description": "The Aerospace Corporation is the trusted partner to the nation’s space programs, solving the hardest problems and providing unmatched technical expertise. As the operator of a federally funded research and development center (FFRDC), we are broadly engaged across all aspects of space— delivering innovative solutions that span satellite, launch, ground, and cyber systems for defense, civil and commercial customers. When you join our team, you’ll be part of a special collection of problem solvers, thought leaders, and innovators. Join us and take your place in space.<br/><br/>At Aerospace, we are committed to providing an inclusive and diverse workplace for all employees to share in our common passion and aspiration – to carry out a mission much bigger than ourselves.<br/><br/>The Aerospace Corporation’s Experiment Lab, xLab, develops prototypes, instruments, pathfinders, and demonstration systems that target our customers’ hardest problems at a time of increasing strategic importance. We engage with our customers to conceptualize and deliver innovative and impactful solutions (products) for ground and space and everything in between. xLab’s multi-disciplinary engineers and technical staff have a passion for design, a commitment to teamwork and a desire to help Aerospace make a difference to today’s challenges.<br/><br/>We are looking for a **Department Director** to lead and provide oversight to our new **xLab Operations Support Department**. You will be responsible for the day-to-day management of ~8-12 technical support staff at our El Segundo, CA and Chantilly, VA campuses, and for our modern labs which include PCB assembly areas, electronics testing, mechanical assembly &amp; test, and environmental test facilities. xLab’s Technical Support Service Manager who is responsible for our Fabrication Services machine shop will be a direct report to you. You will be responsible for evolving the department and its services to support xLab’s growing prototype portfolio and centralizing xLab’s Integration &amp; Test functions.<br/><br/>**Work Model<br/><br/>**This is a full-time, 100% on-site position based in El Segundo, CA.<br/><br/>**What You’ll Be Doing<br/><br/>**<ul><li>Provide leadership, planning, and direction for xLab’s technical support and operations staff (8-12 fabrication, assembly, test and layout technicians)</li><li>Work with other xLab leaders for strategic planning and tactical execution of the prototyping portfolio; recommend areas of improvement for more effective and efficient technical and business operations</li><li>Assign and prioritize resources, determine staffing needs, and coordinate activities and operations working in conjunction with other xLab leaders </li><li>Conduct staff performance reviews, establish departmental and personnel goals, and recommend performance improvement, career development, salary and promotion actions </li><li>Responsible for production control and associated procurements, budget planning, equipment/supply management </li><li>Maintain and support an effective safety and housekeeping best-practice culture for multiple engineering &amp; test laboratories</li><li>Manage lab equipment, including procurement of new equipment and coordinating metrology needs for existing lab test equipment</li><li>Manage inventory and storage for lab supplies, parts and project needs </li><li>Communicate and coordinate activities to counterpart departments, management, and customers<br/><br/></li></ul>**Minimum Requirements<br/><br/>**<strong>What You Need to be Successful - Department Director<br/><br/></strong><ul><li>Bachelor’s degree in a STEM field or equivalent is required</li><li>Substantial experience in a managerial role with proven ability to establish and maintain effective team relationships with contractors, customers, and corporate staff with a focus on engineering and industrial management</li><li>Demonstrated success in developing staff, impacting effective operations, and management of research labs</li><li>Excellent interpersonal skills and ability to influence a technical organization at all staffing levels</li><li>Strong leadership skills to include personnel management experience, communication skills, and a passion for rapid prototyping</li><li>Willing to travel domestically up to 10%</li><li>This position requires the ability to obtain and maintain a Secret level security clearance, which is issued by the US government. U.S. citizenship is required to obtain a security clearance.<br/><br/></li></ul>**How You Can Stand Out<br/><br/>**<em>It would be impressive if you have one or more of these:<br/><br/></em><ul><li>Experience and/or degree in Industrial Engineering, Engineering Management, Business Management</li><li>10 years of demonstrated experience developing and managing in a “first article” prototype lab environment</li><li>Experience with lean manufacturing in an R&amp;D setting</li><li>Working knowledge of workmanship standards (e.g., PCB manufacture, harness manufacture, ESD)</li><li>Proficiency in Jira and Confluence</li><li>Working knowledge of CAE tools used for layout design, e.g., PADS or PADS Expedition, OrCAD<br/><br/></li></ul>We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. The grade-based pay range for this job is listed below. Individual salaries within that range are determined through a wide variety of factors including but not limited to education, experience, knowledge and skills.<br/><br/>(Min - Max)<br/><br/>$168,200 - $252,400<br/><br/>Pay Basis: Annual<br/><br/><strong>Leadership Competencies<br/><br/></strong>Our leadership philosophy is simple: every employee, regardless of level and role, can demonstrate leadership. At Aerospace, our commitment is our people. To cultivate our talent and ensure that we have a strong pipeline of future leaders, we want individuals who:<br/><br/><ul><li>Operate Strategically</li><li>Lead Change   </li><li>Engage with Impact   </li><li>Foster Innovation   </li><li>Deliver Results <br/><br/></li></ul><strong>Ways We Reward Our Employees <br/><br/></strong>During your interview process, our team will provide details of our industry-leading benefits.<br/><br/>Benefits vary and are applicable based on Job Type. <em>A few highlights include:<br/><br/></em><ul><li>Comprehensive health care and wellness plans</li><li>Paid holidays, sick time, and vacation</li><li>Standard and alternate work schedules, including telework options</li><li>401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire</li><li>Flexible spending accounts</li><li>Variable pay program for exceptional contributions</li><li>Relocation assistance</li><li>Professional growth and development programs to help advance your career</li><li>Education assistance programs</li><li>An inclusive work environment built on teamwork, flexibility, and respect<br/><br/></li></ul>We are all unique, from diverse backgrounds and all walks of life, yet one thing bonds all of us to each other—the belief that we can make a difference. This core belief empowers us to do our best work at The Aerospace Corporation.<br/><br/><strong>Equal Opportunity Commitment <br/><br/></strong>The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, age, sex (including pregnancy, childbirth, and related medical conditions), sexual orientation, gender, gender identity or expression, color, religion, genetic information, marital status, ancestry, national origin, protected veteran status, physical disability, medical condition, mental disability, or disability status and any other characteristic protected by state or federal law. If you’re an individual with a disability or a disabled veteran who needs assistance using our online job search and application tools or need reasonable accommodation to complete the job application process, please contact us by phone at 310.336.5432 or by email at ieo.mailbox@aero.org. You can also review Know Your Rights: Workplace Discrimination is Illegal, as well as the Pay Transparency Policy Statement.", "responsibilities": "<ul><li>Provide leadership, planning, and direction for xLab’s technical support and operations staff (8-12 fabrication, assembly, test and layout technicians)</li><li>Work with other xLab leaders for strategic planning and tactical execution of the prototyping portfolio; recommend areas of improvement for more effective and efficient technical and business operations</li><li>Assign and prioritize resources, determine staffing needs, and coordinate activities and operations working in conjunction with other xLab leaders </li><li>Conduct staff performance reviews, establish departmental and personnel goals, and recommend performance improvement, career development, salary and promotion actions </li><li>Responsible for production control and associated procurements, budget planning, equipment/supply management </li><li>Maintain and support an effective safety and housekeeping best-practice culture for multiple engineering &amp; test laboratories</li><li>Manage lab equipment, including procurement of new equipment and coordinating metrology needs for existing lab test equipment</li><li>Manage inventory and storage for lab supplies, parts and project needs </li><li>Communicate and coordinate activities to counterpart departments, management, and customers<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in a STEM field or equivalent is required\nSubstantial experience in a managerial role with proven ability to establish and maintain effective team relationships with contractors, customers, and corporate staff with a focus on engineering and industrial management\nDemonstrated success in developing staff, impacting effective operations, and management of research labs\nExcellent interpersonal skills and ability to influence a technical organization at all staffing levels\nStrong leadership skills to include personnel management experience, communication skills, and a passion for rapid prototyping\nWilling to travel domestically up to 10%\nThis position requires the ability to obtain and maintain a Secret level security clearance, which is issued by the US government. U.S. citizenship is required to obtain a security clearance.", "preferred": "Experience and/or degree in Industrial Engineering, Engineering Management, Business Management\n10 years of demonstrated experience developing and managing in a “first article” prototype lab environment\nExperience with lean manufacturing in an R&amp;D setting\nWorking knowledge of workmanship standards (e.g., PCB manufacture, harness manufacture, ESD)\nProficiency in Jira and Confluence\nWorking knowledge of CAE tools used for layout design, e.g., PADS or PADS Expedition, OrCAD"}, "skills": ["Engineering", "Industrial Management", "Leadership", "Teamwork", "Rapid Prototyping", "Lean Manufacturing", "PCB Manufacture", "Harness Manufacture", "ESD", "Jira", "Confluence", "CAE Tools", "PADS", "PADS Expedition", "OrCAD"], "postedDate": "2 weeks ago", "benefits": "Comprehensive health care and wellness plans\nPaid holidays, sick time, and vacation\nStandard and alternate work schedules, including telework options\n401(k) Plan — Employees receive a total company-paid benefit of 8%, 10%, or 12% of eligible compensation based on years of service and matching contributions; employees are immediately eligible and vested in the plan upon hire\nFlexible spending accounts\nVariable pay program for exceptional contributions\nRelocation assistance\nProfessional growth and development programs to help advance your career\nEducation assistance programs\nAn inclusive work environment built on teamwork, flexibility, and respect", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991015541"}