{"jobTitle": "Key Account Executive", "company": {"name": "Thélios", "industry": "Wholesale Luxury Goods and Jewelry and Wholesale", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "80,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Wholesale Luxury Goods and Jewelry and Wholesale", "description": "Born from the will of LVMH Group, world leader in luxury, to establish itself in the eyewear sector, **Thélios** designs, produces and distributes sunglasses and optical frames for some of its most prestigious Maisons: **Dior, Fendi, Celine, Givenchy, Loewe, Stella McCartney, Kenzo, Berluti, Bulgari, Tag Heuer** and **Fred**! In addition, Thélios owns two proprietary brands, **Barton Perreira** and **Vuarnet**.\n<br/>\n**KEY ACCOUNT EXECUTIVE**\n<br/>\n**POSITION SUMMARY: **We are looking for an individual who will build long-term relationships with our key partners by identifying and delivering customer-centric solutions. These solutions will positively impact customers' sell-out, on-hand inventory, and brand experience. Additionally, this role involves prospecting and developing new partnerships for the channel. Key responsibilities include strategic planning, assortment recommendations, merchandising, training, sales reports and analysis, logistics, and trade marketing.\n<br/>\n**KEY RESPONSIBILITIES**\n<ul><li>Develop and maintain strong relationships between Key Accounts and the company.</li><li>Identify and capitalize on growth opportunities with existing and new customers, focusing on increased brand penetration, distribution (POS), productivity, product launches, and store capacities.</li><li>Lead internal collaboration across divisions and support areas—customer service, trade marketing, commercial teams, and top management—to deliver outstanding solutions tailored to customer needs.</li><li>Execute the brand positioning and key initiatives of Thélios brands within the Key Account Channel.</li><li>Implement merchandising strategies learned during line reviews and construct pre-buys for major accounts in collaboration with the marketing team, both in-person and virtually.</li><li>Lead in-person and virtual training sessions for customers at various levels, ensuring effective coordination.</li><li>Prepare regular reports for senior management, with the ability to forecast trends and track client account metrics.</li><li>Ensure clients receive requested products and services, promptly resolving all key client issues and complaints in collaboration with customer service.</li><li>Attend, prepare, and manage showroom market appointments, and participate in all major trade shows; must be able to travel domestically and internationally based on business needs.</li><li>Perform other duties as assigned.</li></ul>\n<br/>\n**PROFILE**\nBachelor’s Degree in Business Administration or relevant field\nMinimum of 4+ years of account management experience or consultative sales, background in wholesale required\n<ul><li>Strong client relationship and communication skills, both verbal and written, must be motivated and sales-driven</li><li>Strong analytical and leadership skills; must be able to negotiate and be proactive in resolving customer issues</li><li>Ability to multi-task, strong time management skills, and highly detailed oriented</li><li>Genuine passion and advocate of diversity and inclusion and integrates this mentality when making all business decisions (both internal &amp; external). Intermediate knowledge of Microsoft Office and Apple products; Excel required</li><li>Flexibility to travel when needed to meet with clients and attend major company events and industry tradeshows; ability to travel both domestic and international</li></ul>\n<br/>\n*The hiring range for this position ranges from $80,000 - $95,000. The rate of pay offered will be dependent upon candidates’ relevant skills and experience. In addition to base salary, there is opportunity to receive variable compensation incentives.*\n<br/>\n**_Thank you in advance for your interest in this opening. Thélios is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, national origin, ancestry, citizenship, sex, gender (including gender identity and expression), pregnancy, age, sexual orientation, physical or mental disability, medical condition, genetic information, marital status, familial status, veteran status, or any other legally protected status under applicable federal, state or local laws. At this time, only qualified candidates will be contacted. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation._**\n<br/>\n**_Direct applicants only, no third-party staffing inquiries, please._**", "responsibilities": "Develop and maintain strong relationships between Key Accounts and the company. Identify and capitalize on growth opportunities with existing and new customers, focusing on increased brand penetration, distribution (POS), productivity, product launches, and store capacities. Lead internal collaboration across divisions and support areas—customer service, trade marketing, commercial teams, and top management—to deliver outstanding solutions tailored to customer needs. Execute the brand positioning and key initiatives of Thélios brands within the Key Account Channel. Implement merchandising strategies learned during line reviews and construct pre-buys for major accounts in collaboration with the marketing team, both in-person and virtually. Lead in-person and virtual training sessions for customers at various levels, ensuring effective coordination. Prepare regular reports for senior management, with the ability to forecast trends and track client account metrics. Ensure clients receive requested products and services, promptly resolving all key client issues and complaints in collaboration with customer service. Attend, prepare, and manage showroom market appointments, and participate in all major trade shows; must be able to travel domestically and internationally based on business needs. Perform other duties as assigned.", "qualifications": {"required": "Strong client relationship and communication skills, both verbal and written, must be motivated and sales-driven Strong analytical and leadership skills; must be able to negotiate and be proactive in resolving customer issues Ability to multi-task, strong time management skills, and highly detailed oriented Genuine passion and advocate of diversity and inclusion and integrates this mentality when making all business decisions (both internal & external). Intermediate knowledge of Microsoft Office and Apple products; Excel required Flexibility to travel when needed to meet with clients and attend major company events and industry tradeshows; ability to travel both domestic and international", "preferred": "Bachelor’s Degree in Business Administration or relevant field Minimum of 4+ years of account management experience or consultative sales, background in wholesale required"}, "skills": ["Client Relationship", "Communication", "Sales", "Analytical Skills", "Leadership", "Negotiation", "Time Management", "Microsoft Office", "Excel", "Travel"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Paid paternity leave, Commuter benefits, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991371940"}