{"jobTitle": "Human Resources Generalist", "company": {"name": "Synergy Respiratory ", "industry": "Hospitals and Health Care", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "Synergy Respiratory , a Valley Oxygen company, provides home therapy for patients with respiratory diseases. Our innovative approach to the products and services, along with our superior standard for patient care, resulting in 20 years of industry success, with 5 locations across California and Nevada.  <br/><br/>We are currently seeking extraordinary candidates for our  Human Resources Generalist position in the Los Angeles, CA, area. The Human Resource Generalist will run the daily functions of the Human Resource (HR) department including hiring and interviewing staff, administering pay, benefits, and leave, payroll, and enforcing company policies and practices.<br/><br/><strong>Experien</strong> <strong>ce in ADP Workforce Now highly des</strong> <strong> ired <br/><br/></strong><strong>Supervisory Responsibilities<br/><br/></strong><ul><li> May oversee the scheduling, assignments, and daily workflow of subordinate staff in the department. </li><li> May assist with constructive and timely performance evaluations. <br/><br/></li></ul><strong>Duties/Responsibilities<br/><br/></strong><ul><li> Reviews, tracks, and documents compliance with mandatory and non-mandatory training, continuing education, and work assessments. This may include safety training, anti-harassment training, professional licensure, and aptitude exams and certifications. </li><li> Recruits, interviews, and facilitates the hiring of qualified job applicants for open positions; collaborates with departmental managers to understand skills and competencies required for openings. </li><li> Conducts or acquires background checks and employee eligibility verifications. </li><li> Implements new hire orientation and employee recognition programs. </li><li> Performs routine tasks required to administer and execute human resource programs including but not limited to compensation, benefits, and leave; disciplinary matters; disputes and investigations; performance and talent management; productivity, recognition, and morale; occupational health and safety; and training and development. </li><li> Handles employment-related inquiries from applicants, employees, and supervisors, referring complex and/or sensitive matters to the appropriate staff. </li><li> Attends and participates in employee disciplinary meetings, terminations, and investigations. </li><li> Maintains compliance with federal, state, and local employment laws and regulations, and recommended best practices; reviews policies and practices to maintain compliance. </li><li> Maintains knowledge of trends, best practices, regulatory changes, and new technologies in human resources, talent management, and employment law. </li><li> Train employees by employment group on topics such as Sexual Harassment, Progressive Discipline, and general Human Resources in order to provide employees with a fair/consistent workplace. </li><li> HR related Payroll functions, to include, but not limited to: Accounts payable, invoice posting, weekly posting of time card records, updating any changes to the daily time card records on ADP.  Process Payroll accurately and timely. Process payments for Federal and State Taxes. </li><li> Performs other duties as assigned. <br/><br/></li></ul><strong>Required Skills/Abilities<br/><br/></strong><ul><li> Excellent verbal and written communication skills. </li><li> Excellent interpersonal, negotiation, and conflict resolution skills. </li><li> Excellent organizational skills and attention to detail. </li><li> Excellent time management skills with a proven ability to meet deadlines. </li><li> Strong analytical and problem-solving skills. </li><li> Ability to prioritize tasks and to delegate them when appropriate. </li><li> Ability to act with integrity, professionalism, and confidentiality. </li><li> Thorough knowledge of employment-related laws and regulations. </li><li> Proficient with Microsoft Office Suite or related software. </li><li> Proficiency with or the ability to quickly learn the organizations HRIS and talent management systems. <br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>High School Diploma or GED required.</li><li> At least two years of human resource generalist experience preferred but not required. </li><li> SHRM-CP a plus. <br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li> Prolonged periods of sitting at a desk and working on a computer. </li><li> Must be able to lift 15 pounds at times. </li><li> Must be able to access and navigate each department at the organizations facilities. </li><li> Must be able to handle stressful situations for short periods of time. <br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li> Alternative Workweek Schedule, Tuesday through Friday.  </li><li> Comprehensive Health, Dental, Vision and 401 (k) plans with company matching </li><li> Paid Holidays, Vacation, and Sick/PTO </li><li> Mileage Reimbursement and Expense Card</li></ul>", "responsibilities": "The Human Resource Generalist will run the daily functions of the Human Resource (HR) department including hiring and interviewing staff, administering pay, benefits, and leave, payroll, and enforcing company policies and practices.", "qualifications": {"required": "High School Diploma or GED required.", "preferred": "At least two years of human resource generalist experience preferred but not required. \nSHRM-CP a plus."}, "skills": ["ADP Workforce Now", "Human Resources", "Hiring", "Interviewing", "Payroll", "Benefits Administration", "Employee Relations", "Compliance", "Microsoft Office Suite", "HRIS", "Talent Management"], "postedDate": "2 weeks ago", "benefits": "Alternative Workweek Schedule, Tuesday through Friday.  \nComprehensive Health, Dental, Vision and 401 (k) plans with company matching \nPaid Holidays, Vacation, and Sick/PTO \nMileage Reimbursement and Expense Card", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3991779240"}