{"jobTitle": "Purchasing Buyer | Procurement Full-Time Position", "company": {"name": "King Ice", "location": "West Covina, CA"}, "location": "West Covina, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Retail", "description": "Job Description<br/><br/>Hey there, so this job involves tracking lots of key metrics across different platforms and using that info to place future orders. You'd also be negotiating with multiple suppliers to find the best prices and quality for all new products. Part of the role is keeping an up-to-date catalog of over 2,000 product SKUs. Staying on top of industry trends is important too, so attending trade shows, conferences, and webinars. Based on what you learn, you'd identify current hot products and things that aren't selling as well. Working with the retail teams to move slower items. Supporting all the different departments in the company like customer service, shipping, inventory, design, wholesale, and photography. Monitoring and tracking inventory levels to make sure it's accurate for both retail and wholesale. Coordinating regular inventory counts at domestic and overseas warehouses. Generating inventory reports. Coordinating with everyone to ensure accurate orders of new products. Assigning SKUs for all new products and keeping the internal product database up-to-date. Tracking defective products and creating claims reports for suppliers. Reviewing and monitoring all open purchase orders to make sure products arrive on time.<br/><br/>Company Description<br/><br/>Since King Ice’s inception, our team has worked together to contribute to our mission of becoming leaders in the premium streetwear jewelry market. We focus on quality and lifestyle, establishing trends and tracking closely with streetwear fashion and Hip Hop Culture.<br/><br/>Major partnerships include Death Row Records, SEGA, Microsoft Xbox, Pokemon, Snoop Dogg, Wu-Tang Clan, Tupac, Biggie, PlayStation and more.<br/><br/>Major distribution channels are Zumiez, Urban Outfitters, Hibbett's Sports, and PacSun.<br/><br/>Since King Ice’s inception, our team has worked together to contribute to our mission of becoming leaders in the premium streetwear jewelry market. We focus on quality and lifestyle, establishing trends and tracking closely with streetwear fashion and Hip Hop Culture. Major partnerships include Death Row Records, SEGA, Microsoft Xbox, Pokemon, Snoop Dogg, Wu-Tang Clan, Tupac, Biggie, PlayStation and more. Major distribution channels are Zumiez, Urban Outfitters, Hibbett's Sports, and PacSun.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3991818169"}