{"jobTitle": "Hyperion Water Reclamation Plant Manager", "company": {"name": "Partners In Diversity for the City of Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Engineering, Management, and Consulting", "industry": "Air, Water, and Waste Program Management, Government Administration, and Environmental Quality Programs", "description": "With a population of approximately 4 million people, Los Angeles is the second largest city in the United States. It spans nearly 500 square miles and is known for its innovative business sector, rich cultural heritage, and global impact in the field of entertainment. Known as a Green City, Los Angeles continues building on its environmental commitment. Within its water sector, the City of Los Angeles’ objective is converting waste to resources through water recycling, and green power initiatives as well as maintaining clean beaches that are critical to a thriving Los Angeles culture and economy.\n\nThe Hyperion Water Reclamation Plant is the backbone of clean, sustainable water in Los Angeles. It is one of the largest facilities in the world with a 450 million gallon per day (MGD) average dry weather capacity. The City’s wastewater system serves Los Angeles residents and 29 agencies that contract for this public works service. The system comprises more than 6,700 miles of sewer pipelines and four water reclamation plants that can collectively process over 580 million gallons of flow each day. In the coming years, Hyperion will transform from full secondary treatment to recycling water for potable use, all while maintaining the highest standards of public health and environmental protection.\n\nOur client, the City of Los Angeles, seeks to find experienced candidates for the Hyperion Water Reclamation Plant Manager (HWRPM) position. Ideal candidates will demonstrate expert knowledge of wastewater engineering and possess a proven track record as a leader with outstanding management skills. They will manage an annual operating budget of $135 million and staff of 450 employees. The HWRPM reports to the Director and General Manager of LASAN.\n\nThe Position:\n\nThe HWRPM oversees operations, engineering, resiliency programs, capital improvements and maintenance activities. This role is responsible for compliance with all permit requirements and regulations. It is supported by the Hyperion Process Engineering and Operations Manager, the Hyperion Maintenance Manager, the Hyperion Resiliency Manager, and the Water Recycling Manager. The HWRPM will demonstrate proactive, hands-on, participative management experience and possess excellent interpersonal, problem solving, communication, leadership, and financial management skills.\n\nQualifications and key attributes include:\n\n~Technical expertise to handle all aspects of managing a large water reclamation plant.\n~Excellent leadership skills to inspire and motivate a staff of 450 and work as a team with one unified direction.\n~Innovative, visionary, strategic planning skills to lead resiliency upgrades and transform Hyperion into one of the country’s largest potable reuse facilities.\n\nAdditional Duties and Responsibilities:\n\n~ Oversees operations, engineering and maintenance at HWRP.\n~ Sets goals for water reclamation plant operations and confers with the Clean Water Labor Management Committee regarding policies.\n~ Reviews proposals for changes, additions, or alterations to water reclamation plant facilities and makes recommendations on their feasibility.\n~ Issues directives and policy statements concerning water reclamation plant activities.\n~ Evaluates and schedules plant goals and objectives and initiates improvements and modifications.\n~ Studies new developments in wastewater treatment and water recycling processes, facilities, and plant equipment and makes recommendations for incorporating\nchanges.\n~ Prepares or supervises the preparation of operating budgets and administrative analysis.\n~ Oversees the Biosolids Management Program to ensure diversification of management alter\nalternatives.\n~ Oversees operation of the Hyperion Bioenergy Facility to produce over 20 MW of renewable power and steam from the plant’s digester gas.\n~ Oversees a comprehensive effort to produce recycled water at Hyperion. This includes identifying treatment methodologies, and operational needs.\n~ Manages the development and implementation of plans to improve Hyperion resiliency.\n~ Oversees comprehensive air quality management programs in compliance with South Coast Air Quality Management Districts’ regulations.\n~ Confers with federal, state, and local officials on matters concerning operations at LASAN Water Reclamation Plants.\n~ Oversees public and regulatory outreach programs, actively participating in implementation.\n~ Ensures that water reclamation plant functions are carried out in a safe and efficient manner; and ~ Manages facility improvements at the Hyperion Environmental Learning Center.\n\nExperience:\n\nTwo years of full-time, paid experience in a position equivalent to a Pri<u>n</u>cipal Environmental Engineer working in the design, construction, operation, or maintenance of wastewater treatment or water reclamation plants. This is approxi<u>m</u>ately equivalent to eight years of increasingly responsible experience, including at least two years of management responsibility.\n\nEducation:\n\nA four-year college degree, preferably in the <u>f</u>ield of environmental engineering or environmental science.\n\nFour years of full-time paid management level experience in operation and maintenance at a wastewater treatment or water reclamation plant may be substituted for the required degree only. The two years’ experience in the areas noted above is still required to fully meet the requirement.\n\nLicense/Certification:\n\nA California Professional Engineers License and/or a California Grade V Wastewater Treatment Operator Certification are desirable.\nA valid California Driver’s License with a satisfactory driving record is required.\n\nThe successful candidate will:\n\n~ Have expert knowledge of wastewater engineering and the ability to understand problems and analyze alternatives for making good decisions.\n~ Be skilled in developing a strategic plan and lead a team-based organization that values customer service, employee involvement, and continuous improvement.\n~Work effectively with a management team of diverse backgrounds, knowledge, and skills, and provide coaching and leadership to present a unified management team.\n~ Have a history of, and demonstrated ability to, make decisions on matters such as personnel issues, project alternatives, and bud get expenditures.\n~ Have the ability to work tactfully, communicate effectively in non-technical terms, and develop trust with superiors, peers, subordinates, leadership within neighboring municipalities and nongovernmental organizations (NGOs)municipalities and non-government organizations, media\nand the community.\n~ Bring the values of honesty, stewardship, customer service, transparency, workforce and social equity, and a strong work ethic.\n~ Be committed to working in partnership with unions and promoting a collaborative labor-management environment.\n~ Demonstrate commitment to the training and development of staff and be an effective mentor/\ncoach and leader.\n~ Possess strong emotional intelligence; and conflict resolution management skills; and\n~ Possess excellent oral presentation and written communication skills.\n\nThe Hyperion Water Reclamation Plant Manager will be a collaborative leader, with unquestioned integrity and commitment to leading staff and fulfilling this positions’ full range of responsibilities.\n\nCompensation and Benefits\n\nThe salary range for this position is $164,513 to $240,516 annually depending on experience with annual labor-negotiated increases up to $290,044 by 2028. Five additional premium levels at 2.75% each may be granted at the general manager’s discretion. This position is also eligible for two premium-level bonuses with certification related to senior-level human resources management or labor relations management. A highly competitive benefits package includes an independent retirement plan to which both the employee and the City of Los Angeles contribute; a multi-option deferred compensation plan; generous vacation and sick leave; 13 paid holidays per year; a flexible benefits plan including multi-option health, dental, and vision coverage; and family and domestic partner leave. Reimbursement of relocation expenses may be considered.\n\nApplication and Procedure\n\nInterested candidates should submit a resume, cover letter, and three work-related references (include name, job title, affiliation, and telephone number) via email to Kate.Harrington@p-i-d.biz at Partners In Diversity, Inc. Note: When emailing your application material, the subject line should include your name and the job title for which you are applying. Interested candidates should submit their qualifications as soon as possible.\n\nTo be considered, resumes must include: A description of the size and function of the organizations managed; a description of your role within your organization; at least one major professional accomplishment in which you played a key role; and any relevant experiences or unique characteristics which could further qualify you for this position.\n\nThank you for your time in advance. We look forward to having the opportunity to consider you for this position.\n\nThe filing period will close on FRIDAY, AUGUST 16, 2024.\n\nThe City of Los Angeles is an Equal Employment Opportunity Employer\n", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3991677133"}