{"jobTitle": "Retail Sales Associate", "company": {"name": "Road Runner Sports", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "16.50- $20.50 an hour", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Sporting Goods", "description": "JOIN THE FITNESS REVOLUTION!<br/><br/>Road Runner Sports is always looking for experienced Retail Sales Associates (we call them Fit Experts) to join the world’s largest running, walking, hiking, and athletic footwear retailer.<br/><br/>$16.50- $20.50 an hour<br/><br/>About Us<br/><br/><ul><li>Road Runner Sports is proud to have been recognized as the 2023 Footwear Retailer of the Year by Footwear Magazine.</li><li>Founded in a San Diego garage over 40 years ago.</li><li>Road Runner Sports has 47 stores across the country, and we are growing!</li><li>Our Values, Mission &amp; Purpose (we call them Our 6 Pillars) are Be Different, Bring the WOW, Build something great together, Get Moving, Stay Active, and Live Healthy.<br/><br/><br/></li></ul>About The Job<br/><br/><ul><li>You will join a family of Team Members who share your passion for a healthy and active lifestyle.</li><li>You will make a difference in customers’ lives as you help them on their journey to a healthier life!</li><li>This is a sales-based position and you’ll be given the tools and training to make you successful.</li><li>You’ll be rewarded, through our generous bonus program, for your customer service and your ability to consistently hit your sales goals.</li><li>You will also enjoy huge DISCOUNTS on all your favorite brands!<br/><br/><br/></li></ul><em>After acceptance of a potential offer, the successful completion of a background check will be required prior to start date. The offer is contingent upon the information received in this report, and will be carried out in accordance with Local, State, and Federal laws.<br/><br/></em><em><strong>We’re committed to protecting your privacy rights.</strong> We collect personal information from you, including personally identifying information, professional or employment-related information, and educational information. The purpose of this collection is to assist in evaluating your application for employment.<br/><br/></em><em>To ensure your application is received as timely as possible, we encourage you to apply directly onto our Road Runner Sports Career page.<br/><br/></em><em>As you apply directly on our site, we will be reaching out to you within the next 10 days should your experience and qualifications meet our requirements for this position.<br/><br/></em><em>Road Runner Sports is committed to a diverse and inclusive workplace. Road Runner Sports is an e-verify organization and an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.<br/><br/></em>USD $16.50/Hr.<br/><br/>USD $20.50/Hr.", "responsibilities": "You will join a family of Team Members who share your passion for a healthy and active lifestyle.\nYou will make a difference in customers’ lives as you help them on their journey to a healthier life!\nThis is a sales-based position and you’ll be given the tools and training to make you successful.\nYou’ll be rewarded, through our generous bonus program, for your customer service and your ability to consistently hit your sales goals.\nYou will also enjoy huge DISCOUNTS on all your favorite brands!", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3991123625"}