{"jobTitle": "Training Manager, Global Vendor Operations, YouTube", "company": {"name": "Google", "location": "Los Angeles, CA", "industry": "Information Services and Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "156,000.00/yr - 234,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>San Bruno, CA, USA; Atlanta, GA, USA; Mountain View, CA, USA; Los Angeles, CA, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>10 years of experience working in domestic and international environments.</li><li>10 years of experience in a customer or client-facing role.</li><li>7 years of experience managing operations and leading cross-regional teams.</li><li>5 years of experience as a people manager.</li><li>5 years of experience designing, developing and deploying new hire and continuous learning programs for vendor audiences in various formats including instructor-led, web-based, and blended.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Bachelor's degree in Education, Instructional Design, Consulting in a related field, or equivalent practical experience.</li><li>Experience in consulting, onboarding, managing cross-functional projects.</li><li>Experience in collaborating, influencing executive stakeholders, including Vendor teams for driving product/policy solutions at scale.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>YouTube’s ecosystem is constantly growing and evolving, and it is critical to deploy resources efficiently to best serve YouTube’s users, creators and advertisers globally. We believe it's critical to prepare our vendor partner agents supporting our operations. The Global Vendor Operations organization oversees vendor operations for all of YouTube. These vendors as part of the Trust and Safety program enhance the YouTube experience, build internet safety, and protect free speech in our ever-evolving digital world. YouTube Trust and Safety is dedicated to ensuring that YouTube is a place for users, viewers, and creators around the world to belong, create, and express themselves.<br/><br/>As a Training Manager, you will lead a team of executive training program managers who help thousands of content reviewers to review content effectively by providing scaled learner-centric training and knowledge management strategies and solutions. You will analyze trends and future launches to anticipate training needs and advocate the continual improvement of the reviewers training experience. You will create training project plans, review the design and development process, and coordinate with our partners to ensure smooth delivery to our service delivery centers. You will report training progress and evaluate the training to understand its efficacy in preparing agents to provide quality service to our consumers.<br/><br/>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.<br/><br/>The US base salary range for this full-time position is $156,000-$234,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Consult with business partners and stakeholders across Policy, Quality and Vendor teams to determine the most effective training and knowledge management strategy to support products and workflows.</li><li>Drive innovation at scale and effective onboarding and training solutions.</li><li>Oversee global training onboarding program implementation and measurement, including community of vendor trainers.</li><li>Manage learning strategy, training security, and content access design across global vendor population</li><li>Lead and coach a team of training program managers by improving and managing team processes for curriculum design, continuous learning, and measuring training efficacy.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Consult with business partners and stakeholders across Policy, Quality and Vendor teams to determine the most effective training and knowledge management strategy to support products and workflows.</li><li>Drive innovation at scale and effective onboarding and training solutions.</li><li>Oversee global training onboarding program implementation and measurement, including community of vendor trainers.</li><li>Manage learning strategy, training security, and content access design across global vendor population</li><li>Lead and coach a team of training program managers by improving and managing team processes for curriculum design, continuous learning, and measuring training efficacy.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 10 years of experience working in domestic and international environments. 10 years of experience in a customer or client-facing role. 7 years of experience managing operations and leading cross-regional teams. 5 years of experience as a people manager. 5 years of experience designing, developing and deploying new hire and continuous learning programs for vendor audiences in various formats including instructor-led, web-based, and blended.", "preferred": "Bachelor's degree in Education, Instructional Design, Consulting in a related field, or equivalent practical experience. Experience in consulting, onboarding, managing cross-functional projects. Experience in collaborating, influencing executive stakeholders, including Vendor teams for driving product/policy solutions at scale."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3991696161"}