{"jobTitle": "Purchasing Supervisor", "company": {"name": "Parker Hannifin", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing, Appliances, Electrical, and Electronics Manufacturing, and Automation Machinery Manufacturing", "description": "Org Marketing Statement<br/><br/><strong>Military Flight Controls Division<br/><br/></strong>Supporting aircraft worldwide, Parker Aerospace’s Military Flight Controls Division (MFCD) provides primary and secondary flight control systems that make flight possible. Tested, proven and trusted in commercial and military applications for decades, MFCD provides precise position-control actuation solutions for military aircraft across the United States and with foreign partners. The division’s JetPipe® electrohydraulic servovalve (EHSV) technology is used across commercial and military aircraft around the world. Headquartered in Irvine, California, the Military Flight Controls Division is the global leader in fly-by-wire flight control systems and electrohydraulic products and offers the world's most advanced motor design capabilities for flight controls.<br/><br/><strong>Summary<br/><br/></strong><strong>Position Summary<br/><br/></strong>Position manages the daily activities of the procurement of raw materials, parts, equipment and operating supplies required for production of the Division’s products. Responsible for embracing and driving lean enterprise systems throughout the procurement process. Position will report directly to the Supply Chain Manager or the Sourcing and Procurement Manager and will supervise the Sourcing Specialist and Buyer team members.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>ESSENTIAL FUNCTIONS:<br/><br/></strong><ul><li>Manages the activities of the Division's purchases of raw materials, supplies, equipment or services. Identifies raw material requirements from production specifications, operational schedules and engineering quality requirements. Determines the most cost efficient and reliable materials needed for the manufacturing process. </li><li>Establishes preferred supplier selection criteria based on supplier evaluations of price, quality, delivery, certifications, and compliance with governmental procurement regulations. Promotes and uses strategic suppliers.</li><li>Interviews, selects and negotiates with suppliers in response to material requirements/cost issues. Establishes procedures to leverage the company’s position. Ensures purchasing strategy reflects the consistent utilization of local suppliers vs. Group strategic suppliers.</li><li>Works with suppliers to develop and manage continuous improvement programs, addressing quality, delivery, service as well as price.</li><li>Develops standard/automated re-order procedures. Develop crisis management and supplier backup contingency programs.</li><li>Develops and benchmarks best practices among the Divisions suppliers and maintain accurate measurements and records for evaluation of suppliers. </li><li>Ensures purchases and capital expenditures are consistent with Division strategies and within department budgets.</li><li>Responsible for integrating the Division with electronic interfacing throughout the purchasing function.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>B.A./B.S. degree in a related technical or business discipline, professional level experience of six or more years and demonstrated ability to perform the described role and responsibilities and obtain the desired results. Certification or a professional designation in a specialty area (e.g. APICS) may be required or preferred depending on position requirements. </li><li>Proven competency in a team leader role for two or more years, and/or demonstrated leadership of major projects or programs in a team environment. </li><li>Thorough knowledge of products, manufacturing processes and technology, information systems, and/or specialty areas, and general business practices. </li><li>Demonstrated teamwork and team building skills in producing results and meeting organizational objectives. Capable of assessing and developing individual and team skills and capabilities. Able to create and maintain enthusiasm for new and challenging goals. Serve as a role model by promoting new ideas and positive change.<br/><br/></li></ul><strong>Closing Statement<br/><br/></strong>Please note that the salary range information is only applicable for California. Compensation is based on a variety of factors, candidate experience, qualifications, location as well as market and business considerations. Pay Range: $101,874/annually - $135,879/annually.<br/><br/><strong>Conditions of Employment<br/><br/></strong>This role is subject to compliance with the International Traffic in Arms Regulations (ITAR) and the Export Administration Regulations (EAR), which requires the incumbent to be either a US citizen, lawful permanent resident [“green card” holders], or have refugee or asylee status).<br/><br/><strong>Parker Hannifin<br/><br/></strong>Parker Hannifin is a Fortune 250 global leader in motion and control technologies. For more than a century the company has been enabling engineering breakthroughs that lead to a better tomorrow. Learn more at www.parker.com or @parkerhannifin.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Parker is an Equal Opportunity and Affirmative Action Employer. Parker is committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job related reasons regardless of race, ethnicity, color, religion, sex, sexual orientation, age, national origin, disability, gender identity, genetic information, veteran status, or any other status protected by law. This position is subject to meeting export compliance eligibility requirements.<br/><br/>(“Minority / Female / Disability / Veteran / VEVRAA Federal Contractor”)<br/><br/>If you would like more information about Equal Employment Opportunity as an applicant under the law, please go to Know Your Rights: Workplace Discrimination is Illegal (eeoc.gov) and Genetic Information Discrimination<br/><br/><strong>Drug Tests<br/><br/></strong><strong>Drug-Free Workplace<br/><br/></strong>In accordance with Parker’s policies and applicable state laws, Parker provides for a drug-free workplace. Therefore, all applicants seeking employment with Parker will be subject to drug testing as a condition of employment.", "responsibilities": "ESSENTIAL FUNCTIONS:<br/><br/>\n<ul><li>Manages the activities of the Division's purchases of raw materials, supplies, equipment or services. Identifies raw material requirements from production specifications, operational schedules and engineering quality requirements. Determines the most cost efficient and reliable materials needed for the manufacturing process. </li><li>Establishes preferred supplier selection criteria based on supplier evaluations of price, quality, delivery, certifications, and compliance with governmental procurement regulations. Promotes and uses strategic suppliers.</li><li>Interviews, selects and negotiates with suppliers in response to material requirements/cost issues. Establishes procedures to leverage the company’s position. Ensures purchasing strategy reflects the consistent utilization of local suppliers vs. Group strategic suppliers.</li><li>Works with suppliers to develop and manage continuous improvement programs, addressing quality, delivery, service as well as price.</li><li>Develops standard/automated re-order procedures. Develop crisis management and supplier backup contingency programs.</li><li>Develops and benchmarks best practices among the Divisions suppliers and maintain accurate measurements and records for evaluation of suppliers. </li><li>Ensures purchases and capital expenditures are consistent with Division strategies and within department budgets.</li><li>Responsible for integrating the Division with electronic interfacing throughout the purchasing function.<br/><br/></li></ul>", "qualifications": {"required": "B.A./B.S. degree in a related technical or business discipline, professional level experience of six or more years and demonstrated ability to perform the described role and responsibilities and obtain the desired results. Certification or a professional designation in a specialty area (e.g. APICS) may be required or preferred depending on position requirements. \nProven competency in a team leader role for two or more years, and/or demonstrated leadership of major projects or programs in a team environment. \nThorough knowledge of products, manufacturing processes and technology, information systems, and/or specialty areas, and general business practices. \nDemonstrated teamwork and team building skills in producing results and meeting organizational objectives. Capable of assessing and developing individual and team skills and capabilities. Able to create and maintain enthusiasm for new and challenging goals. Serve as a role model by promoting new ideas and positive change.<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "6 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3991973986"}