{"jobTitle": "Operations Experience Manager", "company": {"name": "Better Talent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Hospitality", "description": "<strong>Company Overview<br/><br/></strong>The Maimon Group - Where Luxury Exceeds Expectations<br/><br/>At The Maimon Group, we offer luxury short-term vacation rentals and asset management in Los Angeles, focusing on curated travel experiences, event venues, and concierge services.<br/><br/>Over the years, our firm has meticulously built our unique portfolio of exclusive properties to deliver experiences that exceed five-star hospitality. This is accomplished through our unparalleled ability to anticipate our guests’ needs and cater to the most discerning requests. The understanding that we are more than a luxury hospitality brand, but experts in the art of living, is what makes us an industry leader.<br/><br/>Do you have the ambition and drive to join us?<br/><br/>Our high-performing and fully committed work family is looking for someone who will fit into and enhance our corporate culture.<br/><br/><strong>Position Summary<br/><br/></strong>Experience a career like no other. As our Operations Experience Manager, your role will be to facilitate the delivery of five-star hospitality services to our guests, partners, and employees with the opportunity to enhance the experiences of those we serve and ensure the smooth functioning of our exceptional properties.<br/><br/>To be the right fit, it will be important for you to possess experience in hospitality or the travel industry, with a focus on guest services and operations management. Your main areas of responsibility will be to oversee guest arrivals and departures, property management, event preparation, and service delivery. In doing so, you will also establish procedures for improving workflow efficiency and quality control across all services offered. Overseeing HR and managing guest, owner and vendor relationships with the knowledge and skills necessary to provide world-class service will also be a crucial aspect of this role.<br/><br/>With us, you'll also receive a competitive salary package with growth opportunities and a supportive and inclusive environment. Apply now and embark on a career that offers the satisfaction of helping others, personal growth, and unparalleled experience in luxury hospitality.<br/><br/><strong>Responsibilities<br/><br/></strong>Oversee and optimize Operations Department workflow, SOPs, and performance, utilizing KPIs to enhance efficiency and customer experience; manage and lead onsite and remote customer support and operations teams.<br/><br/>Elevate guest, owner, and partner experiences through effective communication, customer support, and concierge services; provide 24/7 rapid response to stakeholder needs in collaboration with company owners and other departments.<br/><br/>Ensure compliance with relevant regulations, standards, and local ordinances related to operations, HR, and customer experience; manage property owner and partner relations, including statements and requests.<br/><br/>Oversee the HR department, including company culture, events, bonuses, and commissions; handle employee requests, inquiries, and professional enhancement.<br/><br/>Manage employee onboarding and offboarding processes, ensuring a smooth transition for new and departing team members.<br/><br/>Oversee vendor management, including payouts, performance evaluation, and maintaining strong relationships with vendor companies.<br/><br/><ul><li>Collaborate across departments and roles to provide seamless, efficient, and high-quality experiences for all internal and external stakeholders. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A college degree is preferred</li><li>Customer-oriented and driven individual with a \"whatever it takes\" mentality</li><li>Experience and understanding of luxury hospitality and lifestyle, with an understanding of property management, trust accounting, and related software.</li><li>Strong management skills, including experience in operations, hospitality, or short-term rentals, with a focus on developing and implementing SOPs and KPIs.</li><li>Solid understanding of HR guidelines and employee management, with excellent interpersonal skills, adaptability to company culture, and a positive, committed work ethic.</li><li>Strong sense of urgency in task management and responsiveness to customer and property needs.</li><li>Proficiency in programs such as PMS &amp; Dispatching Tools, QuickBooks, Google Sheets/Drive, DocuSign, CRM, BambooHR, and Google G Suite and Calendar.<br/><br/></li></ul><strong>Compensation &amp; Benefits<br/><br/></strong><strong>Compensation:</strong> $85,000 to $120,000 based on experience and achievement<br/><br/><strong>Bonus:</strong> 15% personal bonus paid every month, subject to management approval and monthly goals.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Paid time off, such as PTO, sick days, and vacation days</li><li>Mileage reimbursement</li><li>Phone and Internet reimbursement: a monthly amount of $35.00 for telephone and internet expenses for company business.</li><li>Two days of remote work</li><li>401K with a 3% match</li><li>Health, Dental, and Vision insurance shared costs.<br/><br/></li></ul><strong>Schedule: </strong>Available to work 3-4 days in our office location (9 am-5 pm). Also available to work 2-3 days online and on weekends if needed, with the ability to replace accounting management and operation coordinators as necessary during high-demand periods (holidays, weekends, etc.).", "responsibilities": "Oversee and optimize Operations Department workflow, SOPs, and performance, utilizing KPIs to enhance efficiency and customer experience; manage and lead onsite and remote customer support and operations teams.<br/><br/>Elevate guest, owner, and partner experiences through effective communication, customer support, and concierge services; provide 24/7 rapid response to stakeholder needs in collaboration with company owners and other departments.<br/><br/>Ensure compliance with relevant regulations, standards, and local ordinances related to operations, HR, and customer experience; manage property owner and partner relations, including statements and requests.<br/><br/>Oversee the HR department, including company culture, events, bonuses, and commissions; handle employee requests, inquiries, and professional enhancement.<br/><br/>Manage employee onboarding and offboarding processes, ensuring a smooth transition for new and departing team members.<br/><br/>Oversee vendor management, including payouts, performance evaluation, and maintaining strong relationships with vendor companies.<br/><br/><ul><li>Collaborate across departments and roles to provide seamless, efficient, and high-quality experiences for all internal and external stakeholders. <br/><br/></li></ul>", "qualifications": {"required": "Customer-oriented and driven individual with a \"whatever it takes\" mentality\nExperience and understanding of luxury hospitality and lifestyle, with an understanding of property management, trust accounting, and related software.\nStrong management skills, including experience in operations, hospitality, or short-term rentals, with a focus on developing and implementing SOPs and KPIs.\nSolid understanding of HR guidelines and employee management, with excellent interpersonal skills, adaptability to company culture, and a positive, committed work ethic.\nStrong sense of urgency in task management and responsiveness to customer and property needs.\nProficiency in programs such as PMS &amp; Dispatching Tools, QuickBooks, Google Sheets/Drive, DocuSign, CRM, BambooHR, and Google G Suite and Calendar.<br/><br/>", "preferred": "A college degree is preferred"}, "skills": ["Hospitality", "Operations Management", "Customer Service", "Concierge Services", "HR", "Property Management", "Event Management", "Vendor Management", "KPI", "SOP", "PMS", "QuickBooks", "Google Sheets", "DocuSign", "CRM", "BambooHR", "Google G Suite", "Google Calendar"], "postedDate": "3 weeks ago", "benefits": "Paid time off, such as PTO, sick days, and vacation days\nMileage reimbursement\nPhone and Internet reimbursement: a monthly amount of $35.00 for telephone and internet expenses for company business.\nTwo days of remote work\n401K with a 3% match\nHealth, Dental, and Vision insurance shared costs.<br/><br/>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3991314775"}