{"jobTitle": "Principal Product Manager, Payments", "company": {"name": "Gusto", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "181,000.00/yr - 223,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "About Gusto<br/><br/>Gusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 300,000 businesses nationwide.<br/><br/>Our mission is to create a world where work empowers a better life, and it starts right here at Gusto. That’s why we’re committed to building a collaborative and inclusive workplace, both physically and virtually. Learn more about our Total Rewards philosophy.<br/><br/>About The Role<br/><br/>Gusto moves hundreds of billions of dollars per year. The Principal Manager, Payments will be responsible for building technology that helps expand and develop payment rails and payment methods across the US to enable money movement and solidify our customer ledger and reconciliation platforms for reliability.<br/><br/>About The Team<br/><br/>This role is part of the Payments team at Gusto that ensures that our 300,000+ small and medium businesses and millions of their employees are getting paid on time, every time. You will be developing our payments systems that are foundational to the payment solutions offered by Gusto. You will work closely with a team of Engineers and Designers, to build the roadmap, set strategic priorities, and ensure the successful implementation of our payments stack.<br/><br/>Here’s What You’ll Do Day-to-day<br/><br/><ul><li>Create the roadmap and multi-year strategy for the US payment infrastructure to meet key organizational OKRs</li><li>Work cross-functionally with Design, Engineering and Revenue teams to develop, launch and manage/rearchitect payments infrastructure</li><li>Ensure that our existing payments infrastructure moves money in a timely and consistent manner</li><li>Collaborate with partners in Accounting, Legal, Compliance, and Payroll Services to design to enhance our product offerings and serve our customers better</li><ul><li>Communicate your work across technical and non-technical decision-makers</li><li>Manage dependencies across other product development teams </li></ul><li>Conduct market research to inform strategy, measure performance against key indicators, and inform future improvements<br/></li></ul>Here’s What We're Looking For<br/><br/><ul><li>8+ years of experience in payments or payments related fields including understanding of money movement in the US and integrations with third party payment systems</li><li>Familiarity with payments regulations</li><li>Ability to translate business requirements into technical specifications and work closely with the engineering team to deliver remarkable solutions</li><li>Excellent communication and collaboration skills to bring others along various partners</li><li>High judgment to take decisions based on first principles and be able to make trade-offs<br/><br/></li></ul>Our cash compensation range for this role is $181,000 to $223,000 in Denver &amp; most remote locations, and $212,000 to $262,000 in San Francisco &amp; New York. Final offer amounts are determined by multiple factors, including candidate location, experience and expertise, and may vary from the amounts listed above.<br/><br/>Gusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately <strong>2-3 days </strong>per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto's subsidiary, whose physical office is in Scottsdale.<br/><br/>Note: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.<br/><br/>When approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.<br/><br/>Our customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.<br/><br/>Gusto is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Gusto considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Gusto is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you require assistance in filling out a Gusto job application, please reach out to candidate-accommodations@gusto.com.", "responsibilities": "<ul><li>Create the roadmap and multi-year strategy for the US payment infrastructure to meet key organizational OKRs</li><li>Work cross-functionally with Design, Engineering and Revenue teams to develop, launch and manage/rearchitect payments infrastructure</li><li>Ensure that our existing payments infrastructure moves money in a timely and consistent manner</li><li>Collaborate with partners in Accounting, Legal, Compliance, and Payroll Services to design to enhance our product offerings and serve our customers better</li><ul><li>Communicate your work across technical and non-technical decision-makers</li><li>Manage dependencies across other product development teams </li></ul><li>Conduct market research to inform strategy, measure performance against key indicators, and inform future improvements<br/></li></ul>", "qualifications": {"required": "8+ years of experience in payments or payments related fields including understanding of money movement in the US and integrations with third party payment systems, Familiarity with payments regulations, Ability to translate business requirements into technical specifications and work closely with the engineering team to deliver remarkable solutions, Excellent communication and collaboration skills to bring others along various partners, High judgment to take decisions based on first principles and be able to make trade-offs"}, "skills": ["Payments", "Payments Infrastructure", "Money Movement", "Payment Rails", "Payment Methods", "US Payments", "Third Party Payment Systems", "Payments Regulations", "Business Requirements", "Technical Specifications", "Engineering", "Communication", "Collaboration", "Decision Making", "Trade-offs", "Market Research", "Performance Measurement", "Product Strategy", "OKRs"], "postedDate": "2 weeks ago", "benefits": "Gusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately 2-3 days per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto's subsidiary, whose physical office is in Scottsdale.<br/><br/>Note: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.<br/><br/>When approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3991982303"}