{"jobTitle": "Workforce Development Program Manager & Career Coach (Health Care Instructional Leadership)", "company": {"name": "WILLIAMS, KARL R", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "The Program Manager independently maintains the day-to-day operations at one of our Health Scholar sites, located within one of our hospital or ambulatory care center clients. The Program Manager serves as a vital link between Health Scholar program participants, our internal team, and the client, ensuring program operations run smoothly. The ideal candidate has the adaptability and enthusiasm to excel across a wide range of responsibilities, from ensuring Scholars have an excellent program experience, to maintaining and exceeding student recruitment goals, and building strong relationships with our hospital and health system client executives. This position is a fantastic opportunity for those interested in the intersection of health care delivery, student mentorship, and program administration.<br/><br/>To hear one of our Program Managers speak about the Health Scholar program in more detail, you can watch a brief video produced by one of our hospital clients here: https://www.youtube.com/watch?v=syfH6x_n-hY.<br/><br/>FLSA Status<br/><br/>Exempt<br/><br/>Salary Range<br/><br/>$66,560 - $73,000<br/><br/>Reports To<br/><br/>Regional Manager<br/><br/>Direct Reports<br/><br/>None<br/><br/>Location<br/><br/>Los Angeles, CA (Onsite)<br/><br/>Travel<br/><br/>Up to 10%<br/><br/>Work Type<br/><br/>Regular<br/><br/>Schedule<br/><br/>Full Time<br/><br/>Position Description:<br/><br/><ul><li>Actively recruit and ensure a strong pipeline of diverse Health Scholar candidates on an ongoing basis by attending recruitment events such as fairs and presentations, cultivating relationships with campus career centers, professors, counselors and others, engaging student organizations through presentations, flyers and other potential opportunities</li><li>Provide direct supervision to program participants (typically 50-200), as the sole Program Manager at client site, including providing mentorship, coaching and professional development opportunities </li><li>Manage and actively improve or implement on-site program operations at client site, including: quarterly training for scholars, departmental operations, scholar recruitment activities, facilitating meetings and professional development workshops, and major projects such as seasonal programs </li><li>Build and manage relationships with key hospital client executives and staff to ensure ongoing success of current programs and future growth through regular meetings, committees, daily rounding </li><li>Conduct quantitative and qualitative analyses on program metrics to effectively report service line impact, risks to clients, and to identify opportunities demonstrate value to client partner </li><li>Plan for future client growth by raising opportunities for opening additional clinical and administrative departments for participant rotations with client executives, as appropriate </li><li>Engage with Account Principal and other team members to identify and pursue opportunities to add value to client through value-based payment, population health management, PMO, Process Improvement or other services offered by our firm</li><li>Support firm wide business development through activities such as participating in market research or contributing to an article or other BD collateral </li><li>Proactively identify and mitigate risks by addressing complaints or concerns from clients, staff and/or program participants. Risks may include HIPAA issues, compliance, background checks, policy violations and more. Elevate high risk complaints or concerns to management </li><li>As time and program performance allow, engage as a billable team member for consulting projects engaged with the client</li><li>Display sound judgement, professionalism, and strong conflict-resolution skills, modeling these behaviors for our program participants</li><li>Ensure compliance with all local, state and federal regulations, client site-specific policies and ethical standards</li><li>Carry out all other responsibilities, tasks and projects as assigned <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Bachelor’s degree and 1-2+ years of work experience strongly preferred</li><li>Passion for student teaching, mentoring and development</li><li>Strong project and people management skills; experience managing large group strongly preferred</li><li>Recruitment experience preferred; comfortable recruiting and networking is required</li><li>Valid driver's license and reliable transportation</li><li>Experience and interest in health care a plus</li><li>Excellent interpersonal, oral and written communication skills</li><li>Able to work well independently; the role requires you to work directly at the client site as the sole Program Manager</li><li>Available to participate in regional trainings that occur during the evenings and on some weekends (typically 1-2 weekends every month)</li><li>Ability to travel to corporate office in downtown Los Angeles occasionally </li><li>Proficient in Microsoft Office programs (Outlook, Word, Excel, PowerPoint and Visio)<br/><br/></li></ul>Benefits:<br/><br/>As a firm passionate about health care, we’re deeply committed to the health and wellness of our own team members. We offer comprehensive, affordable insurance plans for our team and their families, and a host of other unique benefits, such as a yearly stipend for wellness-related activities, and a paid parental leave program. You can learn more about our benefits offerings here: https://copehealthsolutions.com/careers/why-cope-health-solutions/.<br/><br/>What We Do:<br/><br/>COPE Health Solutions is a national tech-enabled services firm, with a population health management analytics software solution Analytics for Risk Contracting (ARC), collaboratively implementing proven products with payer and provider clients to power success in risk arrangements and development of the future workforce. Our multidisciplinary team provides payers and providers with the experience, capabilities and tools needed to plan for, design, implement and support strategy development and execution. We are driven by our passion to help transform health care delivery, align financial incentives to support population health management and build the workforce needed for value-based care.<br/><br/>To Apply:<br/><br/>To apply for this position, or to view all available positions, visit us at https://copehealthsolutions.com/careers/open-positions/.", "responsibilities": "The Program Manager independently maintains the day-to-day operations at one of our Health Scholar sites, located within one of our hospital or ambulatory care center clients. The Program Manager serves as a vital link between Health Scholar program participants, our internal team, and the client, ensuring program operations run smoothly. The ideal candidate has the adaptability and enthusiasm to excel across a wide range of responsibilities, from ensuring Scholars have an excellent program experience, to maintaining and exceeding student recruitment goals, and building strong relationships with our hospital and health system client executives. This position is a fantastic opportunity for those interested in the intersection of health care delivery, student mentorship, and program administration.", "qualifications": {"required": "Bachelor’s degree and 1-2+ years of work experience strongly preferred, Passion for student teaching, mentoring and development, Strong project and people management skills; experience managing large group strongly preferred, Recruitment experience preferred; comfortable recruiting and networking is required, Valid driver's license and reliable transportation, Experience and interest in health care a plus, Excellent interpersonal, oral and written communication skills, Able to work well independently; the role requires you to work directly at the client site as the sole Program Manager, Available to participate in regional trainings that occur during the evenings and on some weekends (typically 1-2 weekends every month), Ability to travel to corporate office in downtown Los Angeles occasionally , Proficient in Microsoft Office programs (Outlook, Word, Excel, PowerPoint and Visio)", "preferred": ""}, "skills": ["Project Management", "People Management", "Recruitment", "Communication", "Microsoft Office"], "postedDate": "3 weeks ago", "benefits": "As a firm passionate about health care, we’re deeply committed to the health and wellness of our own team members. We offer comprehensive, affordable insurance plans for our team and their families, and a host of other unique benefits, such as a yearly stipend for wellness-related activities, and a paid parental leave program. You can learn more about our benefits offerings here: https://copehealthsolutions.com/careers/why-cope-health-solutions/.", "remoteWork": "No", "salary": {"amount": "66,560 - $73,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3991961219"}