{"jobTitle": "Manager of Transformation", "company": {"name": "Transform Health, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "USD $82,000 – USD $105,000 / year", "currency": "USD"}, "industry": "Hospitals and Health Care", "description": "<strong>Manager, Transformation, Los Angeles, CA - must reside in Los Angeles County</strong><p><br/></p><p>Transform Health is a mission-driven, nationally certified, women and minority-owned health care consulting firm based in Sacramento, California. Our passion is grounded in health policy and health system transformation to achieve high-quality health and health care for all. We offer strategic and operational support to a broad array of stakeholders, including governments, advocacy groups, foundations, health plans, and providers. Our unique and deep bench of experience and expertise is in federal and state health policy, health system transformation, addressing social determinants of health, outreach and enrollment, program implementation, and operations.  </p><p><br/></p><p>The Manager of Transformation for Los Angeles will play a critical role in advancing our mission to drive systems change and create healthy communities. This full-time position requires a dynamic and forward-thinking individual with deep expertise in stakeholder engagement, learning and evaluation, and practice model design and implementation. Initially focusing efforts on supporting CalAIM (Medi-Cal Transformation) implementation, this individual will also manage a diverse portfolio of projects aimed at advancing systems transformation. The Manager of Transformation will support the Los Angeles Director in advancing key partnerships and relationships with CalAIM stakeholders to drive regional alignment and coordination, chronicling and addressing implementation barriers with a learning mindset, and guiding solutions at the organizational (i.e., CBOs, FQHCs, direct service providers, county agencies, etc.), managed care, and policy levels. The ideal candidate will possess a deep passion for improving healthcare systems, coupled with the practiced ability to build strong relationships and translate insights into strategies that drive impactful change through continuous learning and improvement. This role requires travel in the Los Angeles region and a commitment to fostering trust and collaboration among diverse stakeholders.</p><p><br/></p><p><strong>This position is expected to:</strong></p><ul><li>Provide and support stakeholder engagement and facilitation in the Los Angeles region. This includes an understanding of stakeholder engagement methods and best practices to apply to a comprehensive engagement strategy.</li><li>Support the development, design, tracking, and implementation of a robust stakeholder engagement approach and work plan to create buy-in and alignment that ensures broad and deep engagement with critical stakeholders.</li><li>Serve in a visible, public-facing role that will identify and leverage opportunities in the community to enhance health systems change efforts and build upon lessons learned.</li><li>Document, track, and report on lessons learned internally and externally to stakeholders in culturally appropriate ways.</li><li>Write reports and blogs about the lived experience of our health systems change projects informed by the community to share lessons learned and promising practices.</li><li>Serve as a trusted relationship in the Los Angeles community to foster and maintain lasting relationships with key stakeholders. This includes curating strategic relationships to advance project goals with managed care plans, community-based organizations, county officials, etc.</li><li>Ensure effective coordination and collaboration across diverse groups both in-person and with our virtual, remote workforce community inclusive of in-person site visits to represent Transform Health’s work and the project goals, conduct power mapping to determine influential relationships to advance project goals, and sharing outcomes and goals.</li><li>In-depth experience in compiling and communicating stakeholder challenges and barriers into actionable lessons that inform policy direction.</li><li>Provide project management across the life cycle of the project(s) with applied practice experience in an agile project management environment.</li><li>In collaboration with the Director, inform the establishment, monitoring, and achievement of key performance indicators (KPIs) to ensure project objectives and client expectations are met.</li><li>Provide high-quality technical written instructional documents, such as landscape assessments, instructional tutorials, in service to project staff, meeting program goals, and addressing stakeholder needs.</li></ul><p><br/></p><p><strong>Minimum Requirements:</strong></p><ul><li>Bachelor’s degree with at least five years’ experience in stakeholder engagement strategies, LA preferred.</li><li>At least five years of project management and process management.</li><li>Demonstrated experience with active listening skills, problem solving, setting expectations, and communicating targeted calls to action to build alignment and drive stakeholders to a goal. Technologically proficient with over five years’ experience developing and creating tracking methods using MS Office platforms such as Excel.</li><li>Experienced and proven track record with public speaking, communicating progress to goal, and inspiring diverse stakeholder groups. Forward-thinking and creative, consistently thinks outside the box to develop innovative solutions.</li><li>Possess a drive, eagerness, and positive energy to effect community-driven change, inspiring others with high energy and enthusiasm.</li><li>Thrive in a fast-paced environment and effectively manage upwards, demonstrating flexibility and adaptability in dynamic situations.</li><li>Maintains a reliable home office setup for virtual work and has consistent, reliable transportation.</li><li>Demonstrated collaborative project work and upholds teamwork, and diversity of thought and perspective, fostering an inclusive and supportive team environment.</li></ul><p><br/></p><p><strong>Location:</strong></p><ul><li>Hybrid-Remote </li><li>Candidate must reside in Los Angeles County</li></ul><p><br/></p><p><strong>Benefits:</strong></p><ul><li>401K with annual salary match</li><li>Full medical, dental, and vision benefits</li><li>DCFSA and FSA Available</li></ul><p><br/></p><p><strong>Salary: </strong></p><ul><li>USD $82,000 – USD $105,000 / year</li></ul><p><br/></p><p><br/></p><p><br/></p><p>Transform Health, LLC is committed to fostering, cultivating, and preserving a culture of diversity, equity, and inclusion. We value our employees for their unique talents and abilities. We embrace and encourage our employees’ differences in backgrounds, experiences, race, color, religious creed, sex, national origin, ancestry, citizenship status, family or marital status, physical, mental, and/or intellectual abilities, age, military or veteran status, registered domestic partner or civil union status, gender and gender identity, sexual orientation, political affiliation, and socio-economic status. All employees are valued for their differences and the unique contributions that help us achieve our business goals.</p><p><br/></p><p><strong>Please send an email with the job title you are applying to in the subject field and your resume, cover letter, and writing sample(s) to </strong><strong>hiring@transformhc.com</strong><strong>.</strong></p>", "responsibilities": "The Manager of Transformation for Los Angeles will play a critical role in advancing our mission to drive systems change and create healthy communities. This full-time position requires a dynamic and forward-thinking individual with deep expertise in stakeholder engagement, learning and evaluation, and practice model design and implementation. Initially focusing efforts on supporting CalAIM (Medi-Cal Transformation) implementation, this individual will also manage a diverse portfolio of projects aimed at advancing systems transformation. The Manager of Transformation will support the Los Angeles Director in advancing key partnerships and relationships with CalAIM stakeholders to drive regional alignment and coordination, chronicling and addressing implementation barriers with a learning mindset, and guiding solutions at the organizational (i.e., CBOs, FQHCs, direct service providers, county agencies, etc.), managed care, and policy levels. The ideal candidate will possess a deep passion for improving healthcare systems, coupled with the practiced ability to build strong relationships and translate insights into strategies that drive impactful change through continuous learning and improvement. This role requires travel in the Los Angeles region and a commitment to fostering trust and collaboration among diverse stakeholders.", "qualifications": {"required": "Bachelor’s degree with at least five years’ experience in stakeholder engagement strategies, LA preferred.\nAt least five years of project management and process management.\nDemonstrated experience with active listening skills, problem solving, setting expectations, and communicating targeted calls to action to build alignment and drive stakeholders to a goal. Technologically proficient with over five years’ experience developing and creating tracking methods using MS Office platforms such as Excel.\nExperienced and proven track record with public speaking, communicating progress to goal, and inspiring diverse stakeholder groups. Forward-thinking and creative, consistently thinks outside the box to develop innovative solutions.\nPossess a drive, eagerness, and positive energy to effect community-driven change, inspiring others with high energy and enthusiasm.\nThrive in a fast-paced environment and effectively manage upwards, demonstrating flexibility and adaptability in dynamic situations.\nMaintains a reliable home office setup for virtual work and has consistent, reliable transportation.\nDemonstrated collaborative project work and upholds teamwork, and diversity of thought and perspective, fostering an inclusive and supportive team environment.", "preferred": ""}, "skills": ["Stakeholder Engagement", "Project Management", "Process Management", "Active Listening", "Problem Solving", "Public Speaking", "Excel", "MS Office"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "401K with annual salary match\nFull medical, dental, and vision benefits\nDCFSA and FSA Available", "remoteWork": "Hybrid-Remote", "url": "https://www.linkedin.com/jobs/view/3991697251"}