{"jobTitle": "Demand and Supply Planner", "company": {"name": "Korrus", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Wellness and Fitness Services", "description": "The Demand and Supply Planner is responsible for end-to-end planning in collaboration Sales, Marketing, Engineering, Finance and Suppliers. Demonstrate operational and strategic knowledge related to order scheduling, demand/supply planning and inventory management. Strong analytical and organizational skills are required in managing supply chain complexity and possess the ability to juggle multiple aspects of the job to drive key requirements and objectives.<br/><br/><strong>Primary Role And Responsibility<br/><br/><br/></strong><ul><li>Schedule, allocate, and approve sales orders</li><li>Review supply pipeline to assign or adjust customer ship dates</li><li>Create actions for order resolution; customer revisions, cancellations, and expedite requests</li><li>Facilitate direct stock movement between inventory locations to support allocation efforts</li><li>Coordinate with Logistics and CSR teams to action carrier changes and assist in the investigation of shipping issues</li><li>Recommend substitute material to CSR team for out-of-stock material</li><li>Create internal sales orders of finished goods to support various departments within the company</li><li>Responsible for planning multiple product categories balancing demand and supply plans to ensure both short-term and long-term forecast requirements are achieved</li><li>Develop and execute supply plans, aggregate demand plans, risk buys and inventory plans. Perform thorough global analysis of inventory levels, make recommendations for action to cross-functional teams to optimize inventory levels and achieve revenue goals.</li><li>Analyze total supply chain stock status and demand run rates to optimize inventory and balance trade-off between inventory turns, product availability and freight cost. Drive discussion and action plan with Sales, Marketing, Operations and Suppliers to mitigate negative impact to company revenue targets and financial goals.</li><li>Optimize raw material inventory liability while maintaining continuity of supply to achieve world-class on time delivery for customers</li><li>Coordinate raw material transfers between manufacturing facilities to ensure that components are staged to fulfill customer orders on time</li><li>Perform materials clear to build to communicate lead times for customer order inquiries</li><li>Execute purchases that align with company’s demand plan and follow up with suppliers to confirm delivery schedules while reprioritizing production schedules if necessary</li><li>Assist in other supply chain functions as needed such as, but not limited to, maintaining KPIs, NPI supply chain readiness, special customer requests, automation projects, and ad-hoc analyses<br/><br/><br/></li></ul><strong>Qualifications And Requirements<br/><br/></strong>Remote Role-Must live in CA. Non-CA candidates will not be considered for this role. No sponsorship available for this position.<br/><br/><br/><ul><li>Minimum of 5 years of experience in supply chain and order management</li><li>BA/BS Degree in relevant area – Supply Chain, Business, Engineering, etc.; MBA is a plus</li><li>Advanced experience in using MS Excel is a must; PowerPoint, Word is a plus</li><li>Experience using MRP/ERP systems; NetSuite experience preferred</li><li>Excellent (written and verbal) communication and interpersonal skills with ability to work with individuals, teams, and management level</li><li>Ability to adapt quickly to changing situations, work under pressure and deal with shifting priorities and workloads to meet strict deadlines and with limited information</li><li>Strong analytical capability and attention to detail is a must</li><li>Ability to successfully work across multiple levels of an organization as well as work independently or with a team in a collaborative setting</li><li>Limited traveling required<br/><br/><br/></li></ul>All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity, age, physical or mental disability, or covered veteran status.", "responsibilities": "The Demand and Supply Planner is responsible for end-to-end planning in collaboration Sales, Marketing, Engineering, Finance and Suppliers. Demonstrate operational and strategic knowledge related to order scheduling, demand/supply planning and inventory management. Strong analytical and organizational skills are required in managing supply chain complexity and possess the ability to juggle multiple aspects of the job to drive key requirements and objectives.", "qualifications": {"required": "Minimum of 5 years of experience in supply chain and order management, BA/BS Degree in relevant area – Supply Chain, Business, Engineering, etc.; MBA is a plus, Advanced experience in using MS Excel is a must; PowerPoint, Word is a plus, Experience using MRP/ERP systems; NetSuite experience preferred, Excellent (written and verbal) communication and interpersonal skills with ability to work with individuals, teams, and management level, Ability to adapt quickly to changing situations, work under pressure and deal with shifting priorities and workloads to meet strict deadlines and with limited information, Strong analytical capability and attention to detail is a must, Ability to successfully work across multiple levels of an organization as well as work independently or with a team in a collaborative setting, Limited traveling required"}, "skills": ["Supply Chain", "Order Management", "MS Excel", "PowerPoint", "Word", "MRP/ERP", "NetSuite", "Communication", "Interpersonal Skills", "Analytical Skills", "Attention to Detail"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3991255515"}