{"jobTitle": "Senior Financial Analyst, Studios Accounting", "company": {"name": "Amazon", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance, Information Technology, and Accounting/Auditing", "industry": "Software Development", "description": "Come support the global growth of Amazon MGM Studios, creating original content for our global customers! Amazon MGM Studios Accounting is looking for a highly motivated and curious Senior Accountant to be a key business partner on the Accounting Team located in Culver City, California. Amazon MGM Studios is known for award winning television series such as Fleabag and The Marvelous Mrs. Maisel, thrillers like The Boys, Jack Ryan, Bosch, and Hunters, Emmy winning children’s series, and Amazon Original Movies such as Manchester by the Sea, The Big Sick, Borat Subsequent Moviefilm, Tomorrow War, and All The Old Knives. International Originals and Live Sports expansion have brought us hits including The Family Man, LOL, El Corazon de Sergio Ramos, and Premiere League. Worldwide, we continue to focus on unique stories, voices, and characters from top and up-and-coming creators.<br/><br/>The right individual will have exceptional accounting skills, strong leadership skills and solid business judgment capable of driving an organization to the right results. They will have operated successfully in a fast-paced, global, results-oriented environment, and have the ability to influence the decisions of senior business leaders through effective verbal and written communication, logical reasoning, and the presentation of alternatives. The successful candidate must be able to think and act both strategically and tactically.<br/><br/>Key job responsibilities<br/><br/><ul><li> Supporting the accounting function, including monthly close, for Amazon Studios global television and motion picture activities</li><li> Developing, implementing and improving accounting and reporting processes for dynamic lines of business</li><li> Understanding accounting and financial principles and how to apply them</li><li> Performing the month-end financial close accounting and financial reporting</li><li> Analyzing complex processes and systems data</li><li> Ensuring compliance with appropriate GAAP and internal controls over financial reporting</li><li> Providing analytical support to the finance and management team to drive improvements to operational &amp; financial results</li><li> Working with cross-functional teams across the company to ensure proper support for the business unit</li><li> Identifying process improvement and automation opportunities to drive positive change across the organization.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 3+ years of finance or a related analytical field experience</li><li> Bachelor's degree in accounting or related field</li><li> Experience in identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes</li><li> Experience operating in a fast-paced, results-oriented environment</li><li> Effective verbal and written communication<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> CPA</li><li> Knowledge of GAAP research tools and the FASB codification</li><li> Experience researching and documenting support for accounting conclusions</li><li> Experience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $60,200/year in our lowest geographic market up to $128,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon Studios LLC<br/><br/>Job ID: A2721462", "responsibilities": "Supporting the accounting function, including monthly close, for Amazon Studios global television and motion picture activities\nDeveloping, implementing and improving accounting and reporting processes for dynamic lines of business\nUnderstanding accounting and financial principles and how to apply them\nPerforming the month-end financial close accounting and financial reporting\nAnalyzing complex processes and systems data\nEnsuring compliance with appropriate GAAP and internal controls over financial reporting\nProviding analytical support to the finance and management team to drive improvements to operational &amp; financial results\nWorking with cross-functional teams across the company to ensure proper support for the business unit\nIdentifying process improvement and automation opportunities to drive positive change across the organization.", "qualifications": {"required": "3+ years of finance or a related analytical field experience\nBachelor's degree in accounting or related field\nExperience in identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes\nExperience operating in a fast-paced, results-oriented environment\nEffective verbal and written communication", "preferred": "CPA\nKnowledge of GAAP research tools and the FASB codification\nExperience researching and documenting support for accounting conclusions\nExperience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)"}, "skills": ["SQL", "MS Access", "Essbase", "Cognos", "Oracle", "SAP", "Lawson", "JD Edwards"], "postedDate": "6 hours ago", "salary": {"amount": "60,200.00/year - 128,800.00/year", "currency": "USD"}, "benefits": "Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991791124"}