{"jobTitle": "Supply Chain Associate", "company": {"name": "OSI Optoelectronics", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Semiconductors", "description": "<strong>Overview<br/><br/></strong>OSI Systems companies have a long history of developing innovative solutions to bring a better quality of life to the world. Healthcare, security and defense are among the key markets where we have made significant inroads with new ideas, products and processes. We know that many people live in difficult and dangerous conditions. To improve these circumstances, experts need simple, effective tools utilizing the latest in technology.<br/><br/>As a global company, we are dedicated to developing these tools for our customers and the people they serve worldwide. Our singular focus is to help security experts, clinical professionals and high-tech developers solve real-world problems and issues.<br/><br/>Our OSI Optoelectronics division is a diversified manufacturer of electronic devices and value-added manufacturing services for use in a broad range of applications, including aerospace and defense electronics, security and inspection systems, and medical monitoring and diagnostics.<br/><br/>OSI Optoelectronics is seeking a Supply Chain Associate to join their team. This individual will be responsible for supporting Supply Chain operations through preparation and analyzing supplier performance data. They will also facilitate the flow of materials using resource planning tools along with professional communication with suppliers and team members. Technical data gathering and reporting of purchased item is involved. In addition, they will also sustain supplier's approval status for Quality, Material Planning and Procurement, Accounting, Engineering, and Legal departments.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Maintain supplier records in accordance with company policy.</li><li>Prepare and report supplier performance data. </li><li>Assist with MRB inventory management and facilitate product returns for on-site and global locations. </li><li>Support Procurement, Quality and Manufacturing operations in relation to supplier activities.</li><li>Work directly with supply chain to communicate and uphold technical, quality, and business requirements.</li><li>Uphold the company’s core values of Integrity, Innovation, Accountability, and Teamwork.</li><li>Demonstrate behavior consistent with the company’s Code of Ethics and Conduct.</li><li>It is the responsibility of every employee to report to their manager or a member of senior management any quality problems or defects in order for corrective action to be implemented and to avoid recurrence of the problem.</li><li>Duties may be modified or assigned at any time to meet the needs of the business.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>High School Diploma or equivalent required.</li><li>Associate's degree in Supply Chain or related field is desired. </li><li>Experience with Resource Planning software (ERP) and inventory management required. </li><li>1+ years of experience with supply chain required. </li><li>Basic knowledge of reading technical drawings is essential. Computer assisted drafting experience strongly desired. </li><li>Quality Management Solution (QMS) training desired. </li><li>Problem solving experience; applicable use of quality problem analysis and solving tools. </li><li>Strong written and verbal communication skills. </li><li>Working knowledge of computer basic skills including Microsoft Office and business software (ERP). </li><li>Team oriented with the ability to work with various departments, vendors, customers and a diverse group of personalities. </li><li>Adept in research, compiling, anaylzing, and presenting data.</li><li>Ability to be organized while doing multiple tasks. <br/><br/></li></ul><strong>Please review our benefits here: Life at OSI<br/><br/></strong>The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location and date of hire. Please note that the salary information shown above is a general guideline only. Salaries are based upon candidate experience and qualifications, as well as market and business considerations.<br/><br/><strong>NOTICE TO THIRD PARTY AGENCIES<br/><br/></strong><em>OSI Systems, Inc. and its subsidiaries (collectively “OSI”) does not accept unsolicited resumes from recruiters or employment agencies. If any person or entity, including a recruiter or agency, submits any information, including any resume or information regarding any potential candidate, without a signed agreement in place with OSI, OSI explicitly reserves the right to use such information, and pursue and/or hire such candidates, without any financial obligation to the person, recruiter or agency. Any unsolicited information or resumes, including those submitted directly to hiring managers, are considered and deemed to be the property of OSI.<br/><br/></em><strong>Equal Opportunity Employer<br/><br/></strong><strong>EEO is the Law<br/><br/></strong>Poster Link: https://www.eeoc.gov/sites/default/files/2022-10/22-088_EEOC_KnowYourRights_10_20.pdf<br/><br/><em>OSI Systems, Inc. has three operating divisions: (a) Security, providing security and inspection systems, turnkey security screening solutions and related services; (b) Healthcare, providing patient monitoring, diagnostic cardiology and anesthesia systems; and (c) Optoelectronics and Manufacturing, providing specialized electronic components and electronic manufacturing services for original equipment manufacturers with applications in the defense, aerospace, medical and industrial markets, among others.</em>", "responsibilities": "Maintain supplier records in accordance with company policy.Prepare and report supplier performance data. Assist with MRB inventory management and facilitate product returns for on-site and global locations. Support Procurement, Quality and Manufacturing operations in relation to supplier activities.Work directly with supply chain to communicate and uphold technical, quality, and business requirements.Uphold the company’s core values of Integrity, Innovation, Accountability, and Teamwork.Demonstrate behavior consistent with the company’s Code of Ethics and Conduct.It is the responsibility of every employee to report to their manager or a member of senior management any quality problems or defects in order for corrective action to be implemented and to avoid recurrence of the problem.Duties may be modified or assigned at any time to meet the needs of the business.", "qualifications": {"required": "High School Diploma or equivalent required.Experience with Resource Planning software (ERP) and inventory management required. 1+ years of experience with supply chain required. Basic knowledge of reading technical drawings is essential. Computer assisted drafting experience strongly desired. Problem solving experience; applicable use of quality problem analysis and solving tools. Strong written and verbal communication skills. Working knowledge of computer basic skills including Microsoft Office and business software (ERP). Team oriented with the ability to work with various departments, vendors, customers and a diverse group of personalities. Adept in research, compiling, anaylzing, and presenting data.Ability to be organized while doing multiple tasks.", "preferred": "Associate's degree in Supply Chain or related field is desired. Quality Management Solution (QMS) training desired."}, "skills": ["Supply Chain", "ERP", "Inventory Management", "Technical Drawings", "Quality Management", "Problem Solving", "Communication", "Microsoft Office", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Please review our benefits here: Life at OSI", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991901913"}