{"jobTitle": "Regional HR Head, California", "company": {"name": "Alcon", "industry": "Medical Equipment Manufacturing", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "153,520.00/yr - 230,280.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Medical Equipment Manufacturing", "description": "At Alcon, we are driven by the meaningful work we do to help people see brilliantly. We innovate boldly, champion progress, and act with speed as the global leader in eye care. Here, you’ll be recognized for your commitment and contributions and see your career like never before. Together, we go above and beyond to make an impact in the lives of our patients and customers.<br/><br/>We foster an inclusive culture and are looking for diverse, talented people to join Alcon. As the <strong>Regional HR Head California </strong>supporting <strong>Manufacturing Technical Operations (MTO) </strong>based in <strong>Irvine, California,</strong> you will be trusted to solve complex organizational challenges through people-related solutions. You will also develop and be accountable for the execution of people strategies. You will deliver on Alcon's foundational principles (customer, innovation &amp; people) to drive value creation in the areas of people, organization, and culture.<br/><br/>In this role, a typical day will include:<br/><br/><ul><li>Lead, develop, and inspire a team of HR professionals that deliver exceptional experiences to managers and associates. This includes using data and metrics to advise business leaders, make well-informed decisions, and drive thoughtful workforce planned reliable HR support to the business.</li><li>Partner with the site leadership team to deliver core HR services and ensures optimal management of HR processes. This includes having in-depth knowledge of top talent and providing mentorship to managers to help them accelerate talent readiness.</li><li>Maintaining strong relations with Alcon leaders and the Site HR Leaders. They will support the HR Centers of Excellence (COEs) with the design of global HR initiatives and programs. They understand the unique environment of the site and partner with managers and leaders to address potential issues proactively.</li><li>Implement programs to support Alcon associates, including compensation, performance, diversity, and inclusion, as well as talent development initiatives.</li><li>Understand employment laws and regulations that apply to the site.</li><li>Drive business success by coaching and advising teams on associate experience initiatives, such as Associate Experience Dashboard, Recognition programs, etc.</li><li>Ensure timely execution of all people-related processes at the site.</li><li>Coach business leaders on all HR-related topics (e.g., change management, talent management, career development, etc.)</li><li>Accountable for driving a high-quality talent bench, through the selection process, equitable compensation practices, and adequate talent development.</li><li>Support diagnostic intervention and problem resolution strategies to contribute HR point of view to business issues.</li><li>Responsible for Employee / Labor Relations &amp; Legal Requirements and partners with global Employee Relations on complex ER matters<br/><br/></li></ul><strong>WHAT YOU'LL BRING TO ALCON:<br/><br/></strong><ul><li>Bachelor’s Degree or Equivalent years of directly related experience (or high school +18 yrs; Assoc.+14 yrs; M.S.+7 yrs; PhD+6 yrs)</li><li>The ability to fluently read, write, understand, and communicate in English.</li><li>10 Years of Relevant Experience</li><li>6 Years of Demonstrated Leadership</li><li>Travel Requirements: 10%<br/><br/></li></ul>Preferred requirements:<br/><br/><ul><li>Ability to influence and interact with all levels of the company, comfortable with senior management.</li><li>Strong analytical and communication skills.</li><li>Ability to collaborate and partner cross-functionally.</li><li>See your career like never before with focused growth and development opportunities.<br/><br/></li></ul><strong>HOW YOU CAN THRIVE AT ALCON:<br/><br/></strong><ul><li>See your career like never before with focused growth and development opportunities.</li><li>Join Alcon’s mission to provide outstanding, innovative products and solutions to improve sight, improve lives, and grow your career!</li><li>Alcon provides a robust benefits package including health, life, retirement, flexible time off for exempt associates, PTO for hourly associates, and much more!<br/><br/></li></ul><strong>Alcon Careers<br/><br/></strong>See your impact at alcon.com.careers<br/><br/>Alcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to alcon.recruitment@alcon.com and let us know the nature of your request and your contact information.<br/><br/><strong>ATTENTION: Current Alcon Employee/Contingent Worker<br/><br/></strong>If you are currently an active employee/contingent worker at Alcon, please click the appropriate link below to apply on the Internal Career site.<br/><br/>Find Jobs for Employees<br/><br/>Find Jobs for Contingent Worker<br/><br/><strong>Total Rewards<br/><br/></strong>Alcon’s Total Rewards programs are designed to align to incentives with business goals, encourage the right values and behaviors, and deliver long-term value. The first layer of our rewards program is compensation. We offer a combination of fixed pay and variable pay, which includes short-term incentives, and long-term incentives for eligible population. Our benefits program provides security for life events through life and disability insurance, supports savings for retirement, promotes good health and well-being and supports associates and their families during times of illness. To learn more about Alcon’s Corporate Social Responsibility including our Total Rewards, click here<br/><br/><strong>Pay Range<br/><br/></strong>$153,520.00 - $230,280.00<br/><br/><strong>Pay Frequency<br/><br/></strong>Annual<br/><br/>Alcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to <strong><strong>alcon.recruitment@alcon.com</strong></strong> and let us know the nature of your request and your contact information.", "responsibilities": "Lead, develop, and inspire a team of HR professionals that deliver exceptional experiences to managers and associates. This includes using data and metrics to advise business leaders, make well-informed decisions, and drive thoughtful workforce planned reliable HR support to the business.\nPartner with the site leadership team to deliver core HR services and ensures optimal management of HR processes. This includes having in-depth knowledge of top talent and providing mentorship to managers to help them accelerate talent readiness.\nMaintaining strong relations with Alcon leaders and the Site HR Leaders. They will support the HR Centers of Excellence (COEs) with the design of global HR initiatives and programs. They understand the unique environment of the site and partner with managers and leaders to address potential issues proactively.\nImplement programs to support Alcon associates, including compensation, performance, diversity, and inclusion, as well as talent development initiatives.\nUnderstand employment laws and regulations that apply to the site.\nDrive business success by coaching and advising teams on associate experience initiatives, such as Associate Experience Dashboard, Recognition programs, etc.\nEnsure timely execution of all people-related processes at the site.\nCoach business leaders on all HR-related topics (e.g., change management, talent management, career development, etc.)\nAccountable for driving a high-quality talent bench, through the selection process, equitable compensation practices, and adequate talent development.\nSupport diagnostic intervention and problem resolution strategies to contribute HR point of view to business issues.\nResponsible for Employee / Labor Relations &amp; Legal Requirements and partners with global Employee Relations on complex ER matters", "qualifications": {"required": "Bachelor’s Degree or Equivalent years of directly related experience (or high school +18 yrs; Assoc.+14 yrs; M.S.+7 yrs; PhD+6 yrs)\nThe ability to fluently read, write, understand, and communicate in English.\n10 Years of Relevant Experience\n6 Years of Demonstrated Leadership\nTravel Requirements: 10%", "preferred": "Ability to influence and interact with all levels of the company, comfortable with senior management.\nStrong analytical and communication skills.\nAbility to collaborate and partner cross-functionally.\nSee your career like never before with focused growth and development opportunities."}, "skills": [], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Alcon provides a robust benefits package including health, life, retirement, flexible time off for exempt associates, PTO for hourly associates, and much more!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3991336674"}