{"jobTitle": "Client Advisor Manager - Beverly Hills", "company": {"name": "Moncler", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales and Management", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong><u>POSITION OVERVIEW</u></strong>:<p>The Client Advisor Manager (CAM) is a Brand ambassador who embodies the Moncler Client Promise and represents the Brand’s values in the execution of their role. Reporting to the Store Manager/Director, the CAM is responsible for delivering exceptional business results, by leading and coaching a team, supporting the cultivation of client relationships, proactively fostering the achievement of sales goals, and ensuring the utmost level of client experience is delivered to all Moncler clients. In addition, this role will support the Store Manager/Director in partnership with the Human Resources team to recruit and build highly motivated and high-performing teams, contributing to succession planning and future of Moncler Group.</p><p><br/></p><p><strong><u>RESPONSIBILITIES</u></strong>:</p><p>Team</p><ul><li>Ensure the team delivers the Moncler Client Promise through the client experience, to all clients. Through consistent one to ones, observations, and coaching during. Identify team development and training needs, and partner with the Field Training Manager to tailor individual action plans.</li><li>Identify, recruit, develop talent, and secure succession plans in collaboration with the Store Manager/Director and Human Resources.</li><li>Manage and inspire the team to drive business: create a positive and harmonious work environment, where trust and respect for diversity is valued, and foster cooperation within the team.</li><li>Proactively assess and manage performance against expectations. Partner with Store Manager/Director as well as Human Resources for performance management and progressive discipline.</li><li>Conduct monthly one to ones and performance reviews.</li></ul><p>Client</p><ul><li>Lead by example and establish a client-centric mindset to ensure the utmost level of Client experience.</li><li>Support the team in building long term client relationships by leveraging clienteling tools, executing on clienteling activities, and developing action plans to reach objectives and KPIs.</li><li>Monitor team performance on a daily/weekly/monthly basis, to ensure clienteling excellence.</li><li>Drive conversion and new client acquisition during elevated, engaging CEM segments.</li></ul><p>Business</p><ul><li>Proactively provide the Merchandising team with product recommendations and qualitative feedback (product performance, quality, client related information, local market, competitors, trends, and missed opportunities) leveraging the knowledge of the team.</li><li>Convey enthusiasm and passion via team animations, daily briefings, information sharing, and mentoring.</li><li>Implement action plans to drive business and maximize product performance, leveraging visual merchandising, clienteling, training and team animations.</li><li>Communicate corporate strategy and relevant business information through inspiring techniques to illicit buy in and engagement around the Company vision.</li></ul><p>Selling and Floor Management</p><ul><li>Drive performance during Client Experience Management (CEM) segments, through strategic planning, support and execution, before, during and after the sale.</li><li>Lead by example, demonstrating sales leadership to the team. Support them with their own sales, and foster cross-selling, prospecting, new client acquisition and client repurchase during CEM segments.</li><li>Build and develop own client portfolio.</li><li>Manage the client flow on the selling floor as the CEM, to ensure all clients are attended to and exceptional service is delivered.</li><li>Proactively handle escalated client related situations.</li><li>Ensure business opportunities are maximized through efficient client experiences and sales floor management, being a visible presence and support, and ensuring the Moncler Client Promise and Brand values are achieved.</li></ul><p>Operations</p><ul><li>Collaborate with Operations, Human Resources, Asset Protection, and other cross-functional departments to ensure the adherence of all Company policies and procedures.</li><li>Support and maintain visual merchandising standards.</li><li>Ensure grooming guidelines are communicated and implemented.</li></ul><p><br/></p><p><strong><u>REQUIREMENTS</u></strong></p><p>The Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship would result.</p><p><br/></p><p><strong><u>Education</u></strong></p><ul><li>Bachelor’s degree a plus.</li></ul><p><br/></p><p><strong><u>Work Experience</u></strong></p><ul><li>Minimum 5 years of progressive retail experience.</li><li>Minimum 3 years of experience managing teams in retail, luxury retail, or service-related industry.</li></ul><p><br/></p><p><strong><u>Special Skills and Personal Attributes</u></strong></p><ul><li>Building effective and high performing teams</li><li>Hiring and staffing</li><li>Managing vision and purpose</li><li>Managerial courage</li><li>Client-centric individual who thrives in a fast-paced and dynamic environment.</li><li>Proven track record of successful sales generation and client development.</li><li>Strong ability to drive for results without compromising ethics and quality.</li><li>Strong business acumen and analytical skills with the ability to read and analyze reports and perform fundamental calculations.</li><li>Professional presentation; able to communicate effectively both verbally and in writing with all levels internally as well as with clients.</li><li>Technologically adept with proficiency in Microsoft tools (e.g. MS Word, MS Excel, Outlook).</li></ul><p><br/></p><p>For individuals assigned and/or hired to work in California, Moncler includes a reasonable estimate of the salary rate range for this role. This considers the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications. A reasonable estimate of the current base salary range is $85,000 per annum to $110,000 per annum.</p>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3991006649"}