{"jobTitle": "Sales Operations Analyst", "company": {"name": "Canonical", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Business Development and Sales", "industry": "Technology, Information and Internet", "description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.<br/><br/>The company is founder led, profitable and growing.<br/><br/>We are hiring Sales Operations Analysts to join a team of experts who help Canonical sales teams achieve their business goals. The Sales Operations team drives continuous process and data quality improvement to ensure orders are processed correctly. The successful candidate will be a leader who shows initiative in improving the way the team works, maintaining compliance and associated governance.<br/><br/>The success of the role is measured against increasing the velocity of deals and the quality of Customer Relationship Management (CRM) data used to drive key business decisions. The ideal candidate will be a proactive problem solver and team player who is passionate about the opportunity to partner with sales leadership, is also passionate about our role in the technology industry bringing open source to a wider audience of innovators and enterprises, and will design and drive programs in support of Canonical's continued success.<br/><br/><strong>Location:</strong> <em>This role will be based remotely in the EMEA and Americas regions.<br/><br/></em>The role entails<br/><br/><ul><li>Support all aspects of the day-to-day operations of the sales function globally</li><li>Review opportunities for accuracy and provision orders on successful closure of a deal</li><li>Support the Sales Operations Manager to improve sales data quality and processes</li><li>Report on data quality metrics to executive level stakeholders</li><li>Implement surveys and define metrics for executive level stakeholders</li><li>Support the sales team globally on CRM and other sales operations systems</li><li>Deliver sales metrics, dashboards and other ad-hoc analytical tasks</li><li>Lead automation and streamline the Lead to Order process<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>An exceptional academic track record from high school and university</li><li>Experience in a sales operations/sales order processing role</li><li>Experience in a technology subscription-based business</li><li>Experience driving data quality improvement</li><li>Energetic, thoughtful, systematic approach, focused on robust, repeatable and scalable outcomes</li><li>Excellent problem-solving and analytical skills</li><li>Ability to work productively with stakeholders at all levels of the organization on a global scale</li><li>Ability to manage across boundaries and communicate effectively, particularly working with Sales, Legal, Finance and Marketing teams</li><li>Experience with Salesforce or similar CRM</li><li>Ability to travel internationally twice a year, for company events up to two weeks long<br/><br/></li></ul>What Canonical offers<br/><br/>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/>Canonical is an equal opportunity employer<br/><br/><em>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/></em>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3991565889"}