{"jobTitle": "Sr. Buyer, DTC", "company": {"name": "Wolf & Shepherd", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing, Supply Chain, and Production", "industry": "Retail Apparel and Fashion", "description": "<strong>Title: </strong>Sr. Buyer, DTC\n\n<strong>Reports to: </strong>Sr. Director of Merchandising\n\n<strong>Location: </strong>Onsite, HQ Office in El Segundo, CA\n\n<br/>\n\n<strong>JOB TYPE</strong> This is a full-time, exempt position based in El Segundo, CA. This role is onsite M-Th with potential for WFH Fridays.\n\n<br/>\n\n<strong>WHO WE ARE</strong>\n\nWolf & Shepherd is designed to equip professionals to win in all aspects of their lives through comfortable fashionable footwear. The concept came from the problem professionals face, going to and from work in athletic shoes just to avoid the common discomfort found in a quality dress shoe. As a fast-growing lifestyle brand, we are on a mission to debunk the myth that classically styled shoes can’t have modern technology comforts.\n\n<br/>\n\n<strong>WHAT WE NEED</strong>\n\nWe’re searching for a talented Sr. Buyer to contribute to the future development of the brand. We’re looking for someone with passion, creativity, and an entrepreneurial spirit to join our Merchandising team. The buyer is responsible for creating and executing the seasonal merchandise assortment strategies for our DTC Ecommerce and Retail channels. The buyer partners with the Sr. Manager of Integrated planning as well as the Sr. Director of Merchandising on creating the Open-to-Buy pre-season, setting the merchandise strategy, assorting and writing all seasonal fashion buys and works with team to identify and manage a balanced product mix of new, carryover and core products that will drive sales, achieve company targets and excite the consumer with strong, fresh, and well curated products.\n\n<br/>\n\n<strong>TASKS & RESPONSIBILITIES</strong>\n\nYour responsibilities are inclusive of the following but are not limited to:\n\n<ul>\n<li>Partner with Sr. Manager of Integrated Planning to create seasonal merchandise strategies and assortment plans from a Topline and Bottoms Up Approach and manages in-season needs to achieve company sales, gm and turn objectives.</li>\n<li>Select assortment and buy quantification for seasonal fashion assortments while also partnering with Sr. Manager of Integrated planning on assortment needs for Core and Carryover product; managing the product lifecycle in-season along with Sr. Director of Merchandising.</li>\n<li>Analyze selling weekly across both Ecom and Retail Channels and creates summary reports Weekly, Monthly, Qtrly and Seasonally that include summarization of KPIs identified to be tracked and can be distributed to various team members across the organization for in-season review as well as hindsighting needs for future line plan building.</li>\n<li>Compile feedback for new opportunities and provide seasonal recommendations for product opportunities for each channel.</li>\n<li>Track PO’s coming in weekly with Sr. Manager Integrated Planning to make sure launches stay on track and work together to identify if any shifts are needed.</li>\n<li>Propose course correction needs in-season and partner with Sr. Manager Integrated Planning and Sr. Director of Merchandising to identify potential promo, MD and reorder needs.</li>\n<li>Participate in the monthly OTB review led by the Sr. Manager of Integrated Planning by aligning on forecast projections with department prior to group and sharing key insights, course correction needs and investment strategies from the DTC channel perspective.</li>\n<li>Act as key liaison with Retail store team and Ecom team for passing off seasonal buys/lookbook communications and providing training and visual merchandising guidance to the teams on the new seasonal product offerings and seasonal messages.</li>\n<li>Partner weekly and monthly with Ecom and Marketing teams to build seasonal launch calendars, promo calendars and align on needs for email marketing to help drive sales.</li>\n<li>Ensure all pricing, product and copy is correct with Ecom team before seasonal Launches</li>\n<li>Develop ways to improve process and reporting, regularly working through enhancements to improve efficiencies and take the dept to the next level.</li>\n<li>Assist team with any other ad hoc projects requested and/or approved by Manager</li>\n</ul>\n\n<br/>\n\n<strong>REQUIREMENTS & QUALIFICATIONS</strong>\n\n<ul>\n<li>At least 3 years experience at Buyer level for ecommerce and brick-and-mortar</li>\n<li>Strong excel skills with ability to set up advanced-level formulas, pivot tables and be comfortable working with raw data and organizing it into user-friendly reports.</li>\n<li>Knowledge of how to create Macros a plus.</li>\n<li>Strong writing, communication and presentation skills</li>\n<li>Self Starter who can work independently as well as with teams as needed</li>\n<li>Flexible, collaborative, and a forward thinker</li>\n<li>Comfortable working in a fast-paced start-up environment that is in process of building the next level processes and operations for a growing business</li>\n<li>Previous background in Mens and footwear a plus</li>\n<li>Previous experience using Netsuite a plus</li>\n<li>Previous experience using Shopify a plus</li>\n<li>Contemporary fashion brand experience preferred</li>\n<li>Previous background in planning preferred</li>\n</ul>\n\n<br/>\n\n<strong>PERKS & BENEFITS </strong>\n\nWe are committed to offering our employees a challenging and rewarding work environment, opportunities for growth and development, benefits, and a competitive compensation package.\n\n<ul>\n<li>Health, vision, and dental benefits program</li>\n<li>401(k) plan</li>\n<li>Paid time off</li>\n<li>Sick pay</li>\n<li>Frequent free meals and snacks and company-sponsored gatherings</li>\n<li>Wolf & Shepherd shoes and more</li>\n</ul>", "postedDate": "2 weeks ago", "skills": ["Excel", "Macros", "Writing", "Communication", "Presentation Skills", "Netsuite", "Shopify", "Planning"], "url": "https://www.linkedin.com/jobs/view/3991699935"}