{"jobTitle": "Operations Manager - San Bernardino, CA", "company": {"name": "Amazon", "industry": "Software Development", "size": "Large", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$81,900.00 - $150,100.00", "currency": "USD"}, "jobFunction": "Management, Distribution, and Supply Chain", "industry": "Software Development", "description": "Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Operations Manager. In this role, you will lead and develop a team of salaried and hourly talent. You will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. To achieve this, managers are expected to provide their team with the tools needed for success while driving improvements in productivity and efficiency through data-driven decisions and analytical problem-solving. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.", "responsibilities": "Support, mentor, and motivate your salaried and hourly workforce; Lead large-scope projects with site and regional impact; Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance; Manage safety, quality, productivity, and customer delivery promises; Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives; Lift up to 49 pounds and frequently push, pull, squat, bend, and reach; Stand/walk for up to 12 hours during shifts; Work in an environment where the noise level varies and can be loud; Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments); Continuously climb and descend stairs (applies to sites with stairs).", "qualifications": {"required": "3+ years of employee and performance management experience; Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience; Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays.", "preferred": "1+ years of performance metrics, process improvement or lean techniques experience; Experience managing a team of 2+ salaried employees and 70+ indirect employees; Experience scoping, leading, and implementing process improvements through: Lean process, Kaizen, and/or Six Sigma; Demonstrated problem solving skills and analytical skills; Excellent customer service skills, communication skills and interpersonal skills; Track record of meeting or exceeding department performance goals; A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field; Experience in: military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production, or distribution environments."}, "skills": [], "postedDate": "16 hours ago", "applicationDeadline": "", "benefits": "Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991317828"}