{"jobTitle": "Senior Manager, Media Strategy", "company": {"name": "Kargo", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00- $100,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Kargo creates breakthrough cross-screen ad experiences for the world's leading brands and publishers. Everyday, our 600+ employees bring the power of their creativity and diversity to radically raising the bar on what mobile, CTV, AI, social, and eCommerce can do to wow consumers and build businesses. Now 20 years strong, Kargo has offices in NYC, Chicago, Austin, LA, Dallas, Sydney, Auckland, London and Waterford, Ireland. Humble brag: In 2024, Kargo was recognized as a Best Place to Work by <em>Ad Age</em> and <em>Built In</em>.<br/><br/><strong>Who We Hire<br/><br/></strong>Success takes all kinds. Diversity describes our workforce. Inclusion defines our culture. We do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, marital status, age, national origin, protected veteran status, disability or other legally protected status. Individuals with disabilities are provided reasonable accommodation to participate in the job application process, perform essential job functions, and receive other benefits and privileges of employment.<br/><br/><strong>Title: </strong>Senior Manager, Media Strategy<br/><br/><strong>Job Type:</strong> Full Time, In-Office Hybrid Required<br/><br/><strong>Job Location: </strong>Los Angeles, CA<br/><br/><strong>Salary Range:</strong> $80,000.00- $100,000.00 OTE<br/><br/><strong>The Opportunity<br/><br/></strong>We are looking for an experienced, energetic, creative, and solutions-oriented Sr. Manager to join our Media Strategy team. This person will be responsible for developing inspiring, innovative, and strategic digital marketing campaigns for top tier advertisers. Additionally, this person will manage a team of 5x direct reports, and will help facilitate regular 1:1s, coverage and account allocations, and career growth planning for their direct reports. In this role, you will report to the Director of Media Strategy.<br/><br/><strong>The Daily To-Do<br/><br/></strong><ul><li>Manage RFP responses for the top 2-3 sellers in the West Coast </li><li>Manage and support all Associate Media Strategists and Media Strategists in the LA office, facilitating weekly 1:1's with each </li><li>Provide advanced support for higher level MS or cross-departmental projects (more than SME, managing policies etc)</li><li>Work closely alongside the Director of Media Strategy to build, update, and implement new processes and templates that will help streamline the daily tasks of the Media Strategy department<br/><br/></li></ul><strong>Qualifications : <br/><br/></strong><ul><li>5+ years online sales marketing experience</li><li>Experience in developing strategic, creative, innovative and effective proposals and marketing materials for an advertising sales team in an online media company. Prior experience for a consumer-facing, ad-supported website or with a digital ad agency preferred.</li><li>Ability to develop concepts and ideas that are effective online and deliver value to our advertisers and users</li><li>Self-motivator with the ability to thrive in a fast paced environment with multiple projects and tight deadlines</li><li>Highly creative and strategic; proactive; strong organizational skills; effective communicator</li><li>Expert in MS PowerPoint and Google Slides– a must – and all other MS Office Tools</li><li>Excellent verbal and written communication skills</li><li>Excellent people-management skills</li><li>Ability to work cross-departmentally and act as subject matter expert for the department<br/><br/></li></ul><strong>Follow Our Lead<br/><br/></strong><ul><li>Big Picture: kargo.com</li><li>The Latest: Instagram (@kargomobile) and LinkedIn (Kargo)</li></ul>", "responsibilities": "Manage RFP responses for the top 2-3 sellers in the West Coast Manage and support all Associate Media Strategists and Media Strategists in the LA office, facilitating weekly 1:1's with each Provide advanced support for higher level MS or cross-departmental projects (more than SME, managing policies etc) Work closely alongside the Director of Media Strategy to build, update, and implement new processes and templates that will help streamline the daily tasks of the Media Strategy department", "qualifications": {"required": "5+ years online sales marketing experience Experience in developing strategic, creative, innovative and effective proposals and marketing materials for an advertising sales team in an online media company. Prior experience for a consumer-facing, ad-supported website or with a digital ad agency preferred. Ability to develop concepts and ideas that are effective online and deliver value to our advertisers and users Self-motivator with the ability to thrive in a fast paced environment with multiple projects and tight deadlines Highly creative and strategic; proactive; strong organizational skills; effective communicator Expert in MS PowerPoint and Google Slides– a must – and all other MS Office Tools Excellent verbal and written communication skills Excellent people-management skills Ability to work cross-departmentally and act as subject matter expert for the department"}, "skills": ["Sales", "Marketing", "Digital Marketing", "Media Strategy", "RFP", "PowerPoint", "Google Slides", "MS Office", "Communication", "People Management"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3991925488"}