{"jobTitle": "Vice President of Large Projects", "company": {"name": "Imperium Global", "location": "Paramount, CA"}, "location": "Paramount, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Administrative, Engineering, and Project Management", "industry": "Construction, Civil Engineering, and Industrial Machinery Manufacturing", "description": "<strong><em>*This position is being advertised on behalf of a Retained client of Imperium Global. For total clarity, this position isn't for Imperium Global, it is for our Paramount-based construction client*</em></strong><br/><br/><strong>Job Title: Vice President, Large Projects Organization</strong><br/><strong>Reports To: Senior Executive President </strong><br/><br/><strong>Job Summary:</strong><br/>The P&amp;L Leader is accountable for the financial performance, strategic oversight, and operational leadership of large-scale projects within the organization. This role requires a strong focus on profitability, client satisfaction, and project execution excellence.<br/><br/>1. <strong>Strategic Planning</strong>: Work with the Commercial Operations leader to develop and implement strategic plans for large projects, aligning with organizational goals and market opportunities.<br/>2. <strong>Business Development</strong>: Work with the Commercial Operations leader to identify and pursue new business opportunities to expand the large projects portfolio.<br/>3. <strong>Define Project Scope and Objectives</strong>: Collaborate with the Commercial Operations team to work with clients and stakeholders to outline the project’s goals and requirements.<br/>4. <strong>Develop Project Plans</strong>: Manage a team of Project Management staff to create and ensure proper detailed project plans, including timelines, milestones, budgets, and resource allocation.<br/>5. <strong>Lead Project Teams</strong>: Assemble and lead multidisciplinary teams and construction managers. Work with Project Controls to ensure proper compliance with our Project Management software InEight.<br/>6. <strong>Mentor and Develop Staff</strong>: Provide guidance and support to team members, fostering professional growth and ensuring high performance.<strong> </strong>Mentor and develop staff, ensuring the team has the skills and knowledge to deliver successful projects.<br/>7. <strong>Budget Oversight</strong>: Manage the project budget, track expenses, and ensure financial targets are met for the LPO P&amp;L.<br/>8. <strong>Cost Control</strong>: Implement cost-saving measures and monitor financial performance to maintain profitability on a job by job basis.<br/>9. <strong>Client Relations</strong>: Serve as the primary point of contact for clients, addressing concerns, and ensuring satisfaction from an operational perspective across the entire portfolio of projects across the entire organization that fall under the LPO P&amp;L.<br/>10. <strong>Stakeholder Communication</strong>: Facilitate communication with all stakeholders, including regulatory agencies, subcontractors, and suppliers.<br/>11. <strong>Identify and Mitigate Risks</strong>: Proactively identify potential risks and develop mitigation strategies to ensure project success.<br/>12. <strong>Compliance</strong>: Ensure all project activities comply with relevant regulations, standards, and client requirements.<br/>13. <strong>Oversee Project Execution</strong>: Monitor project progress, ensuring adherence to schedules, quality standards, and safety protocols. This will require regular jobsite visits and verification of progress on projects as well as leading leadership meetings with clients when necessary.<br/>14. <strong>Quality Assurance</strong>: Implement quality control measures to ensure the project meets or exceeds client expectations.<br/>15. <strong>Progress Reporting</strong>: Prepare and present regular progress reports to senior management and clients across the entire portfolio of projects under the LPO.<br/>16. <strong>Documentation</strong>: Maintain comprehensive project documentation, including contracts, change orders, and project deliverables within the contract scope and in alignment with company processes and requirements.<br/>17. <strong>Process Improvement</strong>: Identify opportunities for process improvements and implement best practices to enhance efficiency and effectiveness.<br/>18. <strong>Innovation</strong>: Encourage the adoption of new technologies and methodologies to improve project outcomes.<br/>19. <strong>Contract Negotiation</strong>: During pursuit phase of large project opportunities work with the Commercial Operations team to negotiate terms and conditions with clients, subcontractors, and suppliers. Ensure project management staff is equipped with the proper information to execute to the contract.<br/>20. <strong>Contract Administration</strong>: Oversee the administration of contracts, ensuring all terms are met and any disputes are resolved promptly.<br/>21. <strong>HSE Compliance</strong>: Ensure all project activities adhere to health, safety, and environmental regulations.<br/>22. <strong>Safety Leadership</strong>: Promote a culture of safety, leading by example and ensuring all team members prioritize safety in their work.<br/><br/><strong>Qualifications:</strong><br/><ul><li><strong>Education</strong>: Bachelor’s degree in Engineering or Construction Management; MBA or equivalent advanced degree preferred.</li><li><strong>Experience</strong>: Minimum of 10-15 years of experience in project management within the EPC industry, with at least 5 years in a leadership role overseeing large projects.</li><li><strong>Skills</strong>: Strong financial acumen, strategic thinking, excellent leadership and communication skills, ability to manage complex projects, and proficiency in project management software.</li></ul><br/><strong>Key Competencies:</strong><br/><ul><li><strong>Large Project Management: </strong>Experience managing complex Engineering, Procurement, and Construction (EPC) projects as a prime contractor and sub-contractor for projects greater than $60M up to $350M.</li><li><strong>Financial Management</strong>: Deep understanding of financial principles and the ability to manage budgets, forecasts, and financial reports.</li><li><strong>Leadership</strong>: Strong leadership capabilities with a focus on team development and performance.</li><li><strong>Strategic Vision</strong>: Ability to develop and implement strategic plans that align with organizational goals.</li><li><strong>Client Focus</strong>: Commitment to client satisfaction and the ability to build strong client relationships.</li><li><strong>Problem-Solving</strong>: Strong analytical and problem-solving skills, with the ability to address complex project challenges.</li><li><strong>Adaptability</strong>: Ability to adapt to changing market conditions and project requirements.</li></ul><p></p>", "responsibilities": "The P&amp;L Leader is accountable for the financial performance, strategic oversight, and operational leadership of large-scale projects within the organization. This role requires a strong focus on profitability, client satisfaction, and project execution excellence.", "qualifications": {"required": "Minimum of 10-15 years of experience in project management within the EPC industry, with at least 5 years in a leadership role overseeing large projects.", "preferred": "MBA or equivalent advanced degree"}, "skills": ["Financial Management", "Leadership", "Strategic Vision", "Client Focus", "Problem-Solving", "Adaptability", "Project Management", "EPC", "Construction Management", "Engineering"], "postedDate": "2 weeks ago", "benefits": "401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992421665"}