{"jobTitle": "Program Analyst, Strategic Operations", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00 - 240,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>We are looking for a finance professional to partner with one of the growing areas of the business - Gaming. In this role, you will manage the finance procurement operations for each acquired gaming company as well as all other gaming deals driven by Netflix. You will be driving initiatives to add value to our global finance P2P process; ensuring efficiency, scale and mitigating risk. The ideal candidate for this role is someone that has a solid understanding of accounting and the P2P (procure-to-pay) workflow and systems, experience in project management, leading change management, and a passion for developing strong cross-functional relationships with business partners across various functions.<br/><br/>This is a hybrid position that will sit in the office ~3 days per week. This position can be based in our Los Angeles or Los Gatos office and reports to the Manager, Strategic Operations.<br/><br/>Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provide P2P finance guidance and support to all gaming business stakeholders, including finance-related tasks, such as reviewing contracts, creating POs, reviewing invoice coding for accounting accuracy and vendor management to ensure validity of expenses</li><li>Partner with gaming Accounting teams in order to facilitate a timely and accurate month-end close by owing the PO accrual process for global gaming expenses</li><li> Liaise with IT on finance system issues, advise on optimal P2P workflows, and address any other areas of concern</li><li>Drive system automation and innovation across gaming finance workflows while maintaining a risk and fraud prevention mindset </li><li>Develop and leverage data analytics to drive decision-making, identify cost optimization opportunities and ensure goals are measurable and impactful</li><li>Prepare decks, presentations, and memos to effectively communicate the, impact, and status/timeline of finance gaming initiatives and strategies</li><li>Execute on initiatives independently, while keeping leadership and key stakeholders aligned and informed <br/><br/></li></ul>Qualities We’re Looking For<br/><br/><ul><li>5+ years of relevant Operational Finance and/or Accounting experience since the work you do will have direct financial implications</li><li>Experience in P2P workflows, systems, and finance operations</li><li>Strong organization, project, and time management skills</li><li>Highly analytical, detail-oriented, proactive, and self-motivated </li><li>Relationship builder - Ability to cultivate strong cross-functional relationships and communicate effectively with team members and business partners</li><li>Innovation - Enthusiasm for improving and enhancing systems and workflows (learn the existing process and then build/challenge it to better scale for growth while providing meaningful reporting to our business partners)</li><li>Curiosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it; having a positive attitude and never settling for “good enough” are key</li><li>Systems experience with Workday Financials, Airtable, Smartsheets and/or Tableau is a plus</li><li>You embrace and advocate the Netflix culture and our long-term view</li><li>Adaptable - You are comfortable in an ever-changing ecosystem of finance operations workflows, issues, and tight deadlines</li><li>Ability to work independently </li><li>Experience with M&amp;A integrations is a plus</li><li>Experience in gaming a plus</li><li>Bachelor’s Degree in Finance, Accounting<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $240,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Provide P2P finance guidance and support to all gaming business stakeholders, including finance-related tasks, such as reviewing contracts, creating POs, reviewing invoice coding for accounting accuracy and vendor management to ensure validity of expenses\nPartner with gaming Accounting teams in order to facilitate a timely and accurate month-end close by owing the PO accrual process for global gaming expenses\nLiaise with IT on finance system issues, advise on optimal P2P workflows, and address any other areas of concern\nDrive system automation and innovation across gaming finance workflows while maintaining a risk and fraud prevention mindset \nDevelop and leverage data analytics to drive decision-making, identify cost optimization opportunities and ensure goals are measurable and impactful\nPrepare decks, presentations, and memos to effectively communicate the, impact, and status/timeline of finance gaming initiatives and strategies\nExecute on initiatives independently, while keeping leadership and key stakeholders aligned and informed", "qualifications": {"required": "5+ years of relevant Operational Finance and/or Accounting experience since the work you do will have direct financial implications\nExperience in P2P workflows, systems, and finance operations\nStrong organization, project, and time management skills\nHighly analytical, detail-oriented, proactive, and self-motivated \nRelationship builder - Ability to cultivate strong cross-functional relationships and communicate effectively with team members and business partners\nInnovation - Enthusiasm for improving and enhancing systems and workflows (learn the existing process and then build/challenge it to better scale for growth while providing meaningful reporting to our business partners)\nCuriosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it; having a positive attitude and never settling for “good enough” are key\nAdaptable - You are comfortable in an ever-changing ecosystem of finance operations workflows, issues, and tight deadlines\nAbility to work independently \nExperience with M&amp;A integrations is a plus\nExperience in gaming a plus\nBachelor’s Degree in Finance, Accounting", "preferred": "Systems experience with Workday Financials, Airtable, Smartsheets and/or Tableau is a plus"}, "skills": ["Finance", "Accounting", "P2P", "Project Management", "Change Management", "Data Analytics", "Workday Financials", "Airtable", "Smartsheets", "Tableau", "M&A", "Gaming"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992932780"}