{"jobTitle": "Freight Forwarder", "company": {"name": "DSV - Global Transport and Logistics", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.50 - 30.50/ Hourly", "currency": "USD"}, "jobFunction": "General Business, Supply Chain, and Other", "industry": "Truck Transportation", "description": "DSV - Global transport and logistics<br/><br/>In 1976, ten independent hauliers joined forces and founded DSV in Denmark. Since then, DSV has evolved to become the world's 3rd largest supplier of global solutions within transport and logistics. Today, we add value to our customers' entire supply chain by transporting, storing, packaging, re-packaging, processing and clearing all types of goods. We work every day from our many offices in more than 80 countries to ensure a steady supply of goods to production lines, outlets, stores and consumers all over the world. Our reach is global yet our presence is local and close to our customers. Read more at www.dsv.com<br/><br/>Location: Torrance, CA<br/><br/>Division: Air & Sea US<br/><br/>Job Posting Title: Freight Forwarder<br/><br/>Time Type: Full Time<br/><br/>Summary<br/><br/>Freight Forwarder Air Import is responsible for ensuring the timely and efficient importation of goods by air, including customs clearance and delivery to the final destination. This role involves coordinating with multiple parties, including airlines, customs agents, and trucking companies, and requires strong organizational and communication skills.<br/><br/>Duties And Responsibilities<br/><br/><br/>\n<ul><li>Manage the importation of goods by air, including customs clearance and delivery to the final destination</li><li>Communicate with airlines, customs agents, and trucking companies to ensure timely delivery of goods</li><li>Track shipments and provide updates to customers as needed</li><li>Prepare and submit required documentation for customs clearance, including commercial invoices, bills of lading, and other relevant paperwork</li><li>Ensure compliance with all relevant regulations and laws, including customs regulations and trade laws</li><li>Manage relationships with customers and provide exceptional customer service<br/><br/><br/></li></ul>Educational Background / Work Experience<br/><br/><br/>\n<ul><li>Prior experience in freight forwarding, logistics, or a related field is preferred</li><li>Experience in air imports is highly desirable<br/><br/><br/></li></ul>Skills & Competencies<br/><br/>Mathematical Skills<br/><br/><br/>\n<ul><li>Ability to perform basic mathematical calculations, such as calculating costs and rates<br/><br/><br/></li></ul>Other Skills<br/><br/><br/>\n<ul><li>Excellent organizational and time management skills</li><li>Strong communication and interpersonal skills</li><li>Attention to detail and accuracy</li><li>Ability to work well under pressure and in a fast-paced environment<br/><br/><br/></li></ul>Function / Market & Industry Knowledge / Business Acumen / Processes<br/><br/><br/>\n<ul><li>Knowledge of air freight logistics and customs regulations</li><li>Understanding of trade laws and regulations<br/><br/><br/></li></ul>Language Skills<br/><br/><br/>\n<ul><li>Fluency in English is required</li><li>Knowledge of additional languages is a plus<br/><br/><br/></li></ul>Computer Literacy<br/><br/><br/>\n<ul><li>Proficiency in Microsoft Office Suite</li><li>Experience with logistics software and systems is preferred<br/><br/><br/></li></ul>At Will Employment<br/><br/>DSV Air & Sea Inc. employees are hired for an undefined period of time as “at will” employees. This means that an employee may be terminated for any reason, or no reason at all, at any time, provided the discharge does not violate any law*. Additionally, each employee has the right to terminate his/her employment at any time. *Except if employed in Montana, where termination requires just cause.<br/><br/>For this position, the expected base pay is: **$22.50** - **$30.50/ Hourly. **Actual base compensation will be determined based on various factors including job-related knowledge, geographical location, skills, experience, and other objective business considerations.<br/><br/>DSV does not accept unsolicited agency resumes. Please do not forward unsolicited resumes to our website, employees, or Human Resources. DSV will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of DSV and will be processed accordingly without fees.<br/><br/>DSV is an equal employment opportunity employer. Candidates are considered for employment without regard to race, creed, color, national origin, age, sex, religion, ancestry, disability, veteran status, marital status, gender identity, sexual orientation, national origin, or any other characteristic protected by applicable federal, state or local law. If you require special assistance or accommodation while seeking employment with DSV, please contact Human Resources at hr@us.dsv.com. If you are interested in learning the status of your application, please note you will be contacted directly by the appropriate human resources contact person if you are selected for further consideration. DSV reserves the right to defer or close a vacancy at any time.<br/><br/>DSV – Global transport and logistics<br/><br/>DSV is a dynamic workplace that fosters inclusivity and diversity. We conduct our business with integrity, respecting different cultures and the dignity and rights of individuals. When you join DSV, you are working for one of the very best performing companies in the transport and logistics industry. You’ll join a talented team of approximately 75,000 employees in over 80 countries, working passionately to deliver great customer experiences and high-quality services. DSV aspires to lead the way towards a more sustainable future for our industry and are committed to trading on nature’s terms.<br/><br/>We promote collaboration and transparency and strive to attract, motivate and retain talented people in a culture of respect. If you are driven, talented and wish to be part of a progressive and versatile organisation, we’ll support you and your need to achieve your potential and forward your career.<br/><br/>Visit dsv.com and follow us on LinkedIn, Facebook and Twitter.<br/><br/>FRAUD ALERT: Please note that DSV will never request a chat interview or solicit funds from applicants or employees through its interviewing and hiring process. We do not require any form of payment and will not ask for personal financial information, such as credit card or bank account number. Our recruiters have an @dsv.com or @us.dsv.com email address. If you question the legitimacy of any DSV job posting, please reach out to HR@us.dsv.com.", "responsibilities": "Freight Forwarder Air Import is responsible for ensuring the timely and efficient importation of goods by air, including customs clearance and delivery to the final destination. This role involves coordinating with multiple parties, including airlines, customs agents, and trucking companies, and requires strong organizational and communication skills.", "qualifications": {"preferred": "Prior experience in freight forwarding, logistics, or a related field is preferred\nExperience in air imports is highly desirable", "required": "Ability to perform basic mathematical calculations, such as calculating costs and rates\nExcellent organizational and time management skills\nStrong communication and interpersonal skills\nAttention to detail and accuracy\nAbility to work well under pressure and in a fast-paced environment\nKnowledge of air freight logistics and customs regulations\nUnderstanding of trade laws and regulations\nFluency in English is required\nProficiency in Microsoft Office Suite\nExperience with logistics software and systems is preferred"}, "skills": ["Freight Forwarding", "Logistics", "Air Imports", "Customs Clearance", "Communication", "Organizational Skills", "Time Management", "Attention to Detail", "Accuracy", "Pressure Handling", "Fast-Paced Environment", "Air Freight Logistics", "Customs Regulations", "Trade Laws", "English", "Microsoft Office Suite", "Logistics Software"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992773428"}