{"jobTitle": "Coordinator, Marketing", "company": {"name": "Natural History Museum of Los Angeles County", "location": "Los Angeles, CA", "industry": "Museums, Historical Sites, and Zoos"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Museums, Historical Sites, and Zoos", "description": "The Natural History Museum of Los Angeles County (“NHMLAC”) was the first museum in L.A. to open its doors 108 years ago and is poised for an exciting new era as it plans for the future. Having recently completed a new strategic framework, the Natural History Museums of Los Angeles County—including NHM at Exposition Park, La Brea Tar Pits and museum in mid-Wilshire, and the William S. Hart Museum in Newhall—is looking forward to new building projects and campaigns, exhibitions, community outreach, and innovative audience engagement.<br/><br/>The Natural History Museum of Los Angeles County values and endeavors to support diversity, equity, inclusion, and access within its organization and communities. Candidates who identify as Black, Indigenous, or a Person of Color (BIPOC), neurodiverse, a woman, a person with disability, a veteran, and/or a part of the LGBTQAI+ community are welcome and encouraged to apply.<br/><br/>The Coordinator, Marketing provides marketing support for the Natural History Family of Museums, including, but not limited to, assisting or overseeing seasonal projects related to social media, digital content creation, advertising, community outreach, audience-building events, and more. This position reports directly to the Manager, Digital Content Creation but will also provide support to the Associate Manager, Marketing.<br/><br/>Responsibilities for this position include, but are not limited to:<br/><br/><ul><li>Assist Manager, Digital Content Creation, and Associate Marketing Manager with the development of strategic marketing campaigns.</li><li>Assist with the development and curation of social media and digital content, including imagery, videos, and written material across multiple platforms while maintaining brand look and feel.</li><li>Assist in maintaining and growing new and existing social audiences, with a priority focus on short-form video.</li><li>Assist in maintaining a social media calendar and reporting dashboard, delivering regular reports on engagement metrics and other performance indicators.</li><li>Actively monitor social media sites for public discourse and, when asked, engage promptly with comments and direct messages.</li><li>Stay abreast of social media trends, tools, design, and strategies, ensuring the adoption of best practices, while upholding social publishing standards, adapting to emerging trends, and aligning content with each platform's preferences.</li><li>Attend events to capture live content for social media platforms.</li><li>Serve as a project manager on exhibitions and programs, including Butterfly and Spider Pavilions, Bug Fair, Dino Fest, Adventures In Nature, and more, creating work orders and timelines with clear direction.</li><li>Work directly with external media partners on fulfillment of deliverables on various media buys, including print, digital, OOH, and broadcast.</li><li>Build and maintain targeted audience lists for outreach opportunities.<br/><br/></li></ul><strong>This Position Has The Following Requirements<br/><br/></strong><ul><li>Bachelor’s degree in Communications, Marketing or another related field required</li><li>Minimum 3-5 years related experience</li><li>Familiarity and proficiency with all social media platforms</li><li>Strong organizational skills</li><li>Strong interpersonal and communication skills with the ability to effectively communicate information and ideas in written, verbal, and presentation format</li><li>Strong project and event management skills</li><li>Ability to work under pressure to meet deadlines and ensure timely action</li><li>Must be able to handle multiple projects simultaneously and work within a very fast-paced environment with rapidly shifting priorities</li><li>Excellent computer skills. </li><li>Willingness to work as a team member, including supporting events execution, working evenings, holidays, and weekends as needed<br/><br/></li></ul>The NHMLAC is especially interested in candidates whose background and experience have prepared them to contribute to our commitment to engagement and inclusion at culturally diverse audiences in museum and in sciences.<br/><br/>The NHMLAC is seeking applicants who have demonstrated experience and commitment working with a diverse community. This position is $24.90 Hourly with experience plus excellent benefits. This is a full time regular, non-exempt position.<br/><br/>A cover letter, current resume, and list of 3-4 references are required for all applicants. Review of applications begins immediately and continues until position is filled. Interested candidates please visit www.nhmlac.org/careers-our-museums and click the link of the position for which you are interested or go directly to the online application.<br/><br/>The NHMLAC is establishing a COVID-19 vaccination mandate for staff, effective August 10, 2021. NHMLAC is requiring that all staff receive the vaccine for COVID-19 as a condition of employment. Exemptions for documented medical reasons or a sincerely held religious belief may be requested.<br/><br/>The Natural History Museum of Los Angeles County is an Equal Opportunity Employer.", "responsibilities": "The Coordinator, Marketing provides marketing support for the Natural History Family of Museums, including, but not limited to, assisting or overseeing seasonal projects related to social media, digital content creation, advertising, community outreach, audience-building events, and more. This position reports directly to the Manager, Digital Content Creation but will also provide support to the Associate Manager, Marketing.<br/><br/>Responsibilities for this position include, but are not limited to:<br/><br/><ul><li>Assist Manager, Digital Content Creation, and Associate Marketing Manager with the development of strategic marketing campaigns.</li><li>Assist with the development and curation of social media and digital content, including imagery, videos, and written material across multiple platforms while maintaining brand look and feel.</li><li>Assist in maintaining and growing new and existing social audiences, with a priority focus on short-form video.</li><li>Assist in maintaining a social media calendar and reporting dashboard, delivering regular reports on engagement metrics and other performance indicators.</li><li>Actively monitor social media sites for public discourse and, when asked, engage promptly with comments and direct messages.</li><li>Stay abreast of social media trends, tools, design, and strategies, ensuring the adoption of best practices, while upholding social publishing standards, adapting to emerging trends, and aligning content with each platform's preferences.</li><li>Attend events to capture live content for social media platforms.</li><li>Serve as a project manager on exhibitions and programs, including Butterfly and Spider Pavilions, Bug Fair, Dino Fest, Adventures In Nature, and more, creating work orders and timelines with clear direction.</li><li>Work directly with external media partners on fulfillment of deliverables on various media buys, including print, digital, OOH, and broadcast.</li><li>Build and maintain targeted audience lists for outreach opportunities.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Communications, Marketing or another related field required\nMinimum 3-5 years related experience\nFamiliarity and proficiency with all social media platforms\nStrong organizational skills\nStrong interpersonal and communication skills with the ability to effectively communicate information and ideas in written, verbal, and presentation format\nStrong project and event management skills\nAbility to work under pressure to meet deadlines and ensure timely action\nMust be able to handle multiple projects simultaneously and work within a very fast-paced environment with rapidly shifting priorities\nExcellent computer skills. \nWillingness to work as a team member, including supporting events execution, working evenings, holidays, and weekends as needed<br/><br/>", "preferred": ""}, "skills": ["Social Media", "Marketing", "Digital Content Creation", "Advertising", "Community Outreach", "Event Management", "Project Management", "Communication", "Interpersonal Skills", "Organizational Skills", "Computer Skills"], "postedDate": "2 weeks ago", "benefits": "$24.90 Hourly with experience plus excellent benefits.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3992289370"}