{"jobTitle": "Senior Buyer/Planner", "company": {"name": "Bunzl Distribution NA", "location": "Compton, CA"}, "location": "Compton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "John Tillman Company, a division of Bunzl, is seeking a Senior Buyer/Planner for our office in Compton, CA. As a top manufacturer of quality welding gloves and leather protective garments, Tillman is a brand that is well-known in the industry. The Senior Buyer/Planner will be responsible for the purchasing of production materials and MRO materials, as well as planning work orders and other activities to ensure accurate ERP planning messages. This position is responsible for all products and vendors assigned, along with coordinating the transportation of items in a cost-effective and timely manner.<br/><br/>At Bunzl, we know that our employees are our number one asset. We seek to recruit and retain the right people who are passionate about our business, and we provide opportunities for our employees so that they may progress within our company based on their talents, experiences, and their aptitude.<br/><br/><strong><em>Responsibilities:<br/><br/></em></strong><ul><li>Communicate with the Operations team, manufacturers, and suppliers</li><li>Materials demand generation and sourcing low-cost suppliers</li><li>Negotiate prices and terms with manufacturers and suppliers</li><li>Monitor inventory levels/inventory control among two warehouses<br/><br/></li></ul><strong><em>Requirements:<br/><br/></em></strong><ul><li>Bachelor's degree preferred</li><li>Excellent communication skills (verbal and written)</li><li>Previous experience with SAGE preferred.</li><li>5 years or more of experience in purchasing, sourcing, and price negotiation; import/export experience is a plus</li><li>Proficient in business negotiations, sales analysis, trend forecasting, and item management</li><li>Excellent negotiation skills</li><li>ERP systems experience required</li><li>Computer savvy, organized, self-motivated, and works well in a team environment</li><li>Strong Excel skills and planning skills are needed</li><li>Ability to foresee potential problems and work to solve them</li><li>Must be able to multi-task, be detail-oriented, and be a problem solver<br/><br/></li></ul>Tillman salary range: $90k-$115K based on experience, education, and geographic location.<br/><br/>Bunzl is a global leader in the Cleaning &amp; Hygiene, Food Processing, Grocery, Health Care, Non-Food Retail, and Safety industries. We have grown both organically and through acquisitions to sales in excess of $10 billion. Bunzl North America is headquartered in St. Louis, Missouri. Bunzl North America owns and operates more than 100 warehouses and serves all 50 states, Puerto Rico, Canada, and parts of the Caribbean and Mexico. With more than 7,000 employees and 400,000 plus supplies, Bunzl is regarded as a leading supplier in North America.<br/><br/><strong>So, what are you waiting for? A new career awaits you with endless opportunities.<br/><br/></strong>Bunzl is a global leader in the Cleaning &amp; Hygiene, Food Processing, Grocery, Health Care, Non-Food Retail, and Safety industries. We have grown both organically and through acquisitions to sales in excess of $10 billion. Bunzl North America is headquartered in St. Louis, Missouri. Bunzl North America owns and operates more than 100 warehouses and serves all 50 states, Puerto Rico, Canada and parts of the Caribbean and Mexico. With more than 5,000 employees and 400,000 plus supplies, Bunzl is regarded as a leading supplier in North America.<br/><br/><em>Click here to view the California Employee/Applicant Privacy Policy <br/><br/></em><em>Bunzl Distribution offers competitive salaries, a comfortable work environment, and a full range of benefits, including a 401k with a company match.<br/><br/></em><em>Bunzl Distribution has a tradition of commitment to equal employment opportunity. It is the established policy to attract and retain the best qualified people without regard to race, color, religion, national origin, sex/gender (including pregnancy), sexual orientation, age, disability or veteran status as provided by law. <br/><br/></em>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities", "responsibilities": "Communicate with the Operations team, manufacturers, and suppliers\nMaterials demand generation and sourcing low-cost suppliers\nNegotiate prices and terms with manufacturers and suppliers\nMonitor inventory levels/inventory control among two warehouses", "qualifications": {"required": "Bachelor's degree preferred\nExcellent communication skills (verbal and written)\nPrevious experience with SAGE preferred.\n5 years or more of experience in purchasing, sourcing, and price negotiation; import/export experience is a plus\nProficient in business negotiations, sales analysis, trend forecasting, and item management\nExcellent negotiation skills\nERP systems experience required\nComputer savvy, organized, self-motivated, and works well in a team environment\nStrong Excel skills and planning skills are needed\nAbility to foresee potential problems and work to solve them\nMust be able to multi-task, be detail-oriented, and be a problem solver", "preferred": "Bachelor's degree preferred"}, "skills": ["SAGE", "ERP", "Excel", "Negotiation", "Communication", "Purchasing", "Sourcing", "Inventory Control", "Supply Chain Management"], "postedDate": "2 weeks ago", "benefits": "Bunzl Distribution offers competitive salaries, a comfortable work environment, and a full range of benefits, including a 401k with a company match.", "remoteWork": "No", "salary": {"amount": "90,000.00 - 115,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3992348017"}