{"jobTitle": "Procurement Order Management Specialist (Buyer/Supply chain)", "company": {"name": "TCWGlobal", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "38-$48hr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Procurement Order Management Specialist (Buyer/Supply chain)</strong><p><strong>Long Beach, CA 90815 (Onsite- local candidates)</strong></p><p><strong>$38-$48hr Based on relevant industry expereince (Weekly pay + benefits)</strong></p><p><strong>3-6 month contract to turn permanent </strong></p><p><strong>Full-time: M-F 8am-5pm PST (onsite/1 day remote)</strong></p><p><br/></p><p><br/></p><p><br/></p><p>Our client is an American aerospace manufacturing company headquartered in Long Beach, CA. They are developing manufacturing technologies, launch vehicles, and rocket engines for commercial orbital launch services.</p><p><br/></p><p><strong>PROCURMENT SPECIALIST Team: </strong> Being both an internal and external facing function, we closely partner with an extensive number of groups to develop the operational strategies, processes, and tools that are utilized to fulfill end-customer demand for our launch services. As the Procurement Specialist in Indirect Supply Management, you will work closely with our development and manufacturing engineering stakeholders to manage end-to-end procurement activities for our operations at our Long Beach sites.</p><p><br/></p><p><br/></p><p><strong>What you’ll do:</strong></p><p><br/></p><ul><li>Collaborate with internal stakeholders in Engineering, Construction, Facilities, and Manufacturing teams to gather comprehensive procurement requirements and translate into purchase orders.</li><li>Manage end-to-end RFx process in partnership with applicable stakeholders to identify top suppliers for a given need, drive competition within a given supply market, and maximize value creation for the procurement activity.</li><li>Create purchase orders in the ERP system and communicate with approvers to describe and justify purchases.</li><li>Negotiate pricing, lead time, terms and conditions, and more, to holistically drive the best outcome for the business.</li><li>Lead end-to-end purchase order management and invoice issue disposition to ensure on-time delivery of product or services and on-time payment of invoices.</li><li>Resolve any and all supply chain-related issues that arise across the procure to pay process.</li></ul><p><br/></p><p><strong>What you need to know:</strong></p><p><br/></p><ul><li>2+ years of working in a Procurement, Buyer, Order Management, Supply Chain role in manufacturing, supply chain, or engineering function.</li><li>*Must have experience buying products/services for a manufacturing organization (as opposed to the food industry, etc)</li><li>Experience with ERP systems; Oracle, SAP or similar ERP</li><li>Requires experience to support a high volume of Purchase orders a day</li><li>Knowledge of purchase order management and coordinating with AP to ensure invoices get paid on time.</li><li>Experience to receive purchase orders, get quotes and issue purchase orders</li><li>Experience to create purchase orders in the ERP system and communicate with approvers to describe and justify purchase order.</li><li>Must have excellent customer service and provide great support for the company</li><li>Experience to collaborate internal stakeholders in Engineering, Construction, Facilities and Manufacturing teams.</li><li>Experience to gather from stakeholder comprehensive procurement requirements and translate into purchase order.</li><li>Demonstrated success negotiating pricing, lead time, contract terms, etc.</li><li>Previous experience working in a fast-paced environment</li><li>Basic knowledge with Excel and ability to create basic spreadsheets</li><li>Bonus: Industry experience within aerospace or frontier technology industries</li></ul><p><br/></p><p>Please send your resume. Thank you!</p><p></p>", "responsibilities": "Collaborate with internal stakeholders in Engineering, Construction, Facilities, and Manufacturing teams to gather comprehensive procurement requirements and translate into purchase orders. Manage end-to-end RFx process in partnership with applicable stakeholders to identify top suppliers for a given need, drive competition within a given supply market, and maximize value creation for the procurement activity. Create purchase orders in the ERP system and communicate with approvers to describe and justify purchases. Negotiate pricing, lead time, terms and conditions, and more, to holistically drive the best outcome for the business. Lead end-to-end purchase order management and invoice issue disposition to ensure on-time delivery of product or services and on-time payment of invoices. Resolve any and all supply chain-related issues that arise across the procure to pay process.", "qualifications": {"required": "2+ years of working in a Procurement, Buyer, Order Management, Supply Chain role in manufacturing, supply chain, or engineering function. *Must have experience buying products/services for a manufacturing organization (as opposed to the food industry, etc) Experience with ERP systems; Oracle, SAP or similar ERP Requires experience to support a high volume of Purchase orders a day Knowledge of purchase order management and coordinating with AP to ensure invoices get paid on time. Experience to receive purchase orders, get quotes and issue purchase orders Experience to create purchase orders in the ERP system and communicate with approvers to describe and justify purchase order. Must have excellent customer service and provide great support for the company Experience to collaborate internal stakeholders in Engineering, Construction, Facilities and Manufacturing teams. Experience to gather from stakeholder comprehensive procurement requirements and translate into purchase order. Demonstrated success negotiating pricing, lead time, contract terms, etc. Previous experience working in a fast-paced environment Basic knowledge with Excel and ability to create basic spreadsheets Bonus: Industry experience within aerospace or frontier technology industries"}, "skills": ["Procurement", "Buyer", "Order Management", "Supply Chain", "Manufacturing", "Engineering", "ERP", "Oracle", "SAP", "Customer Service", "Excel", "Aerospace", "Frontier Technology"], "postedDate": "3 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992338081"}