{"jobTitle": "Analyst, Sales Operations & Strategy", "company": {"name": "Pandora", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Entertainment Providers and Broadcast Media Production and Distribution", "description": "Who We Are<br/><br/>SiriusXM and its brands (Pandora, SiriusXM Media, AdsWizz, Simplecast, and SiriusXM Connect) are leading a new era of audio entertainment and services by delivering the most compelling subscription and ad-supported audio entertainment experience for listeners -- in the car, at home, and anywhere on the go with connected devices. Our vision is to shape the future of audio, where everyone can be effortlessly connected to the voices, stories and music they love wherever they are.<br/><br/>This is the place where a diverse group of emerging talent and legends alike come to share authentic and purposeful songs, stories, sounds and insights through some of the best programming and technology in the world. Our critically-acclaimed, industry-leading audio entertainment encompasses music, sports, comedy, news, talk, live events, and podcasting. No matter their individual role, each of our employees plays a vital part in bringing SiriusXM’s vision to life every day.<br/><br/>SiriusXM Media is the gateway for marketers to the largest digital audio advertising ecosystem in North America. As the combined advertising revenue organization of Sirius XM Holdings Inc., SiriusXM Media spans across leading owned and operated audio platforms Pandora and SiriusXM; innovative ad tech solutions powered by AdsWizz; sonic creative consultancy Studio Resonate; and an extended content network featuring exclusive monetization agreements with Audiochuck, NBCUniversal, SoundCloud, and many more. Reaching more than 150 million listeners each month, SiriusXM Media delivers audiences the tailored brand experiences they crave while putting creators first, making it easy for every marketer to produce, plan, buy and measure across its entire audio universe.<br/><br/>How You’ll Make An Impact<br/><br/>We are seeking a highly analytical and detail-oriented individual to join our Business Operations team. You will play a pivotal role in partnering with sales executives to drive revenue growth through strategic analysis and actionable insights. This role requires a strategic thinker with exceptional analytical skills and the ability to thrive in a fast-paced, entrepreneurial environment. The preferred location for this position is Chicago, Los Angeles, or New York.<br/><br/>What You’ll Do<br/><br/>\n<ul><li>Provide comprehensive business analysis support to the sales team, including RFP volume and close rate analysis, historical account spending, AE performance metrics, and marketplace research to facilitate informed decision-making.</li><li>Conduct ad hoc analyses to uncover opportunities and identify root causes for fluctuations in revenue, driving actionable recommendations.</li><li>Conduct regular business reviews with key sales stakeholders to identify incremental revenue opportunities.</li><li>Develop and produce recurring advertising reports for sales executives and their teams.</li><li>Support the development of monthly and quarterly revenue forecasts, providing rationale and insights.</li><li>Identify opportunities to enhance reporting formats, processes, and systems.</li><li>Cultivate strong relationships with key stakeholders across departments such as finance, operations, HR, and legal.</li><li>Stay abreast of media, technology, and competitive publisher trends, and digital advertising evolutions.<br/><br/></li></ul>What You’ll Need<br/><br/>\n<ul><li>Bachelor's degree in Business Administration, Finance, Economics, or related field.</li><li>3+ years of experience in business strategy, analytics, planning, or a related role within a media company.</li><li>Strategic thinker with exceptional analytical skills, capable of dissecting complex issues and formulating thoughtful recommendations and action plans.</li><li>Proven ability to persuade, build consensus, and collaborate effectively with all levels of management internally and externally.</li><li>Self-starter with the ability to take initiative, lead projects independently, and thrive in a fast-paced environment.</li><li>Excellent communication and presentation skills, with the ability to articulate complex analyses clearly.</li><li>Strong organizational, time management, and interpersonal skills, with the ability to work both independently and collaboratively.</li><li>Exceptional problem-solving skills and the ability to influence decision-making.</li><li>Passion for media and consumer internet, coupled with a strong intellectual curiosity.</li><li>Proficiency in Microsoft Excel for financial modeling and PowerPoint for presentations.</li><li>Experience working with Salesforce data.</li><li>Strong experience with data visualization tools, preferably Tableau.</li><li>Familiarity with SQL preferred.</li><li>Must have legal right to work in the US<br/><br/></li></ul>At SiriusXM, we carefully consider a wide range of factors when determining compensation, including your background and experience. These considerations can cause your compensation to vary. We expect the base salary for this position to be in the range of $59,000 to $89,750 and will depend on your skills, qualifications, and experience. Additionally, this role might be eligible for discretionary short-term and long-term incentives. We encourage all interested candidates to apply.<br/><br/>Our goal at SiriusXM is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.<br/><br/>The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.<br/><br/>R-2024-07-99", "responsibilities": "<ul><li>Provide comprehensive business analysis support to the sales team, including RFP volume and close rate analysis, historical account spending, AE performance metrics, and marketplace research to facilitate informed decision-making.</li><li>Conduct ad hoc analyses to uncover opportunities and identify root causes for fluctuations in revenue, driving actionable recommendations.</li><li>Conduct regular business reviews with key sales stakeholders to identify incremental revenue opportunities.</li><li>Develop and produce recurring advertising reports for sales executives and their teams.</li><li>Support the development of monthly and quarterly revenue forecasts, providing rationale and insights.</li><li>Identify opportunities to enhance reporting formats, processes, and systems.</li><li>Cultivate strong relationships with key stakeholders across departments such as finance, operations, HR, and legal.</li><li>Stay abreast of media, technology, and competitive publisher trends, and digital advertising evolutions.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Business Administration, Finance, Economics, or related field.\n3+ years of experience in business strategy, analytics, planning, or a related role within a media company.\nStrategic thinker with exceptional analytical skills, capable of dissecting complex issues and formulating thoughtful recommendations and action plans.\nProven ability to persuade, build consensus, and collaborate effectively with all levels of management internally and externally.\nSelf-starter with the ability to take initiative, lead projects independently, and thrive in a fast-paced environment.\nExcellent communication and presentation skills, with the ability to articulate complex analyses clearly.\nStrong organizational, time management, and interpersonal skills, with the ability to work both independently and collaboratively.\nExceptional problem-solving skills and the ability to influence decision-making.\nPassion for media and consumer internet, coupled with a strong intellectual curiosity.\nProficiency in Microsoft Excel for financial modeling and PowerPoint for presentations.\nExperience working with Salesforce data.\nStrong experience with data visualization tools, preferably Tableau.\nFamiliarity with SQL preferred.\nMust have legal right to work in the US<br/><br/>", "preferred": ""}, "skills": ["Business Analysis", "Sales Operations", "Strategic Thinking", "Analytical Skills", "Microsoft Excel", "PowerPoint", "Salesforce", "Tableau", "SQL"], "postedDate": "2 weeks ago", "salary": {"amount": "59,000.00 - 89,750.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3992690779"}