{"jobTitle": "Event Assistant II", "company": {"name": "Caltech", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.50 - 21.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Research Services", "description": "Caltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.<br/><br/><strong>Job Summary<br/><br/></strong>The Keck Institute for Space Studies (KISS) develops new planetary, Earth, and astrophysics space mission concepts and technology by bringing together a broad spectrum of scientists and engineers for sustained scientific and technical interaction. The Institute also provides opportunities for graduate students and postdoctoral fellows to actively participate in cutting-edge space mission research and learning. The Institute supports significant outreach to the public and the wider technical/scientific community via open lectures and the Internet.<br/><br/>Under the direction of the KISS Program Manager, assists with workshops and events. This is an occasional position; work hours may vary. The work schedule is assigned based on the workshop/event schedule. Must be available to work between the hours of 3:00 p.m. – 9:00 p.m.<br/><br/><strong>Essential Job Duties<br/><br/></strong><ul><li>Supports workshops/events, including, but not limited to, putting up directional metal signs, moving tables, pushing and rolling carts with event supplies, putting up banners, checking in attendees at events, and setting up and cleaning after events.</li><li>Other duties as assigned.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Previous experience in a service industry (food, retail, event customer service, etc.).</li><li>Excellent organizational skills with the ability to multi-task and work with a broad variety of individuals.</li><li>Strong verbal communication and interpersonal skills.</li><li>Must present an attitude of attentiveness, courtesy, and professionalism when dealing with workshop/event guests and other staff members.</li><li>Positive attitude and customer focus is essential.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Physical strength to lift up to 35 pounds.</li><li>Ability to bend in all directions, squeeze with arms and hands, climb stairs, and work outdoors in all kinds of weather.</li><li>Ability to push and pull rolling items (e.g., carts).<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>General office skills a plus.</li><li>Multilingual applicants are a plus in this internationally renowned Think Tank.<br/><br/></li></ul><strong>Required Documents<br/><br/></strong><ul><li>Resume<br/><br/></li></ul><strong> Hiring Range <br/><br/></strong>$18.50 - $21.00 per hour<br/><br/>The salary of the finalist(s) selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training.<br/><br/>As one of the largest employers in Pasadena, CA, Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time. Learn more about our<br/><br/><strong> EEO Statement <br/><br/></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, or national origin, disability status, protected veteran status, or any other characteristic protected by law.<br/><br/>Caltech is a VEVRAA Federal Contractor.<br/><br/>To read more Equal Employment Opportunity (EEO) go to eeoc_self_print_poster.pdf.<br/><br/><strong> Disability Accommodations <br/><br/></strong>If you would like to request an accommodation in completing this application, interviewing, or otherwise participating in the employee selection process, please direct your inquiries to Caltech Recruiting at", "responsibilities": "Supports workshops/events, including, but not limited to, putting up directional metal signs, moving tables, pushing and rolling carts with event supplies, putting up banners, checking in attendees at events, and setting up and cleaning after events.", "qualifications": {"required": "Previous experience in a service industry (food, retail, event customer service, etc.).\nExcellent organizational skills with the ability to multi-task and work with a broad variety of individuals.\nStrong verbal communication and interpersonal skills.\nMust present an attitude of attentiveness, courtesy, and professionalism when dealing with workshop/event guests and other staff members.\nPositive attitude and customer focus is essential.", "preferred": "General office skills a plus.\nMultilingual applicants are a plus in this internationally renowned Think Tank."}, "skills": ["Customer Service", "Communication", "Event Management", "Organization"], "postedDate": "2 weeks ago", "benefits": "As one of the largest employers in Pasadena, CA, Caltech is committed to providing comprehensive benefits to eligible employees and their eligible dependents. Our benefits package includes competitive compensation, health, dental, and vision insurance, retirement savings plans, generous paid time off (vacation, holidays, sick time, parental leave, bereavement, etc.), tuition reimbursement, and more. Non-benefit eligible employees will have access to some benefits such as onsite counseling and sick time. Learn more about our", "url": "https://www.linkedin.com/jobs/view/3992907547"}