{"jobTitle": "Senior Associate, DashMart - Logistics Strategy & Operations", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "About The Team\n\nDoorDash’s New Verticals organization focuses on accelerating one of our strategic pillars ⁠— DashMart, our grocery and convenience delivery offering. We’re building and scaling new ways to delight our customers, leveraging the DoorDash platform. You will focus on owning initiatives that may span across Dasher pay, batching, speed, quality, and more!\n\nAbout The Role\n\nAs a Senior Associate on the DashMart S&O team, you will dive deep into the data in order to own the ideation and execution of key strategic Dasher and quality initiatives at DashMart. You will partner closely with cross-functional teams, including product, engineering, finance, and local operations to bring initiatives to life, analyze their performance, and then iterate accordingly. You will report into a Senior Manager on our DashMart Strategy & Operations team, within our New Verticals organization. This is an individual contributor position.\n\nYou’re Excited About This Opportunity Because You Will…\n\n<ul><li>Analyze. Utilize your knowledge of data to analyze trends and get to the lowest level of detail to glean insights for your initiatives</li><li>Strategize. From first principles problem solving, you will set the strategic vision for your initiatives </li><li>Experiment. Use a data-driven approach and deep understanding of our business to identify improvement opportunities, run tests and make our business 1% better everyday</li><li>Collaborate. You will work cross-functionally to bring your initiatives to life, maintaining a close partnership with our product, eng, finance, and local operations teams<br/><br/></li></ul>We’re Excited About You Because…\n\n<ul><li>You’re an analytical yet strategic thinker. You are comfortable manipulating and analyzing data to make strategic decisions. You have experience with SQL and Microsoft Excel</li><li>You’re an operator. You are able to manage multiple concurrent projects through ideation to execution. You operate at the lowest level of detail and are able to root cause problems before proposing solutions.</li><li>You have a strong attention to detail. You have the ability to adapt to a fast-paced environment, and the tenacity to solve many disparate problems for multiple stakeholders at once. </li><li>You have 2-4 years experience in operations, technology, consulting, business development, banking, analytics, marketing, high-growth or early-stage startup or related experience. </li><li>You have a completed Bachelor’s Degree. <br/><br/></li></ul>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.\n\nPlease see the independent bias audit report covering our use of Covey here.\n\nCompensation\n\nThe successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Base salary is localized according to an employee’s work location. Ranges are market-dependent and may be modified in the future.\n\nIn addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.\n\nDoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.\n\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.\n\nTo learn more about our benefits, visit our careers page here.\n\nThe base pay for this position ranges from our lowest geographical market up to our highest geographical market within California, Colorado, District of Columbia, Hawaii, New Jersey, New York and Washington.\n\n$79,900—$117,500 USD\n\nAbout DoorDash\n\nAt DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.\n\nDoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.\n\nOur Commitment to Diversity and Inclusion\n\nWe’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.\n\nStatement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.\n\nPursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.\n\nIf you need any accommodations, please inform your recruiting contact upon initial connection.", "responsibilities": "As a Senior Associate on the DashMart S&O team, you will dive deep into the data in order to own the ideation and execution of key strategic Dasher and quality initiatives at DashMart. You will partner closely with cross-functional teams, including product, engineering, finance, and local operations to bring initiatives to life, analyze their performance, and then iterate accordingly. You will report into a Senior Manager on our DashMart Strategy & Operations team, within our New Verticals organization. This is an individual contributor position.", "qualifications": {"required": "You’re an analytical yet strategic thinker. You are comfortable manipulating and analyzing data to make strategic decisions. You have experience with SQL and Microsoft Excel\nYou’re an operator. You are able to manage multiple concurrent projects through ideation to execution. You operate at the lowest level of detail and are able to root cause problems before proposing solutions.\nYou have a strong attention to detail. You have the ability to adapt to a fast-paced environment, and the tenacity to solve many disparate problems for multiple stakeholders at once. \nYou have 2-4 years experience in operations, technology, consulting, business development, banking, analytics, marketing, high-growth or early-stage startup or related experience. \nYou have a completed Bachelor’s Degree.", "preferred": null}, "skills": ["SQL", "Microsoft Excel"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "DoorDash cares about you and your overall well-being. That’s why we offer a comprehensive benefits package for all regular employees that includes a 401(k) plan with an employer match, paid time off, paid parental leave, wellness benefits, and several paid holidays.\n\nAdditionally, for full-time employees, DoorDash offers medical, dental, and vision benefits, disability and basic life insurance, family-forming assistance, a commuter benefit match, and a mental health program, among others.", "remoteWork": null, "salary": {"amount": "79,900—$117,500", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3992794514"}