{"jobTitle": "Digital Asset Specialist", "company": {"name": "Jason Markk", "location": "Norwalk, CA"}, "location": "Norwalk, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Manufacturing", "description": "Seeing that there weren’t cleaning and care products designed specifically for sneakers, Jason Markk filled that space by introducing Jason Markk Premium Shoe Cleaner. No longer would sneakerheads need to use household cleaning products and other solutions containing harsh chemicals to clean their precious kicks. Building the foundation of the brand with a grassroots approach, enthusiasts, collectors, and publications quickly recognized Jason Markk as the best product on the market. The company’s goal is to fulfill the needs and wants of today’s sneaker consumers by continuing to be innovative and creative. Its mission is to promote a culture of care by way of quality products and experience in shoe care and wearables (hats, bags, etc.).\n\nJason Markk is growing rapidly, driven by the strength of its brand, the quality of its products, and the continued consumer enthusiasm for sneakers. Jason Markk is building out its team of talented and dedicated individuals to continue growing the brand through DTC, wholesale, and retail.\n\n<br/>\n\n**JOB SUMMARY:**\n\nThe Digital Asset Specialist is a key contributor to Jason Markk’s digital initiatives through a variety of activities, including content development for web and multi-channel digital campaigns. This role will be responsible for the formatting, publishing, and cataloging of content across multiple websites and marketing platforms, in addition to maintaining the content library for uses across B2C, B2B, and retail marketing. This role requires active collaboration with our E-commerce, Digital Marketing, Brand, and Wholesale Sales teams to ensure deadlines, accuracy, and requirements are met for each campaign need. The ideal candidate must be able to demonstrate strong project management skills and creative ideation capabilities to yield the highest impact and performance.\n\n<br/>\n\n**ESSENTIAL FUNCTIONS OF THE JOB/DUTIES:**\n\n* Assist in defining and outlining the deliverables for each initiative, providing detailed briefs including deadlines to the Brand team ensuring timely and accurate delivery.\n* Format and optimize approved creative assets including but not limited to photos, video, documents, and other media for distribution across multiple channels. Create a systematic approach to efficiently storing, organizing, managing, and distributing Jason Markk’s media.\n* Create compelling visual layouts for a variety of campaign types and publish them to our various storefronts and marketing channels.\n* Review existing web content and make updates/edits as needed to ensure it meets our internal digital standards and performance KPI goals.\n* Coordinate website updates to support campaigns and initiatives. Build out scheduled content across landing pages to coincide with product and marketing launches.\n* Participate in content ideation, development, production, and/or coordination process to determine the necessary deliverables for each initiative.\n* Provide ad hoc reporting and analysis on content performance\n* Establish and implement procedures and workflows for content life cycle\n* Other duties as assigned\n\n<br/>\n\n**QUALIFICATIONS:**\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.\n\n* Strong analytical and problem-solving skills\n* Excellent verbal and written communication skills\n* Self-starter, team player, and professional demeanor\n* Goal-oriented and goal-driven\n* Good attitude and people skills are a must\n* Good technical skills including MS Office, performance marketing tools, social platforms, etc\n* Able to keep a calm posture when dealing with difficult situations\n\n<br/>\n\n**Skills/Abilities:**\n\n* Expertise in Digital Assests\n* Proficient in Adobe Illustrator and Photoshop with a proven design sensibility\n* Working knowledge of Shopify’s CMS and theme builder\n* Experience supporting digital marketing channels – email, paid social, display, affiliate\n* Experience with Google Suite to manage, evaluate, and report data", "responsibilities": "The Digital Asset Specialist is a key contributor to Jason Markk’s digital initiatives through a variety of activities, including content development for web and multi-channel digital campaigns. This role will be responsible for the formatting, publishing, and cataloging of content across multiple websites and marketing platforms, in addition to maintaining the content library for uses across B2C, B2B, and retail marketing. This role requires active collaboration with our E-commerce, Digital Marketing, Brand, and Wholesale Sales teams to ensure deadlines, accuracy, and requirements are met for each campaign need. The ideal candidate must be able to demonstrate strong project management skills and creative ideation capabilities to yield the highest impact and performance.", "qualifications": {"required": "Strong analytical and problem-solving skills, Excellent verbal and written communication skills, Self-starter, team player, and professional demeanor, Goal-oriented and goal-driven, Good attitude and people skills are a must, Good technical skills including MS Office, performance marketing tools, social platforms, etc, Able to keep a calm posture when dealing with difficult situations", "preferred": "Expertise in Digital Assests, Proficient in Adobe Illustrator and Photoshop with a proven design sensibility, Working knowledge of Shopify’s CMS and theme builder, Experience supporting digital marketing channels – email, paid social, display, affiliate, Experience with Google Suite to manage, evaluate, and report data"}, "skills": ["Digital Assests", "Adobe Illustrator", "Photoshop", "Shopify", "Google Suite"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992372888"}