{"jobTitle": "Executive Assistant", "company": {"name": "Solomon Page", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Entertainment Providers, Executive Offices, and Administrative and Support Services", "description": "Our client, a well-known entertainment company with an office in Santa Monica, is looking for an Executive Assistant to support three VPs for a 17 month contract! Please note, this role will work a hybrid schedule with Monday through Thursday onsite and Friday remote.", "responsibilities": "Independently manages day-to-day activities in support of executive leadership\nDemonstrates a high level of professionalism and positive service attitude at all times, strong attention to detail and excellent organizational skills\nSchedules appointments, meetings and locations within plan and schedule without consultation; arranges programs or events; plans and schedules work for office support; may participate in meetings as a representative of department, researches and prepares materials\nCoordinates executives’ calendars, including registration & travel\nCoordinates a wide variety of large or complex events and meetings, which may include involving multiple parties, international travel, technology and/or refreshments.\nFields, screens, redirects and responds to a wide variety of inquiries; advises on office policies and procedures; contacts individuals inside and outside of division on highly confidential matters\nComposes difficult/sensitive correspondence requiring high degree of initiative, judgment, originality, and knowledge\nCollects and processes data associated with visa applications\nMaintains office equipment and inventory.\nProvides program or project support; prepares materials and assists in managing timelines and tasks; manages program or project calendars\nPrepares program or project timelines and tasks; may be responsible for managing small projects in scope and impact\nCreates and distributes accurately generated reports, proposals, presentations, or other relevant materials\nCreates, compiles, prepares and maintains standard spreadsheets, databases, or reports", "qualifications": {"required": "Bachelor's degree in a related field\nMinimum of 3 years of relevant experience required\nKnowledge of Microsoft Office applications (Outlook, Word, PowerPoint, Excel)\nKnowledge of administrative functions and processes\nStrong verbal and written communication skills with an ability to communicate at all levels within the organization\nProven ability to work with confidential information, while exercising sound judgment and decision-making\nDemonstrated ability to prioritize, meet deadlines, make decisions and change course of action quickly", "preferred": ""}, "skills": ["Microsoft Office", "Administrative", "Communication", "Organization", "Prioritization", "Decision Making"], "postedDate": "2 weeks ago", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3992330707"}