{"jobTitle": "Partnerships Manager", "company": {"name": "Cloud9 Esports, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "70,000.00 - 75,000.00", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Who We Are<br/><br/>Founded in 2013, Cloud9 has grown to become one of the most recognizable esports organizations in the world. With championships industry-wide, unmatched viewership hours, and extensive benefits packages for players and staff, Cloud9 prides itself on being the best in all categories. Currently, Cloud9 fields multiple professional teams spanning across several game titles.<br/><br/>To find more information about Cloud9, visit https://www.cloud9.gg.<br/><br/>What We're Looking For:<br/><br/>Cloud9 is looking for a charismatic Partnerships Manager to handle Partnership accounts and provide exceptional customer service. Our ideal candidate will have partnership experience with a proven track record on retaining and renewing partners while efficiently communicating with both internal and external groups.<br/><br/>To ensure completion of deliverables for each account/partner, you will need to have excellent attention to detail, perform well under pressure, and be able to pivot quickly, while critically thinking of creative solutions when complex issues arise.<br/><br/>This role will report to the Senior Partnerships Manager and work closely with the Cloud9 Marketing, Social, Sales, Team Operations, and Executive teams.<br/><br/>What You'll Do:<br/><br/>\n<ul><li>Operate as the lead point of contact for any and all matters specific to your accounts</li><li>Oversee the management, execution, and reporting of all contracted partner deliverables</li><li>Manage account logistics and scheduling. </li><li>Manage asset tracking worksheet to ensure all partner deliverables are being fulfilled accurately and in a timely fashion</li><li>Manage onboarding and development processes for external stakeholders and internal stakeholders, including meetings along the way with internal departments. </li><li>Follow up on outstanding items across assigned accounts. </li><li>Assist with the development of partnership programs, including strategy, creative ideation, and graphics</li><li>Deliver well-devised, polished client presentations that help sell-in partnership concepts ensuring that brand strategy and objectives are being met. </li><li>Assist with the development and creation of partnership marketing presentations including research, data gathering, concept ideation, and deck building</li><li>Collaborate with the Sales team to establish, track, and exceed revenue goals. </li><li>High collaboration with the marketing, social, team ops, and upper management</li><li>Spearhead esports/gaming and sponsorship research/trend reports. </li><li>Assist in client prospecting and lead generation</li><li>Oversee the budget per account for partnership fulfillment</li><li>Other duties as assigned. <br/><br/><br/></li></ul>Requirements<br/><br/>\n<ul><li>Bachelor's degree</li><li>At least 2 years of demonstrated experience in partnerships, sales, account management, and/or business development</li><li>Primary manager on at least 1 or more major accounts with $1,000,000 in revenue</li><li>Must be local to LA or willing to relocate to LA</li><li>Must have a valid passport and be able to occasionally travel for work</li><li>Excellent customer service skills</li><li>Excellent attention to detail</li><li>Capability of adjusting behavior and actions quickly according to what the situation requires</li><li>Possession of active listening skills with an emphasis on understanding. </li><li>An adherence to not only what is legal but also what is right, especially when no one is looking. </li><li>Applying intelligence to practical, real-world scenarios, where a \"book solution\" doesn't necessarily exist<br/><br/><br/></li></ul>Benefits<br/><br/>\n<ul><li>We offer a comprehensive compensation and benefits package where you'll be rewarded based on your performance and recognized for the value you bring to the business</li><li>Our benefits include medical, dental, vision, HSA, and a matching 401K</li><li>We believe in work/life balance and hence we offer a generous paid time off policy, which includes sick time, vacation time, and parental leave</li><li>Fast-paced environment within a rapidly growing company</li><li>Access to industry-leading esports resources and community</li><li>Part of a winning team with a growth mindset</li><li>The wage range for this role incorporates the multiple factors that are considered in making compensation decisions including but not limited to skill sets, experience and training, licensure and certifications, and other business and organizational needs. A reasonable estimate of the current range is $70,000 - $75,000</li><li>You may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance<br/><br/><br/></li></ul>Equal Employment Opportunity<br/><br/>Cloud9 Esports is an equal opportunity employer. We provide equal employment opportunity to individuals who are qualified to perform job requirements regardless of their race, color, national origin, ancestry, sex, pregnancy, childbirth, sexual orientation, gender identity or expression, transgender status, age, religious creed, physical or mental disability, medical condition, marital or domestic partnership status, veteran or military status, or any other characteristic or status protected by federal, state or local laws. Cloud9 is committed to providing reasonable accommodation for candidates with disabilities in our recruiting process. If you need any assistance or accommodation due to a disability, please let us know at recruiting@cloud9.gg<br/><br/>Background Checks<br/><br/>Cloud9 will consider qualified candidates with criminal histories in a manner consistent with the law.<br/><br/>Security Disclaimer<br/><br/>Please note that Cloud9 Esports takes the security and privacy of our employees and job applicants very seriously. We would like to remind you to be cautious and vigilant when receiving unsolicited emails or phone calls claiming to be from our company. Our only and official email address domain is @cloud9.gg and anything other than that is fraud.<br/><br/>If you receive any such requests for sensitive information or are unsure about the authenticity of a communication, please do not provide any personal information and contact us immediately.<br/><br/>Cloud9 Esports will not be responsible for any losses or damages resulting from fraudulent attempts by third parties.", "responsibilities": "Operate as the lead point of contact for any and all matters specific to your accounts\nOversee the management, execution, and reporting of all contracted partner deliverables\nManage account logistics and scheduling. \nManage asset tracking worksheet to ensure all partner deliverables are being fulfilled accurately and in a timely fashion\nManage onboarding and development processes for external stakeholders and internal stakeholders, including meetings along the way with internal departments. \nFollow up on outstanding items across assigned accounts. \nAssist with the development of partnership programs, including strategy, creative ideation, and graphics\nDeliver well-devised, polished client presentations that help sell-in partnership concepts ensuring that brand strategy and objectives are being met. \nAssist with the development and creation of partnership marketing presentations including research, data gathering, concept ideation, and deck building\nCollaborate with the Sales team to establish, track, and exceed revenue goals. \nHigh collaboration with the marketing, social, team ops, and upper management\nSpearhead esports/gaming and sponsorship research/trend reports. \nAssist in client prospecting and lead generation\nOversee the budget per account for partnership fulfillment\nOther duties as assigned.", "qualifications": {"required": "Bachelor's degree\nAt least 2 years of demonstrated experience in partnerships, sales, account management, and/or business development\nPrimary manager on at least 1 or more major accounts with $1,000,000 in revenue\nMust be local to LA or willing to relocate to LA\nMust have a valid passport and be able to occasionally travel for work\nExcellent customer service skills\nExcellent attention to detail\nCapability of adjusting behavior and actions quickly according to what the situation requires\nPossession of active listening skills with an emphasis on understanding. \nAn adherence to not only what is legal but also what is right, especially when no one is looking. \nApplying intelligence to practical, real-world scenarios, where a \"book solution\" doesn't necessarily exist", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "We offer a comprehensive compensation and benefits package where you'll be rewarded based on your performance and recognized for the value you bring to the business\nOur benefits include medical, dental, vision, HSA, and a matching 401K\nWe believe in work/life balance and hence we offer a generous paid time off policy, which includes sick time, vacation time, and parental leave\nFast-paced environment within a rapidly growing company\nAccess to industry-leading esports resources and community\nPart of a winning team with a growth mindset\nThe wage range for this role incorporates the multiple factors that are considered in making compensation decisions including but not limited to skill sets, experience and training, licensure and certifications, and other business and organizational needs. A reasonable estimate of the current range is $70,000 - $75,000\nYou may also be eligible to participate in a discretionary annual incentive program, subject to the rules governing the program, whereby an award, if any, depends on various factors, including, without limitation, individual and organizational performance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992937223"}