{"jobTitle": "University Planner", "company": {"name": "The California State University", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Higher Education", "description": "Chancellor's Office Statement<br/><br/>Join our team at the California State University, Office of the Chancellor, and make a difference in providing access to higher education. We are currently seeking experienced candidates for the position of University Planner. The CSU Chancellor's Office, located on the waterfront adjacent to the Aquarium of the Pacific in downtown Long Beach, is the headquarters for the nation's largest and most diverse system of higher education. The CSU Chancellor's Office offers a premium benefit package that includes outstanding vacation, health, and dental plans; a fee waiver education program; membership in the California Public Employees Retirement System (PERS); and 15 paid holidays a year.<br/><br/>Salary<br/><br/>The anticipated salary hiring range is up to $9,584 per month, commensurate with qualifications and experience.<br/><br/>The salary range for this classification is $4,812 to $15,449 per month.<br/><br/>Classification<br/><br/>Administrator II<br/><br/>Position Information<br/><br/>The California State University, Office of the Chancellor, is seeking a University Planner to be responsible for providing ongoing support to their assigned campuses for the planning, development and management of the built environment. They have responsibility for overseeing their assigned campuses and interfacing with campus staff on all project planning activities including review of project programs, budgets and schedules, for the purpose of developing the CSU Five-Year Plan. The position reviews, updates and implements Board of Trustees’ policy in developing the campus physical master plan and communicates with campus staff on all physical planning activities from project conception to construction implementation and maintenance for all programs. Technical responsibilities supporting CPDC and the Facilities Planning Unit are included in this position.<br/><br/>This position is approved for telecommuting (two days telecommuting, three days in office (in-person)) with onsite work at the main headquarters located in Long Beach, California.<br/><br/>Responsibilities<br/><br/>Under the general direction of the Principal University Planner, the University Planner will perform duties as outlined below:<br/><br/><ul><li>Assists the Chief of Planning and Design in developing the systemwide priority list for the Five-Year Capital Plan. Reviews and recommends for approval projects proposed for the Five-Year Capital Plan by campuses, reviews and establishes budgets and schedules for capital outlay projects, and reviews and recommends changes to the campus Five-Year Capital Plan. Reviews campus performance and cashflow status for capital projects. Reviews facility condition reports generated for both academic and self-support funded campus facilities to determine critical deferred maintenance; assists campuses in the identification and prioritization of deferred maintenance and capital and infrastructure improvement projects. Reviews and recommends for funding approval campus requests for deferred maintenance, capital and infrastructure improvements, public-private partnership, and other capital outlay projects. Assists campuses in the use of grants and other initiatives to improve conservation and sustainability and reduce water consumption and greenhouse gas production in capital projects.</li><li>Coordinates capital outlay planning with appropriate departments in the CO division of Academic and Student Affairs and the Financing and Treasury and systemwide Budget departments and assists in the completion of due diligence for systemwide bond financing under CSU finance authority.</li><li>Reviews and edits Capital Outlay Budget Change Proposals for project justification, scope of project, and building costs to ensure that the programs are consistent with established policies and priorities and the requirements of other control and review agencies. Partners with Real Estate Services to review and evaluate campus proposed public-private partnerships to determine conformance with CPDC review procedures. Maintains a regular schedule of campus visits to understand campus needs in support of mutually developed solutions for capital program and master plan development. Reviews academic program changes with Academic and Student Affairs. Provides support to the campus to justify projects during review by the Legislative Analyst's Office and the Department of Finance.</li><li>With minimal supervision, reviews and provides comment on schematic, preliminary, and working drawings of major capital outlay projects for conformance with approved scope and budget. Conducts project review meetings with campus and CPDC staff. Prepares and/or reviews agenda items and finalizes schematic information to be presented to the Board of Trustees. Develops project material required for approval by the Department of Finance. Develops justifications in support of requests for project augmentations or scope changes.</li><li>Reviews campus physical master plans proposed by the campus, including changes in academic and enrollment plans and participates on campus planning committees as appropriate to assist with major master plan revisions; reviews all major/minor master plan changes requested by the campus and works with campus and CPDC staff to determine if appropriate environmental impact report procedures have been followed. Prepares agenda material for Board of Trustees approval as required. Monitors and prepares appropriate reports of minor master plan changes.</li><li>Reviews and recommends for approval space changes proposed by campuses for the Space and Facilities Database to ensure that changes in use of space are consistent with space utilization guidelines and in compliance with the intent of the Academic Master Plan and campus physical Master Plan. Performs analyses of campus capacities, space utilization, course section reports and other prepared documents as required for capital program prioritization.</li><li>Develops process improvements to streamline the capital planning, budgeting, design, and construction document submittal process for the capital outlay program, specifically as related to adaptations to changes in the capital financing and reporting requirements and construction delivery methods.</li><li>Participates in systemwide advisory committees, training workshops and conferences on the planning, design, construction, and maintenance of CSU capital projects. Analyzes capital programs and procedures, performs detailed studies, prepares reports, and makes recommendations to the Chief of Planning and Design and the Assistant Vice Chancellor.<br/><br/></li></ul>Qualifications<br/><br/>This position requires:<br/><br/><ul><li>Bachelor's degree in architecture, engineering, urban planning, business administration, or related field or equivalent combination of education and experience.</li><li>Two years’ experience as a Planner demonstrating the application of the methods, practices and procedures of facilities and space planning, capital project design, fiscal management, budgetary preparation, scheduling and control techniques.</li><li>Excellent communication skills, verbal and written.</li><li>Excellent time management skills.</li><li>Ability to analyze and evaluate capital outlay requests for academic renewal and enhancements, utilities infrastructure and physical plant capacity, including review of construction cost estimates and schedules.</li><li>Ability to relate facility condition reports to long- and short-term needs, particularly as related to utility infrastructure, deferred maintenance and support requirements.</li><li>Excellent skills in developing and maintaining effective and collegial working relationships.</li><li>Experience supervising technical and administrative staff.</li><li>Current computer knowledge and skills with the Microsoft Office Suite.</li><li>Ability to manage multiple priorities and meet established deadlines.<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>CSU planning experience.</li><li>Advanced degree preferred in a related field.<br/><br/></li></ul>Application Period<br/><br/>Priority consideration will be given to candidates who apply by August 19, 2024. Applications will be accepted until the job posting is removed.<br/><br/>How To Apply<br/><br/>Please click \"Apply Now\" to complete the California State University, Chancellor's Office online employment application.<br/><br/>Equal Employment Opportunity<br/><br/>The university is an Equal Opportunity Employer and does not discriminate against persons on the basis of race, religion, color, ancestry, age, disability, genetic information, gender, gender identity, gender expression, marital status, medical condition, National origin, sex, sexual orientation, covered veteran status, or any other protected status. Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting the Senior Human Resources Manager at (562) 951-4070.<br/><br/>Title IX<br/><br/>Please view the Notice of Non-Discrimination on the Basis of Gender or Sex and Contact Information for Title IX Coordinator at: https://www2.calstate.edu/titleix<br/><br/>E-Verify<br/><br/>This position requires new hire employment verification to be processed through the E-Verify program administered by the Department of Homeland Security, U.S. Citizenship and Immigration Services (DHSUSCIS)' in partnership with the Social Security Administration (SSA).<br/><br/>If hired, you will be required to furnish proof that you are legally authorized to work in the United States. The CSU Chancellor’s Office is not a sponsoring agency for staff and Management positions (i.e., H1-B VISAS).<br/><br/>COVID19 Vaccination Policy<br/><br/>Per the CSU COVID-19 Vaccination Policy , it is strongly recommended that all Chancellor’s Office employees who are accessing office and campus facilities follow COVID-19 vaccine recommendations adopted by the U.S. Centers for Disease Control and Prevention (CDC) and the California Department of Public Health (CDPH) applicable to their age, medical condition, and other relevant indications.<br/><br/>Mandated Reporter Per CANRA<br/><br/>The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.<br/><br/>Conflict of Interest<br/><br/>The duties of this position will include participation in decisions that may have a material financial benefit to the incumbent. Therefore, the selected candidate will be required to file Conflict of Interest Form 700: Statement of Economic Interest when they first occupy the position, and on an annual basis, complete ethics training within 6 months of appointment, and attend this training every other year thereafter.<br/><br/>CSU Out of State Employment Policy <br/><br/>California State University, Office of the Chancellor, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022, the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/>Background<br/><br/>The Chancellor's Office policy requires that the selected candidate successfully complete a full background check (including a criminal records check) prior to assuming this position.", "responsibilities": "Under the general direction of the Principal University Planner, the University Planner will perform duties as outlined below:<br/><br/><ul><li>Assists the Chief of Planning and Design in developing the systemwide priority list for the Five-Year Capital Plan. Reviews and recommends for approval projects proposed for the Five-Year Capital Plan by campuses, reviews and establishes budgets and schedules for capital outlay projects, and reviews and recommends changes to the campus Five-Year Capital Plan. Reviews campus performance and cashflow status for capital projects. Reviews facility condition reports generated for both academic and self-support funded campus facilities to determine critical deferred maintenance; assists campuses in the identification and prioritization of deferred maintenance and capital and infrastructure improvement projects. Reviews and recommends for funding approval campus requests for deferred maintenance, capital and infrastructure improvements, public-private partnership, and other capital outlay projects. Assists campuses in the use of grants and other initiatives to improve conservation and sustainability and reduce water consumption and greenhouse gas production in capital projects.</li><li>Coordinates capital outlay planning with appropriate departments in the CO division of Academic and Student Affairs and the Financing and Treasury and systemwide Budget departments and assists in the completion of due diligence for systemwide bond financing under CSU finance authority.</li><li>Reviews and edits Capital Outlay Budget Change Proposals for project justification, scope of project, and building costs to ensure that the programs are consistent with established policies and priorities and the requirements of other control and review agencies. Partners with Real Estate Services to review and evaluate campus proposed public-private partnerships to determine conformance with CPDC review procedures. Maintains a regular schedule of campus visits to understand campus needs in support of mutually developed solutions for capital program and master plan development. Reviews academic program changes with Academic and Student Affairs. Provides support to the campus to justify projects during review by the Legislative Analyst's Office and the Department of Finance.</li><li>With minimal supervision, reviews and provides comment on schematic, preliminary, and working drawings of major capital outlay projects for conformance with approved scope and budget. Conducts project review meetings with campus and CPDC staff. Prepares and/or reviews agenda items and finalizes schematic information to be presented to the Board of Trustees. Develops project material required for approval by the Department of Finance. Develops justifications in support of requests for project augmentations or scope changes.</li><li>Reviews campus physical master plans proposed by the campus, including changes in academic and enrollment plans and participates on campus planning committees as appropriate to assist with major master plan revisions; reviews all major/minor master plan changes requested by the campus and works with campus and CPDC staff to determine if appropriate environmental impact report procedures have been followed. Prepares agenda material for Board of Trustees approval as required. Monitors and prepares appropriate reports of minor master plan changes.</li><li>Reviews and recommends for approval space changes proposed by campuses for the Space and Facilities Database to ensure that changes in use of space are consistent with space utilization guidelines and in compliance with the intent of the Academic Master Plan and campus physical Master Plan. Performs analyses of campus capacities, space utilization, course section reports and other prepared documents as required for capital program prioritization.</li><li>Develops process improvements to streamline the capital planning, budgeting, design, and construction document submittal process for the capital outlay program, specifically as related to adaptations to changes in the capital financing and reporting requirements and construction delivery methods.</li><li>Participates in systemwide advisory committees, training workshops and conferences on the planning, design, construction, and maintenance of CSU capital projects. Analyzes capital programs and procedures, performs detailed studies, prepares reports, and makes recommendations to the Chief of Planning and Design and the Assistant Vice Chancellor.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in architecture, engineering, urban planning, business administration, or related field or equivalent combination of education and experience.<br/>Two years’ experience as a Planner demonstrating the application of the methods, practices and procedures of facilities and space planning, capital project design, fiscal management, budgetary preparation, scheduling and control techniques.<br/>Excellent communication skills, verbal and written.<br/>Excellent time management skills.<br/>Ability to analyze and evaluate capital outlay requests for academic renewal and enhancements, utilities infrastructure and physical plant capacity, including review of construction cost estimates and schedules.<br/>Ability to relate facility condition reports to long- and short-term needs, particularly as related to utility infrastructure, deferred maintenance and support requirements.<br/>Excellent skills in developing and maintaining effective and collegial working relationships.<br/>Experience supervising technical and administrative staff.<br/>Current computer knowledge and skills with the Microsoft Office Suite.<br/>Ability to manage multiple priorities and meet established deadlines.<br/><br/>", "preferred": "CSU planning experience.<br/>Advanced degree preferred in a related field.<br/><br/>"}, "skills": ["Planning", "Capital Project Design", "Fiscal Management", "Budgetary Preparation", "Scheduling", "Communication", "Time Management", "Analysis", "Evaluation", "Relationship Building", "Supervision", "Microsoft Office Suite"], "postedDate": "2 weeks ago", "salary": {"amount": "4,812 to $15,449", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3992916763"}