{"jobTitle": "Transportation Manager", "company": {"name": "Chaminade College Preparatory, CA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Primary and Secondary Education", "description": "<strong>Daily Student Transportation Manager<br/><br/></strong>We are looking for an experienced, proactive candidate to perform in the role of Assistant to the Director of Facilities &amp; Daily Student Transportation Manager. This role will be responsible for supporting the Facilities Director by performing administrative and project tasks as well as managing the contracted transportation busing program for Chaminade.<br/><br/><strong>Duties/Responsibilities - Daily Student Transportation Manager<br/><br/></strong><ul><li>Manage daily transportation of 11 buses for 400+ student traveling to and from school</li><li>Manage and administer all facets of the school bus and shuttle operations of the school.</li><li>Be direct interface with contracted transportation company for student pick-ups and drop-offs.</li><li>Work with contracted bus company to establish routes that are convenient safe and equitable for all families and to provide the largest percentage of bus ridership</li><li>Provide timely and friendly customer service to help answer transportation program questions and concerns coming from parents, students, and school employees requiring availability during and between transportation operating hours</li><li>Manage and provide updated transportation content for school's website and marketing materials</li><li>Collaborate with both Middle and High School campuses to ensure a timely and accurate after school dismissal program</li><li>Maintain and create bus and shuttle routes, adjusted each year, to align with the school's current demographics, keeping equity, timing and safety in mind.</li><li>Manage transportation software<br/><br/></li></ul><strong>Duties/Responsibilities - Assistant To Director<br/><br/></strong><ul><li>Review and maintain written and computer files, plus conduct data entry</li><li>Assist in the coordination of administrative functions, including budget, personnel, meetings, and clerical duties</li><li>Research and collect information</li><li>Assist with all budget activities, including accounting</li><li>Help implement new programs, procedures, methods, and systems</li><li>Conduct reviews, surveys, and collect information on administrative matters</li><li>Responsible for preparation of confidential documents and reports</li><li>Create &amp; maintain meeting minutes</li><li>Coordinate and schedule meetings and conferences</li><li>Coordinate operations, including purchasing, equipment, property inventory, building, equipment, and disposal</li><li>Connect with building vendors to carry out small projects<br/><br/></li></ul><strong>Skills/Qualifications<br/><br/></strong><ul><li>Associate's degree from an accredited college or university is preferred</li><li>Minimum of 2 years' relevant work experience in a school setting</li><li>Prepare accurate reports</li><li>Exceptional communication and interpersonal skills</li><li>Attention to detail and an aptitude for problem-solving</li><li>Able to proactively address potential issues</li><li>Excellent computer skills, including experience with Microsoft Office Suite and/or Google Workspace</li><li>Collaborative working style and team-player attitude</li><li>Able to work independently with little supervision</li><li>Highly motivated with a strong work ethic</li><li>Reliable, trustworthy, and committed to the team's success</li><li>Outstanding organizational skills and ability to prioritize tasks</li><li>Able to thrive in a high-volume, deadline-driven work environment<br/><br/></li></ul><strong>Application Process<br/><br/></strong>Chaminade has implemented a 100% online application system. Interested applicants can apply online through our employment webpage at: www.chaminade.org/employment.<br/><br/>Applicants will be asked to upload a resume and cover letter.<br/><br/>Any applicant who needs help or needs an accommodation in order to apply for any position should contact the human resources office at (818) 366-9284 ext. 1240 or email dvoogt@chaminade.org.<br/><br/><strong>About Chaminade<br/><br/></strong>Chaminade is an independent co-educational Catholic school in the Marianist tradition serving a diverse student body in grades 6-12 across two beautiful campuses in the San Fernando Valley area of Los Angeles. We are a mission-centered community with an unwavering commitment to growing one's faith, serving others, and ensuring the success and well-being of every student and employee. Chaminade sets the standard for Catholic college preparatory excellence with a rigorous, relevant, and innovative academic curriculum and extensive extracurricular offerings.<br/><br/><strong>Our Mission<br/><br/></strong>We inspire young people to love, learn, and lead through our Catholic and Marianist traditions of a living faith, academic excellence, and moral responsibility.<br/><br/><strong>Our Vision<br/><br/></strong>Chaminade College Preparatory graduates are prepared, inspired, and equipped to:<br/><br/><ul><li>Share God's love by caring for others and seeking justice and peace.</li><li>Learn, adapt, and grow with the world around them.</li><li>Become servant leaders and positive contributors to society.<br/><br/></li></ul><strong>The Characteristics of Marianist Education<br/><br/></strong>Chaminade's mission and culture are deeply rooted in the five Characteristics of Marianist Education which are:<br/><br/><ul><li>Educating for Formation in Faith</li><li>Providing an Integral Quality Education</li><li>Educating in Family Spirit</li><li>Educating for Service, Justice, and Peace and the Integrity of Creation</li><li>Educating for Adaptation and Change<br/><br/></li></ul><strong>Chaminade's Commitment to Diversity<br/><br/></strong>Chaminade College Preparatory is committed to the principles of diversity, equity, and inclusion and the value that a rich and diverse community brings to our school. Our employee culture is deeply rooted in our Catholic faith and the five Characteristics of Marianist Education. Our Catholic Marianist tradition is lived on our campuses every day, and is evident in our Chaminade Family Spirit where each of our faculty and staff is valued for their unique and varied gifts and talents. Chaminade's faculty, staff, and administration come from all faiths, ethnicities, races, genders, and socioeconomic backgrounds and we are stronger for it.<br/><br/>For more information about Chaminade, visit our website at: www.chaminade.org<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Chaminade College Preparatory is an equal opportunity employer. Applicants for employment are considered without regard to race, color, national origin or ancestry, gender, age, marital status, physical or mental disability, or genetic information, or other basis protected by law for employment in a Catholic school. Applicants who need an accommodation in order to participate in the recruitment and hiring process should contact the human resources department in order to discuss reasonable accommodation.<br/><br/><strong><em>Job Posted by ApplicantPro</em></strong>", "responsibilities": "<strong>Duties/Responsibilities - Daily Student Transportation Manager<br/><br/></strong><ul><li>Manage daily transportation of 11 buses for 400+ student traveling to and from school</li><li>Manage and administer all facets of the school bus and shuttle operations of the school.</li><li>Be direct interface with contracted transportation company for student pick-ups and drop-offs.</li><li>Work with contracted bus company to establish routes that are convenient safe and equitable for all families and to provide the largest percentage of bus ridership</li><li>Provide timely and friendly customer service to help answer transportation program questions and concerns coming from parents, students, and school employees requiring availability during and between transportation operating hours</li><li>Manage and provide updated transportation content for school's website and marketing materials</li><li>Collaborate with both Middle and High School campuses to ensure a timely and accurate after school dismissal program</li><li>Maintain and create bus and shuttle routes, adjusted each year, to align with the school's current demographics, keeping equity, timing and safety in mind.</li><li>Manage transportation software<br/><br/></li></ul><strong>Duties/Responsibilities - Assistant To Director<br/><br/></strong><ul><li>Review and maintain written and computer files, plus conduct data entry</li><li>Assist in the coordination of administrative functions, including budget, personnel, meetings, and clerical duties</li><li>Research and collect information</li><li>Assist with all budget activities, including accounting</li><li>Help implement new programs, procedures, methods, and systems</li><li>Conduct reviews, surveys, and collect information on administrative matters</li><li>Responsible for preparation of confidential documents and reports</li><li>Create &amp; maintain meeting minutes</li><li>Coordinate and schedule meetings and conferences</li><li>Coordinate operations, including purchasing, equipment, property inventory, building, equipment, and disposal</li><li>Connect with building vendors to carry out small projects<br/><br/></li></ul>", "qualifications": {"required": "Prepare accurate reports, Exceptional communication and interpersonal skills, Attention to detail and an aptitude for problem-solving, Able to proactively address potential issues, Excellent computer skills, including experience with Microsoft Office Suite and/or Google Workspace, Collaborative working style and team-player attitude, Able to work independently with little supervision, Highly motivated with a strong work ethic, Reliable, trustworthy, and committed to the team's success, Outstanding organizational skills and ability to prioritize tasks, Able to thrive in a high-volume, deadline-driven work environment", "preferred": "Associate's degree from an accredited college or university is preferred, Minimum of 2 years' relevant work experience in a school setting"}, "skills": ["Microsoft Office", "Google Workspace", "Customer Service", "Communication", "Problem Solving", "Teamwork", "Organization", "Time Management"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992561025"}