{"jobTitle": "Creator Partnerships, Podcasts", "company": {"name": "24 Seven Talent", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development", "industry": "Entertainment Providers", "description": "Creator Partnerships Manager\nHybrid, Culver City\n6 months, with potential to extend\n$55-59/hr (w2)\n\n**The Role** \nAs the Creator Partnerships Manager, you will serve as the main point of contact for creators who are expanding their audiences and building their businesses through Podcasts. Your role involves managing relationships, offering best practice advice, coordinating campaigns and collaborations, and enhancing revenue opportunities for partners. Additionally, you will identify and support emerging podcast talent, offering guidance as needed.\n\n**Responsiblities** \nIn this role, your responsibilities will include: \n- Providing business analysis and insights to support the achievement of creator goals.\n- Collaborating with a group of creators to launch, manage, and expand engaging subscription products.\n- Partnering with emerging talent to promote the platform and highlight opportunities.\n- Advocating for creator interests within our marketing and editorial teams.\n- Enhancing creator marketing efforts using all available resources.\n- Identifying key content and delivering regular, clear updates to internal stakeholders.\n- Ensuring a high-quality customer experience by presenting partner content to the highest standards.\n- Handling a wide range of inquiries related to operations, marketing, content, and more, to benefit creators.\n\n**Requirements:\n**- Proven skills in creating impactful presentations for various audiences.\n- Strong integrity, a sense of humor, and excellent interpersonal abilities are essential.\n- Familiarity with podcast content and the ability to discuss a diverse range of categories.\n- In-depth understanding of trends impacting the podcasting sector, including content supply chains, distribution, monetization methods, emerging technologies, and business models for creators.\n- Demonstrated success in a partnerships role with experience in building effective business relationships within the entertainment industry.\n- A proactive approach to continuously improving and refining business strategies.\n- Experience in scaling digital subscription services is preferred.\n- Proficiency in developing and managing promotional schedules in podcasting or a related area.\n\n** Experience:\n**- Bachelor’s degree preferred.\n- At least 3 years of experience in a partnership or marketing role within the entertainment industry.", "postedDate": "2 weeks ago", "skills": ["Business Development", "Partnerships", "Marketing", "Entertainment", "Podcasting"], "url": "https://www.linkedin.com/jobs/view/3992375552"}