{"jobTitle": "Health Services Director", "company": {"name": "Oakmont Senior Living", "industry": "Hospitals and Health Care", "location": "San Gabriel, CA"}, "location": "San Gabriel, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Strategy/Planning and Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Position: Health Services Director <br/><br/></strong><strong>Pay Range<br/><br/></strong><strong>INSERT COMMUNITY NAME</strong> is a premier senior living community situated on a beautifully landscaped campus. Managed by Oakmont Management Group, we provide exceptional quality, comfort, and care with five-star services and amenities. Residents enjoy a rewarding lifestyle with individualized comprehensive support that promotes continuing independence. <em>We deliver meaningful lifestyles and relationships with residents, families, and team members by developing a winning culture and living these values: Authenticity * Teamwork * Compassion * Commitment * Resilience.<br/><br/></em><strong>With communities across California, Hawaii, and Nevada, opportunities for career growth, relocation, and travel are significant. In addition, eligible team members may enjoy the following benefits:<br/><br/></strong><ul><li>Medical, Dental, and Vision benefits</li><li>Vacation, Personal Day, Sick Pay, Holidays</li><li>Complimentary Meals</li><li>Bonus Opportunities</li><li>Company Paid Life Insurance</li><li>Team Member Discount Program (LifeMart)</li><li>401(k) Savings Plan with Company Match</li><li>Recognition Programs</li><li>Student Loan Refinancing</li><li>Tuition Reimbursement</li><li>Pet Insurance</li><li>Employee Assistance Program</li><li>Emergency Financial Assistance<br/><br/></li></ul><strong>The Health Services Director </strong>is a licensed nurse responsible for coordinating resident care and medication management under the medical direction and supervision of the residents’ attending physicians in order to ensure the resident remains as independent as possible for as long as possible.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Communicate with community healthcare professionals, including physicians, discharge planners, nurses, and state agencies on the care needs of all residents in the community.</li><li>Coordinate incidental medical, dental, vision, hearing, and podiatry care for residents.</li><li>Perform nursing duties as directed and in accordance with the appropriate scope of the Nurse Practice Act, including administering medications and performing treatments as ordered by a physician.</li><li>Oversee and provide the necessary training for Medication Technicians.</li><li>Administer resident pre-admission assessment prior to each resident’s move-in date and complete routine and as-needed reassessments in accordance with company policy and state regulations. </li><li>Interview potential residents and families and obtain medical records and other requirements as outlined in Title 22 for admission to the community.</li><li>Conduct staff interviews and observe residents on a continual basis to alert the Executive Director, responsible party, and others of changes in the physical or emotional health of the resident. Provide the Executive Director with information relative to the care staff’s ability to meet those needs.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must be a Licensed Vocational or Registered Nurse holding a valid California nursing license in good standing</li><li>Prefer two (2) years of experience working in a Residential Care Facility for the Elderly (RCFE)</li><li>Prefer one (1) year of experience supervising and managing employees</li><li>Able to obtain a valid Residential Care Facility for the Elderly (RCFE) license</li><li>Able to effectively teach/train staff</li><li>Able to operate a personal computer and be proficient in MS Office programs (Word, Excel, etc.)</li><li>Must pass a criminal background clearance before beginning work</li><li>Must be highly motivated and able to work independently</li><li>Able to obtain and maintain valid first aid and CPR certification </li><li>Must pass a Criminal Background check and Health Screening tests, including physical and TB Tests.</li><li>For the health and safety of our team members and residents, Oakmont Management Group may require team members to vaccinate, participate in daily screening, surveillance testing, and to wear face coverings and other personal protective equipment (PPE) to prevent the spread of the COVID-19 or other communicable diseases, per regulatory guidelines.<br/><br/></li></ul><strong>Oakmont Management Group,</strong> based in Irvine, California, is a recognized leader in the senior living industry that manages a portfolio of communities under the Oakmont Senior Living and Ivy Living brands. OMG serves thousands of seniors across communities in California, Nevada, and Hawaii. At OMG, we strive to create an atmosphere of family and community among team members, residents, and resident family members. We know that caring and meaningful relationships are the foundation of a rewarding life, and our team is hand-selected for their skills, previous experience, and passion for working with the elderly. Our practice is to incorporate joy and laughter alongside our expectations of excellence. Walk into our communities and feel our pride of ownership and commitment to service.<br/><br/>Oakmont Management Group is an Equal Opportunity Employer.", "responsibilities": "<ul><li>Communicate with community healthcare professionals, including physicians, discharge planners, nurses, and state agencies on the care needs of all residents in the community.</li><li>Coordinate incidental medical, dental, vision, hearing, and podiatry care for residents.</li><li>Perform nursing duties as directed and in accordance with the appropriate scope of the Nurse Practice Act, including administering medications and performing treatments as ordered by a physician.</li><li>Oversee and provide the necessary training for Medication Technicians.</li><li>Administer resident pre-admission assessment prior to each resident’s move-in date and complete routine and as-needed reassessments in accordance with company policy and state regulations. </li><li>Interview potential residents and families and obtain medical records and other requirements as outlined in Title 22 for admission to the community.</li><li>Conduct staff interviews and observe residents on a continual basis to alert the Executive Director, responsible party, and others of changes in the physical or emotional health of the resident. Provide the Executive Director with information relative to the care staff’s ability to meet those needs.<br/><br/></li></ul>", "qualifications": {"required": "Must be a Licensed Vocational or Registered Nurse holding a valid California nursing license in good standing, Able to operate a personal computer and be proficient in MS Office programs (Word, Excel, etc.), Must pass a criminal background clearance before beginning work, Must be highly motivated and able to work independently, Able to obtain and maintain valid first aid and CPR certification, Must pass a Criminal Background check and Health Screening tests, including physical and TB Tests.", "preferred": "Prefer two (2) years of experience working in a Residential Care Facility for the Elderly (RCFE), Prefer one (1) year of experience supervising and managing employees, Able to obtain a valid Residential Care Facility for the Elderly (RCFE) license, Able to effectively teach/train staff"}, "skills": ["Nursing", "Healthcare", "Medication Management", "Resident Care", "Training", "MS Office", "First Aid", "CPR"], "postedDate": "2 weeks ago", "benefits": "<ul><li>Medical, Dental, and Vision benefits</li><li>Vacation, Personal Day, Sick Pay, Holidays</li><li>Complimentary Meals</li><li>Bonus Opportunities</li><li>Company Paid Life Insurance</li><li>Team Member Discount Program (LifeMart)</li><li>401(k) Savings Plan with Company Match</li><li>Recognition Programs</li><li>Student Loan Refinancing</li><li>Tuition Reimbursement</li><li>Pet Insurance</li><li>Employee Assistance Program</li><li>Emergency Financial Assistance<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992769478"}