{"jobTitle": "Marketing Assistant", "company": {"name": "OMI", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Maritime", "description": "We are actively seeking a motivated **Entry Level Marketing Assistant** to work on groundbreaking campaigns with an advertising and marketing firm in the local region. This innovative firm was founded by dedicated people looking to push the envelope by using cost-effective marketing campaigns and advertising strategies. Their goal is to provide the same advertising as the standard firm but at a fraction of the price. As a progressive company in the sales and marketing industry, this firm continues to set the standard for excellence in customer acquisition and establishing a repeat customer base for clients. By providing personalized sales and marketing services to some of the largest retailers in the world, this firm continues to increase the market shares of clients through proven sales and marketing strategies.<br/><br/>The Entry Level Marketing Assistant position is a valued team member in the marketing and advertising department. The position is considered entry-level to start during training which includes a comprehensive overview of basic marketing strategy, direct advertising, promotional techniques, visual merchandising, and consumer market research. After successful completion of the program, an individual would be considered a team leader in the marketing department. The Marketing Assistant reports directly to the Executive Marketing Manager.<br/><br/>**Responsibilities<br/><br/>**<ul><li>Assisting in the daily growth and development of assigned campaigns</li><li>Assisting with efforts of customer acquisition and retention</li><li>Expertly managing the needs of external customers</li><li>Developing strong leadership and interpersonal skills</li><li>Driving sales through retail promotional campaigns</li><li>Build brand recognition through local events and experiential marketing</li><li>Strategize, execute and manage with the Brand Ambassador teams</li><li>Interact and communicate with customers<br/><br/></li></ul>The personalized focus of the campaigns is not only a refreshing alternative to more general mass sales and marketing strategies, but it is also responsible for the unprecedented growth and stability of the company. The management team prides itself on recognizing top performance, integrity, and a winning mindset for continual internal promotions. If you possess a passion for marketing, sales, or retail and would enjoy learning how to manage the varying dimensions of a business, this position could be an excellent fit for the right candidate.<br/><br/><ul><li>Must be able to work full-time hours and some weekends for special events.</li><li>Ability to excel in unsupervised solo assignments as well as team projects.</li><li>Desire to travel at least 1 or 2 weeks a year for further training.</li><li>Great communication skills</li><li>Must be able to work in an energetic, fast-paced environment.</li><li>2 or 4-year college degree in a related field</li><li>Self-starter, creative thinker, problem solver<br/><br/></li></ul>**Why work here?<br/><br/>**<ul><li>Full Training</li><li>Company Paid Travel</li><li>Market Competitive Pay Structure: Weekly Bonuses and Incentives</li><li>Rapid upward mobility</li><li>Community involvement and Charitable opportunities</li><li>A fun, high-energy work environment! No cubicles here, we work closely together as a team!<br/><br/></li></ul>Powered by JazzHR<br/><br/>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3992885566"}