{"jobTitle": "Territory Account Manager", "company": {"name": "Tenable", "industry": "Computer and Network Security", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "112,000.00/yr - 149,333.33/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Computer and Network Security", "description": "<strong>Who is Tenable?<br/><br/></strong>Tenable® is the Exposure Management company. 44,000 organizations around the globe rely on Tenable to understand and reduce cyber risk. Our global employees support 65 percent of the Fortune 500, 45 percent of the Global 2000, and large government agencies. Come be part of our journey!<br/><br/><strong>What makes Tenable such a great place to work?<br/><br/></strong>Ask a member of our team and they’ll answer, “Our people!” We work together to build and innovate best-in-class cybersecurity solutions for our customers; all while creating a culture of belonging, respect, and excellence where we can be our best selves. When you’re part of our #OneTenable team, you can expect to partner with some of the most talented and passionate people in the industry, and have the support and resources you need to do work that truly matters. We deliver results that exceed expectations and we win together!<br/><br/><strong>Your Role<br/><br/></strong>The Territory Manager is responsible for establishing and developing business through existing and new clients in assigned regions and/or territories.<br/><br/><strong>Your Opportunity<br/><br/></strong><ul><li>Maintain and develop the existing client base through regional marketing and direct sales activities</li><li>Identify, qualify and develop new opportunities through prospecting and networking</li><li>Manage and maintain your territory’s sales pipeline and target key accounts and vertical markets for development</li><li>Achieve assigned monthly, quarterly and annual sales budgets and other regional objectives established by the Vice President of Sales</li><li>Provide monthly and quarterly sales forecasts</li><li>Manage the day to date activities of sales personnel dedicated to your region. This includes inside sales representatives and sales engineers</li><li>Consistently achieve and/or exceed your assigned quotas and revenue objectives</li><li>Utilize channel sales resources in your region as necessary</li><li>Stay abreast of competitive industry and market intelligence and provide feedback in this area to executive management<br/><br/></li></ul><strong>What You'll Need<br/><br/></strong><ul><li>Bachelor’s Degree and 5-7 years of experience directly relating to this job</li><li>Ability to take on a consultative style when presenting ideas and products</li><li>Competency with sales tracking tools</li><li>Outstanding oral and written communication skills</li><li>Must be detail oriented and capable of accurate work with minimal supervision</li><li>Ability to sit and work at a computer for extended periods of time</li><li>Ability to travel approximately 25% of the time<br/><br/></li></ul>This is the base pay range for this position. Compensation for the role will depend on a number of factors, including the candidate's qualifications, skills, competencies, location and experience, and may fall outside of the range shown. Employees are also eligible for variable compensation in addition to base pay (commission for sales roles, bonus for non-sales roles), depending on company and individual performance. Tenable also offers a variety of comprehensive and competitive benefits which include: medical, dental, vision, disability and life insurance; 401(k) retirement savings with company match; an employee stock purchase plan; an employee referral program; flexible spending accounts; an Employee Assistance Program (EAP); education assistance; parental leave; paid time off (PTO); company-paid holidays; health and wellness events; and community programs.<br/><br/>US Pay Ranges<br/><br/>$112,000—$149,333.33 USD<br/><br/>If you’ve reached this point, and you’re still not sure if you should apply…..Just do it! We’re human and we don’t fit a perfect mold. Having diverse backgrounds, experiences and perspectives, that’s a good thing! If you’re coming from outside of the cyber industry - great! If you’re looking to try something new - awesome! All we ask is you bring passion to all that you do, crave creativity and innovation, and embrace the hard work of gaining new skills and accepting big challenges.<br/><br/><em>We’re committed to promoting Equal Employment Opportunity (EEO) at Tenable - through all equal employment opportunity laws and regulations at the international, federal, state and local levels. If you need a reasonable accommodation due to a disability during the application or recruiting process, please contact</em> <em>Recruiting@Tenable.com</em><em> for further assistance.<br/><br/></em><strong>Tenable Data Consent Statement<br/><br/></strong>Tenable is committed to protecting the privacy and security of your personal data. This Notice describes how we collect and use your personal data during and after your working relationship with us, in accordance with the General Data Protection Regulation (“GDPR”). Please click here to review.<br/><br/>For California Residents: The California Consumer Privacy Act (CCPA) requires that Tenable advise you of certain rights related to the collection of your private information. Please click here to review.<br/><br/>", "responsibilities": "The Territory Manager is responsible for establishing and developing business through existing and new clients in assigned regions and/or territories.", "qualifications": {"required": "Bachelor’s Degree and 5-7 years of experience directly relating to this job, Ability to take on a consultative style when presenting ideas and products, Competency with sales tracking tools, Outstanding oral and written communication skills, Must be detail oriented and capable of accurate work with minimal supervision, Ability to sit and work at a computer for extended periods of time, Ability to travel approximately 25% of the time", "preferred": ""}, "skills": ["Sales", "Business Development", "Marketing", "Sales Management", "Customer Relationship Management (CRM)", "Sales Forecasting", "Sales Operations", "Channel Sales", "Competitive Analysis", "Market Research"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "medical, dental, vision, disability and life insurance; 401(k) retirement savings with company match; an employee stock purchase plan; an employee referral program; flexible spending accounts; an Employee Assistance Program (EAP); education assistance; parental leave; paid time off (PTO); company-paid holidays; health and wellness events; and community programs.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992786879"}