{"jobTitle": "ACH Payment Product Manager", "company": {"name": "Oowlish", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "IT Services and IT Consulting", "description": "Join Our Team<br/><br/>Oowlish, one of Latin America's rapidly expanding software development companies, is seeking experienced technology professionals to enhance our diverse and vibrant team.<br/><br/>As a valued member of Oowlish, you will collaborate with premier clients from the United States and Europe, contributing to pioneering digital solutions. Our commitment to creating a nurturing work environment is recognized by our certification as a Great Place to Work, where you will have opportunities for professional development, growth, and a chance to make a significant international impact.<br/><br/>We offer the convenience of remote work, allowing you to craft a work-life balance that suits your personal and professional needs. We're looking for candidates who are passionate about technology, proficient in English, and excited to engage in remote collaboration for a worldwide presence.<br/><br/>Our client is a leading fintech company dedicated to revolutionizing the financial service industry with cutting-edge technology and innovative solutions.<br/><br/>Our team is committed to delivering top-notch services to our clients, and we are seeking a skilled Nacha<br/><br/>Expert/Product Manager to join us on a contract basis.<br/><br/>As a Nacha Expert/Product Manager, you will play a critical role in managing and enhancing our ACH payment products. You will be responsible for ensuring compliance with Nacha regulations, overseeing product development, and collaborating with cross-<br/><br/>functional teams to deliver exceptional payment solutions. This is a contract position, and the candidate must be based in the USA.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Product Management: Lead the development and enhancement of ACH payment products, ensuring they meet market demands and regulatory requirements.</li><li>Nacha Compliance: Ensure all ACH payment processes and products comply with Nacha rules and regulations. Stay up to date with any changes in Nacha guidelines and implement necessary updates.</li><li>Stakeholder Collaboration: Work closely with engineering, operations, compliance, and customer service teams to ensure seamless product development and deployment.</li><li>Market Analysis: Conduct market research and competitor analysis to identify trends, opportunities, and potential product improvements.</li><li>Project Management: Manage product development projects from inception to launch, ensuring timely delivery and alignment with business goals.</li><li>Manage the day-to-day flow of inbound and outbound ACH transactions to ensure all accounting processes are balanced</li><li>Documentation: Create and maintain detailed product documentation, including user guides, process flows, and compliance reports.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Demonstrated experience as a Product Manager with a strong emphasis on ACH payments and Nacha compliance.</li><li>Deep understanding of Nacha rules and the ACH payment system.</li><li>Strong project management, analytical, and problem-solving skills. Excellent communication and collaboration abilities with cross-functional teams.</li><li>Location: Must be based in the USA and authorized to work in the country.<br/><br/></li></ul>Come join us in breaking the mold and revolutionizing the tech landscape!<br/><br/><strong>You Can Also Apply Here<br/><br/></strong>Website: https://www.oowlish.com/work-with-us/<br/><br/>LinkedIn: https://www.linkedin.com/company/oowlish/jobs/<br/><br/>Instagram: https://www.instagram.com/oowlishtechnology/<br/><br/>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3992203935"}