{"jobTitle": "Manager, Client Relationship Support- Torrance, CA", "company": {"name": "Jobs via eFinancialCareers", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Regular", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "At Schwab, you’re empowered to make an impact on your career. Here, innovative thought meets creative problem solving, helping us “challenge the status quo” and transform the finance industry together. As a Client Relationship Manager, (CRM), you play an essential and impactful leadership role that informs the daily operational success of the local branch. You are the first point of contact at the branch and will work cross-functionally with other branch team members and partners across the firm to deliver exceptional experiences for our clients. You will assist the Branch Manager and sales/support staff with meeting our clients’ needs, resolving customer escalations, helping to deepen both internal and external client relationships, and acting as the Branch Manager in their absence. Your responsibilities also will include coordinating and maintaining the branch paperwork and operations flow, as well as implementing, training, and supporting new processes adopted by the firm. This is a role where you can bring your passion for mentorship and developing client service professionals to a firm that will value your contributions and champion your growth.", "responsibilities": "Coordinate and maintain the branch paperwork and operations flow, assist the Branch Manager and sales/support staff with meeting clients’ needs, resolve customer escalations, deepen client relationships, and act as the Branch Manager in their absence.", "qualifications": {"required": "Bachelor's degree or equivalent work-related experience, Active and valid FINRA Series 7, 9/10 and 63 licenses, 3+ years’ experience with customer service, 3-5 years in a security/financial services capacity", "preferred": "Notary, 2+ years’ experience in a management/supervisory capacity, Outstanding written and oral communication skills, Strong financial acumen, Ability to work independently and effectively as part of a team."}, "skills": ["Customer Service", "Leadership", "Communication", "Financial Acumen", "Problem Solving"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "401(k) with company match, Paid time for vacation, volunteering, and 28-day sabbatical after every 5 years of service, Paid parental leave and family building benefits, Tuition reimbursement, Health, dental, and vision insurance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992900889"}