{"jobTitle": "Site Manager II (Salaried)", "company": {"name": "PSSI", "industry": "Food and Beverage Manufacturing", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Food and Beverage Manufacturing", "description": "<em>Para ver la descripción de trabajo en español, por favor desplácese hacia abajo hasta el final de la página. <br/><br/></em><strong>Position Summary<br/><br/></strong>The Site Manager II performs exempt executive work such as supervising and directing the work of the sanitation crew, managing the budget (e.g., payroll, supplies, etc.), and billing our customers for services rendered. The primary duty entails the daily management of operations (e.g., interviewing, hiring, training, setting and adjusting of pay rates and hours, planning and directing work; maintaining sales; discipline of team members; handling team member complaints and grievances; determining the techniques to be utilized to effectively sanitize the facility to ensure that the facilities are sanitized in compliance with governmental and/or customer specifications; etc.). In sum, the Site Manager II is typically the highest ranking PSSI official on the customer’s facility. Due to the nature of this work, you must be 18 years of age or older to apply.<br/><br/><strong>Essential Functions/Job Duties<br/><br/></strong>To be qualified for the Site Manager II job, an individual must be able to perform the essential functions of the job, with or without a reasonable accommodation.<br/><br/><ul><li>Plans, develops and implements strategy for operational management to meet performance, safety, timeliness and budget requirements.</li><li>Manages and controls site expenditures within approved budgets.</li><li>Manages site usages of labor, supplies, and chemicals to ensure P&amp;L standards are met.</li><li>Evaluates and documents sanitation process for potential cost savings citing specific areas, dollars and/or percentages to support recommendations, which will be relied on by the Site Manager II’s superiors.</li><li>Monitors, measures and reports on operational issues, opportunities and improvement plans and achievements the same within agreed formats and timeframes.</li><li>Communicates with Area Manager on a daily basis to report accidents, downtime, damage and other important plant issues.</li><li>Communicates with Corporate office daily regarding items such as nightly logs, payroll, chemical and supply orders, timesheets, etc.</li><li>Completes weekly internal safety audits on staff as well as equipment to ensure we are providing our team members a safe work environment.</li><li>Sets, monitors, motivates and tracks specific goals for the sanitation crew in regards to working safe, clean and on time.</li><li>Manages and develops direct reporting staff, including, but not limited to, interviewing, hiring, training, coaching, motivating, evaluating, setting and adjusting of pay rates and hours of work, handling team member complaints and grievances, disciplining team members, planning and directing the work of team members, etc.</li><li>Ensures compliance with all internal company procedures and policies including Technical Services, Human Resources, Accounting, IT, and general customer service.</li><li>Complies with procedures set forth in employee handbook, safety handbook, cleaning procedure and Corporate Authorities manual.</li><li>Implements PSSI training programs including safety training and ERP.</li><li>Coordinates responses to any governmental or customer deficiencies.</li><li>Reports and investigates all accidents.</li><li>Monitors treatment of injured team members and assists worker’s compensation in providing restricted duty work.</li><li>Serves as a liaison with PSSI’s customers.</li><li>Attends sanitation meetings (e.g., production, USDA, audits, etc.) on behalf of PSSI with the customer.</li><li>Communicates customer responsibilities required for sanitation of the facility (e.g., maintenance needs, water pressure/temperature, customer provided supplies, etc.).</li><li>Submits corrective actions procedures to customer when necessary to remedy issues.</li><li>Follows-up with customers to ensure that problems are resolved to their satisfaction.</li><li>Acts as liaison with regulatory agencies as needed.</li><li>Is supported by Human Resources, Payroll and Technical Services with any government agencies (e.g., OSHA, ICE, EEOC, NLRB, DOL, etc.) matters.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong>Ability to read, write, add and subtract; six (6) months to one year of related sanitation experience; general working knowledge of computers/technology (e.g., Microsoft Excel and Word); ability to wear personal protective equipment; and ability to work in work environments with extreme temperature fluctuations. Due to the nature of this work, you must be 18 years of age or older to apply.<br/><br/><strong>Preferred Qualifications<br/><br/></strong>High School Degree or its Equivalent, Phone Skills, Recruiting, Interviewing Skills, People Skills, Professional, Detail Oriented, Safety Oriented, Results Driven, Accountable, Approachable, Customer Service, Independent Thinker, Driven, Honest, Leader, Motivator, Teacher.<br/><br/><strong>What We Offer<br/><br/></strong><ul><li> Medical, Dental, &amp; Vision Insurance</li><li> Basic Life Insurance</li><li> 401k Retirement Plan</li><li> Paid Holidays (based on location)</li><li> Paid Vacation</li><li> Employee Assistance Program</li><li> Training &amp; Development Opportunities<br/><br/></li></ul>Packers Sanitation Services, Inc. (PSSI) is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, creed, sex, gender, gender identity, national origin, citizenship status, uniform service member status, veteran status, age, genetic information, disability, or any other protected status, in accordance with all applicable federal state, and local laws. PSSI is committed to complying with the laws protecting qualified individuals with disabilities. PSSI will provide a reasonable accommodation for any known physical or mental disability of a qualified individual with a disability to the extent required by law, provided the requested accommodation does not create an undue hardship for the Company and/or does not pose a direct threat to the health or safety of others in the workplace and/or to the individual. If an employee requires an accommodation, they must notify the site manager or the Corporate Human Resources Department. If an applicant requires an accommodation, they must notify the hiring manager and/or the Recruiter hiring for the position.<br/><br/><strong>RESUMEN DE LA POSICION<br/><br/></strong>El Gerente de Sitio II realiza un trabajo ejecutivo exento como lo es supervisar y dirigir el trabajo del equipo de saneamiento, manejar el presupuesto (Ej. Nomina, suministros, etc.) Y la facturación de los clientes por servicios prestados. La labor principal incluye el manejo diario de las operaciones (Ej. Entrevistas, contratación, entrenamiento, configuración y ajustes de índices de pago y horas, planear y dirigir el trabajo, mantener las ventas, la disciplina del miembros del equipo, manejar las quejas y reclamos de los miembros del equipo y determinar las técnicas a utilizar para efectivamente desinfectar la instalación y asegurarse que la desinfección esta en cumplimiento con las especificaciones gubernamentales y/o del cliente, etc.) En suma, el Gerente de Sitio II es típicamente el rango más alto oficial de PSSI en la instalación del client. Debido a la naturaleza de este trabajo. Usted debe tener 18 años o más para aplicar.<br/><br/><strong>FUNCIONES ESENCIALES/ LABORES DEL TRABAJO <br/><br/></strong>Para cualificar como Gerente de Sitio II, un individuo debe poder realizar las funciones esenciales del trabajo, con o sin acomodación razonable.<br/><br/><ul><li>Planea, desarrolla e implementa estrategias para el manejo operacional que cumpla con los requisitos de desempeño, seguridad, puntualidad y presupuesto.</li><li>Maneja y controla gastos del sitio dentro del presupuesto.</li><li>Maneja el uso en el sitio de labor, suministros, químicos para asegurarse que los estándares P&amp;L se están cumpliendo.</li><li>Evalúa y documenta los procesos de saneamiento para potenciales ahorros de costos en áreas específicas, dólares y/o porcentajes para apoyar recomendaciones, lo cual dependerá de los superiores del Gerente de Sitio II.</li><li>Monitorea, mide y reporta inconvenientes operacionales, planes de progreso y oportunidades y logros, del mismo modo que acuerda formatos y límites de tiempo.</li><li>Se comunica con el Gerente de Área diariamente para reportar accidentes, retrasos, daños y otros inconvenientes importantes de la planta y provee planes de acción en respuesta a cada uno.</li><li>Se comunica con la oficina corporativa diariamente en relación a elementos como los registros nocturnos, nomina, orden de químicos y suministros y las hojas de registro.</li><li>Completa auditorias de seguridad internas para los empleados semanalmente, del mismo modo que del equipo para asegurarse que estamos brindando a nuestros miembros del equipo un ambiente de trabajo seguro.</li><li>Configura, monitorea, motiva y rastrea metas específicas para el grupo de saneamiento en relación a trabajar seguro, la limpieza y la puntualidad.</li><li>Maneja y desarrolla reporte directo de empleado, incluyendo pero no limitado a entrevistas, contratación, entrenamiento, motivación, evacuación, configuración y ajuste de índice de pagos y horas de trabajo, manejo de quejas y reclamos de los miembros del equipo para minimizar la pérdida de personal, disciplina de los miembros del equipo, planeación y dirección del trabajo de los miembros del equipo etc.</li><li>Asegura cumplimiento con todos los procedimientos y políticas internas incluyendo Servicios Técnicos, Recursos Humanos, Contaduría, IT y servicios al cliente en general.</li><li>Cumple con los procedimientos descritos en el manual del empleado, el manual de seguridad, los procesos de limpieza y el manual de las autoridades corporativas.</li><li>Implementa programas de entrenamiento de PSSI incluyendo entrenamiento de seguridad y ERP.</li><li>Coordina respuestas a las deficiencias gubernamentales o del cliente.</li><li>Reporta e investiga accidentes.</li><li>Monitorea tratamiento de heridas de los miembros del equipo y asiste a compensación laboral con proveer trabajo restringido.</li><li>Sirve como intermediario con los clientes de PSSI y las agencias gubernamentales.</li><li>Asiste a las reuniones de saneamiento (Ej. Producción, USDA, auditorias, etc.) en nombre de PSSI con el cliente para asegurarse que este satisfecho.</li><li>Comunica los requisitos cliente en términos de responsabilidades de saneamiento de la instalación (Ej. Necesidad de mantenimiento, presión de agua/temperatura, provisión de suministros del cliente, etc.).</li><li>Presenta procedimientos de acciones correctivas al cliente cuando es necesario para remediar problemas.</li><li>Hace seguimiento con los clientes para asegurarse que los problemas están resueltos según su satisfacción.</li><li>Actúa como intermediario con las agencias regulatorias como sea necesario</li><li>Es apoyado por Recursos Humanos, nómina y servicios técnicos con cualquier asunto de una agencia gubernamental (Ej. OSHA, ICE, EEOC, NLRB, DOL, etc.)<br/><br/></li></ul><strong>CUALIFICACIONES MÍNIMAS <br/><br/></strong>Habilidad para leer, escribir, sumar y restar. Seis (6) meses a un año de experiencia relacionada al saneamiento, conocimiento general de trabajo en computadores/tecnología (Ej. Microsoft Outlook, Excel and Word) Habilidad para utilizar equipo de protección personal y habilidad para trabajar en ambientes laborales con fluctuaciones extremas de temperature. Debido a la naturaleza de este trabajo. Usted debe tener 18 años o más para aplicar.<br/><br/><strong>CUALIFICACIONES PREFERIDAS <br/><br/></strong>Diploma de bachiller o su equivalente, habilidades telefónicas, de reclutamiento, habilidades de entrevista y con personal, profesional, detallista, orientado en seguridad, motivado por resultados, responsable, servicio al cliente, pensador independiente, honesto, líder, motivador y maestro.<br/><br/><strong>Lo Que Ofrecemos<br/><br/></strong><ul><li>Seguro Médico, Dental y Visión</li><li>Seguro de Vida Básico</li><li>Plan de Jubilación 401K</li><li>Días Festivos pagadas (según la ubicación)</li><li>Vacaciones pagadas</li><li>Programa de Asistencia para Empleados</li><li>Oportunidades de Entrenamiento y Promoción<br/><br/></li></ul>Packers Sanitation Services, Inc. (PSSI) esta orgulloso de ser un empleado que ofrece igualdad de oportunidades. Todos los candidatos cualificados recibirán consideración de empleo sin importar raza, religión, color, credo, sexo, género, identidad de género, nacionalidad de origen, estado ciudadano, estado de miembro de las fuerzas uniformadas, estado veterano, edad, información genética, discapacidad u otro estado protegido en concordancia con todas las leyes federales, estatales y locales que apliquen. PSSI esta comprometido con cumplir con estas leyes que protegen a los individuos cualificados con discapacidades. PSSI proveerá una acomodación razonable a cualquier discapacidad física o mental conocida de un individuo cualificado a la extensión requerida por lay, provista la acomodación requerida no cree una adversidad excesiva para la compañía y/o coloque en amenaza directa la salud o seguridad de otros en el lugar de trabajo y/o al individuo. Si un empleado requiere una acomodación, ellos deben notificar al gerente de sitio o al departamento de recursos humanos corporativo. Si un candidato requiere de una acomodación, ellos deben notificar al gerente de contratación y/o al reclutador contratando para la posición.", "responsibilities": "The Site Manager II performs exempt executive work such as supervising and directing the work of the sanitation crew, managing the budget (e.g., payroll, supplies, etc.), and billing our customers for services rendered. The primary duty entails the daily management of operations (e.g., interviewing, hiring, training, setting and adjusting of pay rates and hours, planning and directing work; maintaining sales; discipline of team members; handling team member complaints and grievances; determining the techniques to be utilized to effectively sanitize the facility to ensure that the facilities are sanitized in compliance with governmental and/or customer specifications; etc.). In sum, the Site Manager II is typically the highest ranking PSSI official on the customer’s facility. Due to the nature of this work, you must be 18 years of age or older to apply.", "qualifications": {"required": "Ability to read, write, add and subtract; six (6) months to one year of related sanitation experience; general working knowledge of computers/technology (e.g., Microsoft Excel and Word); ability to wear personal protective equipment; and ability to work in work environments with extreme temperature fluctuations. Due to the nature of this work, you must be 18 years of age or older to apply.", "preferred": "High School Degree or its Equivalent, Phone Skills, Recruiting, Interviewing Skills, People Skills, Professional, Detail Oriented, Safety Oriented, Results Driven, Accountable, Approachable, Customer Service, Independent Thinker, Driven, Honest, Leader, Motivator, Teacher."}, "skills": ["Microsoft Excel", "Microsoft Word"], "postedDate": "2 weeks ago", "benefits": "Medical, Dental, & Vision Insurance, Basic Life Insurance, 401k Retirement Plan, Paid Holidays (based on location), Paid Vacation, Employee Assistance Program, Training & Development Opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992939139"}