{"jobTitle": "Contracts Manager", "company": {"name": "ICF", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Business Consulting and Services", "description": "ICF (NASDAQ: ICFI) is a global consulting services company with over 9,000 full- and part-time employees, but we are not your typical consultants. At ICF, business analysts and policy specialists collaborate with digital strategists, data scientists and creatives. We combine unmatched industry expertise with innovative engagement capabilities to help organizations solve their most complex challenges. Since 1969, public and private sector clients have worked with ICF to navigate change and shape the future. Learn more at icf.com.<br/><br/>We have an opening for a <strong>Contracts Manager</strong> supporting our growing and dynamic <strong>Utility Program Services</strong> (UPS) division. Our UPS division focuses on delivering <strong>energy efficiency and electrification advisory programs</strong> for utilities all over the nation. The ideal candidate will have a great attitude, a keen eye for detail, be flexible, able to think “outside the box” in a fast-paced environment, and experience with public utility contracts.<br/><br/>This position is 100% Remote in the 48 contiguous United States, with preference given to the Reston, VA area for a hybrid schedule.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provide contracts support for proposals and active contracts with major utilities across the nation.</li><li>Lead the contract review and negotiation process for new proposals, RFP awards, amendments to existing contracts, and new contracts with a focus on risk mitigation and overall value to the company, consistent with sound business practices, ICF policies and procedures, and government regulations. Maintain all required contractual and price/business volume documentation.</li><li>Review and negotiate non-disclosure agreements, teaming agreements, and subcontract agreements (when ICF is subcontractor).</li><li>Identify contractual and/or RFP terms which may pose risk to the company and provide recommendations where applicable on strategies to mitigate.</li><li>Provide guidance and oversight, and work with client representatives to resolve operational and contractual issues that may arise during the performance of the contract, with a focus on mitigating ICF’s risk, maintaining and increasing profitability, balanced with client needs.</li><li>Proactively assess critical contract obligations and contract provisions, to include gaps and risks. Advise on contract revisions to better meet the needs of the Client and ICF.</li><li>Support data calls, maintain compliance with SOX and other governmental requirements, as well as client audit requirements on an ongoing basis.</li><li>Handle multiple priority tasks and proposals effectively.</li><li>Develop effective positive working relationships with both internal and external clients; participate in client meetings as required.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>6+ years’ experience negotiating terms and managing commercial contracts.</li><li>6+ years’ experience working with relevant laws, regulations, terms, conditions, and policies governing commercial contracts.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s Degree</li><li>Familiarity with the utility industry.</li><li>Understanding of ‘Pay for Performance’ agreements in the utility, energy efficiency space.</li><li>Familiarity with Deltek tools such as Costpoint and Contract Management Systems.<br/><br/></li></ul><strong>Professional Skills<br/><br/></strong><ul><li>Solid skills with Microsoft Office (e.g., Word, Excel, Teams, SharePoint)</li><li>Excellent oral and written communications.</li><li>Strong attention to detail and the ability to multi-task in a dynamic, fast-paced environment.</li><li>Effective interpersonal, communication, and time management skills</li><li>Self-starter and able to take initiative in solving problems.</li><li>Strong organizational, analytical and problem-solving skills.</li><li>Ability to build collaborative business relationships both internally to the company and with external clients.</li><li>The ability to collaboratively work with geographically diverse internal clients.<br/><br/></li></ul>#Indeed<br/><br/><strong>Working at ICF<br/><br/></strong>ICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.<br/><br/>We can only solve the world's toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO &amp; AA policy.<br/><br/>Reasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email icfcareercenter@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.<br/><br/>Read more about workplace discrimination rights, the Pay Transparency Statement, or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.<br/><br/><strong>Pay Range</strong> - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.<br/><br/>The pay range for this position based on full-time employment is:<br/><br/>$84,533.00 - $143,706.00<br/><br/>Nationwide Remote Office (US99)<br/><br/>", "responsibilities": "Provide contracts support for proposals and active contracts with major utilities across the nation.Lead the contract review and negotiation process for new proposals, RFP awards, amendments to existing contracts, and new contracts with a focus on risk mitigation and overall value to the company, consistent with sound business practices, ICF policies and procedures, and government regulations. Maintain all required contractual and price/business volume documentation.Review and negotiate non-disclosure agreements, teaming agreements, and subcontract agreements (when ICF is subcontractor).Identify contractual and/or RFP terms which may pose risk to the company and provide recommendations where applicable on strategies to mitigate.Provide guidance and oversight, and work with client representatives to resolve operational and contractual issues that may arise during the performance of the contract, with a focus on mitigating ICF’s risk, maintaining and increasing profitability, balanced with client needs.Proactively assess critical contract obligations and contract provisions, to include gaps and risks. Advise on contract revisions to better meet the needs of the Client and ICF.Support data calls, maintain compliance with SOX and other governmental requirements, as well as client audit requirements on an ongoing basis.Handle multiple priority tasks and proposals effectively.Develop effective positive working relationships with both internal and external clients; participate in client meetings as required.", "qualifications": {"required": "6+ years’ experience negotiating terms and managing commercial contracts.6+ years’ experience working with relevant laws, regulations, terms, conditions, and policies governing commercial contracts.", "preferred": "Bachelor’s DegreeFamiliarity with the utility industry.Understanding of ‘Pay for Performance’ agreements in the utility, energy efficiency space.Familiarity with Deltek tools such as Costpoint and Contract Management Systems."}, "skills": ["Microsoft Office", "Word", "Excel", "Teams", "SharePoint", "Communication", "Problem Solving"], "postedDate": "2 weeks ago", "salary": {"amount": "84,533.00 - 143,706.00", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3992366004"}