{"jobTitle": "Merchandise Planner", "company": {"name": "Nexgrill", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "30.00 USD- 33.00 USD", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "We kindly request that staffing partners refrain from reaching out, as we are not currently seeking external assistance for our hiring needs<br/><br/><strong>Title:</strong>Merchandise Planner<br/><br/><strong>Wage Range:</strong>$30.00 USD- $33.00 USD<br/><br/><strong>Location:</strong> Onsite Chino, CA<br/><br/><strong>Summary:<br/><br/></strong>The Merchandise Planner plays a crucial role in our consumer product company by supporting the planning and management of inventory, sales, and profits. This role focuses on running reports to provide essential data for optimizing business operations. The Merchandise Planner will generate and compile reports on consumer behavior, product categories, and advertising performance.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Generate and run reports on sales data to identify trends and key performance metrics</li><li>Monitor and report inventory levels, collaborating closely with your manager to ensure timely restocking to meet consumer demand</li><li>Conduct foundational research and analyze seasonal profiles for items using historical Point of Sale (POS) data</li><li>Compile report findings to assist your manager in decision-making processes</li><li>Monitor and report on sales, profits, and losses</li><li>Provide data to support the marketing team in aligning marketing plans with sales strategies</li><li>Generate and review reports on e-commerce performance and activities</li><li>Collaborate with your manager to track the efficiency of the product lifecycle from production to sale</li><li>Identify and recommend solutions for inventory or campaign issues. </li><li>Collaborate with your manager and cross-functional teams to support data needs<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor’s degree in Business, Marketing, Accounting, or equivalent experience</li><li>Strong analytical skills with an understanding of consumer behavior</li><li>Proficiency in using reporting tools and software</li><li>1-3 years of experience in generating and running reports in consumer products, particularly in hardware, cookware, or outdoor products, with a focus on big-box clubs or retailers</li><li>Experience in merchandise allocation and inventory management is considered an asset<br/><br/></li></ul><strong>What We Offer:<br/><br/></strong>The ideal candidate for this position will enjoy a comprehensive benefits package, including 100% employer-paid health premiums, dental and vision coverage, and life insurance. They will also have access to a 401(K) Safe Harbor Plan to support their retirement savings. We value work-life balance and offer generous paid time off for our employees to relax and rejuvenate. We believe in investing in our employees' growth and offer training and development opportunities. Additionally, we foster a positive work environment through engagement activities and events. As a bonus, employees can enjoy various discounts as part of our employee discount program.<br/><br/><strong>Company Overview:<br/><br/></strong>At Nexgrill, we pride ourselves on building valuable products that bring people together around the grill and the table to create memorable moments with family and friends. Established in 1993 in Chino, CA, we leverage our expertise in fabricating stainless steel, cast aluminum, cast iron, porcelain, and other materials to deliver quality products at competitive prices. We create outdoor cooking and heating products including gas grills, charcoal grills, pellet grills, griddles, grill accessories, and outdoor heaters for the North American and international markets.<br/><br/>We are passionate and excited about what we do. We are committed to deliver on our promises and motivate each other. We persevere with purpose to achieve our goals, despite the obstacles in our way. We work together to create moments that matter for our associates and our customers.<br/><br/>Our vast global reach offers many opportunities to cultivate a lifelong career.<br/><br/><strong>Join our team! Apply today!<br/><br/></strong>Privacy Notice: This website collects certain information about its users in accordance with the California Consumer Privacy Act (CCPA). For more details on how we handle and protect your personal information, please review our Privacy Policy. https://nexgrill.com/pages/cpra-privacy-policy<br/><br/>Powered by JazzHR<br/><br/>B80PqZgFVo", "responsibilities": "Generate and run reports on sales data to identify trends and key performance metrics\nMonitor and report inventory levels, collaborating closely with your manager to ensure timely restocking to meet consumer demand\nConduct foundational research and analyze seasonal profiles for items using historical Point of Sale (POS) data\nCompile report findings to assist your manager in decision-making processes\nMonitor and report on sales, profits, and losses\nProvide data to support the marketing team in aligning marketing plans with sales strategies\nGenerate and review reports on e-commerce performance and activities\nCollaborate with your manager to track the efficiency of the product lifecycle from production to sale\nIdentify and recommend solutions for inventory or campaign issues. \nCollaborate with your manager and cross-functional teams to support data needs", "qualifications": {"required": "Bachelor’s degree in Business, Marketing, Accounting, or equivalent experience\nStrong analytical skills with an understanding of consumer behavior\nProficiency in using reporting tools and software\n1-3 years of experience in generating and running reports in consumer products, particularly in hardware, cookware, or outdoor products, with a focus on big-box clubs or retailers\nExperience in merchandise allocation and inventory management is considered an asset", "preferred": ""}, "skills": ["Sales", "Marketing", "Accounting", "Consumer Behavior", "Reporting", "Inventory Management", "Merchandise Allocation"], "postedDate": "2 weeks ago", "benefits": "The ideal candidate for this position will enjoy a comprehensive benefits package, including 100% employer-paid health premiums, dental and vision coverage, and life insurance. They will also have access to a 401(K) Safe Harbor Plan to support their retirement savings. We value work-life balance and offer generous paid time off for our employees to relax and rejuvenate. We believe in investing in our employees' growth and offer training and development opportunities. Additionally, we foster a positive work environment through engagement activities and events. As a bonus, employees can enjoy various discounts as part of our employee discount program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992014008"}