{"jobTitle": "Director of Medical Staff Services - 229136", "company": {"name": "Medix™", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Health Care Provider, Administrative, and Strategy/Planning", "industry": "Hospitals and Health Care, Public Health, and Medical Practices", "description": "** LOCAL CA APPLICANTS ONLY**\n<br/>\n**Medix** is looking to hire a **Director of Medical Staff Services** to join an acute care non-profit hospital in Los Angeles, 90015.\nDirector of Medical Staff Services will lead a team of Medical Staff Coordinators and ensure the organization meets all regulatory and hospital requirements related to credentialing and privileging of Medical Staff.\n<br/>\n<br/>\n**<u>Responsibilities:</u>**\n<ul><li>Oversee the operations of the Medical Staff Administration office.</li><li>Guide and oversee the MSO Coordinators, facilitate committee meetings, process applications, manage the financial activities, and provide reports to hospital leadership.</li><li>Ensures a high quality medical staff by thoroughly investigating and verifying the credentials of all applicants to the medical staff including Allied Health Professionals.</li><li>Evaluates the hospital practice and privileges of all members seeking reappointment to the medical staff/Allied Health categories.</li><li>Provides a vehicle to improve quality via the medical staff committee process and by maintaining records of all medical staff committees.</li><li>Contributes to efficient and cost-effective operation of the Medical Staff Service by monitoring and planning for budgets and expenses.</li><li>Promotes medical staff compliance with regulatory and accreditation agencies by continuously monitoring the operations of the hospital Medical Staff Office and effectively initiating change when needed.</li></ul><br/>\n**<u>Requirements / Experience:</u>**\n<ul><li>Certified Provider Credentialing Specialist (CPCS)</li><li>Bachelor's degree in business administration or related health or management field preferred or ability to obtain within a period of time agreed upon by supervisor.</li><li>Minimum of five (5) years of experience in a Medical Staff office, with at least one (1) year in a supervisory capacity, or a comparable combination of education and experience.</li></ul><br/>\n**<u>Preferred Qualifications:</u>**\n<ul><li>Spanish bilingual (not required)</li></ul><br/>\n**<u>Schedule: </u>**\n<ul><li>Monday- Friday 8:00- 5:00 pm</li></ul><br/>\n**<u>Starting pay: </u>**\n$140,000 BOE", "responsibilities": "Oversee the operations of the Medical Staff Administration office. Guide and oversee the MSO Coordinators, facilitate committee meetings, process applications, manage the financial activities, and provide reports to hospital leadership. Ensures a high quality medical staff by thoroughly investigating and verifying the credentials of all applicants to the medical staff including Allied Health Professionals. Evaluates the hospital practice and privileges of all members seeking reappointment to the medical staff/Allied Health categories. Provides a vehicle to improve quality via the medical staff committee process and by maintaining records of all medical staff committees. Contributes to efficient and cost-effective operation of the Medical Staff Service by monitoring and planning for budgets and expenses. Promotes medical staff compliance with regulatory and accreditation agencies by continuously monitoring the operations of the hospital Medical Staff Office and effectively initiating change when needed.", "qualifications": {"required": "Certified Provider Credentialing Specialist (CPCS), Bachelor's degree in business administration or related health or management field preferred or ability to obtain within a period of time agreed upon by supervisor, Minimum of five (5) years of experience in a Medical Staff office, with at least one (1) year in a supervisory capacity, or a comparable combination of education and experience.", "preferred": "Spanish bilingual (not required)"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "401(k), Dental insurance, Vision insurance, Medical insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992679879"}