{"jobTitle": "Social Media Coordinator", "company": {"name": "Robinhood", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Financial Services", "description": "Join a leading fintech company that’s democratizing finance for all.<br/><br/>Robinhood Markets was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood and its subsidiaries and affiliates are lowering barriers and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in.<br/><br/>With growth as the top priority...<br/><br/>The business is seeking curious, growth-minded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious future. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.<br/><br/>About the team + role <br/><br/>We are seeking a creative and passionate Social Media Coordinator to join Robinhood’s Brand Marketing team to support Robinhood in creating and managing best in class social content that resonates with our audience and furthers Robinhood’s mission in democratizing for all. The ideal candidate will have a strong understanding of creating content for social media platforms and adapting emerging trends for a brand. As the Social Media Coordinator, you will support the Social Team by managing the day-to-day social content creation, production, scheduling, and community moderation for Robinhood’s owned social media platforms.<br/><br/>The role is located in the office location(s) listed on this job description which will align with our in-office working environment. Please connect with your recruiter for more information regarding our in-office philosophy and expectations.<br/><br/>What You’ll Do<br/><br/><ul><li>Create social content optimized for Robinhood’s social media channels, including X, Instagram, TikTok, LinkedIn and Facebook, to increase engagement, brand awareness, and follower growth among Robinhood’s core audience.</li><li>Craft and schedule engaging social media copy for Robinhood’s owned social media platforms.</li><li>Manage Robinhood’s social content calendar to ensure that Robinhood is tapping into emerging trends and relevant moments in culture, sports, and finance.</li><li>Maintain active presence across Robinhood’s owned social media channels, including moderating comments, and mentions.</li><li>Collaborate with the Creative team to produce quality graphics, memes, and video content.</li><li>Monitor and report all social analytics and use the data to make informed, strategic recommendations for Robinhood’s social content strategy and tactics.<br/><br/></li></ul>What You Bring<br/><br/><ul><li>2-3+ years of proven experience as a social media coordinator with a background in social media management, preferably in sports, entertainment, or finance.</li><li>Proficiency in using social media management and analytics tools (e.g., Meta Business Manager, Sprinklr, X Analytics, LinkedIn Analytics, Sprout Social.</li><li>Strong writing and editing skills, with the ability to craft bold and irreverent social media copy across all social media platforms.</li><li>Ability to work in a fast-paced environment and manage multiple projects simultaneously.</li><li>Knowledge of graphic design and photography is a plus.<br/><br/></li></ul>What We Offer<br/><br/><ul><li>Market competitive and pay equity-focused compensation structure</li><li>100% paid health insurance for employees with 90% coverage for dependents</li><li>Annual lifestyle wallet for personal wellness, learning and development, and more!</li><li>Lifetime maximum benefit for family forming and fertility benefits</li><li>Dedicated mental health support for employees and eligible dependents</li><li>Generous time away including company holidays, paid time off, sick time, parental leave, and more!</li><li>Lively office environment with catered meals, fully stocked kitchens, and geo-specific commuter benefits<br/><br/></li></ul>Base pay for the successful applicant will depend on a variety of job-related factors, which may include education, training, experience, location, business needs, or market demands. The expected salary range for this role is based on the location where the work will be performed and is aligned to one of 3 compensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For other locations not listed, compensation can be discussed with your recruiter during the interview process.<br/><br/>Zone 1 (Menlo Park, CA; New York, NY; Bellevue, WA; Washington, DC)<br/><br/>$128,000—$150,000 USD<br/><br/>Zone 2 (Denver, CO; Westlake, TX; Chicago, IL)<br/><br/>$112,000—$132,000 USD<br/><br/>Zone 3 (Lake Mary, FL)<br/><br/>$99,000—$117,000 USD<br/><br/>Click here to learn more about available Benefits, which vary by region and Robinhood entity.<br/><br/>We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing finance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people invigorated by our mission, values, and drive to change the world, not just those who simply check off all the boxes.<br/><br/>Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants and employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and skills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone. Additionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy rights. Please review the specific Robinhood Privacy Policy applicable to the country where you are applying.", "responsibilities": "<ul><li>Create social content optimized for Robinhood’s social media channels, including X, Instagram, TikTok, LinkedIn and Facebook, to increase engagement, brand awareness, and follower growth among Robinhood’s core audience.</li><li>Craft and schedule engaging social media copy for Robinhood’s owned social media platforms.</li><li>Manage Robinhood’s social content calendar to ensure that Robinhood is tapping into emerging trends and relevant moments in culture, sports, and finance.</li><li>Maintain active presence across Robinhood’s owned social media channels, including moderating comments, and mentions.</li><li>Collaborate with the Creative team to produce quality graphics, memes, and video content.</li><li>Monitor and report all social analytics and use the data to make informed, strategic recommendations for Robinhood’s social content strategy and tactics.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>2-3+ years of proven experience as a social media coordinator with a background in social media management, preferably in sports, entertainment, or finance.</li><li>Proficiency in using social media management and analytics tools (e.g., Meta Business Manager, Sprinklr, X Analytics, LinkedIn Analytics, Sprout Social.</li><li>Strong writing and editing skills, with the ability to craft bold and irreverent social media copy across all social media platforms.</li><li>Ability to work in a fast-paced environment and manage multiple projects simultaneously.</li><li>Knowledge of graphic design and photography is a plus.<br/><br/></li></ul>"}, "skills": ["Social Media", "Social Media Management", "Content Creation", "Social Media Marketing", "Social Media Strategy", "Social Media Analytics", "Content Marketing", "Digital Marketing", "Marketing", "Brand Management", "Community Management", "Copywriting", "Editing", "Graphic Design", "Photography"], "postedDate": "2 weeks ago", "benefits": "<ul><li>Market competitive and pay equity-focused compensation structure</li><li>100% paid health insurance for employees with 90% coverage for dependents</li><li>Annual lifestyle wallet for personal wellness, learning and development, and more!</li><li>Lifetime maximum benefit for family forming and fertility benefits</li><li>Dedicated mental health support for employees and eligible dependents</li><li>Generous time away including company holidays, paid time off, sick time, parental leave, and more!</li><li>Lively office environment with catered meals, fully stocked kitchens, and geo-specific commuter benefits<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992946904"}