{"jobTitle": "Transportation Manager", "company": {"name": "Secure Transportation", "industry": "Shuttles and Special Needs Transportation Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Shuttles and Special Needs Transportation Services", "description": "Key Tasks and Responsibilities\n\n- The hiring, training, management and scheduling of drivers.\n- Assist the Trans. Coordinator in daily scheduling and coordination of transportation.\n- Will check the schedules completed by the Trans. Coordinator for accuracy.\n- Conduct drivers' quarterly meetings and Safety meetings.\n- Quarterly meetings will be held to discuss any issues that have arisen and to complete any retraining with staff that is necessary.\n- Participate in all PACE required meetings including but not limited to IDT, family meetings, staff meetings, in-service training programs, quality improvement meetings, and any sub-groups as needed.\n- Establish a positive rapport with participants, participants family members, and other members of the PACE Care team and its network providers.\n- Address and resolve all participant grievances within the requested timeline.\n- Will conduct Service Recovery Calls to the Participants and the Participants family.\n- Manage staff, preparing work schedules and assigning specific duties.\n- Ensure all transportation staff members are updated on all Secure Transportation & PACE policies and procedures.\n- Interact closely with the senior center staff resolving concerns as they arise.\n- Works cooperatively and professionally with Center staff.\n- Manage and maintain a fleet of lift vans, A.D.A accessible mini buses ambulatory vehicles.\n- Keeps all transportation logs, fuel cards, vehicle maintenance and mileage records.\n- Must complete in an organized manor so records can be pulled upon request.\n- Address and resolve drivers' personnel issues, including disciplinary actions.\n- Utilize the Discussion Log to document any disciplinary actions.\n- Conduct / Monitor drivers' performance evaluations.\n- To be completed annually or as needed due to disciplinary action.\n- Submit and manage all monthly reports.\n- Reports to be updated daily for accuracy.\n- Data entry into a FileMaker based system.\n- Updating pertinent information regarding participants daily. Addresses, Phone Numbers, Notes, etc.\n\nEducation & Training\n- High School graduate.\n- College degree preferred.\n- Commercial driver license with passenger endorsement.\n\nKnowledge and Experience\n- Experience in Senior Care or related human services industry.\n- One year experience with the elderly required.\n- Extensive knowledge of Koreatown and surrounding areas streets, neighborhoods and traffic patterns.\n- Vehicle scheduling and dispatching a plus.\n- Previous supervisory or management experience preferred.\n- Since a majority of our participants will be Korean Speaking we ask that the applicant be fluent in Korean.\n\nCore Competencies\n- Must be a self-starter.\n- Must be able to work unsupervised.\n- Must be able to manage multiple tasks and see them to completion in a timely manner.\n- Must possess good communication skills.\n- Must be computer literate and proficient with Word, Excel and database management software.\n\nWorking Conditions\n- Must be able to work weekends, Holidays and any shift as necessary.\n- Work hours: 07:00 am -17:00 pm with varying shifts.\n- Might be required to drive vehicles as needed.\n- Must be able to travel out of town with overnight when necessary.\n\nPhysical Requirements\n- Be able to push 50lbs and lift 150lbs minimum.\n- Position requires working in a seated position while operating computer, keyboard, mouse, phones and printers and filing of documents.\n- Position may require standing/walking for up to 4 hours.", "responsibilities": "The hiring, training, management and scheduling of drivers. Assist the Trans. Coordinator in daily scheduling and coordination of transportation. Will check the schedules completed by the Trans. Coordinator for accuracy. Conduct drivers' quarterly meetings and Safety meetings. Quarterly meetings will be held to discuss any issues that have arisen and to complete any retraining with staff that is necessary. Participate in all PACE required meetings including but not limited to IDT, family meetings, staff meetings, in-service training programs, quality improvement meetings, and any sub-groups as needed. Establish a positive rapport with participants, participants family members, and other members of the PACE Care team and its network providers. Address and resolve all participant grievances within the requested timeline. Will conduct Service Recovery Calls to the Participants and the Participants family. Manage staff, preparing work schedules and assigning specific duties. Ensure all transportation staff members are updated on all Secure Transportation & PACE policies and procedures. Interact closely with the senior center staff resolving concerns as they arise. Works cooperatively and professionally with Center staff. Manage and maintain a fleet of lift vans, A.D.A accessible mini buses ambulatory vehicles. Keeps all transportation logs, fuel cards, vehicle maintenance and mileage records. Must complete in an organized manor so records can be pulled upon request. Address and resolve drivers' personnel issues, including disciplinary actions. Utilize the Discussion Log to document any disciplinary actions. Conduct / Monitor drivers' performance evaluations. To be completed annually or as needed due to disciplinary action. Submit and manage all monthly reports. Reports to be updated daily for accuracy. Data entry into a FileMaker based system. Updating pertinent information regarding participants daily. Addresses, Phone Numbers, Notes, etc.", "qualifications": {"required": "High School graduate. College degree preferred. Commercial driver license with passenger endorsement.", "preferred": "Experience in Senior Care or related human services industry. One year experience with the elderly required. Extensive knowledge of Koreatown and surrounding areas streets, neighborhoods and traffic patterns. Vehicle scheduling and dispatching a plus. Previous supervisory or management experience preferred. Since a majority of our participants will be Korean Speaking we ask that the applicant be fluent in Korean."}, "skills": ["Management", "Scheduling", "Communication", "Database Management", "Driver Training", "Problem Solving"], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Secure Transportation is an Affirmative Action/EEO employer.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992582385"}