{"jobTitle": "Boutique Operations Specialist", "company": {"name": "Audemars Piguet", "industry": "Retail Luxury Goods and Jewelry", "size": "Not specified", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$35.00 - $39.00", "currency": "USD"}, "jobFunction": "Management", "industry": "Retail Luxury Goods and Jewelry", "description": "The Boutique Operations Specialist contributes to the success of the boutique by providing organizational and administrative support and by executing assigned work within given time frames and in ways that meet the business objectives.", "responsibilities": "Administrative and organizational tasks. Provide secretarial/administrative/back office support to all operations of the Boutique including aftersales (management of invoices, cashier, team planning, etc.). Support the Boutique Manager in all coordination and administrative tasks. Use business software applications (e.g., word processing, spreadsheet, etc.) to prepare correspondence, reports, agendas, etc. Use different tools such as M3 (internal ERP system), Sugar (internal CRM system), etc. Provide operational support and ensure presence to marketing events. Maintain established inventory levels by locating stock in the stockroom and delivering items to the boutique. Ensure that products are easily accessible, visually appealing, and constantly available. Ability to do small interventions (removing of links/straps, etc.) on watches, as needed.", "qualifications": {"required": "5+ years of related experience in administration and retail operations. Comprehensive knowledge of inventory management, client service, administration, and shipping processes. Strong Analytical skills. Proficiency using ERP and CRM systems. Proficient in Microsoft Word and Excel. Ability to multitask and has excellent communication and organization skills. Previous food and beverage knowledge and experience is a plus.", "preferred": ""}, "skills": ["Administrative Support", "Inventory Management", "Client Service", "Analytical Skills", "ERP Systems", "CRM Systems", "Microsoft Word", "Microsoft Excel", "Communication Skills", "Organization Skills"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Audemars Piguet offers a competitive and comprehensive compensation and benefits package.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992792738"}