{"jobTitle": "Fixed Operations Manager-Central California", "company": {"name": "EV.Careers", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,177.00 - 125,051.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "With a focus on Mobility, Operational Excellence, Value to our Customers and the Electrification of vehicles, you can expect to be part of something exciting. From the sleek design of our vehicles to the unique opportunities we offer around the globe, Nissan exemplifies ingenuity in everything we do. Our people are what drive the business forward.'<br/><br/>We're currently looking for a Fixed Operations Manager to join our team in Central California.<br/><br/><strong>Job Functions<br/><br/></strong><ul><li> Conducts routine dealership visits with Sales &amp; Aftersales staff, dealership management and Dealer Principal to assess all aspects of Aftersales operations. Provides consultative coaching and action plans geared towards improving Accessories, Parts, &amp; Service (APS) opportunities. </li><li> Identifies areas of improvement and partners with assigned dealerships to make improvements and take corrective actions to drive Customer Experience and Retention, Dealer Profitability, and Loyalty. </li><li> Customer Experience and Retention</li><li> Assesses accessories, parts and service operations through routine contact and site visits by utilizing the 5 Mindsets approach (Convenience, Quality, Competitiveness, Transparency and Friendliness) to build a consumer value proposition. <br/><br/></li></ul>ii)Coordinates and aligns on Aftersales Core Processes. Actively delivers training and program implementation by recommending NNA supporting tools, technologies and proven service processes (Initiation, Reception, Communication, Delivery, and Follow up).<br/><br/>iii) Works with the Regional Aftersales Manager (RAM) to monitor levels and amount of service staff expertise and training. Actively promote Technician Certification training and supports recognition and achievements.<br/><br/>iv)Reviews and monitors marketing and advertising plans for dealerships and assesses current effectiveness of their efforts. Aligns dealership marketing, CRM, Social, website, eCommerce and BDC platforms with NNA National and Regional marketing initiatives.<br/><br/><ul><li>Recommends, supports and executes the use of NNA tools and technologies, tablets, and marketing platforms. Introduces new marketing programs and techniques. Demonstrates potential positive impact to dealerships' financial statements to achieve dealership \"buy-in\" and support. Routinely reviews APS sales reports demonstrating success or failure of marketing efforts and expenditures. <br/><br/></li></ul>vi)Understands other external consultant's services currently utilized or considered by dealership. Encourages use of Nissan/Infiniti approved parts vendors to improve dealer costs and supply. Demonstrates the business case for Nissan/Infiniti programs and advises on comparisons. Develops advertising and promotion plans to counter negativity resulting from any warranty issues.<br/><br/><ul><li> Dealer Profitability</li><li>Performs dealer financial statement and operational analysis to identify and recommend performance improvement opportunities in the areas of process, throughput, capacity, staffing, facilities, sales effectiveness, marketing, and industry best practices. Utilizes Key Ratio management to align with NNA and industry benchmarks. Implements consultative sales techniques to develop, present, and implement action plans to drive key growth KPI's. <br/><br/></li></ul>ii)Improves sales effectiveness through reviewing relevant NNA and industry benchmark data to uncover sales/profit opportunities in accessories, service lane commodity sales, internal, and wholesale. Identifies and actively develops dealer engagement in Parts, Wholesale and Accessory business.<br/><br/>iii)Routinely reviews APS performance reports with Dealer Principal and functional management regarding APS operations and compliance with company standards and agreements. Monitors cash flow, inventory, and capital as pertains to APS. Questions accuracy and accounting if needed. Assists AGM and dealership management to improve financial strength through increased APS sales and operations. Works with Dealer Principal to establish goals to improve Fixed Absorption Rate and ROS, and identifies plans to achieve them.<br/><br/>iv)Identifies and evaluates human resource issues in dealerships. Assesses staffing levels, competencies and training needs. Advises and assists management with correcting management and staff performance through plans for documentation, feedback, coaching, and training. Identifies causes for high levels of staff turnover and addresses issues with appropriate level of management.<br/><br/><ul><li>Educates and enlightens dealership personnel on current incentive programs for customers, sales associates and dealership. Assists management with implementation and proper applications of programs. Ensures that they comply with rules and requirements for incentive payments. Analyze reports and sales results and demonstrate programs' financial impacts on dealerships to management. <br/><br/></li></ul>vi)Monitors parts inventories and understands dealership tracking systems. Ensures inventory control and levels are efficient to provide timely service for customers. Ensures that service operations are ready to support commercial vehicles, fleet vehicles, electric vehicles and other specialty lines. Supports and encourages NNA Technologies in parts inventory management and sales operations.<br/><br/><ul><li> Loyalty. </li><li>Evaluates and analyzes dealership sell-out and sell-in data and onsite inspections to determine dealership parts loyalty. Identifies roadblocks and develops action plans to improve dealership profitability, sales effectiveness, and client retention through brand loyalty. <br/><br/></li></ul>ii)Coordinates with DTM's and DTM Management on analysis of quality of customer interface and service practices in dealerships' P&amp;S operations. Participates in CSI focused reviews and addresses identified issues with dealerships. Identifies and clones best practices. Develops action plans with dealerships to enhance customer satisfaction. Administers Goodwill decision and authorizations. Monitors staff performance through real time technology tools and customer satisfaction scores. Understands sources of customer complaints and addresses with management.<br/><br/><ul><li>Assists AGM with Market Representation related issues and actions within assigned dealerships as requested. </li><li>Maintains awareness of competing dealerships in assigned market. Assists with analysis of market information and incorporates market expansion opportunities into assigned dealerships to maximize P&amp;S sales. Incorporates impact of newly opened and closed dealerships in assigned district into P&amp;S marketing and sales plans to maximize dealership P&amp;S sales. </li><li>Understands dealer agreements and required performance/policy compliance for dealerships. Supports AGM in documentation and communications on matters of good standing. With support and direction of AGM, may deliver official communications to APS Managers and Dealer principal regarding standing as it may relate to APS operations. Understands \"do's and don'ts\" when dealing with dealership on matters of standing. </li><li>Assists AGM and dealerships with logistics relating to opening and closing of dealership operations. </li><li>Supports dealership, district, region and national efforts by presence and assistance at auto shows and special events promoting brands and sales. <br/><br/></li></ul><strong>Minimum Qualifications And Demonstrated Knowledge, Skills &amp; Abilities<br/><br/></strong>1<strong>. </strong>Education: Bachelor's Degree in Business or related field required.<br/><br/><ul><li> Experience:<br/><br/></li></ul><strong>Sr. Fixed Operations Mgr</strong>: A minimum of 6 years of progressive Marketing and Sales experience for the senior level, including a minimum of 3 years of analytical experience in various specialties of the automotive industry:<br/><br/><strong>Sales Ops<br/><br/></strong>Sales reporting<br/><br/>Distribution<br/><br/>Carflow mix mgmt<br/><br/>Dealer agreements<br/><br/>Mkt Rep<br/><br/>Market Analytics<br/><br/>Customer Satisfaction/Experience<br/><br/>Facilities/Merchandising<br/><br/>Marketing<br/><br/>Pricing<br/><br/>Advertising &amp; Promotions<br/><br/>CMM/ Contests &amp; Incentives<br/><br/>Parts &amp; Service<br/><br/>Consumer Affairs<br/><br/>Warranty<br/><br/>Manufacturing<br/><br/>Prior work may be a combination within a dealership, region, headquarters, or manufacturing facility and may be at the Analyst or Regional Manager level or similar type of position.<br/><br/>At least 2 or more years of experience within a previous dealer contact support role such as WDM, FOM, FSM or DOM role (or equivalent dealer contact) is required for advancement to the senior level.<br/><br/>Previous experience supervising others and previous experience in a sales capacity is desirable.<br/><br/><strong>Fixed Operations Mgr</strong>: A minimum of 4 years of progressive Marketing and Sales experience, including a minimum of 2 years of analytical experience in various specialties of the automotive industry including:<br/><br/>Sales Ops<br/><br/>Sales Reporting<br/><br/>Distribution<br/><br/>Dealer Agreements<br/><br/>Mkt Rep<br/><br/>Market Analytics<br/><br/>Customer Satisfaction/Experience<br/><br/>Facilities/Merchandising<br/><br/>Marketing<br/><br/>Pricing<br/><br/>Advertising &amp; Promotions<br/><br/>CMM/ Contests &amp; Incentives<br/><br/>Parts &amp; Service<br/><br/>Consumer Affairs<br/><br/>Warranty<br/><br/>Prior work may be a combination within a dealership, region, headquarters, or manufacturing facility and may be at the Analyst or Regional Manager level or similar type of position.<br/><br/>Previous experience in a sales capacity is desirable.<br/><br/><strong>Knowledge, Skills And Abilities<br/><br/></strong><ul><li>Working knowledge of word processor, spreadsheet, other PC applications, or mainframe applications to produce non-standard, creative products. Additional knowledge of sales related systems. </li><li>Ability to prioritize own schedules and organize workload effectively with minimal daily supervision. </li><li>Ability to function effectively and remain productive in a virtual office environment</li><li>Ability to focus on the best interests of the dealership and Nissan. Can remain objective in the course of building relationships. </li><li>Dedication to meeting the expectations and requirements of internal and external customers. </li><li>Attentive to others opinions and perspectives. </li><li>Ability to influence the actions of others by building credibility through dealership knowledge, effective recommendations, clear communications, honesty, and demonstrated follow-up on promises. </li><li>Result driven even in the face of resistance or setbacks. </li><li>Ability to present ideas and analysis in an effective manner. <br/><br/></li></ul>Ability to understand the complexities of situations and solicit assistance from others as needed<br/><br/><strong>Travel<br/><br/></strong>More than 75% day and overnight domestic travel.<br/><br/>Position requires residence within assigned district.<br/><br/>Welcome to an open lane of possibility. Drive your career forward and join the company leading the technology and business evolution of the automotive industry by applying today.<br/><br/>Nissan is committed to a drug-free workplace. All employment is contingent upon successful completion of a drug screen for roles based in the United States and background screening for all positions.<br/><br/>All of us at Nissan - regardless of functional area or expertise - share a passion to design, manufacture, and sell high-performance vehicles. It is Nissan's policy to provide Equal Employment Opportunity (EEO) to all persons regardless of race, gender, military status, disability, or any other status protected by law. Candidates for this position must be legally authorized to work in the United States and will be required to provide proof of employment eligibility at the time of hire; Nissan uses E-Verify to validate employment eligibility. **Visa sponsorship for this position is not available at this time.**<br/><br/><strong>NISSAN FOR EVERYONE<br/><br/></strong>People are our most valuable assets, and diversity and inclusion are the key to maximizing the power of each individual member of our team. When everyone belongs, the power of NISSAN is undeniable. Our Corporate Diversity Initiative aims to improve business results by ensuring that our workplace and core businesses meet the unique needs of our employees and customer base.<br/><br/>Nissan is committed to creating a culture where everyone belongs and employees, customers, and partners feel respected, valued, and heard. We have over 10 Business Synergy Teams (BSTs) across the U.S. and Canada that connect employees - with shared characteristics or interests - build allies, and foster a company culture where all employees feel supported and included.<br/><br/>Nissan also values inclusion in all areas of our business as we strive to mirror the diversity of our customer base and the communities where we do business. We are committed to procuring innovative goods and services, retailing our products and communicating from a diverse perspective which will help us continue to offer our customers competitively designed, market-driven products.<br/><br/>Join us as we carry our commitment to diversity and inclusion into the future.<br/><br/>Irvine California United States of America<br/><br/><strong>Salary Range<br/><br/></strong>$75,177.00 - $125,051.00<br/><br/>Salary Range Estimate: Annual Salary: (Minimum to Maximum of Salary Range noted here). This compensation range represents the minimum and maximum base salary rates at Nissan for jobs assigned to this particular grade level. Please note that it is uncommon for an employee to be placed at either end of the range. Rather, an employee's actual base salary generally may fall somewhere in between and reflect the employee's unique skills, work experience, education, work location, and market norms. Additionally, pay may be based on comparisons to the base salary rates of other employees with similar backgrounds working in comparable roles.", "responsibilities": "Conducts routine dealership visits with Sales &amp; Aftersales staff, dealership management and Dealer Principal to assess all aspects of Aftersales operations. Provides consultative coaching and action plans geared towards improving Accessories, Parts, &amp; Service (APS) opportunities. Identifies areas of improvement and partners with assigned dealerships to make improvements and take corrective actions to drive Customer Experience and Retention, Dealer Profitability, and Loyalty. Assesses accessories, parts and service operations through routine contact and site visits by utilizing the 5 Mindsets approach (Convenience, Quality, Competitiveness, Transparency and Friendliness) to build a consumer value proposition. Coordinates and aligns on Aftersales Core Processes. Actively delivers training and program implementation by recommending NNA supporting tools, technologies and proven service processes (Initiation, Reception, Communication, Delivery, and Follow up). Works with the Regional Aftersales Manager (RAM) to monitor levels and amount of service staff expertise and training. Actively promote Technician Certification training and supports recognition and achievements. Reviews and monitors marketing and advertising plans for dealerships and assesses current effectiveness of their efforts. Aligns dealership marketing, CRM, Social, website, eCommerce and BDC platforms with NNA National and Regional marketing initiatives. Recommends, supports and executes the use of NNA tools and technologies, tablets, and marketing platforms. Introduces new marketing programs and techniques. Demonstrates potential positive impact to dealerships' financial statements to achieve dealership \"buy-in\" and support. Routinely reviews APS sales reports demonstrating success or failure of marketing efforts and expenditures. Understands other external consultant's services currently utilized or considered by dealership. Encourages use of Nissan/Infiniti approved parts vendors to improve dealer costs and supply. Demonstrates the business case for Nissan/Infiniti programs and advises on comparisons. Develops advertising and promotion plans to counter negativity resulting from any warranty issues. Performs dealer financial statement and operational analysis to identify and recommend performance improvement opportunities in the areas of process, throughput, capacity, staffing, facilities, sales effectiveness, marketing, and industry best practices. Utilizes Key Ratio management to align with NNA and industry benchmarks. Implements consultative sales techniques to develop, present, and implement action plans to drive key growth KPI's. Improves sales effectiveness through reviewing relevant NNA and industry benchmark data to uncover sales/profit opportunities in accessories, service lane commodity sales, internal, and wholesale. Identifies and actively develops dealer engagement in Parts, Wholesale and Accessory business. Routinely reviews APS performance reports with Dealer Principal and functional management regarding APS operations and compliance with company standards and agreements. Monitors cash flow, inventory, and capital as pertains to APS. Questions accuracy and accounting if needed. Assists AGM and dealership management to improve financial strength through increased APS sales and operations. Works with Dealer Principal to establish goals to improve Fixed Absorption Rate and ROS, and identifies plans to achieve them. Identifies and evaluates human resource issues in dealerships. Assesses staffing levels, competencies and training needs. Advises and assists management with correcting management and staff performance through plans for documentation, feedback, coaching, and training. Identifies causes for high levels of staff turnover and addresses issues with appropriate level of management. Educates and enlightens dealership personnel on current incentive programs for customers, sales associates and dealership. Assists management with implementation and proper applications of programs. Ensures that they comply with rules and requirements for incentive payments. Analyze reports and sales results and demonstrate programs' financial impacts on dealerships to management. Monitors parts inventories and understands dealership tracking systems. Ensures inventory control and levels are efficient to provide timely service for customers. Ensures that service operations are ready to support commercial vehicles, fleet vehicles, electric vehicles and other specialty lines. Supports and encourages NNA Technologies in parts inventory management and sales operations. Evaluates and analyzes dealership sell-out and sell-in data and onsite inspections to determine dealership parts loyalty. Identifies roadblocks and develops action plans to improve dealership profitability, sales effectiveness, and client retention through brand loyalty. Coordinates with DTM's and DTM Management on analysis of quality of customer interface and service practices in dealerships' P&amp;S operations. Participates in CSI focused reviews and addresses identified issues with dealerships. Identifies and clones best practices. Develops action plans with dealerships to enhance customer satisfaction. Administers Goodwill decision and authorizations. Monitors staff performance through real time technology tools and customer satisfaction scores. Understands sources of customer complaints and addresses with management. Assists AGM with Market Representation related issues and actions within assigned dealerships as requested. Maintains awareness of competing dealerships in assigned market. Assists with analysis of market information and incorporates market expansion opportunities into assigned dealerships to maximize P&amp;S sales. Incorporates impact of newly opened and closed dealerships in assigned district into P&amp;S marketing and sales plans to maximize dealership P&amp;S sales. Understands dealer agreements and required performance/policy compliance for dealerships. Supports AGM in documentation and communications on matters of good standing. With support and direction of AGM, may deliver official communications to APS Managers and Dealer principal regarding standing as it may relate to APS operations. Understands \"do's and don'ts\" when dealing with dealership on matters of standing. Assists AGM and dealerships with logistics relating to opening and closing of dealership operations. Supports dealership, district, region and national efforts by presence and assistance at auto shows and special events promoting brands and sales.", "qualifications": {"required": "Education: Bachelor's Degree in Business or related field required.<br/><br/>Experience:<br/><br/>Sr. Fixed Operations Mgr: A minimum of 6 years of progressive Marketing and Sales experience for the senior level, including a minimum of 3 years of analytical experience in various specialties of the automotive industry:<br/><br/>Sales Ops<br/><br/>Sales reporting<br/><br/>Distribution<br/><br/>Carflow mix mgmt<br/><br/>Dealer agreements<br/><br/>Mkt Rep<br/><br/>Market Analytics<br/><br/>Customer Satisfaction/Experience<br/><br/>Facilities/Merchandising<br/><br/>Marketing<br/><br/>Pricing<br/><br/>Advertising &amp; Promotions<br/><br/>CMM/ Contests &amp; Incentives<br/><br/>Parts &amp; Service<br/><br/>Consumer Affairs<br/><br/>Warranty<br/><br/>Manufacturing<br/><br/>Prior work may be a combination within a dealership, region, headquarters, or manufacturing facility and may be at the Analyst or Regional Manager level or similar type of position.<br/><br/>At least 2 or more years of experience within a previous dealer contact support role such as WDM, FOM, FSM or DOM role (or equivalent dealer contact) is required for advancement to the senior level.<br/><br/>Previous experience supervising others and previous experience in a sales capacity is desirable.<br/><br/>Fixed Operations Mgr: A minimum of 4 years of progressive Marketing and Sales experience, including a minimum of 2 years of analytical experience in various specialties of the automotive industry including:<br/><br/>Sales Ops<br/><br/>Sales Reporting<br/><br/>Distribution<br/><br/>Dealer Agreements<br/><br/>Mkt Rep<br/><br/>Market Analytics<br/><br/>Customer Satisfaction/Experience<br/><br/>Facilities/Merchandising<br/><br/>Marketing<br/><br/>Pricing<br/><br/>Advertising &amp; Promotions<br/><br/>CMM/ Contests &amp; Incentives<br/><br/>Parts &amp; Service<br/><br/>Consumer Affairs<br/><br/>Warranty<br/><br/>Prior work may be a combination within a dealership, region, headquarters, or manufacturing facility and may be at the Analyst or Regional Manager level or similar type of position.<br/><br/>Previous experience in a sales capacity is desirable.<br/><br/>Knowledge, Skills And Abilities:<br/><br/>Working knowledge of word processor, spreadsheet, other PC applications, or mainframe applications to produce non-standard, creative products. Additional knowledge of sales related systems. Ability to prioritize own schedules and organize workload effectively with minimal daily supervision. Ability to function effectively and remain productive in a virtual office environment Ability to focus on the best interests of the dealership and Nissan. Can remain objective in the course of building relationships. Dedication to meeting the expectations and requirements of internal and external customers. Attentive to others opinions and perspectives. Ability to influence the actions of others by building credibility through dealership knowledge, effective recommendations, clear communications, honesty, and demonstrated follow-up on promises. Result driven even in the face of resistance or setbacks. Ability to present ideas and analysis in an effective manner. Ability to understand the complexities of situations and solicit assistance from others as needed<br/><br/>Travel:<br/><br/>More than 75% day and overnight domestic travel.<br/><br/>Position requires residence within assigned district.", "preferred": ""}, "skills": ["Sales", "Marketing", "Customer Service", "Management", "Automotive", "Sales Operations", "Customer Experience", "Dealer Management", "Parts", "Service", "Inventory Management", "Training", "Communication", "Analysis", "Financial Analysis", "Problem Solving", "Teamwork", "Leadership", "Relationship Building", "Negotiation", "Presentation Skills", "Microsoft Office", "CRM", "Social Media", "E-commerce", "BDC", "Parts Inventory", "Sell-out", "Sell-in", "Customer Satisfaction", "Goodwill", "Market Representation", "Dealer Agreements", "Logistics", "Auto Shows", "Events", "Business", "Word Processor", "Spreadsheet", "PC Applications", "Mainframe Applications", "Virtual Office Environment"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Nissan is committed to a drug-free workplace. All employment is contingent upon successful completion of a drug screen for roles based in the United States and background screening for all positions.<br/><br/>All of us at Nissan - regardless of functional area or expertise - share a passion to design, manufacture, and sell high-performance vehicles. It is Nissan's policy to provide Equal Employment Opportunity (EEO) to all persons regardless of race, gender, military status, disability, or any other status protected by law. Candidates for this position must be legally authorized to work in the United States and will be required to provide proof of employment eligibility at the time of hire; Nissan uses E-Verify to validate employment eligibility. **Visa sponsorship for this position is not available at this time.**<br/><br/><strong>NISSAN FOR EVERYONE<br/><br/></strong>People are our most valuable assets, and diversity and inclusion are the key to maximizing the power of each individual member of our team. When everyone belongs, the power of NISSAN is undeniable. Our Corporate Diversity Initiative aims to improve business results by ensuring that our workplace and core businesses meet the unique needs of our employees and customer base.<br/><br/>Nissan is committed to creating a culture where everyone belongs and employees, customers, and partners feel respected, valued, and heard. We have over 10 Business Synergy Teams (BSTs) across the U.S. and Canada that connect employees - with shared characteristics or interests - build allies, and foster a company culture where all employees feel supported and included.<br/><br/>Nissan also values inclusion in all areas of our business as we strive to mirror the diversity of our customer base and the communities where we do business. We are committed to procuring innovative goods and services, retailing our products and communicating from a diverse perspective which will help us continue to offer our customers competitively designed, market-driven products.<br/><br/>Join us as we carry our commitment to diversity and inclusion into the future.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992379133"}