{"jobTitle": "Aerie - Store Team Leader (Store Manager)", "company": {"name": "American Eagle Outfitters Inc.", "location": "Manhattan Beach, CA"}, "location": "Manhattan Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "28.27/yr - 47.16/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail, Retail Apparel and Fashion, and IT Services and IT Consulting", "description": "<strong>Job Description<br/><br/></strong><strong>YOUR ROLE<br/><br/></strong>As the full-time Store Team Leader, you are the CEO of your store! You are an entrepreneurial-minded business owner who takes pride in maximizing the daily operations of your store. You are passionate about developing a strong team through effective coaching and training, you are a pro at making tough, strategic decisions to drive your business, you consistently deliver operational excellence and your store is always rocking AEO Brand Standards. Most importantly, you bring your REAL self to work every day!<br/><br/><strong>Your Responsibilities<br/><br/></strong><ul><li>You have a passion for driving results: You're an expert at driving sales by maximizing overall store productivity and building guest loyalty through a best-in-class guest experience. You're entrepreneurial-minded and you create, manage and own your store's business plan to meet KPI goals.</li><li>You're a business innovator: Because you own the controllable elements of your store's P&amp;L, you are skilled at analyzing reporting and daily sales trends to make real-time, innovative business decisions in order to achieve store financial goals.</li><li>You're a people leader: You're passionate about recruiting, hiring and retaining a high-performing team. You're an advocate for your team's development, you encourage your team to pursue internal opportunities, and you always have a succession plan in place to ensure a clear career path for all associates. You take pride in developing store leadership through leadership development training, performance feedback, individual development plans and annual performance reviews.</li><li>You know that teamwork makes the dream work: You champion a culture of teamwork and recognition by establishing and communicating goals, holding your team accountable to brand standards, and celebrating and rewarding outstanding performance daily.</li><li>Your store rocks AEO Brand Standards: You ensure your store consistently maintains AEO Brand Visual Standards by owning all visual and merchandising processes. You are the \"go-to\" when it comes to Floorsets, merchandise adjustments and replenishment and your team always has a clear understanding of their role in keeping the store guest-ready.</li><li>Workforce Management - it's your \"thing\": You know that maximizing your business requires a well thought-out schedule! By evaluating traffic, calendars and payroll reports, you're able to make scheduling adjustments to meet business needs. As a result, payroll is always in check and you're always leveraging your top talent to deliver an impeccable guest experience.</li><li>Integrity is your middle name: You demonstrate integrity when making compensation decisions, you ensure audit and shrink results meet Asset Protection Standards, you follow AEO's policies and procedures, and you do the right thing - always.<br/><br/></li></ul><strong>You'd Be Great For This Role If<br/><br/></strong><ul><li>You love AE and Aerie products!</li><li>You've led functional teams in a retail management role previously - #practicemakesperfect!</li><li>You can multi-task and have attention to detail; priority-setting and time management are your strong suits.</li><li>You know how to lead and develop teams and have a general understanding of employment law.</li><li>You have a track record of effective communication and conflict management.</li><li>Business acumen? You've got it!</li><li>You understand how to analyze reporting to drive sales.</li><li>You have flexible availability - you're available to work when the guest shops!<br/><br/></li></ul><strong>Our Associates Love Aeo Because<br/><br/></strong><ul><li>They work with REAL people - there's nothing like your #AEOFamily.</li><li>They're given opportunities for development, the chance to learn new skills, and are offered great potential for career advancement.</li><li>They receive 40% off product at both AE &amp; Aerie year-round (plus additional seasonal discounts with new Floorsets!)</li><li>They participate in store contests for the chance to win FREE merchandise and other exclusive prizes.<br/><br/></li></ul><strong>About Us<br/><br/></strong>Built on a platform of power, positivity and no photo retouching - inspiring people to love their real selves. Aerie is a fast-growing lifestyle brand offering intimates, apparel, activewear, and swim collections. With the #AerieREAL™ movement, we celebrate our community by advocating for body positivity and the empowerment of all women. As part of our Real Good promise, we create swimsuits, bras, and underwear with materials made from recycled polyester, recycled nylon fabric or sustainably sourced cotton.<br/><br/><em>AEO is an Equal Opportunity Employer and is committed to complying with all federal, state and local equal employment opportunity (\"EEO\") laws. AEO prohibits discrimination against associates and applicants for employment because of the individual's race or color, religion or creed, alienage or citizenship status, sex (including pregnancy), national origin, age, sexual orientation, disability, gender identity or expression, marital or partnership status, domestic violence or stalking victim status, genetic information or predisposing genetic characteristics, military or veteran status, or any other characteristic protected by law. This applies to all AEO activities, including, but not limited to, recruitment, hiring, compensation, assignment, training, promotion, performance evaluation, discipline and discharge. AEO also provides reasonable accommodation of religion and disability in accordance with applicable law.<br/><br/></em><em>For Brand Ambassador and Stock positions, hiring will be based on need, however, applications are accepted on an ongoing basis. For all other store jobs, applications will be accepted until the Apply Before date (if applicable), but may be extended based on applicant volume.<br/><br/></em><strong>Pay/Benefits Information<br/><br/></strong><ul><li>Actual starting pay is determined by various factors, including but not limited to relevant experience and location.</li><li>Subject to eligibility requirements, associates may receive health care benefits (including medical, vision, and dental); wellness benefits; 401(k) retirement benefits; life and disability insurance; employee stock purchase program; paid time off; paid sick leave; and parental leave and benefits.</li><li>Paid Time Off, paid sick leave, and holiday pay vary by job level and type, job location, employment classification (part-time or full-time / exempt or non-exempt), and years of service. For additional information, please click HERE .</li><li>AEO may also provide discretionary bonuses and other incentives at its discretion.<br/><br/></li></ul><strong>JOB INFO <br/><br/></strong>Job Identification 3956<br/><br/>Job Category : Stores<br/><br/>Posting Date : 2024-08-06T18:38:29+00:00<br/><br/>Job Schedule : Full time<br/><br/>Locations : Manhattan Beach, CA, United States", "responsibilities": "You have a passion for driving results: You're an expert at driving sales by maximizing overall store productivity and building guest loyalty through a best-in-class guest experience. You're entrepreneurial-minded and you create, manage and own your store's business plan to meet KPI goals.\nYou're a business innovator: Because you own the controllable elements of your store's P&amp;L, you are skilled at analyzing reporting and daily sales trends to make real-time, innovative business decisions in order to achieve store financial goals.\nYou're a people leader: You're passionate about recruiting, hiring and retaining a high-performing team. You're an advocate for your team's development, you encourage your team to pursue internal opportunities, and you always have a succession plan in place to ensure a clear career path for all associates. You take pride in developing store leadership through leadership development training, performance feedback, individual development plans and annual performance reviews.\nYou know that teamwork makes the dream work: You champion a culture of teamwork and recognition by establishing and communicating goals, holding your team accountable to brand standards, and celebrating and rewarding outstanding performance daily.\nYour store rocks AEO Brand Standards: You ensure your store consistently maintains AEO Brand Visual Standards by owning all visual and merchandising processes. You are the \"go-to\" when it comes to Floorsets, merchandise adjustments and replenishment and your team always has a clear understanding of their role in keeping the store guest-ready.\nWorkforce Management - it's your \"thing\": You know that maximizing your business requires a well thought-out schedule! By evaluating traffic, calendars and payroll reports, you're able to make scheduling adjustments to meet business needs. As a result, payroll is always in check and you're always leveraging your top talent to deliver an impeccable guest experience.\nIntegrity is your middle name: You demonstrate integrity when making compensation decisions, you ensure audit and shrink results meet Asset Protection Standards, you follow AEO's policies and procedures, and you do the right thing - always.", "qualifications": {"required": "You love AE and Aerie products!\nYou've led functional teams in a retail management role previously - #practicemakesperfect!\nYou can multi-task and have attention to detail; priority-setting and time management are your strong suits.\nYou know how to lead and develop teams and have a general understanding of employment law.\nYou have a track record of effective communication and conflict management.\nBusiness acumen? You've got it!\nYou understand how to analyze reporting to drive sales.\nYou have flexible availability - you're available to work when the guest shops!", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "They work with REAL people - there's nothing like your #AEOFamily.\nThey're given opportunities for development, the chance to learn new skills, and are offered great potential for career advancement.\nThey receive 40% off product at both AE &amp; Aerie year-round (plus additional seasonal discounts with new Floorsets!)\nThey participate in store contests for the chance to win FREE merchandise and other exclusive prizes.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992378315"}