{"jobTitle": "Medical Scheduler", "company": {"name": "WelbeHealth", "industry": "Hospitals and Health Care", "size": "51-200 employees", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$21.07 - $25.28", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "The WelbeHealth PACE program helps seniors stay in their homes and communities by providing medical care and community-based services. We provide all-inclusive care for seniors including medical, dental, physical therapy, and much more. Our core values and participant focus lead the way no matter what.", "responsibilities": "Answer incoming phone calls, emails, and contacts as requests come in, and appropriately screen, transfer, resolve and dispose of calls expeditiously while adhering to all process and documentation standards. Review, process, schedule and authorize orders according to department protocols. Ensure that appropriate and timely documentation of all updates, encounters, and communication is documented in source systems as outlined by department protocols. Effectively coordinate the scheduling of participants’ appointments, including trouble-shooting conflicts or urgent needs, communicating with all stakeholders (staff, family, providers, etc.), and meeting appointment turn-around times as outlined in WelbeHealth Appointment Scheduling Protocol. Provide eligibility status and benefit information for participants. Address both participant and provider inquiries (Including authorization status and requirements) and if unable to resolve, escalate as appropriate.", "qualifications": {"required": "High School Diploma or Equivalency required. Bilingual in English and other language (Tagalog, Spanish, Chinese, Armenian, Russian, etc) required. Minimum of one (1) year of experience working in a call center environment where a service/support role was primarily performed. Must be flexible with work hours. Excellent organizational and communication experience.", "preferred": ""}, "skills": ["Bilingual", "Customer Service", "Scheduling", "Documentation", "Communication"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Medical insurance coverage (Medical, Dental, Vision). Work/life balance – we mean it! 17 days of personal time off (PTO), 12 holidays observed annually, sick time. Advancement opportunities - We’ve got a track record of hiring and promoting from within, meaning you can create your own path!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992932457"}