{"jobTitle": "Regional Director of Sales", "company": {"name": "Spiceology", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales and Business Development", "industry": "Food & Beverages", "description": "Spiceology is the fastest-growing spice company in the US and was recently named to both the Inc 5000 and Entrepreneur 360 fastest growing company lists. We market and sell over 300 innovative blends and spices to both consumers and chefs, with a primary emphasis on growing market share in the B2B segment.<br/><br/><strong>Job Description<br/><br/></strong>The Regional Director of Sales - West is a critical component of Spiceology. As the Regional Director of Sales, you will be responsible for building and maintaining B2B customer relationships with distribution partners, brokers, and key accounts. This position is responsible for onboarding and managing partners to distribute and/or advocate for the sales of Spiceology products. Most importantly, you will be a driving force to growing our customer and partner base by selling our value proposition of quality, variety and beautifying their shelves with our Periodic Table of Flavor packaging. The candidate must be based on the West Coast within close proximity to a major airport.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Oversee the daily and long-term operations of Brokers, Regional Distributors and Broadline Distributors</li><li>Set clear KPIs with Regional Brokers and Regional Distributors</li><li>Work closely with the VP of Foodservice, Brokers and Distributors, to determine prospective accounts, creating individualized offerings and pitches to close accounts</li><li>Clearly and effectively communicate the benefits of Spiceology products to potential partners</li><li>Maintain an active distribution pipeline in Hubspot to fill out distribution needs in your region. Prioritize contacts and deals and clearly communicate sales status to the management of top accounts</li><li>Represent Spiceology at conferences, trade shows, and industry events, as needed</li><li>Liaise with Spiceology Client Success Managers, Marketing and Spice Ops teams to ensure customer growth and satisfaction</li><li>Recruits, hires and trains staff members; fosters a successful, positive team environment, and promoting the culture of Spiceology<br/><br/></li></ul><strong>Education/Experience<br/><br/></strong><ul><li>7+ years of experience in sales, working with food manufacturer in a sales role.</li><li>7+ years experience leading, mentoring, and developing a broker sales team to achieve sales goals.</li><li>Excellent and highly professional written and verbal communication skills</li><li>Excellent organizational, analytical and time management skills</li><li>Entrepreneurial spirit and strong work ethic; driven to contribute to team efforts and goals<br/><br/></li></ul><strong>Knowledge, Skills, And Abilities<br/><br/></strong><ul><li>Able to work independently, initiate their own projects as needed to streamline their workload, understand the business process and work in a team environment</li><li>Capacity to manage multiple projects with tight deadlines; working necessary hours to meet proposal and project deadlines, if needed</li><li>Ability to exercise effective judgment, sensitivity, and creativity to changing needs and situations</li><li>Ability to lead a team of diverse remote employees across multiple geographic regions </li><li>Excellent phone and face-to-face sales skills with the ability to clearly communicate our value proposition and handle objections</li><li>A desire to continually learn about Spiceology, our industry and our goals as a company</li><li>Ability to travel if needed and comply with the company’s travel policy<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>Salary Range (including commissions): $100K-$120K</li><li>Benefits: Medical, dental, vision, group life, 401(k)</li></ul>", "responsibilities": "Oversee the daily and long-term operations of Brokers, Regional Distributors and Broadline Distributors\nSet clear KPIs with Regional Brokers and Regional Distributors\nWork closely with the VP of Foodservice, Brokers and Distributors, to determine prospective accounts, creating individualized offerings and pitches to close accounts\nClearly and effectively communicate the benefits of Spiceology products to potential partners\nMaintain an active distribution pipeline in Hubspot to fill out distribution needs in your region. Prioritize contacts and deals and clearly communicate sales status to the management of top accounts\nRepresent Spiceology at conferences, trade shows, and industry events, as needed\nLiaise with Spiceology Client Success Managers, Marketing and Spice Ops teams to ensure customer growth and satisfaction\nRecruits, hires and trains staff members; fosters a successful, positive team environment, and promoting the culture of Spiceology", "qualifications": {"required": "7+ years of experience in sales, working with food manufacturer in a sales role.\n7+ years experience leading, mentoring, and developing a broker sales team to achieve sales goals.\nExcellent and highly professional written and verbal communication skills\nExcellent organizational, analytical and time management skills\nEntrepreneurial spirit and strong work ethic; driven to contribute to team efforts and goals"}, "skills": ["Sales", "Food Manufacturing", "Sales Management", "Broker Management", "Sales Operations", "Customer Relationship Management (CRM)", "Sales Strategy", "Business Development", "Key Account Management", "Team Leadership", "Communication", "Time Management", "Organizational Skills", "Analytical Skills", "Entrepreneurial Skills", "Work Ethic"], "postedDate": "2 weeks ago", "salary": {"amount": "$100K-$120K", "currency": "USD"}, "benefits": "Medical, dental, vision, group life, 401(k)", "url": "https://www.linkedin.com/jobs/view/3992724340"}