{"jobTitle": "Warehouse Picker Order Selector", "company": {"name": "Keurig Dr Pepper Inc.", "location": "Los Angeles, CA", "industry": "Food and Beverage Services"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$18.10", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "Job Overview\n\nWarehouse Picker Order Selector - Los Angeles, CA\n\nAbout The Role\n\n* Accurately pick products by matching numbers and products using voice audio headset. \n* Hand stack cases of product weighing up to 50 pounds repetitively from floor to over-head.\n* Place the beverage products in a defined stacking pattern onto the pallet.\n* Hand shrink wrap orders with label and move completed order to the loading dock area using electronic pallet jack or walkie-rider equipment.\n\nShift and Schedule: \n\n* Full-time\n* Monday- Friday\n* 11 AM - finished\n* Flexibility to work overtime and weekend as needed is required \n\nAbout You\n\nWe are looking for a self-motivated and team-oriented individual who enjoys working in a fast-paced environment. You enjoy staying active and are excited to spend the majority of your shift lifting, pushing, and pulling cases of our products. Please apply now if you are the person we’re searching for!\n\nThis position could utilize the following equipment: Electronic Pallet Jack - Walkie Rider - Voice Audio Headset - Shrink Wrap\n\nThis position could include: Hand Stacking - EPJ - Pallet Jacks - Voice Audio - Headsets - Picking - Picker - Order - Order Selecting - Pallets\n\nTotal Rewards\n\n* $18.10 per hour\n* Benefits, subject to eligibility, and collective bargaining agreements: Medical, Dental, Vision, Disability, Paid Time Off (including vacation and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement\n\nRequirements\n\n* Ability to work while standing, pushing, pulling, bending, twisting, kneeling and lifting for the entire duration of the shift.\n* Ability to lift up to 50 lbs. throughout the entire shift from floor to over-head.\n* Ability to work while using a headset, voice-activated, order selector picking system.\n* Ability to hand shrink wrap pallets of completed orders.\n* Ability to work in multi-temperature environments, hot or cool.\n\nCompany Overview\n\nKeurig Dr Pepper (NASDAQ: KDP) is a leading beverage company in North America, with a portfolio of more than 125 owned, licensed and partners brands and powerful distribution capabilities to provide a beverage for every need, anytime, anywhere. We operate with a differentiated business model and world-class brand portfolio, powered by a talented and engaged team that is anchored in our values. We work with big, exciting beverage brands and the #1 single-serve coffee brewing system in North America at KDP, and we have fun doing it!\n\nTogether, we have built a leading beverage company in North America offering hot and cold beverages together at scale. Whatever your area of expertise, at KDP you can be a part of a team that’s proud of its brands, partnerships, innovation, and growth. Will you join us?\n\nWe strive to be an employer of choice, providing a culture and opportunities that empower our team of ~28,000 employees to grow and develop. We offer robust benefits to support your health and wellness as well as your personal and financial well-being. We also provide employee programs designed to enhance your professional growth and development, while ensuring you feel valued, inspired and appreciated at work.\n\nKeurig Dr Pepper is an equal opportunity employer and affirmatively seeks diversity in its workforce. Keurig Dr Pepper recruits qualified applicants and advances in employment its employees without regard to race, color, religion, gender, sexual orientation, gender identity, gender expression, age, disability or association with a person with a disability, medical condition, genetic information, ethnic or national origin, marital status, veteran status, or any other status protected by law.", "responsibilities": "* Accurately pick products by matching numbers and products using voice audio headset. \n* Hand stack cases of product weighing up to 50 pounds repetitively from floor to over-head.\n* Place the beverage products in a defined stacking pattern onto the pallet.\n* Hand shrink wrap orders with label and move completed order to the loading dock area using electronic pallet jack or walkie-rider equipment.", "qualifications": {"required": "Ability to work while standing, pushing, pulling, bending, twisting, kneeling and lifting for the entire duration of the shift.\nAbility to lift up to 50 lbs. throughout the entire shift from floor to over-head.\nAbility to work while using a headset, voice-activated, order selector picking system.\nAbility to hand shrink wrap pallets of completed orders.\nAbility to work in multi-temperature environments, hot or cool."}, "skills": ["Voice Audio", "Headsets", "Picking", "Picker", "Order", "Order Selecting", "Pallets", "Electronic Pallet Jack", "Walkie Rider", "Shrink Wrap", "Hand Stacking", "EPJ", "Pallet Jacks"], "postedDate": "2 weeks ago", "benefits": "Benefits, subject to eligibility, and collective bargaining agreements: Medical, Dental, Vision, Disability, Paid Time Off (including vacation and sick time), 401k with company match, Tuition Reimbursement, and Mileage Reimbursement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992917434"}