{"jobTitle": "Merchandising Manager, Glendale Galleria", "company": {"name": "Ann Taylor", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "Ann Taylor embodies and celebrates the spirit, heritage, and confidence of American women leading the lives they love. Since its beginnings, Ann Taylor has been committed to providing women with everything they need to feel inspired and motivated as they navigate their multifaceted lives. Our effortlessly polished styles are thoughtfully designed to go anywhere—from the office to special occasions (and everywhere in between).\n\nDiscover a culture centered on empowering employees, with access to industry leaders and tools you need to expand your skills and stretch your abilities. We'll meet you at every milestone with opportunities and benefits to make life better in and outside of work (not to mention your closet). Ready to join us?\n\nAbout The Role\n\nAs a Merchandising Manager, you are a key team member who brings our brand to life for customers and creates meaningful experiences. You will bring your attention to detail to the sales floor each day to keep our stores looking beautiful and operating seamlessly. In partnership with the Store Manager, you’ll manage a team of associates to deliver on the brand's performance goals. You'll enhance the customer experience with our brand standards as your guide.\n\nThe impact you can have\n\nIn This Role, You'll Have The Opportunity To\n\n<ul><li>Cultivate a customer-focused environment that consistently delivers exceptional customer experiences.</li><li>Use technology to provide customers with a seamless omnichannel shopping experience.</li><li>Create an inclusive store environment for associates where everyone feels welcome and engaged.</li><li>Make merchandise and product placement updates on the sales floor in line with brand standards.</li><li>Process freight shipments and oversee inventory management.</li><li>Use reporting to make effective merchandising and styling decisions.</li><li>Coach associates on brand behaviors to assist, inspire, and style the customer.</li><li>Communicate daily priorities and assign responsibilities to associates.</li><li>Develop a strong operational dynamic within the team by maximizing brand behaviors.</li><li>Analyze reporting to develop goals for individual and team performance.</li><li>Balance selling responsibilities and overall store operational activities.<br/><br/></li></ul>You'll bring to the role\n\n<ul><li>1+ year retail management experience (preferred)</li><li>Brings a hospitality mindset when connecting with customers and associates</li><li>Strong leadership, interpersonal, and communication skills</li><li>Ability to organize, delegate, and prioritize assignments to meet deadlines</li><li>Takes initiative in making thoughtful decisions and uses sound judgment to solve problems</li><li>Knowledgeable about visual standards and techniques with an ability to implement within brand guidelines<br/><br/></li></ul>Benefits\n\n<ul><li>Merchandise discount across our brands: 50% off regular-priced merchandise at Ann Taylor and LOFT, plus you may also be eligible for discounts at other KnitWell Group brands</li><li>Support for your individual development plus opportunity for growth within our family of brands</li><li>A culture of giving back – opportunities to support our philanthropic partners that benefit local communities*</li><li>Medical, dental, vision insurance &amp; 401(k)*</li><li>Time off – paid time off and holidays*</li><li>Incentive Reward Program*</li><li>Job offers will consider factors such your qualifications, relevant experience, and skills. Eligibility of certain benefits and associate programs are subject to employment type and role.<br/><br/></li></ul>Location:\n\nStore N2566-Glendale Galleria-ANN-Glendale, CA 91210<br/><br/>Position Type\n\nRegular/Full time<br/><br/>Equal Employment Opportunity\n\nThe Company is committed to hiring and developing the most qualified people at all levels. It is our policy in all employment decisions to ensure that all associates and potential associates are evaluated on the basis of qualifications and ability without regard to sex (including pregnancy), race, color, national origin, religion, age, disability that can reasonably be accommodated without undue hardship, genetic information, military status, sexual orientation, gender identity, or any other protected classification under applicable law. We do not discriminate in any of our employment policies and practices. All associates are expected to follow these principles in all relationships with other associates, applicants, or others with whom we do business.\n\nThe Company welcomes applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the application process.\n\nCalifornia Pay Information: https://knitwellgroup.com/assets/CA-Posting-Ann-Taylor.pdf", "responsibilities": "As a Merchandising Manager, you are a key team member who brings our brand to life for customers and creates meaningful experiences. You will bring your attention to detail to the sales floor each day to keep our stores looking beautiful and operating seamlessly. In partnership with the Store Manager, you’ll manage a team of associates to deliver on the brand's performance goals. You'll enhance the customer experience with our brand standards as your guide.", "qualifications": {"required": "1+ year retail management experience (preferred), Brings a hospitality mindset when connecting with customers and associates, Strong leadership, interpersonal, and communication skills, Ability to organize, delegate, and prioritize assignments to meet deadlines, Takes initiative in making thoughtful decisions and uses sound judgment to solve problems, Knowledgeable about visual standards and techniques with an ability to implement within brand guidelines"}, "skills": ["Retail Management", "Customer Service", "Leadership", "Communication", "Merchandising"], "postedDate": "2 weeks ago", "benefits": "Merchandise discount across our brands: 50% off regular-priced merchandise at Ann Taylor and LOFT, plus you may also be eligible for discounts at other KnitWell Group brands, Support for your individual development plus opportunity for growth within our family of brands, A culture of giving back – opportunities to support our philanthropic partners that benefit local communities*, Medical, dental, vision insurance &amp; 401(k)*, Time off – paid time off and holidays*, Incentive Reward Program*", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992378261"}