{"jobTitle": "Receptionist & Assistant", "company": {"name": "Irvine Company", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "21.39/hr - 27.98/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Leasing Non-residential Real Estate, Real Estate, and Hospitality", "description": "<strong>Position Summary<br/><br/></strong>Assists the Retail Division, Executive Assistant and all other employees in all aspects of their responsibilities, and works as part of an administrative support team to the Division. Interfaces with tenants, customers, clients and internal departments with the utmost accuracy and professionalism. Performs a variety of administrative, general office and clerical activities to ensure complete support of all efforts/activities of the division in this front-facing role.<br/><br/><strong>Job Duties<br/><br/></strong><ul><li>Answer, screen and route all incoming calls to the appropriate department or employee </li><li>Greet and direct all visitors to their destination</li><li>Open and close the lobby</li><li>Conference room calendars, FedEx label creation, arrange messenger services, order supplies, printing as needed</li><li>Supports direct report with tasks</li><li>Assist tenants/any other individual who comes into our building where applicable</li><li>Distribute incoming deliveries to employees</li><li>Create reception break coverage schedules</li><li>Maintain several email distribution lists / update and email rosters as needed to all IC Retail employees</li><li>Maintain conference rooms and assist with IT set up where needed/contacting IT</li><li>Respond to all incoming emails/requests for assistance (i.e. Office Services requests, lunches, movie tickets, distributing info with car wash service, drycleaning service info,etc.)</li><li>Provide general administrative support, arrange meetings, coordinate scheduling and ensure all materials are produced within established time frames with high quality standards for the team. </li><li>Prepare required reports, notices and correspondence.</li><li>Establish, maintain and update record keeping and filing systems.</li><li>Maintain, adjust and confirm master calendar for team members as requested. Coordinate travel plans (where appropriate).</li><li>Ensure kitchens and other areas are well stocked and appropriately maintained.</li><li>Miscellaneous projects and other duties and tasks as assigned which include providing administrative support to Retail and HR as needed</li><li>Other duties as assigned <br/><br/></li></ul><strong>Various Tasks Assigned<br/><br/></strong><ul><li>HR Contacts and instructions for orientation days (what to expect), bringing back new hires for orientation. The HR hotline and incoming calls/emails.</li><li>HR Enrichment classes. What to expect and how to handle it</li><li>HR confidential meetings with HR associates; What to expect and how to handle it.</li><li>Helping out with Vendors who come in to service machines in Retail, setting up service calls, stocking supplies, etc. <br/><br/></li></ul><strong>Minimum Qualifications / Other Expectations<br/><br/></strong><strong>Education &amp; Experience: <br/><br/></strong><ul><li> Bachelor’s degree preferred</li><li> Two years prior customer service experience <br/><br/></li></ul><strong>Other<br/><br/></strong><ul><li>Proficiency with computer programs in Google Suite (Gmail, Calendar, Docs, Sheets)</li><li>Excellent communication and interpersonal skills with courteous, professional and calm demeanor</li><li>Excellent/High Quality customer service focus</li><li>Must be self-starter with ability to work independently with little or no supervision</li><li>Ability to communicate clearly and effectively in English, both verbally and in writing</li><li>Detail-oriented, organized, managing multiple tasks concurrently</li><li>Demonstrate initiative, personal awareness, respectful behavior and integrity</li><li>Excellent time management and prioritizing skills</li><li>High level of confidentiality</li><li>Able to take direction well and remain flexible when tasks and directions change</li><li>Ability to exercise good business judgment on costs, managing tasks, etc.</li><li>Team oriented <br/><br/></li></ul><strong>Compensation<br/><br/></strong>Base Pay Range: $24.71 - $32.21<br/><br/>Actual placement within this range may vary based upon, but not limited to, relevant experience, time in role, base salary of internal peers, prior performance, business sector, and geographic location.<br/><br/>The Company also offers competitive benefits for full time employees including paid time off, matching 401(k), and health benefits.<br/><br/><strong>About Us<br/><br/></strong>Irvine Company Retail Properties (a division of Irvine Company) has created some of America’s most popular retail centers. Each of our 40 retail centers - including Fashion Island in Newport Beach, Irvine Spectrum Center and The Market Place, as well as neighborhood shopping centers like Woodbury Town Center in Irvine - is meticulously planned and ideally located to support the community it serves.<br/><br/>We take as much pride in our employee community as we do the communities we create. It’s an environment populated with talented and experienced people, a collaborative spirit and abundant opportunities.<br/><br/>Apply today to join our employee community, and learn more about Irvine Company, our legacy and our guiding principles.<br/><br/>The Irvine Company is committed to providing equal opportunity in all of our employment practices, including selection, hiring, promotion, transfer, compensation, termination, and training, without regard to race, religion, color, sex, sexual orientation, gender, gender identity, national origin, ancestry, citizenship status, marital status, pregnancy, age, medical condition, genetic information, military and veteran status, disability, or any other basis protected by federal, state, and local law. Reasonable accommodation is available for qualified individuals with disabilities, upon request.<br/><br/>", "responsibilities": "Assists the Retail Division, Executive Assistant and all other employees in all aspects of their responsibilities, and works as part of an administrative support team to the Division. Interfaces with tenants, customers, clients and internal departments with the utmost accuracy and professionalism. Performs a variety of administrative, general office and clerical activities to ensure complete support of all efforts/activities of the division in this front-facing role.", "qualifications": {"required": "Proficiency with computer programs in Google Suite (Gmail, Calendar, Docs, Sheets), Excellent communication and interpersonal skills with courteous, professional and calm demeanor, Excellent/High Quality customer service focus, Must be self-starter with ability to work independently with little or no supervision, Ability to communicate clearly and effectively in English, both verbally and in writing, Detail-oriented, organized, managing multiple tasks concurrently, Demonstrate initiative, personal awareness, respectful behavior and integrity, Excellent time management and prioritizing skills, High level of confidentiality, Able to take direction well and remain flexible when tasks and directions change, Ability to exercise good business judgment on costs, managing tasks, etc., Team oriented", "preferred": "Bachelor’s degree"}, "skills": ["Google Suite", "Customer Service", "Communication", "Time Management", "Organization"], "postedDate": "2 weeks ago", "benefits": "The Company also offers competitive benefits for full time employees including paid time off, matching 401(k), and health benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992222856"}