{"jobTitle": "Senior FP&A Analyst/Associate-Leading Global Real Estate Leader!", "company": {"name": "Recruiting Resources, Inc.", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Finance and Analyst", "industry": "Real Estate", "description": "Reputable, leading global real estate firm experiencing impressive growth is looking for an Associate/Senior FP&A Analyst in their corporate Los Angeles offices.\n\n**Hybrid 3 days/week in office**\n\n**$115-$130k + 15% bonus**\n\n<br/>\nThe Associate will play a vital role in the Financial Planning & Analysis team by managing Analysts and performing various analytical duties associated with operating a large portfolio of properties.\n\n<br/>\nThe role involves analyzing operational and financial data to support asset managers in improving performance as well as performing the responsibilities for the benefit of various stakeholders including various departments and executive leadership.\n\n<br/>\nResponsibilities include:\n<ul><li>Gather, analyze, and interpret financial and operational data to provide critical insights on trends and variances and identify opportunities to improve performance.</li><li>Complete deep-dive property assessment reports for at-risk assets not meeting budget and/or operational expectations.</li><li>Prepare monthly, quarterly, and ad hoc financial reports for executive leadership including presenting financial data and analysis clearly and concisely.</li><li>Prepare annual budgeting and forecasting, including coordinating with asset managers, department heads, operators, and other key stakeholders to gather relevant data and assumptions.</li><li>Assist in preparing the quarterly board book: coordinate and work across departments on high profile deliverable presented to senior leadership team at the quarterly board meeting.</li><li>Develop and maintain complex corporate-level financial models to provide multi-year visibility into financial performance.</li><li>Work with IT and other stakeholders to automate manual reporting, work on software implementation, and create interactive business intelligence tools and dashboards.</li><li>Utilize third-party data to monitor and analyze market and industry trends.</li><li>Support development of Analysts through mentorship and training.</li></ul><br/>\n\nQualifications\n<ul><li>Bachelor’s degree in Business, Finance, or Accounting.</li><li>A minimum of 3-6 years of work experience in FP&A and/or financial reporting within a commercial real estate firm.</li><li>A strong work ethic, the strength to thrive in a dynamic and demanding work environment, and an ability to meet critical deadlines.</li><li>Intelligence with a keen focus on details (e.g. ability to review team members’ work to ensure accuracy and consistency).</li><li>Excellence with Excel and PowerPoint: efficient database sourcing, utilization of standard Excel functions (sumif/s, sumproduct, index/match, indirect, pivot tables, data tables, filters, and keyboard shortcuts) to aggregate and summarize data, creation of graphs in proper context of data presented, use of best practices for insuring data integrity, design of executive/board level presentation quality outputs.</li><li>Excellent oral and written communication skills since interaction with personnel at all levels will be required.</li></ul><p></p>", "responsibilities": "Gather, analyze, and interpret financial and operational data to provide critical insights on trends and variances and identify opportunities to improve performance. Complete deep-dive property assessment reports for at-risk assets not meeting budget and/or operational expectations. Prepare monthly, quarterly, and ad hoc financial reports for executive leadership including presenting financial data and analysis clearly and concisely. Prepare annual budgeting and forecasting, including coordinating with asset managers, department heads, operators, and other key stakeholders to gather relevant data and assumptions. Assist in preparing the quarterly board book: coordinate and work across departments on high profile deliverable presented to senior leadership team at the quarterly board meeting. Develop and maintain complex corporate-level financial models to provide multi-year visibility into financial performance. Work with IT and other stakeholders to automate manual reporting, work on software implementation, and create interactive business intelligence tools and dashboards. Utilize third-party data to monitor and analyze market and industry trends. Support development of Analysts through mentorship and training.", "qualifications": {"required": "Bachelor’s degree in Business, Finance, or Accounting. A minimum of 3-6 years of work experience in FP&A and/or financial reporting within a commercial real estate firm. A strong work ethic, the strength to thrive in a dynamic and demanding work environment, and an ability to meet critical deadlines. Intelligence with a keen focus on details (e.g. ability to review team members’ work to ensure accuracy and consistency). Excellence with Excel and PowerPoint: efficient database sourcing, utilization of standard Excel functions (sumif/s, sumproduct, index/match, indirect, pivot tables, data tables, filters, and keyboard shortcuts) to aggregate and summarize data, creation of graphs in proper context of data presented, use of best practices for insuring data integrity, design of executive/board level presentation quality outputs. Excellent oral and written communication skills since interaction with personnel at all levels will be required."}, "skills": ["Financial Planning & Analysis", "Financial Reporting", "Commercial Real Estate", "Excel", "PowerPoint", "Data Analysis", "Budgeting", "Forecasting", "Financial Modeling", "Business Intelligence", "Market Analysis", "Communication", "Teamwork"], "postedDate": "5 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid paternity leave, Tuition assistance, Paid maternity leave, Child care support, Student loan assistance, Commuter benefits, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992236469"}