{"jobTitle": "Brand & Product Director", "company": {"name": "SCORE Sports", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "150,000.00/yr - 200,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Manufacturing", "description": "<strong>About SCORE Sports</strong><br/>Founded in 1975, SCORE has been a grassroots partner with club sports, working at the national, state, and local levels to provide uniforms and equipment for youth sports. While we have historically focused on soccer, SCORE now provides uniforms and equipment across a range of sports including flag football, basketball, volleyball, baseball, and more. SCORE has manufacturing facilities in North America, enabling us to provide custom uniforms faster and with exceptional quality. Join the SCORE team and help us continue our mission to support the next generation of athlete!<br/><strong>About the Position</strong><br/>The Brand &amp; Product Director will lead Score’s business strategy and ensure delivery through effective go to market campaigns, innovation strategy and best-in-class execution. This individual will have full P&amp;L responsibility to achieve targeted financials.<br/><strong>About You</strong><br/><ul><li>7+ years marketing experience specifically in Brand Management with P&amp;L responsibility.</li><li>Product development experience.</li><li>Experience managing a consumer product.</li><li>Expert level knowledge of marketing principles, practices and procedures.</li><li>Strong analytical abilities.</li><li>Ability to lead and manage a marketing team.</li><li>MBA Preferred</li></ul><br/><strong>Key Responsibilities</strong><br/><ul><li>Responsible for the development of comprehensive business plans to drive sales and drives the execution of annual marketing plans and go-to-market plans.</li><li>Responsible for product development lifecycle.</li><li>Oversees brand communication and ensures execution across all platforms (digital, tradeshows etc)</li><li>Provides concept direction and approves all brand positioning and messaging</li><li>Leads the forecasting process of new launches and promotions in conjunction with sales and finance.</li><li>Provide market and financial analysis to guide decision-making.</li><li>Occasional travel required</li></ul><br/><strong>Pay &amp; Benefits</strong><br/>Score Sports offers competitive pay and benefits. Benefits include medical, dental, vision, life insurance and 401K.<br/>Salary range is $150,000 - $200,000 depending on experience.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3992376545"}