{"jobTitle": "Supply Chain Technology Manager (Oracle WMS)", "company": {"name": "Prosum", "industry": "Industrial Machinery Manufacturing", "size": "Not specified", "location": "Redlands, CA"}, "location": "Redlands, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$145,000-165,000", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Industrial Machinery Manufacturing", "description": "FULL TIME EMPLOYMENT: H1B okay as long as over 2 years left on visa\n\nSalary Range (Manager): $145,000-165,000\nSalary Range (Sr. Analyst): $130,000-150,000\n\nLOCATION is Redlands, California, 92374\n\nRelocation Package available\n\nDue to the nature of the role, this is an onsite position and hours are 7am-3:30pm. Basically after 3:00pm the Distribution Center is empty as all the products have been shipped out for the day.\n\nTechnical Manager to manage the system and process (not people) and they are open to someone a little less experience as a Senior Analyst\n\nThey will be working with the distribution center and warehouse managers to make sure the Oracle WMS is running smoothly.\n\nOracle WMS experience – 8 plus years\nDistribution Centers experience\n4 year degree with Masters preferred.\nWork with Warehouse Team on standards and policies around the Oracle WMS.\nDevelop process and system improvements, including Distribution Center operating systems.\nCreate reports of DC systems usage and identify trends and issues.\nCoordinate system upgrades with IT Team (Van Nuys).\n\nThe Oracle WMS & Supply Chain Technology Manager is responsible for managing client's systems and processes, as well as all distribution center systems application integration and application support projects. This role will focus on ensuring client's DC systems and processes are performing optimally developing and measuring KPIs for each Distribution Center, ensuring timely completion of project milestones, and providing user support as DC System issues surface.", "responsibilities": "Ensure standards, processes, and policies are followed to enable integrity and quality of solution delivery. Develop and support safe and optimal Global DC Operational processes and systems, to eliminate waste and manual efforts across Receiving, Putaway, Picking, and Outbound Logistics functions. Support and conduct regular reviews of all DC Operational systems and activities covering methods, procedures, and efficiencies to ensure continuous improvement. Report and monitor DC Systems usage and productivity, identifying issues, and trends and providing results to DC Management accordingly. Establish and maintain DC Quality Management Systems (i.e. Lot Control, Expiry, Status Control, etc.) for all food and non-food-based processes. Coordinate DC systems/WMS upgrades along with internal and external IT resources. Develop and deploy DC system and process SOPs, with regular audits and version control for each SOP. Provide direction to all DC Management and staff on process improvement and system training. Communicate with multiple levels within the organization – from brainstorming with individual business system analysts to discussing actionable strategy with leadership. Partner with IT and Operations Senior Leaders on DC process and system change management. Work with senior leadership to manage demand, capacity, and budgets. Collaborate with vendors, local teams, offshore teams, and other teams within Munchkin’s matrix to meet operational and strategic goals. Other duties may be assigned.", "qualifications": {"required": "Bachelor's degree in IT, Supply Chain, Engineering, Computer Science, or equivalent experience (required), Master’s degree is a plus. Minimum of 8 years of Oracle WMS experience with at least 3 years in a WMS consulting role. Strong technical understanding of DC and IT systems. Excellent problem-solving, troubleshooting decision-making skills. Excellent communication (written and verbal) skills. Must be a self-starter with the ability to be productive in a fast-paced environment with minimal direction. Proven track record of successfully delivering large-scale and volume platforms. Ability to travel to Munchkin’s HQ and other DCs on an occasional basis.", "preferred": "Not specified."}, "skills": ["Oracle WMS", "Distribution Centers", "Process Improvement", "System Integration", "Project Management"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Disability insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992206912"}