{"jobTitle": "Senior Influencer & Partnerships Coordinator", "company": {"name": "Million Dollar Baby Co.", "location": "Pico Rivera, CA"}, "location": "Pico Rivera, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000 - 90,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Consumer Goods", "description": "About Million Dollar Baby Co.\n\nWelcome to Million Dollar Baby Co.! We started in 1990 and are proudly family-owned and operated in Los Angeles. Since then, MDB Co. has grown to 7 distinct brands of children's furnishings ranging in style, aesthetic, and price point, while carrying some of the industry's most eco-conscious and award-winning designs. Our family of brands include: Babyletto, DaVinci, Nursery Works, Namesake, Monogram by Namesake, and Carter's by DaVinci. We can be found in mass retailers like Target and Amazon to your local mom-and-pop baby shop to specialty retailers like Pottery Barn Kids and Crate and Barrel. At MDB Co., we credit all our success to our mighty, diverse team of more than 110 smart and fun individuals who make an impact every day! Our team members are our #1 priority and we partner with exceptional suppliers and retailers from around the world who share our values. Lastly, we are proud that we have been awarded Great Place to Work in '21, '22, '23, Built in LA Best of List '22, '23, Fortune Best Places to Work '23. It's truly an amazing place to work! We welcome you to learn more about our company and our fantastic team.\n\nTeddy Fong\n\nCEO\n\nAs we continue to grow our beloved brands, we are looking for a Senior Influencer & Partnerships Coordinator to join our team. In this role, you will be responsible for establishing relationships with influencer and brand partners and executing strategic monthly influencer campaigns to best showcase our brands to our consumers. Our ideal candidate has strong project management skills, a professional demeanor, loves building relationships, and is highly detail oriented.\n\nWhat You’ll Be Doing\n\n* Expertise in partnership development, management, influencer marketing, PR, and event planning \n* Have a pulse on the influencer space, conduct outreach to new influencer and brand partners that are aligned with our brand pillars \n* Manage all incoming partnership inquiries, develop a strong knowledge of our brands to evaluate opportunities \n* Build integrated influencer and brand campaigns that create brand awareness, increase traffic, highlight our products, and align with brand storytelling \n* Present innovative approaches and partnerships to extend influencer relationships into social campaigns, events, and PR/press opportunities \n* Evolve influencer seeding and gifting strategy to stay consistent with brand strategy \n* Maintain and track status and costs and ROI of influencer, designer, and brand partnerships \n* Manage & oversee the creation and execution of compelling influencer & brand content \n* Monitor and analyze the performance of campaigns, providing regular reports and insights to stake holders \n* Ensure all partnerships are executed smoothly and efficiently, managing all internal and external content approvals \n* Keep brand & marketing teams informed of industry trends, social platforms, and events \n* Partner with brand and marketing teams to contribute to the integrated communications and campaign calendar, ideate new initiative, campaigns, and projects that align with brand objectives and influencer strategy \n* Assist in Event Planning including Trade Shows, Consumer Shows, Press Events, and other events that feature our brands to the industry, media, and/or public \n\nWhat You’ll Bring To The Table\n\n* Minimum of 2 years’ experience in influencer marketing, social media, or digital strategy \n* Outgoing, professional demeanor with the ability to establish and maintain effective relationships within the company and with our partners \n* Must be familiar with social media platforms (Instagram, Facebook, YouTube, Pinterest, TikTok) \n* Influencer content management platform experience a plus (Aspire) \n* Excellent project management and documentation skills – you must be able master multiple projects simultaneously and prioritize \n* Excellent written and oral communication \n* Highly organized and detail oriented with ability to manage time in order to meet deadlines and create error-free work \n* A great attitude - enjoys building and contributing to happy, high-functioning teams \n* Strong consumer empathy – must be able to see and scrutinize our activities through the eyes of our parents \n* A practical, solutions-oriented approach to problem solving. Our ideal candidate enjoys multi-tasking, getting things done and works towards improving processes for the team and company wide \n* Experience with MS Office including MS Excel and Powerpoint \n* Passion for interior design and décor a plus \n\nOur Benefits\n\n* 100% of your health, dental, and vision insurance monthly premiums paid by us! \n* Flexible PTO because we respect the need for work/life harmony \n* Company matching 401(k) \n* Vacation reimbursement and health & wellness subsidy programs \n* Tuition reimbursement \n* Matching charitable donations to the nonprofit organization of your choice \n* Company-wide monthly celebrations - lunch is on us! \n* Dog-friendly workplace, yes! You can bring your best friend to work \n* Free MDB Co. swag + generous employee discount on products \n\nAt Million Dollar Baby Co., we’re passionate about diversity and welcome applicants from all backgrounds. Our diversity, inclusion and equity committee (DIEC) strives to break barriers for minority communities, help educate the company on pertinent topics, and work to ensure equal opportunities for existing and potential employees. Since its formation in 2020, our committee has focused on multiple areas, some include hiring, community involvement and continuous learning about Diversity, Inclusion and Equity.\n\nAs an important step in coming together as safely as possible, Million Dollar Baby Co. requires all employees to be fully vaccinated and boosted against COVID-19 as a condition of employment unless a medical or religious exemption is approved. \n\nMillion Dollar Baby Company is committed to providing reasonable accommodations for qualified individuals with disabilities in our job application and/or recruitment process. If you need assistance or an accommodation due to a disability, you may contact us at TM@mdbmail.com\n\nThe Pay Range For This Role Is\n\n75,000 - 90,000 USD per year(Pico Rivera (Hybrid))", "responsibilities": "Expertise in partnership development, management, influencer marketing, PR, and event planning Have a pulse on the influencer space, conduct outreach to new influencer and brand partners that are aligned with our brand pillars Manage all incoming partnership inquiries, develop a strong knowledge of our brands to evaluate opportunities Build integrated influencer and brand campaigns that create brand awareness, increase traffic, highlight our products, and align with brand storytelling Present innovative approaches and partnerships to extend influencer relationships into social campaigns, events, and PR/press opportunities Evolve influencer seeding and gifting strategy to stay consistent with brand strategy Maintain and track status and costs and ROI of influencer, designer, and brand partnerships Manage & oversee the creation and execution of compelling influencer & brand content Monitor and analyze the performance of campaigns, providing regular reports and insights to stake holders Ensure all partnerships are executed smoothly and efficiently, managing all internal and external content approvals Keep brand & marketing teams informed of industry trends, social platforms, and events Partner with brand and marketing teams to contribute to the integrated communications and campaign calendar, ideate new initiative, campaigns, and projects that align with brand objectives and influencer strategy Assist in Event Planning including Trade Shows, Consumer Shows, Press Events, and other events that feature our brands to the industry, media, and/or public", "qualifications": {"required": "Minimum of 2 years’ experience in influencer marketing, social media, or digital strategy Outgoing, professional demeanor with the ability to establish and maintain effective relationships within the company and with our partners Must be familiar with social media platforms (Instagram, Facebook, YouTube, Pinterest, TikTok) Excellent project management and documentation skills – you must be able master multiple projects simultaneously and prioritize Excellent written and oral communication Highly organized and detail oriented with ability to manage time in order to meet deadlines and create error-free work A great attitude - enjoys building and contributing to happy, high-functioning teams Strong consumer empathy – must be able to see and scrutinize our activities through the eyes of our parents A practical, solutions-oriented approach to problem solving. Our ideal candidate enjoys multi-tasking, getting things done and works towards improving processes for the team and company wide Experience with MS Office including MS Excel and Powerpoint", "preferred": "Influencer content management platform experience a plus (Aspire) Passion for interior design and décor a plus"}, "skills": ["Partnership Development", "Influencer Marketing", "Public Relations", "Event Planning", "Social Media", "Digital Strategy", "Project Management", "Communication", "Organization", "Time Management", "Consumer Empathy", "Problem Solving", "MS Office", "Excel", "Powerpoint", "Interior Design", "Décor"], "postedDate": "2 weeks ago", "benefits": "100% of your health, dental, and vision insurance monthly premiums paid by us! Flexible PTO because we respect the need for work/life harmony Company matching 401(k) Vacation reimbursement and health & wellness subsidy programs Tuition reimbursement Matching charitable donations to the nonprofit organization of your choice Company-wide monthly celebrations - lunch is on us! Dog-friendly workplace, yes! You can bring your best friend to work Free MDB Co. swag + generous employee discount on products", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992028827"}