{"jobTitle": "Bilingual Front Desk Office Manager's Needed - Entertainment", "company": {"name": "AppleOne Employment Services", "location": "Hawthorne, CA"}, "location": "Hawthorne, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Entertainment Providers", "description": "**Previous Office Manager/Office Coordinator experience working with vendors**<br/><br/>**Previous experience in event planning, event marketing, promotions, event production, digital production, fundraising coordinator, venue/resort/hotel/hospitality coordinator, festival coordinator, fashion/sports coordinator is a HUGE PLUS**<br/><br/><ul><li>Hours: 9am to 5:30pm (flexibility to do a 30 minute or 1 hour lunch) some</li><li>Days: Monday to Friday, must be able to work occasionally weekends, and holidays as needed for events</li><li>Dress: Business Casual</li><li>Parking: Provided on site</li><li>Report To: HR Director<br/><br/><br/></li></ul>JOB REQUIREMENTS (NO EXCEPTIONS):<br/><br/><ul><li>Must speak, read, and write in Spanish</li><li>Excellent written skills (email communication) – owner of company is VERY BIG on proper grammar</li><li>PowerPoint proficiency</li><li>MAC OS proficiency (company does not use PC/Windows OS)</li><li>Google Suite proficiency (Google Docs, Google Slides, Google Sheets, Google Drive)</li><li>Experience using Trello or Slack is a plus but NOT required<br/><br/><br/></li></ul>JOB RESPONSIBILITIES:<br/><br/>Reception and Guest Management:<br/><br/><ul><li>Receive and welcome company guests</li><li>Answer the company's main phone line, transfer calls, and take/deliver messages to staff</li><li>Ensure everyone is parked in their appropriate spots<br/><br/><br/></li></ul>Office Maintenance and Upkeep:<br/><br/><ul><li>Maintain office printers</li><li>Maintain and clean communal areas, including reception area, conference rooms (2), kitchen areas (5), library (1), and hallways</li><li>Manage office cleaning vendor</li><li>Sort and distribute daily mail delivery</li><li>Order, restock, organize and maintain inventory of all office and kitchen supplies</li><li>Ability to lift up to 50lbs</li><li>Assist with planning and coordinating office projects, such as office moves, events, or technology upgrades.<br/><br/><br/></li></ul>Administrative Support:<br/><br/><ul><li>Provide job applications as needed</li><li>Manage and update the company calendar and event grid using</li><li>Use Trello app to track projects</li><li>Coordinate with IT and Human Resources for new hire setup</li><li>Maintain and distribute company collateral</li><li>Handle permits in coordination with managements</li><li>Leaded the end-to-end bid process, including opportunity identification, qualification, and proposal submission</li><li>Accept work samples/bids proposals for potential new businesses opportunities by monitoring public and private boxes/bins portals</li><li>Continuously refine and improve processes, templates, and best practices to enhance efficiency and effectiveness of office<br/><br/><br/></li></ul>Inventory and Vendor Management:<br/><br/><ul><li>Manage office accounts with FedEx, Amazon, and Staples etc.</li><li>Manage inventory and distribution of left-over event items</li><li>Manage staff recognition process: Birthdays and holiday gifts</li><li>Manage company employee gift (SWAG) program, including inventory, employee sizes, and distribution<br/><br/><br/></li></ul>Apply for this great position as a Bilingual Spanish Front Desk Office Manager today! Please forward resume for immediate consideration and/or call the office and ask for Azuri Ross in the AppleOne Bunker Hill Downtown Los Angeles office.<br/><br/>#2258<br/><br/>EEO/AA Employer/Vet/Disabled.<br/><br/>For temporary assignments lasting 13 weeks or longer, the Company is pleased to offer major medical, dental, vision, 401k and any statutory sick pay where required.<br/><br/>If you believe you need a reasonable accommodation due to a disability or health condition in order to search for a job opening or to apply for a position, please contact your staffing representative who will reach out to our HR team.<br/><br/>AppleOne participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program. https://e-verify.uscis.gov/web/media/resourcesContents/E-Verify_Participation_Poster_ES.pdf]]&gt;", "postedDate": "2 weeks ago", "skills": ["Spanish", "PowerPoint", "MAC OS", "Google Suite", "Trello", "Slack"], "url": "https://www.linkedin.com/jobs/view/3992078879"}