{"jobTitle": "Production Coordinator", "company": {"name": "Sony", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "<strong>Aniplex of America Inc</strong>. (Santa Monica, California) is a subsidiary of Aniplex Inc. (headquartered in Tokyo, Japan), a group of Sony Music Entertainment (Japan) Inc. and a leading provider of anime content and music production and distribution in Japan. The company's ever-growing line-up of shows include: <em>March comes in like a lion</em>, <em>Blue Exorcist: Kyoto Saga</em>, <em>ERASED</em>, <em>The Asterisk War</em>, <em>OWARIMONOGATARI</em>,<em>KIZUMONOGATARI</em>, <em>GRANBLUE FANTASY, Eromanga Sensei, Katsugeki TOUKEN RANBU, BLEND-S, Slow Start, </em>and <em>Record of Grancrest War</em>. To learn more: http://aniplexusa.com/.<br/><br/><strong>Position Summary<br/><br/></strong>Aniplex of America Inc. (a subsidiary of Sony Music Japan) is seeking a Production Coordinator to join the team located in Santa Monica, CA. This individual will work on coordinating projects for the English localization of Japanese anime for North America, Central America, and South America. Detail requirements are noted below.<br/><br/><strong>The position has a HYBRID schedule. Employees are expected to work onsite in the Santa Monica office at least 2 days per week.<br/><br/></strong><strong>Job Responsibilities<br/><br/></strong>Under the supervision of localization producers, the candidate will perform the following duties:<br/><br/><ul><li>Communicating with Aniplex Japan and Authoring companies in the Japanese language in a Japanese Business Manner</li><li>Being a point of contact to communicate with dubbing companies and designers for each title</li><li>Translate text for series synopsis, episode synopsis, terminology, and credits from Japanese to English</li><li>Review translation accuracy between Japanese and English</li><li>Review English subtitles, English Subtitles for on-screen text, and Adapted Scripts for dubbing (Example: TV episodes, movies, trailers, etc.)</li><li>QC Blu-ray, DVD, and other media</li><li>Review disc packaging materials including text, design, layout, proof, etc.</li><li>Track localization progress and schedule</li><li>Track and manage inventory and Blu-ray order numbers</li><li>Track shipping, and receiving between manufacturing and distribution companies</li><li>Create POs</li><li>Create Title cards</li><li>Assisting in several Anime Events, including writing and translating the panel script, coordinating with Japan and the event’s organizer, attending the panel guests, and hosting the panels (potential cases of business trips in order to do so)</li><li>Research Manga, comics, video games, novels, etc.<br/><br/></li></ul><strong>Qualifications For Position<br/><br/></strong><ul><li>A minimum of 3 years of experience in office environments</li><li>A minimum of 1 year of relevant localization experience</li><li>Must be bilingual (English and Japanese)</li><li>Bachelor’s degree in related fields or equivalent skills and knowledge</li><li>Must have strong writing, reading, and communication skills in both English and Japanese</li><li>Computer proficiency with Microsoft Office applications: Word, Excel, PowerPoint, Google Suite, etc.</li><li>Be able to work in fast-paced environments under the pressure of heavy workloads and tight deadlines</li><li>Must be a team player and a good communicator</li><li>Must be self-motivated, proactive, energetic, and creative</li><li>Strong enthusiasm for entertainment, including Anime, Japanese pop culture, etc. preferred</li><li>All candidates must be authorized to work in the USA<br/><br/></li></ul>In addition to competitive pay and benefits, we offer an environment and culture that promotes Diversity, Equity, and Inclusion. We are committed to creating an inclusive employee experience for you to thrive as part of Sony’s purpose to “fill the world with emotion through the power of creativity and technology”.<br/><br/><strong>Benefits:  </strong> <br/><br/>SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.  <br/><br/> <strong>What we offer you:<br/><br/></strong><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)  </li><li>Employee assistance plan and comprehensive behavioral health benefits </li><li>Fertility benefits, including surrogacy, and adoption assistance programs   </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children  </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance  </li><li>Short-term &amp; long-term disability plans   </li><li>Paid parental and caregiver leave   </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting </li><li>Education assistance and student loan programs    <br/><br/></li></ul> <br/><br/><strong>Other Programs:</strong> <br/><br/><ul><li>Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs) </li><li>Referral bonuses (subject to eligibility)   </li><li>Matching gift program   </li><li>A wide variety of employee business resource groups (EBRGs)   </li><li>Special discounts on Sony products, offered exclusively to Sony employees </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)   </li><li>Annual incentive bonus <br/><br/></li></ul><em>The target annualized base salary range for this position is $58,000 to $65,000. The individual will be paid hourly and eligible for overtime. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. <br/><br/></em>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/>Disability Accommodation for Applicants to Sony Corporation of America Sony Corporation of America provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at careers@sonyusa.com or by mail to: Sony Corporation of America, Human Resources Department, 25 Madison Avenue, New York, NY 10010. Please indicate the position you are applying for.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)<br/><br/><em>While SCA does not require employees to be vaccinated against COVID-19, there are certain Sony offices that require employees to be vaccinated in order to enter. If you will be located at or travel to those offices, you will be required to be fully vaccinated to enter. The Company will consider requests for reasonable accommodations for documented medical reasons and for sincerely held religious beliefs in accordance with applicable law. Please do not include proof of vaccination status or any indication of a possible request for a vaccination accommodation when submitting your application materials. If applicable, the Company will follow up with you directly to request proof of vaccination and to discuss any potential accommodations.<br/><br/></em>", "responsibilities": "Under the supervision of localization producers, the candidate will perform the following duties:<br/><br/><ul><li>Communicating with Aniplex Japan and Authoring companies in the Japanese language in a Japanese Business Manner</li><li>Being a point of contact to communicate with dubbing companies and designers for each title</li><li>Translate text for series synopsis, episode synopsis, terminology, and credits from Japanese to English</li><li>Review translation accuracy between Japanese and English</li><li>Review English subtitles, English Subtitles for on-screen text, and Adapted Scripts for dubbing (Example: TV episodes, movies, trailers, etc.)</li><li>QC Blu-ray, DVD, and other media</li><li>Review disc packaging materials including text, design, layout, proof, etc.</li><li>Track localization progress and schedule</li><li>Track and manage inventory and Blu-ray order numbers</li><li>Track shipping, and receiving between manufacturing and distribution companies</li><li>Create POs</li><li>Create Title cards</li><li>Assisting in several Anime Events, including writing and translating the panel script, coordinating with Japan and the event’s organizer, attending the panel guests, and hosting the panels (potential cases of business trips in order to do so)</li><li>Research Manga, comics, video games, novels, etc.<br/><br/></li></ul>", "qualifications": {"required": "A minimum of 3 years of experience in office environments, A minimum of 1 year of relevant localization experience, Must be bilingual (English and Japanese), Bachelor’s degree in related fields or equivalent skills and knowledge, Must have strong writing, reading, and communication skills in both English and Japanese, Computer proficiency with Microsoft Office applications: Word, Excel, PowerPoint, Google Suite, etc., Be able to work in fast-paced environments under the pressure of heavy workloads and tight deadlines, Must be a team player and a good communicator, Must be self-motivated, proactive, energetic, and creative, All candidates must be authorized to work in the USA", "preferred": "Strong enthusiasm for entertainment, including Anime, Japanese pop culture, etc."}, "skills": ["Japanese", "English", "Microsoft Office", "Google Suite", "Anime", "Japanese pop culture"], "postedDate": "2 weeks ago", "benefits": "In addition to competitive pay and benefits, we offer an environment and culture that promotes Diversity, Equity, and Inclusion. We are committed to creating an inclusive employee experience for you to thrive as part of Sony’s purpose to “fill the world with emotion through the power of creativity and technology”.<br/><br/><strong>Benefits:  </strong> <br/><br/>SCA offers benefits-eligible employees (generally regular employees scheduled to work 20 or more hours a week) a comprehensive benefits program that offers coverage and support for employees and their family’s physical, emotional, and financial well-being.  <br/><br/> <strong>What we offer you:<br/><br/></strong><ul><li>Comprehensive medical, prescription drug, dental, and vision coverage with coverage for spouses/domestic partners and child dependents, including access to a Health Savings Account (HSA) and Flexible Spending Account (FSA)  </li><li>Employee assistance plan and comprehensive behavioral health benefits </li><li>Fertility benefits, including surrogacy, and adoption assistance programs   </li><li>Basic and supplemental life insurance for employees as well as supplemental life insurance coverage for their spouses/domestic partners and children  </li><li>Voluntary benefits such as group legal, identity theft protection, accident, and hospital indemnity insurance  </li><li>Short-term &amp; long-term disability plans   </li><li>Paid parental and caregiver leave   </li><li>401(k) Plan with pre-tax, Roth, and after-tax options and company match with immediate vesting </li><li>Education assistance and student loan programs    <br/><br/></li></ul> <br/><br/><strong>Other Programs:</strong> <br/><br/><ul><li>Time off to include vacation, paid holidays, sick leave, Summer Fridays (early release), and a winter break between Christmas and New Year’s Day (based on business needs) </li><li>Referral bonuses (subject to eligibility)   </li><li>Matching gift program   </li><li>A wide variety of employee business resource groups (EBRGs)   </li><li>Special discounts on Sony products, offered exclusively to Sony employees </li><li>Employee stock purchase plan (Sony covers commissions and fees for your Sony stock purchases made through after-tax payroll deductions)   </li><li>Annual incentive bonus <br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992677968"}