{"jobTitle": "Operations & Fulfillment Coordinator", "company": {"name": "Kinn Studio", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Kinn is looking for an Ops & Fulfillment Coordinator, dedicated to delivering excellence from the time a customer places an order to the moment a customer opens their package.\n\nThis role coordinates and executes day to day operations of order processing, inventory, logistics, fulfillment, and production, while maintaining strong relationships with our partners. As a team member, you will collaborate within a close-knit team, and support various functions within the team.\n\nMust be available to come into our Downtown Los Angeles studio Mon-Fri.\n\nWHAT YOU'LL BE DOING\nOperations & Fulfillment\n* Complete daily tasks such as order fulfillment, shipping, receiving and replenishment, cleaning jewelry, transferring merchandise, taking in jewelry repairs, and cleaning merchandise, following company operational policies and procedures. \n* Assist with monitoring orders in production and notify the team and / or customers\n* Assist with issuing lead times to all departments.\n* Inspect and QC all orders prior to shipment.\n* Package customer orders in branded packaging, following brand packaging guidelines.\n* Assist in coordinating with the shipping carriers as needed.\n* Coordinate and receive products from manufacturers and update internal purchase orders.\n* Assist with inventory control process to prevent stock losses and ensure integrity and quality of stock.\n* Participate in monthly physical inventory count supporting production.\n* Notify the CX team of item lead time, out of stock items, applicable international shipping fees and repair fees.\n* Replen packaging supplies and manage packaging inventory.\n* Provide regular progress updates to the leadership team.\n* Work with shipping carriers to actively solve issues.\n\nCustomer Experience\n* Work with the CX team re: product, order status, and returns & exchanges as needed.\n* Coordinate customer after sale services and shipping to and from accordingly.\n* Support logistics activities, including coordinating shipments, managing delivery schedules, and liaising with carriers.\n* Process Returns & Exchanges: Manage the returns and exchanges process, including handling returned items, restocking, and processing refunds or exchanges.\n\nWHAT WE'RE LOOKING FOR\n* Keen eye for details and attentive to the fulfillment process.\n* Experience with inventory, production, preferably in an eCommerce, jewelry or luxury environment.\n* You have the ability to quickly adapt to new initiatives, concepts, and services.\n* You're problem-solving minded.\n* Positive attitude that is contagious to others.\n* Ability to multi-task effectively through strong time management skills.\n* Must love jewelry. \n\nABOUT Kinn\nKinn designs modern heirlooms, made to last a lifetime. Modern, yet timeless, every piece is hand-crafted from solid 14k gold—never filled or plated, nor vermeil. We uphold rigorous quality standards at every step of the manufacturing process, ensuring each piece of jewelry is true to Kinn’s ethos. Above all else, Kinn is dedicated to creating jewelry that embodies our customers’ many moments lived—then, now, always.", "industry": "Retail Luxury Goods and Jewelry", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3992793261"}