{"jobTitle": "Business Analyst (Entry-Level)", "company": {"name": "CV Resources", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Analyst", "industry": "Entertainment Providers", "description": "CV Resources has partnered with a large and renowned company in the Entertainment industry in Los Angeles whose seeking an entry level Business Analyst to join their team! This is a great opportunity for a recent graduate whose analytical and is wanting to build out their finance career with an exciting company in the entertainment world.\n\nBENEFITS & PERKS: *Hybrid work schedule (2 days in office), room for overtime pay, medical, dental, 401k, and ability for fast growth within a large company.\n\nBusiness Analyst Responsibilities:\n\n* Assist in the preparation of reports\n* With the help of computer spreadsheets, draw charts and graphs to illustrate technical reports\n* Perform data entry, verification, and back-up; and maintain database\n* Develop automated accounting applications to improve productivity\n* Manage and coordinate the key financial measurements (revenue, gross profit, expense, and profit and cash), and also advise on cost reducing techniques\n\nBusiness Analyst Qualifications:\n\n* MUST be a recent graduate - preferably in Finance, Economics, Statistics or related fields.\n* Must be living in Los Angeles/Orange County  (out of state candidates will NOT be considered)\n* 1-2 years of experience with Excel preferred\n* Strong Analytical capabilities\n* Must possess excellent oral and written communication skills.\n\nApply today!", "responsibilities": "Assist in the preparation of reports, With the help of computer spreadsheets, draw charts and graphs to illustrate technical reports, Perform data entry, verification, and back-up; and maintain database, Develop automated accounting applications to improve productivity, Manage and coordinate the key financial measurements (revenue, gross profit, expense, and profit and cash), and also advise on cost reducing techniques", "qualifications": {"required": "MUST be a recent graduate - preferably in Finance, Economics, Statistics or related fields., Must be living in Los Angeles/Orange County  (out of state candidates will NOT be considered), 1-2 years of experience with Excel preferred, Strong Analytical capabilities, Must possess excellent oral and written communication skills.", "preferred": ""}, "skills": ["Excel", "Analytical"], "postedDate": "2 weeks ago", "benefits": "Hybrid work schedule (2 days in office), room for overtime pay, medical, dental, 401k, and ability for fast growth within a large company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992200027"}