{"jobTitle": "Service Desk Supervisor", "company": {"name": "Systematix", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "Systematix is currently looking for a Service Desk Supervisor to oversee a team of IT support associates in a technically diverse environment.  ABOUT THE PROJECT Our client is one of the world’s leading Life Sciences companies, with offices around the globe. Working as Service Desk Supervisor, you will be responsible for supervising the day-to-day operations of the IT service desk technical support team. Your main objective will be to provide technical guidance, resolve complex issues, ensure effective communication between the support team and end-users, and utilize experience in coaching associates and working through difficult conversations and situations. This is a Hands-On position.  ABOUT THE RESPONSIBILITIES  Lead Helpdesk team to troubleshoot and resolve Level 1 and 2 software, network and phone systems problems for local and remote personnel  Provide training to helpdesk staff on operational procedures and troubleshooting techniques.  Plan, prioritize, assign, supervise and reviews the work of assigned staff performing a variety of work activities within helpdesk  Identify, research, and resolve complex technical problems  Create and manage escalation procedures and ensure service levels are maintained  Document, track, and monitor problems to ensure resolution in a timely manner  Coordinate and evaluate section operations and activities; recommend and implement improvements and modifications; and prepare various reports on operations and activities for management.  Attend meetings, conferences, and training workshops. Review publications and industry documents to remain current on principles, practices, and new developments in assigned work areas.  Provide input on budget and annual review of service delivery activities.  Build and maintain relationships with all IT units to ensure that IT-delivered services and end-user productivity goals are understood and exceeded  Monitor day-to-day analyst input within Zendesk ticket system and present helpdesk KPI's to leadership  Provide new technology rollout support including extra training sessions and roving support after installations  Promote self-service tools and the knowledge repository as mechanisms to improve end-user satisfaction and reduce costs  Create documentation for use by end users (help sheets, usage guides, FAQ’s, etc.)  Up to 10% travel  Other duties and responsibilities as assigned by IT Service Manager.  ABOUT THE QUALIFICATIONS  Bachelor's degree from an accredited university in computer science or equivalent experience  5+ years of hands-on technical support experience working in large enterprise-level environments  2+ of leadership, management or prior supervisory experience leading teams of up to 5+ team members  Proficiency with Zendesk or other ticketing systems required  Strong working knowledge on Microsoft Office 2016, Windows 7 and 10, desktop, printers, and laptops  ITIL certification is a plus  Must be service oriented and have strong team leadership skills.  Strong analytical, problem solving and decision-making skills  Excellent verbal, written, and diplomatic skills  Ability to manage and collaborate with multidisciplinary teams  Ability to analyze and solve problems  Ability to prioritize and organize  ABOUT THE ROLE  This is a 3-6-month contract to hire role to be performed at our client’s site in the Los Angeles area.   APPLY NOW  If you are interested in finding out more please contact us or submit your resume to andrea.peckham@systematix.com  ABOUT SYSTEMATIX  Systematix is a Global Consulting and Resourcing firm head quartered in Canada with offices across North America and the United Kingdom. We provide the highest caliber consulting solutions to a diverse client base that includes all levels of Government and all Private Industry sectors.  Systematix is committed to creating a diverse, inclusive environment and is proud to be an equal opportunity employer. At Systematix, we don’t just accept difference, we thrive on it and believe that diverse cultures, perspectives, and experiences enhance our workforce and bring value to our community. Systematix Technology Consultants Inc has adopted the Employment Equity Policy to promote the full participation and advancement of members of the designated groups (women, indigenous peoples, members of visible minority groups, and persons with disabilities) under the Canadian Human Rights Act and Employment Equity Act in the Systematix Technology Consultants Inc workforce.", "responsibilities": "Lead Helpdesk team to troubleshoot and resolve Level 1 and 2 software, network and phone systems problems for local and remote personnel Provide training to helpdesk staff on operational procedures and troubleshooting techniques. Plan, prioritize, assign, supervise and reviews the work of assigned staff performing a variety of work activities within helpdesk Identify, research, and resolve complex technical problems Create and manage escalation procedures and ensure service levels are maintained Document, track, and monitor problems to ensure resolution in a timely manner Coordinate and evaluate section operations and activities; recommend and implement improvements and modifications; and prepare various reports on operations and activities for management. Attend meetings, conferences, and training workshops. Review publications and industry documents to remain current on principles, practices, and new developments in assigned work areas. Provide input on budget and annual review of service delivery activities. Build and maintain relationships with all IT units to ensure that IT-delivered services and end-user productivity goals are understood and exceeded Monitor day-to-day analyst input within Zendesk ticket system and present helpdesk KPI's to leadership Provide new technology rollout support including extra training sessions and roving support after installations Promote self-service tools and the knowledge repository as mechanisms to improve end-user satisfaction and reduce costs Create documentation for use by end users (help sheets, usage guides, FAQ’s, etc.) Up to 10% travel Other duties and responsibilities as assigned by IT Service Manager.", "qualifications": {"required": "Bachelor's degree from an accredited university in computer science or equivalent experience 5+ years of hands-on technical support experience working in large enterprise-level environments 2+ of leadership, management or prior supervisory experience leading teams of up to 5+ team members Proficiency with Zendesk or other ticketing systems required Strong working knowledge on Microsoft Office 2016, Windows 7 and 10, desktop, printers, and laptops Must be service oriented and have strong team leadership skills. Strong analytical, problem solving and decision-making skills Excellent verbal, written, and diplomatic skills Ability to manage and collaborate with multidisciplinary teams Ability to analyze and solve problems Ability to prioritize and organize", "preferred": "ITIL certification is a plus"}, "skills": ["Zendesk", "Microsoft Office 2016", "Windows 7", "Windows 10", "ITIL"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992811323"}