{"jobTitle": "Project Scheduler", "company": {"name": "McCarthy Building Companies, Inc.", "industry": "Commercial and Service Industry Machinery Manufacturing", "size": "Not specified", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Commercial and Service Industry Machinery Manufacturing", "description": "McCarthy Building Companies, Inc. is America's premier, 100% employee-owned commercial construction company. With offices nationwide, we specialize in a wide range of project types that are as diverse and wide-ranging as the communities in which we build. Our innovative teams collaborate with clients and industry partners throughout the project life cycle, starting in the earliest stages of design, throughout construction and beyond project completion.\n\nMcCarthy’s reputation for tackling the toughest building challenges starts with our focus on developing high-performing individuals and teams. We do this through our award-winning training programs, a best-in-class Total Rewards benefits program, and a focus on equipping diverse teams of employee owners through a connected and inclusive culture aligned with our values of: Genuine. We, Not I. All In.\n\nHow do McCarthy partners define our culture?\n\nWe Live Our Core Values. We do whatever it takes to deliver on our promises with honesty and integrity.\n\nWe are Employee Owned. We are personally invested in building the things people need in our communities.\n\nWe Feel Like a Family. We value genuine connections and help each other succeed in an inclusive environment.\n\nWe are Builders. We respect the work we do and everyone who helps make it happen safely.", "responsibilities": "• Communicate effectively with all field staff members, scheduling consultant and the client to ensure efficient and accurate schedule development and updates\n• Meet with Subcontractors as required in development of baseline schedule, monthly updates and recovery schedules\n• Identify and communicate significant schedule risks to Staff and appropriate Division personnel\n• Forecast impacts of variances to aid in the management of the schedule.\n• Utilize Primavera P6 scheduling software to update and document schedule performance\n• Monitor and status schedule progress\n• Analyze delivery impacts, time extensions, claims, etc. through the use of schedule fragnets\n• Interact with scheduling consultant in schedule reviews, claims analysis, etc. Perform cash flow projections / analysis on a monthly basis\n• Participate in Division training seminars", "qualifications": {"required": "Bachelor's degree in Construction Management or Engineering required or equivalent years of experience in Scheduling.", "preferred": "Primavera P6 scheduling experience"}, "skills": ["Primavera P6", "Construction Management", "Communication", "Organization"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992948019"}