{"jobTitle": "Social Media Manager", "company": {"name": "Murad", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 98,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "Murad Skincare has a 30-year legacy of developing clinically proven products that are backed by science and cruelty-free. Founded by dermatologist Dr. Howard Murad, we follow four pillars of wellness to create products and experiences for happier lives: Eat your water, be kind to your mind, nourish your skin, and awaken your body. We’re proud to be part of the Unilever prestige family that works every day towards enhancing sustainability and inclusivity. We stand against discrimination and hate, and actively advocate for inclusion: so much so that one of our core values is respect, connect, and appreciate. Our team members are as diverse as they are talented—each bringing a unique perspective to an environment that encourages coloring outside of the lines, speaking up, and collaboration—and we’re ready for you to join our team!<br/><br/>We are hiring a Social Media Manager to lead our growing social team and help deepen our connection with the Murad community. This role will be responsible for leading &amp; executing a comprehensive, best-in-class social strategy across all our social channels, managing overall strategy, day-to-day operations, and reporting. You’ll work closely with the Global Marketing team and the rest of the Consumer Engagement team (Influencer Marketing, Paid Media, Events) to build an organic brand presence that will drive the most buzz, engagement, conversation, and conversion, as aligned with business objectives and goals. Responsibilities will include managing the Murad Instagram &amp; TikTok accounts and content calendars, leading launch and activation support on our channels, community management, as well as both internal and external content creation efforts as needed.<br/><br/>This ideal candidate is deeply entrenched in internet culture and loves all things social, community, and brand They are a left- and right-brained thinker who blends a strong creative eye and brand storytelling capacity with the ability to tell stories through data and analytics. They are fully immersed in the social media landscape, and able to navigate where the brand plays in trends, how it builds and adapts its voice across channels, and how to create meaningful, two-way conversations within our community and beyond. They will also thrive in a fast-paced, ever-changing environment.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Channel Strategy &amp; Management<br/><br/></strong><ul><li>Own the strategy for owned brand communication across social channels to boost brand perception and engagement, while fostering an engaged and growing community</li><li>Plan and schedule all social content with the help of your team and brand tools</li><li>Lead crafting and editing copy for all social channels, ensuring a consistent brand voice throughout</li><li>Monitor emerging platforms and suggest integrations that feel \"on-brand\" to participate in<br/><br/></li></ul><strong>Content Creation &amp; Coordination<br/><br/></strong><ul><li>Partner closely with the Creative &amp; Global Marketing teams to create best-in-class assets to support key brand &amp; cultural moments</li><li>Coordinate and execute on supplemental content needs, including internal filming, as well as social content shoots, and/or creator briefing and outreach</li><li>Work closely with creator/influencer marketing to identify potential partner talent via UGC and engagement on brand channels</li><li>Provide real-time and in-person social support during photoshoots and brand events— including but not limited to pop-ups, influencer events<br/><br/></li></ul><strong>Analytics &amp; Reporting<br/><br/></strong><ul><li>Manage all platforms, using analytics to inform ongoing improvements to channel and content performance, along with providing social media reports to the wider Marketing team</li><li>Compile weekly, monthly, and quarterly social media reports, as well as launch-specific reporting</li><li>Monitor activity across the social sphere to report on trends, content, and collaborations, monitoring competitive and innovative non-beauty activity<br/><br/></li></ul><strong>Community Management<br/><br/></strong><ul><li>Lead and build our community outreach strategy, working with marketing counterparts to extend online engagement to offline to strengthen our connections with consumers and creators</li><li>Support social media &amp; community coordinators with community questions, comments, and direct messages daily across platforms</li><li>Collaborate with the Customer Care and Education teams, sharing key questions and inquiries from our community to provide feedback and share with wider team as needed</li><li>Lead ongoing initiatives to gather community feedback on new product development and existing product input<br/><br/></li></ul><strong>Requirements &amp; Qualifications<br/><br/></strong><ul><li>A demonstrated self-starter, who is detail-oriented and intellectually curious</li><li>Thinks strategically and thrives in a fast-paced environment</li><li>Excellent communication and writing skills, and strong creative judgment to recognize what is on-brand and on-trend</li><li>Strong quantitative skills and ability to interpret data for real-time optimization; knowledge of key social media. Understanding of paid media/social advertising a plus</li><li>Team player who is highly organized with exceptional project and time management skills</li><li>Works collaboratively with internal teams, influencers, PR, creative, and global marketing to develop ideas</li><li>Active daily life in digital and social media, very digitally savvy and curious, passionate about pop culture and social, enthusiastic about forging relationships with influencers and tastemakers</li><li>Four-year college degree or equivalent</li><li>5+ years of related experience, e. g., digital marketing, social media, influencer marketing, and program management</li><li>Experience in leading a team and managing direct reports</li><li>Content creation and content editing experience a plus</li><li>Beauty and skincare experience on digitally native brands a plus</li><li>Must be available to work 2 days a week in our El Segundo office<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Unlimited Paid Time Off</li><li>Medical, Dental, Vision Insurance</li><li>FSA/HSA</li><li>Life/Accident Insurance</li><li>Employee Assistance Program (EAP)</li><li>Professional Development Resources</li><li>401(k) Employer Match Program<br/><br/></li></ul>This position is based in our El Segundo, CA headquarters, which is currently 40% hybrid onsite/remote work.<br/><br/>The expected base salary for this position is $80,000 to $98,000. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget. In addition to base salary, Murad offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.<br/><br/>Murad is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to race, color, religion, national origin, ethnicity, age, sex, marital status, physical or mental disability, gender identity, sexual orientation, veteran or military status, or any other category protected under the law. Murad is an equal opportunity employer; committed to creating a community of inclusion, and an environment free from discrimination, harassment, and retaliation.<br/><br/>", "responsibilities": "Channel Strategy &amp; Management<br/><br/>\n<ul><li>Own the strategy for owned brand communication across social channels to boost brand perception and engagement, while fostering an engaged and growing community</li><li>Plan and schedule all social content with the help of your team and brand tools</li><li>Lead crafting and editing copy for all social channels, ensuring a consistent brand voice throughout</li><li>Monitor emerging platforms and suggest integrations that feel \"on-brand\" to participate in<br/><br/></li></ul>Content Creation &amp; Coordination<br/><br/>\n<ul><li>Partner closely with the Creative &amp; Global Marketing teams to create best-in-class assets to support key brand &amp; cultural moments</li><li>Coordinate and execute on supplemental content needs, including internal filming, as well as social content shoots, and/or creator briefing and outreach</li><li>Work closely with creator/influencer marketing to identify potential partner talent via UGC and engagement on brand channels</li><li>Provide real-time and in-person social support during photoshoots and brand events— including but not limited to pop-ups, influencer events<br/><br/></li></ul>Analytics &amp; Reporting<br/><br/>\n<ul><li>Manage all platforms, using analytics to inform ongoing improvements to channel and content performance, along with providing social media reports to the wider Marketing team</li><li>Compile weekly, monthly, and quarterly social media reports, as well as launch-specific reporting</li><li>Monitor activity across the social sphere to report on trends, content, and collaborations, monitoring competitive and innovative non-beauty activity<br/><br/></li></ul>Community Management<br/><br/>\n<ul><li>Lead and build our community outreach strategy, working with marketing counterparts to extend online engagement to offline to strengthen our connections with consumers and creators</li><li>Support social media &amp; community coordinators with community questions, comments, and direct messages daily across platforms</li><li>Collaborate with the Customer Care and Education teams, sharing key questions and inquiries from our community to provide feedback and share with wider team as needed</li><li>Lead ongoing initiatives to gather community feedback on new product development and existing product input<br/><br/></li></ul>", "qualifications": {"required": "A demonstrated self-starter, who is detail-oriented and intellectually curious\nThinks strategically and thrives in a fast-paced environment\nExcellent communication and writing skills, and strong creative judgment to recognize what is on-brand and on-trend\nStrong quantitative skills and ability to interpret data for real-time optimization; knowledge of key social media. Understanding of paid media/social advertising a plus\nTeam player who is highly organized with exceptional project and time management skills\nWorks collaboratively with internal teams, influencers, PR, creative, and global marketing to develop ideas\nActive daily life in digital and social media, very digitally savvy and curious, passionate about pop culture and social, enthusiastic about forging relationships with influencers and tastemakers\nFour-year college degree or equivalent\n5+ years of related experience, e. g., digital marketing, social media, influencer marketing, and program management\nExperience in leading a team and managing direct reports\nContent creation and content editing experience a plus\nBeauty and skincare experience on digitally native brands a plus\nMust be available to work 2 days a week in our El Segundo office", "preferred": ""}, "skills": ["Social Media", "Marketing", "Content Creation", "Community Management", "Analytics", "Influencer Marketing", "Paid Media", "Brand Storytelling", "Data Analysis", "Social Media Strategy", "Social Media Advertising", "Digital Marketing", "Project Management", "Team Leadership", "Communication", "Writing", "Creative Judgment", "Quantitative Skills", "Beauty", "Skincare"], "postedDate": "2 weeks ago", "benefits": "Unlimited Paid Time Off\nMedical, Dental, Vision Insurance\nFSA/HSA\nLife/Accident Insurance\nEmployee Assistance Program (EAP)\nProfessional Development Resources\n401(k) Employer Match Program", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3992890770"}