{"jobTitle": "Influencer Marketing Specialist", "company": {"name": "Wefluens", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>About Us<br/><br/></strong>Welcome to Wefluens, where we seamlessly connect extraordinary talents with top-tier opportunities, propelling them into the spotlight and turbocharging their professional growth.<br/><br/>As a premier Talent Agency, we specialize in nurturing and representing the brightest stars across various industries. Our mission is to help talents shine by providing unparalleled support, strategic guidance, and exclusive access to career-defining opportunities.<br/><br/>But that's not all - at Wefluens, we create unforgettable offline brand experiences that breathe life into personal brands in the most exhilarating ways imaginable. From high-profile events to unique collaborations, we ensure that every moment spent with us is a step towards realizing full potential.<br/><br/>Join us at Wefluens, where dreams meet endless possibilities. Let's make a mark together!<br/><br/><strong>Job Description<br/><br/></strong><ul><li> Lead Innovative Influencer Marketing Strategies with AI Tools</li><li>Utilize AI tools to identify, evaluate, and select suitable influencers aligned with brand objectives</li><li>Utilize AI analytics to monitor campaign performance, providing insights for optimization</li><li>Implement AI-driven content analysis to enhance the quality and relevance of influencer content</li><li> Influencer Relationship Management</li><li>Identify and engage with influencers who align with the brand's values and target audience</li><li>Develop and nurture strong relationships with influencers through effective communication and collaboration</li><li>Negotiate and execute contracts, ensuring both parties' expectations are met</li><li>Monitor and analyze influencer performance metrics to assess the success of campaigns</li><li> Content Creation and Collaboration</li><li>Collaborate with influencers to create engaging and authentic content that aligns with the brand's messaging</li><li>Provide creative direction and support to influencers to ensure content meets brand guidelines</li><li>Develop and implement collaborative campaigns to amplify the brand's reach and impact</li><li> Monitoring and Reporting:</li><li>Monitor social media channels and online platforms for brand mentions and sentiment</li><li>Prepare regular reports on the effectiveness of influencer and PR campaigns</li><li>Use analytics to identify trends and opportunities for improvement</li><li> Cross-Functional Collaboration:</li><li>Collaborate with marketing and social media teams to ensure cohesive and integrated campaigns</li><li>Work closely with internal stakeholders to align influencer and PR activities with overall marketing objectives<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Communications or related field</li><li>Worked in Influencer Marketing industry</li><li>Proficient in AI tools, Influencer marketing tools, Email Marketing Tools</li><li>Excellent communication, negotiation, and interpersonal skills</li><li>In-depth knowledge of social media platforms and trends</li><li>Strong project management and organizational skills</li><li>Creative thinker with the ability to develop unique and engaging campaigns</li><li>Familiarity with analytics tools and the ability to derive insights from data</li><li>Ability to thrive in a fast-paced, dynamic environment</li></ul>", "postedDate": "1 month ago", "skills": ["AI tools", "Influencer marketing tools", "Email Marketing Tools", "communication", "negotiation", "interpersonal skills", "social media platforms", "project management", "organizational skills", "creative thinking", "analytics tools"], "url": "https://www.linkedin.com/jobs/view/3992956683"}