{"jobTitle": "Global Investigations Manager", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "147,000-221,000", "currency": "USD"}, "jobFunction": "Project Management, Strategy/Planning, and Other", "industry": "Information Services and Technology, Information and Internet", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience defining and implementing security investigations, strategies, or initiatives.</li><li>10 years of experience partnering with leaders or stakeholders to drive improvements to security processes.</li><li>10 years of experience analyzing, interpreting, and drawing solutions from data, as it relates security investigations, as well as managing incidents that may have potentially harmful consequences.</li><li>5 years of experience coaching, mentoring, and leading junior team members. <br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Investigative/Interview certification through a national or internationally recognized organization.</li><li>Experience managing projects from ideation to implementation, while identifying opportunities for continuous improvement. </li><li>Experience with people management.<br/><br/></li></ul><strong>About the job</strong>From keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, deter, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness.<br/><br/>The US base salary range for this full-time position is $147,000-$221,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop, maintain, and execute protocols and practices to assess and mitigate threats to company assets, and manage crises and deliver threat assessment services.</li><li>Research how threats show up and understand emerging threats and trends, and provide trend and data analysis and performance reporting for security related disciplines.</li><li>Develop reports based on investigations and report findings to appropriate stakeholders; collect feedback, ensure documentation is up to date, and facilitate discussions to follow up with stakeholders. </li><li>Oversee investigations related to security risk and violations; monitor Google’s networks for breaches/intrusions, and install detection and notification software.</li><li>Supervise a team of investigators; increase efficiency and drive innovation across the team to deliver impact with respect to protecting, enabling, and sustaining Google business operations. Set and communicate clear expectations and team priorities that support organizational goals. <br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Develop, maintain, and execute protocols and practices to assess and mitigate threats to company assets, and manage crises and deliver threat assessment services.</li><li>Research how threats show up and understand emerging threats and trends, and provide trend and data analysis and performance reporting for security related disciplines.</li><li>Develop reports based on investigations and report findings to appropriate stakeholders; collect feedback, ensure documentation is up to date, and facilitate discussions to follow up with stakeholders. </li><li>Oversee investigations related to security risk and violations; monitor Google’s networks for breaches/intrusions, and install detection and notification software.</li><li>Supervise a team of investigators; increase efficiency and drive innovation across the team to deliver impact with respect to protecting, enabling, and sustaining Google business operations. Set and communicate clear expectations and team priorities that support organizational goals. <br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience defining and implementing security investigations, strategies, or initiatives.\n10 years of experience partnering with leaders or stakeholders to drive improvements to security processes.\n10 years of experience analyzing, interpreting, and drawing solutions from data, as it relates security investigations, as well as managing incidents that may have potentially harmful consequences.\n5 years of experience coaching, mentoring, and leading junior team members.", "preferred": "Investigative/Interview certification through a national or internationally recognized organization.\nExperience managing projects from ideation to implementation, while identifying opportunities for continuous improvement. \nExperience with people management."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3992297932"}