{"jobTitle": "Office Manager", "company": {"name": "Pinnacle Fertility, Inc.", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$79,000.00 - $97,000.00", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Pinnacle Fertility is the nation's fastest-growing physician-centric fertility care platform, supporting more than 25 high-performing fertility clinics and comprehensive fertility service providers nationwide. Under a united mission of fulfilling dreams by building families, Pinnacle clinics offer innovative technology and processes, compassionate patient care, and comprehensive fertility treatment services, ensuring families receive a high-touch experience on their path to parenthood.", "responsibilities": "Oversee Front Desk operations at all locations to ensure smooth daily operations. Administers employee performance management process at 90 days and bi-annually utilizing approved formats and assists with establishing employees' goals. Counsels and mentors staff as needed to improve employees' skills and implements corrective action as needed to ensure adherence to expected standards. Works to develop staff by assisting in identifying learning needs and/or seeks educational or enrichment activities to meet learning needs. Works to always ensure adequate staffing in all locations. Approves requests for time off and vacation. Assists with the hiring of staff for open positions. Identifies problems areas and addresses issues to resolve them, working with staff within the department and in other departments to determine the best solution. Oversee service recovery initiatives, with manager backup. Follows up with dissatisfied patients. Works with Financial Services to ensure insurance and financial information is accurately captured, recorded, interpreted and relayed to the patient and that payments are collected accurately and in a timely manner. Ensures that staff are well versed in all aspects of Patient Services operations including full knowledge of the range of services provided to patients, solid understanding of the computer programs required for staff to perform their jobs, and a strong understanding of the insurance and financial requirements of patients. Works in close cooperation with Marketing and Financial Services to ensure front desk staff receive training as needed and are continually updated as changes occur. Track performance goals and expectations of department. Maintains a strong customer service-oriented environment by acting as a role model in demonstrating excellent interpersonal skills, ensures patients are greeted with prompt attention and a caring attitude, treats all individuals, both internal and external with respect, dignity and caring, and supports and enforces customer service standards with all employees.", "qualifications": {"required": "Bachelors’ Degree or equivalent combination of education and experience, 5 years' experience in Office Management/Front Desk Supervisor role, Fertility, OB/GYN or Women’s health experience preferred, 3-5 years of Medical/Healthcare background in front office preferred, 1-2 years of experience in HR, payroll, billing, operations or corporate is preferred, Effective communication and teamwork abilities, Commitment to patient-centered care and privacy, Proficiency in using relevant technology.", "preferred": "Not specified"}, "skills": ["Customer Service", "Office Management", "Healthcare Operations", "Team Leadership", "Patient Care"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Comprehensive benefits package, including healthcare, dental, life, and vision insurance. Other benefits include generous paid time off (PTO), paid holidays, and a retirement savings program.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3992215574"}