{"jobTitle": "Law Firm Receptionist", "company": {"name": "Sepulveda Sanchez Accident Lawyers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Law Practice", "description": "*IMPORTANT INFORMATION TO APPLY*\n\nYou will be evaluated and vetted based on your ability to follow instructions. DO NOT apply through this posting, or the contact information on our website. If you do, you will not be considered and will be disqualified. TO APPLY: Call us at (phone number removed) and follow the instructions given.\n\nDo you love challenging yourself and collaborating with a motivated team? Do you love the feeling of winning? Do you love the feeling of growing and getting better every day? If so, Sepulveda Sanchez Law is the right place for your next career move.\n\nThe team at Sepulveda Sanchez Law is a downright bad ass group of legal professionals who are committed to bringing the fight to insurance companies for their clients. We understand that our clients may be facing some of the darkest times of their lives and rely on our team to bring those who wronged them to justice. At Sepulveda Sanchez Law, we often call ourselves the SEALs because when fighting for our clients, we believe that “The Only Easy Day Was Yesterday,” “It Pays to Be a Winner,” and we are “Never Out of The Fight.” We are looking for a select group of people who think they are up for the challenge and opportunity to join our team.\n\nWe are looking for a self motivated Pre-Litigation Case Manager to ensure smooth running of the office and effective case management. You will provide a broad spectrum of legal services under the supervision of an attorney.\n\nWhat We Do\n\nHere at Sepulveda Sanchez Law, we bring the fight to the insurance companies and corporations who cause harm to our clients. We are an award-winning personal injury law, which is committed to taking on cases for all people who have suffered injustice at the hands of an individual, insurance company or large corporation. We are not afraid to take our cases to trial when a fair settlement cannot be reached. Our mission is to help our clients recover financially and emotionally from the tragic events they have experienced.\n\nJoin Our Team\n\nSepulveda Sanchez law is a rapidly growing, ambitious, innovative, and talented law firm that is committed to obtaining justice to our clients on a national level. We are committed to delivering the best client experience and live out our core values of compassion, teamwork, community impact, constant and never-ending improvement, innovation, and determination. We are committed to ensuring our clients achieve justice during what is one of the darkest times of their lives. Winning cases for our clients and is our number one priority and we are looking for people to join our team to accomplish that mission.\n\nWe are seeking out individuals who believe in our core values and are obsessed with winning and obtaining justice for each one of our clients. If you love challenging yourself, constantly learning, and do not mind late nights, coffee runs, and the feeling of winning, we are the firm for you! If you would rather be mediocre in life, wither away at your desk, clock watch, and spend your life without any growth, do not bother applying to our firm. We are a team of professionals who are committed to winning cases and making an impact in our communities.\n\nResponsibilities\n\nGreet and welcome guests as soon as they arrive at the office\n\nAnswer, screen and forward incoming phone calls\n\nProvide basic and accurate information in-person and via phone/email\n\nReceive, sort, scan and distribute daily mail/deliveries/documents\n\nOrder front office supplies and keep inventory of stock\n\nUpdate calendars and schedule meetings\n\nOrganize and set up conference room for meetings\n\nPerform other clerical receptionist duties such as filing, photocopying, transcribing and faxing\n\nRequirements\n\nProven work experience as a Receptionist, Front Office Representative or similar role\n\nProficiency in Microsoft Office Suite, CasePeer, Lead Docket and DropBox\n\nHands-on experience with office equipment (e.g. fax machines and printers)\n\nProfessional attitude and appearance\n\nSolid written and verbal communication skills (Bilingual a must, English and Spanish)\n\nAbility to be resourceful and proactive when issues arise\n\nExcellent organizational skills\n\nMultitasking and time-management skills, with the ability to prioritize tasks\n\nCustomer service attitude\n\nBenefits\n\nHealth Care Plan (Medical, Dental & Vision)\n\nRetirement Plan (401k, IRA)\n\nPaid Time Off (Vacation, Sick & Public Holidays)\n\nTraining & Development\n\nFree Food & Snacks\n\nSepulveda Sanchez Law Swag/Clothing\n\nFun and Exciting Arts District Location\n\nPaperless and Technology Driven Law Firm", "responsibilities": "Greet and welcome guests as soon as they arrive at the office\n\nAnswer, screen and forward incoming phone calls\n\nProvide basic and accurate information in-person and via phone/email\n\nReceive, sort, scan and distribute daily mail/deliveries/documents\n\nOrder front office supplies and keep inventory of stock\n\nUpdate calendars and schedule meetings\n\nOrganize and set up conference room for meetings\n\nPerform other clerical receptionist duties such as filing, photocopying, transcribing and faxing", "qualifications": {"required": "Proven work experience as a Receptionist, Front Office Representative or similar role\n\nProficiency in Microsoft Office Suite, CasePeer, Lead Docket and DropBox\n\nHands-on experience with office equipment (e.g. fax machines and printers)\n\nProfessional attitude and appearance\n\nSolid written and verbal communication skills (Bilingual a must, English and Spanish)\n\nAbility to be resourceful and proactive when issues arise\n\nExcellent organizational skills\n\nMultitasking and time-management skills, with the ability to prioritize tasks\n\nCustomer service attitude"}, "skills": ["Microsoft Office", "CasePeer", "Lead Docket", "DropBox", "Customer Service", "Communication", "Organization", "Multitasking", "Time Management"], "postedDate": "2 weeks ago", "benefits": "Health Care Plan (Medical, Dental & Vision)\n\nRetirement Plan (401k, IRA)\n\nPaid Time Off (Vacation, Sick & Public Holidays)\n\nTraining & Development\n\nFree Food & Snacks\n\nSepulveda Sanchez Law Swag/Clothing\n\nFun and Exciting Arts District Location\n\nPaperless and Technology Driven Law Firm", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992605308"}