{"jobTitle": "Retail Project Manager (Culver City Location)", "company": {"name": "PAIGE", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "85,000.00/yr - 100,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management, Administrative, and General Business", "industry": "Retail Apparel and Fashion", "description": "<em>Based in Los Angeles, CA</em>\n<p>The goal of this role is to anticipate, mitigate, and navigate obstacles, maintain clear internal communication across all related teams company-wide, and keep all teams moving forward on schedule and on budget. The scope of this role will be broad and adaptive to support our teams and facilities as they grow.</p><p><br/></p><p><strong>Reports To: </strong>Director of Stores and Director of VM and Store Design</p><p><strong>Oversees: </strong>Existing Stores and New Stores</p><p><strong>Hybrid Role: </strong>3 Day In Office</p><p><br/></p><p><strong>You will do:</strong></p><p><br/></p><p><strong>New Store Openings</strong></p><ul><li>Supervise and coordinate the entire projects’ cycle from conception to ensure timely delivery.</li><li>This includes but is not limited to planning, execution, procurement, handover, close out process associated with the project.</li><li>Align with Store Design, Regional and Market leadership and all stakeholders on project milestones and overall schedule.</li><li>Agility to adapt the lifecycle to achieve quicker openings which in turn benefit sales and market growth.</li><li>Leverage project resources of architects, supplies, and GC’s to achieve project schedules.</li><li>Oversee construction</li><li>Manage and report on change orders and overall budget management</li><li>Work with buying team, the warehouse, and the contractor to schedule the product delivery for the initial store shipment</li></ul><p><br/></p><p><strong>Existing Stores</strong></p><ul><li>Identify area of needed improvement and institute improvements</li><li>Work in collaboration with Director of Retail and Store Design/VM to propose and implement improvements</li></ul><p><em>Oversee everything encompassing:</em></p><ul><li>Store Upkeep &amp; Maintenance</li><li>Gather quotes and billing approvals working alongside Director of Retail and VM to streamline with AP process</li><li>Lighting issues</li><li>Plumbing issues</li><li>Research and Coordinate with regionals/managers to find equipped handy person for fixes</li><li>Order supplies for all store related monthly, events, new stores, existing stores</li><li>Inventory adjustments</li><li>Admin management, retail calendar, applications</li><li>Work with IT Dept to set up new hiring detailing</li><li>Work with Controller to oversee Cash/Pick Ups &amp; Consistency</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Bachelor’s Degree in relevant field</li><li>Minimum of 5 Years of Project Management experience</li><li>Retail experience preferred</li><li>Demonstrates ability to collaborate effectively across all levels and functional teams</li><li>Excellent strategic planning, communication, and interpersonal skills</li><li>Highly analytical and solution oriented</li><li>Ability to manage deadline in a fast pace, high pressure environment</li><li>Must have experience sharing program / project updates across broad teams and organizations - transparency is key within the PAIGE culture and the experience to communicate, clear + concise cross functionally at all levels.</li><li>Experiences of developing processes, or when processes are in place, streamlining and making them more efficient and scalable</li><li>Experience collaborating and communicating effectively with vendors</li><li>Effective interpersonal and communication skills, approachable and flexible.</li><li>Proficient with Microsoft Office and Google Drive</li><li>Ability to manage multiple deadlines</li><li>Exceptional attention to detail and follow through</li></ul><p><br/></p><p><strong>Conditions of Employment:</strong></p><ul><li>Physical exertion required. Including, but not limited to, walking up to 50% of the time, standing up to 100% of the time, squatting and bending up to 20% of the time and lifting up to 80% of the time for up to a twelve hour shift.</li><li>Must be able to lift up to 50lbs.</li><li>Travel as require to conduct store visits during the lifecycle of a project or store opening</li><li>Must have a vehicle and legal driver’s license</li></ul><p><br/></p><p><em>Based Salary Range</em></p><p><em>$85,000 to $100,000</em></p><p><br/></p><p><strong>About Our Company</strong></p><p>PAIGE, we believe that every choice we've ever made-the big ones, the small ones, the right or the wrong-has led us to this moment. We believe that the best story you can make and share is the one of your own life, and we are passionate about designing pieces that reflect and celebrate it.</p><p>From the beginning, our founder &amp; creative director Paige Adams-Geller embraced every moment, aiming to inspire and empower as her story evolved. Her journey began in Los Angeles, where her entrepreneurial spirit took her from working as one of the top fit models in the industry to launching her namesake collection in 2004. Today, she sits at the helm of PAIGE as the only female founder in the denim industry, continuing to challenge convention and infuse her colorful spirit and chic sensibility to every collection she designs.</p><p><br/></p><p>Our brand first launched in February 2005 in high-end retailers including Intermix, Ron Herman, Bergdorf Goodman and Harvey Nichols. Paige's designs became an instant obsession of consumers, celebrities, and prominent fashion editors. Quickly, we unveiled our men's, petites and maternity ranges - all created with the same commitment to the craft.</p><p><br/></p><p>As our story continues to evolve, we remain devoted to the details. We only partner with the best wash-houses in the country, which happen to be in our hometown of Los Angeles. Every style we create is wear-tested, and tested again. We are completely obsessed with designing pieces you'll live in-jeans that go from morning to moonlight; the perfect pair that works like a charm, always; pieces to help you stand tall in what you're wearing, and take you exactly where you want to go.</p><p></p>", "responsibilities": "The goal of this role is to anticipate, mitigate, and navigate obstacles, maintain clear internal communication across all related teams company-wide, and keep all teams moving forward on schedule and on budget. The scope of this role will be broad and adaptive to support our teams and facilities as they grow.\n\nNew Store Openings\n* Supervise and coordinate the entire projects’ cycle from conception to ensure timely delivery.\n* This includes but is not limited to planning, execution, procurement, handover, close out process associated with the project.\n* Align with Store Design, Regional and Market leadership and all stakeholders on project milestones and overall schedule.\n* Agility to adapt the lifecycle to achieve quicker openings which in turn benefit sales and market growth.\n* Leverage project resources of architects, supplies, and GC’s to achieve project schedules.\n* Oversee construction\n* Manage and report on change orders and overall budget management\n* Work with buying team, the warehouse, and the contractor to schedule the product delivery for the initial store shipment\n\nExisting Stores\n* Identify area of needed improvement and institute improvements\n* Work in collaboration with Director of Retail and Store Design/VM to propose and implement improvements\n\nOversee everything encompassing:\n* Store Upkeep & Maintenance\n* Gather quotes and billing approvals working alongside Director of Retail and VM to streamline with AP process\n* Lighting issues\n* Plumbing issues\n* Research and Coordinate with regionals/managers to find equipped handy person for fixes\n* Order supplies for all store related monthly, events, new stores, existing stores\n* Inventory adjustments\n* Admin management, retail calendar, applications\n* Work with IT Dept to set up new hiring detailing\n* Work with Controller to oversee Cash/Pick Ups & Consistency", "qualifications": {"required": "Bachelor’s Degree in relevant field, Minimum of 5 Years of Project Management experience, Retail experience preferred, Demonstrates ability to collaborate effectively across all levels and functional teams, Excellent strategic planning, communication, and interpersonal skills, Highly analytical and solution oriented, Ability to manage deadline in a fast pace, high pressure environment, Must have experience sharing program / project updates across broad teams and organizations - transparency is key within the PAIGE culture and the experience to communicate, clear + concise cross functionally at all levels., Experiences of developing processes, or when processes are in place, streamlining and making them more efficient and scalable, Experience collaborating and communicating effectively with vendors, Effective interpersonal and communication skills, approachable and flexible., Proficient with Microsoft Office and Google Drive, Ability to manage multiple deadlines, Exceptional attention to detail and follow through", "preferred": ""}, "skills": ["Project Management", "Communication", "Strategic Planning", "Interpersonal Skills", "Analytical Skills", "Problem Solving", "Microsoft Office", "Google Drive"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Paid paternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992772798"}