{"jobTitle": "Chief Administrative Officer", "company": {"name": "UC Irvine", "location": "Irvine, CA", "industry": "Higher Education"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "description": "<strong>Who We Are<br/><br/></strong>The Department of Physics and Astronomy is one of the largest academic departments in the School of Physical Sciences at UCI and our staff are responsible for all administrative duties associated with a population of 290 people. This includes our largest faculty population of 55 faculty, 80 non-senate academics, 14 career staff and 185 graduate students. Physics lies at the forefront of our understanding of nature. It includes the study of the universe on the largest scales - astronomy and cosmology, and on the smallest - the physics of quarks and leptons. In addition, physics provides the background for high technology; lasers, nuclear power, semiconductors, and medical imaging all have their roots in physics. At the UCI Department of Physics and Astronomy, world-renowned physicists study exciting topics like quantum mechanics, gravitation, the big bang, black holes, magnetism, and superconductivity. Physics and Astronomy hosts a workplace environment that supports wellness, creativity, teamwork, knowledge and growth. We strive to provide a balance and flexibility for our staff that supports peak performance in our work, which serves the mission of the University, School of Physical Sciences, and Department. This position will begin full time on-site. After assessing work productivity throughout the six-month probationary period (as applicable) along with satisfactory progress and supervisor approval, the incumbent may request a hybrid/remote schedule that fits within the department's business needs.<br/><br/>Founded in 1965, <strong>UC Irvine</strong> is a member of the prestigious Association of American Universities and is ranked among the nation’s top 10 public universities by U.S. News &amp; World Report. The campus has produced five Nobel laureates and is known for its academic achievement, premier research, innovation and anteater mascot. Led by Chancellor Howard Gillman, UC Irvine has more than 36,000 students and offers 224 degree programs. It’s located in one of the world’s safest and most economically vibrant communities and is Orange County’s second-largest employer, contributing $7 billion annually to the local economy and $8 billion statewide.<br/><br/>To learn more about UC Irvine, visit www.uci.edu.<br/><br/><strong>Your Role on the Team<br/><br/></strong>The Chief Administrative Officer (CAO) of the Physics and Astronomy Department in the School of Physical Sciences at UC Irvine is responsible for providing high level management for all facets of department operations. Management responsibilities include establishing and directing administrative systems to assure overall control of all planning and operational activities. Functional areas include: administrative and technical support services, facilities and space management, graduate and undergraduate affairs, academic and staff personnel, contracts and grants, finance/accounting, safety and compliance, instructional program administration and program development. Reports to the Chair, and advises Vice Chairs, faculty, staff, and students on a variety of issues. Works closely with Department Chair and Dean’s Office to achieve strategic priorities of the Department and School.<br/><br/>The CAO must provide strong administrative leadership using effective interpersonal skills to diverse constituencies at all levels of management and staff. Responsible for oversight of all non-academic support staff. Represents the Chair and the Department generally, at both the campus and systemwide levels, as well as to external organizations.<br/><br/><strong>Essential Functions (Key Responsibilities)<br/><br/></strong><ul><li>Manages, plans, and administers all administrative operations, systems, support staff, and procedures of the Department of Physics and Astronomy. Responsible for management of diverse financial resources totaling near $15.5M. Prepares short and long range planning for departmental teaching, research, administrative and support needs, and improvements to processes. Establishes and recommends changes to policies which affect the department. Administrative services include: technical support services, facilities and space management, senate and non-senate academic and staff personnel, undergraduate and graduate affairs, contracts and grants, budgetary financial management, safety compliance, instructional programs and program development. Represents the Chair, faculty, staff, and students to members of the campus community, UC system, and outside agencies in order to communicate the departmental goals, objectives, and needs. 40%</li><li>Evaluates and monitors all accounting activities. Establishes and implements accounting procedures and reporting systems for effective oversight and control of departmental expenditures and revenues. Develops and monitors operational and budget processes, staff FTE, finance, human resources and space planning. Establishes and implements accounting procedures and reporting systems for effective oversight and control of departmental expenditures and revenues. Oversees the preparation and management of contracts and grants pre-award administration involving a diverse and wide variety of funding sources and agencies. Develops and prepares budgets and financial reports for grants, general appropriations, endowments, and other funds. 25%</li><li>Responsible for the recruitment, supervision, performance management, and development (etc) of all non-academic staff and non-academic staff managers with a wide variety of expertise, and with responsitility for the quality and quantity of work performed. Staff areas of expertise include (but are not limited to) human resources and academic personnel, payroll, student affairs, finance, laboratory support, and events 15%</li><li>Oversees academic personnel administration activities and is responsible for and supervises all non-academic personnel and activities. Holds regular meetings with staff. Supervises the traking of administrative requests. 10%</li><li>Oversees the instructional and graduate program administration. Participates in the development of the annual teaching plan. 10%<br/><br/></li></ul><strong>Total Compensation<br/><br/></strong><strong>What It Takes to be Successful<br/><br/></strong>In addition to the salary range listed below, we offer a wealth of benefits to make working at UCI even more rewarding. These benefits may include medical insurance, sick and vacation time, retirement savings plans, and access to a number of discounts and perks. Please utilize the links listed here to learn more about our compensation practices and benefits.<br/><br/><strong>Required<br/><br/></strong><ul><li>Broad knowledge of the organization's processes, protocols and procedures with a focus on budget, account and fund management and personnel management under labor contract(s) and personnel policy. Required</li><li>Broad knowledge of all aspects of administratively leading an academic department including the areas of financial analysis and reporting techniques; human resources and risk management planning; and accounting and payroll. Required</li><li>Knowledge of various computing applications, and correct usage of English grammar, spelling and punctuation to effectively communicate and produce reports, proposals, memos and letters. Required</li><li>Experience managing competing deadlines to ensure obligations are met in a cost effective and timely fashion. Required</li><li>Broad knowledge of common organization-specific and other computer application programs. Required</li><li>Skills to work collaboratively with faculty, staff, students and campus personnel. Required</li><li>Proven skills to quickly evaluate and address complex issues and identify multiple options for resolution. Required</li><li>Demonstrated management and conflict resolution skills to effectively lead and motivate others. Required</li><li>Demonstrated leadership and organizational skills to effectively manage large, diverse department. Required</li><li>Excellent communication and interpersonal skills to work with diverse groups (faculty, staff, students, visitors) of individuals to effectively provide information, identify problems, and develop feasible solutions. Required</li><li>Ability to comprehend concepts and mission of unit, and initiative to create and implement policies and procedures to best satisfy those goals in a most effective manner. Required</li><li>Ability to comprehend, interpret and implement University policies and procedures regarding personnel, payroll, research, fiscal matters, space, equipment, etc. Required</li><li>Experience effectively supervising support staff, handling sensitive matters with discretion and confidentiality. Required</li><li>Knowledge of various computing applications, and correct usage of English grammar, spelling and punctuation to effectively communicate and produce reports, proposals, memos and letters. Required</li><li>Bachelor's degree in related area and / or equivalent experience / training</li><li>7-9 years Management experience<br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Experience managing a team with subordinate managers. Preferred</li><li>Knowledge of and experience with relevant UC policies and procedures. Preferred</li><li>7-9 years Management of an academic department at UC or a large administrative unit in higher education with demonstrated experience supervising support staff with a wide variety of expertise.<br/><br/></li></ul><strong>Special Conditions<br/><br/></strong><ul><li>Must pass a background check.<br/><br/></li></ul><strong>Conditions Of Employment<br/><br/></strong>The University of California, Irvine (UCI) seeks to provide a safe and healthy environment for the entire UCI community. As part of this commitment, all applicants who accept an offer of employment must comply with the following conditions of employment:<br/><br/><ul><li>Background Check and Live Scan</li><li>Legal Right to work in the United States</li><li>Vaccination Policies</li><li>Smoking and Tobacco Policy</li><li>Drug Free Environment<br/><br/></li></ul>The following additional conditions may apply, some of which are dependent upon business unit or job specific requirements.<br/><br/><ul><li>California Child Abuse and Neglect Reporting Act</li><li>E-Verify</li><li>Pre-Placement Health Evaluation<br/><br/></li></ul>Details of each policy may be reviewed by visiting the following page - https://hr.uci.edu/new-hire/conditions-of-employment.php<br/><br/><strong>Closing Statement<br/><br/></strong>The University of California, Irvine is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age or protected veteran status.<br/><br/>For the University of California’s Affirmative Action Policy please visit: https://policy.ucop.edu/doc/4010393/PPSM-20.<br/><br/>For the University of California’s Anti-Discrimination Policy, please visit: https://policy.ucop.edu/doc/1001004/Anti-Discrimination.<br/><br/>We are committed to attracting and retaining a diverse workforce along with honoring unique experiences, perspectives, and identities. Together, our community strives to create and maintain working and learning environments that are inclusive, equitable, and welcoming.<br/><br/>UCI provides reasonable accommodations for applicants with disabilities upon request. For more information, please contact Human Resources at (949) 824-0500 or eec@uci.edu.<br/><br/><strong>Consideration for Work Authorization Sponsorship<br/><br/></strong>Must be able to provide proof of work authorization", "jobFunction": "Administrative", "industry": "Higher Education", "postedDate": "2 weeks ago", "qualifications": {"required": "Broad knowledge of the organization's processes, protocols and procedures with a focus on budget, account and fund management and personnel management under labor contract(s) and personnel policy. Required\nBroad knowledge of all aspects of administratively leading an academic department including the areas of financial analysis and reporting techniques; human resources and risk management planning; and accounting and payroll. Required\nKnowledge of various computing applications, and correct usage of English grammar, spelling and punctuation to effectively communicate and produce reports, proposals, memos and letters. Required\nExperience managing competing deadlines to ensure obligations are met in a cost effective and timely fashion. Required\nBroad knowledge of common organization-specific and other computer application programs. Required\nSkills to work collaboratively with faculty, staff, students and campus personnel. Required\nProven skills to quickly evaluate and address complex issues and identify multiple options for resolution. Required\nDemonstrated management and conflict resolution skills to effectively lead and motivate others. Required\nDemonstrated leadership and organizational skills to effectively manage large, diverse department. Required\nExcellent communication and interpersonal skills to work with diverse groups (faculty, staff, students, visitors) of individuals to effectively provide information, identify problems, and develop feasible solutions. Required\nAbility to comprehend concepts and mission of unit, and initiative to create and implement policies and procedures to best satisfy those goals in a most effective manner. Required\nAbility to comprehend, interpret and implement University policies and procedures regarding personnel, payroll, research, fiscal matters, space, equipment, etc. Required\nExperience effectively supervising support staff, handling sensitive matters with discretion and confidentiality. Required\nKnowledge of various computing applications, and correct usage of English grammar, spelling and punctuation to effectively communicate and produce reports, proposals, memos and letters. Required\nBachelor's degree in related area and / or equivalent experience / training\n7-9 years Management experience<br/><br/>", "preferred": "Experience managing a team with subordinate managers. Preferred\nKnowledge of and experience with relevant UC policies and procedures. Preferred\n7-9 years Management of an academic department at UC or a large administrative unit in higher education with demonstrated experience supervising support staff with a wide variety of expertise.<br/><br/>"}, "skills": ["Budget Management", "Financial Analysis", "Human Resources", "Risk Management", "Accounting", "Payroll", "Communication", "Interpersonal Skills", "Leadership", "Organizational Skills", "Supervisory Skills", "Policy Implementation", "University Policies", "Personnel Management", "Contract Management", "Grant Management", "Financial Reporting", "Space Management", "Instructional Program Administration", "Program Development", "Team Management", "Conflict Resolution", "Problem Solving", "Collaboration", "Computing Applications", "English Grammar", "Spelling", "Punctuation", "Report Writing", "Proposal Writing", "Memo Writing", "Letter Writing", "Deadline Management", "Cost Effectiveness", "Time Management", "Staff Development", "Staff Supervision", "Meeting Management", "Administrative Request Tracking", "UC Policies", "Higher Education Administration", "Support Staff Supervision"], "benefits": "In addition to the salary range listed below, we offer a wealth of benefits to make working at UCI even more rewarding. These benefits may include medical insurance, sick and vacation time, retirement savings plans, and access to a number of discounts and perks. Please utilize the links listed here to learn more about our compensation practices and benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993882673"}