{"jobTitle": "Director of Pediatric Services - Lou Colen Children's Health & Wellness Center, Los Angeles", "company": {"name": "UCLA Health", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$240,000 - $302,600", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Venice Family Clinic is a leader in providing comprehensive, high-quality health care to people in need regardless of their income, insurance, or immigration status. The organization has more than 500 staff who serve 45,000 people with compassion, dignity, and respect across an area from the Santa Monica Mountains through the South Bay. Read more about us at venicefamilyclinic.org. Under the leadership of the Chief Medical Officer, The Director of Pediatric Services is an integral part of the clinic staff, providing leadership and expertise on medical questions and solving issues related to operational and clinical services. They provide primary care pediatric services evaluating, treating, and making appropriate diagnostic and specialty referrals for our patients. In addition to staff physician duties, the position will involve leadership of clinical staff, including direct supervision of some of the physicians, pediatric clinician staff, and staff pediatric physicians. The Director of Pediatric Services will play a significant role in supporting and developing the clinic's pediatric program. The Director of Pediatric Services will inform the staff and volunteer or training clinicians of the latest advances in the field of Pediatric Medicine and is the clinician champion in QI initiatives related to pediatrics. The Director will collaborate with QI and clinical leadership teams to evaluate pediatric services at Venice Family Clinic, updating process and outcome metrics, and ensuring high quality of service. Together with the Pediatric Program Manager, the Director of Pediatric Services will conduct needs assessments, identify areas of improvement, and help establish annual performance targets, aligned with the organization's QI initiatives. The Director of Pediatric Services, along with the Program Manager, sets the agenda and leads the monthly Pediatric and Teen Workgroup meetings as well as the larger Program Meetings. The director is an active participant in the Clinical Leadership Group, including performing peer review, as well as the Coordinating Team. The position will represent Venice Family Clinic Pediatric Services internally (donor tours, site visits, among others) as well as externally (organizations, societies, conferences, among others); and will function as a liaison with the resident training programs, dental, speech therapy, behavioral health departments on clinical issues. UCLA Health welcomes all individuals, without regard to race, sex, sexual orientation, gender identity, religion, national origin or disabilities, and we proudly look to each person’s unique achievements and experiences to further set us apart.", "responsibilities": "Not specified", "qualifications": {"required": "Possession of an active California Medical License, Board Certified physician in Family Medicine, Med/Peds, or Pediatrics, Knowledge of medical problems of minorities, medically underserved populations, and the unhoused, Ability to speak Spanish such that an interpreter is not routinely needed during medical exams, Skill in providing general adult and pediatric medical care in a high-volume clinic setting, Able to manage a wide range of chronic illnesses, especially diabetes and obesity, Ability to teach and supervise staff clinicians, residents, and medical students, Ability to work as a team with multi-disciplinary staff, different medical specializations, mental health providers, other staff and volunteer physicians, and mid-level practitioners, Willingness to learn and fully utilize our Electronic Health Record to meet meaningful use requirements, Meet productivity goals as determined by the Chief Medical Officer", "preferred": "Not specified"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993092631"}