{"jobTitle": "Human Resources Coordinator (Full Time-LACC)", "company": {"name": "ASM Global", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Entertainment", "description": "Job Summary:<br/><br/>The Human Resources Coordinator works closely with the management of the Los Angeles Convention Center Human Resources team as a point of contact, providing administrative support to a variety of functions related to the daily office operations such as new hire orientation/onboarding processes, personnel records maintenance, talent acquisition, and venue front office reception duties.<br/><br/>Key Job Factors:<br/><br/><li> Level of accountability: Closely supervised</li><li> Level of decision making: Primarily routine tasks</li><li> Has contact with: Inside / Outside company</li><li> Supervision: Does not directly supervise or manage others</li><li> Physical Requirements: Light, occasional physical effort</li> Travel Percentage (%): <br/><br/>ESSENTIAL DUTIES: Essential duties are those basic duties which must be performed for the purpose of this job during a year. Essential Duties/Tasks:<br/><br/>1 Provides daily Human Resources office support for LACC Team Member (walk-in, email, or telephone) inquiries, offers answers to HR related questions or concerns, interprets basic company policy/procedures elevating to management when required. Assists with administrative duties which support local initiatives as needed. Creates in-house partner photo ID badges when requested. Protects and safeguards the integrity of confidential or sensitive information.<br/><br/>2 Assists in the talent acquisition processes through such tasks as telephone screening using established processes to determine a candidate’s eligibility for interview and scheduling appointments with hiring managers upon request. Contacts prospective new hires to complete the pre-onboarding process such as verbal job offers, background checks, sending orientation instructions, and COMP parking passes.<br/><br/>3 Serves as an additional front office reception team member to answer walk-in questions, telephone inquiries, provides accurate directions for travel to the venue and to destinations within (such as meeting rooms or exhibit halls), offers knowledgeable information regarding in-progress, upcoming events or activities held onsite, receives U.S. Mail and other parcel items routing them accordingly. Distributes building control items (ID, FOBs, Parking cards) to in-house partners as needed.<br/><br/>4 Assists with new hire orientation providing logistical support and guidance by preparing necessary forms in advance, greeting new team members, providing instructions on form completion, taking ID photographs, obtaining the appropriate employment verification identity documents and/or other relevant items. Supports and assists with employee engagement, wellness, and recognition activities as needed.<br/><br/>5 Assists in the maintenance of personnel/medical/confidential physical and electronic records, I-9, background checks, and other personnel related documents. Assists in the preparation of exit documents for separation to include final paycheck requests, employment checklists, exit interviews, contact information update forms, etc.<br/><br/>6 Responds to information requests such as EDD unemployment, disability, and other leave claims as well as backgrounds/employment verification inquiries escalating to management when necessary. Assists to review and complete worker’s compensation injury reports and responses to our company third party insurance (TPA) carrier.<br/><br/>7 Ensure the orderly appearance of the HR Office as well as the front reception desk. Maintaining inventory of general office supplies, completing requests for additional items through the LACC Office Manager when necessary. Other duties and projects as assigned<br/><br/>REQUIRED QUALIFICATIONS: (Job Knowledge, Skills, and Education):<br/><br/><ul><li>Minimum education level of: Associate of Arts/Sciences Degree - Area of Study: Human Resources, Business, Communication, Hospitality/Tourism, Social studies, or a closely related field. </li><li>Possess 2 years as an HR Assistant or the equivalency of education/experience or training. </li><li>Bilingual in English &amp; Spanish. </li><li>Required variable work schedule such as late hours, early mornings, extended hours, holidays, and weekends. </li><li>Represents the Los Angeles Convention Center, ASM Global, and the Human Resources Department in a professional manner at all times. </li><li>Must be able to work in a dynamic environment, which includes events with large attendance and those which are high profile in nature. Possess the ability to adapt to changing assignments or priorities. </li><li>Possess strong verbal and written communication skills with a working knowledge of standard office peripherals such as computers, copiers, and Office 365 software such as Excel/Outlook/Word. </li><li>Maintains positive relations with all venue clients, guests, service providers, and LACC Team Members. </li><li>Interacts effectively and calmly in high stress situations to achieve the best possible resolution. Provides service through referral to the proper department while maintaining ownership of the issue. </li><li>Must have reliable transportation. <br/><br/></li></ul>PREFERRED QUALIFICATIONS: (Job Knowledge, Skills, and Education)<br/><br/><ul><li>Previous HR experience working in an events-based environment (such as an arena, convention center or stadium) with knowledge of convention/trade/consumer shows. </li><li>Undergrad coursework in Human Resources, Business, Communication, Hospitality/Tourism, Social studies, or a closely related field. </li><li>HR Certification and/or training courses from Society for Human Resource Management (SHRM-CP), Human Resource Certification Institute (HRCI-PHR), or similar certification/training. <br/><br/></li></ul>PHYSICAL ACTIVITIES: The physical demands described here are representative of those that must be met by a team member to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the team member is regularly required to sit, stand, walk, reach with hands and arms, talk, or hear. Team members must move about on foot, standing and walking for extended periods to accomplish tasks. The team member is occasionally required to lift, push, pull, and move up to twenty-five pounds<br/><br/>WORK ENVIRONMENT:<br/><br/>The work environment characteristics described here are representative of those a team member encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the team member may be exposed to outside weather conditions. Team member use of Personal Protective Equipment (PPE) may be required in certain situations. Team member must comply with all Federal, State and Local regulations and published Company work rules as well as written instructions. The noise level in the work environment is typically low to moderate.<br/><br/>ADDITIONAL COMMENTS: Describe any other aspects of this job that are important and have not been covered in the previous sections.<br/><br/>This is an onsite position that requires collaboration with multiple departments and service to clients and guests in the venue. The above statements are intended to describe the general nature and level of work being performed by this position. This is not an exhaustive list of all responsibilities, duties, and skills required. All team members may be required to perform duties outside of their normal responsibilities from time to time, as needed.<br/><br/>ASM Global reserves the right to change or modify the team member's job description whether orally or in writing, at any time during the employment relationship. ASM Global may require a team member to perform duties outside his/her normal description.<br/><br/>PAY RATE: $22.00 – $27.00 HOURLY/NON-EXEMPT<br/><br/>EEO is The Law - click here for more information ASM is an Equal Opportunity/Affirmative Action employer, and encourages Women, Minorities, Individuals with Disabilities, and protected Veterans to apply. VEVRAA Federal Contractor. Applicants that need reasonable accommodations to complete the application process may contact (610) 729-1023.", "responsibilities": "Job Summary:<br/><br/>The Human Resources Coordinator works closely with the management of the Los Angeles Convention Center Human Resources team as a point of contact, providing administrative support to a variety of functions related to the daily office operations such as new hire orientation/onboarding processes, personnel records maintenance, talent acquisition, and venue front office reception duties.<br/><br/>Key Job Factors:<br/><br/><li> Level of accountability: Closely supervised</li><li> Level of decision making: Primarily routine tasks</li><li> Has contact with: Inside / Outside company</li><li> Supervision: Does not directly supervise or manage others</li><li> Physical Requirements: Light, occasional physical effort</li> Travel Percentage (%): <br/><br/>ESSENTIAL DUTIES: Essential duties are those basic duties which must be performed for the purpose of this job during a year. Essential Duties/Tasks:<br/><br/>1 Provides daily Human Resources office support for LACC Team Member (walk-in, email, or telephone) inquiries, offers answers to HR related questions or concerns, interprets basic company policy/procedures elevating to management when required. Assists with administrative duties which support local initiatives as needed. Creates in-house partner photo ID badges when requested. Protects and safeguards the integrity of confidential or sensitive information.<br/><br/>2 Assists in the talent acquisition processes through such tasks as telephone screening using established processes to determine a candidate’s eligibility for interview and scheduling appointments with hiring managers upon request. Contacts prospective new hires to complete the pre-onboarding process such as verbal job offers, background checks, sending orientation instructions, and COMP parking passes.<br/><br/>3 Serves as an additional front office reception team member to answer walk-in questions, telephone inquiries, provides accurate directions for travel to the venue and to destinations within (such as meeting rooms or exhibit halls), offers knowledgeable information regarding in-progress, upcoming events or activities held onsite, receives U.S. Mail and other parcel items routing them accordingly. Distributes building control items (ID, FOBs, Parking cards) to in-house partners as needed.<br/><br/>4 Assists with new hire orientation providing logistical support and guidance by preparing necessary forms in advance, greeting new team members, providing instructions on form completion, taking ID photographs, obtaining the appropriate employment verification identity documents and/or other relevant items. Supports and assists with employee engagement, wellness, and recognition activities as needed.<br/><br/>5 Assists in the maintenance of personnel/medical/confidential physical and electronic records, I-9, background checks, and other personnel related documents. Assists in the preparation of exit documents for separation to include final paycheck requests, employment checklists, exit interviews, contact information update forms, etc.<br/><br/>6 Responds to information requests such as EDD unemployment, disability, and other leave claims as well as backgrounds/employment verification inquiries escalating to management when necessary. Assists to review and complete worker’s compensation injury reports and responses to our company third party insurance (TPA) carrier.<br/><br/>7 Ensure the orderly appearance of the HR Office as well as the front reception desk. Maintaining inventory of general office supplies, completing requests for additional items through the LACC Office Manager when necessary. Other duties and projects as assigned", "qualifications": {"required": "Minimum education level of: Associate of Arts/Sciences Degree - Area of Study: Human Resources, Business, Communication, Hospitality/Tourism, Social studies, or a closely related field. \nPossess 2 years as an HR Assistant or the equivalency of education/experience or training. \nBilingual in English &amp; Spanish. \nRequired variable work schedule such as late hours, early mornings, extended hours, holidays, and weekends. \nRepresents the Los Angeles Convention Center, ASM Global, and the Human Resources Department in a professional manner at all times. \nMust be able to work in a dynamic environment, which includes events with large attendance and those which are high profile in nature. Possess the ability to adapt to changing assignments or priorities. \nPossess strong verbal and written communication skills with a working knowledge of standard office peripherals such as computers, copiers, and Office 365 software such as Excel/Outlook/Word. \nMaintains positive relations with all venue clients, guests, service providers, and LACC Team Members. \nInteracts effectively and calmly in high stress situations to achieve the best possible resolution. Provides service through referral to the proper department while maintaining ownership of the issue. \nMust have reliable transportation. ", "preferred": "Previous HR experience working in an events-based environment (such as an arena, convention center or stadium) with knowledge of convention/trade/consumer shows. \nUndergrad coursework in Human Resources, Business, Communication, Hospitality/Tourism, Social studies, or a closely related field. \nHR Certification and/or training courses from Society for Human Resource Management (SHRM-CP), Human Resource Certification Institute (HRCI-PHR), or similar certification/training."}, "skills": ["Human Resources", "Office 365", "Excel", "Outlook", "Word", "Communication", "Hospitality", "Tourism", "Spanish"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993955310"}