{"jobTitle": "Outbound Sales Development Representative (SDR)", "company": {"name": "EvenUp", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "In the past year, we scaled our customer base 5x for a SaaS product with an AE team of 10. We’re now at a point where we are looking for sales development representatives that can generate “top-of-funnel” leads. Opportunities will exist for strong performers to move into a closing role following a 12 - 24 month period.<br/><br/><strong>What you'll do: <br/><br/></strong><ul><li>Grow top of sales funnel through cold outbound campaigns</li><li>Generate sales-ready meetings and opportunities for Account Executives using EvenUp’s qualification criteria</li><li>Utilize your active listening skills to understand and uncover customer needs and business problems to effectively communicate how EvenUp can solve them</li><li>Identify high-potential areas of growth and develop and execute outbound strategies to get them on EvenUp</li><li>Develop strong sales and product knowledge</li><li>Partner with Growth, Marketing, and Customer Success to provide the best possible content and first impressions for new customers</li><li>Research companies and add prospects to our outbound list</li><li>Maintain accurate client relationship data within HubSpot<br/><br/></li></ul><strong>What we look for: <br/><br/></strong><ul><li>8+ months of experience in Sales Development</li><li>Familiarity with SaaS or service-oriented business models </li><li>Experienced with generating outbound leads </li><li>CRM experience</li><li>Excellent communication and interpersonal skills <br/><br/></li></ul><strong>Benefits &amp; Perks:<br/><br/></strong>Our goal is to empower every team member to contribute to our mission of fostering a more just world, regardless of their role, location, or level of experience. To that end, we offer:<br/><br/><ul><li>Choice of medical, dental, and vision insurance plans for you and your family</li><li>Flexible paid time off and 10+ holidays per year</li><li>A stipend to upgrade your home office for fully-remote roles</li><li>401k for US-based employees<br/><br/></li></ul><em>EvenUp is an equal opportunity employer. We are committed to diversity and inclusion in our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></em><strong>About EvenUp:<br/><br/></strong>EvenUp is a venture-backed generative AI startup that ensures injury victims are awarded the full value of their claims, expanding the $100B+ in awards granted to injury victims each year. Every year, the legal system has made it difficult for millions of ordinary people to seek justice, especially for folks without means or who come from underrepresented backgrounds. Our vision is to help these injury victims get the justice they deserve, irrespective of their income, demographics, or the quality of their legal representation.<br/><br/>EvenUp operates across a variety of personal injury cases, including motor vehicle accidents and negligence claims. Our ML-driven software empowers attorneys to accurately assess the value of these cases by doing a core part of their workflow (legal drafting), enabling them to secure larger settlements in record time. As EvenUp evaluates more cases, our proprietary data grows, enhancing the precision of our predictions and delivering more value to both attorneys and victims alike.<br/><br/>We are one of the fastest growing startups ($0 to $10M in ARR in &lt;2 years) and are funded by some of the best investors in the world, including Signalfire, Bain, and Bessemer, who led our recent $50M Series B.<br/><br/>", "postedDate": "2 weeks ago", "benefits": "Choice of medical, dental, and vision insurance plans for you and your family, Flexible paid time off and 10+ holidays per year, A stipend to upgrade your home office for fully-remote roles, 401k for US-based employees", "skills": ["Sales Development", "SaaS", "CRM", "Communication", "Interpersonal Skills"], "url": "https://www.linkedin.com/jobs/view/3993965018"}