{"jobTitle": "Senior Supply Chain Cost Analyst", "company": {"name": "Safran", "industry": "Aviation and Aerospace Component Manufacturing", "size": "10000+ employees", "location": "Brea, CA"}, "location": "Brea, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$98,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "Supply Chain and Analyst", "industry": "Aviation and Aerospace Component Manufacturing and Airlines and Aviation", "description": "Embark on a transformative career with Safran Passenger Innovations, where we are forging an unparalleled in-flight entertainment ecosystem. As an innovative company we design and engineer world-class In-Flight Entertainment and Connectivity (IFEC) solutions. Our products are constantly evolving, solving complex media distribution, playback, and networking problems in a secure, demanding on-wing environment. Safran IFEC products are utilized by many of the world’s premier air carriers. Step aboard and help us by creating the best in-flight experiences for today and beyond!", "responsibilities": "Monitor data on current supply chain operations, Collect and analyze data to reduce costs and increase efficiency, Gather and analyze forecasts to inform decision-making, Analyze and optimize supply chain operations to improve efficiency and reduce costs, Monitor key drivers of global commodities to evaluate their impact on raw material pricing, Monitoring commodities (electronics, metals and cables) and market industries, Using software to analyze market trends, Perform margin analysis to identify opportunities for cost reductions and strategies to increase profit margins, Evaluate the profitability of different commodities and make pricing decisions accordingly, Use financial reports to prepare analyses for senior management and track savings initiatives, Minimal travel may be required to visit supplier sites as needed.", "qualifications": {"required": "Bachelor's Degree in Accounting, Supply Chain Management, or related field or equivalent experience in a related field, 6-10 years of experience in a similar role working with budgets, models and cost/PPV analysis, Strong understanding of supply chain and/or commodities, Experience in electronics, metals, and cables commodities highly desired, Proficiency in data analysis tools such as Power BI or Tableau, Strong accounting and mathematical skills, Excellent interpersonal and communication skills, Ability to propose problems and propose effective solutions, Attention to detail and accuracy in data analysis.", "preferred": ""}, "skills": ["Supply Chain Management", "Data Analysis", "Cost Optimization", "Financial Reporting", "Interpersonal Skills", "Problem Solving"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The starting pay range for this position is $98,000 to $125,000 per year however, base pay offered may vary depending on skills, experience, job-related knowledge and location. In addition to a comprehensive package of health benefits that include company contributions, Safran Passenger Innovations offers a variety of additional benefits and perks to enhance your work-life balance experience including but not limited to: A home allowance to elevate your home workspace, Discretionary bonus program, Future financial security with a 401(k) program with company match, Paid time off covering vacations, personal time off and sick days, capped off by an exciting year-end holiday shutdown, Embraced flexibility with our alternative work schedule (9/80) to navigate your workweeks with every other Friday off.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993664373"}