{"jobTitle": "Senior Account Manager - Team Lead", "company": {"name": "ICF", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Business Consulting and Services", "description": "<strong>Description<br/><br/></strong><strong>Title:</strong> Senior Account Manager – Team Lead<br/><br/><strong>Location:</strong> Remote CA - Must be located in Southern California<br/><br/><strong>Ready to make a difference?<br/><br/></strong>ICF is seeking an experienced Senior Account Manager to influence multifamily property owners, property managers, and contractors to identify energy efficiency opportunities and facilitate participation in energy efficiency programs in Southern California. The Senior Account Manager will provide sales, account management, and field support for customers considering upgrading and retrofitting electrical and natural gas equipment and systems. Additionally, the Senior Account Manager will leverage their sales and management experience to lead and develop a team of highly functional Account Managers. The position is home-based, but will require some travel to meet with contractors, vendors, and customers in Southern California. The position will be responsible for building and maintaining an account base that achieves same year savings and builds following year pipeline.  <br/><br/>The Senior Account Manager position will be responsible for helping customers and trade allies understand the programs and incentives available to maximize their efficiency options. This will include working with end-users, dealers, and contractors to explain the benefits of efficiency measures and assisting customers through the enrollment process to achieve savings goals and establish repeat business through high quality customer service. <br/><br/><strong>Why You Will Love Working Here<br/><br/></strong><ul><li>Quality of life: Flexible workplace arrangements, work-life balance </li><li>Investment of the community: Donation matching, volunteer opportunities </li><li>Investment in you: Tuition reimbursement, access to professional development resources, 401k matching, Employee Stock Purchase Plan </li><li>And many, many more (Ask your recruiter for more details!) <br/><br/></li></ul><strong>What You Will Be Doing<br/><br/></strong><ul><li>Influence multifamily property owners, property managers, customers, and contractors (mechanical, electrical, plumbing, and general) by conducting calls and face-to-face meetings daily to identify energy efficiency opportunities and facilitate participation in energy efficiency programs. </li><li>Provide sales, account management, and field support for customers considering upgrading and retrofitting electrical and natural gas equipment and systems. </li><li>Responsible for building and maintaining an account base that achieves same year savings and builds following year pipelines.   </li><li>Contribute to the deployment of program marketing and outreach campaigns.  </li><li>Help customers, distributors, trade allies, and all stakeholders understand the programs and incentives available as well as the benefits of the energy efficiency measures. </li><li>Maintain strong ongoing communications with program participants to assess their needs and to receive feedback on their experience with the program.   </li><li>Contribute to the evolution of program strategies and the design of program features and services.  </li><li>Perform presentations and orientations to prospective property owners, property managers, customers, and contractors at industry conferences and association events.   </li><li>Meet individual goals assigned to you and contribute to team goals. Team goals are aligned with customer expectations. </li><li>Create and present weekly and monthly summary reports for the program manager, ICF leadership, and/or the client.    </li><li>Prepare status reports to accurately describe activities in the field and to monitor progress towards program goals on contractor/consultant participation and the completion of eligible projects.  </li><li>Lead a team of account managers, which includes training and mentoring junior staff. </li><li>Management of direct reports including but not limited to timesheet/expense approval, PTO approval, regular individual check-in meetings, and annual performance reviews. </li><li>Direct oversight of program budgets and tracking &amp; reporting Key Performance Indicators  </li><li>Assist in the direct support of client outreach, meetings and ad hoc requests including 1-on-1 monthly client meetings. Bring forth consolidated information from the AM team to help the client better understand challenges and opportunities. <br/><br/></li></ul><strong>What We Need You To Have (minimum Qualifications)<br/><br/></strong><ul><li>Bachelor’s Degree with 3+ years of experience in technology sales, engineering, and/or energy efficiency OR </li><li>6+ years of related work experience in equipment or technology sales, engineering, and/or energy efficiency programs </li><li>1+ years of experience in people management </li><li>Must have valid driver’s license and successfully pass a Motor Vehicle Records (MVR) check <br/><br/></li></ul><strong>What we would like you to have: <br/><br/></strong><ul><li>Experience in Energy Efficiency or Sustainability Consulting. </li><li>Knowledge of common electric and gas equipment used in the multifamily sector including domestic hot water systems, HVAC systems, interior/exterior lighting, pool pumps, etc.  </li><li>Familiarity with CRM systems such as Salesforce.  </li><li>Ability to guide and influence customers to opt for cost-effective energy efficiency solutions.  </li><li>Demonstrated capabilities in building and maintaining relationships with key market players in the energy sector. <br/><br/></li></ul> <br/><br/><strong>Professional Skills You Will Use<br/><br/></strong><ul><li>Excellent interpersonal skills with strong outreach and communications abilities. </li><li>Sales experience and the initiative to embrace continuous learning toward becoming an expert on the programs and technologies you represent. </li><li>Well-developed phone presence and high comfort level in initiating conversations. </li><li>Excellent written communications skills. </li><li>Self-motivated with the ability to work independently. </li><li>Strong organizational skills. <br/><br/></li></ul><strong>Working at ICF<br/><br/></strong>ICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.<br/><br/>We can only solve the world's toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO &amp; AA policy.<br/><br/>Reasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email icfcareercenter@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.<br/><br/>Read more about workplace discrimination rights, the Pay Transparency Statement, or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.<br/><br/><strong>Pay Range</strong> - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.<br/><br/>The pay range for this position based on full-time employment is:<br/><br/>$87,607.00 - $148,932.00<br/><br/>California Remote Office (CA99)", "responsibilities": "<ul><li>Influence multifamily property owners, property managers, customers, and contractors (mechanical, electrical, plumbing, and general) by conducting calls and face-to-face meetings daily to identify energy efficiency opportunities and facilitate participation in energy efficiency programs. </li><li>Provide sales, account management, and field support for customers considering upgrading and retrofitting electrical and natural gas equipment and systems. </li><li>Responsible for building and maintaining an account base that achieves same year savings and builds following year pipelines.   </li><li>Contribute to the deployment of program marketing and outreach campaigns.  </li><li>Help customers, distributors, trade allies, and all stakeholders understand the programs and incentives available as well as the benefits of the energy efficiency measures. </li><li>Maintain strong ongoing communications with program participants to assess their needs and to receive feedback on their experience with the program.   </li><li>Contribute to the evolution of program strategies and the design of program features and services.  </li><li>Perform presentations and orientations to prospective property owners, property managers, customers, and contractors at industry conferences and association events.   </li><li>Meet individual goals assigned to you and contribute to team goals. Team goals are aligned with customer expectations. </li><li>Create and present weekly and monthly summary reports for the program manager, ICF leadership, and/or the client.    </li><li>Prepare status reports to accurately describe activities in the field and to monitor progress towards program goals on contractor/consultant participation and the completion of eligible projects.  </li><li>Lead a team of account managers, which includes training and mentoring junior staff. </li><li>Management of direct reports including but not limited to timesheet/expense approval, PTO approval, regular individual check-in meetings, and annual performance reviews. </li><li>Direct oversight of program budgets and tracking &amp; reporting Key Performance Indicators  </li><li>Assist in the direct support of client outreach, meetings and ad hoc requests including 1-on-1 monthly client meetings. Bring forth consolidated information from the AM team to help the client better understand challenges and opportunities. <br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Bachelor’s Degree with 3+ years of experience in technology sales, engineering, and/or energy efficiency OR </li><li>6+ years of related work experience in equipment or technology sales, engineering, and/or energy efficiency programs </li><li>1+ years of experience in people management </li><li>Must have valid driver’s license and successfully pass a Motor Vehicle Records (MVR) check <br/><br/></li></ul>", "preferred": "<ul><li>Experience in Energy Efficiency or Sustainability Consulting. </li><li>Knowledge of common electric and gas equipment used in the multifamily sector including domestic hot water systems, HVAC systems, interior/exterior lighting, pool pumps, etc.  </li><li>Familiarity with CRM systems such as Salesforce.  </li><li>Ability to guide and influence customers to opt for cost-effective energy efficiency solutions.  </li><li>Demonstrated capabilities in building and maintaining relationships with key market players in the energy sector. <br/><br/></li></ul>"}, "skills": ["Sales", "Account Management", "Energy Efficiency", "CRM", "Salesforce", "Customer Service", "Communication", "Leadership", "Team Management", "Training", "Mentoring", "Budget Management", "Reporting", "Project Management", "Client Management"], "postedDate": "1 week ago", "benefits": "<ul><li>Quality of life: Flexible workplace arrangements, work-life balance </li><li>Investment of the community: Donation matching, volunteer opportunities </li><li>Investment in you: Tuition reimbursement, access to professional development resources, 401k matching, Employee Stock Purchase Plan </li><li>And many, many more (Ask your recruiter for more details!) <br/><br/></li></ul>", "remoteWork": "Yes", "salary": {"amount": "87,607.00 - 148,932.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3993656497"}