{"jobTitle": "Marketing Assistant", "company": {"name": "Brand Avenue", "industry": "Advertising Services", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "3,900.00/mo - 5,700.00/mo", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "<strong>Department: </strong>PR / Social Media<br/><br/><strong>Location: </strong>Los Angeles<br/><br/><strong>Compensation: </strong>$3,900 - $5,700 / month<br/><br/><strong>Description<br/><br/></strong><strong>About the Role:</strong> A Marketing Assistant at Brand Avenue supports the marketing department in executing campaigns, conducting market research, and analyzing data. This role involves administrative tasks and creative input to help develop and implement marketing strategies that drive brand awareness and sales.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Key Responsibilities<br/><br/></strong><ul><li>Assist in the creation and execution of marketing campaigns.</li><li>Conduct market research to identify trends, target audiences, and competitor activities.</li><li>Analyze campaign performance data and prepare reports for the marketing team.</li><li>Coordinate and manage marketing events and promotional activities.</li><li>Collaborate with designers, copywriters, and other team members to produce marketing materials.</li><li>Maintain and update the company's social media platforms.</li><li>Handle administrative tasks such as scheduling meetings, preparing presentations, and maintaining marketing databases.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Skills, Knowledge and Expertise<br/><br/></strong><ul><li>Bachelor's degree in Marketing, Business, or a related field.</li><li>Previous experience in a marketing role is a plus but not required.</li><li>Strong written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite and familiarity with marketing software/tools.</li><li>Excellent organizational and multitasking abilities.</li><li>Creative mindset with attention to detail.</li><li>Ability to work independently and as part of a team.<br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Benefits:<br/><br/></strong><ul><li>Competitive salary with opportunities for bonuses.</li><li>Comprehensive health insurance package.</li><li>Opportunities for professional development and career advancement.</li><li>Supportive and collaborative work environment.</li><li>Access to ongoing training and development programs.</li></ul>", "responsibilities": "Assist in the creation and execution of marketing campaigns. Conduct market research to identify trends, target audiences, and competitor activities. Analyze campaign performance data and prepare reports for the marketing team. Coordinate and manage marketing events and promotional activities. Collaborate with designers, copywriters, and other team members to produce marketing materials. Maintain and update the company's social media platforms. Handle administrative tasks such as scheduling meetings, preparing presentations, and maintaining marketing databases.", "qualifications": {"required": "Bachelor's degree in Marketing, Business, or a related field. Previous experience in a marketing role is a plus but not required. Strong written and verbal communication skills. Proficiency in Microsoft Office Suite and familiarity with marketing software/tools. Excellent organizational and multitasking abilities. Creative mindset with attention to detail. Ability to work independently and as part of a team.", "preferred": ""}, "skills": ["Marketing", "Market Research", "Campaign Management", "Event Management", "Social Media", "Microsoft Office Suite", "Marketing Software", "Communication", "Organization", "Multitasking", "Creativity", "Teamwork"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Competitive salary with opportunities for bonuses. Comprehensive health insurance package. Opportunities for professional development and career advancement. Supportive and collaborative work environment. Access to ongoing training and development programs.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993520695"}