{"jobTitle": "Operations Associate", "company": {"name": "Fourth Floor", "location": "Chino Hills, CA"}, "location": "Chino Hills, CA", "jobType": "Contract", "employmentType": "Contract", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "A popular fashion brand is seeking an Operations Associate to join their team at their Distribution Center in Chino Hills. This will be a temp-to-hire role.", "responsibilities": "Provide outstanding service to customers by efficiently managing outbound and return tasks. Collaborate closely with the Outbound Returns Manager to meet all fulfillment SLAs Prioritizing assistance in manual return processing SOP. Communicate any issues or updates promptly to internal teams and third-party logistics (3PL) partners. Work diligently in the warehouse daily, actively engaged in returns manual processes to ensure adherence to SLAs. Maintain a keen eye for identifying issues in the returns process and escalate them promptly to the manager. Support with reporting for both Outbound and Returns whenever needed. Ensure timely processing of returns and provide necessary information to other departments as required. Follow on Outbound Status Update from 3PL. Assist with any Outbound/Returns tasks as needed. Assist with Outbound and Returns Reports when needed.", "qualifications": {"required": "1 year of Customer service experience with a track record of providing excellent customer service Previous experience in outbound and returns management is preferred. Strong attention to detail and ability to work efficiently in a fast-paced environment. Excellent communication skills to liaise effectively with internal teams and 3PL partners. Proactive approach to problem-solving, with the ability to identify and address issues promptly. Flexibility to work in a warehouse setting and contribute to manual processes as needed. Basic Excel & Google Sheets experience Ecom Experience", "preferred": ""}, "skills": ["Customer Service", "Outbound", "Returns Management", "Communication", "Problem Solving", "Excel", "Google Sheets", "Ecom"], "postedDate": "2 weeks ago", "salary": {"amount": "20.00/hr - 22.00/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3993675546"}