{"jobTitle": "Part-Time Warehouse Associate", "company": {"name": "Scholastic", "location": "Irwindale, CA"}, "location": "Irwindale, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Education Administration Programs, Media Production, and Book and Periodical Publishing", "description": "<strong>Job Description:<br/><br/></strong><strong>JOIN OUR IRWINDALE TEAM!<br/><br/></strong><strong>Hiring Part-Time Warehouse Associates<br/><br/></strong><strong>Starting Pay = $18.00/Hour<br/><br/></strong><strong>Part-Time Work Schedule<br/><br/></strong><strong>Working Monday thru Friday, 5:00AM to 1:30PM<br/><br/></strong><strong>Essential Duties And Responsibilities<br/><br/><br/></strong><ul><li>Assist in the production of book fairs, by packing metal cases, boxes, and displays with book and non-book product, according to corporate process and procedure and meeting productivity and quality standards. </li><li>Demonstrate proficiency in packing all components and sub-components for all cases, boxes, and displays. </li><li>Consistently meet minimum required production, accuracy or quality standards for the work performed. </li><li>Ensure condition of all outbound cases, boxes, and displays are clean, safe, and in good condition. </li><li>Assist in the processing of returned book fairs, by unpacking metal cases, boxes, and displays with book and non-book product, according to corporate process and procedure and meeting productivity and quality standards. </li><li>Monitor inventory levels on applicable component product lines to ensure book fairs can be properly packed. </li><li>Learn and demonstrate basic scanner proficiency, i.e. item inquiries and requesting replenishment of Pick locations. </li><li>Assist in the picking and packing of customer reorders</li><li>Ensure that your work area is neat, clean, safe, and organized at all times. </li><li>Individually, and in partnership with other co-workers, perform seasonal inventory production-line resets. </li><li>Learn and demonstrate proficiency in all Fair Finishing and Assembly functions, including the Quality Assurance scanning functions. </li><li>Participate and assist in Physical Inventory functions, including the counting of inventory.Participate and assist in conducting Customer Appreciation Warehouse Sale Events. </li><li>Responsible for the careful handling of all merchandise at all times. </li><li>Ensure that all warehouse equipment and tools are properly utilized to increase productivity, efficiency, and safety; report any unsafe conditions, damaged equipment or injury (to self or co-worker) to your supervisor or manager immediately. </li><li>Utilize proper techniques for lifting, packing, and handling heavy objects, climbing ladders and pushing/pulling display cases. </li><li>Accurately and timely complete Labor Data Collection Cards to according to company standards. </li><li>May operate motorized pallet jacks upon successful completion of the Scholastic Reading Events' power equipment training program. </li><li>Maintain attendance and punctuality as required by assigned work schedule and within company standards. </li><li>Maintain a courteous and positive relationship with all co-workers and customers. </li><li>Drug and alcohol free policy compliance. </li><li>Other duties as assigned. <br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>QUALIFICATIONS <br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><br/><ul><li>High School Diploma or GED Certificate preferred. </li><li>Ability to demonstrate basic product scanner proficiency (i.e., ordering replenishment) effectively with minimal errors. </li><li>Strong team player and the ability to get along with co-workers. </li><li>Good verbal/written communication skills, basic math skills, and ability to read documents in English, such as safety rules, operating instructions and procedure manuals. <br/><br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><br/><ul><li>Must be able to lift boxes that weigh up to 50 lbs occasionally on a daily basis. </li><li>Must be able to lift boxes that weigh up to 30 lbs to a height of 70” occasionally on a daily basis. </li><li>Must be able to push wheeled cases, which may weigh in excess of 300 lbs, with an initial force of up to 50 lbs and a sustained force of up to 30 lbs. </li><li>Must be able to stand, reach above and below the shoulders, squat, bend and kneel as necessary to perform the job. </li><li>Must be able to tolerate work in a non-air conditioned environment. </li><li>Must be able to accurately follow specific instructions for multiple detailed assembly processes. <br/><br/><br/></li></ul>While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel; reach with hands and arms; and talk or hear. The employee frequently is required to stand; walk; and stoop, kneel, crouch or crawl. The employee is occasionally required to sit and climb or balance. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.<br/><br/><strong>Time Type:<br/><br/></strong>Part time<br/><br/><strong>Job Type:<br/><br/></strong>Regular Seasonal<br/><br/><strong>Job Family Group:<br/><br/></strong>Distrib &amp; Matls Mgmt<br/><br/><strong>Location Region/State:<br/><br/></strong>California<br/><br/><strong>EEO Statement:<br/><br/></strong>Scholastic is an Equal Opportunity Employer. Our policy is clear: there shall be no discrimination on the basis of race, religion, color, sex, pregnancy, national origin, marital status, sexual orientation, gender identity or expression, age, non-disqualifying physical or mental disability, or status as a disabled veteran or Vietnam veteran. Those factors shall not influence the determination of qualifications for a job or other opportunity within the company. Further, all personnel actions (such as compensation, tuition aid, benefits, transfers, promotions, and dismissals, company-sponsored training, social and recreational programs) shall be administered without discrimination.<br/><br/>EEO is the Law Poster<br/><br/>EEO Scholastic Policy Statement<br/><br/>Pay Transparency Provision", "responsibilities": "Assist in the production of book fairs, by packing metal cases, boxes, and displays with book and non-book product, according to corporate process and procedure and meeting productivity and quality standards. Demonstrate proficiency in packing all components and sub-components for all cases, boxes, and displays. Consistently meet minimum required production, accuracy or quality standards for the work performed. Ensure condition of all outbound cases, boxes, and displays are clean, safe, and in good condition. Assist in the processing of returned book fairs, by unpacking metal cases, boxes, and displays with book and non-book product, according to corporate process and procedure and meeting productivity and quality standards. Monitor inventory levels on applicable component product lines to ensure book fairs can be properly packed. Learn and demonstrate basic scanner proficiency, i.e. item inquiries and requesting replenishment of Pick locations. Assist in the picking and packing of customer reorders Ensure that your work area is neat, clean, safe, and organized at all times. Individually, and in partnership with other co-workers, perform seasonal inventory production-line resets. Learn and demonstrate proficiency in all Fair Finishing and Assembly functions, including the Quality Assurance scanning functions. Participate and assist in Physical Inventory functions, including the counting of inventory.Participate and assist in conducting Customer Appreciation Warehouse Sale Events. Responsible for the careful handling of all merchandise at all times. Ensure that all warehouse equipment and tools are properly utilized to increase productivity, efficiency, and safety; report any unsafe conditions, damaged equipment or injury (to self or co-worker) to your supervisor or manager immediately. Utilize proper techniques for lifting, packing, and handling heavy objects, climbing ladders and pushing/pulling display cases. Accurately and timely complete Labor Data Collection Cards to according to company standards. May operate motorized pallet jacks upon successful completion of the Scholastic Reading Events' power equipment training program. Maintain attendance and punctuality as required by assigned work schedule and within company standards. Maintain a courteous and positive relationship with all co-workers and customers. Drug and alcohol free policy compliance. Other duties as assigned.", "qualifications": {"required": "Ability to demonstrate basic product scanner proficiency (i.e., ordering replenishment) effectively with minimal errors. Strong team player and the ability to get along with co-workers. Good verbal/written communication skills, basic math skills, and ability to read documents in English, such as safety rules, operating instructions and procedure manuals.", "preferred": "High School Diploma or GED Certificate"}, "skills": ["Scanner Proficiency", "Teamwork", "Communication", "Math Skills", "Reading Comprehension"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993532711"}