{"jobTitle": "Manager, Campaign Management", "company": {"name": "Influential", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000 - $100,000", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Influential is a key leader in the Influencer Marketing space (and the LARGEST influencer marketing company in the world, by revenue). Trusted by over 60% of the Fortune 500, we connect our clients with a network of over 3 Million social media influencers.<br/><br/>We are looking for team members who are thrilled by the idea of playing an active role in shaping how companies engage with customers through TikTok, Instagram, Facebook, &amp; more. Our team is built of people from across the country who have already moved the needle in social media, influencer marketing, and various sectors of technology. Ready to join us?!<br/><br/><strong>What we offer:<br/><br/></strong><ul><li>Remote company - work from home!</li><li>Competitive compensation</li><li>Flexible time off with inclusive holiday benefits</li><li>Comprehensive medical, dental &amp; vision insurance for employees</li><li>Fully vested 401(k) matching</li><li>An awesome collaborative work culture, a diverse team, and more!<br/><br/></li></ul>Influential is looking for an experienced Manager to join our Campaign Management team. The Manager will implement the day-to-day creator strategy and campaign execution for Fortune 500 clients. The ideal candidate will support the campaign management team with the development and execution of influencer marketing campaigns utilizing our proprietary technology to connect top brands with our broad network of influencers.<br/><br/><strong>In general, on a typical day you will:<br/><br/></strong><ul><li>Be accountable for the overall success of Influential's social campaigns</li><li>Build and execute creator strategies specific to campaigns, refine current success metrics, and introduce new success metrics</li><li>Support training of all aspects of planning and audience reporting, use of research tools, as well as the development of writing and presentation skills</li><li>Liaise between the campaign management team and other key internal groups on each account (account management, research/analytics, operations) to ensure client needs are being met</li><li>Oversee Influencer \"casting\", negotiation, contracting and content management across different brand campaigns.</li><li>Knowledge of offline and online space; strong understanding of the relationship between brand, media, and consumer</li><li>Well versed in the influencer marketing space or strong interest in the industry</li><li>Working knowledge of online performance tracking and brand measurement tools</li><li>Strong organizational skills with the ability to multitask, detail-oriented with attention to schedules and timelines, and maintenance of records and materials</li><li>A self-starter who loves collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams.<br/><br/></li></ul><strong>Being a Manager, Campaign Management requires:<br/><br/></strong><ul><li>5+ years of experience working in digital, advertising, or influencer marketing </li><li>Experience managing and coordinating projects in a fast-paced/startup environment</li><li>Established and extensive network of managers/agents or Influencer contacts.</li><li>Strong negotiating skills and management of individual campaign Influencer budgets well into the six figures.</li><li>In depth knowledge of all major social platforms (Instagram, Facebook, Pinterest, TikTok, Twitter, YouTube)</li><li>Deep knowledge of offline and online space; strong understanding of the relationship between brand, media, and consumer</li><li>Working knowledge of online performance tracking and brand measurement tools</li><li>Strong organizational skills with the ability to multitask, detail-oriented with attention to schedules and timelines, and maintenance of records and materials</li><li>Continuous education on the latest trends and innovations within the world of social</li><li>A self-starter who loves collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams</li><li>Bachelor's degree or equivalent experience<br/><br/></li></ul><strong>Bonus points if:<br/><br/></strong><ul><li>Experience with on-site or experiential Influencer events</li><li>Experience managing production elements of an Influencer campaign.</li><li>Experience at a marketing-tech or media startup</li><li>You're passionate about social media and/or influencer marketing<br/><br/></li></ul><strong>Salary range:<br/><br/></strong>$80,000 - $100,000<br/><br/><strong>About Influential<br/><br/></strong>Influential is an AI-powered technology and is the largest influencer marketing company in the world, by revenue. Leveraging a network of over 3 Million social media influencers, Influential's platform powers seamless talent discovery, comprehensive brand safety, content creation, media, and measurement. Through strategic partnerships with first and third-party data providers, Influential enables exclusive targeting and measurement solutions, including both online and offline attribution, such as sales lift, TV tune-in lift, foot traffic, and eComm sales. Influential works with Fortune 500 brands, including McDonald's, NBA, General Mills, Ford, and every major studio. With offices in Los Angeles, NYC, and Las Vegas, Influential is a developer partner of IBM Watson, a strategic partner of WME and Oracle, and a Facebook and Instagram Marketing Partner. (www.influential.co)<br/><br/>Influential is an equal opportunity employer.<br/><br/>Privacy Notice for California Job Applicants", "responsibilities": "The Manager will implement the day-to-day creator strategy and campaign execution for Fortune 500 clients. The ideal candidate will support the campaign management team with the development and execution of influencer marketing campaigns utilizing our proprietary technology to connect top brands with our broad network of influencers.<br/><br/><strong>In general, on a typical day you will:<br/><br/></strong><ul><li>Be accountable for the overall success of Influential's social campaigns</li><li>Build and execute creator strategies specific to campaigns, refine current success metrics, and introduce new success metrics</li><li>Support training of all aspects of planning and audience reporting, use of research tools, as well as the development of writing and presentation skills</li><li>Liaise between the campaign management team and other key internal groups on each account (account management, research/analytics, operations) to ensure client needs are being met</li><li>Oversee Influencer \"casting\", negotiation, contracting and content management across different brand campaigns.</li><li>Knowledge of offline and online space; strong understanding of the relationship between brand, media, and consumer</li><li>Well versed in the influencer marketing space or strong interest in the industry</li><li>Working knowledge of online performance tracking and brand measurement tools</li><li>Strong organizational skills with the ability to multitask, detail-oriented with attention to schedules and timelines, and maintenance of records and materials</li><li>A self-starter who loves collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams.<br/><br/></li></ul>", "qualifications": {"required": "5+ years of experience working in digital, advertising, or influencer marketing, Experience managing and coordinating projects in a fast-paced/startup environment, Established and extensive network of managers/agents or Influencer contacts., Strong negotiating skills and management of individual campaign Influencer budgets well into the six figures., In depth knowledge of all major social platforms (Instagram, Facebook, Pinterest, TikTok, Twitter, YouTube), Deep knowledge of offline and online space; strong understanding of the relationship between brand, media, and consumer, Working knowledge of online performance tracking and brand measurement tools, Strong organizational skills with the ability to multitask, detail-oriented with attention to schedules and timelines, and maintenance of records and materials, Continuous education on the latest trends and innovations within the world of social, A self-starter who loves collaboration and is open to feedback, comfortable working independently as well as influencing cross-functional teams, Bachelor's degree or equivalent experience", "preferred": "Experience with on-site or experiential Influencer events, Experience managing production elements of an Influencer campaign., Experience at a marketing-tech or media startup, You're passionate about social media and/or influencer marketing"}, "skills": ["Influencer Marketing", "Social Media", "Digital Marketing", "Campaign Management", "Project Management", "Negotiation", "Social Media Marketing", "Marketing Strategy", "Brand Management", "Content Marketing", "Social Media Strategy", "Digital Strategy", "Marketing", "Advertising", "Social Media Management", "Marketing Management", "Digital Media", "Social Media Analytics", "Social Media Advertising", "Marketing Communications", "Brand Strategy", "Digital Advertising", "Media Planning", "Media Buying", "Performance Marketing", "Marketing Research", "Market Research", "Analytics", "Data Analysis", "Data Interpretation", "Data Visualization", "Communication", "Teamwork", "Collaboration", "Leadership", "Problem Solving", "Time Management", "Organization", "Detail Oriented", "Strategic Thinking", "Creativity", "Innovation", "Entrepreneurship", "Startup", "Fast Paced Environment", "Remote Work", "Work From Home"], "postedDate": "2 weeks ago", "benefits": "Remote company - work from home!, Competitive compensation, Flexible time off with inclusive holiday benefits, Comprehensive medical, dental &amp; vision insurance for employees, Fully vested 401(k) matching, An awesome collaborative work culture, a diverse team, and more!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993913721"}