{"jobTitle": "Research Support Assistant - Emergency Department (Full-Time, On-Site)", "company": {"name": "Cedars-Sinai", "industry": "Hospitals and Health Care", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$19.50 - $29.87", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "Come join our team! The Research Support Assistant provides clerical support to Clinical Research Associate, Clinical Research Coordinator, Research Program Administrator, Research Nurse, or Research Manager. This role will provide the administrative support for research protocols by providing document management, obtaining proper signatures, and maintaining samples, kits, and study supplies. This role will comply with all federal, local, FDA, IRB, and HIPAA guidelines and regulations pertaining to the study and patient care.", "responsibilities": "Completes data entry and manages documents for research activities and provides clerical support to the department. Handles the process of obtaining the proper signatures for research grants and protocols. Provides administrative support for research protocols. Completes sample preparation and shipping and maintains study supplies and kits. Responsible for obtaining outside research records for patients enrolled in protocols. Schedules research meetings. Ensures compliance with all federal and local agencies including the Food and Drug Administration (FDA and local Institutional Review Board. Maintains research practices using Good Clinical Practice (GCP) guidelines. Maintains strict patient confidentiality according to HIPAA regulations and applicable law. Participates in required training and education programs.", "qualifications": {"required": "High School graduate or equivalent required.", "preferred": "No experience required. Previous coursework and experience in related field preferred. No license & certification required. Certified Nursing Assistant (CNA), CA Phlebotomy Certification, or Emergency Medical Technician preferred upon hire."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993266103"}