{"jobTitle": "Senior Procurement Manager", "company": {"name": "Intelletec", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Supply Chain and Purchasing", "industry": "Technology, Information and Media and Retail Health and Personal Care Products", "description": "Our client is a leader in Health and Wellness and is looking to expand their Operations team with a Manager of Supply Chain Operations This role will focus on procurement, fulfillment, shipping, and planning for their omnichannel business. Great opportunity to interact with senior leadership and make an impact.\n\nResponsibilities:\n\n* Oversee the entire procurement process with both current and new suppliers, from sourcing to purchasing.\n* Identify, assess, qualify, and onboard suppliers for existing and future product and packaging needs.\n* Lead the purchasing process for all product and packaging suppliers, ensuring comprehensive coverage.\n* Develop and monitor KPIs, data, and reports to assess supplier performance and drive continuous improvements.\n* Proactively identify and address risks of delays or deviations, and document and resolve any potential issues.\n* Collaborate with suppliers on product quality, testing, release, and freight preparation.\n\nQualifications:\n\n* CPG experience a strong plus\n* Procurement Experience: 5+ years of experience in procurement, sourcing, or supply chain management.\n* Supplier Management: Proven experience in identifying, evaluating, qualifying, and onboarding suppliers.\n* Industry Knowledge: Experience in the relevant industry (e.g., health and wellness, consumer goods) is advantageous.\n* Leadership: Experience leading procurement teams and managing end-to-end purchasing", "responsibilities": "Oversee the entire procurement process with both current and new suppliers, from sourcing to purchasing. Identify, assess, qualify, and onboard suppliers for existing and future product and packaging needs. Lead the purchasing process for all product and packaging suppliers, ensuring comprehensive coverage. Develop and monitor KPIs, data, and reports to assess supplier performance and drive continuous improvements. Proactively identify and address risks of delays or deviations, and document and resolve any potential issues. Collaborate with suppliers on product quality, testing, release, and freight preparation.", "qualifications": {"required": "Procurement Experience: 5+ years of experience in procurement, sourcing, or supply chain management. Supplier Management: Proven experience in identifying, evaluating, qualifying, and onboarding suppliers. Industry Knowledge: Experience in the relevant industry (e.g., health and wellness, consumer goods) is advantageous. Leadership: Experience leading procurement teams and managing end-to-end purchasing", "preferred": "CPG experience a strong plus"}, "skills": ["Procurement", "Sourcing", "Supply Chain Management", "Supplier Management", "CPG"], "postedDate": "3 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993605142"}