{"jobTitle": "Senior Logistics Coordinator", "company": {"name": "Imperative Logistics", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Customer Service, and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>SUMMARY</strong><p>The Logistics Coordinator II is the liaison between customers, vendors, and other internal/external stakeholders. Our mission is to add value to our clients’ businesses and supply chains, by offering a complementary platform of premier logistics solutions that specialize in sensitive, time-definite, high-value, and white-glove shipments.</p><p><br/></p><p><strong>ESSENTIAL JOB FUNCTIONS</strong></p><ul><li>Deliver exceptional customer service by means of excellent quality performance</li><li>Timely communication with stakeholders via email and phone</li><li>Timely acknowledgement of customer complaints and issues resolution with periodic updates as needed</li><li>Keep records of customer contact, transactions, comments, and complaints. Ensure documentation is complete, professional, and accurate</li><li>Follow Standard Operating Procedures and directives as outlined by leadership and the company guidelines</li><li>Communicating and coordinating with colleagues as necessary</li><li>Train other employees within the department on an as-needed basis</li><li>Adhere to company KPI’s (key performance indicators)</li></ul><p><br/></p><p><strong>QUALIFICATIONS </strong></p><ul><li>Senior: 3+ years industry experience</li><li>Experience in a customer service role; with excellent customer service and communication skills</li><li>Ability to be patient and understanding, especially in the midst of challenging situations</li><li>Comfortable using computers and Microsoft Suite, specifically Excel</li><li>Ability to effectively problem solve</li><li>Ability to work independently and a part of a team</li><li>Increased level of proficiency is expected in related tasks as it pertains to the job</li><li>Preferred experience: Cargo Wise or equivalent system experience</li></ul><p><br/></p><p>Compensation: $50,000 - $65,000 Annually, the pay range dependent on a number of factors including location and experience.</p><p><br/></p><p><strong>PHYSICAL REQUIREMENTS</strong></p><p>The position is in an indoor, office environment, requires the ability to communicate with internal and external customers or vendors verbally and in writing, sit for periods of time, operate typical office equipment which requires seeing and the use of a keyboard.</p>", "responsibilities": "Deliver exceptional customer service by means of excellent quality performanceTimely communication with stakeholders via email and phoneTimely acknowledgement of customer complaints and issues resolution with periodic updates as neededKeep records of customer contact, transactions, comments, and complaints. Ensure documentation is complete, professional, and accurateFollow Standard Operating Procedures and directives as outlined by leadership and the company guidelinesCommunicating and coordinating with colleagues as necessaryTrain other employees within the department on an as-needed basisAdhere to company KPI’s (key performance indicators)", "qualifications": {"required": "Senior: 3+ years industry experienceExperience in a customer service role; with excellent customer service and communication skillsAbility to be patient and understanding, especially in the midst of challenging situationsComfortable using computers and Microsoft Suite, specifically ExcelAbility to effectively problem solveAbility to work independently and a part of a teamIncreased level of proficiency is expected in related tasks as it pertains to the job", "preferred": "Cargo Wise or equivalent system experience"}, "skills": ["Customer Service", "Communication", "Microsoft Suite", "Excel", "Problem Solving", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Medical insuranceVision insuranceDental insurance401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993655479"}