{"jobTitle": "Compliance Officer", "company": {"name": "Augment Jobs", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Legal", "industry": "Technology, Information and Internet", "description": "The Compliance Officer will be responsible for developing, implementing, and monitoring compliance programs to ensure adherence to legal and regulatory requirements. This role will involve evaluating business processes, conducting audits, and providing guidance to mitigate compliance risks. The ideal candidate will have a strong understanding of industry regulations and excellent analytical skills.", "responsibilities": "Develop and maintain compliance policies and procedures. Monitor and assess the company’s operations to ensure adherence to legal and regulatory requirements. Conduct regular audits and risk assessments to identify potential compliance issues. Provide training and guidance to employees on compliance-related matters. Investigate and resolve compliance violations or concerns. Prepare and present reports on compliance status to senior management and regulatory bodies. Stay updated on industry regulations and best practices to ensure the company’s compliance framework remains current. Collaborate with external auditors and regulatory agencies as needed.", "qualifications": {"required": "Bachelor’s degree in Business, Law, Finance, or a related field; professional certifications (e.g., Certified Compliance & Ethics Professional - CCEP) preferred. 2-5 years of experience in compliance, legal, or risk management roles. Strong understanding of relevant laws, regulations, and industry standards. Excellent analytical, problem-solving, and organizational skills. Strong attention to detail and the ability to manage multiple tasks simultaneously. Effective communication and interpersonal skills with the ability to work independently and as part of a team. Proficiency in compliance management software and Microsoft Office Suite.", "preferred": "Not specified"}, "skills": ["Compliance", "Legal", "Risk Management", "Analytical Skills", "Problem-Solving", "Organizational Skills", "Communication", "Interpersonal Skills"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive salary and performance-based bonuses. Health, dental, and vision insurance. Retirement savings plan with company match. Paid time off and holidays. Professional development opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993924158"}