{"jobTitle": "Data Analyst, Revenue Operations", "company": {"name": "Procore Technologies", "location": "Orange County, CA", "industry": "Software Development"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Software Development", "description": "We are seeking a highly skilled and motivated Data Analyst, Revenue Operations to join the Revenue Insights team within the Corporate Strategy & Operations organization at Procore. This role will be responsible for a majority of the run-the-business activities to keep data current within important processes. As a Data Analyst, Revenue Operations you will drive the Revenue Insights data initiatives forward by providing comprehensive analysis, maintaining and building data solutions, and delivering reporting. You will collaborate closely with cross-functional teams to execute against our strategic priorities and ensure the successful delivery of key projects.<br/><br/>This position will report to the Manager, Sales Insights. It will be based in one of Procore’s offices in the United States, or fully remote. We’re looking for someone to join us immediately.<br/><br/>What You’ll Do<br/><br/>• Support run-the-business reporting activities, including data and dashboard maintenance and enhancements.<br/>• Act as the primary point of contact on day-to-day data needs, such as new data requests and inquiries.<br/>• Liaise between Revenue Insights and IT Data Architects, communicate business priorities, manage timelines, and inform on the needs of either team.<br/>• Automate data and reports to improve data integrity, efficiency, accuracy, and reliability. <br/>• Develop and maintain data solutions to support revenue and operational initiatives.<br/>• Collaborate with key stakeholders across departments to gather insights, align priorities, and build data solutions.<br/><br/>What We're Looking For:<br/><br/>• Bachelor's degree in Analytics, Engineering, Economics, Finance, Business, or data-related field, or commensurate experience.<br/>• 4+ years of experience in analytics, data automation, data engineering, or operations. <br/>• Strong data analytical skills maintain, process, create complex datasets and generate insights.<br/>• Strong communication with the ability to collaborate with diverse stakeholders.<br/>• Proven track record of delivering results in a fast-paced, dynamic environment.<br/>• Proficiency in SQL, Python, or other data manipulation and creation tools is required. <br/>• Experience in B2B SaaS Sales data, Revenue Operations function, Tableau, Salesforce, and B2B sales tools a plus.<br/><br/>Additional Information<br/><br/>Base Pay Range $72,280 - $99,385. Eligible for Bonus Incentive Compensation. Procore is committed to offering competitive, fair, and commensurate compensation, and has provided an estimated pay range for this role. Actual compensation will be based on a candidate’s job-related skills, experience, education or training, and location.<br/><br/>Perks & Benefits<br/><br/>At Procore, we invest in our employees and provide a full range of benefits and perks to help you grow and thrive. From generous paid time off and healthcare coverage to career enrichment and development programs, learn more details about what we offer and how we empower you to be your best.<br/><br/>About Us<br/><br/>Procore Technologies is building the software that builds the world. We provide cloud-based construction management software that helps clients more efficiently build skyscrapers, hospitals, retail centers, airports, housing complexes, and more. At Procore, we have worked hard to create and maintain a culture where you can own your work and are encouraged and given resources to try new ideas. Check us out on Glassdoor to see what others are saying about working at Procore.<br/><br/>We are an equal-opportunity employer and welcome builders of all backgrounds. We thrive in a diverse, dynamic, and inclusive environment. We do not tolerate discrimination against employees on the basis of age, color, disability, gender, gender identity or expression, marital status, national origin, political affiliation, race, religion, sexual orientation, veteran status, or any other classification protected by law.<br/><br/>If you'd like to stay in touch and be the first to hear about new roles at Procore, join our Talent Community.", "responsibilities": "• Support run-the-business reporting activities, including data and dashboard maintenance and enhancements.<br/>• Act as the primary point of contact on day-to-day data needs, such as new data requests and inquiries.<br/>• Liaise between Revenue Insights and IT Data Architects, communicate business priorities, manage timelines, and inform on the needs of either team.<br/>• Automate data and reports to improve data integrity, efficiency, accuracy, and reliability. <br/>• Develop and maintain data solutions to support revenue and operational initiatives.<br/>• Collaborate with key stakeholders across departments to gather insights, align priorities, and build data solutions.", "qualifications": {"required": "Bachelor's degree in Analytics, Engineering, Economics, Finance, Business, or data-related field, or commensurate experience.<br/>• 4+ years of experience in analytics, data automation, data engineering, or operations. <br/>• Strong data analytical skills maintain, process, create complex datasets and generate insights.<br/>• Strong communication with the ability to collaborate with diverse stakeholders.<br/>• Proven track record of delivering results in a fast-paced, dynamic environment.<br/>• Proficiency in SQL, Python, or other data manipulation and creation tools is required. ", "preferred": "Experience in B2B SaaS Sales data, Revenue Operations function, Tableau, Salesforce, and B2B sales tools a plus."}, "skills": ["SQL", "Python", "Data Analysis", "Data Automation", "Data Engineering", "Tableau", "Salesforce", "B2B Sales"], "postedDate": "2 weeks ago", "benefits": "Base Pay Range $72,280 - $99,385. Eligible for Bonus Incentive Compensation. Procore is committed to offering competitive, fair, and commensurate compensation, and has provided an estimated pay range for this role. Actual compensation will be based on a candidate’s job-related skills, experience, education or training, and location.<br/><br/>At Procore, we invest in our employees and provide a full range of benefits and perks to help you grow and thrive. From generous paid time off and healthcare coverage to career enrichment and development programs, learn more details about what we offer and how we empower you to be your best.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993980962"}