{"jobTitle": "Assistant Store Manager, Sales", "company": {"name": "CB2", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "22.00/hr - 35.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "CB2 is transforming the perception of home design for today's modern consumer. Born out of Crate and Barrel, CB2 is committed to high-quality, sophisticated design at an approachable price. Located in downtown Chicago, CB2 offers an engaging, collaborative work environment. If you're creative, team spirited and have a passion for modern design, then join the team as Assistant Store Manager, Sales<br/><br/>Determined and motivating, Assistant Store Managers, Sales empower the sales team to deliver the exceptional customer experience that we're known for. You're a natural leader, engaging and inspiring. You're well connected to the pulse of the sales experience and see the big picture, working to create a consistent image and optimistic mood in the store. As Assistant Store Manager, Sales, you own customer resolution. Always in the customer's corner, you're empowered to make timely decisions to accommodate their needs and address their concerns. A mentor, educator and coach, you develop creative ways to encourage your team to meet sales goals and turn out a top-notch performance every day.<br/><br/><strong>What You'll Do<br/><br/></strong><strong> Leadership <br/><br/></strong><ul><li> In collaboration with the Store Manager, manage and delegate workload and ensure execution of plans and strategies across the store and in assigned area. </li><li> Partner with the Store Manager to establish and communicate all critical metrics and expectations within the store, including but not limited to sales, visual, operations, safety, loss prevention, human resources, payroll/scheduling and training. </li><li> Coach, teach, train, recognize and manage all aspects of performance and development for all store associates to encourage professional growth and build a bench of talent. <br/><br/></li></ul><strong> Job Knowledge <br/><br/></strong><ul><li> Focus on promoting and driving sales as they pertain to, or are driven by, position and acting as the Manager on Duty (MOD). </li><li> Collaborate with Store Manager and other functional Assistant Store Managers during new season planning and execution. <br/><br/></li></ul><strong> Results Oriented <br/><br/></strong><ul><li> Analyze results through reporting, translating numbers into actionable behaviors and goals in order to improve KPI results. </li><li> Ensure all customers are provided gracious, quick and efficient service. Set expectations and model excellent service by exhibiting a positive attitude and enthusiasm toward the job and the company to both internal and external customers in all forms of communication. <br/><br/></li></ul><strong> Communication/Teamwork <br/><br/></strong><ul><li> Communicate regularly with the management team concerning all aspects of sales, customer feedback/traffic and associate training/performance. Participate in weekly store walk-throughs with the management team and follow-up as required. </li><li> Stay up to date on all store initiatives and communications that are received, sharing with associates when appropriate. <br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong><ul><li> Your sense of personal style with a discerning eye and passion for design and home furnishings </li><li> 2+ years customer service or retail leadership experience </li><li> High school diploma/GED or equivalent, Associate degree or equivalent preferred </li><li> Strong communication, interpersonal, and problem solving skills </li><li> Strong delegation skills in support of execution and driving results </li><li> Proven ability to build a culture focused on success and teamwork </li><li> Full-Time roles: Open availability to work flexible hours on weekdays, evenings and weekends </li><li> Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and/or Sunday) and at least one weekday or night <br/><br/></li></ul><strong>Minimum Starting Rate:</strong> $22.00 Hourly<strong>Up to:</strong> $35.00 HourlyPay ranges will be adjusted upward as needed to comply with applicable state and local law. In addition to your salary, based on your role, associates may be eligible for other compensation including bonuses, sales incentives, and long term incentives.<br/><br/>", "responsibilities": "In collaboration with the Store Manager, manage and delegate workload and ensure execution of plans and strategies across the store and in assigned area. Partner with the Store Manager to establish and communicate all critical metrics and expectations within the store, including but not limited to sales, visual, operations, safety, loss prevention, human resources, payroll/scheduling and training. Coach, teach, train, recognize and manage all aspects of performance and development for all store associates to encourage professional growth and build a bench of talent. Focus on promoting and driving sales as they pertain to, or are driven by, position and acting as the Manager on Duty (MOD). Collaborate with Store Manager and other functional Assistant Store Managers during new season planning and execution. Analyze results through reporting, translating numbers into actionable behaviors and goals in order to improve KPI results. Ensure all customers are provided gracious, quick and efficient service. Set expectations and model excellent service by exhibiting a positive attitude and enthusiasm toward the job and the company to both internal and external customers in all forms of communication. Communicate regularly with the management team concerning all aspects of sales, customer feedback/traffic and associate training/performance. Participate in weekly store walk-throughs with the management team and follow-up as required. Stay up to date on all store initiatives and communications that are received, sharing with associates when appropriate.", "qualifications": {"required": "2+ years customer service or retail leadership experience, High school diploma/GED or equivalent, Associate degree or equivalent preferred, Strong communication, interpersonal, and problem solving skills, Strong delegation skills in support of execution and driving results, Proven ability to build a culture focused on success and teamwork, Full-Time roles: Open availability to work flexible hours on weekdays, evenings and weekends, Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and/or Sunday) and at least one weekday or night"}, "skills": ["Customer Service", "Retail", "Leadership", "Sales", "Teamwork", "Communication", "Problem Solving", "Training", "Performance Management", "Delegation"], "postedDate": "2 weeks ago", "benefits": "In addition to your salary, based on your role, associates may be eligible for other compensation including bonuses, sales incentives, and long term incentives.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993975298"}