{"jobTitle": "Freight Planner", "company": {"name": "ViewSonic", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "22.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "IT Services and IT Consulting", "description": "<strong>Supervision</strong>\n<p>Reports to: Logistics Operations Manager</p>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Come grow with us!</strong></p>\n<p>Working at ViewSonic is a unique opportunity to do rewarding, meaningful, high-visibility work for a global leader in visual technology. At ViewSonic, we are celebrating 36 years of excellence, carrying on the same entrepreneurial spirit and innovation we’ve had since 1987. Our brand and products are well-known throughout the industry. As a result, we are growing quickly and are looking for energetic, motivated team members to expand our nest.</p>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Your Role and Impact</strong></p>\n<p>Coordinates classifications applicable to company products and equipment outbound shipment. Responsible for preparing schedules of prices and routes for shipping. Assists in preparing claims against carriers for shipping losses or damages in transit. Updates records to reflect changes in freight tariffs.</p>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Day to Day Responsibilities</strong></p>\n<ul>\n<li>Coordinates the routing of outgoing shipments for which the company assumes responsibility or which affect organization costs or customer satisfaction</li>\n<li>Manage the maintenance, preparation and release of shipping orders for the warehouse(s)</li>\n<li>Review order fulfilment and generate accurate shipping documents, Bill of Lading, customs invoices</li>\n<li>Stay informed of current transportation providers and rates to assure the most economical and efficient transportation service to the organization and its customers</li>\n<li>Handles routine questions and problems, interfacing with other departments to obtain and provide information and maintain open communication throughout the ship/delivery cycle</li>\n<li>Processes or reviews claims against carriers for shipping losses or damages in transit</li>\n<li>Reviews or checks review of freight and express bills to correct rates and extensions and process over-charge claims</li>\n<li>Multitasking aptitude to achieve shipping deadlines, scheduling and prioritizing sensitive orders and review completion of customer requirements</li>\n<li>Ability to maintain close communication with logistics and Sales group to ensure smooth flow of daily operations, scheduling carrier pickups</li>\n<li>Performs other related duties as assigned by management</li>\n</ul>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Your Profile</strong></p>\n<ul>\n<li>Requires High School diploma at the minimum, 2 years associate degree preferred</li>\n<li>Minimum two years of experience in the shipping/transportation business.</li>\n<li>PC proficiency with MS Word and Excel.</li>\n<li>Must be detail-oriented, possess good verbal/ written communication skills, good telephone etiquette and a demonstrated ability to handle a multitude of tasks on a daily basis</li>\n<li>Bilingual in Spanish a plus but not required</li>\n</ul>\n<p><br/></p>\n<p><br/></p>\n<p><strong>What’s in it for you:</strong></p>\n<ul>\n<li>Medical, Dental and Vision insurance options</li>\n<li>401k with company match</li>\n<li>Paid Time Off</li>\n<li>Company-provided equipment</li>\n</ul>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Work Environment &amp; Requirements</strong></p>\n<ul>\n<li>In-Office Presence: 5 days per week in office</li>\n<li>Environment: Works in a large, open, well-ventilated warehouse and normal office conditions. May be subject to some variations in temperature, normally not to the extreme.</li>\n<li>Physical Effort: Work requires infrequent physical demands</li>\n<li>Hazards: Negligible, little or no exposure to hazards</li>\n</ul>\n<p><br/></p>\n<p><br/></p>\n<p>At ViewSonic, our mission is to provide excellence in visual experience by combining, products, solutions, and ecosystem developments. We celebrate and support diversity and are committed to creating a respectful and inclusive environment for all employee-partners. ViewSonic does not discriminate on any basis covered by appropriate law, and all employment is decided based on qualifications, merit, and business needs.</p>\n<p><br/></p>\n<p><br/></p>\n<p><em>The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and requirements.</em></p>\n<p><br/></p>", "responsibilities": "Coordinates classifications applicable to company products and equipment outbound shipment. Responsible for preparing schedules of prices and routes for shipping. Assists in preparing claims against carriers for shipping losses or damages in transit. Updates records to reflect changes in freight tariffs.", "qualifications": {"required": "Requires High School diploma at the minimum, 2 years associate degree preferred, Minimum two years of experience in the shipping/transportation business., PC proficiency with MS Word and Excel., Must be detail-oriented, possess good verbal/ written communication skills, good telephone etiquette and a demonstrated ability to handle a multitude of tasks on a daily basis, Bilingual in Spanish a plus but not required"}, "skills": ["MS Word", "Excel", "Shipping", "Transportation", "Logistics", "Customer Service", "Communication"], "postedDate": "2 weeks ago", "benefits": "Medical, Dental and Vision insurance options, 401k with company match, Paid Time Off, Company-provided equipment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993643834"}