{"jobTitle": "Store Manager- Calvin Klein", "company": {"name": "Calvin Klein", "industry": "Retail Apparel and Fashion", "size": "Not specified", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$65,000.00 - $85,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "Design Your Future at PVH\n\nStore Manager- Calvin Klein\n\nTITLE: Store Manager\n\nREPORTS TO: District Sales Manager/Area Manager\n\nJOB CLASSIFICATION: Exempt\n\nPosition Summary\nStore Managers lead the effort to exceed expectations, provide exceptional service and display passion for our brand. They are responsible for conducting strategic business analysis, leading a team focused on delivering top line sales results and managing controllable expenses. Store Managers own the recruitment, talent development, and performance management of their store team.", "responsibilities": "Customer Experience\n- Drives the effort to greet and offer assistance to every customer and provides real-time coaching.\n- Empowers the store team to make decisions that align with brand standards, prioritize delivering an exceptional customer experience and always place our customer first.\n- Cultivates an environment centered around an in-depth knowledge of product and promotions to help explain value and build brand loyalty.\n- Assesses trends and opportunities within the store and market; implements strategies that support the brand standards, customer service expectations, and connect the store’s goals to the larger business objectives.\n\nCommitment to Efficiency\n- Oversees merchandising execution; analyzes top selling and slow selling items and makes store-based merchandising decisions that align with brand standards and drive sales results.\n- Enforces all company tools, policies and procedures; provides loss prevention training and coaches the store team to maintain awareness and report concerns.\n- Directs payroll and scheduling strategies in alignment with budgets; oversees store financials including expenses and inventory.\n- Conducts strategic business analysis and planning; communicates opportunities to senior leadership.\n\nAssociate Morale\n- Sets the staffing strategy and recruits top talent to ensure a best-in-class team; evaluates current talent and manages succession planning.\n- Motivates and inspires the store team to achieve sales goals and uphold brand standards; models expectations, recognizes outstanding performance and maintains a focus on team development.\n- Demonstrates a sense of pride, commitment, and passion for the brand and our customers; treats customers and the store team professionally, courteously, and respectfully.\n- Celebrates and embraces individuality, inclusion and partnership, builds relationships and seeks out feedback for continuous self-development.\n- Champions innovation and change, drives company initiatives, and fosters a continuous improvement environment.", "qualifications": {"required": "Minimum of 5 years of retail store management experience required. Bachelor’s/Associate degree preferred; high school diploma/equivalent required. Flexible schedule required including nights, weekends and overnight shifts; some travel may be requested. Excellent communication and time management skills. Ability to walk, stand, bend, reach and squat for prolonged periods, and carry up to 20 pounds.", "preferred": "Not specified"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "PVH currently provides base salary ranges for all positions-on job advertisements-in the United States based on local requirements. These ranges are based on what PVH reasonably believes that it will pay an associate for their base salary for said position at the time of the posting. Individual compensation will ultimately be determined based on a variety of relevant factors including but-not limited to qualifications, geographic location and other relevant skills. PVH is committed to providing a market-competitive total rewards package to eligible associates, which includes diverse and robust health and insurance benefits to meet the varied needs of our associates and an above-market 401(k) contribution to help our associates save for retirement. We also offer career growth opportunities, empowering our associates to design their future at PVH.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993934107"}