{"jobTitle": "Conference Center Coordinator", "company": {"name": "Jenner & Block", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$55,000.00/yr - $70,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Law Practice and Administrative and Support Services", "description": "<strong><u>ABOUT JENNER & BLOCK</u></strong><p>Jenner & Block (www.jenner.com) is a law firm with global reach, with more than 500 lawyers and offices in Chicago, London, Los Angeles, New York, San Francisco and Washington, DC. The firm is known for its prominent and successful litigation practice and experience handling sophisticated and high-profile corporate transactions. Firm clients include Fortune 100 companies, large privately held corporations, financial services institutions, emerging companies and venture capital and private equity investors. The American Lawyer magazine has ranked Jenner & Block as the #1 pro bono firm in the United States 10 times, most recently in 2019. The firm has been ranked in the top 10 in this category every year since 1990.</p><p><br/></p><p><strong>RESPONSIBILITIES: </strong></p><p>Under the general supervision of the Operations Manager, the Conference Center Coordinator is responsible for: providing world class reception and hospitality services for the local office, assisting with office and facilities operations, providing administrative overflow support to practice assistants, providing administrative assistance to office manager, and providing highly flexible service to attorneys.</p><p><br/></p><p><strong>ESSENTIAL FUNCTIONS:</strong></p><ol><li>Act as first point of contact for guests, delivering a high level of professional service, assisting where appropriate, and coordinating specialized assistance as required.</li><li>Performs all duties associated with reception services including but not limited to: answering phones, taking and delivering accurate messages, welcoming visitors, tracking access cards, coordinating meals, and other tasks and duties that comport with serving clients in a premier-level professional services firm. Creates a positive, welcoming impression in all interactions.</li><li>Manages booking of conference areas and guest offices; ensures that conference rooms and guest offices are neat and orderly. Liaises with office services, IT, legal support staff, and other departments to ensure that rooms and offices are stocked and requested services are provided, and that any needed equipment is in place. Orders lunches/refreshments for meetings and events.</li><li>Keeps accurate and up-to-date lists of Firm personnel, floor maps, and security lists.</li><li>Helps to coordinate the local office safety efforts; serves on the office safety team.</li><li>In collaboration with Operations Manager, co-leads planning and coordination of all services related to office meetings and events in the Los Angeles office.</li><li>Responsible for ensuring that all pantries and kitchens are maintained and stocked appropriately, including effective inventory management.</li><li>May serve as on the ground support for hosted events both onsite and at local venues within the Los Angeles area, as needed. Flexibility to work outside of regular schedule to support events.</li><li>Maintains, applies, and demonstrates a thorough knowledge of Firm procedures and practices to ensure questions are anticipated, answered, and resolved and that best-in class services are delivered to guests and personnel.</li><li>Locates information for clients and personnel using available research tools, including electronic data, firm intranet, and other available resources. Appropriately seeks guidance to resolve more complex questions while retaining responsibility for resolution.</li><li>Establishes and maintains key catering vendor relationships to ensure that the office receives the best possible service and per-person pricing.</li><li>Works with Operations Manager to identify and recommend areas for office community development, maintains office culture and coordinating these initiatives.</li><li>Provides a wide range of administrative support relating to office operations, client service capabilities, and in maintaining office culture.</li><li>Aids with administrative tasks, which may include handling and management of confidential information and entering this information into related internal databases.</li><li>Develop and maintain administrative reports and databases as requested by Operations Manager. Develop reports in response to specific office, management, and client needs.</li><li>Ensure timely preparation and submissions of invoices and processing of expenses and vendor payments, ensuring adherence to Firm policies and procedures.</li></ol><p><br/></p><p><strong>Client Service, Confidentiality, and Safety</strong></p><ol><li>Consistently promote and model the Firm's Client Service Principles in leadership, teamwork, work product, and personal interaction.</li><li>Ensure compliance with the Firm's Information Handling Policy, including safeguarding confidential and personal information, and reporting any suspected breach appropriately and immediately.</li><li>Adhere to the Firm’s General Safety Practices and any unique safety practices for department and building.</li></ol><p><br/></p><p><strong>OTHER DUTIES:</strong></p><ol><li>Other duties as assigned.</li></ol><p><br/></p><p><strong>QUALIFICATIONS:</strong></p><p><strong>Education and Experience</strong></p><ol><li>Bachelor’s degree strongly preferred.</li><li>Three or more years of experience in a front-line client service position; previous experience in the hospitality industry or in reception for a professional services firm a plus.</li><li>Proficiency in Microsoft Word, Excel and PowerPoint.</li></ol><p><br/></p><p><strong>Teamwork and Applied Skills</strong></p><ol><li>Highly professional appearance and interpersonal style; ability to communicate positively and effectively with all levels in a diverse, client-first environment.</li><li>Superior client service focus and the ability to inspire and achieve client service in a teamwork setting.</li><li>Strong problem-solving capabilities, and the ability to provide responsive solutions where precedents may not exist.</li><li>Excellent attention to detail and follow-through capabilities.</li><li>Ability to work under pressure and to provide responsive client service under sometimes stressful conditions.</li><li>Ability to retain and recall detailed information.</li><li>Ability to keep confidential any information, observations, or viewpoints regarding Firm personnel or matters.</li><li>Excellent verbal and written communication skills. Ability to communicate effectively and tactfully with individuals at all levels within and outside the Firm and to build effective internal and external relationships.</li><li>Consistently promote and model the Firm's values in leadership, teamwork, work product, and personal interaction.</li></ol><p><br/></p><p>Jenner & Block offers a comprehensive benefits program, which includes medical, dental, and vision insurance, 401(k), and paid time off, in addition to other offerings.</p><p><br/></p><p>We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance</p><p><br/></p><p><strong>Jenner & Block LLP is an equal opportunity employer. Recruitment and employment decisions are not made on the basis of an individual’s race, color, creed, religion, national origin, ancestry, citizenship status, age, non-disqualifying physical or mental disability or medical condition, genetic information, sexual orientation, sex, gender identity and/or expression, pregnancy, childbirth, breastfeeding or related medical conditions, arrest record, matriculation, personal appearance, political affiliation, marital, parental, veteran, military, or order of protection status, or any other protected status or that of their relatives, friends, or associates.</strong></p>", "responsibilities": "Under the general supervision of the Operations Manager, the Conference Center Coordinator is responsible for: providing world class reception and hospitality services for the local office, assisting with office and facilities operations, providing administrative overflow support to practice assistants, providing administrative assistance to office manager, and providing highly flexible service to attorneys.", "qualifications": {"required": "Highly professional appearance and interpersonal style; ability to communicate positively and effectively with all levels in a diverse, client-first environment.\nSuperior client service focus and the ability to inspire and achieve client service in a teamwork setting.\nStrong problem-solving capabilities, and the ability to provide responsive solutions where precedents may not exist.\nExcellent attention to detail and follow-through capabilities.\nAbility to work under pressure and to provide responsive client service under sometimes stressful conditions.\nAbility to retain and recall detailed information.\nAbility to keep confidential any information, observations, or viewpoints regarding Firm personnel or matters.\nExcellent verbal and written communication skills. Ability to communicate effectively and tactfully with individuals at all levels within and outside the Firm and to build effective internal and external relationships.\nConsistently promote and model the Firm's values in leadership, teamwork, work product, and personal interaction.", "preferred": "Bachelor’s degree strongly preferred.\nThree or more years of experience in a front-line client service position; previous experience in the hospitality industry or in reception for a professional services firm a plus.\nProficiency in Microsoft Word, Excel and PowerPoint."}, "skills": ["Client Service", "Hospitality", "Administrative Support", "Communication", "Problem Solving", "Microsoft Word", "Excel", "PowerPoint"], "postedDate": "2 weeks ago", "benefits": "Jenner & Block offers a comprehensive benefits program, which includes medical, dental, and vision insurance, 401(k), and paid time off, in addition to other offerings.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993849108"}