{"jobTitle": "Executive Assistant", "company": {"name": "Chasen Creative Media", "industry": "Public Relations and Communications Services", "size": "Not specified", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$70,000.00/yr - $80,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Public Relations and Communications Services", "description": "CCM is an award-winning brand consulting firm specializing in public relations, influencer and experiential marketing with offices in Beverly Hills and New York City. Our multifaceted expertise is focused on the beauty, lifestyle and entertainment sectors with clients including Paul Mitchell, OUAI, Clinique, Live Tinted, BYOMA, Half Magic Beauty, Tan-Luxe, Isle of Paradise, FORVR Mood among others. @chasencreative", "responsibilities": "Provide sophisticated calendar management for CEO. Prioritize inquiries and requests while troubleshooting conflicts; make judgements and recommendations to ensure smooth day-to-day engagements. Manage and prioritize CEO’s to-do list, completion of tasks, approvals, deadlines. Provide 'gatekeeper' and 'gateway' role, providing a bridge for smooth communication between the CEO and staff. Maintain comprehensive and accurate records. Create detailed agendas, meeting prep, documents. Sit in on key client meetings/calls and take detailed and accurate notes for future follow-up/reference. Respond to CEO’s emails, calls, and requests in a timely manner. Manage monthly expenses and invoice tracking with bookkeeper. Liaise with company attorneys, accountant, bookkeeper, consultants, IT, designers etc. Onboard new employee, benefit enrollment, tracking via Gusto, sourcing freelancers when needed. Office operations including maintaining/ordering equipment, supplies, subscriptions etc. Coordinate travel, reservations, itineraries. Special projects including company gifting, team events, outings, holidays. Limited personal scheduling, errands and projects.", "qualifications": {"required": "Bachelor’s Degree, 8+ years of experience as an Executive Assistant; previous experience working for a CEO, Experience working in a fast-paced agency environment, multitasking, administrative coordination, and logistics (ideally in applicable field), Excellent written and verbal communication skills, Extremely organized, detail-oriented, and able to self-manage multiple projects at once with seamless execution, Proficient with Quickbooks, invoicing, expenses, budgeting, Demonstrate a high level of customer service and phone etiquette, Handle confidential matters appropriately and with discretion, Confident in quick and effective problem-solving, Positive, professional, proactive, diligent and flexible, Polished with an elevated, creative aesthetic, Proficient in Microsoft Office suite, Gusto, Google Drive, Quickbooks, Apple products", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "15 PTO days and Paid Holidays, Paid Winter Break between Christmas and New Year’s Day—in addition to regular Paid-Time-Off (PTO) and paid holidays, Paid medical, dental and vision insurance premium for employees; family coverage available, Monthly Employee Wellness stipend, Expense budget for industry networking, Work-related travel opportunities, Team-building events", "remoteWork": "Monday-Thursday in office, Friday WFH", "url": "https://www.linkedin.com/jobs/view/3993609093"}