{"jobTitle": "Operations Manager", "company": {"name": "Euro Projects Recruitment Ltd", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$110,000.00/yr - $155,000.00/yr", "currency": "USD"}, "jobFunction": "Distribution, Engineering, and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing, Engineering Services, and Manufacturing", "description": "<strong>Operations Manager </strong><br/><br/>\n<br/>\n<ul><li>Operations Manager job Long Beach California </li><li>Backed by a multinational PLC ; share price is up over 95% in the past 3 years</li><li>You MUST be within 1 hour of Long Beach and have experience of warehouse operations (ideally distribution). As Head of Operations you will drive continuous improvement projects in a fast paced, agile business</li><li>Business works with international aerospace, defence, motorsport and space customers globally</li></ul><br/><br/>\nOperations Manager jobs role would suit an ambitious ops manager, Head of Operations or a senior warehouse manager who is ambitious and wants that step up to a broader Operations Manager role / Head of Operations role. This is a senior leadership role. <br/><br/>\n<br/><br/>\n$110,000 - $155,000 TBC – still being defined. Rule out if seeking over $160,000 (please note this salary is yet to be defined by the client so is a provisional indication only) <br/><br/>\n<br/><br/>\nAre you an Operations manager, head of Operations Or Supply Cain Manager who has strong experience of managing warehouse operations? Are you seeking an Operations Manager jobs role with a fast growth multi-national – share price up 95% in the last 3 years. <br/><br/>\n<br/><br/>\nBacked by a multinational PLC ; share price is up 95% in the past 3 years\nThey work with international aerospace, defence, motorsport and space customers globally\nFriendly company culture – whilst it’s part of a large FTSE PLC it feels like a small to medium sized friendly business – very agile and collaborative <br/><br/>\n<br/><br/>\n<strong><u>What we are looking for in this Operations Manager jobs role</u></strong><br/><br/>\n<br/>\n<ul><li>Within 1 hour of Long Beach – the role is on site </li><li>Experience of managing warehouse operations. That can be in a distribution based business or with a manufacturing, aerospace, automotive or engineering business where the warehouse operations are still significant</li><li>This is an agile medium sized business. Not corporate. You will be able to drive practical continuous improvement projects, implement automation and really make a difference </li><li>We are open to looking at Supply Chain Managers or Warehouse managers who want to step up to a Head of Operations role </li><li>An Operations Manager or Head of Operations who wants to work for a rock solid business ; backed by a PLC which has grown 95% in 3 years and an incredible 250% in the past 5 years</li></ul><br/><br/>\n<br/><br/>\n<br/>\n<strong>Reference: <em>ESLBO</em></strong><br/><br/>\n<br/><br/>\nThis Operations Manager jobs role is based in Long Beach California, you will need to be able to commute to this region or be easily able to relocate. <br/><br/>\n<br/><br/>\nPlease note that if you are not contacted within the next ten days then your application, on this occasion, has not been successful. We thank you for taking the time to apply.", "responsibilities": "As Head of Operations you will drive continuous improvement projects in a fast paced, agile business", "qualifications": {"required": "You MUST be within 1 hour of Long Beach and have experience of warehouse operations (ideally distribution).", "preferred": "Experience of managing warehouse operations. That can be in a distribution based business or with a manufacturing, aerospace, automotive or engineering business where the warehouse operations are still significant"}, "skills": ["Operations Management", "Warehouse Management", "Continuous Improvement", "Distribution", "Aerospace", "Defence", "Motorsport", "Space", "Supply Chain Management"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993541737"}