{"jobTitle": "Assistant Service Operations Manager - Night Shift", "company": {"name": "EV.Careers", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "87,300.00 - 109,100.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "About Rivian<br/><br/>Rivian is on a mission to keep the world adventurous forever. This goes for the emissions-free Electric Adventure Vehicles we build, and the curious, courageous souls we seek to attract.<br/><br/>As a company, we constantly challenge what’s possible, never simply accepting what has always been done. We reframe old problems, seek new solutions and operate comfortably in areas that are unknown. Our backgrounds are diverse, but our team shares a love of the outdoors and a desire to protect it for future generations.<br/><br/>Role Summary<br/><br/>The Assistant Service Operations Manager requires an experienced professional with high levels of energy and initiative, working knowledge of service processes, strong bias for action, and cross-functional collaboration. To be successful in this role, the ideal candidate must have a customer-first approach, be highly adaptable, thrive in ambiguity, capable of tackling all challenges with a creative and open mindset and subscribe to the core principles of servant leadership. This role reports to the Service Operations Manager.<br/><br/>Responsibilities<br/><br/><ul><li>Partner with Service Operations Manager to ensure performance standards for operations and customer service are met or exceeded</li><li>Have a thorough understanding of budget expectations and manage cost centers (working hours, inventory cost, accounts receivable) accordingly. </li><li>Lead and manage all local operations with a hands-on mindset and servant leadership. </li><li>Manage and be accountable for high value inventory reconciliation</li><li>Collaborate with Service Operations, Sales, Retail, and Delivery &amp; Field Operations teams</li><li>Work in partnership with cross functional teams regularly on implementing and continuously improving field service operations</li><li>Prioritize, plan, and coordinate logistics and meetings with internal teams and external parties</li><li>Lead a customer-centric team of Mobile/Service Technicians, Service Advisors, and Parts Advisors</li><li>Fills in for Service Operations Manager in their absence</li><li>Build a Rivian culture that is inclusive, and maintains high levels of team morale</li><li>Responsible for ensuring adherence to high standards of safety, cleanliness, and organization<br/><br/></li></ul>Qualifications<br/><br/><ul><li>6+ years of related work experience in automotive, OEM, Tier 1 or related technical field</li><li>Bachelor’s degree or equivalent work experience</li><li>Ability to have a direct impact on scalability in a complex organization</li><li>Effectively manage onsite and remote service teams and a driver of people performance</li><li>Excellent verbal and written and communication skills</li><li>Detail-oriented with strong analytical and interpersonal skills</li><li>Outstanding planning and organizational skills with a focus on operational excellence</li><li>Demonstrated high-level administrative experience, including advanced computer skills (Microsoft office)</li><li>Ability to perform duties with a high level of professionalism, flexibility, discretion, judgment, diplomacy, and tact</li><li>Proven ability to effectively handle and adapt to multiple priorities, organize workload, and meet deadlines</li><li>Knowledge of automotive equipment and servicing methods</li><li>Automotive technical and repair knowledge skills preferred</li><li>Able and flexible to travel as needed</li><li>Experience working in start-up environments preferred</li><li>Experience in leading automotive or high-tech team-orientated, fast-paced work environment</li><li>Understanding of problem-solving methods such as SWOT Analysis, Lean implementations, Six Sigma operational and Visual Management standards preferred</li><li>Must possess a valid driver's license and clean driving record</li><li>No driving related suspensions or revocation of Driver License (within a 3-5year period)</li><li>Ability to read and speak fluent English</li><li>Ability to see, read and interpret documents such as governmental regulations, safety rules, operating and maintenance instructions or schematics. </li><li>Required to, communicate using telephone and/or email</li><li>Minimum age of 21</li><li>Physical exertion may be required to perform occupational tasks (sitting up to 2 or more hours at a time, standing for up to 8 or more hours a day, walking, bending, kneeling, laying, twisting, carrying, reaching, stretching, pushing, pulling, and lifting up to 50 lbs). </li><li>Ability to stand/sit for 8-12 hours per day</li><li>Frequent use of hands for purposes of grasping and using tools correctly, entering data, writing communications, or calling customers or internal partners<br/><br/></li></ul>Pay Disclosure<br/><br/>Salary Range/Hourly Rate for California Based Applicants: </strong>$87,300 - $109,100 per year (actual compensation will be determined based on experience, location, and other factors permitted by law).<br/><br/>Benefits Summary: </strong>Rivian provides robust medical/Rx, dental and vision insurance packages for full-time employees, their spouse or domestic partner, and children up to age 26. Coverage is effective on the first day of employment, and Rivian covers most of the premiums.<br/><br/>Equal Opportunity<br/><br/>Rivian is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law.<br/><br/>Rivian is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at candidateaccommodations@rivian.com.<br/><br/>Candidate Data Privacy<br/><br/>Rivian may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Rivian may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.<br/><br/>Rivian may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our People Team, Finance, Legal, and the team(s) with the position(s) for which you are applying; (ii) Rivian affiliates; and (iii) Rivian’s service providers, including providers of background checks, staffing services, and cloud services.<br/><br/>Rivian may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, the United Kingdom, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.<br/><br/>Please note that we are currently not accepting applications from third party application services.", "responsibilities": "<ul><li>Partner with Service Operations Manager to ensure performance standards for operations and customer service are met or exceeded</li><li>Have a thorough understanding of budget expectations and manage cost centers (working hours, inventory cost, accounts receivable) accordingly. </li><li>Lead and manage all local operations with a hands-on mindset and servant leadership. </li><li>Manage and be accountable for high value inventory reconciliation</li><li>Collaborate with Service Operations, Sales, Retail, and Delivery &amp; Field Operations teams</li><li>Work in partnership with cross functional teams regularly on implementing and continuously improving field service operations</li><li>Prioritize, plan, and coordinate logistics and meetings with internal teams and external parties</li><li>Lead a customer-centric team of Mobile/Service Technicians, Service Advisors, and Parts Advisors</li><li>Fills in for Service Operations Manager in their absence</li><li>Build a Rivian culture that is inclusive, and maintains high levels of team morale</li><li>Responsible for ensuring adherence to high standards of safety, cleanliness, and organization<br/><br/></li></ul>", "qualifications": {"required": "6+ years of related work experience in automotive, OEM, Tier 1 or related technical field\nBachelor’s degree or equivalent work experience\nAbility to have a direct impact on scalability in a complex organization\nEffectively manage onsite and remote service teams and a driver of people performance\nExcellent verbal and written and communication skills\nDetail-oriented with strong analytical and interpersonal skills\nOutstanding planning and organizational skills with a focus on operational excellence\nDemonstrated high-level administrative experience, including advanced computer skills (Microsoft office)\nAbility to perform duties with a high level of professionalism, flexibility, discretion, judgment, diplomacy, and tact\nProven ability to effectively handle and adapt to multiple priorities, organize workload, and meet deadlines\nKnowledge of automotive equipment and servicing methods\nAble and flexible to travel as needed\nExperience working in start-up environments preferred\nExperience in leading automotive or high-tech team-orientated, fast-paced work environment\nUnderstanding of problem-solving methods such as SWOT Analysis, Lean implementations, Six Sigma operational and Visual Management standards preferred\nMust possess a valid driver's license and clean driving record\nNo driving related suspensions or revocation of Driver License (within a 3-5year period)\nAbility to read and speak fluent English\nAbility to see, read and interpret documents such as governmental regulations, safety rules, operating and maintenance instructions or schematics. \nRequired to, communicate using telephone and/or email\nMinimum age of 21\nPhysical exertion may be required to perform occupational tasks (sitting up to 2 or more hours at a time, standing for up to 8 or more hours a day, walking, bending, kneeling, laying, twisting, carrying, reaching, stretching, pushing, pulling, and lifting up to 50 lbs). \nAbility to stand/sit for 8-12 hours per day\nFrequent use of hands for purposes of grasping and using tools correctly, entering data, writing communications, or calling customers or internal partners<br/><br/>", "preferred": "Automotive technical and repair knowledge skills\nExperience working in start-up environments\nExperience in leading automotive or high-tech team-orientated, fast-paced work environment\nUnderstanding of problem-solving methods such as SWOT Analysis, Lean implementations, Six Sigma operational and Visual Management standards"}, "skills": ["Service Operations", "Budget Management", "Inventory Management", "Team Leadership", "Customer Service", "Cross-Functional Collaboration", "Logistics", "Meeting Coordination", "Automotive", "Microsoft Office", "Problem Solving", "SWOT Analysis", "Lean", "Six Sigma", "Visual Management", "Driver's License"], "postedDate": "2 weeks ago", "benefits": "Rivian provides robust medical/Rx, dental and vision insurance packages for full-time employees, their spouse or domestic partner, and children up to age 26. Coverage is effective on the first day of employment, and Rivian covers most of the premiums.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993657036"}