{"jobTitle": "Director of Equity - Remote | WFH", "company": {"name": "Get It Recruit - Educational Services", "industry": "Human Resources Services", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Human Resources Services", "description": "Our mission is to advance and elevate the journey of individuals, organizations, and our community through scholarship, teaching, engaged conversation, and outreach. With locations in Bel Air, Beverly Hills, and Simi Valley, CA, and distance education programs that reach learners nationally and globally, we are a private, not-for-profit higher education institution that provides community and accredited academic programming. Our two schools with degree programs are the, offering an in-person MA in Rabbinic Studies and ordaining Conservative Rabbis, and the Masor School for Education and Leadership, which provides online early childhood educational programming at the BA, MA, EdD, and certificate levels. Additionally, we offer undergraduate-level for-credit academic programming to high school-aged students through. Guided by our mission, we engage in numerous outreach efforts to both and secular communities through accessible, community programming that reaches thousands of learners annually.\n\nPosition Overview\n\nWe are seeking a dedicated and experienced Director of Equity, Compliance, and Title IX. Reporting to the University President, this role is pivotal in coordinating and facilitating compliance with Title IX of the Education Amendments Act of 1972, Section 504 of the Rehabilitation Act of 1973, the Federal Jeanne Clery Act, as well as University Student Conduct and all associated regulations. The goal of this position is to deepen and enhance our campus climate and culture, ensuring a safe and welcoming environment for our community, including in-person and distance education learners, students, faculty, and staff in both our for-credit and community programming.", "responsibilities": "Leadership and Coordination: Serve as the Title IX Coordinator, Section 504 Coordinator, and Student Conduct Liaison, overseeing and conducting investigations as necessary, in accordance with regulations.\n\nPolicy Guidance: Provide leadership in the analysis, review, creation, and interpretation of university and student policies and procedures related to Title IX, Section 504, the Clery Act, and university conduct.\n\nCompliance Management: Ensure adherence to the Federal Jeanne Clery Act, including the collection and coordination of the annual security report.\n\nStudent Support: Act as an on-call support person, actively responding to student crises and issues as necessary, and liaise with psychological services to coordinate assistance for students.\n\nEquity Assurance: Ensure equal opportunity access to programs and facilities and maintain equitable resource distribution throughout the university.\n\nRecords Maintenance: Prepare, maintain, and update records related to Title IX, Section 504, the Clery Act, and Student Conduct in compliance with regulations.\n\nPolicy Updates: Regularly update university policies and procedures on the university website, student handbook, academic catalog, and other documents.\n\nContinuous Improvement: Conduct assessments, research best practices, and evaluate student trends under the guidance of the Dean of Institutional Effectiveness to identify areas for improvement.\n\nCollaboration: Partner with Human Resources, Security, Senior Leadership, Academic Affairs, University Deans, and others to support university initiatives.", "qualifications": {"required": "Master's degree from an accredited institution in a related field. Three to five years of experience in higher education, compliance, equal opportunity, student affairs, Title IX, or a related field. Strong understanding of federal and state laws and regulations, including VAWA/Campus SaVE Act, Title IX, Title VII, Title VI, ADA, Clery Act, and others. Proven experience in Title IX and civil rights compliance, complaint resolution, investigation, and grievance processes. Experience developing and conducting training programs for stakeholders. Ability to work independently with minimal supervision, demonstrating initiative, cooperativeness, loyalty, and integrity. Deep commitment to confidentiality and adherence to laws and policies governing student services. Ability to effectively engage with various constituencies including students, faculty, staff, administrators, alumni, trustees, government and nonprofit officials, and business leaders. Willingness to travel to visit campuses in Beverly Hills, Bel Air, and Simi Valley, CA. Capacity to manage multiple diverse projects simultaneously. Excellent written, verbal, and presentation skills with strong attention to detail. Strong critical thinking and collaborative problem-solving abilities.", "preferred": "Not specified"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993245356"}