{"jobTitle": "Supply Planning Intern", "company": {"name": "ofi", "location": "Oxnard, CA"}, "location": "Oxnard, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "We are a global leader in food & beverage ingredients. Pioneers at heart, we operate at the forefront of consumer trends to provide food & beverage manufacturers with products and ingredients that will delight their consumers. Making a positive impact on people and planet is all part of the delight. With a deep-rooted presence in the countries where our ingredients are grown, we are closer to farmers, enabling better quality, and more reliable, traceable and transparent supply. Supplying products and ingredients at scale is just the start. We add value through our unique, complementary portfolio of natural, delicious and nutritious products. With our fresh thinking, we help our customers unleash the sensory and functional attributes of cocoa, coffee, dairy, nuts and spices so they can create naturally good food & beverage products that meet consumer expectations. And whoever we’re with, whatever we’re doing, we always make it real.<br/><br/>Position Summary<br/><br/>Reporting to the Senior Director of Private Label, Spices the Planning Intern will work with the Spices leadership team and gain exposure to business operations as well as project work to optimize and automate supply planning processes across the US Private Label business.<br/><br/>The purpose of this project will be to partner with planning and procurement teams to improve planning efficiencies, reduce hours and errors related to manual input. The planning role is one of the most critical functions, with visibility and cross functional interaction with all teams. This project will provide the Supply Planning Intern with an in-depth understanding of the entire supply chain for a downstream private label business.<br/><br/>The ideal candidate should be in good standing with an accredited university and have a desire to pursue a career within the food industry. Desire to learn in a fast-paced environment while working with multiple teams across various locations and effective communication will be required for success in this internship.<br/><br/>Position Responsibilities<br/><br/><ul><li> Assess and analyze current-state processes inclusive of the tools used, data inputs and outputs, etc.</li><li> Understand material planning and re-ordering process from key stakeholders including procurement managers</li><li> Configure, trial and test through demandcaster sandbox: Test system’s output of weekly finite schedule, material requirements and monthly supply plan vs existing planning process</li><li> Develop familiarity with documented processes &amp; team members involved in each part of the process</li><li> Identify strengths and opportunities; lead and host cross-functional alignment sessions to present proposal for future-state</li><li> Operationalize solution in live environment and drive adoption amongst planners and procurement team</li><li> Lead and participate in ad hoc projects for the Private label Spices team</li><li> Perform other duties as assigned.<br/><br/></li></ul>Position Requirements<br/><br/><ul><li> High school diploma is required.</li><li> Must be currently enrolled at an accredited college or university, working toward a bachelor’s degree in Operations, Supply Chain, Business or a related discipline.</li><li> Ability to work effectively within a fast-paced environment is required.</li><li> Must possess a high degree of initiative and resourcefulness.</li><li> High level of integrity, confidentiality and data protection are required.</li><li> Experience with Microsoft Suite (Word, PowerPoint, Excel) is required.</li><li> Strong communication skills, both written and verbal are required.<br/><br/></li></ul>Note: This job description is not intended to be all-inclusive. Employee may perform other related duties as negotiated to meet the ongoing needs of the organization.<br/><br/>ofi provides equality of opportunity for all persons with respect to hiring without discrimination on the grounds of race, color, religion, national origin, sex, pregnancy, age, disability, veteran status, or sexual orientation. All employment will be decided on the basis of qualifications, merit and business need. If you need assistance or an accommodation due to a disability, you may contact us for support at: [email protected]<br/><br/>At ofi, we celebrate our diversity. Olam Americas, LLC is proud to be an equal opportunity workplace.", "responsibilities": "<ul><li> Assess and analyze current-state processes inclusive of the tools used, data inputs and outputs, etc.</li><li> Understand material planning and re-ordering process from key stakeholders including procurement managers</li><li> Configure, trial and test through demandcaster sandbox: Test system’s output of weekly finite schedule, material requirements and monthly supply plan vs existing planning process</li><li> Develop familiarity with documented processes &amp; team members involved in each part of the process</li><li> Identify strengths and opportunities; lead and host cross-functional alignment sessions to present proposal for future-state</li><li> Operationalize solution in live environment and drive adoption amongst planners and procurement team</li><li> Lead and participate in ad hoc projects for the Private label Spices team</li><li> Perform other duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "High school diploma is required.\nMust be currently enrolled at an accredited college or university, working toward a bachelor’s degree in Operations, Supply Chain, Business or a related discipline.\nAbility to work effectively within a fast-paced environment is required.\nMust possess a high degree of initiative and resourcefulness.\nHigh level of integrity, confidentiality and data protection are required.\nExperience with Microsoft Suite (Word, PowerPoint, Excel) is required.\nStrong communication skills, both written and verbal are required."}, "skills": ["Supply Chain", "Business", "Microsoft Suite", "Communication"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993757712"}