{"jobTitle": "Fulfillment Operations Supervisor", "company": {"name": "CookUnity", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "22.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Manufacturing", "description": "CookUnity is a chef-to-you marketplace connecting talented chefs with consumers, revolutionizing meal delivery. We bring small-batch, restaurant-quality meals to eaters nationwide, crafted by a diverse collective of all-star chefs. With over 100 inspired chefs from cities like NYC, LA, Austin, and more, our weekly subscription offers a wide range of hand-crafted meals to cater to various palates and dietary preferences.<br/><br/>By delivering over 1 million meals per month, we're also empowering working chefs, tripling their income, and supporting their growth. CookUnity believes in fueling stronger communities, partnering with Food Bank For New York City to combat food insecurity across all five boroughs.<br/><br/><strong>Who We Are…<br/><br/></strong>CookUnity is the first-ever chef-to-consumer platform. Connecting a diverse group of talented chefs with busy food lovers, we're elevating the at-home dining experience.<br/><br/>We are growing rapidly and looking for hard-working, passionate team members that will help us become more efficient, faster, and reliable to our customers.<br/><br/>We are always learning and growing – if this sounds like an environment where you would thrive, we'd love to hear from you!<br/><br/>The<strong> Fulfillment Supervisor</strong> performs activities associated with overseeing our Fulfillment and Logistics operations teams.<br/><br/><strong>What You’ll Get…<br/><br/></strong><ul><li>Paid weekly</li><li>Healthcare coverage with Cigna</li><li>Opportunity for advancement<br/><br/></li></ul><strong>Responsibilities:<br/><br/></strong><ul><li>delegating daily tasks, responsibilities, break times, etc.. to team members</li><li>communication between 3PL's, shipping couriers, and customer service</li><li>liaison between hourly team members and management</li><li>be the subject matter expert of Fulfillment and Logistics <br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>4+ years of Supervisor or Lead experience in a warehouse and/or food preparation facility </li><li>Demonstrated capability to work independently with minimal supervision</li><li>Good communication skills and the ability to interact effectively with team members</li><li>Strong organizational skills with attention to detail in food preparation, cleanliness, and operational procedures</li><li>Ability to work various shifts, including evenings and weekends, as required</li><li>Knowledge of Google Suit platform<br/><br/></li></ul><strong>You are:<br/><br/></strong>Able to perform the essential functions of the position with or without reasonable accommodation, including<br/><br/><ul><li>Ability to stand for extended periods. </li><li>Capability to lift and carry items up to 50 lbs. </li><li>Manual dexterity for handling kitchen equipment and packaging materials. </li><li>Ability to work in temperature controlled environments <br/><br/></li></ul><strong>Must haves…<br/><br/></strong><ul><li>18 years of age or older</li><li>Authorization to work in the United States</li><li>Previous experience in fulfillment or warehouse work<br/><br/></li></ul><strong>Nice to have…<br/><br/></strong><ul><li>Bilingual with Spanish and English <br/><br/></li></ul>If you’re interested in this role, please submit your application and if we think you might be a fit, we'll get in touch with you. Thank you for your time!<br/><br/><strong>Job Title: Supervisor<br/><br/></strong><strong>Paid: $22-$27<br/><br/></strong>#ENGMP<br/><br/><strong>Compensation</strong> All final pay rates will be determined by candidates experience, knowledge, skills, and abilities of the applicant, internal equity, and alignment with market data.<br/><br/>Pay Range for this position<br/><br/>$22 — $27 USD<br/><br/>If you’re interested in this role, please submit your application and if we think you might be a fit, we'll get in touch with you. Thank you for your time!<br/><br/>CookUnity is an Equal Opportunity Employer. We are dedicated to creating a community of inclusion and an environment free from discrimination or harassment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, citizenship status, protected veteran status, genetic information, or physical or mental disability.", "responsibilities": "The<strong> Fulfillment Supervisor</strong> performs activities associated with overseeing our Fulfillment and Logistics operations teams.<br/><br/><strong>What You’ll Get…<br/><br/></strong><ul><li>Paid weekly</li><li>Healthcare coverage with Cigna</li><li>Opportunity for advancement<br/><br/></li></ul><strong>Responsibilities:<br/><br/></strong><ul><li>delegating daily tasks, responsibilities, break times, etc.. to team members</li><li>communication between 3PL's, shipping couriers, and customer service</li><li>liaison between hourly team members and management</li><li>be the subject matter expert of Fulfillment and Logistics <br/><br/></li></ul>", "qualifications": {"required": "4+ years of Supervisor or Lead experience in a warehouse and/or food preparation facility, Demonstrated capability to work independently with minimal supervision, Good communication skills and the ability to interact effectively with team members, Strong organizational skills with attention to detail in food preparation, cleanliness, and operational procedures, Ability to work various shifts, including evenings and weekends, as required, Knowledge of Google Suit platform", "preferred": "Bilingual with Spanish and English"}, "skills": ["Google Suit"], "postedDate": "2 weeks ago", "benefits": "Paid weekly, Healthcare coverage with Cigna, Opportunity for advancement", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993317110"}