{"jobTitle": "Associate, FP&A", "company": {"name": "Netflix", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$50,000 - $240,000"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world's leading entertainment services with over 247 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>Netflix is the world's leading streaming entertainment service with 270 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/>Netflix is looking for experienced finance professionals to join our team. This role will be the primary point person to support senior management in all budgeting and forecasting-related areas. Senior leadership depends heavily on our Financial Planning &amp; Analysis groups to accurately model and forecast the business as well as to lead the strategic analysis that is used to inform important business decisions.<br/><br/><strong>We Currently Have Opportunities Available On The Following Teams<br/><br/></strong><ul><li> Content FP&amp;A<br/><br/></li></ul>All roles are based in our Hollywood, CA offices. Depending on business needs and candidate background, you’ll be aligned to either our Studio, Marketing, Products &amp; Technology, or Content teams, with the future opportunity to rotate across business functions as openings become available.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Supporting near-term and long-term P&amp;L forecasts</li><li>Supporting key portions of the company's free cash flow forecast</li><li>Developing insightful presentations that summarize this data and facilitate decision-making for senior Netflix management</li><li>Performing financial scenario analysis to support senior management's strategic decision making</li><li>Candidates are required to be highly analytical and be strong, effective communicators.</li><li>Prior experience in financial planning &amp; analysis in the entertainment industry, management consulting, investment banking, or Big 4 accounting is preferred. Ideal candidates will have a proven track record of superior financial and strategic analysis and developing/delivering recommendations based on this analysis. </li><li>The successful candidate must display initiative in anticipating and exceeding the business demands of senior-level business managers. This person must thrive in a fast-paced environment and exhibit the highest personal and professional standards of integrity and ethics. </li><li>Netflix is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. Candidate must be motivated, disciplined, and able to work effectively autonomously.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>3-5 years of experience conducting quantitative and qualitative financial analysis</li><li>Superior proficiency with Excel &amp; complex financial modeling</li><li>Excellent verbal and written communication skills</li><li>Sound working knowledge of the related accounting guidance preferred</li><li>Bachelor's degree with emphasis on coursework of a quantitative nature, preferably Business, Economics, or Mathematics<br/><br/></li></ul>Due to the nature and scope of this role, we will need to run a background check prior to starting with us.<br/><br/>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $50,000 - $240,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "Supporting near-term and long-term P&amp;L forecasts\nSupporting key portions of the company's free cash flow forecast\nDeveloping insightful presentations that summarize this data and facilitate decision-making for senior Netflix management\nPerforming financial scenario analysis to support senior management's strategic decision making\nCandidates are required to be highly analytical and be strong, effective communicators.\nPrior experience in financial planning &amp; analysis in the entertainment industry, management consulting, investment banking, or Big 4 accounting is preferred. Ideal candidates will have a proven track record of superior financial and strategic analysis and developing/delivering recommendations based on this analysis. \nThe successful candidate must display initiative in anticipating and exceeding the business demands of senior-level business managers. This person must thrive in a fast-paced environment and exhibit the highest personal and professional standards of integrity and ethics. \nNetflix is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. Candidate must be motivated, disciplined, and able to work effectively autonomously.", "qualifications": {"required": "3-5 years of experience conducting quantitative and qualitative financial analysis\nSuperior proficiency with Excel &amp; complex financial modeling\nExcellent verbal and written communication skills\nSound working knowledge of the related accounting guidance preferred\nBachelor's degree with emphasis on coursework of a quantitative nature, preferably Business, Economics, or Mathematics", "preferred": ""}, "skills": ["Financial Analysis", "Financial Modeling", "Excel", "Presentation Skills", "Strategic Analysis", "Communication Skills"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993655450"}