{"jobTitle": "Transportation Services Manager", "company": {"name": "City of Costa Mesa", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "148,980.00/yr - 199,656.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Truck Transportation", "description": "<strong>Description<br/><br/></strong><strong>THE POSITION: <br/><br/></strong>Appointed by the Public Works Director, the Transportation Services Manager oversees the Transportation division consisting of the Transportation Planning, Traffic Operations, and Active Transportation Sections, and is responsible for planning, organizing, and supervising the work of 6 full-time traffic engineering professionals. The Transportation Services Manager, along with the Division team, is responsible for the City’s Master Plan of Arterials Highways, Active Transportation Plan, and Pedestrian Master Plan; designing and maintaining the City’s bicycle and pedestrian infrastructure and preparing layouts, design and specifications for active transportation improvements and traffic signal infrastructure; overseeing capital improvement projects; preparing plans and specifications for the installation and modification of street lights and traffic signals; overseeing the General Plan’s circulation elements and the City’s traffic model, as well as reviewing of development plans, related traffic studies, overseeing major active transportation improvement projects; conferring with City departments, public officials and business and civic leaders in matters relating to traffic issues and represents City staff at various council, commission and committee meetings<br/><br/><strong>Qualifications<br/><br/></strong>The ideal candidate must have five (5) years of progressively responsible experience in the field of traffic engineering and transportation planning, including three (3) years supervisory/management experience. Graduation from a fouryear college or university with major course work in civil engineering, traffic engineering, transportation or related field is required. A Master’s degree in Civil Engineering, Urban Planning, Public Administration, Business Administration, or a related field is highly desirable. Certification as a registered Civil Engineer by the State of California or registration as a Traffic Engineer by the State of California is highly desirable. A<br/><br/><strong>Qualifications<br/><br/></strong>The City offers a competitive salary of $148,980 up to $199,656 based on experience and qualifications, plus a generous and competitive benefit package. Please click on the below link for more information regarding this position and to view the recruitment brochure:<br/><br/>Transportation Services Manager<br/><br/><strong>The filing deadline is August 30, 2024. </strong>To apply for this exciting career opportunity, please visit www.peckhamandmckenney.com . Application materials will be screened in relation to the criteria described in this brochure. Candidates deemed to be the most highly qualified will be invited to participate in the selection process.<br/><br/>Please contact Tara Schultz at (626) 644-1398 or (866) 912-1919 should you have any questions regarding this position or the recruitment process.<br/><br/>Please refer to the job flyer for benefits information.<br/><br/>Closing Date/Time: 8/30/2024 5:00 PM Pacific", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3993166920"}