{"jobTitle": "Warehouse Associate", "company": {"name": "O'Neal Industries", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Mining", "description": "Can you handle materials safely and efficiently? Are you passionate and do you want to make an impact? If so, begin your new career with TW Metals!<br/><br/><strong>Requirements:<br/><br/></strong><ul><li>Be safe</li><li>Keep your area clean and organized</li><li>Be willing to learn: training provided</li><li>High school diploma or general education degree (GED)</li><li>Mechanical Aptitude</li><li>Committed and comfortable working independently<br/><br/></li></ul>Extra Credit: Fork Lift; Side Loader; Deburr; Packing; Export; Receiving; Shipping; PVC M/C; Chop Saw; Band Saw; Plate Saw; Shear M/C; Waterjet; Laser M/C<br/><br/><strong>Physical Demands:<br/><br/></strong><ul><li>Position requires standing, sitting, stooping, and kneeling</li><li>Frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds, with assistance</li><li>Specific vision requirements include close vision, distance vision, peripheral vision, and depth perception with or without corrected vision<br/><br/></li></ul><strong>The Good Stuff:<br/><br/></strong>We invest in our people! $2,000+ per year incentive eligibility; Performance-based bonus; Tuition reimbursement; Generous yearly profit-sharing 401(k) deposit and of course a full comprehensive benefits program.TW Metals, LLC is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will be considered for employment regardless of race, religion, gender, gender identity, sexual orientation, national origin, disability, age, or veteran status. TW Metals is also committed to complying with all fair employment practices regarding citizenship and immigration status. *Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Qualifications<br/><br/></strong>Behaviors<br/><br/><strong>Required<br/><br/></strong><ul><li>Enthusiastic: Shows intense and eager enjoyment and interest</li><li>Team Player: Works well as a member of a group</li><li>Detail Oriented: Capable of carrying out a given task with all details necessary to get the task done well<br/><br/></li></ul>Motivations<br/><br/><strong>Required<br/><br/></strong><ul><li>Job Security: Inspired to perform well by the knowledge that your job is safe</li><li>Goal Completion: Inspired to perform well by the completion of tasks<br/><br/></li></ul>Education<br/><br/><strong>Preferred<br/><br/></strong><ul><li>High School or better<br/><br/></li></ul>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br/><br/>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)", "responsibilities": "Be safe\nKeep your area clean and organized\nBe willing to learn: training provided\nHigh school diploma or general education degree (GED)\nMechanical Aptitude\nCommitted and comfortable working independently", "qualifications": {"required": "Enthusiastic: Shows intense and eager enjoyment and interest\nTeam Player: Works well as a member of a group\nDetail Oriented: Capable of carrying out a given task with all details necessary to get the task done well", "preferred": "High School or better"}, "skills": ["Fork Lift", "Side Loader", "Deburr", "Packing", "Export", "Receiving", "Shipping", "PVC M/C", "Chop Saw", "Band Saw", "Plate Saw", "Shear M/C", "Waterjet", "Laser M/C"], "postedDate": "2 weeks ago", "benefits": "$2,000+ per year incentive eligibility; Performance-based bonus; Tuition reimbursement; Generous yearly profit-sharing 401(k) deposit and of course a full comprehensive benefits program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993062448"}