{"jobTitle": "Junior Buyer", "company": {"name": "Computacenter", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Purchasing, Supply Chain, and Administrative", "industry": "IT Services and IT Consulting", "description": "<strong>About the role</strong><p>The Buyer procures hardware, software, supplies, and services for the company following established and approved procurement policies and procedures while maintaining good vendor relations. This position is an office-based position; Buyers are provided office space at their local office.</p><p>Salary range: $52K</p><p><br/></p><p><strong>What you'll be doing</strong></p><ul><li>Procuring materials, services, and supplies. Following up with vendors to confirm orders and make necessary changes.</li><li>Negotiating with vendors to deliver best pricing and terms for Computacenter US (CCUS).</li><li>Understanding the deal registration process.</li><li>Promoting CCUS as the preferred route to market,</li><li>Possessing knowledge of rebates, marketing funds, and vendor contribution programs in relation to partners.</li><li>Responding to internal inquiries regarding purchasing procedures for providing information, direction and/or referral for addressing inquiry.</li><li>Working with vendors as needed to process revisions.</li><li>Processing Internal purchases following company policy.</li><li>Processing Resource requests following contractor process.</li><li>Managing purchasing alias/individual emails.</li><li>Executing RMA’s and following up with vendors to confirm the receipt of product.</li><li>Working with the department manager to develop and maintain policies and procedures for the Procurement practice.</li><li>Participating in weekly team/internal meetings.</li><li>Performing all other duties and special projects as assigned.</li><li>Embracing and supporting Computacenter United States Inc.’s mission and core values.</li><li>Processing vendor credits in a timely manner.</li><li>Running various purchasing reports.</li><li>Resolving invoice discrepancies and managing workflows in a timely manner.</li><li>Creating purchasing orders and processing purchase requisitions.</li><li>Following-up on overdue or unconfirmed purchase orders.</li></ul><p><br/></p><p><strong>What you have</strong></p><ul><li>Legally eligible to work in the United States.</li><li>Bachelor’s Degree in Accounting, Business or similar preferred.</li><li>3 years of technology purchasing required.</li><li>1-3 years of SAP experience preferred</li><li>Requires a degree of technical knowledge.</li><li>Requires the use of initiative and independent judgment.</li><li>Ability to work and succeed in a fast-paced, deadline driven environment while demonstrating teamwork and great communication.</li><li>Highly detail-oriented.</li><li>Must be able to interact with all levels of the organization.</li><li>Excellent computer skills, including Microsoft Excel, Salesforce, or other ERP/CRM systems, preferably SAP.</li><li>Able to work with minimal supervision.</li></ul><p><br/></p><p><strong>What you can expect</strong></p><p>There’s so much more to enjoy about being at Computacenter than just having a rewarding career. In addition to offering competitive compensation plans and long-term career opportunities, we provide an attractive mix of benefit plans to contribute to your good health, future financial security, and peace of mind.</p><p><br/></p><p><strong>About us</strong></p><p>Computacenter is a leading independent technology partner, trusted by large corporate and public sector organizations. We help our world-renowned customers to source, transform, and manage their IT infrastructure to deliver digital transformation, enabling users and their business. We’re a public company quoted on the London FTSE 250 (CCC.L) and employ over 20,000 people worldwide. In the US, we support some of the country’s best-known businesses with regional hubs in San Francisco and Irvine, CA; Norcross, GA; Plano, TX; and New York City; and Integration Centers in Silicon Valley and Atlanta. www.computacenter.com/us</p>", "responsibilities": "The Buyer procures hardware, software, supplies, and services for the company following established and approved procurement policies and procedures while maintaining good vendor relations. This position is an office-based position; Buyers are provided office space at their local office.", "qualifications": {"required": "Legally eligible to work in the United States. Bachelor’s Degree in Accounting, Business or similar preferred. 3 years of technology purchasing required. 1-3 years of SAP experience preferred Requires a degree of technical knowledge. Requires the use of initiative and independent judgment. Ability to work and succeed in a fast-paced, deadline driven environment while demonstrating teamwork and great communication. Highly detail-oriented. Must be able to interact with all levels of the organization. Excellent computer skills, including Microsoft Excel, Salesforce, or other ERP/CRM systems, preferably SAP. Able to work with minimal supervision.", "preferred": "Legally eligible to work in the United States. Bachelor’s Degree in Accounting, Business or similar preferred. 3 years of technology purchasing required. 1-3 years of SAP experience preferred Requires a degree of technical knowledge. Requires the use of initiative and independent judgment. Ability to work and succeed in a fast-paced, deadline driven environment while demonstrating teamwork and great communication. Highly detail-oriented. Must be able to interact with all levels of the organization. Excellent computer skills, including Microsoft Excel, Salesforce, or other ERP/CRM systems, preferably SAP. Able to work with minimal supervision."}, "skills": ["SAP", "Microsoft Excel", "Salesforce", "ERP", "CRM"], "postedDate": "6 days ago", "salary": {"amount": "52,000.00", "currency": "USD"}, "benefits": "There’s so much more to enjoy about being at Computacenter than just having a rewarding career. In addition to offering competitive compensation plans and long-term career opportunities, we provide an attractive mix of benefit plans to contribute to your good health, future financial security, and peace of mind.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993814053"}