{"jobTitle": "Customer Supply Chain Specialist", "company": {"name": "LHH", "location": "Monrovia, CA"}, "location": "Monrovia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Customer Service, Supply Chain, and Management", "industry": "Chemical Manufacturing and Transportation, Logistics, Supply Chain and Storage", "description": "Currently recruiting for a Supply Chain, Customer Service lead and or manager that plays a crucial role within the Operations Team.  This role is dedicated to managing the end-to-end supply chain process and ensuring seamless import and export operations. The primary focus of this position is to support our sales team and, ultimately, our clients by overseeing the processing of orders from submission through to delivery. Responsibilities include managing orders in the CRM/accounting system, coordinating with the internal manufacturing team or external manufacturers, overseeing the logistics of finished goods shipments, and ensuring that the accounting department has all necessary information for invoicing.  REQUIRED EDUCATION AND EXPERIENCE:  Bachelor’s Degree from an accredited institution and/or At least 3 years of experience in a customer service management role or similar Proficiency in SAP is required. Strong skills in MS Office applications, including Word, Excel, and Outlook Ability to maintain professionalism in a fast-paced, high-pressure environment. Experience in a manufacturing company, especially within a supply chain team, is preferred, particularly with import/export functions. Excellent organizational and planning abilities Exceptional written and verbal communication skills Ability to build relationships and work collaboratively across different teams  JOB RESPONSIBILITIES:  Customer Care: Ensure high levels of customer satisfaction by providing accurate and timely information about products, pricing, order status, and maintaining price lists. Problem Solving: Address and resolve issues related to the supply chain, delivery schedules, pricing discrepancies, and invoicing concerns. Administrative Tasks: Handle data entry, billing, and invoicing. Oversee customer service staff, setting job expectations, conducting performance assessments, and managing annual reviews. SAP: Utilize SAP proficiently for all customer service activities. Import/Export Management: Ensure timely and compliant arrival of international shipments, manage customs clearance for both imports and exports, and coordinate with brokers (e.g., Worldwide Logistics) to ensure smooth goods flow. Create and maintain international customer orders in SAP and ensure import documentation is filed correctly for compliance with US Customs regulations. Logistics Operation Management: Advise on logistics issues, including cost analysis, carrier selection, and JIT-related matters. Stay informed about transport and HAZMAT regulations and provide logistical support to sales and marketing teams. This may involve participating in customer teleconferences or meetings", "responsibilities": "Ensure high levels of customer satisfaction by providing accurate and timely information about products, pricing, order status, and maintaining price lists. Address and resolve issues related to the supply chain, delivery schedules, pricing discrepancies, and invoicing concerns. Handle data entry, billing, and invoicing. Oversee customer service staff, setting job expectations, conducting performance assessments, and managing annual reviews. Utilize SAP proficiently for all customer service activities. Ensure timely and compliant arrival of international shipments, manage customs clearance for both imports and exports, and coordinate with brokers (e.g., Worldwide Logistics) to ensure smooth goods flow. Create and maintain international customer orders in SAP and ensure import documentation is filed correctly for compliance with US Customs regulations. Advise on logistics issues, including cost analysis, carrier selection, and JIT-related matters. Stay informed about transport and HAZMAT regulations and provide logistical support to sales and marketing teams. This may involve participating in customer teleconferences or meetings", "qualifications": {"required": "Bachelor’s Degree from an accredited institution and/or At least 3 years of experience in a customer service management role or similar Proficiency in SAP is required. Strong skills in MS Office applications, including Word, Excel, and Outlook Ability to maintain professionalism in a fast-paced, high-pressure environment. Experience in a manufacturing company, especially within a supply chain team, is preferred, particularly with import/export functions. Excellent organizational and planning abilities Exceptional written and verbal communication skills Ability to build relationships and work collaboratively across different teams"}, "skills": ["SAP", "Customer Service", "Supply Chain", "Management", "MS Office", "Word", "Excel", "Outlook", "Import/Export", "Logistics", "Cost Analysis", "Carrier Selection", "JIT", "HAZMAT", "Sales", "Marketing", "Teleconferences", "Meetings"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993672092"}