{"jobTitle": "Junior Project Manager", "company": {"name": "Tetra Tech", "industry": "Civil Engineering", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Project Management and Information Technology", "industry": "Civil Engineering", "description": "Are you ready to advance your career and make a real impact? Join Tetra Tech, where you’ll work with dedicated teams committed to improving quality of life by solving complex challenges in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech’s Disaster Response Division is seeking Junior Project Managers to contribute to our mission in post-event recovery and monitoring services. Key Responsibilities: Project Management: Oversee a variety of projects related to disaster recovery, ensuring adherence to FEMA guidelines and regulations, including the Public Assistance Program and Policy Guide (PAPPG) Version 4. Client Interaction: Collaborate effectively with clients, consultants, team members, and strategic partners to deliver superior program management services. Performance Monitoring: Track daily project progress, monitor performance metrics, and ensure compliance with budget constraints (e.g., not-to-exceeds and burn rates). Communication: Maintain clear, regular communication with clients and company stakeholders about project status and any emerging issues. Integrity and Professionalism: Uphold the highest standards of integrity in all interactions, both on and off the job. Safety Oversight: Ensure a safe working environment by monitoring site safety and promoting safety awareness. Technical Training: Participate in on-the-job training to meet technical project requirements. Qualifications: Willingness to Travel: Ability to travel to various project sites for extended periods. Educational Background: Bachelor’s degree preferred. Industry Experience: Familiarity with disaster recovery, construction, emergency management, public safety, or related fields. Team Management: Proven experience managing and training diverse groups of employees across multiple locations. Subcontractor Coordination: Ability to oversee multiple subcontractors and dynamically deploy crews across various sites within a municipality. Communication Skills: Strong verbal and written communication abilities. Organizational Skills: Highly organized with exceptional attention to detail. Technical Proficiency: Proficient in Microsoft Office Suite, with a particular emphasis on Excel. Problem Solving: Skilled at interacting with homeowners and resolving issues effectively. Take this opportunity to join Tetra Tech and contribute to meaningful projects that make a difference. About Tetra Tech: Tetra Tech is a leading provider of high-end consulting and engineering services for projects worldwide. We combine the resources of a global, multibillion dollar company with local, client-focused delivery in more than 400 locations around the world. We are Leading with Science® to provide sustainable and resilient solutions for our clients. For more information on our company, please visit our website at www.tetratech.com. To apply, please submit your resume and cover letter on the Careers portion of our website at www.tetratech.com/careers. We thank all applicants for their interest; however only those selected for an interview will be contacted. Tetra Tech is committed to creating a diverse environment and is proud to be an Equal Opportunity Employer. We invite resumes from all interested parties including women, minorities, veterans and persons with disabilities. Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions. EOE AA M/F/Vet/Disability - No calls or agencies.", "responsibilities": "Project Management: Oversee a variety of projects related to disaster recovery, ensuring adherence to FEMA guidelines and regulations, including the Public Assistance Program and Policy Guide (PAPPG) Version 4. Client Interaction: Collaborate effectively with clients, consultants, team members, and strategic partners to deliver superior program management services. Performance Monitoring: Track daily project progress, monitor performance metrics, and ensure compliance with budget constraints (e.g., not-to-exceeds and burn rates). Communication: Maintain clear, regular communication with clients and company stakeholders about project status and any emerging issues. Integrity and Professionalism: Uphold the highest standards of integrity in all interactions, both on and off the job. Safety Oversight: Ensure a safe working environment by monitoring site safety and promoting safety awareness. Technical Training: Participate in on-the-job training to meet technical project requirements.", "qualifications": {"required": "Bachelor’s degree preferred. Familiarity with disaster recovery, construction, emergency management, public safety, or related fields.", "preferred": "Strong verbal and written communication abilities. Highly organized with exceptional attention to detail. Proficient in Microsoft Office Suite, with a particular emphasis on Excel."}, "skills": ["Project Management", "Client Interaction", "Performance Monitoring", "Communication", "Integrity and Professionalism", "Safety Oversight", "Technical Training"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993330312"}