{"jobTitle": "Luxury  Sales Representative", "company": {"name": "South County Lexus", "location": "Mission Viejo, CA"}, "location": "Mission Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Motor Vehicle Manufacturing", "description": "Looking for a job that combines competitive pay with good culture? Have you been considering the automotive industry but don't know how to break in? Luxury and reliability are hallmarks of the Lexus brand. At South County Lexus in Orange County, we strive to personify those traits by serving our Mission Viejo community. As a recipient of the \"Elite Lexus Dealer Award,\" we have long been recognized as a Lexus dealer in southern California who excels in sales and service. Pay ranges from $60,000 to $80,000 yearly. Automotive experience preferred. WHAT WE OFFER:<br/><br/><ul><li> Health &amp; Dental Plan</li><li> 401(k) Retirement Plan</li><li> Paid Vacations</li><li> Clear Promotion Tracks &amp; Flexibility to Growth</li><li> Long Term Job Security</li><li> Friendly Working Environment<br/><br/><br/></li></ul>RESPONSIBILITIES:<br/><br/><ul><li> Build relationships &amp; create customers for life. Assist them in selecting a vehicle by asking questions and listening carefully to their responses.</li><li> Be the vehicle expert. Know the in’s &amp; the out’s of product offerings, optional packages &amp; latest technology</li><li> Perform high-quality and professional demonstrations of new/used vehicles.</li><li> Follow-up with buyers to ensure referral business.</li><li> Learn to overcome objections and thrive in sales situations</li><li> Direct report to the Sales Manager regarding objectives, planned activities, reviews, and analyses.</li><li> Bring your ‘A game’ &amp; positive attitude with you every day<br/><br/><br/></li></ul>REQUIREMENTS:<br/><br/><ul><li> Available to work flexible hours &amp; weekends</li><li> Ready to hit the ground running on learning new product in’s &amp; out’s</li><li> Fantastic communication skills with your customers</li><li> Professional, well-groomed personal appearance.</li><li> Clean driving record</li><li> Willing to submit to a pre-employment background check &amp; drug screen<br/><br/><br/></li></ul>We are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "postedDate": "2 weeks ago", "benefits": "Health & Dental Plan, 401(k) Retirement Plan, Paid Vacations, Clear Promotion Tracks &amp; Flexibility to Growth, Long Term Job Security, Friendly Working Environment", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993262547"}