{"jobTitle": "Assistant General Manager", "company": {"name": "Park Hospitality", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Restaurants", "description": "Park Hospitality (Donna’s, Lowboy, Bar Flores) is looking for an Assistant General Manager for Lowboy, our busy neighborhood bar and restaurant!<br/><br/>We are a small, growing group of neighborhood bars and restaurants with a strong sense of community and hospitality. Our first venue, Wolf and Crane, is a Japanese whisky and cocktail bar in Little Tokyo that just celebrated its 10-year anniversary. On Sunset in the heart of Echo Park, we operate Bar Flores, a female-centered and latin inspired cocktail bar, Lowboy, a neighborhood bar with everything you could want, easy atmosphere, good drinks, and delicious smash burgers, and most recently, Donna’s, an East-coast inspired, Italian red-sauce joint that feels like a nightly dinner party. In all of our venues we strive to create comfortable spaces where our guests feel at home.<br/><br/>The Assistant General Manager will be responsible for supporting the General Manager in the ongoing development, maintenance, and operation of Lowboy. Responsibilities include, but are not limited to, overseeing restaurant setup, assisting all floor positions during service, interacting with guests, cash handling and overseeing closing of the restaurant.<br/><br/>The AGM is required to work full-time, including 4 weekly closing shifts and one admin day per week.<br/><br/>During operating hours on scheduled service/closing shifts, the AGM is expected to be an active participant in service:<br/><br/><ul><li>Ensure timely arrival of all scheduled staff. </li><li>Dictate break timing and ensure breaks are taken by all hourly employees in accordance with California labor laws. </li><li>Ensure staff are working to Lowboy standards and following all protocols. </li><li>Act as the primary point person for any guest or staff issues and serve as the main point of contact with security. </li><li>Serve as the conduit between the kitchen and FOH. Ensure clear, efficient, and productive communication in order to create a smooth service. </li><li>Oversee counting of the drop and cash tips at the end of shift. </li><li>Write the nightly closing report. </li><li>Throughout open hours, the AGM should be an active participant in service and is responsible for guiding the flow of the night, keeping team morale up, and lending a helping hand wherever is needed. </li><li>On weekly admin days, the AGM is responsible for aiding the GM in implementing bar and service systems, R+D projects, scheduling, editing time punches and other duties assigned by the GM. <br/><br/></li></ul>Our ideal candidate is someone who is passionate about hospitality, eager to learn, and interested in growing with Park Hospitality. Prior FOH management experience required and some bartending/bar management experience is preferred. Must be available nights and weekends.<br/><br/>Please send us a note about yourself along with your resume.<br/><br/>More detail about Park Hospitality part of Park Hospitality, please visit https://culinaryagents.com/entities/374080-Park-Hospitality", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3993752272"}