{"jobTitle": "National Account Manger - Costco West", "company": {"name": "Diageo", "industry": "Beverage Manufacturing", "location": "Aliso Viejo, CA"}, "location": "Aliso Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Beverage Manufacturing", "description": "Job Description<br/><br/><strong><em>National Account Manager West, Costco – (L5) <br/><br/></em></strong><strong><em>Locations: SoCal <br/><br/></em></strong><strong>About The Role<br/><br/></strong>As a National Account Manager for Costco, you will play a pivotal role in the strategic development and expansion of Diageo’s Spirits portfolio across one of our key growth channels. This position demands a proactive and collaborative approach, working closely with Costco's buying offices in major regional hubs (San Francisco, Los Angeles, and San Diego for West) our focus will be to drive Diageo's market presence and sales initiatives within Costco, ensuring our brands resonate strongly with their diverse customer base.<br/><br/><em>Role and Responsibilities <br/><br/></em><ul><li>Performance Targets: Achieve annual volume, net revenue, price mix, and market share targets. Lead the evaluation and adjustment of investments to ensure optimum performance.</li><li>Stakeholder Relationships: Build and maintain positive relationships with key stakeholders, specifically the Regional Buyers for your region at Costco. Ensure effective integration of Diageo into distributor network.</li><li>Brand Optimization: Enhance Diageo's brand performance at Costco by driving key sales drivers such as promotions, distribution, and visibility.</li><li>Strategic Planning: Collaborate in the creation and execution of Costco’s annual operating plan that aligns with mutual growth objectives.</li><li>Program Development: Develop and implement quarterly sales and marketing programs, including assortment reviews, innovation initiatives, and display programs that fuel performance.</li><li>Cross-Functional Leadership: Direct the communication process among Shopper Marketing, Sales Analytics, Category Development, E-Commerce, and distributor/division partners to drive cohesive execution of customer initiatives.</li><li>Innovation and Solutions: Conceptualize and deploy solutions that balance growth within Costco, ensuring proactive communication, adjustment, and innovation in sales strategies.</li><li>Execution and Metrics: Work closely with Diageo’s sales, Performance Management, and distributor teams to refine execution of initiatives and develop metric-tracking tools.</li><li>Risk Management: Lead the assessment of opportunities and risks, adjusting strategies as necessary to meet annual goals. Fulfill all monthly performance management requirements.</li><li>Financial Planning: Assist in managing A&amp;P/Trade budgets, aligning expenditures with strategic goals and ensuring fiscal discipline.</li><li>SKU Management: Oversee SKU assortment across all regions, collaborating with Costco buying teams and distributors to optimize SKU availability and manage changes, including limited-time offerings and unexpected assortment adjustments.<br/><br/></li></ul><strong>About You<br/><br/></strong><em>Preferred Experience, Skills and Education Requirements<br/><br/></em><ul><li>Educational &amp; Professional Background: 4 Year College Degree Required with a minimum of 5 years of industry experience. This should include significant exposure to regional or national account customers across multiple sub-channels such as club, liquor, and grocery. A strong background in Spirits and/or experience with a 3-tier route-to-market is essential.</li><li>Travel Requirements: Extensive travel is necessary for strategic account calls, effective assessment of store/state dynamics, and fostering local market and wholesaler collaboration.</li><li>Distributor Network Experience: Familiarity with a diverse beverage alcohol distributor network covering Open, Control, and Franchise states is highly preferred.</li><li>Skill Proficiency: Exceptional communication, negotiation, and fact-based selling skills are crucial. Applicants should be adept at articulating and persuading in complex sales discussions.</li><li>Analytical Abilities: Strong data analysis and management skills are required to effectively monitor and report on spirits trends and activities across divisions. Proficiency in Excel, PowerPoint, and PowerBI is expected.</li><li>Personal Attributes: Highly self-motivated and goal-oriented, with a demonstrated ability to drive results and achieve ambitious targets.<br/><br/></li></ul><em>Leadership and Dial Up Behaviors<br/><br/></em>Lean in to our “dial up behaviors” and core values<br/><br/><ul><li>Be externally curious</li><li>Collaborate efficiently</li><li>Experiment and learn</li><li>Act decisively<br/><br/></li></ul>Our purpose is to celebrate life, every day, everywhere. And creating an inclusive culture, where everyone feels valued and listened to, is a crucial part of this.<br/><br/>We believe the most diverse and inclusive culture makes for a better business and a better world. We know that for our business to thrive and for Diageo to realise its ambition, we depend on having diverse talent with a range of backgrounds, skills and capabilities in each of the countries in which we operate and to reflect our broad consumer base.<br/><br/>Around the world we have a number of inclusive Business and Employee Resource Groups known as BRGs and ERGs. These influential groups, made up of our people, represent various viewpoints, experiences and communities who generate thought-provoking work to enhance our business and workplace, creating a sense of belonging and opportunities for all!<br/><br/>Join us, and you'll be part of an organisation that embraces diversity in the broadest possible sense. This means that you'll be welcomed and celebrated for who you are just by being you. You'll be part of — and help build — an inclusive culture that celebrates people of different gender, ethnicity, ability, age, sexual orientation, social class, educational backgrounds, experiences, mindsets, and more. And you'll help us champion inclusion and diversity across our entire business: with our employees, our suppliers, across our brands, and within the communities in which we operate.<br/><br/>Our ambition is to create the best performing, most trusted and respected consumer products companies in the world. To achieve this, we need the world’s very best people. We're looking for people with curiosity, creativity, boldness and a sense of purpose to take Diageo and our timeless, pioneering brands to the next level.<br/><br/>Feel inspired? Then this may be the opportunity for you!<br/><br/><strong>Worker Type<br/><br/></strong>Regular<br/><br/><strong>Primary Location:<br/><br/></strong>Aliso Viejo<br/><br/><strong>Additional Locations :<br/><br/></strong><strong>Job Posting Start Date<br/><br/></strong>2024-06-07<br/><br/><strong>Salary Range<br/><br/></strong><strong>Minimum Salary:<br/><br/></strong>$110400<br/><br/><strong>Maximum Salary<br/><br/></strong>$184000<br/><br/><em><strong>At Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.</strong></em>", "responsibilities": "Performance Targets: Achieve annual volume, net revenue, price mix, and market share targets. Lead the evaluation and adjustment of investments to ensure optimum performance.\nStakeholder Relationships: Build and maintain positive relationships with key stakeholders, specifically the Regional Buyers for your region at Costco. Ensure effective integration of Diageo into distributor network.\nBrand Optimization: Enhance Diageo's brand performance at Costco by driving key sales drivers such as promotions, distribution, and visibility.\nStrategic Planning: Collaborate in the creation and execution of Costco’s annual operating plan that aligns with mutual growth objectives.\nProgram Development: Develop and implement quarterly sales and marketing programs, including assortment reviews, innovation initiatives, and display programs that fuel performance.\nCross-Functional Leadership: Direct the communication process among Shopper Marketing, Sales Analytics, Category Development, E-Commerce, and distributor/division partners to drive cohesive execution of customer initiatives.\nInnovation and Solutions: Conceptualize and deploy solutions that balance growth within Costco, ensuring proactive communication, adjustment, and innovation in sales strategies.\nExecution and Metrics: Work closely with Diageo’s sales, Performance Management, and distributor teams to refine execution of initiatives and develop metric-tracking tools.\nRisk Management: Lead the assessment of opportunities and risks, adjusting strategies as necessary to meet annual goals. Fulfill all monthly performance management requirements.\nFinancial Planning: Assist in managing A&P/Trade budgets, aligning expenditures with strategic goals and ensuring fiscal discipline.\nSKU Management: Oversee SKU assortment across all regions, collaborating with Costco buying teams and distributors to optimize SKU availability and manage changes, including limited-time offerings and unexpected assortment adjustments.", "qualifications": {"required": "4 Year College Degree Required with a minimum of 5 years of industry experience. This should include significant exposure to regional or national account customers across multiple sub-channels such as club, liquor, and grocery. A strong background in Spirits and/or experience with a 3-tier route-to-market is essential.", "preferred": "Extensive travel is necessary for strategic account calls, effective assessment of store/state dynamics, and fostering local market and wholesaler collaboration.\nFamiliarity with a diverse beverage alcohol distributor network covering Open, Control, and Franchise states is highly preferred.\nExceptional communication, negotiation, and fact-based selling skills are crucial. Applicants should be adept at articulating and persuading in complex sales discussions.\nStrong data analysis and management skills are required to effectively monitor and report on spirits trends and activities across divisions. Proficiency in Excel, PowerPoint, and PowerBI is expected.\nHighly self-motivated and goal-oriented, with a demonstrated ability to drive results and achieve ambitious targets."}, "skills": ["Sales", "Business Development", "Account Management", "Strategic Planning", "Marketing", "Sales Management", "Customer Relationship Management", "Negotiation", "Communication", "Data Analysis", "Excel", "PowerPoint", "Power BI"], "postedDate": "2 weeks ago", "salary": {"amount": "$110400 - $184000", "currency": "USD"}, "benefits": "At Diageo certain roles are eligible for additional rewards, including annual incentive payment and stock awards. US-based employees are eligible for healthcare benefits, retirement benefits , short-term and long-term disability coverage, basic life insurance, wellness benefits and industry leading parental leave, among others. (Benefits/perks listed may vary depending on the nature of your employment with Diageo and the country where you work.) The salary range displayed is the salary range for the role’s primary location.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993565060"}