{"jobTitle": "Social Media Manager, TV & Streaming", "company": {"name": "Digital Media Management", "industry": "Advertising Services and Entertainment Providers", "size": "Not specified", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$45,000.00 - $72,600.00", "currency": "USD"}, "jobFunction": "Advertising, Marketing, and Sales", "industry": "Advertising Services and Entertainment Providers", "description": "Digital Media Management (DMM), a Keywords Studios company, is a full-service social media agency that specializes in 360 campaigns for the entertainment, games, and consumer brands industries. DMM creates groundbreaking social-first campaigns rooted in innovative strategy, and provides clients with community management, creative, video production, influencer, talent, and performance marketing capabilities. We are looking for a Social Media Manager to join our Los Angeles-based TV & Streaming division. This role will be on a team that’s responsible for creating and managing innovative social media for a TV and Streaming clients with some of the most beloved shows on air. You have experience with copywriting, building out content calendars, conceptualizing social creatives, and engaging with audiences on social media channels.", "responsibilities": "Write copy and manage social content for several primetime TV series, all with unique voices and tones. Create and manage innovative, engaging social media campaigns. Ideate on ways to tap into current social media trends. Source moments from content that can be used in social campaigns. Asset management and organization. Manage all content calendars and publishing across social platforms. Conduct 1-to-1 community management with fans, partners, talent, etc. Facilitate community management on all social media channels. Conceptualize concepts and help bring creatives to life in partnership with our creative team. Skilled in project and time management, simultaneously overseeing multiple different projects and campaigns. Participate in brainstorms for various campaigns across the company. Administer high-level reporting and in-app analytics.", "qualifications": {"required": "2+ years of experience working within the social media space, preferably within an agency environment. Experience working across social campaigns in entertainment is a plus. Strong copywriting skills. Familiarity with social publishing tools like Sprinklr or Sprout is a plus. Highly detail-oriented, able to manage multiple campaign timelines simultaneously. Excellent interpersonal and client communication/presentation skills.", "preferred": "Not specified"}, "skills": ["Copywriting", "Social Media Management", "Content Creation", "Community Management", "Project Management"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "DMM pays 100% of the cost for employee medical, dental, and vision premiums, as well as covers 40% of dependent premium costs. Employer paid life insurance. A tax-advantaged health savings account (HSA). A 401(k) plan that provides employees with automatic enrollment at 3% of your salary with a full employer match of your first 3% contribution, all fully vested. Paid family leave. Open PTO: DMM offers unlimited vacation, 10 sick days & 5 mental health days. DMM Fridays: Employees have the opportunity to sign off early and kick-start their weekends at 2pm on Fridays. DEI specific training focused on preventing discrimination and harassment in the workplace. ERGs focusing on diverse perspectives across DMM to promote diversity, inclusion, and shared experiences. Generous donation match to non-profits of interest to our employees. Extensive onboarding that includes working with multiple departments to learn the DMM way. Frequent trainings on the latest tools and trends and how to optimize them for our clients.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3993671296"}