{"jobTitle": "Legal Practice Assistant", "company": {"name": "Jenner & Block", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$85,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative and Legal", "industry": "Law Practice", "description": "<strong><u>ABOUT JENNER &amp; BLOCK</u></strong><p>Jenner &amp; Block (www.jenner.com) is a law firm with global reach, with more than 500 lawyer sand offices in Chicago, London, Los Angeles, New York, San Francisco and Washington, DC. The firm is known for its prominent and successful litigation practice and experience handling sophisticated and high-profile corporate transactions. Firm clients include Fortune 100 companies, large privately held corporations, financial services institutions, emerging companies and venture capital and private equity</p><p>investors. The American Lawyer magazine has ranked Jenner &amp; Block as the #1 pro bono firm in the United States 10 times, most recently in 2019. The firm has been ranked in the top 10 in this category every year since 1990.</p><p><br/></p><p><strong><u>OVERVIEW</u></strong></p><p>The Legal Practice Assistant, working under the supervision of the Director of Administration, provides a wide range of administrative, clerical, and document services to support the workflow and client service needs of attorneys and other timekeepers. Job duties require close collaboration and working with other assistants to and lawyers in the performance of a variety of administrative and practice specific duties as assigned. The Legal Practice Assistant is a non‐exempt position.</p><p><br/></p><p><strong><u>REQUIRED JOB FUNCTIONS</u></strong></p><p>The Legal Practice Assistant must be proficient in the following:</p><ul><li>Collaborates with firm assistants and other teams to provide designated and “as needed” administrative services to assist in delivering exemplary service.</li><li>Creates, edits, formats, and proofreads a wide variety of documents, including memoranda, correspondence, legal, and court documents.</li><li>Receive assignments from attorneys and others, performing tasks as requested; update requestor regarding receipt and status of tasks/projects, and consistently meet agreed upon deadlines.</li><li>Input attorney time into the WebTime time entry program. Stay up to date regarding client-specific billing requirements. Assist timekeepers with maintaining appropriate time entry requirements and standards through outreach and communication.</li><li>Work with the Billing department in all aspects of the billing cycle, including but not limited to the review of client billing for accuracy, edits to content/grammar; resolution of billing problems; and efficient changes to the process.</li><li>Accurately prepare and input attorney expense reimbursements and process client-related vendor invoices for payment.</li><li>Sort, open, prioritize and route incoming mail. Prepare outgoing mail including U.S.P.S., U.P.S. and Federal Express. Coordinate messenger pick-ups and deliveries when necessary.</li><li>Coordinate meeting set-ups, including but not limited to conference calls, Zoom and Teams meetings and in-person meetings.</li><li>May assist with the organization and planning of events. Assists with collection of marketing materials.</li><li>Coordinating with attorney talent team, may obtains approvals and coordinate attendance for outside training programs (MCLE).</li><li>Assists with creating and maintaining client/matter and communication lists.</li><li>Maintain calendar and contacts for attorneys. Maintain electronic filing system via Outlook.</li><li>Perform document conversions, e.g., PDF to Word, etc.</li><li>Handle telephone calls from internal and external sources including taking accurate messages and appropriately routing calls.</li><li>Coordinate prints, scans and duplicating projects with Digital Document Center or Print/Mail Service Centers.</li><li>Coordinate travel arrangements (air, hotel, rail, car rental and black car) with firm-provided travel agency.</li><li>Coordinate the New Matter Intake process. Prepare, finalize, and distribute new client Engagement Letters, New Business Memo, etc. Including follow-up with client to ensure receipt of fully executed Engagement Letter. Initiate Conflicts Checks.</li><li>Perform other related duties, special projects, and assignments as required.</li><li>Provide back-up support and vacation coverage.</li><li>Proactively follows-up with managers and colleagues for feedback on projects completed and requests for additional assignments.</li></ul><p><br/></p><p><strong><u>PREFFERED JOB FUNCTIONS</u></strong></p><ul><li>Ability to provide high levels of practice-specific legal support for timekeepers.</li><li>The ability to e-File in both Federal and State Court.(For LA and San Francisco offices)</li><li>Assist with the preparation of presentation materials for firm and client audiences.</li><li>Prepare correspondence, memoranda, and legal documents such as summonses, complaints, motions, and subpoenas from various sources of origination (handwritten, typed copy, electronic copy, tape transcription, etc.).</li><li>Finalize legal briefs by ensuring styles are consistent throughout and preparing Table of Contents and Table of Authority, and redlining documents.</li><li>Proofread memoranda and factual and legal documents.</li><li>General understanding of the litigation process or practice group transaction from case or transaction inception to closure.</li></ul><p><br/></p><p><strong><u>COMPETENCIES</u></strong></p><ul><li>Lifelong learner and understanding of the need for continuous improvement.</li><li>Demonstrated willingness to take initiative and ability to work both independently and in a team environment with a customer service focus.</li><li>Skilled in collaborating with staff/team members in a complex matrix management environment and managing associate, attorney, and paralegal expectations.</li><li>Discernment to appropriately handle confidential and sensitive information.</li><li>Demonstrated ability to communicate effectively and professionally in a fast-paced and deadline driven environment.</li><li>Effective interpersonal and communication skills, both verbal and in writing.</li><li>Excellent client service skills, including being comfortable interacting with firm clients.</li><li>Excellent organizational skills, ability to effectively prioritize workload, and strong attention to detail.</li><li>Must be able to follow directions.</li><li>Sound business judgment.</li><li>Proven ability to multi‐task.</li><li>Demonstrated foresight to anticipate lawyers’ needs.</li></ul><p><br/></p><p><strong><u>QUALIFICATIONS AND REQUIREMENTS</u></strong></p><ul><li>Proficient in basic computer applications including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).</li><li>Flexibility to adjust hours and work the hours necessary to meet business needs. Ability to work overtime as needed.</li><li>College degree preferred or equivalent work experience.</li></ul><p><br/></p><p>Jenner &amp; Block offers a comprehensive benefits program, which includes medical, dental, and vision insurance, 401(k), and paid time off, in addition to other offerings.</p><p><br/></p><p>We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance</p><p><br/></p><p><strong><em>Jenner &amp; Block LLP is an equal opportunity employer. Recruitment and employment decisions are not made on the basis of an individual’s race, color, creed, religion, national origin, ancestry, citizenship status, age, non-disqualifying physical or mental disability or medical condition, genetic information, sexual orientation, sex, gender identity and/or expression, pregnancy, childbirth, breastfeeding or related medical conditions, arrest record, matriculation, personal appearance, political affiliation, marital, parental, veteran, military, or order of protection status, or any other protected status or that of their relatives, friends, or associates.</em></strong></p>", "responsibilities": "The Legal Practice Assistant, working under the supervision of the Director of Administration, provides a wide range of administrative, clerical, and document services to support the workflow and client service needs of attorneys and other timekeepers. Job duties require close collaboration and working with other assistants to and lawyers in the performance of a variety of administrative and practice specific duties as assigned. The Legal Practice Assistant is a non‐exempt position.", "qualifications": {"required": "Proficient in basic computer applications including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook). Flexibility to adjust hours and work the hours necessary to meet business needs. Ability to work overtime as needed. College degree preferred or equivalent work experience.", "preferred": "Ability to provide high levels of practice-specific legal support for timekeepers. The ability to e-File in both Federal and State Court.(For LA and San Francisco offices). Assist with the preparation of presentation materials for firm and client audiences. Prepare correspondence, memoranda, and legal documents such as summonses, complaints, motions, and subpoenas from various sources of origination (handwritten, typed copy, electronic copy, tape transcription, etc.). Finalize legal briefs by ensuring styles are consistent throughout and preparing Table of Contents and Table of Authority, and redlining documents. Proofread memoranda and factual and legal documents. General understanding of the litigation process or practice group transaction from case or transaction inception to closure."}, "skills": ["Microsoft Office", "Word", "Excel", "PowerPoint", "Outlook", "Legal Support", "e-Filing", "Presentation Materials", "Document Preparation", "Legal Briefs", "Proofreading"], "postedDate": "2 weeks ago", "benefits": "Jenner &amp; Block offers a comprehensive benefits program, which includes medical, dental, and vision insurance, 401(k), and paid time off, in addition to other offerings.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3993900192"}