{"jobTitle": "Warehouse Operations Manager", "company": {"name": "Infinite Commerce", "location": "Rancho Cucamonga, CA"}, "location": "Rancho Cucamonga, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "USD $83,000-$100,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Online and Mail Order Retail", "description": "Infinite Commerce is a leading provider of consumer products for online marketplaces - including Amazon, Target, Walmart, Michaels, Kohl’s, and others. Driven by a passion for excellence, a love for what we do, and a mission to “bring joy to families everywhere by developing quality products and brands,” we offer a diverse portfolio of products that transform houses to homes, make life easier, and celebrate the big and little moments in life.<br/><br/>Our data-driven approach and next gen tools allows us to continually expand and refresh our catalog while setting us apart from our competitors.<br/><br/>Our commitment to excellence is reflected in our core values of Ownership, Frugality, Curiosity, Flexibility, Mutual Respect, and Outcomes. With a diverse team spanning twenty plus countries, our culture fosters openness and collaboration, making Infinite Commerce an exceptional place to work and grow.<br/><br/>The Operations Manager oversees the daily operations of the business unit to ensure efficient and effective business processes. This role involves managing staff, optimizing operational procedures, ensuring high levels of organizational performance, and implementing strategic initiatives to improve productivity and profitability. This is a full-time salaried role.<br/><br/>Shift Information<br/><br/>Candidates should be open to both first and 2nd shifts (rotating every few months), 50 hours per week on average.<br/><br/>1st Shift - 6am-3pm<br/><br/>2nd Shift - 3pm-11pm<br/><br/>Responsibilities<br/><br/>Operational Oversight: <br/><br/><ul><li>Oversee daily operations across various departments to ensure smooth and efficient business processes. </li><li>Develop, implement, and monitor operational policies and procedures. </li><li>Manage all aspects of inventory control. Maintain inventory management systems, oversee all aspects of inventory control, and conduct regular inventory audits.</li><li>Ensure compliance with industry regulations and internal policies<br/><br/></li></ul>Staff Management<br/><br/><ul><li>Lead, manage, and motivate a team of operational team members over one shift. </li><li>Conduct performance reviews and provide ongoing feedback and development opportunities</li><li>Foster a positive and productive work environment<br/><br/></li></ul>Process Improvement<br/><br/><ul><li>Identify areas for process improvement and implement changes to enhance efficiency and effectiveness. </li><li>Utilize data and analytics to monitor performance metrics and identify trends. </li><li>Lead continuous improvement initiatives and projects.<br/><br/></li></ul>Customer Service<br/><br/><ul><li>Ensure high levels of customer satisfaction by maintaining service quality standards. </li><li>Address and resolve operational issues that impact customer service. </li><li>Liaise with customer service teams to ensure effective communication and problem resolution. <br/><br/></li></ul>Compliance And Risk Management<br/><br/><ul><li>Ensure compliance with health and food safety regulations. </li><li>Identify potential risks and develop mitigation strategies. </li><li>Ensure all manufacturing equipment and tools are in safe operating condition, addressing and correcting issues promptly. </li><li>Conduct regular audits and assessments to ensure operational integrity. <br/><br/></li></ul>Qualifications<br/><br/><ul><li>Proven experience in an operations management role. </li><li>Strong leadership and team management skills. </li><li>Excellent organizational and problem-solving abilities. </li><li>Proficiency in operational management software and Microsoft Office Suite. </li><li>Strong analytical skills and the ability to interpret data and metrics. </li><li>Effective communication and interpersonal skills. </li><li>Ability to work in a fast-paced environment and handle multiple priorities. </li><li>Knowledge of industry-specific regulations and standards. </li><li>HACCP certified. PCQI certification is a plus. <br/><br/></li></ul>SALARY<br/><br/>The salary range for this position in most U.S. metro markets is between USD $83,000-$100,000. Final salary will be based on a candidate’s experience, location, and market practices. Beyond base salary, you will be eligible for an annual incentive program, health and welfare benefits, and comprehensive time off programs, including vacation, sick leave, and floating holidays, and other perks. We aim to offer a competitive and attractive compensation<br/><br/>DISCLAIMER<br/><br/>This position description is not designed to cover or contain a comprehensive or exhaustive listing of activities, duties, or responsibilities that are required of the employee for this position. Similarly, the listed activities, duties, or responsibilities may change at any time with or without notice. Employees are expected to regularly review their position descriptions and ensure that they are executing the essential functions at a level that meets or exceeds the expected performance outcomes.<br/><br/>NOTICE TO US APPLICANTS<br/><br/>The above statements are intended to describe the general nature of the environment and level of work being performed by this job. This job posting and the associated job description in no way states or implies that the duties and responsibilities listed herein are the only tasks to be performed by the incumbent employee in this job. Additionally, the benefits and perks outlined are provided at the sole discretion of Juvo Plus, Inc., and are subject to change with or without notice, unless otherwise provided or protected by law.<br/><br/>EQUAL EMPLOYMENT OPPORTUNITY &amp; DIVERSITY AT INFINITE COMMERCE<br/><br/>We are proud to be an Equal Opportunity employer. We consider all qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law. We are committed to creating a diverse and inclusive workplace and encourages applicants from all walks of life to apply. Applicants requiring assistance or an accommodation in the hiring process due to a disability may contact the Infinite Commerce People &amp; Culture Team at HR@infinitecommerce.com for assistance. Please note that we do not respond to or provide applicant status updates via this email address. For a copy of our Workforce Privacy Policy, please click here.<br/><br/>Principals Only; No Agencies!<br/><br/>#InfiniteCommerce #InfiniteCommerceCareers #InfiniteOpportunities #RetailScience", "responsibilities": "The Operations Manager oversees the daily operations of the business unit to ensure efficient and effective business processes. This role involves managing staff, optimizing operational procedures, ensuring high levels of organizational performance, and implementing strategic initiatives to improve productivity and profitability. This is a full-time salaried role.<br/><br/>Shift Information<br/><br/>Candidates should be open to both first and 2nd shifts (rotating every few months), 50 hours per week on average.<br/><br/>1st Shift - 6am-3pm<br/><br/>2nd Shift - 3pm-11pm<br/><br/>Responsibilities<br/><br/>Operational Oversight: <br/><br/><ul><li>Oversee daily operations across various departments to ensure smooth and efficient business processes. </li><li>Develop, implement, and monitor operational policies and procedures. </li><li>Manage all aspects of inventory control. Maintain inventory management systems, oversee all aspects of inventory control, and conduct regular inventory audits.</li><li>Ensure compliance with industry regulations and internal policies<br/><br/></li></ul>Staff Management<br/><br/><ul><li>Lead, manage, and motivate a team of operational team members over one shift. </li><li>Conduct performance reviews and provide ongoing feedback and development opportunities</li><li>Foster a positive and productive work environment<br/><br/></li></ul>Process Improvement<br/><br/><ul><li>Identify areas for process improvement and implement changes to enhance efficiency and effectiveness. </li><li>Utilize data and analytics to monitor performance metrics and identify trends. </li><li>Lead continuous improvement initiatives and projects.<br/><br/></li></ul>Customer Service<br/><br/><ul><li>Ensure high levels of customer satisfaction by maintaining service quality standards. </li><li>Address and resolve operational issues that impact customer service. </li><li>Liaise with customer service teams to ensure effective communication and problem resolution. <br/><br/></li></ul>Compliance And Risk Management<br/><br/><ul><li>Ensure compliance with health and food safety regulations. </li><li>Identify potential risks and develop mitigation strategies. </li><li>Ensure all manufacturing equipment and tools are in safe operating condition, addressing and correcting issues promptly. </li><li>Conduct regular audits and assessments to ensure operational integrity. <br/><br/></li></ul>", "qualifications": {"required": "Proven experience in an operations management role. Strong leadership and team management skills. Excellent organizational and problem-solving abilities. Proficiency in operational management software and Microsoft Office Suite. Strong analytical skills and the ability to interpret data and metrics. Effective communication and interpersonal skills. Ability to work in a fast-paced environment and handle multiple priorities. Knowledge of industry-specific regulations and standards. HACCP certified. PCQI certification is a plus. ", "preferred": ""}, "skills": ["Inventory Management", "Operational Management", "Microsoft Office Suite", "Data Analysis", "Leadership", "Team Management", "Problem Solving", "HACCP", "PCQI"], "postedDate": "2 days ago", "applicationDeadline": "", "benefits": "Beyond base salary, you will be eligible for an annual incentive program, health and welfare benefits, and comprehensive time off programs, including vacation, sick leave, and floating holidays, and other perks. We aim to offer a competitive and attractive compensation", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993675189"}