{"jobTitle": "Senior Merchandise Planner", "company": {"name": "MeUndies", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$98,000.00 - $128,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail Apparel and Fashion", "description": "MeUndies is a Los Angeles, CA-based underwear and loungewear company best known for its softer-than-soft basics. Founded in 2011, MeUndies disrupted the $110B underwear industry with the first online underwear subscription. Since then, the brand has inspired a passionate community of undie-obsessed individuals with its bold, comfortable products. And that’s only the beginning…<br/><br/>Today MeUndies has sold more than thirty million pairs of underwear and is profitable with double-digit YoY growth. It continues to redefine the subscription market by evolving the transactional subscription to a membership centered on community and relationships with the brand.<br/><br/>The innovative direct-to-consumer brand offers multiple purchasing options, including singles, packs, matching pairs, and monthly membership.<br/><br/><strong>Please note that this is a hybrid position of 4 days/week in our Los Angeles office<br/><br/></strong>With a growing company comes a growing team full of innovative people. We’re looking for a Senior Merchandise Planner to help achieve the company’s overall inventory management objectives and financial results by ensuring that the right amount of the right product is available at the right time.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Develop, maintain, and re-forecast monthly sales plans for assigned categories, aligning with Financial guidance and budgets.</li><li>Manage OTB, ensuring optimal inventory levels that support demand and company budget while minimizing potential inventory risk via scenario plans.</li><li>Drive end-to-end quarterly Buy Review for assigned categories and present to the Executive team for alignment. </li><li>Own PO writing process on the style/color/size level, and work with Production to ensure timely issuance and receipt of PO’s.</li><li>Provide accurate quarterly projections to the Production team, ensuring ample factory capacity. </li><li>Compile and analyze weekly / quarterly reporting as assigned, and communicate notable and actionable insights to the broader team, as well as opportunities &amp; current risks. </li><li>Partner with Planning and Merchandising Teams to refine quarterly assortments and develop effective buy strategies accordingly. Provide historical data and analysis to enable informed decision-making. </li><li>Devise and present revenue / unit projections for potential new product launches, both from a top-down and bottom-up approach. </li><li>Support promotional strategies by suggesting featured product and compiling SKU lists to maximize performance and sell through of target products. </li><li>Work cross-functionally with Merchandising &amp; Site Merchandising teams to ensure optimal customer experience. </li><li>Identify and monitor aged / slow moving inventory to communicate at risk product to broader team &amp; devise markdown / exit strategies accordingly. </li><li>Partner with Ops / Fulfillment teams as needed to support efficient use of Warehouse space. <br/><br/></li></ul><strong>What You Have<br/><br/></strong><ul><li>LA-based candidates only (or ability to relocate), as this position is a hybrid role requiring 4-days a week in the office</li><li>Bachelor’s degree </li><li>5+ years experience in apparel planning, merchandising, or buying </li><li>Strong strategic thinking &amp; analytical skills </li><li>Strong retail math knowledge </li><li>High proficiency with Excel; Netsuite, Tableau and/or Toolio experience a plus</li><li>An analytical and results-driven mindset with a track record of success at identifying and leveraging business opportunities </li><li>Ability to demonstrate a strong point-of-view about product assortment and business opportunities / risks </li><li>An eye for detail and self-motivated with the ability to multitask </li><li>Exceptional collaboration skills - you enjoy working in a team setting </li><li>Excellent communication and presentation skills </li><li>Ability to maintain strong cross-functional partnerships and foster a team environment </li><li>Checking off some but not all the boxes?! NO worries, we would still love to hear from you!<br/><br/></li></ul><em>The base salary range for this full-time position is $98,000 -$128,000. Within this range, individual pay is determined by various factors, including job-related skills, experience, and relevant education or training. Please note that the base salary range provided in this posting does not include any bonus, equity, or benefits you may be eligible for.<br/><br/></em><strong>WHY WORK AT MEUNDIES?<br/><br/></strong><strong>It's more than a job.<br/><br/></strong>We have focused on building a team of people who emulate our core values. We look for people who stay balanced, go further, build relationships, champion differences, and are humble. At MeUndies, we continue to maintain a stellar brand by working collaboratively and encouraging growth with learning opportunities. There is no such thing as a small achievement here - we celebrate it all!<br/><br/><strong>We look at the necessities.<br/><br/></strong>We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more.<br/><br/><strong>We have an office you’ll enjoy going to.<br/><br/></strong>We work in our office Monday - Thursday. Friday is a remote/work-from-home day. We’re set up to support comfortable working - hot desks, lounge, and casual seating areas, a Mother’s Room, an on-site gym &amp; shower, and a kitchen that makes you feel like you’ve never left home. We’re dog-friendly, so your furry coworker can join you anytime.<br/><br/><strong>We don’t forget the most important things.<br/><br/></strong>We want MeUndies to be a place where you feel safe and comfortable, and we encourage our employees to hold us accountable for keeping it that way. We encourage open communication and a People Ops team that is ready to help. When you work at MeUndies, we take your needs as an employee (and a person) seriously. Our doors are always welcome to feedback and suggestions!<br/><br/><strong>Plus those special extra things.<br/><br/></strong>We also know how important it is to connect with your team members outside of everyday work. We offer catered lunches every in-office day, holiday parties, off-sites, happy hours, and an annual retreat. You’ll also get a sweet employee discount to rebuild your underwear drawer with our top-notch prints.<br/><br/><em>MeUndies is an equal opportunity employer and is committed to providing a workplace and hiring process free from discrimination. All employment decisions will be made, and all qualified applicants will be considered, without regard to age, race, creed, color, religion, sex (including gender, pregnancy, sexual orientation, and gender identity), ethnicity, national origin, ancestry, disability status, veteran status, genetic information, marital status, citizenship status or other legally protected characteristic protected by federal, state, or local law. In addition, MeUndies will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.</em>", "responsibilities": "<ul><li>Develop, maintain, and re-forecast monthly sales plans for assigned categories, aligning with Financial guidance and budgets.</li><li>Manage OTB, ensuring optimal inventory levels that support demand and company budget while minimizing potential inventory risk via scenario plans.</li><li>Drive end-to-end quarterly Buy Review for assigned categories and present to the Executive team for alignment. </li><li>Own PO writing process on the style/color/size level, and work with Production to ensure timely issuance and receipt of PO’s.</li><li>Provide accurate quarterly projections to the Production team, ensuring ample factory capacity. </li><li>Compile and analyze weekly / quarterly reporting as assigned, and communicate notable and actionable insights to the broader team, as well as opportunities &amp; current risks. </li><li>Partner with Planning and Merchandising Teams to refine quarterly assortments and develop effective buy strategies accordingly. Provide historical data and analysis to enable informed decision-making. </li><li>Devise and present revenue / unit projections for potential new product launches, both from a top-down and bottom-up approach. </li><li>Support promotional strategies by suggesting featured product and compiling SKU lists to maximize performance and sell through of target products. </li><li>Work cross-functionally with Merchandising &amp; Site Merchandising teams to ensure optimal customer experience. </li><li>Identify and monitor aged / slow moving inventory to communicate at risk product to broader team &amp; devise markdown / exit strategies accordingly. </li><li>Partner with Ops / Fulfillment teams as needed to support efficient use of Warehouse space. <br/><br/></li></ul>", "qualifications": {"required": "LA-based candidates only (or ability to relocate), as this position is a hybrid role requiring 4-days a week in the office\nBachelor’s degree \n5+ years experience in apparel planning, merchandising, or buying \nStrong strategic thinking &amp; analytical skills \nStrong retail math knowledge \nHigh proficiency with Excel; Netsuite, Tableau and/or Toolio experience a plus\nAn analytical and results-driven mindset with a track record of success at identifying and leveraging business opportunities \nAbility to demonstrate a strong point-of-view about product assortment and business opportunities / risks \nAn eye for detail and self-motivated with the ability to multitask \nExceptional collaboration skills - you enjoy working in a team setting \nExcellent communication and presentation skills \nAbility to maintain strong cross-functional partnerships and foster a team environment \nChecking off some but not all the boxes?! NO worries, we would still love to hear from you!<br/><br/>", "preferred": ""}, "skills": ["Excel", "Netsuite", "Tableau", "Toolio", "Strategic Thinking", "Analytical Skills", "Retail Math", "Product Assortment", "Collaboration", "Communication", "Presentation Skills"], "postedDate": "2 weeks ago", "benefits": "We offer competitive equity/salary packages, including targeted annual bonuses, generous parental leave, a 401k, fantastic health benefits, open time off, and more.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993233925"}