{"jobTitle": "Assistant Buyer", "company": {"name": "Shoppe Amber Interiors", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Retail", "description": "JOB TITLE: ASSISTANT BUYER<br/><br/>LOCATION: Calabasas / Chatsworth<br/><br/>SUPERVISOR: Buyer<br/><br/>About Us:<br/><br/>Shoppe Amber Interiors is a home and lifestyle store created by lifelong Californian, interior designer Amber Lewis and her partner, Mike. Our mission is to inspire and elevate everyday living through our passion for design and our community.<br/><br/>DESCRIPTION:<br/><br/>Shoppe Amber Interiors is seeking an Assistant Buyer to join our team in Calabasas, CA. This position is responsible for the development and execution of merchandising strategies including product assortments, vendor relationships, pricing negotiations, and inventory turnover to drive revenue growth and achieve margin goals. The ideal candidate is ambitious in nature, manages priorities, comfortable working in cross-functional teams, organized, and passionate about the brand and the industry.<br/><br/>ASSISTANT BUYER RESPONSIBILITIES:<br/><br/><ul><li>Responsible for managing and updating internal systems in regard to product information (i.e. sku creation, product cost, pricing, backorder dates, availability status, etc) </li><li>Purchase order management including vendor set up, creation, revisions, maintenance, cancellations, and tracking. Also responsible for researching and resolving discrepancies between Purchase Orders and Vendor Invoices </li><li>Communicate with fulfillment team on PO receiving, vendor quality issues, and seasonal launches</li><li>Follow up with vendors to ensure timely delivery of products; Responsible to maintain planned receipt flow and communicating any issues that arise. </li><li>Manage samples: Responsible for all samples management, product photography lead sheets for e-commerce photo-shoots &amp; for samples to be delivered. </li><li>Track logistics of merchandise and independently troubleshoot shipping problems. </li><li>Manage incoming and outgoing vendor communications in a timely manner. </li><li>Maintain vendor database, contact list, and related department records. </li><li>Complete data entry for day-to-day product management. </li><li>Establish positive vendor relationships to obtain the best pricing and terms </li><li>Support buying team review and validation of images to be displayed on our digital platforms. </li><li>Drive continuous process improvement through ongoing identification &amp; resolution of photography planning challenges &amp; opportunities, with internal and external partners. </li><li>Maintain awareness of competition relative to product value relationship and customer profitability within category</li><li>Manage e-com assets, responsible for ensuring product is online at correct price, merchandised correctly, and copy is correct. </li><li>Understand the different roles of the cross-functional team and how they relate to the Merchandising role, and foster relationships to efficiently drive collaborations (Product Knowledge (PK) to share w/ cross functions). <br/><br/></li></ul>ASSISTANT BUYER QUALIFICATIONS:<br/><br/><ul><li>Bachelor’s degree or equivalent work experience</li><li>1-2 years in a Retail Buying or Merchandising role<br/><br/></li></ul>ASSISTANT BUYER SKILLS:<br/><br/><ul><li>Strong understanding and experience using Excel. Very familiar with Excel. </li><li>Proven ability to achieve results in a fast-paced, dynamic environment </li><li>Excellent written and verbal communication skills </li><li>Must be able to think strategically as well as manage the day-to-day responsibilities</li><li>Sense of urgency, flexibility, ability to multitask</li><li>Open-minded and positive attitude with the ability to partner cross-functionally and grow relationships</li><li>Must possess strong business acumen, and the ability to quickly assess a new environment and develop solutions the support the business strategy and critical objectives</li><li>Must be creative with a strategic mindset along with the ability to turn concepts into action </li><li>Organizational and time management skills; must have an ability to manage deadlines </li><li>Flexible and adaptive to changing priorities </li><li>Self-motivated with critical attention to detail and deadlines </li><li>NetSuite experience is a plus<br/><br/></li></ul>ASSISTANT BUYER BENEFITS:<br/><br/><ul><li>Medical and ancillary coverage<br/><br/></li></ul>PPO &amp; HMO Medical Options Available<br/><br/><ul><li> 401K with company match (After 1 year of employment)</li><li> PTO, Sick Time, Wellness Time, and Paid Volunteer Time</li><li>Paid Holidays Off</li><li>Paid Maternity/Paternity Leave</li><li>40% off at Shoppe Amber Interiors (online &amp; retail)</li><li> Company events (Warehouse Sales, Holiday Party)</li><li>Voluntary employee benefits</li><li>Some benefits are contingent upon full time employment. </li><li>Exact salary contingent upon experience</li></ul>", "responsibilities": "Responsible for managing and updating internal systems in regard to product information (i.e. sku creation, product cost, pricing, backorder dates, availability status, etc) Purchase order management including vendor set up, creation, revisions, maintenance, cancellations, and tracking. Also responsible for researching and resolving discrepancies between Purchase Orders and Vendor Invoices Communicate with fulfillment team on PO receiving, vendor quality issues, and seasonal launches Follow up with vendors to ensure timely delivery of products; Responsible to maintain planned receipt flow and communicating any issues that arise. Manage samples: Responsible for all samples management, product photography lead sheets for e-commerce photo-shoots &amp; for samples to be delivered. Track logistics of merchandise and independently troubleshoot shipping problems. Manage incoming and outgoing vendor communications in a timely manner. Maintain vendor database, contact list, and related department records. Complete data entry for day-to-day product management. Establish positive vendor relationships to obtain the best pricing and terms Support buying team review and validation of images to be displayed on our digital platforms. Drive continuous process improvement through ongoing identification &amp; resolution of photography planning challenges &amp; opportunities, with internal and external partners. Maintain awareness of competition relative to product value relationship and customer profitability within category Manage e-com assets, responsible for ensuring product is online at correct price, merchandised correctly, and copy is correct. Understand the different roles of the cross-functional team and how they relate to the Merchandising role, and foster relationships to efficiently drive collaborations (Product Knowledge (PK) to share w/ cross functions).", "qualifications": {"required": "Strong understanding and experience using Excel. Very familiar with Excel. Proven ability to achieve results in a fast-paced, dynamic environment Excellent written and verbal communication skills Must be able to think strategically as well as manage the day-to-day responsibilities Sense of urgency, flexibility, ability to multitask Open-minded and positive attitude with the ability to partner cross-functionally and grow relationships Must possess strong business acumen, and the ability to quickly assess a new environment and develop solutions the support the business strategy and critical objectives Must be creative with a strategic mindset along with the ability to turn concepts into action Organizational and time management skills; must have an ability to manage deadlines Flexible and adaptive to changing priorities Self-motivated with critical attention to detail and deadlines NetSuite experience is a plus", "preferred": "Bachelor’s degree or equivalent work experience 1-2 years in a Retail Buying or Merchandising role"}, "skills": ["Excel", "Communication", "Business Acumen", "Strategic Thinking", "Time Management"], "postedDate": "2 weeks ago", "benefits": "Medical and ancillary coverage PPO &amp; HMO Medical Options Available 401K with company match (After 1 year of employment) PTO, Sick Time, Wellness Time, and Paid Volunteer Time Paid Holidays Off Paid Maternity/Paternity Leave 40% off at Shoppe Amber Interiors (online &amp; retail) Company events (Warehouse Sales, Holiday Party) Voluntary employee benefits Some benefits are contingent upon full time employment. Exact salary contingent upon experience", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993465722"}