{"jobTitle": "Sr. Buyer", "company": {"name": "Virgin Galactic", "location": "Tustin, CA"}, "location": "Tustin, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "79,300.00–$121,000.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "As a Sr. Buyer, you will be responsible for coordinating activities involved with procuring, tracking, and expediting goods and services such as raw materials, equipment, tools, parts and supplies at a competitive price, delivery, and quality via the issuance of a purchase order The Senior Buyer identifies varied sources of commodities and services, assists Commodity Managers with evaluating bids for RFPs, establishes purchase orders, maintains contact with vendors, and maintains comprehensive descriptions of available products and current prices. The Sr. Buyer expedites the ordering and delivery process for commodities or services and assures invoice payment by monitoring the process from initiation of a purchase order through the receipt of the goods or services and billing from the vendor or supplier.<br/><br/>The Sr. Buyer may be required to train and assist Buyers on the procurement processes including ERP/MRP systems and provide guidance related to the supply chain policy. He/She should be capable of working independently with minimal supervision and should have at least 5 + years of purchasing experience.<br/><br/>This person is required to work from our Tustin CA office 3x per week.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Track and manage purchase orders from award of procurement to receipt, including Aircraft On Ground (AOG) and expedited requests</li><li>Work with accounting to reconcile vendor accounts and invoices, ensuring there is a 3-way or 2-way match</li><li>Issue purchase orders in accordance with contracts or agreements</li><li>Develop and maintain relationships with assigned vendors and suppliers</li><li>Manages and reports to Supervisor for metrics including on-time delivery, quality ratings, purchase price variances. </li><li>Research and analyze buying trends, markets, styles, and products, and assessing the financial risks of purchases</li><li>Track and analyze data to identify trends and recommend purchasing strategies</li><li>Maintain records in accordance with established policies, procedures, and audit guidelines</li><li>Ensure company and supplier compliance to Non-Disclosure Agreements, Export Compliance, and Contracts<br/><br/></li></ul><strong>Required Skills And Experience<br/><br/></strong><ul><li>Knowledge of the industry and aerospace manufacturing</li><li>Minimum 5 years procurement experience in a dynamic environment. </li><li>Minimum of a Bachelor’s degree from an accredited institution or a combination of education and work experience, preference given to supply chain or business degrees</li><li>Energetic, passionate and organized team member ready to support complex factory and operational procurement activities</li><li>Able to manage multiple tasks simultaneously and thrive in a complex product development environment with multiple priorities as well as a disciplined production setting</li><li>Experience with IMP/IMS, risk management, configuration management, requirements management processes</li><li>Understanding of Product Lifecycle Management, Configuration Management, Configuration Control, ERP and MRP systems. </li><li>Excellent verbal and written communication, excellent computer skills including Microsoft Word, Excel, Project and PowerPoint. </li><li>Strong analytical and problem-solving skills with a high attention to detail. </li><li>Team player with excellent organizational and interpersonal skills. </li><li>Experience with Oracle or ERP/MRP demand management systems</li><li>Working knowledge of global supply chain management issues and practices. </li><li>Strong ability to communicate effectively both verbally and in writing with various internal and external stakeholders. </li><li>Knowledge of negotiation practices/methodology for commodities. </li><li>Ability to handle multiple tasks while maintaining attention to detail and accuracy and working under tight time deadlines. </li><li>Ability, willingness to travel 25-30% depending on business needs and engage with suppliers<br/><br/></li></ul><strong>Preferred Skills And Experience<br/><br/></strong><ul><li>A general understanding of Aerospace drawings, specifications, and manufacturing processes</li><li>Six Sigma Certification</li><li>CPSM</li><li>PMP Certification<br/><br/></li></ul>The annual U.S. base salary range for this full-time position is $79,300.00–$121,000.00. The base pay actually offered will vary depending on job-related knowledge, skills, location, and experience and take into account internal equity. Other forms of pay (e.g., bonus or long term incentive) may be provided as part of the compensation package, in addition to a full range of medical, financial, and other benefits, dependent on the position offered. For more information regarding Virgin Galactic benefits, please visit https://vgcareers.virgingalactic.com/global/en/benefits<br/><br/><strong>Who We Are<br/><br/></strong><em>Virgin Galactic is transforming humanity’s relationship with space. By making it more open and accessible, we are connecting the world to the love, wonder and awe inspired by space travel, helping to create new opportunities for the benefit of life on Earth. Whether it’s supporting cutting-edge research missions for scientists and students, or offering life-changing experiences for the adventurers among us, Virgin Galactic is THE spaceline for Earth. Such an audacious vision requires a team as driven as they are curious - one capable of redefining the boundaries of what’s possible. <br/><br/></em>Export Requirements<br/><br/>To conform to U.S. Government export regulations, applicant must be a U.S. Person (either a U.S. citizen, a lawful permanent resident or a protected individual as defined 8 U.S.C. 1324b(a)(3) or be able to obtain the required authorization from either the U.S. Department of State or the U.S. Department of Commerce. The applicant must also not be included in the list of Specifically Designated Nationals and Blocked Persons maintained by the Office of Foreign Assets Control. See list <strong>here</strong>.<br/><br/>EEO Statement<br/><br/>Virgin Galactic is an Equal Opportunity Employer; employment with Virgin Galactic is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, gender identity, national origin/ethnicity, veteran status, disability status, age, sexual orientation, marital status, mental or physical disability or any other legally protected status.<br/><br/>DRUG FREE WORKPLACE<br/><br/>Virgin Galactic is committed to a Drug Free Workplace. All applicants post offer and active teammates are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies. This can include pre-employment, random, reasonable suspicion, and accident related drug and alcohol testing.<br/><br/><strong>Phoenix Employment Requirements<br/><br/></strong>For individuals seeking employment at our Phoenix Mesa Gateway Airport facility, employment is contingent upon you obtaining and maintaining a TSA authorized security badge. This includes initial and annual mandatory background checks that are governed by TSA, and conducted by the Phoenix Mesa Gateway Airport badging office.", "responsibilities": "Track and manage purchase orders from award of procurement to receipt, including Aircraft On Ground (AOG) and expedited requests\nWork with accounting to reconcile vendor accounts and invoices, ensuring there is a 3-way or 2-way match\nIssue purchase orders in accordance with contracts or agreements\nDevelop and maintain relationships with assigned vendors and suppliers\nManages and reports to Supervisor for metrics including on-time delivery, quality ratings, purchase price variances. \nResearch and analyze buying trends, markets, styles, and products, and assessing the financial risks of purchases\nTrack and analyze data to identify trends and recommend purchasing strategies\nMaintain records in accordance with established policies, procedures, and audit guidelines\nEnsure company and supplier compliance to Non-Disclosure Agreements, Export Compliance, and Contracts", "qualifications": {"required": "Knowledge of the industry and aerospace manufacturing\nMinimum 5 years procurement experience in a dynamic environment. \nMinimum of a Bachelor’s degree from an accredited institution or a combination of education and work experience, preference given to supply chain or business degrees\nEnergetic, passionate and organized team member ready to support complex factory and operational procurement activities\nAble to manage multiple tasks simultaneously and thrive in a complex product development environment with multiple priorities as well as a disciplined production setting\nExperience with IMP/IMS, risk management, configuration management, requirements management processes\nUnderstanding of Product Lifecycle Management, Configuration Management, Configuration Control, ERP and MRP systems. \nExcellent verbal and written communication, excellent computer skills including Microsoft Word, Excel, Project and PowerPoint. \nStrong analytical and problem-solving skills with a high attention to detail. \nTeam player with excellent organizational and interpersonal skills. \nExperience with Oracle or ERP/MRP demand management systems\nWorking knowledge of global supply chain management issues and practices. \nStrong ability to communicate effectively both verbally and in writing with various internal and external stakeholders. \nKnowledge of negotiation practices/methodology for commodities. \nAbility to handle multiple tasks while maintaining attention to detail and accuracy and working under tight time deadlines. \nAbility, willingness to travel 25-30% depending on business needs and engage with suppliers", "preferred": "A general understanding of Aerospace drawings, specifications, and manufacturing processes\nSix Sigma Certification\nCPSM\nPMP Certification"}, "skills": ["Aerospace", "Procurement", "Supply Chain", "ERP", "MRP", "Microsoft Word", "Excel", "Project", "PowerPoint", "Analytical Skills", "Problem Solving", "Communication", "Negotiation", "Oracle", "Six Sigma", "CPSM", "PMP"], "postedDate": "2 weeks ago", "benefits": "The annual U.S. base salary range for this full-time position is $79,300.00–$121,000.00. The base pay actually offered will vary depending on job-related knowledge, skills, location, and experience and take into account internal equity. Other forms of pay (e.g., bonus or long term incentive) may be provided as part of the compensation package, in addition to a full range of medical, financial, and other benefits, dependent on the position offered. For more information regarding Virgin Galactic benefits, please visit https://vgcareers.virgingalactic.com/global/en/benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994564114"}