{"jobTitle": "Administrative Assistant", "company": {"name": "First Legal", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 55,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative and Customer Service", "industry": "Legal Services", "description": "<strong><u>Position Summary:</u></strong>\n<p>The primary duties and responsibilities of the Administrative Assistant will be to perform complex administrative tasks, conduct database research, maintain the office current with all internal filing of documents, and provide general office support to the management team as directed.</p>\n<p><br/></p>\n<p><strong><u>Essential Duties and Responsibilities</u></strong><u>:</u></p>\n<ul><li>Process and scan all incoming mail through nQueue to legal assistants and/or paralegals, ensure time sensitive mail is scanned and forwarded to the handling attorney</li><li>Process of outgoing U.S. Mail, FedEx, and sending of messenger packages (as requested)</li><li>Download and save client files / documents into iManage (as requested)</li><li>Create file share links for attorneys / assistants for sending documents to experts</li><li>Receive and place calls and e-mails for client orders</li><li>Maintain postage machine, adding funds, reporting any issues, etc.</li><li>Kitchen duties (maintain cleanliness); run dishwasher and unload (as needed)</li><li>Order supplies for the office / kitchen / keep organized - Staples</li><li>Support office personnel with daily administrative tasks including scanning, faxes, and any other ad hoc assignments</li><li>Process invoices and log in checks (as requested)</li><li>Removal of closed case files – prepare and place in office storage and / or shred.</li><li>Trial assistance / trial binders (as needed)</li></ul>\n<p><br/></p>\n<p><strong><u>Job Qualifications</u></strong><u>:</u></p>\n<ul><li>High School Diploma or equivalent achievement is preferred with a minimum of 2 years professional experience in a fast-paced, legal services environment or equivalent combination of education and experience</li><li>Acute attention to detail in all work and ability to follow up with internal and external clients.</li><li>High level of computer competency, including the complete Microsoft Office Suite; proficiency in Outlook, Word, Excel, Kofax and iManage document file system</li><li>Must be a self-starter who is well organized and can handle multiple tasks with the ability to prioritize work</li><li>Ability to operate standard office equipment such as a computer, photocopier, postage machine, and scanner</li><li>Ability to work overtime as needed</li><li>Strong and effective communication skills, both verbal and written; presence, confidence, and communication skills to effectively represent the company</li><li>A commitment to excellence and to making a difference; results-driven, improvement-focused, and action-oriented self-starter who can handle various responsibilities simultaneously and proactively and continually look for a better way of doing things</li><li>Ability to effectively utilize conflict resolution skills and internal escalation protocols to mitigate client issues and concerns</li><li>Champion for excellent customer service while faced with adverse conditions in an entrepreneurial environment</li></ul>\n<p><br/></p>\n<p><strong><u>Schedule/Location:</u></strong></p>\n<ul><li>Full-Time - Monday-Friday 8:00-5:00pm</li><li><strong>In Office - Los Angeles, CA </strong></li><li>Life Medical, Dental, and Vision</li></ul>\n<p><br/></p>\n<p><strong><u>About First Legal:</u></strong></p>\n<p>We believe that diversity is integral to our success, and do not discriminate based on race, color, religion, age, or any other basis protected by law.</p>\n<p>First Legal is the first truly comprehensive File Thru Trial™ solutions firm. With over 17 offices across the United States, First Legal has been serving thousands of law firms and corporations for more than 30 years across our six divisions - Court &amp; Process, Depositions, Discovery, Records, Digital and Investigations. Our success comes through our company culture of innovation and trust, commitment to quality service, and depth of industry knowledge. Our mission is to be the most dependable and trusted business partner for our clients by serving every aspect of the litigation workflow. First Legal partners with our clients on a national basis to achieve the most efficient litigation solutions for the betterment of our clients.</p>", "responsibilities": "The primary duties and responsibilities of the Administrative Assistant will be to perform complex administrative tasks, conduct database research, maintain the office current with all internal filing of documents, and provide general office support to the management team as directed.", "qualifications": {"required": "High School Diploma or equivalent achievement is preferred with a minimum of 2 years professional experience in a fast-paced, legal services environment or equivalent combination of education and experience, Acute attention to detail in all work and ability to follow up with internal and external clients., High level of computer competency, including the complete Microsoft Office Suite; proficiency in Outlook, Word, Excel, Kofax and iManage document file system, Must be a self-starter who is well organized and can handle multiple tasks with the ability to prioritize work, Ability to operate standard office equipment such as a computer, photocopier, postage machine, and scanner, Ability to work overtime as needed, Strong and effective communication skills, both verbal and written; presence, confidence, and communication skills to effectively represent the company, A commitment to excellence and to making a difference; results-driven, improvement-focused, and action-oriented self-starter who can handle various responsibilities simultaneously and proactively and continually look for a better way of doing things, Ability to effectively utilize conflict resolution skills and internal escalation protocols to mitigate client issues and concerns, Champion for excellent customer service while faced with adverse conditions in an entrepreneurial environment"}, "skills": ["Microsoft Office", "Outlook", "Word", "Excel", "Kofax", "iManage", "Communication", "Customer Service"], "postedDate": "2 weeks ago", "benefits": "Life Medical, Dental, and Vision", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994339723"}