{"jobTitle": "Project Manager for Live Entertainment", "company": {"name": "Fever", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Software Development", "description": "Hi, we’re Fever<br/><br/>We’re excited you are checking out this job offer.<br/><br/>We are <em>the</em> leading global live-entertainment discovery tech platform with a clear mission: <strong>to democratize access to culture and entertainment. <br/><br/></strong>How do we achieve our mission? Fever has developed a proprietary technology that inspires a global community of over 125M people through personalized and curated experiences in their local city whilst empowering entertainment and event creators to reach new audiences and enhance their experience.<br/><br/>Sounds amazing, right?<br/><br/><strong>Who you'll work with<br/><br/></strong>You will join one of our offices around the world to work in teams and directly interact with our partners, providers, and venues.<br/><br/>In this role you will help Fever grow its pipeline of original events. To do so, you will interact with all departments of Fever, from Marketing to Operations.<br/><br/>The team you’re about to join consists of people that are motivated, young, and fun. On top of having multicultural backgrounds, people in the team are all top profiles: McKinsey, Amazon, Google, KKR, Cirque du Soleil, PSG, and Roland Garros.<br/><br/><strong>What you'll do<br/><br/>As a Project Manager, you will work with your team lead to develop, launch and manage your events, from A to Z. Together with the other departments, you will define the way to scale this event to all our other markets.<br/><br/>You will be responsible for owning the strategic planning, execution, and reporting for our key strategic experiences. <br/><br/><br/><br/></strong>When you join Fever, you are joining a company that will invest in your professional development. You will receive training and coaching on how to:<br/><br/><ul><li>Provide a detailed analysis of business opportunities and inefficiencies; proposing changes to operational processes; driving a high standard in customer satisfaction; ensuring high-quality experiences are delivered. </li><li>Work as part of a team, pitching and closing events for big partners (Big Entertainment companies)</li><li>Work with the Fever marketing team to make sure events make an impact: both in terms of ticket sales and coverage</li><li>Manage, report on, and grow revenue from events</li><li>Grow the experiences team in the against team targets</li><li>Help to scale our other cities through developing and sharing best practices (opportunity for travel)</li><li>Foster and grow the Fever Partner Network: including venues and event organizers</li><li>Communicate product needs (Fever usability) and process needs to HQ, work with product/engineering to deliver on them</li><li>Represent Fever at local events and with local PR<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/><br/><br/></strong><ul><li>3+ years in a project management role , consulting background or entertainment project management </li><li>Native English.</li><li>Huge appetite for learning and the ability to pick up new skills quickly. You will also have strong analytical, relationship management, and organizational skills.</li><li>You'll be solution-focused, identifying problem areas and then creating plans to find resolutions. </li><li>You'll have strong communication skills and a proven track record of building positive working relationships.</li><li>Highly organized and efficient</li><li>Curious and keen to push boundaries and try new concepts</li><li>Great networking skills and the ability to make smart partnerships happen</li><li>Able to communicate with events partners, brands, agencies, and talent on efforts</li><li>Ability to think strategically when faced with an events partnership brief or with our proprietary data on what events work</li><li>Able to handle large amounts of work and parallel work-streams</li><li>Collaborative and willing to get hands dirty and work on all required events tasks</li><li>Knowledge of promotional tools such as Facebook and Instagram is a plus</li><li>Strong academic background is a plus <br/><br/></li></ul>You can expect to join a group of diverse, hardworking team players, where a cultural fit is someone willing to stay humble and learn and can work nimbly. We welcome applications with unusual backgrounds with the expectation that the applicant will have acquired hard or soft skills and maturity throughout their experiences.<br/><br/><strong>What you'll get<br/><br/></strong><ul><li>Attractive compensation package and the potential to earn a significant bonus for top performance.</li><li>Opportunity to have a real impact in a high-growth global category leader</li><li>40% discount on all Fever events and experiences</li><li>Private health insurance</li><li>Gympass Memberships</li><li>Work in the heart of the city, with possible travel across our markets</li><li>Home office friendly</li><li>Responsibility from day one and professional and personal growth</li><li>Great work environment with a young, international team of talented people to work with! <br/><br/></li></ul><strong>Our hiring process<br/><br/></strong><ul><li>A 30 min video call with one of our Talent Acquisition Managers, to better understand your career plan, assess cultural fit and answer any questions you may have</li><li>A 60 min online test with three topics: logic, analytics and written understanding</li><li>A 45 min video call with your future manager, including questions about your profile and a business case presentation (to be prepared in advance)<br/><br/></li></ul>On average our process lasts 20 working days and offers usually follow within a week.<br/><br/>Thank you for considering joining Fever. We cannot wait to learn more about you!<br/><br/>If you want to learn more about us: Fever's Blog | Bloomberg | TechCrunch<br/><br/>Thank you for considering joining Fever. We cannot wait to learn more about you!<br/><br/>If you want to learn more about us: Fever's Blog | Tech.Eu |TechCrunch<br/><br/>Fever is committed to creating an inclusive and diverse workspace where everyone's background and ideas count. Our main goal is to find the best possible talent regardless of place of birth, racial or ethnic origin, gender, gender identity, religion, opinion, sexual orientation, disability, pregnancy, marital status, age or caring responsibilities. We encourage everyone to apply!<br/><br/>If you require any kind of accommodation during the selection process please contact our Talent team so we can help you by providing a welcoming and seamless journey.<br/><br/>If you want to know more about how Fever processes your personal data, click here Fever - Candidate Privacy Notice", "responsibilities": "As a Project Manager, you will work with your team lead to develop, launch and manage your events, from A to Z. Together with the other departments, you will define the way to scale this event to all our other markets.<br/><br/>You will be responsible for owning the strategic planning, execution, and reporting for our key strategic experiences. <br/><br/><br/><br/>", "qualifications": {"required": "3+ years in a project management role , consulting background or entertainment project management , Native English.", "preferred": "Huge appetite for learning and the ability to pick up new skills quickly. You will also have strong analytical, relationship management, and organizational skills.<br/>You'll be solution-focused, identifying problem areas and then creating plans to find resolutions. <br/>You'll have strong communication skills and a proven track record of building positive working relationships.<br/>Highly organized and efficient<br/>Curious and keen to push boundaries and try new concepts<br/>Great networking skills and the ability to make smart partnerships happen<br/>Able to communicate with events partners, brands, agencies, and talent on efforts<br/>Ability to think strategically when faced with an events partnership brief or with our proprietary data on what events work<br/>Able to handle large amounts of work and parallel work-streams<br/>Collaborative and willing to get hands dirty and work on all required events tasks<br/>Knowledge of promotional tools such as Facebook and Instagram is a plus<br/>Strong academic background is a plus <br/><br/>"}, "skills": ["Project Management", "Consulting", "Entertainment", "English", "Analytical Skills", "Relationship Management", "Organizational Skills", "Problem Solving", "Communication", "Networking", "Facebook", "Instagram"], "postedDate": "1 month ago", "benefits": "Attractive compensation package and the potential to earn a significant bonus for top performance.<br/>Opportunity to have a real impact in a high-growth global category leader<br/>40% discount on all Fever events and experiences<br/>Private health insurance<br/>Gympass Memberships<br/>Work in the heart of the city, with possible travel across our markets<br/>Home office friendly<br/>Responsibility from day one and professional and personal growth<br/>Great work environment with a young, international team of talented people to work with! <br/><br/>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994756764"}