{"jobTitle": "Strategic Account Executive, SaaS Sales (Remote)", "company": {"name": "Yelp", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Summary<br/><br/>Do you love to dine out? Are you passionate about helping restaurant owners succeed? Our mission at Yelp is to connect people with great local businesses, and that starts with people like you. Yelp Reservations and Yelp Waitlist are powerful tools that reach and engage diners with an unforgettable experience on the largest restaurant discovery platform in the world.<br/><br/>The Yelp Restaurants division is growing, and we’d love to have you join us. As a Strategic Account Executive, you will help lay the groundwork and foundation that will lead to the long-term success of this department. You’ll have the opportunity to run the full sales cycle, from prospecting to closing, and everything in between. At Yelp, you chart the course, and we’ll guide you there. As you progress in your career, you will unlock increased compensation, title, and responsibilities to keep you moving in the right direction.<br/><br/>Yelp is where you can be part of an empowering mission and build a rewarding career that grows with you. Yelp is powered by a global community of collaborative people with shared values. We’re tenacious individuals who believe in our mission to connect people to great local businesses. Yelp is a remote workplace where your work makes a difference, where you are seen as a whole person, and where you will grow with our support and guidance. If you’re looking for a career (not a job) with a company that is invested in you as a whole person, from personal development, compensation, training, and more, we know just the place.<br/><br/>What You'll Do<br/><br/>Manage your own book of business through prospecting &amp; disciplined pipeline management<br/>Drive the full sales cycle primarily through inside sales: make introductory calls, assess business goals through qualifying, and close the deal<br/>Become an expert in Yelp’s full suite of products: Yelp Reservations, Waitlist, Connect and Advertising, and understand the value proposition for each<br/>Be knowledgeable of other restaurant solutions available in the market that help restaurant owners grow their business<br/>Adapt product recommendations quickly to suit the client needs - asking probing questions and handling objections will be critical to your success<br/>Achieve and consistently exceed monthly sales goals<br/><br/>What It Takes To Succeed<br/><br/>Hold a Bachelor’s degree and/or 3 or more years of outbound sales experience selling SaaS solutions<br/>Have experience with restaurant technology (reservation systems, waitlist systems, front-of-house mgmt tools) is a plus<br/>Have excellent communication skills - no fear of the phone<br/>Have general computer and email proficiency, experience with Salesforce is a plus<br/>Have a positive attitude and a drive to win<br/>Have the ability to effectively prioritize tasks and manage time within a fast-paced environment<br/>Have an appetite for learning! You’re keen on turning training and feedback into action and continuous self-improvement<br/>Are committed to a high standard of integrity and work ethic<br/>An excellent listener, assertive, persistent, and persuasive - show us your grit!<br/>Genuinely curious about people, local restaurants, and possess the innate ability to inspire passion in others<br/>Adaptable and can think on your feet. When faced with new challenges, or tough conversations, failure simply isn't an option<br/><br/>What You'll Get<br/><br/>Effective your first day: Full medical, vision, and dental <br/>Mental health support and services via Modern Health<br/>15 days PTO (accrual begins on date of hire and increases with 2+ years of tenure thereafter), 12 paid holidays, plus one floating holiday<br/>Up to 14 weeks of parental leave<br/>Monthly wellness subsidy<br/>Flexible spending account<br/>401(k) retirement savings plan<br/>Employee stock purchase plan<br/>Professional development reimbursement<br/>Work from home reimbursement<br/>Compensation base salary is $65,000 annually + performance based incentives<br/>For more information about US benefits at Yelp, please check out this link<br/><br/>Closing<br/><br/>At Yelp, we believe that diversity is an expression of all the unique characteristics that make us human: race, age, sexual orientation, gender identity, religion, disability, and education — and those are just a few. We recognize that diverse backgrounds and perspectives strengthen our teams and our product. The foundation of our diversity efforts are closely tied to our core values, which include “Playing Well With Others” and “Authenticity.”<br/><br/>We’re proud to be an equal opportunity employer and consider qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition or disability.<br/><br/>Actual salary offered may vary based on multiple factors, including but not limited to, an individual's location and experience. <br/><br/>We will consider for employment qualified candidates with arrest and conviction records, consistent with applicable law (including, for example, the San Francisco Fair Chance Ordinance for roles based in San Francisco).<br/><br/>We are committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, you may contact us at accommodations-recruiting@yelp.com or 415-969-8488.<br/><br/>Note: Yelp does not accept agency resumes. Please do not forward resumes to any recruiting alias or employee. Yelp is not responsible for any fees related to unsolicited resumes.<br/><br/>California Privacy Notice<br/><br/>|<br/><br/>", "jobFunction": "Sales, Advertising, and Business Development", "industry": ["Software Development", "Technology", "Information and Internet", "Advertising Services"], "postedDate": "2 weeks ago", "benefits": "Effective your first day: Full medical, vision, and dental <br/>Mental health support and services via Modern Health<br/>15 days PTO (accrual begins on date of hire and increases with 2+ years of tenure thereafter), 12 paid holidays, plus one floating holiday<br/>Up to 14 weeks of parental leave<br/>Monthly wellness subsidy<br/>Flexible spending account<br/>401(k) retirement savings plan<br/>Employee stock purchase plan<br/>Professional development reimbursement<br/>Work from home reimbursement<br/>Compensation base salary is $65,000 annually + performance based incentives<br/>For more information about US benefits at Yelp, please check out this link<br/><br/>", "remoteWork": "Yes", "skills": ["Salesforce"], "url": "https://www.linkedin.com/jobs/view/3994512354"}