{"jobTitle": "Executive Assistant/Office Manager to Founder/Co-CEO at Series A Women's Health Startup", "company": {"name": "Bloom Talent", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Technology, Information and Internet and Health and Human Services", "description": " Series A women’s health startup is looking for an Executive Assistant/Office Manager to support one of their Co-CEOs. This is an exciting opportunity to join a mission-driven, close-knit team of 15. Manage busy calendars for the Executive by aligning priorities and anticipating needs, organizing and preparing for meetings, booking travel arrangements, and ad hoc tasks. You will also own office management by interfacing with vendors, stocking supplies and snacks, and assisting with team lunches, events, and activities. Previous experience as an Executive Assistant, ideally in a small team environment who is polished, has excellent attention to detail, and is flexible to adapt to changes. This is a hybrid role, Monday, Weds &amp; Thurs in-office based in Santa Monica. 100-120K + benefits, 401k, unlimited PTO, paid parking, and monthly team lunches!<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage busy calendars for the Executive. Keep a pulse on the daily schedules and priorities to resolve any conflicting meetings and make rearrangements as necessary.</li><li>Execute and follow up on delegated tasks, projects, and initiatives.</li><li>Prepare and organize meetings. Setting up conference rooms and video tech as needed. </li><li>Maintain positive relationships with external contacts on behalf of the Executives.</li><li>Prepare agendas and documents, and follow up on action items.</li><li>Coordinate and book travel as needed. </li><li>Assist with candidate tracking to organize notes and streamline the process.</li><li>Complete day-to-day errands such as grabbing lunch for Executives, sending out shipments, etc. </li><li>Coordinate logistics for team events or activities.</li><li>Own office operations. Maintain office supplies, snacks, and support team equipment needs. Help with new employee onboarding to ensure their first day is a success. </li><li>Manage gifting, product, and sample send-outs as needed. Organize incoming shipments and packages. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>2+ years of Executive Assistant or similar role, ideally in a startup environment.</li><li>Polished written and verbal communication is a must to be successful in this role.</li><li>Ability to take initiative, anticipate needs, and execute time-sensitive matters in a fast-paced environment.</li><li>Maniacal about detail and organization. Ability to juggle multiple tasks and priorities.</li><li>Highly execution-oriented, with good instincts for anticipating needs and changes.</li><li>Scrappy and resourceful. You are a self-starter and creative problem solver.</li><li>Flexible, agile, and can thrive with ambiguity.</li><li>Excellent verbal and written communication skills; comfortable communicating proactively and directly.</li><li>Tech-savvy. Basic technology skills with experience in GSuite &amp; Asana.</li><li>Experience or interest in women’s health space a plus! </li><li>Please Note: Your application will be considered for all open positions. You do not need to apply for multiple roles.</li></ul>", "postedDate": "1 week ago", "skills": ["GSuite", "Asana", "Executive Assistant", "Office Management", "Calendar Management", "Meeting Coordination", "Travel Arrangements", "Vendor Management", "Team Events", "Onboarding", "Communication", "Organization", "Problem Solving", "Detail Oriented", "Initiative", "Resourceful", "Tech-Savvy", "Women's Health"], "url": "https://www.linkedin.com/jobs/view/3994874983"}