{"jobTitle": "Data Analyst", "company": {"name": "DataAnnotation", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Not Applicable", "jobFunction": "Engineering, Research, and Analyst", "industry": "Software Development, Computer and Network Security, and Engineering Services", "description": "DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.\n\nWe are looking for a proficient Data Analyst to join our team to train our AI chatbots. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.\n\nTo apply to this role, you will need to be proficient in either Python and/or JavaScript. Your role will require proficiency in at least one programming language (JavaScript, Python, C#, C++, HTML, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.\n\nBenefits:\n\n* This is a full-time or part-time REMOTE position\n* You’ll be able to choose which projects you want to work on\n* You can work on your own schedule\n* Projects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume work\n\nResponsibilities:\n\n* Come up with diverse problems and solutions for a coding chatbot\n* Write high-quality answers and code snippets\n* Evaluate code quality produced by AI models for correctness and performance\n\nQualifications:\n\n* Fluency in English (native or bilingual level)\n* Proficient in either Python and/or JavaScript\n* Excellent writing and grammar skills\n* A bachelor's degree (completed or in progress)\n* Previous experience as a Software Developer, Coder, Software Engineer, or Programmer\n\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.", "postedDate": "1 week ago", "skills": ["Python", "JavaScript", "Coding", "AI", "Chatbots"], "url": "https://www.linkedin.com/jobs/view/3994349392"}