{"jobTitle": "Human Resources Director", "company": {"name": "CodeMax Medical Billing", "industry": "Medical Practices, Hospitals and Health Care, and Veterinary Services", "size": "200+ employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-Time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Medical Practices, Hospitals and Health Care, and Veterinary Services", "description": "Codemax Medical Billing is seeking a highly experienced and strategic Human Resources Director to lead our HR department. The HR Director will play a pivotal role in shaping the HR strategy, managing all aspects of human resources across multiple regions, and supporting a diverse workforce of in-office and remote employees. This role requires extensive experience in recruitment, HR operations, and developing standard operating procedures to foster a high-performance culture.", "responsibilities": "1. Strategic HR Leadership: Develop and implement HR strategies aligned with the company’s overall business objectives. Advise senior management on HR best practices, trends, and legal requirements. Lead and manage the HR department, ensuring it operates efficiently and effectively. 2. Recruitment and Talent Management: Collaborate with senior leadership to forecast staffing needs and develop comprehensive recruitment plans. Oversee the recruitment process, ensuring a diverse and highly qualified talent pool. Implement innovative sourcing strategies to attract top talent across multiple regions. 3. Performance Management and Development: Design and implement a robust performance management system to evaluate and enhance employee performance. Develop and manage training and development programs to support employee growth and organizational needs. Facilitate succession planning and leadership development initiatives. 4. Employee Relations and Culture: Serve as a trusted advisor and point of contact for employee concerns, disputes, and grievances. Promote a positive, inclusive, and engaging workplace culture. Lead conflict resolution and disciplinary processes in accordance with company policies. 5. Policy Development and Compliance: Oversee the development, implementation, and enforcement of HR policies and procedures. Ensure compliance with all federal, state, and local employment laws and regulations. Regularly review and update the employee handbook and other HR documentation. 6. HR Operations and Analytics: Manage HR operations, including employee records, HRIS, benefits administration, and payroll. Utilize HR analytics to inform decision-making and measure the effectiveness of HR initiatives. Continuously improve HR processes and systems for efficiency and effectiveness. 7. Expansion and Change Management: Support the company’s growth plans by leading HR initiatives for new office establishments, including the upcoming office in Florida. Manage change initiatives and ensure smooth transitions during organizational changes.", "qualifications": {"required": "Bachelor’s degree in Human Resources Management, Business Administration, or related field (Master’s preferred). Minimum of 10 years of progressive HR experience, with at least 5 years in a senior HR leadership role. Extensive experience in managing HR functions for companies with 200+ employees across multiple regions. Proven experience in recruitment, talent management, and developing HR departments. In-depth knowledge of HR laws, regulations, and best practices. Strong interpersonal, communication, and leadership skills. Excellent problem-solving and conflict resolution abilities. Ability to work independently, prioritize tasks, and meet deadlines. Flexibility to adapt to changing organizational needs. HR certification (e.g., SHRM-SCP, SPHR) is highly desirable.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3994566489"}