{"jobTitle": "Administrative Assistant, Creative", "company": {"name": "Sony Music Publishing", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "At Sony Music Publishing (“SMP”), we believe every voice matters. We are the #1 global music publisher, advancing the artistry of the world’s greatest songwriters and composers for over 25 years. We keep songwriters at the forefront of everything we do, and design our suite of services to amplify opportunities, build connections, and defend their rights. Our roster benefits from an international team committed to providing support at every career stage. From classic catalogues to contemporary hitmakers, history is always being written. We are a part of the Sony family of global companies. Learn more about SMP at https://www.sonymusicpub.com/en.<br/><br/>Why join Sony Music Group? <br/><br/>Here at Sony Music Group, we are shaping what’s next in a way that creates impact. Forging powerful new ideas at the heart of music, technology, and culture that entertain and move people.<br/><br/>This is your opportunity. Part of a global community, united by individual passion, rising to that challenge every day. Adapting at pace and supporting one another, inspired to influence the future. For the benefit of you, our people; our creators, our business, and wider society too.<br/><br/>Be a part of an organization that is creator first. Committed to fueling excellence and always imagining more, while fostering a supportive culture, one where we elevate each other and act responsibly.<br/><br/>Job Purpose: The Administrative Assistant will maximize effectiveness and efficiency of the Creative team by providing general administrative assistance and support to the Vice President, Creative A&amp;R and the Director, Creative A&amp;R. You will serve as the responsible party for the songwriter experience at the Sony Music Publishing office in Los Angeles. You will provide the highest possible level of customer service by supporting both the A&amp;R team and the songwriters, ensuring that the department meets all their needs.<br/><br/>What You’ll Do:<br/><br/>• Build a strong and cohesive partnership with other EAs and Creative Admins, both domestically and internationally in NY, LA, Miami, Nashville, and the UK<br/>• Generate, distribute, and maintain various reports as needed by the A&amp;R team including the casting list, pitch list, A&amp;R research documents and other important department documents. Take meticulous notes during meetings and distribute accordingly <br/>• Proactively anticipate needs of A&amp;R staff to foresee problems and prevent them by acting <br/>• Make recommendations related to schedules, communications, travel and systems <br/>• Own and proactively manage an ever-changing calendar of internal and external meetings with attention to accuracy, detail (including time zones) and allocation of time and resources to promote productivity and successful execution of the A&amp;R team (this includes managing all details - attendees, location, time, length and provide background information and agendas when needed) <br/>• Coordinate with travel agent to provide a seamless travel experience for complex and detailed travel plans and itineraries, including flights, hotel accommodations, car service and more in accordance with company policy and compile travel documents for expense reimbursement. <br/>• Handle travel for both executives and songwriter clients <br/>• Manage, process, and track expense reports in a timely fashion and in accordance with the SMP T&amp;E policy <br/>• Master the use of SMP internal systems such as SCORE, TEMPO and PITCH. Regularly upload new releases into the PITCH system <br/>• Liase with other departments within SMP such as Business Affairs, Sync, and Admin <br/>• Finger on the pulse of hip restaurants and venues in order to book restaurant reservations, private meetings, off-sites, celebratory events, industry events and more <br/>• Act as host of meetings, develop meeting agendas, etc <br/><br/>Who You Are:<br/><br/>• Alignment with Sony’s Purpose and Values <br/>• Ability to maintain confidentiality and discretion in all matters <br/>• Demonstrated ability to deliver consistently high-quality and professional customer service to both internal and external customers <br/>• Ability to work independently and without follow-up, while also being a team player who can build solid, collaborative relationships <br/>• Working knowledge of digital music space and social media <br/>• Proactively engage in managing the daily activities of the office, with a strong sense of urgency and the highest level of professionalism <br/>• Ability to work in a fast-paced environment <br/>• Highly organized person that pays very close attention to the details. <br/>• You are a clear, effective, and accurate communicator <br/>• You embrace, support, and inspire innovation through a creative and collaborative approach <br/>• Strategic Planner <br/><br/>What We Give You:<br/><br/>• You join an inclusive, collaborative, and global community where you can channel your passion every day.<br/>• A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best.<br/>• Investment in your professional growth and development enabling you to thrive in our vibrant community.<br/>• The space to accelerate progress, positively disrupt, and create what happens next.<br/>• We give you the platform to champion positive change, with the opportunity to contribute to our social impact, diversity, equity, and inclusion initiatives.<br/>• An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching.<br/>• Voluntary benefits like company-paid identity theft protection and resources for pets, mental health, and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans<br/>• Investment in your professional growth and development enabling you to thrive in our vibrant community.<br/>• Time off for a winter recess<br/><br/>DISCLAIMER:<br/><br/>The anticipated annual base salary for this position is $43,000-$46,000. This range does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. <br/><br/>Sony is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religious creed, sex (including pregnancy), gender, national origin, citizenship, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.<br/><br/>EEO is the Law<br/><br/>EEO is the Law Supplement<br/><br/>Right to Work (English/Spanish)<br/><br/>E-Verify Participation (English/Spanish)", "jobFunction": "Administrative", "industry": "Musicians", "postedDate": "2 weeks ago", "salary": {"amount": "43,000.00-46,000.00", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3994102712"}