{"jobTitle": "Patient Service Representative/Infusion Scheduler - Oncology, Laguna Hills", "company": {"name": "UCLA Health", "location": "Laguna Hills, CA"}, "location": "Laguna Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "In this role, you will be providing direct support to the physicians and patients for assigned primary and/or specialty care physicians. Major duties include but are not limited to: acting as a liaison for the patients and physicians in the practice, assisting patients in accessing service within the health system, facilitating communication with referring physicians, referring patients to appropriate resources and providing follow-up through telephone and EPIC/Care Connect.<br/><br/>Salary range: $29.42/hr - $42.14/hr<br/><br/><strong>Qualifications<br/><br/></strong>Required:<br/><br/><ul><li>Skill in setting priorities which accurately reflect the relative importance of job responsibilities</li><li>Ability to establish and maintain and productive working relationships with Faculty, Staff, Administration and patients from various social, cultural and economic backgrounds</li><li>Ability to creatively integrate competing demands into a productive working environment</li><li>Skill in verbal communications to clearly convey complex problems in both formal and informal situations</li><li>Ability to interact diplomatically and sympathetically with a patient population in varying degrees of health<br/><br/></li></ul><strong>Preferred<br/><br/></strong><ul><li>Knowledge of specific specialty practice and workflows</li><li>Working knowledge of patient related policies and procedures as well as a thorough understanding of the University system and it services and programs</li><li>Knowledge of hospital computer system, and personal computer systems and the various software products to perform administrative work</li><li>Familiarity and knowledge of authorization process &amp; managed care programs<br/><br/></li></ul>UCLA Health welcomes all individuals, without regard to race, sex, sexual orientation, gender identity, religion, national origin or disabilities, and we proudly look to each person’s unique achievements and experiences to further set us apart.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994540531"}