{"jobTitle": "Sales Account Manager", "company": {"name": "Uline", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00 - $95,000.00", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Marketing", "industry": "Wholesale", "description": "Long Beach, California<br/><br/><strong>Sales Account Manager<br/><br/></strong><strong>Pay from $75,000 to $95,000 per year<br/><br/></strong>Strong customer relationships built on trust - that’s the foundation of Uline’s sales culture! As a Sales Account Manager, build out your territory supported by the best training, tools and product offering to win in the field every day! Uline continues to grow, creating new career opportunities and job stability you can count on.<br/><br/>Account Managers can be based anywhere within your sales territory, with regular visits to your Uline Branch / Sales Office.<br/><br/><strong>Why Sales at Uline?<br/><br/></strong><ul><li> Success from the Start - You’ll get 4 weeks of training followed by a 12-week mentorship program along with weekly learning and strategy meetings with leadership. </li><li> “CEO” of Your Territory - Manage accounts in all industries with opportunities to travel to new markets. </li><li> Design Your Day - Spend assigned days in the office with your peers planning face-to-face customer visits. Structure your schedule with work-life balance in mind. <br/><br/></li></ul><strong>Position Responsibilities<br/><br/></strong><ul><li>Manage and grow existing accounts as well as bring in new business within your territory. </li><li>Provide effective business solutions at annual, on-site customer consultations, including recommendations from our catalog of over 40,000 quality products. </li><li>Deliver legendary customer service with the help of our sales support team. <br/><br/></li></ul><strong>Minimum Requirements<br/><br/></strong><ul><li>Bachelor’s degree. </li><li>Previous sales experience preferred, but our thorough training will support you to win every day! </li><li>Valid driver’s license and great driving record. </li><li>Excellent communication, problem-solving and presentation skills. <br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Complete insurance coverage that includes medical, dental, vision and more. </li><li>401(k) with 6% employer match. </li><li>Paid holidays and generous paid time off. </li><li>Bonus programs that include annual performance, profit sharing, sales goals, contests and top performer incentives. </li><li>Tuition assistance program that covers professional continuing education. </li><li>Monthly internet / cell phone allowance. </li><li>Car mileage reimbursement. </li><li>As our company expands, you’ll have the chance to transition to new markets, and we’ll provide support for your move. <br/><br/></li></ul><strong>About Uline<br/><br/></strong>Uline is North America's leading distributor of shipping, industrial and packaging materials. We're a family-owned company known for incredible service, quality products and same-day shipping of our huge in-stock inventory. With over 9,000 employees across 13 branch locations and 15 sales offices, it's time you joined Uline.<br/><br/>Uline is proud to operate as a drug-free workplace.<br/><br/>EEO/AA Employer/Vet/Disabled<br/><br/>(#IN-CASLS)<br/><br/>Our employees make the difference and we are committed to offering exceptional benefits and perks! Explore https://www.uline.jobs/#working-here_blankUline.jobs to learn more!<br/><br/>", "responsibilities": "Manage and grow existing accounts as well as bring in new business within your territory. Provide effective business solutions at annual, on-site customer consultations, including recommendations from our catalog of over 40,000 quality products. Deliver legendary customer service with the help of our sales support team.", "qualifications": {"required": "Bachelor’s degree. Previous sales experience preferred, but our thorough training will support you to win every day! Valid driver’s license and great driving record. Excellent communication, problem-solving and presentation skills.", "preferred": ""}, "skills": ["Sales", "Customer Service", "Business Development", "Account Management", "Training"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Complete insurance coverage that includes medical, dental, vision and more. 401(k) with 6% employer match. Paid holidays and generous paid time off. Bonus programs that include annual performance, profit sharing, sales goals, contests and top performer incentives. Tuition assistance program that covers professional continuing education. Monthly internet / cell phone allowance. Car mileage reimbursement. As our company expands, you’ll have the chance to transition to new markets, and we’ll provide support for your move.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994303526"}