{"jobTitle": "Product Manager", "company": {"name": "Meta", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$110,000.00/yr - $167,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet", "description": "Meta Product Managers work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for entrepreneurial Product Managers who value moving quickly.<br/><br/>Product Manager Responsibilities:<br/><br/><ul><li>Lead and drive products within the context of a broader product goals, strategy and roadmap.</li><li>Understand Meta’s strategic and competitive position and deliver products that are aligned with our mission and recognized best in the industry.</li><li>Lead and drive products within the context of a broader product goals, strategy and roadmap.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>3+ years product management or related industry experience</li><li>Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and two years of experience in the following:</li><li>Working in a technical environment with a broad, cross functional team to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones</li><li>Analyzing complex, large-scale data sets and making decisions based on data</li><li>Delivering technical presentations</li><li>Gathering requirements across diverse areas and users, and converting and developing them into a product solution</li><li>Technical experience with analytical tools, methodologies, and design</li><li>Displaying proven leadership, organizational and execution skills</li><li>Proven communication skills<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience driving projects with cross-functional colleagues.</li><li>Experience of going through a full product lifecycle, integrating customer feedback into product requirements, driving prioritization and pre/post-launch execution.</li><li>Enthusiastic and resilient in a constantly evolving environment where the process is fluid and creative solutions are the norm.<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$110,000/year to $167,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994143645"}