{"jobTitle": "Construction Manager, Amazon Industrial Grocery Team", "company": {"name": "Amazon", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other and Manufacturing", "industry": "Software Development", "description": "The Industrial Grocery team is looking for an experienced Senior Construction Manager that will be a key part of the Operations Team and will be responsible for project managing building planning, design, and construction. This will include the extension of existing facilities and new sites. The Construction Manager will play an integral role in the development and implementation of the Amazon Industrial Grocery network infrastructure. This position will analyze and evaluate different facility scenarios and build-out designs. In addition, the Construction Manager will support the standardization of the technical and facility related processes and systems.<br/><br/>This opportunity combines construction engineering, planning, project management, facilities management, and contract management.<br/><br/>Key job responsibilities<br/><br/><ul><li> Manage multiple projects and effectively influence, negotiate, and communicate with internal and external business partners, contractors and vendors.</li><li> Establish and maintain project schedules and budgets, responsible for overall project delivery including all FF&amp;E and construction.</li><li> Responsible for on-site supervision during the construction process to include management of General Contractors, and Owner vendors.</li><li> Deliver projects on time and on budget.</li><li> Participate in the design development process to collaborate and value engineer construction methods to reduce time and cost.</li><li> Manage change order negotiations and contract compliance.</li><li> Serve as the liaison to developer/landlord reps to coordinate building envelope delivery.</li><li> Manage and adhere to AIA contract documentation process.</li><li> Establish effective relationships along with an understanding of municipalities and permit processes.</li><li> Lead job site meetings, produce minutes and strive for a collaborative team environment.</li><li> Ensure contractor compliance of life safety/OSHA requirements are met on all job sites to minimize risk.<br/><br/></li></ul>A day in the life<br/><br/>Amazon is seeking a Senior Construction Manager who will manage construction and renovation / remodel projects across the country. This position will be part of an exciting, fast moving and growing business team. The right person for this job will be an entrepreneurial self-starter with dedication to seeing projects through to the end. You will have an eye for detail and determination to turn-over high-quality work. You will be an integral part of the team that works cross-functionally between Design, Pre-Construction, Operations, Facilities, Tech, Security, Loss Prevention, and Amazon vendors.<br/><br/>This position will closely manage General Contractors and Vendors throughout the process. Oversight of vendor performance is critical. This position involves direct contact with both internal and external stakeholders, and this candidate must have a professional demeanor and ability to communicate effectively with business partners at every level, including upper management.<br/><br/><strong>About The Team<br/><br/></strong>Our ideal candidate is detail-oriented, well respected in the industry and able to work back from our customer needs. This person is a self-starter, and a creative, critical thinker with an intense curiosity. You must be able to work independently in a collaborative, creative, ever-changing and ambiguous environment. The right person for this position will take ownership of their work, display a great deal of initiation, and possess sound judgment, a great business acumen and a sense of humor.<br/><br/><strong>Basic Qualifications<br/><br/></strong>BS in Engineering, Architecture or Construction Management related field.<br/><br/><strong>Preferred Qualifications<br/><br/></strong>Experience in design or construction of Food Production Facilities<br/><br/>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Pursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $69,700/year in our lowest geographic market up to $155,800/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2701433", "postedDate": "2 weeks ago", "qualifications": {"required": "BS in Engineering, Architecture or Construction Management related field.", "preferred": "Experience in design or construction of Food Production Facilities"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3994999684"}