{"jobTitle": "Chief of Staff to Entertainment/Tech Startup CEO", "company": {"name": "Pocketbook Agency", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management, Administrative, and Business Development", "industry": "Entertainment Providers and Technology, Information and Media", "description": "We are seeking a Chief of Staff who is savvy in tech, culture, and business to serve as a proxy, second brain, and right hand to the CEO of a tech/entertainment startup. You will support the execution of the CEO’s vision and strategic initiatives by facilitating information and workflows with and between product, revenue, and operations teams. This position will also partner with CEO’s Executive Assistant to ensure that the CEO’s operations are consistently optimized (e.g., preparing the CEO to conduct effective meetings, collating information for the CEO’s attention and follow-up, tracking executive team progress on tasks, etc.). A successful candidate will know when and how to make decisions and execute tasks on behalf of the CEO, how to anticipate or expeditiously mitigate issues, and when to escalate or seek guidance from the CEO or other executives.", "responsibilities": "Oversee the day-to-day operation of the Office of the CEO. Help set priorities and ensure that the flow of correspondence, ideas, and feedback within and across product, revenue, and operations teams is timely and effective.\nEnsure executive team and department leaders are clear on the CEO’s strategic vision for the business; help create, implement, and maintain frameworks (OKRs, KPIs, consistent messaging and terminology) that help people drive the business forward. \nOwn the preparation of effective CEO meetings and presentations, including gathering relevant documents and briefing materials, ensuring the right people are consulted and/or participating, and engaging with stakeholders in advance to identify priorities and decision points for the CEO.\nWork with COO in crafting high-stakes communications, and managing investor updates, presentations, and various other internal and external audiences on behalf of and in the voice of the CEO.\nCoordinate the preparation of Board meeting materials.\nIn partnership with the CEO’s Executive Assistant: \nHelp leverage the CEO’s time by following up on tasks, tracking progress, and reporting out on status through a standardized cadence and organized project management system.\nHelp optimize the CEO's schedule, using your knowledge of current priorities, internally and externally.\nHelp the CEO make better decisions through research, analysis, and scenario planning.\nDrive special projects and strategic initiatives for the CEO, including analyzing growth strategies and new business development opportunities for the company.\nAssume ownership of projects that do not have a clear home within the organization.\nDevelop and maintain a deep understanding of R&D’s product, clients, and internal business processes. Continuously test, develop use cases, and provide feedback and recommendations that will improve the product.\nSupport the CEO, CFO, COO, and other senior executives in the evaluation and execution of mergers &amp; acquisitions, investments, joint ventures, strategic partnerships, and divestitures. Offer findings and recommendations in the go/no-go decision-making process. Create business plans for new ventures, and work with the COO on integration plans. Continue to work with COO and executive team on ongoing optimization of new businesses and verticals", "qualifications": {"required": "Bachelor’s Degree required; MBA a plus.\nMinimum 5-7 years of related experience.\nMinimum 2 years experience in either product design or marketing in an organization that develops applications or software. \nExperience in corporate strategy, business development, or strategic planning. \nFamiliarity with talent management, media and entertainment, advertising, and/or creative agency work is highly preferred.\nAbility to understand and synthesize financial, operational, and KPI data into concise presentations and decision frameworks.\nWhatever your degree or experience, you should excel at solving problems that require logical reasoning, creative thinking, and good judgment.\nAbility to keep track of dozens of initiatives across the organization at once.\nProficiency in Figma and collaboration tools like Slack, Notion and Google Docs.", "preferred": "Familiarity with talent management, media and entertainment, advertising, and/or creative agency work is highly preferred."}, "skills": ["Figma", "Slack", "Notion", "Google Docs"], "postedDate": "1 week ago", "benefits": "Pay: up to $150K DOE + benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994379449"}