{"jobTitle": "Client Service Manager (Remote)", "company": {"name": "Gallagher", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Business Development and Sales", "industry": "Insurance", "description": "<strong>Introduction<br/><br/></strong>Discover a world of endless possibilities at Gallagher Benefit Services, where you'll have the power to shape the future of workplaces across industries. As a member of our team, you become the driving force behind positive change, helping clients build environments where employees thrive. Embrace the opportunity to impact lives, unlock potential, and create a legacy of remarkable transformation.<br/><br/>We believe that every candidate brings something special to the table, including you! So, even if you feel that you’re close but not an exact match, we encourage you to apply.<br/><br/><strong>How You'll Make An Impact<br/><br/></strong><ul><li>Account management as primary responsibility. </li><li>Works directly with employer group’s human resources and admin team to manage all employee benefits (medical, dental, vision, life and ad&amp;d, voluntary worksite, etc.). </li><li>Has retention goals for assigned group of accounts. </li><li>Responsible for the day-to-day account management for routine/moderately complex client accounts. </li><li>Manages an assigned book of business and builds, expands, and solidifies relationships with existing clients. </li><li>Secures existing business and drives the sale of additional services and coverage levels on employee benefits. </li><li>May coordinate the work of administrative support and customer service. </li><li>May provide support to an Account Executive and/or a Broker Producer. <br/><br/></li></ul><strong>About You<br/><br/></strong>Required: Bachelor's degree and 3 or more years client coordination and/or claims management experience, OR High School degree with 8 or more years client coordination and/or claims management experience. License required. Able and willing to travel approximately 25% of the time.<br/><br/>Preferred:Life, Health and Accident License required.<br/><br/>Behaviors: Excellent verbal and written communication skills. Able to quickly determine critical issues. Exhibit strong organizational and time management skills to meet all renewal deadlines. Able to work well collaboratively and autonomously when needed.<br/><br/><strong>Compensation And Benefits<br/><br/></strong>On top of a competitive salary, great teams and exciting career opportunities, we also offer a wide range of benefits.<br/><br/>Below are the <strong>minimum core benefits</strong> you’ll get, depending on your job level these benefits may improve:<br/><br/><ul><li>Medical/dental/vision plans, which start from day one!</li><li>Life and accident insurance</li><li>401(K) and Roth options</li><li>Tax-advantaged accounts (HSA, FSA)</li><li>Educational expense reimbursement</li><li>Paid parental leave<br/><br/></li></ul><strong>Other benefits include:<br/><br/></strong><ul><li>Digital mental health services (Talkspace)</li><li>Flexible work hours (availability varies by office and job function) </li><li>Training programs</li><li>Gallagher Thrive program – elevating your health through challenges, workshops and digital fitness programs for your overall wellbeing</li><li>Charitable matching gift program</li><li>And more... <br/><br/></li></ul><strong>We value inclusion and diversity<br/><br/></strong>Click Here to review our U.S. Eligibility Requirements<br/><br/>Inclusion and diversity (I&amp;D) is a core part of our business, and it’s embedded into the fabric of our organization. For more than 95 years, Gallagher has led with a commitment to sustainability and to support the communities where we live and work.<br/><br/>Gallagher embraces our employees’ diverse identities, experiences and talents, allowing us to better serve our clients and communities. We see inclusion as a conscious commitment and diversity as a vital strength. By embracing diversity in all its forms, we live out The Gallagher Way to its fullest.<br/><br/>Gallagher believes that all persons are entitled to equal employment opportunity and prohibits any form of discrimination by its managers, employees, vendors or customers based on race, color, religion, creed, gender (including pregnancy status), sexual orientation, gender identity (which includes transgender and other gender non-conforming individuals), gender expression, hair expression, marital status, parental status, age, national origin, ancestry, disability, medical condition, genetic information, veteran or military status, citizenship status, or any other characteristic protected (herein referred to as “protected characteristics”) by applicable federal, state, or local laws.<br/><br/>Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified person with a disability, unless the accommodation would impose an undue hardship on the operation of our business.<br/><br/>", "responsibilities": "Account management as primary responsibility. \nWorks directly with employer group’s human resources and admin team to manage all employee benefits (medical, dental, vision, life and ad&d, voluntary worksite, etc.). \nHas retention goals for assigned group of accounts. \nResponsible for the day-to-day account management for routine/moderately complex client accounts. \nManages an assigned book of business and builds, expands, and solidifies relationships with existing clients. \nSecures existing business and drives the sale of additional services and coverage levels on employee benefits. \nMay coordinate the work of administrative support and customer service. \nMay provide support to an Account Executive and/or a Broker Producer. ", "qualifications": {"required": "Bachelor's degree and 3 or more years client coordination and/or claims management experience, OR High School degree with 8 or more years client coordination and/or claims management experience. License required. Able and willing to travel approximately 25% of the time.", "preferred": "Life, Health and Accident License required."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "On top of a competitive salary, great teams and exciting career opportunities, we also offer a wide range of benefits.\n\nBelow are the minimum core benefits you’ll get, depending on your job level these benefits may improve:\n\n<ul><li>Medical/dental/vision plans, which start from day one!</li><li>Life and accident insurance</li><li>401(K) and Roth options</li><li>Tax-advantaged accounts (HSA, FSA)</li><li>Educational expense reimbursement</li><li>Paid parental leave<br/><br/></li></ul>Other benefits include:\n\n<ul><li>Digital mental health services (Talkspace)</li><li>Flexible work hours (availability varies by office and job function) </li><li>Training programs</li><li>Gallagher Thrive program – elevating your health through challenges, workshops and digital fitness programs for your overall wellbeing</li><li>Charitable matching gift program</li><li>And more... <br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994981258"}