{"jobTitle": "Licensed Vocational Nurse (Thursday - Monday, PM Shift)", "company": {"name": "Alsana", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Mental Health Care", "description": "The CompanyAlsana is an eating disorder recovery community with 9 locations nationwide, plus our virtual program. We provide superior and committed care to help those on their journey to a healthy and successful recovery. From the Latin roots meaning all or total health, Alsana offers a new philosophy of care centered on our clients full well-being. We address the aspects of eating disorders that often go untreated in traditional recovery programs. Our culture creates a working environment of communication, collaboration, compassion, and integrityall of which are necessary to craft unique treatment plans tailored to our clients needs and outcomes. The RoleAs the Licensed Vocational Nurse at Alsana, you will provide direct nursing care that includes and is not limited to medication administration, phlebotomy, and documenting all nursing related assessments in the EMR. You will be part of a multi-disciplinary team to support the needs of Alsana clients. ResponsibilitiesConducts daily physical and mental status assessments and documents them accordingly.Completes health questionnaires and accurately document in the medical record.Administers medication, observes for side effects and client response documenting observations in the medical record.Creates and maintains weight and vital signs in EMR and checks daily for accuracy. Rechecks any documented weight or vital sign that is unusual and documents.Participates in client observations to promote abstinence of behaviors and safety.Coordinates with pharmacy for medication deliveries and questions regarding medications. Faxes additional information as needed for payments according to the HIPAA protocols and facility policy.Monitors the nutritional and dietary needs of the clients and reports non-compliance with the plan of care.Organizes, coordinates, and follows up on all consultations with physicians / medical personnel for tests, etc. and provides the appropriate diagnosis for laboratory, radiology, and other diagnostic testing.Completes all Alsana Nursing Assessments, Care-plans, S.O.A.P Notes, Admission Note, Discharge Notes, Noc Shift note and accurately documents in the medical record. All LVN Notes to be co-signed by the Nurse Manager and/or RN.Administers first aid according to facility policy, including all appropriate follow-up documentation.Obtains insurance updates to get precertification for medications and other coverage.Establishes and maintains good communication with clients, families, and staff. Participates in hand-off communication from shift to shift.Perform all other duties as assigned. QualificationsIV certification within 30 days of start dateValid license as a Vocational Nurse1+ years hospital based clinical experience preferred.Current CPR Certification preferably through the American Heart Association1+ years clinical experience in a mental health or residential facility is preferred. BenefitsComprehensive Benefits for full time staffGenerous Paid Time Off, Sick Time Off and HolidaysCompany Paid Life and Disability Insurance401k Plan (Pre and Post Tax)Flexible Spending AccountsLifeMart Employee DiscountsTuition Discount ProgramFree EAP servicesFree meals and snacks (position specific)Are you ready to let your light shine?! Join the Alsana team today!#LVN123by Jobble", "postedDate": "2 weeks ago", "qualifications": {"preferred": "1+ years hospital based clinical experience preferred.Current CPR Certification preferably through the American Heart Association1+ years clinical experience in a mental health or residential facility is preferred.", "required": "IV certification within 30 days of start dateValid license as a Vocational Nurse"}, "skills": [], "benefits": "Comprehensive Benefits for full time staffGenerous Paid Time Off, Sick Time Off and HolidaysCompany Paid Life and Disability Insurance401k Plan (Pre and Post Tax)Flexible Spending AccountsLifeMart Employee DiscountsTuition Discount ProgramFree EAP servicesFree meals and snacks (position specific)", "url": "https://www.linkedin.com/jobs/view/3994332306"}