{"jobTitle": "Sales Associate", "company": {"name": "Balmain", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "salary": {"amount": "$25.00/yr - $30.00/yr", "currency": "USD"}, "jobFunction": "Sales and Customer Service", "industry": "Retail Luxury Goods and Jewelry and Retail Apparel and Fashion", "description": "<strong><u>ABOUT US: </u></strong><p>Founded in 1945, Pierre Balmain's eponymous house has evolved into a singular union of Parisian couture heritage and 21st-century daring. Always remaining true to its core values of inclusion, empowerment and excellence, today's Balmain is intent on forging fashion's future in a uniquely authentic manner. Compelling, often surprising and always bold, Balmain's offerings rely on an instantly recognizable silhouette, assertive spirit and the powerfully transformative possibilities that only beautiful design and skilled construction can achieve. Constantly seeking exciting, novel and entertaining ways to converse and communicate, Balmain will never shy away from pushing each and every envelope. Part of Mayhoola, led by the vision of Creative Director Olivier Rousteing, the house's impressive rapid growth and critical success is entirely due to the passionate and talented Balmain family of craftspeople, experts and team members who make each collection possible.</p><p><br/></p><p><strong><u>JOB DESCRIPTION:</u></strong></p><p>The Sales Associate is responsible for providing a personalized client experience, building strong client relationships, meeting and exceeding sales targets. This individual is a team player that delivers the highest standards of the Balmain client experience.</p><p><br/></p><p><strong><u>WHAT YOU’LL DO:</u></strong></p><ul><li>Demonstrate excellent knowledge of the Balmain history, heritage and products and serve as a role model by prioritizing client’s interest and consistently achieving monthly sales targets.</li><li>Provide impeccable service to our clients and be a true ambassador of the brand ensuring that every client is treated according to Balmain expectations.</li><li>Drive and exceed individual KPI goals, by ensuring the highest level of Customer Service and quality of sales.</li><li>Maintain an active, accurate, neat and organized client book, contacting clients regularly and providing appropriate follow-up on all sales or client requests in order to continually build productive long-term relationships.</li><li>Assist in merchandising and maintenance of the shop floor.</li><li>Follow all company policies and procedures.</li></ul><p><br/></p><p><strong><u>QUALIFICATIONS:</u></strong></p><ul><li>3+ years of Luxury Retail Experience.</li><li>Exceptional organizational skills, follow through and attention to detail.</li><li>Strong problem solving attitude.</li><li>Able to asses priorities, meet deadlines and work under pressure.</li><li>Collaborative spirit and proactive attitude.</li><li>Excellent written and verbal communication skills</li></ul><p><br/></p><p><strong><u>BENEFITS &amp; PERKS: </u></strong></p><ul><li>Health, vision, dental and fringe benefits</li><li>Paid Vacation, Sick, and Holidays</li><li>401k with Company match</li></ul><p><br/></p><p><em>With respect to positions in our retail locations, the expected base salary ranges from $25.00-$30.00 Salary offers are based on a wide range of factors including relevant skills, training, experience, education, and, where applicable, certifications obtained. Market and organizational factors are also considered. In addition to salary and a generous employee benefits package, successful candidates are eligible to receive a discretionary bonus.</em></p><p></p>", "responsibilities": "The Sales Associate is responsible for providing a personalized client experience, building strong client relationships, meeting and exceeding sales targets. This individual is a team player that delivers the highest standards of the Balmain client experience.", "qualifications": {"required": "3+ years of Luxury Retail Experience., Exceptional organizational skills, follow through and attention to detail., Strong problem solving attitude., Able to asses priorities, meet deadlines and work under pressure., Collaborative spirit and proactive attitude., Excellent written and verbal communication skills"}, "skills": ["Luxury Retail", "Customer Service", "Sales", "Client Relationship Management", "Merchandising"], "postedDate": "2 weeks ago", "benefits": "Health, vision, dental and fringe benefits, Paid Vacation, Sick, and Holidays, 401k with Company match", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994735120"}