{"jobTitle": "Entry Level Customer Service Assistant", "company": {"name": "Fresh Form Draft", "industry": "Architecture and Planning", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Description Description: As an Entry Level Customer Service Assistant at TMZ Events, you'll play a crucial role in delivering exceptional customer experiences. You'll be the first point of contact for our clients and attendees, providing support and resolving inquiries with professionalism and efficiency.<br/><br/>Key Responsibilities Responsibilities: Assist customers with inquiries, concerns, and service requests via phone, email, or in person. Provide accurate information about event details, ticketing, and other services. Process customer orders and manage reservations with attention to detail. Address and resolve customer issues or complaints in a timely and courteous manner. Maintain and update customer records and ensure data accuracy. Collaborate with other team members to ensure seamless customer service and support. Contribute to a positive and welcoming atmosphere at events and customer interactions. Skills, Knowledge and Expertise Qualifications: High school diploma or equivalent; some college education preferred. Previous experience in customer service or a related field is a plus but not required. Strong communication and interpersonal skills with a customer-focused attitude. Ability to handle multiple tasks and prioritize effectively in a fast-paced environment. Basic computer skills and proficiency with office software (e.g., Microsoft Office, CRM systems). Positive attitude and willingness to learn and grow within the company. Benefits Benefits: Competitive salary with opportunities for career advancement. Weekends off to enjoy personal time and interests. Comprehensive training and development programs to enhance your skills. Supportive and dynamic work environment with a focus on teamwork. Health insurance benefits, including medical, dental, and vision coverage. Welcome to Fresh Form Draft – where imagination meets innovation in the world of architecture. Our firm is a dynamic and creative force that is dedicated to transforming spaces into living works of art. With a passion for design excellence and a commitment to pushing the boundaries of architectural possibilities, we pride ourselves on crafting environments that inspire, elevate, and resonate with both aesthetics and functionality. Founded with a vision to redefine the architectural landscape, Fresh Form Draft brings together a team of diverse talents, each contributing their unique expertise to every project we undertake. Our collaborative approach ensures that every client’s aspirations are not only met but exceeded. From conceptualization to realization, we work hand in hand with our clients to bring their dreams to life, weaving their stories and desires into the very fabric of our designs.", "jobFunction": "Other", "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994036854"}