{"jobTitle": "Regional Manager - Long Term Care Ombudsman Program", "company": {"name": "Wise & Healthy Aging", "industry": "Civic and Social Organizations", "size": "Not specified", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Project Management and Information Technology", "industry": "Civic and Social Organizations", "description": "Wise & Healthy Aging is a multi-service, non-profit organization serving older adults, their families, and caregivers throughout Los Angeles County. The team promotes and improves seniors' well-being, independence, and self-esteem, preventing premature institutionalization whenever possible. The Regional Manager Long-Term-Care (LTC) Ombudsman Program must use strong leadership and clinically sound capabilities to direct the Pasadena regional area for the LTC Ombudsman Program. This includes the supervision of staff, graduate-level MSW candidate interns, and volunteers who advocate for residents in long-term care facilities. The Regional Manager will also assign and guide the ombudsman to stay abreast of local, state, and federal regulations concerning long-term care facility issues. The position will conduct ombudsman and elder abuse awareness presentations to consumers and professionals. We offer competitive salaries and comprehensive benefits. For staff who regularly work 30 or more hours per week, benefits include 80% company-paid medical, 100% company-paid dental, 401(k) plan with competitive employer match, Flexible Spending Account (FSA), optional life and vision insurance, 14 paid holidays plus paid time off (PTO)", "responsibilities": "Conduct preliminary investigations of reports of alleged elder and dependent adult abuse in long-term care facilities promptly. Train, recruit, assign, and supervise Ombudsman staff, interns, and volunteers. Please make sure that all complaints are handled according to program guidelines. Please ensure the facility coverage plan is implemented by coordinating schedules and field visits. Collect and report accurate statistical data every month in conformance with established procedures. Provide community education presentations, ongoing Public Relations, and development with community partners like law enforcement and local fire departments. Conduct monthly in-service meetings for volunteers and staff. Conduct annual volunteer recognition activities to promote volunteer retention. Engage in legislative advocacy in the district and at the State Capitol. Use personal vehicles to visit LTC facilities approximately 30% of the time. Attend monthly Ombudsman Program Managers meetings and agency meetings and represent the program at several countywide multidisciplinary team meetings.", "qualifications": {"required": "A Master's in social work (MSW) is required. A Master’s in gerontology (MSG) may also be considered. Three years minimum experience in one or more of the following areas: gerontology, complaint investigation, mediation, negotiation, health care delivery, long-term care, and advocacy. Previous experience in volunteer management and staff supervision/management. Ability to communicate effectively in writing and orally. Experience working with ethnically diverse populations.", "preferred": "Candidates must not have worked at a long-term care facility or adult day service center for at least one year before application. Must pass and maintain a criminal background check. Must travel throughout Los Angeles County/City and to Sacramento minimally biannually. Transportation, a valid driver’s license, auto insurance, and a satisfactory criminal background check are required."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "80% company-paid medical, 100% company-paid dental, 401(k) plan with competitive employer match, Flexible Spending Account (FSA), optional life and vision insurance, 14 paid holidays plus paid time off (PTO)", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3994980797"}