{"jobTitle": "Grant Manager, RISE Scholars/Educational Justice Programs", "company": {"name": "Rio Hondo College", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Higher Education", "description": "Job Number<br/><br/>MAN00120P<br/><br/>Position Title<br/><br/>Grant Manager, RISE Scholars/Educational Justice Programs<br/><br/>Position Type<br/><br/>Academic Administrator<br/><br/>Percentage Employee<br/><br/>100<br/><br/>Number of Months Assignment<br/><br/>12<br/><br/>Starting Date<br/><br/>As soon as possible<br/><br/>Current Work Schedule<br/><br/>Monday through Friday 8:00 a.m. – 5:00 p.m. Days and hours of employment may change depending on District needs.<br/><br/>Salary Range<br/><br/>Range 35 on Management Salary Schedule<br/><br/>Salary<br/><br/>$8,649.50 – $10,540.08 Monthly – This is a Categorically Funded position. Continuation of this position is contingent upon continued funding.<br/><br/>FLSA<br/><br/>Exempt<br/><br/>Location<br/><br/>Main Campus<br/><br/>Department<br/><br/>Student Affairs (Dept)<br/><br/>Open Date<br/><br/>07/30/2024<br/><br/>Closing Date<br/><br/>08/11/2024<br/><br/>Open Until Filled<br/><br/>No<br/><br/><strong>About Rio Hondo College<br/><br/></strong>About Rio Hondo College<br/><br/>Rio Hondo College welcomes and embraces all students in their educational and career pathways. As a Hispanic-Serving Institution (HSI), our College has a student population of 22,000, of which 18,000 are Latinx students. We were the first college in Los Angeles County to provide two years of free tuition to first-time, full-time college students through our Rio Promise program. We are proud to acknowledge that many of our students have transferred to high ranked institutions such as Harvard, Stanford, USC and UCLA, UC Berkeley, UC Irvine, Cal State LA, Cal State Long Beach, and Whittier College to name a few.<br/><br/>Strengths<br/><br/>Our caring and dedicated student-centered staff, faculty, and administrators are devoted to the advancement of educational justice, equity, and opportunity for all our students. Our Colleges 900 employees, with close to 600 faculty, hold themselves accountable for the academic success of disproportionately impacted student populations. Our entire staff, with unwavering team collaboration, work hard to ensure our students reach their full potential by eliminating gaps in academic outcomes that traditionally hinder students of color.<br/><br/>Rio Hondo College is committed to the recruitment of qualified and diverse employees who are dedicated to our students success. We recognize that diversity in an academic environment fosters cultural awareness, promotes mutual understanding and respect, and provides suitable role models for our students. We are steadfast in our hiring practices and staff development processes which reinforce the goals of equal opportunity, diversity, and inclusion. Our practices and processes also support the importance of a workforce that reflects the community and the diverse student population we serve.<br/><br/>Rio Hondo College employs approximately 55% tenured track faculty of color; 60% part-time faculty of color; 85% classified staff of color; and 50% administrators of color.<br/><br/>Rio Hondo College offers 30 associate degrees that guarantee transfer (ADTs) to Cal State Universities, a bachelors degree in Automotive Technology, more than 60 certificates, a Pathway to Law School, dual enrollment with K-12 districts, state championship speech &amp; debate team, top-notch athletic teams, student leadership opportunities, travel abroad experiences and more.<br/><br/>In collaboration with the communities in Pico Rivera, Santa Fe Springs, El Monte, South El Monte, Whittier, portions of Norwalk, La Mirada, Downey, La Puente, the City of Industry, Los Nietos and Avocado Heights, Rio Hondo College provides an exceptional academic curriculum to meet the unique needs of our region and strengthen our communities.<br/><br/>Basic Function<br/><br/>Under the direction of the Assigned Administrator, coordinate the development of classes and programs including determination of needs and interest, planning, implementation, and evaluation; communicate with community individuals, groups and District staff regarding grant related classes and programs. The Grant Manager is responsible for grant(s) greater than $500,000 per year.<br/><br/><strong>Minimum Qualifications<br/><br/></strong>EDUCATION AND EXPERIENCE:<br/><br/>A Masters degree from an accredited college or university and two years of increasingly responsible experience in program management, preferable in a higher education setting. Experience developing solicitation strategies for grant funding, as well as writing and managing independent grant proposals.<br/><br/>One year of formal training, internship, or leadership experience reasonably related to the administrative assignment.<br/><br/>Demonstrated sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.<br/><br/>Essential Duties<br/><br/>Plan, develop, schedule, monitor, and evaluate assigned grant programs and services. E<br/><br/>Plan, develop, and submit program plans and reports on a timely basis. E<br/><br/>Establish funding priorities and manage grant(s) cycle. E<br/><br/>Perform duties as Project Manager for assigned program(s); develop, coordinate, implement, and organize the programs activities. E<br/><br/>Communicate and coordinate activities with other District departments, personnel, other community colleges, various governmental and community agencies, advisory committees, and the public. E<br/><br/>Develop accurate, comprehensive and up-to-date program evaluation materials. E<br/><br/>Coordinate recruitment activities; prepare and provide informational materials to the public; contact special interest groups/population concerning grant related activities. E<br/><br/>Research and compile information and prepare various reports as needed. E<br/><br/>Train and provide work direction of assigned staff; participate in selection process and evaluation of work as required. E<br/><br/>Provides on-going monitoring of the grant requirements to ensure that all funds are being spent properly and ensuring that targets are met. E<br/><br/>Establish and maintain liaison with community representatives, organizations and public agencies to encourage participation, stimulate interest and coordinate campus. E<br/><br/>Prepare and edit course descriptions for content and accuracy for flyers, brochures, pamphlets and course schedules. E<br/><br/>Participate with a variety of advisory committees; attend a variety on and off campus meetings; attend professional meetings, conferences and workshops as approved. E<br/><br/>Coordinate partnerships with employers, community colleges and various local and state entities. E<br/><br/>Effectively represent the District to clients in accomplishing the goals and objectives of the grant. E<br/><br/>Perform related duties as assigned.<br/><br/>The Americans with Disabilities Act (ADA) requires us to identify the essential (E) of the job duties/functions of the position. We have indicated those duties with an E on the job description.<br/><br/><strong>Job Related And Essential Qualifications<br/><br/></strong>Knowledge of<br/><br/>District organization, operations, policies and procedures.<br/><br/>Methods and procedures of scheduling and planning courses and programs.<br/><br/>Legislative processes related to grant funding.<br/><br/>Available resources for grant related activities.<br/><br/>Basic research methods.<br/><br/>Interpersonal skills using tact, patience and courtesy.<br/><br/>Oral and written communication skills.<br/><br/>Correct English usage, grammar, spelling, punctuation, and vocabulary.<br/><br/>Record-keeping techniques.<br/><br/>Federal, state and local laws, codes and regulations as it relates to grants.<br/><br/>Ability to<br/><br/>Understand, interpret and apply administrative and District policies and procedures as well as pertinent laws, regulations and ordinances.<br/><br/>Plan, develop, schedule and implement classes and programs.<br/><br/>Monitor and evaluate classes, programs and personnel.<br/><br/>Research, compile and analyze information.<br/><br/>Make presentations (oral, power point, video or web based) to various groups.<br/><br/>Plan and prepare course schedules.<br/><br/>Analyze situation accurately and adopt an effective course of action.<br/><br/>Work independently with little direction.<br/><br/>Meet schedule and time lines.<br/><br/>Plan and organize work schedule and budget effectively.<br/><br/>Maintain records and prepare reports.<br/><br/>Establish and maintain cooperative and effective working relationships with staff and community members.<br/><br/>Train and provide work direction to others.<br/><br/>Develop and coordinate conferences.<br/><br/>Foreign Degrees<br/><br/>Any degree from a country other than the United States, including Canada and Great Britain, must be evaluated by an Evaluation Service prior to the closing date. Certification must be attached with copies of transcripts.<br/><br/>License Certificates/Credentials<br/><br/>Possession of, or ability to obtain, an appropriate, valid drivers license.<br/><br/><strong>Desired Qualifications<br/><br/></strong>Previous incarceration experience and/or in-depth knowledge of the issues relevant to successful reintegration following incarceration.<br/><br/>Success in overcoming barriers similar to those confronting the programs target population (i.e., a justice-involved person).<br/><br/>Knowledge/experience in trauma-informed programming, restorative justice, and/or conflict resolution.<br/><br/>Working Conditions<br/><br/>District office environment and domestic travel may be required. Work under steady pressure with frequent interruptions and a high degree of public contact by phone or in person.<br/><br/><strong>Special Requirements<br/><br/></strong>Essential duties require the following physical skills and work environment:<br/><br/>Ability to work in a standard office environment including ability to sit, stand, walk, kneel, crouch, stoop, squat, twist, and lift 20 lbs.; ability to travel to different sites and<br/><br/>locations.<br/><br/>Position Description<br/><br/>Applications are currently being accepted for Grant Manager, RISE Scholars/Educational Justice Programs in the Student Equity department. This is a Categorically Funded position. Continuation of this position is contingent upon continued funding.<br/><br/>Application Procedure<br/><br/>Applications must be submitted by 11:59 p.m. PT on the closing date.<br/><br/>Applicants must submit a complete online application that includes the items listed.<br/><br/>Rio Hondo College online application (which includes supplemental questions)<br/><br/>Résumé/Curriculum Vitae<br/><br/>Complete transcripts of all colleges/university studies, including degree earned (copies will be accepted)<br/><br/>Transcripts must include degree awarded and confer date (please circle conferral date on transcripts). Transcripts without this information and online applications without transcripts will be disqualified.<br/><br/>PAPER APPLICATIONS AND APPLICATION MATERIALS SENT VIA MAIL, FAX, OR EMAIL WILL NOT BE ACCEPTED.<br/><br/>NOTE THAT ALL CORRESPONDENCE, INCLUDING INTERVIEW INVITATIONS, WILL BE SENT VIA EMAIL.<br/><br/>Special Instructions to Applicants<br/><br/>SELECTION PROCESS AND TENTATIVE SCHEDULE: *Please note this is a tentative timeline and subject to change<br/><br/>Application deadline: 8/11/2024<br/><br/>Application screening: Week of 8/12/2024<br/><br/><strong>Applications Are Initially Screened For Completeness And Minimum Qualifications.<br/><br/></strong>Complete applications are forwarded to the Department hiring committee for further review.<br/><br/>First level interview: 9/6/2024<br/><br/>Final interview: Tentatively planned for week of 9/9/2024<br/><br/>Additional Information<br/><br/>The Immigration Reform and Control Act requires the District obtain documentation from every individual who is employed which verifies identity and authorizes his/her right to work in the United States.<br/><br/>Successful candidate is responsible for verifying all prior work experience and providing all academic transcripts for purposes of salary placement.<br/><br/>As a condition of employment, the selected applicant must provide a set of fingerprints (at the applicants expense) taken by an official LiveScan agency.<br/><br/>Provide a Certificate of Tuberculosis Exam for initial employment (The certificate must be renewed every 4 years as a condition of continuing employment).<br/><br/>For positions requiring a valid California drivers license, proof of insurability is required.<br/><br/>Applicants who are protected under the Americans with Disabilities Act and require accommodations for completing the application process, testing (if required for position), or the interview, please notify the Human Resources Office.<br/><br/>Pass a pre-employment physical exam at the Districts expense.<br/><br/>A copy of this announcement will be provided in Braille to visually impaired applicants upon request.<br/><br/>Commitment to Diversity<br/><br/>All applicants must have demonstrated cultural competency and sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, gender identity, sexual orientation, and ethnic backgrounds of community college students and staff.<br/><br/>Cancel RTF Policy<br/><br/>WE RESERVE THE RIGHT TO RE-OPEN, RE-ADVERTISE, DELAY OR CANCEL FILLING THIS POSITION.<br/><br/>THIS RECRUITMENT MAY BE USED TO FILL FUTURE VACANCIES.<br/><br/>EEO Statement<br/><br/>Rio Hondo College is committed to employing qualified administrators, faculty and staff members who are dedicated to student success. The Board recognizes that diversity in the academic environment fosters cultural awareness, promotes mutual understanding and respect, and provides suitable role models for all students. The Board is committed to hiring and staff development processes that support the goals of equal opportunity and diversity, and provide equal consideration for all qualified candidates. A Masters degree from an accredited college or university and two years of increasingly responsible experience in program management, preferable in a higher education setting. Experience developing solicitation strategies for grant funding, as well as writing and managing independent grant proposals. One year of formal training, internship, or leadership experience reasonably related to the administrative assignment. Demonstrated sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.", "responsibilities": "Plan, develop, schedule, monitor, and evaluate assigned grant programs and services. E\nPlan, develop, and submit program plans and reports on a timely basis. E\nEstablish funding priorities and manage grant(s) cycle. E\nPerform duties as Project Manager for assigned program(s); develop, coordinate, implement, and organize the programs activities. E\nCommunicate and coordinate activities with other District departments, personnel, other community colleges, various governmental and community agencies, advisory committees, and the public. E\nDevelop accurate, comprehensive and up-to-date program evaluation materials. E\nCoordinate recruitment activities; prepare and provide informational materials to the public; contact special interest groups/population concerning grant related activities. E\nResearch and compile information and prepare various reports as needed. E\nTrain and provide work direction of assigned staff; participate in selection process and evaluation of work as required. E\nProvides on-going monitoring of the grant requirements to ensure that all funds are being spent properly and ensuring that targets are met. E\nEstablish and maintain liaison with community representatives, organizations and public agencies to encourage participation, stimulate interest and coordinate campus. E\nPrepare and edit course descriptions for content and accuracy for flyers, brochures, pamphlets and course schedules. E\nParticipate with a variety of advisory committees; attend a variety on and off campus meetings; attend professional meetings, conferences and workshops as approved. E\nCoordinate partnerships with employers, community colleges and various local and state entities. E\nEffectively represent the District to clients in accomplishing the goals and objectives of the grant. E\nPerform related duties as assigned.", "qualifications": {"required": "A Masters degree from an accredited college or university and two years of increasingly responsible experience in program management, preferable in a higher education setting. Experience developing solicitation strategies for grant funding, as well as writing and managing independent grant proposals.\nOne year of formal training, internship, or leadership experience reasonably related to the administrative assignment.\nDemonstrated sensitivity to and understanding of the diverse academic, socioeconomic, cultural, disability, and ethnic backgrounds of community college students.", "preferred": "Previous incarceration experience and/or in-depth knowledge of the issues relevant to successful reintegration following incarceration.\nSuccess in overcoming barriers similar to those confronting the programs target population (i.e., a justice-involved person).\nKnowledge/experience in trauma-informed programming, restorative justice, and/or conflict resolution."}, "skills": [], "postedDate": "2 weeks ago", "salary": {"amount": "8,649.50 – 10,540.08", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994930281"}