{"jobTitle": "Manager, Rights Hub", "company": {"name": "Universal Music Group", "location": "Santa Monica, CA", "industry": "Music"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$66,650 - $125,662", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Musicians", "description": "We are UMG, the Universal Music Group. We are the world’s leading music company. In everything we do, we are committed to artistry, innovation and entrepreneurship. We own and operate a broad array of businesses engaged in recorded music, music publishing, merchandising, and audiovisual content in more than 60 countries. We identify and develop recording artists and songwriters, and we produce, distribute and promote the most critically acclaimed and commercially successful music to delight and entertain fans around the world.<br/><br/>Interscope, Capitol Labels Group (“ICLG”) is home to some of the biggest artists in the world including: U2, Eminem, Katy Perry, Kendrick Lamar, Lady Gaga, Ice Spice and many more. As a leader in the music industry, we are always looking for talented and driven individuals to join our family.<br/><br/><strong>How We LEAD<br/><br/></strong>The Rights Hub Manager will work daily with Interscope Business Affairs managing data to identify and obtain deals that impact our repertoire (artist, producer, (re)mixer, side artist, and sample agreements). This person will be responsible for capturing the provisions of these agreements in the ‘Rights Hub’ rights management application so that these deals are available for linking to repertoire.<br/><br/><strong>How You’ll CREATE<br/><br/></strong><ul><li>Responsible for capturing agreement provisions (via contracts, deal memos or email etc.) and manage data in the ‘Rights Hub’ rights management application to ensure deals are linked to repertoire.</li><li>Accurately interpret contractual language and to articulate the way the label chooses to operate against various agreements; liaison with Label Business Affairs to manage data, interpret contractual terms, as needed.</li><li>Work with Royalties Business Affairs to ensure royalties provisions are swiftly captured and to manage the communication and relationship between Royalties Business Affairs and Label Business Affairs.</li><li>Facilitate the approval of all rights and royalties provisions captured in the system by the relevant label attorney in a timely fashion.</li><li>Link agreements to all relevant repertoire and contributors (e.g. link producers to the producer agreement(s) that govern their services with respect specific songs.)</li><li>Keep deals up to date as the result of a deal’s negotiation status, contractual amendments, option pick-ups, drop notices, expiration of rights, deal ‘overrides’, etc.<br/><br/></li></ul><strong>Bring Your VIBE<br/><br/></strong><ul><li>BA degree in Music or related field</li><li>Familiarity with recording agreements</li><li>Task-oriented and organized, with the ability to stay on top of multiple initiatives at one time</li><li>Ability to maintain focus and complete detailed contractual analysis on a regular basis</li><li>Outgoing personality and strong communication skills. This is not solely a “data entry” position; this role manages communication of our rights between various departments (Legal, Royalties, A&amp;R, Production, Commercial, etc.)</li><li>Ambition to work toward continual process improvement (faster deal entry times, improving the application and business process, etc.)</li><li>Proficient technical skills (experience and comfortability using web-based applications)</li><li>Comfortable in a rights management role rather than ambitious to immediately move into a deal negotiation role</li><li>Familiarity with business process workflows (following a pre-defined process, understanding how one’s role helps to achieve the overall objective)</li><li>2-3 years’ experience in the music industry<br/><br/></li></ul><strong>Perks Playlist<br/><br/></strong><ul><li>Be part of an entrepreneurial, global organization that values authenticity, drive, creativity, relationships, and a competitive spirit</li><li>Comprehensive medical, dental, vision, and FSA options, as well as:</li><ul><li>100% coverage for out-patient mental health services</li><li>Wellbeing reimbursements for fitness classes, spa treatments, meal services, travel, and so much more (up to $720/year)</li><li>A lifetime fertility support allowance of $30,000 to plan participants</li><li>Student Loan Repayment Assistance and Tuition Reimbursement</li><li>100% immediately vested 401(k) match on the first 5% of your contribution on eligible compensation<br/><br/></li></ul></ul><ul><li>Variety of ways to prioritize much-needed time away from work including:</li><ul><li>Flexible Paid Time Off (PTO) for exempt employees</li><li>3-weeks PTO for non-exempt employees</li><li>2-weeks paid Winter Break</li><li>10 Company Holidays (including Juneteenth and Wellbeing Day)</li><li>Summer Fridays (between Memorial Day and Labor Day)</li><li>Generous paid parental leave for every type of parent<br/></li></ul></ul>Check out our full overview of benefits on the Perks Playlist page of the career site.<br/><br/><strong>Disclaimer: This job description only provides an overview of job responsibilities that are subject to change.<br/><br/></strong><strong>Universal Music Group is an Equal Opportunity Employer<br/><br/></strong>We are an E-Verify employer in Alabama, Arizona, Georgia, Mississippi, North Carolina, South Carolina, Tennessee, and Utah.<br/><br/>For more information, please click on the following links.<br/><br/>E-Verify Participation Poster: <strong>English / Spanish<br/><br/></strong>E-Verify Right to Work Poster: <strong>English</strong> | <strong>Spanish<br/><br/></strong><strong>Job Category<br/><br/></strong>Business &amp; Legal Affairs<br/><br/><strong>Salary Range<br/><br/></strong>$66,650 - $125,662<br/><br/>The actual base salary offered depends on a variety of factors, which may include, as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job. All candidates are encouraged to apply.", "responsibilities": "The Rights Hub Manager will work daily with Interscope Business Affairs managing data to identify and obtain deals that impact our repertoire (artist, producer, (re)mixer, side artist, and sample agreements). This person will be responsible for capturing the provisions of these agreements in the ‘Rights Hub’ rights management application so that these deals are available for linking to repertoire.", "qualifications": {"required": "BA degree in Music or related field, Familiarity with recording agreements, Task-oriented and organized, with the ability to stay on top of multiple initiatives at one time, Ability to maintain focus and complete detailed contractual analysis on a regular basis, Outgoing personality and strong communication skills. This is not solely a “data entry” position; this role manages communication of our rights between various departments (Legal, Royalties, A&amp;R, Production, Commercial, etc.), Ambition to work toward continual process improvement (faster deal entry times, improving the application and business process, etc.), Proficient technical skills (experience and comfortability using web-based applications), Comfortable in a rights management role rather than ambitious to immediately move into a deal negotiation role, Familiarity with business process workflows (following a pre-defined process, understanding how one’s role helps to achieve the overall objective), 2-3 years’ experience in the music industry", "preferred": ""}, "skills": ["Music", "Recording Agreements", "Contractual Analysis", "Communication", "Process Improvement", "Technical Skills", "Rights Management", "Business Process Workflows"], "postedDate": "2 weeks ago", "benefits": "Be part of an entrepreneurial, global organization that values authenticity, drive, creativity, relationships, and a competitive spirit, Comprehensive medical, dental, vision, and FSA options, as well as: 100% coverage for out-patient mental health services, Wellbeing reimbursements for fitness classes, spa treatments, meal services, travel, and so much more (up to $720/year), A lifetime fertility support allowance of $30,000 to plan participants, Student Loan Repayment Assistance and Tuition Reimbursement, 100% immediately vested 401(k) match on the first 5% of your contribution on eligible compensation, Flexible Paid Time Off (PTO) for exempt employees, 3-weeks PTO for non-exempt employees, 2-weeks paid Winter Break, 10 Company Holidays (including Juneteenth and Wellbeing Day), Summer Fridays (between Memorial Day and Labor Day), Generous paid parental leave for every type of parent", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3994150136"}