{"jobTitle": "Operations Manager II, Fleet Transportation", "company": {"name": "Walmart", "location": "Colton, CA"}, "location": "Colton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Position Summary...<br/><br/>What you'll do...<br/><br/>Asset Management : Possess Knowledge of: Fundamentals of asset management, enterprise asset management plan; Lifecycle of assets - Acquisition, operation, maintenance and renewal; \"Total cost of ownership\" concept related to assets; Awareness of parts (inventory/lead time) .To be able to: Execute systematic methods for effectively operating and upgrading assets. Implements inventory procedures and software tools for inventory management. Describe and create status and management reports, such as exceptions or on-demand materials. Execute procedures for recording the acquisition of sales and the disposal of supply chain related assets.<br/><br/>Data &amp; Digital Acumen : Possess Knowledge of: Data collection modes, techniques and tools; Data analytics &amp; visualization tools and techniques; Existing and upcoming digital applications and other systems used in the respective areas; Technology innovation trends &amp; industry benchmarks; Data governance as it relates to data quality, metadata, and data lineage; Data Science techniques and their applications in a function specific context. To be able to: Delineate the problem, leverage data to determine the root cause and apply the information to find a solution. Articulate the levers that influence the data, ensure data quality and organize &amp; process information for analysis Participate in the feedback loop between dataintake and insights and continually work on improving the data-collection process (mode/data set etc.). Identify and propose ways to automate / improve existing process in the respective area of work with the help of technology (such as RPA, AI, Machine learning etc.). Demonstrate a working knowledge of Data Science techniques and their applications to the respective function / business.<br/><br/>Exception Management : Possess Knowledge of: Knowledge of truck transportation loss control practices, tools and techniques; ability to assess, prevent and reduce loss in transportation, as well as recommend solutions for trucking risks; Data analytics &amp; visualization tools and techniques; Existing and upcoming digital applications and other systems used in the respective areas; Technology innovation trends &amp; industry benchmarks; Data governance as it relates to data quality, metadata, and data lineage; Data Science techniques and their applications in a function specific context. To be able to: Emerge process issues that exist between cross-functional groups, through the use of data and reporting, in order to improve planning and mitigate risk across supply chain. Help in identifying tasks and responsibilities suited for automation; assist in process design and implementation of automated processes across the network. Leverage data to assist in developing action plans and identifying appropriate network resources for disruption events in Supply Chain.<br/><br/>Fleet Readiness : Possess Knowledge of: Scheduling and reporting; Related operational and financial KPIs; Preventive Maintenance and carrier quality. To be able to: Manage scheduling and reporting of fleet keeping seasonality and contingencies in perspective. Manage budget for ensuring the fleet availability from different channels including owned, leased or market. Manage fleet maintenance &amp; carrier quality from multiple Third Party Logistics providers and different category of vehicles.<br/><br/>Safety &amp; Compliance: Possess Knowledge of: Industry best practices and safety and compliance standards; Local, State, and Federal Regulatory agencies; Audit steps, tools, and resources; Accident prevention; Risk mitigation; Change management and implementation; Business unit knowledge and performance requirements. To be able to: Monitor processes within a given business unit taking proper action to address issues, respond to questions, and support safety and compliance needs from the business ( ex. initiating cross-functional investigations, implementing process changes and new procedures, leading training, or interacting with external stakeholders) Makes process improvement recommendations by being able to identify incident patterns and process gaps and select possible solutions. Identify trends affecting proper operations and execute risk elimination plans. Designs safe workplace processes and policies, ensuring business goals and performance metrics are aligned with safety and compliance standards and regulations. Conducts safety and compliance assessments and audits of transportation safety management processes and practices within a given business unit to ensure business needs and safety and compliance requirements are met. Delivers safety and compliance training programs and communications. Execute and manage the root cause analysis plan in own area of work.<br/><br/>Shipping &amp; Transportation : Possess Knowledge of: Routing &amp; network plan; Delivery scheduling; Vehicle utilization; Inbound &amp; Outbound operations; Department of Transportation guidelines and regulations. To be able to: Use the transport operation documents to manage the operational flow for different load carriers and categories of goods. Analyze capacity of distribution systems, use network analysis methods for planning new network. Ensure optimal utilization of vehicle based on the network requirements considering seasonality and other special situations. Execute the best practices as provided in SOPs and support leaders with gap identification in operations.<br/><br/>Vendor Management : Possess Knowledge of: Stakeholder identification and mapping; Stakeholder analysis; Stakeholder communication; Relevant business metrics and business areas; Stakeholder management tools and methods. To be able to: Collaborate with suppliers and stakeholders to identify and implement innovative ideas. Review the supplier details and assess the capabilities and competencies within the context of business needs and submits recommendations to leadership. Monitor and report on supplier performance and implement strategies to improve supplier performance through negotiation of KPIs and SLAs. Resolve complex vendor issues and escalate to the appropriate level for resolution when necessary.<br/><br/>Coordinates, completes, and oversees job-related activities and assignments by developing and maintaining relationships with key stakeholders; supporting plans and initiatives to meet customer and business needs; identifying and communicating goals and objectives; building accountability for and measuring progress in achieving results; identifying and addressing improvement opportunities; and demonstrating adaptability and promoting continuous learning.<br/><br/>Provides supervision and development opportunities for associates by hiring and training; mentoring; assigning duties; providing recognition; and ensuring diversity awareness.<br/><br/>Ensures compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by implementing related action plans; utilizing and supporting the Open Door Policy; and providing direction and guidance on applying these in executing business processes and practices.<br/><br/>Talent: Supervise Associates:Provides specific, honest, accurate, and timely feedback on associate performance. Assigns tasks to associates that fit their skill levels and maximize team performance. Uses people processes (for example, selection, development, performance evaluation) to ensure effective associate performance. Recruits and hires the associates needed to meet business requirements. Teaches, guides, and assists in the development of associates.<br/><br/>Judgment: Use Appropriate Judgment: Identifies, reviews, and applies policies and procedures to make informed judgments. Identifies and uses facts, information, and expertise to set priorities and make informed decisions. Uses data and evidence to determine the causes of problems and develop solutions to address them.<br/><br/>Customer/Member Centered: Focus on the Customer/Member: Reviews customer/member-focused data and adjusts performance to address findings. Promotes and supports associate efforts to exceed customer/member expectations. Informs associates on how to identify and locate resources to meet the diverse needs of customers/members.<br/><br/>Execution and Results: Manage Execution and Results: Holds associates accountable for completing work within expectations and time requirements. Plans and manages own and others' time, based on business priorities, and follows up to ensure all work requirements are completed in a timely and accurate manner. Identifies and obtains the resources needed to complete projects. Encourages associates to strive for excellence, efficiency, and quality in work practices.<br/><br/>Planning and Improvement: Plan and Pursue Team-Based: Improvement Coordinates and aligns planning with organizational initiatives and direction. Looks at work plans and makes changes, as needed, to achieve team or work group objectives. Sets realistic timelines for goal accomplishment. Improves work processes and practices to increase performance and results.<br/><br/>Influence and Communicate: Increase Commitment: Promotes ideas and links them to business needs and benefits. Builds trusting, cooperative relationships and alliances with others, inside and outside of the organization. Effectively communicates clear, up-to-date information on business plans and priorities (for example, change initiatives). Shares experience and ideas with associates across the organization.<br/><br/>Ethics and Compliance: Manage Ethics and Compliance: Instructs associates on how to act in accordance with policies and procedures, and supports their efforts in doing so. Ensures associates demonstrate the highest standards of integrity and ethics in work situations. Corrects ethical and compliance issues, enforcing compliance and administering appropriate consequences as needed.<br/><br/>Adaptability: Quickly Adapt: Demonstrates creativity and strength in the face of change, obstacles, and adversity. Adapts to competing demands and shifting priorities. Updates knowledge and skills to handle new complexities, challenges, and responsibilities. Seeks exposure to new ideas and perspectives. Helps associates adjust to and develop the capabilities needed to implement organizational change initiatives.<br/><br/>Sustainability: Communicates PSP sustainability values and goals (for example, energy reduction, waste reduction, sustainable products) to Associates throughout the Club/area of responsibility, ensuring their understanding of the importance and impact of these initiatives, and connects PSP initiatives to the Club/area of responsibility goal. Recommends ideas or approaches based on PSP sustainability values and goals that would further improve operations and outcomes. Uses sustainability information to promote organizational success while improving social, economic, and environmental practices. Teaches Associates in area of responsibility how to handle and respond to community partners' questions and concerns regarding PSP sustainability values, efforts, and goals, including steps to take when they don't know the answer to give. Provides advice and guidance to Associates on those behaviors and actions that are consistent with PSP sustainability values and goals (for example, reducing waste, saving energy, demonstrating work-related Personal Sustainability Practices).<br/><br/>Associate Engagement: Ensures Associates understand and participate in the grass roots process year-round. Ensures Associates implement action plans developed in response to Associate Opinion Survey results and tracks these efforts over time. Implements programs designed to support and enhance Associate health and well-being by taking action to minimize or eliminate problematic issues. Encourages and rewards Associate engagement behaviors that contribute to the achievement of Facility and own goals. Consistently promotes the importance and value of Associate engagement by implementing processes and practices designed to improve engagement and enhance operations.<br/><br/>Diversity: Identifies up and coming and high-performing talent, including diverse talent, and provides for accelerated development opportunities. Demonstrates awareness and value of diverse teams by creating and maintaining an environment of objectivity, open communication, and respect. Implements and supports strategies and initiatives that build high-performing, diverse and inclusive teams. Actively supports formal diversity goal requirements.<br/><br/>At Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.<br/><br/>‎<br/><br/>‎<br/><br/>‎<br/><br/>You will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.<br/><br/>‎<br/><br/>For information about PTO, see https://one.walmart.com/notices .<br/><br/>‎<br/><br/>‎<br/><br/>Live Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.<br/><br/>‎<br/><br/>Eligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.<br/><br/>‎<br/><br/><strong>For Information About Benefits And Eligibility, See One.Walmart .<br/><br/></strong>‎<br/><br/>The annual salary range for this position is $66,560.00-$139,000.00<br/><br/>‎<br/><br/><strong>Additional Compensation Includes Annual Or Quarterly Performance Bonuses.<br/><br/></strong>‎<br/><br/><strong>Additional Compensation For Certain Positions May Also Include<br/><br/></strong>‎<br/><br/><ul><li> Regional Pay Zone (RPZ) (based on location)<br/><br/></li></ul>‎<br/><br/><ul><li> Stock<br/><br/></li></ul>‎<br/><br/>‎<br/><br/><strong>Minimum Qualifications...<br/><br/></strong>Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.<br/><br/>Bachelor's Degree in a related field (e.g., Management, Supply Chain, Business Administration, Financial Management, Production/Operations Management) and 1 year experience in an operations/distribution/supply chain/retail environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees. OR 1 year experience as a Walmart Supply Chain Area or Operations Manager supervising, evaluating, mentoring, and developing associates; managing associate workload; and participating in the hiring and promotion of associates OR 1 year experience as a Walmart Supply Chain Load Manager OR 3 years experience in an operations/distribution/supply chain/retail environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees.<br/><br/><strong>Preferred Qualifications...<br/><br/></strong>Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.<br/><br/>Both Bachelor's Degree in a related field (e.g., Management, Supply Chain, Business Administration, Financial Management, Production/OperationsManagement); and 3 years experience in a supply chain environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees., Walmart Supply Chain manager supervising, evaluating, mentoring, and developing associates; managing workload; and participating in the hiring and promotion of associates.<br/><br/>Bachelors: Business, Bachelors: Finance, Bachelors: Logistics, Bachelors: Management, Bachelors: Operations Management<br/><br/>Primary Location...<br/><br/>1015 S Rancho Ave, Colton, CA 92324-2044, United States of America", "responsibilities": "Asset Management : Possess Knowledge of: Fundamentals of asset management, enterprise asset management plan; Lifecycle of assets - Acquisition, operation, maintenance and renewal; \"Total cost of ownership\" concept related to assets; Awareness of parts (inventory/lead time) .To be able to: Execute systematic methods for effectively operating and upgrading assets. Implements inventory procedures and software tools for inventory management. Describe and create status and management reports, such as exceptions or on-demand materials. Execute procedures for recording the acquisition of sales and the disposal of supply chain related assets.<br/><br/>Data &amp; Digital Acumen : Possess Knowledge of: Data collection modes, techniques and tools; Data analytics &amp; visualization tools and techniques; Existing and upcoming digital applications and other systems used in the respective areas; Technology innovation trends &amp; industry benchmarks; Data governance as it relates to data quality, metadata, and data lineage; Data Science techniques and their applications in a function specific context. To be able to: Delineate the problem, leverage data to determine the root cause and apply the information to find a solution. Articulate the levers that influence the data, ensure data quality and organize &amp; process information for analysis Participate in the feedback loop between dataintake and insights and continually work on improving the data-collection process (mode/data set etc.). Identify and propose ways to automate / improve existing process in the respective area of work with the help of technology (such as RPA, AI, Machine learning etc.). Demonstrate a working knowledge of Data Science techniques and their applications to the respective function / business.<br/><br/>Exception Management : Possess Knowledge of: Knowledge of truck transportation loss control practices, tools and techniques; ability to assess, prevent and reduce loss in transportation, as well as recommend solutions for trucking risks; Data analytics &amp; visualization tools and techniques; Existing and upcoming digital applications and other systems used in the respective areas; Technology innovation trends &amp; industry benchmarks; Data governance as it relates to data quality, metadata, and data lineage; Data Science techniques and their applications in a function specific context. To be able to: Emerge process issues that exist between cross-functional groups, through the use of data and reporting, in order to improve planning and mitigate risk across supply chain. Help in identifying tasks and responsibilities suited for automation; assist in process design and implementation of automated processes across the network. Leverage data to assist in developing action plans and identifying appropriate network resources for disruption events in Supply Chain.<br/><br/>Fleet Readiness : Possess Knowledge of: Scheduling and reporting; Related operational and financial KPIs; Preventive Maintenance and carrier quality. To be able to: Manage scheduling and reporting of fleet keeping seasonality and contingencies in perspective. Manage budget for ensuring the fleet availability from different channels including owned, leased or market. Manage fleet maintenance &amp; carrier quality from multiple Third Party Logistics providers and different category of vehicles.<br/><br/>Safety &amp; Compliance: Possess Knowledge of: Industry best practices and safety and compliance standards; Local, State, and Federal Regulatory agencies; Audit steps, tools, and resources; Accident prevention; Risk mitigation; Change management and implementation; Business unit knowledge and performance requirements. To be able to: Monitor processes within a given business unit taking proper action to address issues, respond to questions, and support safety and compliance needs from the business ( ex. initiating cross-functional investigations, implementing process changes and new procedures, leading training, or interacting with external stakeholders) Makes process improvement recommendations by being able to identify incident patterns and process gaps and select possible solutions. Identify trends affecting proper operations and execute risk elimination plans. Designs safe workplace processes and policies, ensuring business goals and performance metrics are aligned with safety and compliance standards and regulations. Conducts safety and compliance assessments and audits of transportation safety management processes and practices within a given business unit to ensure business needs and safety and compliance requirements are met. Delivers safety and compliance training programs and communications. Execute and manage the root cause analysis plan in own area of work.<br/><br/>Shipping &amp; Transportation : Possess Knowledge of: Routing &amp; network plan; Delivery scheduling; Vehicle utilization; Inbound &amp; Outbound operations; Department of Transportation guidelines and regulations. To be able to: Use the transport operation documents to manage the operational flow for different load carriers and categories of goods. Analyze capacity of distribution systems, use network analysis methods for planning new network. Ensure optimal utilization of vehicle based on the network requirements considering seasonality and other special situations. Execute the best practices as provided in SOPs and support leaders with gap identification in operations.<br/><br/>Vendor Management : Possess Knowledge of: Stakeholder identification and mapping; Stakeholder analysis; Stakeholder communication; Relevant business metrics and business areas; Stakeholder management tools and methods. To be able to: Collaborate with suppliers and stakeholders to identify and implement innovative ideas. Review the supplier details and assess the capabilities and competencies within the context of business needs and submits recommendations to leadership. Monitor and report on supplier performance and implement strategies to improve supplier performance through negotiation of KPIs and SLAs. Resolve complex vendor issues and escalate to the appropriate level for resolution when necessary.<br/><br/>Coordinates, completes, and oversees job-related activities and assignments by developing and maintaining relationships with key stakeholders; supporting plans and initiatives to meet customer and business needs; identifying and communicating goals and objectives; building accountability for and measuring progress in achieving results; identifying and addressing improvement opportunities; and demonstrating adaptability and promoting continuous learning.<br/><br/>Provides supervision and development opportunities for associates by hiring and training; mentoring; assigning duties; providing recognition; and ensuring diversity awareness.<br/><br/>Ensures compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by implementing related action plans; utilizing and supporting the Open Door Policy; and providing direction and guidance on applying these in executing business processes and practices.", "qualifications": {"required": "Bachelor's Degree in a related field (e.g., Management, Supply Chain, Business Administration, Financial Management, Production/Operations Management) and 1 year experience in an operations/distribution/supply chain/retail environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees. OR 1 year experience as a Walmart Supply Chain Area or Operations Manager supervising, evaluating, mentoring, and developing associates; managing associate workload; and participating in the hiring and promotion of associates OR 1 year experience as a Walmart Supply Chain Load Manager OR 3 years experience in an operations/distribution/supply chain/retail environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees.", "preferred": "Both Bachelor's Degree in a related field (e.g., Management, Supply Chain, Business Administration, Financial Management, Production/OperationsManagement); and 3 years experience in a supply chain environment, supervising, evaluating, mentoring, and developing managers/supervisors; managing workload; and participating in the hiring and promotion of employees., Walmart Supply Chain manager supervising, evaluating, mentoring, and developing associates; managing workload; and participating in the hiring and promotion of associates.<br/><br/>Bachelors: Business, Bachelors: Finance, Bachelors: Logistics, Bachelors: Management, Bachelors: Operations Management"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "At Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.<br/><br/>‎<br/><br/>‎<br/><br/>‎<br/><br/>You will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.<br/><br/>‎<br/><br/>For information about PTO, see https://one.walmart.com/notices .<br/><br/>‎<br/><br/>‎<br/><br/>Live Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.<br/><br/>‎<br/><br/>Eligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.<br/><br/>‎<br/><br/><strong>For Information About Benefits And Eligibility, See One.Walmart .<br/><br/></strong>‎<br/><br/>The annual salary range for this position is $66,560.00-$139,000.00<br/><br/>‎<br/><br/><strong>Additional Compensation Includes Annual Or Quarterly Performance Bonuses.<br/><br/></strong>‎<br/><br/><strong>Additional Compensation For Certain Positions May Also Include<br/><br/></strong>‎<br/><br/><ul><li> Regional Pay Zone (RPZ) (based on location)<br/><br/></li></ul>‎<br/><br/><ul><li> Stock<br/><br/></li></ul>‎<br/><br/>‎<br/><br>", "salary": {"amount": "66,560.00-$139,000.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994094697"}