{"jobTitle": "Buyer/Planner", "company": {"name": "Ormco", "location": "Pomona, CA"}, "location": "Pomona, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$54,500 - $81,700"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Medical Equipment Manufacturing", "description": "The Buyer Planner will plan, release and manage production work orders and purchase orders to fulfill production requirements. Position will also be responsible for monitoring and managing assigned value streams and planner codes including inventory and customer service levels. Will also be responsible for planning finished goods inventory levels for distribution.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Releases and manages production requisitions in accordance with Heijunka level loading, kanban signals, production plan goals and related planning data.</li><li>Places and manages purchases orders in accordance with MRP, Kanban signals, production plan goals and related planning data.</li><li>Works closely with manufacturing and suppliers to prioritize, expedite and de-expedite work orders and purchase orders based on material availability, department resources, changing requirements and customer service requirements.</li><li>Manage the assigned value streams including the management of inventory turns improvement, backorder reduction and coordinating activities with other planner buyers and departments.</li><li>Participates in the new product development process and supports supply chain planning activities at the new product team level.</li><li>Manage, monitor and update Kanbans for assigned value streams and production cells.</li><li>Have strong working knowledge and apply the principles of planning/pull system.</li><li>Have an understanding of lean manufacturing.</li><li>Manage and maintain inventory levels to the company goals at the raw, sub-assembly, WIP and finished good levels.</li><li>Monitors and understands key planning parameters such as safety stocks, buffer stocks and lot sizes.</li><li>Works closely with vendors to manage and control product lines, to prioritize, expedite and assure enough material supply to support customer demand.<br/><br/></li></ul><strong>Required<br/><br/></strong><strong>Job Requirements:<br/><br/></strong><ul><li>Bachelor’s degree (B.S.) in Business, Supply Chain, or Operations or at least 2 years of Buyer/Planner experience in a manufacturing or distribution environment in lieu of education</li><li>Seeking minimum of 2+ year of Buyer/Planner work experience<br/><br/></li></ul><strong>Preferred Skills<br/><br/></strong><ul><li>Strong analytical and mathematical skills</li><li>Strong knowledge of ERP, Kanban and Pull system</li><li>Understanding of production principles and processes</li><li>Strong interpersonal skills and the ability to effectively work with many levels and types of people</li><li>Good written, oral, and presentation skills (Communication)</li><li>Problem solving and solid business decision making skills</li><li>Planning and organizational ability</li><li>Proficient with Microsoft Office applications (Excel, Word, etc.)</li><li>APICS Certification a plus<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>While performing the duties of this Job, the employee is regularly required to sit. The employee is frequently required to walk. The employee is occasionally required to stand. The employee must occasionally lift and/or move up to 10 pounds.</li><li>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/></li></ul>IND123<br/><br/><strong>Target Market Salary Range<br/><br/></strong>Actual compensation packages take into account a wide range of factors that are unique to each candidate, including but not limited to geographic location; skill sets; relevant education and certifications; depth of experience; performance; and other business and organizational needs. The disclosed reasonable estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Envista, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. The total compensation package for this position may also include an annual performance bonus, medical/dental/vision benefits, 401K match, and/or other applicable compensation plans.<br/><br/>$54,500 - $81,700<br/><br/><strong>Operating Company<br/><br/></strong>Ormco<br/><br/>Ormco is a global leader and innovator of high-quality orthodontic products and solutions, including brackets and wires. For more than 60 years, our team has partnered with the orthodontic community to help create over 20 million smiles in more than 140 countries. We build trusted relationships. Each one is rooted in respect and understanding. We take that approach when we help orthodontists achieve their clinical and practice management objectives. We take the same approach when we help our team bring their personal best to work each day, ready to make a difference and reach their full potential.<br/><br/>Envista and all Envista Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The “EEO is the Law” poster is available at: http://www.dol.gov/ofccp/regs/ compliance/posters/pdf/eeopost.pdf.<br/><br/>Envista and its family of companies (Envista) will not accept unsolicited resumes from any source other than directly from a candidate. Envista will consider unsolicited referrals and/or resumes submitted by vendors such as search firms, staffing agencies, professional recruiters, fee-based referral services and recruiting agencies (Agency) to have been referred by the Agency free of charge and Envista will not pay a fee for any placement resulting from the receipt such unsolicited resumes. An Agency must obtain advance written approval from Envista's internal Talent Acquisition or Human Resources team to submit resumes, and then only in conjunction with a valid fully-executed contract approved by the Global Talent Acquisition leader and in response to a specific job opening. Envista will not pay a fee to any Agency that does not have such agreement and written approval in place.", "responsibilities": "The Buyer Planner will plan, release and manage production work orders and purchase orders to fulfill production requirements. Position will also be responsible for monitoring and managing assigned value streams and planner codes including inventory and customer service levels. Will also be responsible for planning finished goods inventory levels for distribution.", "qualifications": {"required": "Bachelor’s degree (B.S.) in Business, Supply Chain, or Operations or at least 2 years of Buyer/Planner experience in a manufacturing or distribution environment in lieu of education\nSeeking minimum of 2+ year of Buyer/Planner work experience", "preferred": "Strong analytical and mathematical skills\nStrong knowledge of ERP, Kanban and Pull system\nUnderstanding of production principles and processes\nStrong interpersonal skills and the ability to effectively work with many levels and types of people\nGood written, oral, and presentation skills (Communication)\nProblem solving and solid business decision making skills\nPlanning and organizational ability\nProficient with Microsoft Office applications (Excel, Word, etc.)\nAPICS Certification a plus"}, "skills": ["ERP", "Kanban", "Pull system", "Communication", "Problem Solving", "Excel", "APICS Certification"], "postedDate": "2 weeks ago", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3994504234"}