{"jobTitle": "Sr. Procurement Analyst", "company": {"name": "Niagara Bottling", "location": "Diamond Bar, CA"}, "location": "Diamond Bar, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "95,301.00/yr - 138,186.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain", "industry": "Food and Beverage Services", "description": "At Niagara, we’re looking for Team Members who want to be part of achieving our mission to provide our customers the highest quality most affordable bottled water.<br/><br/><strong>Consider Applying Here, If You Want To<br/><br/></strong><ul><li>Work in an entrepreneurial and dynamic environment with a chance to make an impact. </li><li>Develop lasting relationships with great people. </li><li>Have the opportunity to build a satisfying career.<br/><br/></li></ul>We offer competitive compensation and benefits packages for our Team Members.<br/><br/>Sr. Procurement Analyst<br/><br/>The Sr. Procurement Analyst is responsible for supporting both tactical and strategic sourcing efforts pertaining to Flexible Packaging spend categories. In addition, this role will lead advanced quantitative analysis, as well as supplier performance and relationship management, identify opportunities to reduce Total Cost of Ownership, and drive forward-facing interactions with cross-functional teams and suppliers.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Assist with raw material category management</li><li>Manage RFP/RFQ process from creation to completion and provide supplier selection recommendations</li><li>Analyze supplier assets, capabilities, and market conditions to effectively manage raw material costs and projects</li><li>Identify opportunities to reduce Total Cost of Ownership (TCO)</li><li>Assist in risk management to ensure raw material supply continuity </li><li>Resolve non-conforming raw material issues</li><li>Develop and present category reports for management</li><li>Provide recommendations for process improvements and performance tracking metrics</li><li>Manage raw material qualification process with Packaging Development / QA</li><li>Work cross-functionally within Niagara (with Manufacturing, Supply Chain, QA, and Replenishment) to accomplish departmental goals and gain support internally</li><li>Drive vendor discussions to achieve best results for Niagara including but not limited to:</li><ul><li>New relationship formation</li><li>Supplier onboarding</li><li>Existing relationship management</li><li>Negotiation</li></ul><li>This position requires travel up to 15%</li><li>Please note this job description is not designed to contain a comprehensive list of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without prior notice.<br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum Qualifications:</li><ul><li>4 Years – Experience in Field or similar manufacturing environment</li><li>4 Years – Experience in Position</li><li>4 Years – Experience managing people/projects<br/><br/></li></ul></ul><ul><li>experience may include a combination of work experience and education</li><li>Preferred Qualifications:</li><ul><li>6 Years– Experience in Field or similar manufacturing environment</li><li>6 Years – Experience working in Position </li><li>6 Years – Experience managing people/projects</li></ul><li>experience may include a combination of work experience and education<br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Quantitative Analysis: skillful in using quantitative analysis to understand business issues.</li><li>Negotiation Skill: skilled in negotiating tactics, effective in utilizing analysis and creative solutions to extract the greatest value for the company.</li><li>Influence: can influence and persuade other people, even without direct authority.</li><li>Political Skill: knows how to get things done within the political framework of an organization.</li><li>Advanced knowledge of and experience with Microsoft Excel and Power Point<br/><br/></li></ul>This position embodies the values of Niagara’s LIFE competency model, focusing on the following key drivers of success:<br/><br/><ul><li>Lead Like an Owner</li><ul><li>Makes safety the number one priority</li><li>Keeps alert for safety issues and escalates immediately</li><li>Effectively prioritizes tasks based on department goals</li><li>Shows respect to others and confronts interpersonal issues directly</li><li>Prioritizes resolution of customer issues effectively</li><li>Responds promptly and honors commitments to internal and external customers</li></ul><li>InnovACT</li><ul><li>Makes recommendations to continuously improve policies, methods, procedures, and/or products</li><li>Demonstrates adaptability by reacting appropriately to unexpected changes in situations or circumstances</li><li>Increases performance through greater efficiency</li></ul><li>Find a Way</li><ul><li>Seeks to develop technical knowledge through learning from other experts</li><li>Understands interdepartmental impact of individual decisions and actions</li><li>Seeks solutions rather than placing blame</li></ul><li>Empowered to be Great</li><ul><li>Consistently looks for ways to improve one’s self through growth and development opportunities</li><li>Communicates clearly and promptly up, down, and across</li><li>Communicates effectively to manage expectation<br/></li></ul></ul><strong>Education<br/><br/></strong><ul><li>Minimum Required:</li><ul><li>Bachelor's Degree in Business Administration or other related field<br/><br/></li></ul></ul><ul><li>Preferred:</li><ul><li>Master's Degree in Business Administration or other related field<br/></li></ul></ul><strong>Typical Compensation Range<br/><br/></strong>Pay Rate Type: Salary<br/><br/>$95,301.00 - $138,186.00 / Yearly<br/><br/><strong>Benefits<br/><br/></strong>https://careers.niagarawater.com/us/en/benefits<br/><br/><strong>Any employment agency, person or entity that submits a résumé into this career site or to a hiring manager does so with the understanding that the applicant's résumé will become the property of Niagara Bottling, LLC. Niagara Bottling, LLC will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity.<br/><br/></strong><strong>Employment agencies that have fee agreements with Niagara Bottling, LLC and have been engaged on a search shall submit résumé to the designated Niagara Bottling, LLC recruiter or, upon authorization, submit résumé into this career site to be eligible for placement fees.<br/><br/></strong>Niagara Plant Name<br/><br/>CORP-MAIN", "responsibilities": "The Sr. Procurement Analyst is responsible for supporting both tactical and strategic sourcing efforts pertaining to Flexible Packaging spend categories. In addition, this role will lead advanced quantitative analysis, as well as supplier performance and relationship management, identify opportunities to reduce Total Cost of Ownership, and drive forward-facing interactions with cross-functional teams and suppliers.", "qualifications": {"required": "4 Years – Experience in Field or similar manufacturing environment\n4 Years – Experience in Position\n4 Years – Experience managing people/projects", "preferred": "6 Years– Experience in Field or similar manufacturing environment\n6 Years – Experience working in Position \n6 Years – Experience managing people/projects"}, "skills": ["Quantitative Analysis", "Negotiation Skill", "Influence", "Political Skill", "Microsoft Excel", "Power Point"], "postedDate": "2 weeks ago", "benefits": "https://careers.niagarawater.com/us/en/benefits", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994780622"}