{"jobTitle": "Coordinator, Physical Production", "company": {"name": "Paramount Pictures", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "This position is responsible for assisting the physical production department.<br/><br/>Responsibilities to include, but not limited to:<br/><br/><ul><li>Assists with physical production of assigned projects in development, pre-production and production stages</li><li>Assists with developing a preliminary production plan, including schedule, location and budget considerations</li><li>Prepares department head availability lists and solicits location photo packages from regional, state and national film commissions</li><li>Papers department head deals, including Unit Production Manager, Director of Photography, Production Designer and Costume Designer</li><li>Acts as a liaison between the production and the studio departments including creative, finance, legal, labor relations, visual effects, and post production</li><li>Distributes daily production documents, mail and maintains office supplies</li><li>Manages executive’s schedule, including coordinating daily meetings and appointments</li><li>Arranges complex travel plans and itineraries, compiles documents for travel-related meetings</li><li>Answers and screens a high volume of phone calls and email, taking action when appropriate and following up</li><li>Arranges programs, events, or conferences by booking facilities, issuing information or invitations, coordinating speakers, and controlling event budget</li><li>Directs preparation of records such as agenda, notices, minutes, and resolutions for corporate meetings</li><li>Acts as custodian of corporate documents and records</li><li>Composes and prepares confidential correspondence, reports, and other documents such as expense reports</li><li>Creates and maintains databases and spreadsheet files</li><li>Performs additional administrative duties such as filing, typing, and copying documents<br/><br/></li></ul><strong>Qualifications/skills<br/><br/></strong>Basic qualifications:<br/><br/><ul><li>Minimum 3 years related experience</li><li>Proficiency with Word, Excel, PowerPoint and internet platforms<br/><br/></li></ul>Desired Skills:<br/><br/><ul><li>Bachelor’s Degree preferred</li><li>Excellent written, verbal, and interpersonal skills with the ability to interface with staff, other administrators, internal and external customers and senior management</li><li>Familiar with a variety of industry concepts, practices, and procedures</li><li>Organized and detail oriented with the ability to manage multiple high priorities<br/><br/></li></ul>Eligibility requirements:<br/><br/><ul><li>Interested candidates must submit a resume/CV online to be considered</li><li>Must be willing to submit to a background investigation</li><li>Must have unrestricted work authorization to work in the United States<br/><br/></li></ul>Founded in 1912, Paramount Pictures works with talented filmmakers to produce and distribute entertainment around the world. The film studio’s iconic logo has opened some of the most successful and beloved films in cinematic history, including timeless classics such as The Godfather, Chinatown, Forrest Gump and Titanic; and blockbuster franchises such as Star Trek, Transformers, Mission: Impossible and Sonic the Hedgehog. Recent, innovative, break-out films such as The Wolf of Wall Street, Arrival, Rocketman, and A Quiet Place have added to Paramount’s film legacy. With a beautiful 65-acre lot in the heart of Hollywood, a worldwide network of offices and a culture of engagement, Paramount Pictures’ passionate employees ensure the studio continues to deliver creativity and innovation to a dynamic industry. Paramount Pictures controls a collection of some of the most powerful brands in filmed entertainment, including Paramount Pictures, Paramount Animation, and Paramount Players. PPC operations also include Paramount Home Entertainment, Paramount Pictures International, Paramount Licensing Inc., and Paramount Studio Group. Paramount Pictures is a subsidiary of Paramount, which connects with billions of people worldwide through its global brands including MTV, CBS, Paramount Network, Nickelodeon, Comedy Central, BET and streaming service Paramount+.<br/><br/><strong>Additional Information<br/><br/></strong>Hiring Salary Range: $50,000.00 - 60,000.00.<br/><br/>The hiring salary range for this position applies to New York, California, Colorado, Washington state, and most other geographies. Starting pay for the successful applicant depends on a variety of job-related factors, including but not limited to geographic location, market demands, experience, training, and education. The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, disability benefits, tuition assistance program and PTO or, if applicable, as otherwise dictated by the appropriate Collective Bargaining Agreement.<br/><br/>https://www.paramount.com/careers/benefits<br/><br/>Paramount is an equal opportunity employer (EOE) including disability/vet.<br/><br/>At Paramount, the spirit of inclusion feeds into everything that we do, on-screen and off. From the programming and movies we create to employee benefits/programs and social impact outreach initiatives, we believe that opportunity, access, resources and rewards should be available to and for the benefit of all. Paramount is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, and Veteran status.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access https://www.paramount.com/careers as a result of your disability. You can request reasonable accommodations by calling 212.846.5500 or by sending an email to paramountaccommodations@paramount.com. Only messages left for this purpose will be returned.", "responsibilities": "This position is responsible for assisting the physical production department.<br/><br/>Responsibilities to include, but not limited to:<br/><br/><ul><li>Assists with physical production of assigned projects in development, pre-production and production stages</li><li>Assists with developing a preliminary production plan, including schedule, location and budget considerations</li><li>Prepares department head availability lists and solicits location photo packages from regional, state and national film commissions</li><li>Papers department head deals, including Unit Production Manager, Director of Photography, Production Designer and Costume Designer</li><li>Acts as a liaison between the production and the studio departments including creative, finance, legal, labor relations, visual effects, and post production</li><li>Distributes daily production documents, mail and maintains office supplies</li><li>Manages executive’s schedule, including coordinating daily meetings and appointments</li><li>Arranges complex travel plans and itineraries, compiles documents for travel-related meetings</li><li>Answers and screens a high volume of phone calls and email, taking action when appropriate and following up</li><li>Arranges programs, events, or conferences by booking facilities, issuing information or invitations, coordinating speakers, and controlling event budget</li><li>Directs preparation of records such as agenda, notices, minutes, and resolutions for corporate meetings</li><li>Acts as custodian of corporate documents and records</li><li>Composes and prepares confidential correspondence, reports, and other documents such as expense reports</li><li>Creates and maintains databases and spreadsheet files</li><li>Performs additional administrative duties such as filing, typing, and copying documents<br/><br/></li></ul>", "qualifications": {"required": "Minimum 3 years related experience\nProficiency with Word, Excel, PowerPoint and internet platforms", "preferred": "Bachelor’s Degree preferred\nExcellent written, verbal, and interpersonal skills with the ability to interface with staff, other administrators, internal and external customers and senior management\nFamiliar with a variety of industry concepts, practices, and procedures\nOrganized and detail oriented with the ability to manage multiple high priorities"}, "skills": ["Word", "Excel", "PowerPoint", "Internet"], "postedDate": "2 weeks ago", "benefits": "The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, disability benefits, tuition assistance program and PTO or, if applicable, as otherwise dictated by the appropriate Collective Bargaining Agreement.", "remoteWork": "No", "salary": {"amount": "50,000.00 - 60,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3994460485"}