{"jobTitle": "Media Analyst/BA", "company": {"name": "Pyramid Consulting, Inc", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "Immediate need for a Media Analyst/BA for a position in the IT Industry. This is 06+ month’s contract opportunity with long-term potential located in El Segundo, CA. Please review the job description below:<br/><br/>Job ID: 18-06998<br/><br/>Key Responsibilities:/Key Requirements and Technology Experience:<br/><br/><ul><li>Bachelor's degree (Engineering, Computer Science), Master's degree preferred</li><li>8+ years relevant experience working in the Entertainment &amp; Media industry. </li><li>Experience in entertainment &amp; media industry with delivering video using broadcast &amp; broadband/cellular streaming mechanism</li><li>Experience in Broadcast/broadband Television, Video-On-Demand, Pay Per View</li><li>Experience working as architect defining the roadmap and strategy for adaptive streaming delivery in encrypted domain to mobile and household devices. </li><li>Experience in coming up with high-level architectural design and technology roadmaps</li><li>Understanding of latest trends and technologies for internet streaming video and audio</li><li>Excellent problem solving, critical thinking and analytical skills, with strong interpersonal skills with a proven ability to collaborate without guidance</li><li>Leadership qualities, including ability to facilitate technical discussions with diverse and cross-functional groups and good negotiation skills.Ability to influence others with ideas and proposed architecture options</li><li>Excellent verbal and written communication skills, including ability to tailor communication to the target audience to achieve desired resu<br/><br/></li></ul>lts.<br/><br/>Our client is a leading IT Industry and we are currently interviewing to fill this and other similar contract positions. Qualified candidates should apply online for immediate consideration.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994150325"}