{"jobTitle": "Senior Business and Digital Analyst", "company": {"name": "Ergobaby", "industry": "Wholesale and Online and Mail Order Retail", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Marketing, Sales, and Management", "industry": "Wholesale and Online and Mail Order Retail", "description": "We are looking for an experienced and highly analytical Senior Business and Digital Analyst to play an important role in shaping our data-driven strategy. This position calls for an independent thinker with a knack for transforming complex data into actionable business insights. The ideal candidate will have the autonomy to drive initiatives while fostering a data-centric approach across the organization, especially in collaboration with our growth marketing initiatives. This role reports to our global head of marketing.", "responsibilities": "Design and execute in-depth analyses of data from paid advertising (meta, google, tiktok, influencers), organic social media, e-commerce platforms, GA4, and other key sources. Develop and refine SQL queries for efficient data extraction from our databases. Construct insightful dashboards and reports in Qlik to visualize data clearly and support decision-making at all levels. Proactively identify trends, patterns, and opportunities within the data, formulating strategic recommendations to enhance business performance. Work closely with our Growth Marketing Leader to analyze marketing spend, identify areas for optimization, and drive greater efficiency in campaigns. Collaborate with cross-functional teams (marketing, sales, product, etc.) to share insights, align strategies, and measure the impact of business initiatives. Champion the use of data analytics throughout the company, advocating for data-informed decision-making. Mentor and train other team members on analytics, sharing your expertise and setting best practices.", "qualifications": {"required": "Master's degree in Business, Marketing, Data Science, or a related field preferred; 5+ years of hands-on experience as a business or digital analyst, demonstrating progression in skills and leadership; Deep expertise in social media analytics, e-commerce analytics, and GA4, with a focus on marketing performance analytics; Strong analytical skills and the ability to translate complex data into compelling recommendations; Outstanding communication and presentation abilities, tailoring reports and recommendations to various stakeholders; Advanced SQL proficiency; Proven experience managing and utilizing Qlik for business intelligence; Strong self-direction and motivation; comfortable setting priorities and managing projects independently.", "preferred": "Not specified"}, "skills": ["Data Analysis", "SQL", "Marketing Analytics", "Business Intelligence", "Dashboard Creation", "Data Visualization", "Communication", "Mentoring"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Flexible work-from-home; Competitive salary and benefits package; Be a key player in a growing and innovative company; High degree of autonomy to structure your work and drive impactful projects; Opportunity to collaborate closely with global company leadership.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3994371743"}