{"jobTitle": "Production Coordinator Intern", "company": {"name": "Cosm", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "Cosm is a global technology company that brings experiences to life in immersive environments. We help our partners create spaces and content that blur the lines of real and virtual across three primary markets: Sports and Entertainment, Science and Education, and Parks and Attractions. Cosm was born from the fusion of some of the greatest innovators in the history of technology. Evans & Sutherland, Spitz, Inc., and Cosm Immersive combined forces to power the immersive experiences of the future as Cosm. Innovation is in our DNA.<br/><br/><strong>Summary<br/><br/></strong>As a Production Coordinator for Immersive Production, you will play a vital role in supporting all aspects of production management. These productions take place all across the US and internationally and are viewed live by fans in our domes. You will assist in the coordination of crew, equipment and travel as well as preparing documentation to facilitate theses productions<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Coordinating Crew: Schedule and coordinate crew members for immersive productions, ensuring all roles are filled with qualified personnel.</li><li> Booking Travel: Arrange travel logistics for crew members and equipment to event locations, ensuring timely and cost-effective arrangements.</li><li> Tracking Equipment: Manage inventory of equipment, ensuring availability, maintenance, and proper deployment for productions.</li><li> Organizing Meetings: Schedule and organize meetings, including production planning sessions, briefings, and debriefings.</li><li> Preparing Production Documentation: Assist in preparing production documents such as call sheets, production schedules, and project status reports.<br/><br/></li></ul><strong>All Internships Include<br/><br/></strong><ul><li> Gain hands-on experience with projects that contribute directly to company goals &amp; building your resume. </li><li> Gain valuable access to Cosm leadership, including our CEO. </li><li> Build your network by connecting with other interns, your intern buddy , teammates and leaders from across the organization. </li><li> Join career skill training sessions on best practices for job applications, recruiting and interviewing. </li><li> Advance your presentation and planning skills. </li><li> An opportunity to win the \"Cosm Education &amp; Career Advancement Award,\" which is a monetary consideration to further your education and expand your opportunities. </li><li> Competitive pay </li><li> Access to three immersive events of your choosing <br/><br/></li></ul>The hourly pay rate for this position is $16.90.<br/><br/>Cosm is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/>Apply Now", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994007713"}