{"jobTitle": "Partnerships Marketing Manager", "company": {"name": "Cypress HCM", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Advertising", "industry": "Broadcast Media Production and Distribution and Entertainment Providers", "description": "<strong><u>Manager, International Marketing Partnerships</u></strong><br/><strong>Job Summary</strong><br/>This position is responsible for assisting in securing and activating global, regional and local international partnerships in support of our theatrical releases.<br/><strong>Responsibilities:</strong><br/>• Support and/or lead efforts to procure then manage global and regional deals from ideation and negotiation to creative activation. <br/>• Support partnership procuring, vetting and activation efforts for 60+ markets around the world from ideation to execution of global and international partners including TV, radio, retail packaging and point of sale, out of home, digital campaigns, social media activations, print, influencer programs, etc. <br/>• Support international territories by assisting in developing pitch strategy and materials, providing creative direction, feedback and support as needed.<br/>• Build and review creative timeline templates, acquire, and review external partners’ submission schedules to ensure adequate time to implement, and track deadlines for campaigns from beginning to end. <br/>• Review creative submissions and acquire feedback/approvals from internal and external stakeholders. <br/>• Work closely with legal to ensure all partner and deal agreements, contracts and NDAs are in order.<br/>• Ensure all external partner creative submissions are saved, organized, and updated within departmental databases.<br/>• Coordinate and conduct weekly update calls with select partners to ensure deadlines are met, relationships are maintained, and call recaps are generated and shared as directed.<br/>• Oversee and contribute to departmental promotional and marketing guidelines, status reports, etc. <br/>• Oversee and lead detailed partnership activation budgets for team including overseeing purchase orders and payment processes via SAP and Ariba. <br/>• Secure and distribute film assets such as trailers, sizzles, logos, posters, stills, and key art to internal team and external partners with necessary security and water-mark requirements. <br/>• Create dynamic themed prize packages as a tool to assist in partnership procurement and activation and facilitate fulfillment for external partner’s prizing/sweepstakes as needed.<br/>• Develop elevated promotional merchandise as a tool to assist in partnership procurement and activation and facilitate fulfillment for external partner’s prizing as needed. <br/>• Manage promotional merchandise shipping timelines and tracking for 60+ markets. <br/>• Create case studies and supportive promotional reports and documents. <br/>• Work cross-divisionally with various marketing teams where relevant (e.g. publicity, digital, creative, legal, etc.) to amplify promotional programs. <br/>• Book corporate/advance screenings and handle other creative deliverables based on our contractual obligations. <br/>• Create wrap reports for leadership teams that showcase completed partnerships through Keynote and PowerPoint. <br/>• Manage the professional growth and development of international partnerships intern (summer or fall).<br/><strong>Requirements:</strong><br/>• 3 years- Brand partnership marketing - In the entertainment or media sector<br/>• Experience working in a fast paced environment<br/>• Experience with Global market place- should have global or international experience<br/>• Must have Presentation expertise- PowerPoint, keynote, deck creation etc.<br/><strong>Compensation: </strong><br/>• $27.00/hour - $36.00/hour<br/><strong><em>Req# PPCJP00000401</em></strong>", "postedDate": "1 week ago", "salary": {"amount": "27.00/hour - 36.00/hour", "currency": "USD"}, "skills": ["Brand Partnership Marketing", "Entertainment", "Media", "Global Market", "PowerPoint", "Keynote"], "url": "https://www.linkedin.com/jobs/view/3994367269"}