{"jobTitle": "Receptionist/EA support", "company": {"name": "Vaco", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "22.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Environmental Services", "description": "Vaco is working with a client in the Entertainment industry who is looking for a Receptionist/EA support member to help join there team. Key job responsibilities will include front office support, supporting multiple executives busy calendars, and answering and directing phone calls. This opportunity will be temp, possible temp to hire and is looking to pay between $22-$26/hr depending on experience. This opportunity is located in the West LA area and is full in office. This opportunity provides and excellent company culture, great opportunity for growth, and an excellent work life balance. If you are interested and can start ASAP please apply today! Job Responsibilities:<br/><br/><ul><li>Heavy calendar and scheudle managment for multiple busy executives </li><li>Handling all expense reporting </li><li>Ordering all office supplies </li><li>Greet and welcome guests as soon as they arrive at the office</li><li>Answer, screen and forward incoming phone calls</li><li>Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures)<br/><br/></li></ul><strong>Qualifications:</strong><ul><li>Proven experience supporting multiple executives </li><li>Proven work experience as a Receptionist, Front Office Representative or similar role</li><li>Bachelors Degree preferred </li><li>Proficiency in Microsoft Office Suite</li><li>Ability to be flexible and adaptable</li><li>Need to be both an in-person and phone presence</li><li>Customer service orientations</li></ul>", "responsibilities": "Heavy calendar and scheudle managment for multiple busy executives, Handling all expense reporting, Ordering all office supplies, Greet and welcome guests as soon as they arrive at the office, Answer, screen and forward incoming phone calls, Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures)", "qualifications": {"required": "Proven experience supporting multiple executives, Proven work experience as a Receptionist, Front Office Representative or similar role, Proficiency in Microsoft Office Suite, Ability to be flexible and adaptable, Need to be both an in-person and phone presence, Customer service orientations", "preferred": "Bachelors Degree"}, "skills": ["Microsoft Office Suite"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994375974"}