{"jobTitle": "Procurement Specialist", "company": {"name": "Relativity Space", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "80,000—$102,000 USD", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Company Overview<br/><br/></strong>At Relativity Space, we have two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. Both contribute to our long-term vision of creating humanity’s industrial base on Mars, paving the way for interplanetary life to expand the possibilities of the human experience. This journey begins right here on Earth – where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity, thanks to our iterative approach that accelerates design, testing, and development while minimizing costs. While our groundbreaking research and development in 3D printing pushes the boundaries of large-scale additive manufacturing.<br/><br/>Your journey with us is more than just a job – it’s an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate, creative individuals. Join us on this extraordinary journey, as we work together to transform our vision into reality.<br/><br/><strong>About The Team<br/><br/></strong>Supply Chain at Relativity encompasses direct supply management for all Terran-R parts and materials, indirect supply management for the Long Beach site, and materials management. Put simply, we own the value chain from identification of a need to delivery to our internal customer. The Supply Chain team’s vision is to build a best-in-class, responsive, and data-driven supply chain management organization that is a key competitive advantage for Relativity. Supply Chain is currently putting that vision into practice through sourcing long-lead parts, production equipment, and infrastructure projects for Terran R production. We have had numerous accomplishments with high-dollar, impactful projects by collaborating closely with finance, manufacturing, and engineering to deliver excellent value and keep our aggressive Terran R schedule on track.<br/><br/><strong>About The Role<br/><br/></strong><ul><li>Process purchase requests into purchase orders in the ERP system in a timely, efficient manner.</li><li>Collaborate with internal stakeholders to gather comprehensive procurement requirements and translate into Requests for Quote and Purchase Orders.</li><li>Manage end-to-end RFx process in partnership with applicable stakeholders to identify top suppliers for a given need, drive competition within a given supply market, and maximize value creation for the procurement activity.</li><li>Negotiate pricing, lead time, terms and conditions, and more, to holistically drive the best outcome for the business.</li><li>Lead end-to-end purchase order management and invoice issue disposition to ensure on-time delivery of product or services and on-time payment of invoices.</li><li>Resolve any and all procurement-related issues that arise during the life cycle of an order.</li><li>Under the lead of Category Managers, own supplier relationships to build strong partnerships and continually deliver more value to Relativity.<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>Bachelor’s degree in Supply Chain/Operations Management, Business Administration, or similar.</li><li>Knowledge of enterprise applications (i.e., PLM, ERP, MES) and data analysis applications/tools (i.e., MS Excel, SQL, Tableau).</li><li>Experience working in a procurement role within a fast-paced manufacturing, supply chain, or engineering function.<br/><br/></li></ul><strong>Nice To Haves But Not Required<br/><br/></strong><ul><li>Experience vetting terms, conditions, and contracts associated with purchases.</li><li>Experience writing Statements of Work, Requests for Quote/Proposals.<br/><br/></li></ul><strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></strong>At Relativity Space, we are committed to transparency and fairness in our compensation practices. Actual compensation will be determined based on experience, qualifications, and other job-related factors.<br/><br/>Compensation is only one part of our total rewards package. Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more! To see some of the benefits &amp; perks we offer, please visit here.<br/><br/><strong>Hiring Range<br/><br/></strong>$80,000—$102,000 USD", "responsibilities": "<ul><li>Process purchase requests into purchase orders in the ERP system in a timely, efficient manner.</li><li>Collaborate with internal stakeholders to gather comprehensive procurement requirements and translate into Requests for Quote and Purchase Orders.</li><li>Manage end-to-end RFx process in partnership with applicable stakeholders to identify top suppliers for a given need, drive competition within a given supply market, and maximize value creation for the procurement activity.</li><li>Negotiate pricing, lead time, terms and conditions, and more, to holistically drive the best outcome for the business.</li><li>Lead end-to-end purchase order management and invoice issue disposition to ensure on-time delivery of product or services and on-time payment of invoices.</li><li>Resolve any and all procurement-related issues that arise during the life cycle of an order.</li><li>Under the lead of Category Managers, own supplier relationships to build strong partnerships and continually deliver more value to Relativity.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in Supply Chain/Operations Management, Business Administration, or similar.\nKnowledge of enterprise applications (i.e., PLM, ERP, MES) and data analysis applications/tools (i.e., MS Excel, SQL, Tableau).\nExperience working in a procurement role within a fast-paced manufacturing, supply chain, or engineering function.", "preferred": "Experience vetting terms, conditions, and contracts associated with purchases.\nExperience writing Statements of Work, Requests for Quote/Proposals."}, "skills": ["Supply Chain", "Operations Management", "Business Administration", "PLM", "ERP", "MES", "Data Analysis", "MS Excel", "SQL", "Tableau", "Procurement", "Manufacturing", "Engineering"], "postedDate": "2 weeks ago", "benefits": "Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994081001"}