{"jobTitle": "Senior Manager, Human Resources Business Partner (HRBP)", "company": {"name": "Arcadia", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Wholesale Building Materials", "description": "We are looking for a Senior Manager, Human Resources Business Partner (HRBP) to join our team and provide strategic and operational support to our employees and managers. As an Senior Manager, HRBP, you will act as a liaison between the HR department and the business, aligning HR initiatives and programs with business goals and objectives. You will also advise and coach managers and employees on various HR matters, such as performance management, talent development, employee relations, compensation, and benefits.", "responsibilities": "In partnership with the VP of Human Resources, develop and implement HR strategies aligned with the organization's goals.\nMentor, inspire, facilitate professional development, and training certification activities for HR team, act as backup to team as necessary.\nPartner with business leaders and managers to understand their needs and challenges and provide effective HR solutions.\nDevelop, implement and monitor HR policies, procedures, and programs in compliance with the company's values, culture, and legal requirements.\nLead continuous process improvement activities for efficiency.\nFacilitate employee engagement, retention, and development initiatives, such as feedback surveys, recognition programs, career paths, and learning opportunities.\nManage and resolve complex employee relations issues, such as conflicts, grievances, and disciplinary actions, in a timely and consistent manner.\nSupport the performance management process, including goal setting, conducting appraisals, providing feedback, and coaching.\nAssist with the talent acquisition process, including sourcing, screening, interviewing, and onboarding candidates, as needed.\nAnalyze HR data and metrics and provide insights and recommendations to business leaders and managers.\nStay updated on the latest HR trends, best practices, and legal regulations and ensure compliance across the organizations.", "qualifications": {"required": "Bachelor's degree in Human Resources, Business Administration, or a related field.\nAt least 7+ years of experience as an HR Business Partner, Generalist, or a similar role in a fast-paced and dynamic environment.\nStrong knowledge of HR functions, such as talent management, employee relations, compensation, and benefits.\nExcellent communication, interpersonal, and influencing skills, with the ability to build trust and rapport with diverse stakeholders.\nProven problem-solving, analytical, and decision-making skills, with the ability to handle complex and sensitive situations.\nHigh level of professionalism, integrity, and confidentiality.\nProficient in Microsoft Office and HR software, such as ADP Workforce Now.", "preferred": "SHRM-CP, SHRM-SCP, PHR, or SPHR certification is a plus.\nFamiliarity with multi-site and multi-state operations is preferred along with willingness to travel up to 15%.\nFluency in English is a must; Spanish fluency is highly preferred."}, "skills": ["HR", "Human Resources", "Talent Management", "Employee Relations", "Compensation", "Benefits", "Communication", "Interpersonal Skills", "Influencing Skills", "Problem Solving", "Analytical Skills", "Decision Making", "Professionalism", "Integrity", "Confidentiality", "Microsoft Office", "ADP Workforce Now", "SHRM-CP", "SHRM-SCP", "PHR", "SPHR", "Multi-site Operations", "Multi-state Operations", "Travel", "English", "Spanish"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994894343"}