{"jobTitle": "Human Resources Manager", "company": {"name": "Career Group Companies", "location": "Santa Monica, CA", "industry": "Financial Services and Venture Capital and Private Equity Principals"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "140,000.00/yr - 170,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Financial Services", "description": "Our client, a prestigious financial services firm, is looking for an HR Manager to join their team. In this role, you will support day-to-day Human Resources operations and beyond. As the HR Manager, you will take on a pivotal leadership position, overseeing junior staff and driving the implementation of HR strategies, policies, and initiatives that align with the company’s mission. The ideal candidate will be an organized and strategic thinker, capable of managing both high-level planning and hands-on HR functions. Experience in the financial services sector or professional services is preferred. This position requires daily on-site presence in a beautiful office in Santa Monica.", "responsibilities": "Employee Relations: Address and manage employee relations issues, fostering a positive work environment.Liaison with Management and Departments: Collaborate with upper management (COO and Head of Compliance) and heads of departments (Accounting, IT, Legal, etc.) on HR initiatives and policy development.Expansion Support: Provide and oversee support for company expansion initiatives, ensuring HR practices align with growth.Manage Junior Staff: Supervise junior administrators and other junior employees, providing guidance and support.Oversee Onboarding and Termination: Handle the onboarding and termination processes, ensuring a smooth transition for all employees.Training and Policy Development: Develop employee training materials and handbooks, and enforce company policies to ensure compliance and consistency.Benefits Administration: Serve as the primary point of contact for employee benefits programs, managing and communicating benefits-related information.Recruitment Coordination: Work with recruiters to address and support urgent recruiting needs and initiatives.", "qualifications": {"required": "7-10 Years of HR Experience: Proven track record with 7-10 years in Human Resources, demonstrating progressive responsibility and expertise.Bachelor’s Degree: A relevant bachelor’s degree is required.Industry Experience: Experience in the financial services sector or a professional corporate environment is essential.Knowledge of Benefits and Employment Law: Strong understanding of benefits administration and employment law.Expertise in HR Policies: In-depth knowledge of HR policies, procedures, and best practices.Communication Skills: Excellent communication and interpersonal skills, with the ability to effectively interact with all levels of staff.Problem-Solving Abilities: Proficient in navigating and resolving complex HR challenges with discretion and professionalism.Attention to Detail: Strong attention to detail and accuracy in all aspects of HR management.Confidentiality: Expertise in handling sensitive and confidential information with the highest level of discretion.Adaptability: Ability to thrive in a fast-paced environment with shifting priorities.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994340783"}