{"jobTitle": "Operations Assistant", "company": {"name": "Bloom Ads Global Media Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "45K a year", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Advertising Services", "description": "Job Description<br/><br/>Position: Operations Assistant<br/><br/>An Operations Assistant plays a vital role in ensuring the smooth functioning of an organization by providing administrative and logistical support to various departments. The Operations Assistant will provide administrative support to various departments, assist in coordinating daily operations, and ensure the smooth running of business activities.<br/><br/>Responsibilities:<br/><br/><ul><li>Administrative Support:</li><li>Manage and organize (electronic and hard copy) paperwork, files/folders, documents, and calendars. </li><li>Handle incoming and outgoing correspondence, including emails, phone calls, and mail. </li><li>Assist in preparing reports, presentations, and other documents as required. </li><li>Maintain office supplies inventory and organization. </li><li>Office space upkeep. Ensure all shared spaces are clean and organized, including trash overflow and recycling bins. </li><li> Logistical Support:</li><li>Schedule and coordinate meetings, appointments, and travel arrangements for staff. </li><li>Coordinate logistical aspects of events, conferences, and workshops. </li><li>Arrange transportation and accommodations for staff and visitors when needed. </li><li>Ensure that facilities and equipment are well-maintained and in working order. </li><li> Data Entry and Record Keeping:</li><li>Input data into databases, spreadsheets, and other digital platforms accurately and efficiently. </li><li>Maintain records of expenses, invoices, receipts, and other financial documents. </li><li>Organize and maintain electronic and hard copy filing systems. </li><li> Communication and Coordination:</li><li>Liaise with internal departments and external partners to facilitate communication and collaboration. </li><li>Communicate effectively with team members to relay information, updates, and instructions. </li><li>Assist in coordinating projects and tasks to ensure deadlines are met. </li><li> Other Duties:</li><li>Provide general support to management and staff as needed. </li><li>Handle special projects and assignments as assigned by supervisors. </li><li>Contribute to the overall efficiency and effectiveness of operations through proactive problem-solving and teamwork. <br/><br/></li></ul>This job description outlines the general duties and qualifications expected of an Operations Assistant. Specific responsibilities may vary depending on the organization's size, industry, and structure.<br/><br/>Qualifications:<br/><br/><ul><li>High school diploma or equivalent; associate or bachelor's degree preferred. </li><li>Proven experience in an administrative or operations support role. </li><li>Proficiency in Microsoft Office suite (Word, Excel, PowerPoint, Outlook) and other relevant software applications. </li><li>Strong organizational skills with the ability to multitask and prioritize workload. </li><li>Excellent communication and interpersonal skills. </li><li>Attention to detail and accuracy in work. </li><li>Ability to work independently with minimal supervision and as part of a team. </li><li>Flexibility and adaptability to changing priorities and tasks. </li><li>Knowledge of basic office equipment and procedures<br/><br/></li></ul>Compensation: $45K a year <br/><br/>This is the pay range Bloom Ads reasonably expects it will pay for this position at the time of this posting. Consistent with applicable law, compensation will be determined based on the level of experience, relevant skills, professional certifications, market pay, and demand for the role. Bloom Ads reserves the right to modify this pay range at any time.<br/><br/>Company Description<br/><br/>About the Company:<br/><br/>Bloom offers an agency life in a family-oriented environment. And don’t worry... it’s not all about the work. We also love to play. Our culture prides itself not only on insight, innovation, and results but also on growing and expanding our breadth of knowledge through fun team-building activities. The position offers competitive compensation and full benefits. To apply, please send your resume, cover letter, and salary requirements to hr@bloomads.com.<br/><br/>Bloom will invest in you, your wellness, and your future.<br/><br/>Full medical benefits, including health, dental and vision coverage<br/><br/>Generous vacation policy<br/><br/>12 Paid Holidays + WFH Fridays (workday ends at 2 pm)<br/><br/>Company contribution to employee 401(K)<br/><br/>Company-paid volunteer hours<br/><br/>Professional development program<br/><br/>Extras<br/><br/>Free snacks (mostly healthy)<br/><br/>Sundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat<br/><br/>Monthly lunch and learns<br/><br/>Quarterly town hall meetings with lots of food and prizes<br/><br/>Team parties and celebrations<br/><br/>Responsible for developing best-in-class media solutions. In a widely disparate advertising landscape, we leverage best-in-class strategy, technology and analytics to deliver the most comprehensive, highest-performing media solutions on the market. We provide extensive expertise for some of the best and brightest brands across our agency partner landscape. Headquartered in Los Angeles, California, Bloom operates in 100+ markets worldwide.<br/><br/>We are a fast-paced, risk-taking, close-knit environment where ideas come from everywhere at every level. We believe that diversity of background, talent, skillset and mindset create a flourishing environment for new thinking and ideas. Our business is growing and we are always looking for new talent. If you are driven by challenging work, passionate about media and technology and interested in helping to shape the future of our industry, we would like to hear from you!<br/><br/>Note: Travel to and from client and vendor sites in a personal vehicle may be required in this position. The preceding functions have been provided as the types of work performed by the employees assigned to this job classification. Management reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job. This job description does not promise or imply that the functions listed are the only duties to be performed or that the position may not change or be eliminated.<br/><br/>About the Company: Bloom offers an agency life in a family-oriented environment. And don’t worry... it’s not all about the work. We also love to play. Our culture prides itself not only on insight, innovation, and results but also on growing and expanding our breadth of knowledge through fun team-building activities. The position offers competitive compensation and full benefits. To apply, please send your resume, cover letter, and salary requirements to hr@bloomads.com. Bloom will invest in you, your wellness, and your future. Full medical benefits, including health, dental and vision coverage Generous vacation policy 12 Paid Holidays + WFH Fridays (workday ends at 2 pm) Company contribution to employee 401(K) Company-paid volunteer hours Professional development program Extras Free snacks (mostly healthy) Sundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat Monthly lunch and learns Quarterly town hall meetings with lots of food and prizes Team parties and celebrations Responsible for developing best-in-class media solutions. In a widely disparate advertising landscape, we leverage best-in-class strategy, technology and analytics to deliver the most comprehensive, highest-performing media solutions on the market. We provide extensive expertise for some of the best and brightest brands across our agency partner landscape. Headquartered in Los Angeles, California, Bloom operates in 100+ markets worldwide. We are a fast-paced, risk-taking, close-knit environment where ideas come from everywhere at every level. We believe that diversity of background, talent, skillset and mindset create a flourishing environment for new thinking and ideas. Our business is growing and we are always looking for new talent. If you are driven by challenging work, passionate about media and technology and interested in helping to shape the future of our industry, we would like to hear from you! Note: Travel to and from client and vendor sites in a personal vehicle may be required in this position. The preceding functions have been provided as the types of work performed by the employees assigned to this job classification. Management reserves the right to add, modify, change or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job. This job description does not promise or imply that the functions listed are the only duties to be performed or that the position may not change or be eliminated.", "responsibilities": "An Operations Assistant plays a vital role in ensuring the smooth functioning of an organization by providing administrative and logistical support to various departments. The Operations Assistant will provide administrative support to various departments, assist in coordinating daily operations, and ensure the smooth running of business activities.<br/><br/>Responsibilities:<br/><br/><ul><li>Administrative Support:</li><li>Manage and organize (electronic and hard copy) paperwork, files/folders, documents, and calendars. </li><li>Handle incoming and outgoing correspondence, including emails, phone calls, and mail. </li><li>Assist in preparing reports, presentations, and other documents as required. </li><li>Maintain office supplies inventory and organization. </li><li>Office space upkeep. Ensure all shared spaces are clean and organized, including trash overflow and recycling bins. </li><li> Logistical Support:</li><li>Schedule and coordinate meetings, appointments, and travel arrangements for staff. </li><li>Coordinate logistical aspects of events, conferences, and workshops. </li><li>Arrange transportation and accommodations for staff and visitors when needed. </li><li>Ensure that facilities and equipment are well-maintained and in working order. </li><li> Data Entry and Record Keeping:</li><li>Input data into databases, spreadsheets, and other digital platforms accurately and efficiently. </li><li>Maintain records of expenses, invoices, receipts, and other financial documents. </li><li>Organize and maintain electronic and hard copy filing systems. </li><li> Communication and Coordination:</li><li>Liaise with internal departments and external partners to facilitate communication and collaboration. </li><li>Communicate effectively with team members to relay information, updates, and instructions. </li><li>Assist in coordinating projects and tasks to ensure deadlines are met. </li><li> Other Duties:</li><li>Provide general support to management and staff as needed. </li><li>Handle special projects and assignments as assigned by supervisors. </li><li>Contribute to the overall efficiency and effectiveness of operations through proactive problem-solving and teamwork. <br/><br/></li></ul>", "qualifications": {"required": "High school diploma or equivalent; associate or bachelor's degree preferred. \nProven experience in an administrative or operations support role. \nProficiency in Microsoft Office suite (Word, Excel, PowerPoint, Outlook) and other relevant software applications. \nStrong organizational skills with the ability to multitask and prioritize workload. \nExcellent communication and interpersonal skills. \nAttention to detail and accuracy in work. \nAbility to work independently with minimal supervision and as part of a team. \nFlexibility and adaptability to changing priorities and tasks. \nKnowledge of basic office equipment and procedures<br/><br/>", "preferred": ""}, "skills": ["Microsoft Office", "Communication", "Organization", "Multitasking", "Problem Solving"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Full medical benefits, including health, dental and vision coverage\nGenerous vacation policy\n12 Paid Holidays + WFH Fridays (workday ends at 2 pm)\nCompany contribution to employee 401(K)\nCompany-paid volunteer hours\nProfessional development program\nExtras\nFree snacks (mostly healthy)\nSundae Thursdays (Yep, ice cream sundaes on Thursdays!) or another fun treat\nMonthly lunch and learns\nQuarterly town hall meetings with lots of food and prizes\nTeam parties and celebrations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994665874"}