{"jobTitle": "Department Manager Maintenance", "company": {"name": "Orange County Transportation Authority", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Transportation/Trucking/Railroad", "description": "<strong>Job Description<br/><br/></strong><strong>Overview <br/><br/></strong><strong>Why OCTA<br/><br/></strong>Discover work that moves you in a dynamic and innovative setting. Be part of a team delivering Orange County’s transportation network of today and creating a vision for the future.<br/><br/>OCTA is the county’s transportation planning commission and public transit operator. With a focus on safety and accountability, we plan, fund, and implement countywide projects that include bus and rail transit, freeways and express lanes, rideshare, microtransit, paratransit, active transportation, and environmental programs.<br/><br/>We’re passionate about creating a balanced, equitable and sustainable transportation system that reflects the diverse travel needs of the county’s 34 cities and 3.2 million residents.<br/><br/>Our employees rated OCTA as a top workplace in Orange County. Come join us on our mission of keeping Orange County moving.<br/><br/><strong>Overview<br/><br/></strong>Under minimal guidance, manages, coordinates, and directs the management of maintenance programs and procedures for vehicles and facilities to support the operation of the agency’s transportation programs.<br/><br/>This a an exempt position in Salary Range 260: Min $162,784 - Mid $195,341 - Max $227,897 annually. The starting salary will be within this range based on qualifications.<br/><br/><strong>This posting will remain open until filled.<br/><br/></strong><strong>Responsibilities<br/><br/></strong><em>This list is intended to indicate the general nature and level of work performed by employees within this classification and is not designed to be interpreted as an exhaustive listing of all tasks required of employees assigned to this job.<br/><br/></em><strong>Displays High Integrity &amp; Honesty: </strong><em>Takes personal responsibility, acts with honesty and consistency.<br/><br/></em><strong>Has Technical and Professional Expertise: </strong><em>Has the technical skills, product knowledge and professional skills to do the job.<br/><br/></em><ul><li>Develops, recommends and evaluates the effectiveness of maintenance program performance standards, policies and practices, as well as related administrative functions. Monitors system performance, focusing on safety, productivity, and reliability.</li><li>Coordinates with Bus Operations, Contract Transportation Services, Scheduling and Bus Operations Support, Contracts Administration and Materials Management, and other agency business units to ensure service requirements are met.</li><li>Develops, administers, and monitors department budget; implements cost-effective changes.</li><li>Develops and monitors overall safety programs for the Department; oversees training program to promote workplace safety.</li><li>Participates in labor negotiations to provide technical and managerial input; oversees administration of the collective bargaining agreements in the Department.</li><li>Ensures the Department is prepared for reviews, inspections, and audits throughout the year in financial and operational areas, especially in areas central to compliance with regulations and safety standards.</li><li>Ensures the Department provides appropriate project management for all assigned contracts and procurements.</li><li>Develops staff reports and makes presentations to external and internal groups including industry organizations, senior management, Board committees, and Board of Directors as appropriate.<br/><br/></li></ul><strong>Develops Strategic Perspective: </strong><em>Knows how immediate work relates to organizational strategy, translates into actionable steps.<br/><br/></em><ul><li>Provides direction for assigned Maintenance Department areas by setting goals and objectives, maintaining performance and financial standards and directing key personnel.<br/><br/></li></ul><strong>Inspires &amp; Motivates Others: </strong><em>Moves others to high level of performance, unlocks exceptional results in self and others.<br/><br/></em><ul><li>Provides leadership, coaches, evaluates, and plans the development and succession planning of key department management staff; identifies areas in need of improvement and establishes personnel performance targets.<br/><br/></li></ul><strong>Takes Initiative: </strong><em>Initiates new programs, processes, relationships, or technologies to accomplish goals.<br/><br/></em><ul><li>Develops and reviews policies and procedures for maintenance training, and related operations, including safety requirements, operational efficiency, and financial and managerial objectives.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Any combination of education and experience equivalent to a bachelor's degree and a minimum of eight years of experience in transportation maintenance, vehicle maintenance, or related fields, including four years of experience in managing a maintenance or operations department. Managerial experience in a union environment is preferred.<br/><br/><strong>Special Qualifications<br/><br/></strong>Valid California Class C Driver License.<br/><br/><strong>Environmental Factors<br/><br/></strong>Position requires occasional travel between Authority locations and ability to function in a maintenance shop environment.<br/><br/><strong>Compensation And Benefits<br/><br/></strong>OCTA offers an attractive compensation and benefits package that includes medical, dental and vision health insurance programs, flex time (may be available), paid sick leave, paid vacation and holidays, short-term and long-term disability, life insurance, flexible spending accounts, retirement, deferred compensation plan, educational reimbursement, excellent in-house training programs, free transportation passes for the employee and dependents, wellness and ergonomic programs, and much more. OCTA has a hybrid remote work program. Eligibility is dependent on manager’s approval.<br/><br/><strong>OCTA is an equal employment opportunity employer that recruits, hires, and promotes qualified people without regard to race, color, religion, creed, ancestry, national origin, age, sex, pregnancy, gender, gender identity and/or expression, sexual orientation, marital status, medical condition, disability, genetic information, military and veteran status, or other legally protected status.</strong>", "responsibilities": "<em>This list is intended to indicate the general nature and level of work performed by employees within this classification and is not designed to be interpreted as an exhaustive listing of all tasks required of employees assigned to this job.<br/><br/></em><strong>Displays High Integrity &amp; Honesty: </strong><em>Takes personal responsibility, acts with honesty and consistency.<br/><br/></em><strong>Has Technical and Professional Expertise: </strong><em>Has the technical skills, product knowledge and professional skills to do the job.<br/><br/></em><ul><li>Develops, recommends and evaluates the effectiveness of maintenance program performance standards, policies and practices, as well as related administrative functions. Monitors system performance, focusing on safety, productivity, and reliability.</li><li>Coordinates with Bus Operations, Contract Transportation Services, Scheduling and Bus Operations Support, Contracts Administration and Materials Management, and other agency business units to ensure service requirements are met.</li><li>Develops, administers, and monitors department budget; implements cost-effective changes.</li><li>Develops and monitors overall safety programs for the Department; oversees training program to promote workplace safety.</li><li>Participates in labor negotiations to provide technical and managerial input; oversees administration of the collective bargaining agreements in the Department.</li><li>Ensures the Department is prepared for reviews, inspections, and audits throughout the year in financial and operational areas, especially in areas central to compliance with regulations and safety standards.</li><li>Ensures the Department provides appropriate project management for all assigned contracts and procurements.</li><li>Develops staff reports and makes presentations to external and internal groups including industry organizations, senior management, Board committees, and Board of Directors as appropriate.<br/><br/></li></ul><strong>Develops Strategic Perspective: </strong><em>Knows how immediate work relates to organizational strategy, translates into actionable steps.<br/><br/></em><ul><li>Provides direction for assigned Maintenance Department areas by setting goals and objectives, maintaining performance and financial standards and directing key personnel.<br/><br/></li></ul><strong>Inspires &amp; Motivates Others: </strong><em>Moves others to high level of performance, unlocks exceptional results in self and others.<br/><br/></em><ul><li>Provides leadership, coaches, evaluates, and plans the development and succession planning of key department management staff; identifies areas in need of improvement and establishes personnel performance targets.<br/><br/></li></ul><strong>Takes Initiative: </strong><em>Initiates new programs, processes, relationships, or technologies to accomplish goals.<br/><br/></em><ul><li>Develops and reviews policies and procedures for maintenance training, and related operations, including safety requirements, operational efficiency, and financial and managerial objectives.<br/><br/></li></ul>", "qualifications": {"required": "Any combination of education and experience equivalent to a bachelor's degree and a minimum of eight years of experience in transportation maintenance, vehicle maintenance, or related fields, including four years of experience in managing a maintenance or operations department.", "preferred": "Managerial experience in a union environment is preferred."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "OCTA offers an attractive compensation and benefits package that includes medical, dental and vision health insurance programs, flex time (may be available), paid sick leave, paid vacation and holidays, short-term and long-term disability, life insurance, flexible spending accounts, retirement, deferred compensation plan, educational reimbursement, excellent in-house training programs, free transportation passes for the employee and dependents, wellness and ergonomic programs, and much more. OCTA has a hybrid remote work program. Eligibility is dependent on manager’s approval.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994166670"}