{"jobTitle": "Coordinator, Sales Operations", "company": {"name": "Hourglass Cosmetics", "industry": "Personal Care Product Manufacturing", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.00/hr - 26.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Personal Care Product Manufacturing", "description": "<strong>HOURGLASS COSMETICS — Coordinator, Sales Operations<br/><br/></strong>Connected by creativity and driven by purpose. Hourglass Cosmetics is a vegan and cruelty-free beauty brand, redefining luxury cosmetics with high-performance products, innovative formulas, and award-winning franchises. Recognized by Forbes, Fast Company and Time Magazine as one of the most inventive beauty companies, Hourglass leads the industry with its breakthrough products and its commitment to animal welfare. Founded in 2004, Hourglass is globally available in 32 markets and 2,600 doors including Sephora, Ulta, Bergdorf Goodman, Nordstrom, Space NK and more. Hourglass became part of the Unilever Prestige division in 2017. Discover more about the Hourglass brand story and mission on our website hourglasscosmetics.com<br/><br/>The Sales Operation Coordinator is responsible for supporting various sales operation functions. This person serves as a link between the sales, marketing, finance and operations to ensure all functions as they relate to sales are supported and running as efficiently and productively as possible.<br/><br/><strong>What You Do<br/><br/></strong><ul><li>Support in the day-to-day tactical aspects of the sales operations function.</li><li>Track retailer inventory levels: monitoring replenishment order frequency, WOS On-Hand, and Store In-stocks.</li><li>Communicate out-of-stock and back-in-stock information to retailers weekly.</li><li>Communicate new launch allocations and shipment timelines to retailers; monitor orders to ensure on-time launch.</li><li>Partner with Order Management team to address any EDI issues, shipment delays, etc, with retailers.</li><li>Process retailers RTV requests: issuing RAs in Netsuite, gaining leadership approval, and communicating with retailers throughout the process.</li><li>Track new store openings: log all pertinent information, keep VM team up-to-date with due dates, addresses, etc.</li><li>Assist Finance in reviewing/contesting chargebacks.</li><li>Communicate launch dates, ship dates, discontinuations, and price changes to retail partners.</li><li>Assist with various projects as assigned.<br/><br/></li></ul><strong>You’ll Love This Job If<br/><br/></strong><ul><li>You are highly STRATEGIC: You are able to develop creative concepts and vision that support brand and business goals.</li><li>You are extremely ORGANIZED: You are not overwhelmed by the thought of tackling multiple tasks at a time.</li><li>You are DETAIL ORIENTED: You appreciate the importance of having detailed and precise information.</li><li>You are a strong COMMUNICATOR: You are a people person, natural leader and collaborate well with others.</li><li>You are AGILE: You adapt well to changing needs and priorities and are able to pivot easily to achieve goals and deadlines.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum 2 years of experience within sales and sales operations; beauty industry experience preferred but not required</li><li>Bachelor’s degree in business or related field</li><li>Proficient in basic Excel functionality; PowerBI, and/or NetSuite experience is a plus.</li><li>Thrive on solving problems and looking at implementing creative solutions</li><li>Must be highly organized and have strong attention to detail</li><li>Analytical, with experience tracking and reporting</li><li>Adaptable, resourceful and forward thinking</li><li>Creative, positive and high-energy individual with an ability to execute</li><li>Must be able to work from Corporate Office at least 60% of the time.<br/><br/></li></ul>The expected hourly range for this position is $24.00 to $26.00. The exact hourly salary is determined by various factors including experience, skills, education, geographic location, and budget. This position is also eligible for participation in the company discretionary bonus plan, based on personal performance and company results.<br/><br/>In addition to base salary, Hourglass Cosmetics offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.<br/><br/>Hourglass is an organization committed to diversity and inclusion to drive its business results and to create a better future every day for its diverse employees, global consumers, partners and communities. If you are an individual with a disability and need accommodation in order to apply for a job listing, please contact us at 310-392-7799 or careers@hourglasscosmetics.com.<br/><br/>Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities.<br/><br/>Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law.", "responsibilities": "The Sales Operation Coordinator is responsible for supporting various sales operation functions. This person serves as a link between the sales, marketing, finance and operations to ensure all functions as they relate to sales are supported and running as efficiently and productively as possible.", "qualifications": {"required": "Minimum 2 years of experience within sales and sales operations; beauty industry experience preferred but not required\nBachelor’s degree in business or related field\nProficient in basic Excel functionality; PowerBI, and/or NetSuite experience is a plus.\nThrive on solving problems and looking at implementing creative solutions\nMust be highly organized and have strong attention to detail\nAnalytical, with experience tracking and reporting\nAdaptable, resourceful and forward thinking\nCreative, positive and high-energy individual with an ability to execute\nMust be able to work from Corporate Office at least 60% of the time.", "preferred": ""}, "skills": ["Excel", "PowerBI", "NetSuite"], "postedDate": "2 weeks ago", "benefits": "In addition to base salary, Hourglass Cosmetics offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, paid holidays, discretionary vacation time, and more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994980255"}