{"jobTitle": "Manager – Events and Community Relations", "company": {"name": "Downtown Women's Center", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Non-profit Organizations", "description": "<strong>Summary<br/><br/></strong>The Events and Community Relations Manager is an expert project manager and relationship builder responsible for creating opportunities for diverse stakeholders to engage with DWC through events, volunteer opportunities, and in-kind support. Reporting to the Chief Development Officer, the Manager is the lead for all internal event logistics, coordinating with other members of the development, communications, and executive teams to provide support as needed. The Manager is also the lead organizer for DWC’s annual Every Woman Housed Gala, responsible for project management, task delegation, and engaging the Board and Gala Committee. They will supervise the Volunteer Specialist, Community Relations Specialist, and the In-Kind Donations Associate. We welcome applicants of diverse backgrounds who can speak to their experience building relationships and coordinating projects, and who are committed to ending homelessness for women and gender diverse individuals in Los Angeles. Please submit a resume and cover letter through DWC’s application portal. This role will require a combination of remote and on-site work at DWC’s Downtown LA office.<br/><br/><strong>Essential Functions<br/><br/></strong>Gala<br/><br/><ul><li>Serve as the project manager for DWC’s annual Every Woman Housed gala, responsible for coordinating all aspects of the event with support from the Development and Communications teams. </li><li>Coordinate with event committee chairs and members to schedule and facilitate regular meetings leading up to the event. </li><li>Work with the Communications Department to create all event collateral and communications including sponsorship deck, digital and mailed invitations, tribute journal and other sponsorship recognition materials, event program, step and repeat, and thank you’s. </li><li>Manage any event consultants/vendors and guide decision-making related to venue, parking, food and beverage, program, and guest experience. </li><li>Manage the event budget and ensure that all expenses are documented and paid for on time. </li><li>Delegate fundraising tasks to the appropriate team members, including sponsorship and auction outreach and management. Provide ongoing support with task management as needed. </li><li>Oversee and delegate post-gala communications and event wrap up including guest and sponsor stewardship, donation and auction acknowledgements, and event debriefs. <br/><br/></li></ul>Other Event Logistics<br/><br/><ul><li>Monitor the events email and respond to all inquiries in a timely and professional manner. </li><li>Support the Executive Assistant in planning the annual Staff Holiday Party as needed. </li><li>Support the CEO in planning events and conferences related to the Domestic Violence Homeless Services Coalition. </li><li>Support the Director of Individual Giving, Major Gifts Officer, CDO, and CEO in planning donor prospecting and stewardship events. </li><li>In partnership with the Community Relations Specialist, provide logistical support to the Communications Department for media events. </li><li>In partnership with the Capital Campaign Coordinator, provide logistical and planning support for groundbreaking and grand opening events related to DWC’s Capital Campaign. <br/><br/></li></ul>Volunteers<br/><br/><ul><li>Supervise the Volunteer Specialist, with oversight of DWC’s volunteer program for individuals. </li><li>Supervise the Community Relations Specialist, with oversight of group volunteer events, including cooking clubs, kit-making, special volunteer events, and corporate days of service. </li><li>In partnership with the Volunteer Specialist and Community Relations Specialist, coordinate with LAHSA to recruit volunteers for and host the annual Skid Row Homeless Count at DWC. </li><li>Ensure volunteer activities and hours are accurately tracked; provide regular reports on volunteer metrics as requested by the Board of Directors and Finance Department. <br/><br/></li></ul>In-Kind Donations<br/><br/><ul><li>Supervise the In-Kind Donations Associate, with oversight of DWC’s in-kind donations program. </li><li>In partnership with the In-Kind Donations Associate and the Donor Database Administrator, maintain accurate records of in-kind donations received and donor contact information. Ensure donors receive the necessary tax documentation for their gifts. </li><li>Maintain understanding of DWC’s current in-kind donation needs and work with the development team to solicit donations as needed. <br/><br/></li></ul><em>Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.<br/><br/></em>Competencies<br/><br/><ul><li>Project Management </li><li>Event Planning and Logistics </li><li>Relationship Building </li><li>Multitasking and Problem Solving </li><li>Written and Verbal Communication </li><li>Board Relations </li><li>Leadership <br/><br/></li></ul>Supervisory Responsibility<br/><br/>This position supervises a team of three full-time staff.<br/><br/>Work Environment<br/><br/>This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets, and fax machines.<br/><br/>Physical Demands<br/><br/>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to talk and hear. Specific vision abilities required by this job include close vision and the ability to adjust focus. This position would also require the ability to lift files, open filing cabinets and bend or stand on a stool as necessary.<br/><br/>Position Type and Expected Hours of Work<br/><br/>This is a full-time, exempt position. Office hours are 9:00 am to 5:30 pm with the flexibility to work evenings and weekends when necessary<br/><br/>Travel<br/><br/>No travel is expected for this position.<br/><br/>Ability to Work Remotely<br/><br/>Hybrid<br/><br/><strong>Required Education, Experience, And Qualifications<br/><br/></strong><ul><li>Bachelor’s degree or equivalent work experience preferred. </li><li>Minimum of 3 years experience required in fundraising, event planning, volunteer management, or similar field. </li><li>Detail-oriented, highly organized self-starter able to work independently, set and meet goals and deadlines. </li><li>Proficient in MS Office Suite </li><li>Experience working in a CRM database, preferably Bloomerang. </li><li>Understanding of nonprofit fundraising principles and practices </li><li>Experience coordinating across diverse teams to create buy-in. </li><li>Good at following systems and procedures, while also refining them to create a more efficient process </li><li>Strong multitasking and problem-solving skills; ability to maintain composure in a fast-paced environment. </li><li>Demonstrated record as a successful team player, including the ability to develop and maintain a goal-oriented, positive attitude and good sense of humor. </li><li>Compassion and understanding of the Center’s unique approach to service provision. </li><li>Strong work ethic. </li><li>Professional attitude; team- and service-oriented, friendly, and positive. </li><li>Commitment to racial equity and social justice; recognition of the role of race, gender, and other identities in contributing to homelessness and inequity </li><li>Commitment to DWC’s mission to end homelessness for women and gender diverse individuals by providing safe housing and supportive services centered on wellness, employment, and advocacy </li><li>Must be a CA resident and live no more than 80 miles from DWC; must be available for in-person meetings at DWC </li><li>Must provide documentation of a negative TB test result within the last twelve months, on first day of hire </li><li>You will be required to be up to date on your vaccinations against COVID-19 and provide documentation. If you are fully vaccinated and not yet eligible to receive a booster dose, then you must receive the booster dose within 30 days of becoming eligible and eligibility begins 5 months after receiving the final primary dose. If you are fully vaccinated and have received a booster dose, you are considered up to date with your vaccinations. Unvaccinated individuals must receive their 1st dose before their first day of hire. Partially vaccinated (for 2-dose series) individuals must receive their 2nd dose within 30 days of being hired. The second dose of a two-dose vaccine series is due 4 weeks after the primary dose. <br/><br/></li></ul>Pay Range<br/><br/>$70,000-$75,000/year<br/><br/>Work Authorization/Security Clearance<br/><br/>Being authorized to work in the U.S. is a precondition of employment. DWC does not sponsor employment visas, such as H-1B.<br/><br/>Fair Chance Act Statement<br/><br/>Downtown Women’s Center will consider qualified applicants with a criminal history pursuant to the California Fair Chance Act. You do not need to disclose your criminal history or participate in a background check until a conditional job offer is made to you. After making a conditional offer and running a background check, if Downtown Women’s Center is concerned about conviction that is directly related to the job, you will be given the chance to explain the circumstances surrounding the conviction, provide mitigating evidence, or challenge the accuracy of the background report. Find out more about the Fair Chance Act by visiting the Civil Right’s Department Fair Chance Act webpage.<br/><br/>Downtown Women’s Center provides equal employment opportunities (EEO) to all employees and applicants and actively seeks candidates who reflect the rich diversity of the communities that we serve. We are committed to a work environment that embraces and promotes individuality and inclusion. We believe that diversity and inclusion of varied perspectives, backgrounds, and life experiences are essential to our organization’s effectiveness, and allow us to serve our clients in the respectful, responsive, and understanding way that they deserve. We define diversity in broad terms to include race, ethnicity, age, gender, religion, sexual orientation, gender identity and expression, mental or physical disability, marital status, pregnancy, military and veteran status, medical condition, geography, socio-economic status, and other unique attributes that make us who we are.<br/><br/>Downtown Women’s Center complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/>Other Duties<br/><br/>Please note this job description is not designed to cover or contain a comprehensive listing of all activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.", "postedDate": "2 weeks ago", "salary": {"amount": "70,000.00 - 75,000.00", "currency": "USD"}, "skills": ["Project Management", "Event Planning", "Relationship Building", "Multitasking", "Problem Solving", "Written and Verbal Communication", "Board Relations", "Leadership", "MS Office Suite", "CRM", "Bloomerang", "Nonprofit Fundraising", "Teamwork", "Goal-Oriented", "Positive Attitude", "Compassion", "Strong Work Ethic", "Professional Attitude", "Racial Equity", "Social Justice", "Homelessness", "Wellness", "Employment", "Advocacy", "COVID-19 Vaccination"], "url": "https://www.linkedin.com/jobs/view/3994338739"}