{"jobTitle": "Service Management & Operations- Senior Associate", "company": {"name": "PwC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Management and Manufacturing", "industry": "Accounting, Financial Services, and Business Consulting and Services", "description": "<strong>Specialty/Competency: </strong>Platform Engineering &amp; Architecture<br/><br/><strong>Industry/Sector: </strong>Not Applicable<br/><br/><strong>Time Type: </strong>Full time<br/><br/><strong>Travel Requirements: </strong>Up to 80%<br/><br/>A career in our Service Management practice, within Cloud Computing and Networking services, will provide you with the opportunity to focus on the joint business relationship between PwC and Google, HP, Microsoft, Oracle, SAP, and other cloud based platforms to bring new and innovative services to some of the largest companies. We help our clients adopt the cloud to transform Information Technology, scale and streamline operations and create new cloud based businesses through our strong alliances. You’ll be at the forefront of helping organisations around the globe adopt innovative technology solutions that optimise business processes or enable scalable technology. Our team helps organisations transform their Information Technology operations into additional sources of revenue by improving Information Technology service delivery, cost efficiency, and customer satisfaction. As part of the team, you’ll help our clients design and implement process strategies to address gaps in their cloud service delivery and service management proficiency.<br/><br/>To really stand out and make us fit for the future in a constantly changing world, each and every one of us at PwC needs to be a purpose-led and values-driven leader at every level. To help us achieve this we have the PwC Professional; our global leadership development framework. It gives us a single set of expectations across our lines, geographies and career paths, and provides transparency on the skills we need as individuals to be successful and progress in our careers, now and in the future.<br/><br/><strong>Responsibilities<br/><br/></strong>As a Senior Associate, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to:<br/><br/><ul><li>Use feedback and reflection to develop self awareness, personal strengths and address development areas.</li><li>Delegate to others to provide stretch opportunities, coaching them to deliver results.</li><li>Demonstrate critical thinking and the ability to bring order to unstructured problems.</li><li>Use a broad range of tools and techniques to extract insights from current industry or sector trends.</li><li>Review your work and that of others for quality, accuracy and relevance.</li><li>Know how and when to use tools available for a given situation and can explain the reasons for this choice.</li><li>Seek and embrace opportunities which give exposure to different situations, environments and perspectives.</li><li>Use straightforward communication, in a structured way, when influencing and connecting with others.</li><li>Able to read situations and modify behavior to build quality relationships.</li><li>Uphold the firm's code of ethics and business conduct.<br/><br/></li></ul>As part of PwC’s Technology Operations (IT4IT) practice, the Service Management and Operations capability helps our clients transform their business through innovative technology solutions and effective Service Management Operations. Part of that journey includes helping our clients enable innovation, reinventing their customer experience, and exploring new markets.<br/><br/><strong>Basic Qualifications<br/><br/></strong><strong>Job Requirements and Preferences</strong>:<br/><br/><strong>Minimum Degree Required<br/><br/></strong>Bachelor Degree<br/><br/><strong>Minimum Years Of Experience<br/><br/></strong>3 year(s)<br/><br/><strong>Preferred Qualifications<br/><br/></strong><strong>Certification(s) Preferred</strong>:<br/><br/><ul><li>ITIL 4</li><li>COBIT</li><li>ISO 27001</li><li>ServiceNow Certification(s) </li><li>BMC Helix Certification(s)</li><li>Flexera Certification(s)</li><li>Jira Service Management (JSM)</li><li>Certification(s) from a leading cloud service provider (AWS, Azure, GCP)</li><li>FinOps Certified Practitioner<br/><br/></li></ul><strong>Preferred Knowledge/Skills<br/><br/></strong>Demonstrates thorough level abilities and success with managing the identification and addressing of client needs and understanding at least one of the following areas:<br/><br/><ul><li>Cloud platforms and the technologies that make them work (ie. AWS, Azure, Google Cloud Platform); and their key technologies, including: Observability, AIOPs, APM;</li><li>ServiceNow or similar tools IT Service Management modules and how they are implemented across different operating models (ITIL);</li><li>DevSecOps transformations;</li><li>Knowledge of industry leading discovery technologies (SCCM, Tanium, Armis, Intune) and how they integrate with ServiceNow;</li><li>Understanding IT Asset and Configuration Management principles;</li><li>Knowledge of Service Management and Operations processes in ServiceNow (Change Management, Incident Management, Problem Management, Request Management &amp; Knowledge Management);</li><li>Developing and re-engineering IT processes, capabilities, and controls in an effective and efficient way;</li><li>Implementing and maturing governance frameworks, including operating models for skills and people to support operations on premise and in the cloud as well as reporting capabilities; and, </li><li>IT Financial Management- cost asset management and optimization.<br/><br/></li></ul>Demonstrates thorough abilities and/or a proven record of success in the following areas:<br/><br/><ul><li>Collaborating on and delivering strategy and transformation projects - including leading small teams and workstreams, identifying roadblocks, and integrating feedback from clients and team members;</li><li>Structuring and communicating your ideas logically;</li><li>Seeking opportunities to build and maintain professional relationships;</li><li>Approaching new projects with an open mind;</li><li>Believing empathy for coworkers and customers is key to your success;</li><li>Valuing learning from mistakes and ask for help when needed; </li><li>Persevering through challenges; and, </li><li>Believing in the value created by diverse teams and can adapt to a variety of working styles.<br/><br/></li></ul>Demonstrates thorough abilities and/or a proven record of success in the following areas:<br/><br/><ul><li>ServiceNow/BMC Helix/Jira Service Management (implementations, transformations, etc.); </li><li>IT Service Management, ITIL 4, COBIT;</li><li>IT Asset Management / IT Cloud Financial Management;</li><li>Cloud Platforms (Amazon Web Services (AWS), Azure, GCP);</li><li>DevSecOps Transformation;</li><li>Cloud Discovery, including tagging integration and federated configuration;</li><li>Cloud Application Performance Monitoring (APM);</li><li>Cloud auto-scaling, ELB;</li><li>Cloud AI Ops / AI Monitoring; and, </li><li>Cloud Discovery.<br/><br/></li></ul>Learn more about how we work: https://pwc.to/how-we-work<br/><br/>PwC does not intend to hire experienced or entry level job seekers who will need, now or in the future, PwC sponsorship through the H-1B lottery, except as set forth within the following policy: https://pwc.to/H-1B-Lottery-Policy.<br/><br/>All qualified applicants will receive consideration for employment at PwC without regard to race; creed; color; religion; national origin; sex; age; disability; sexual orientation; gender identity or expression; genetic predisposition or carrier status; veteran, marital, or citizenship status; or any other status protected by law. PwC is proud to be an affirmative action and equal opportunity employer.<br/><br/>For positions based in San Francisco, consideration of qualified candidates with arrest and conviction records will be in a manner consistent with the San Francisco Fair Chance Ordinance.<br/><br/>Applications will be accepted until the position is filled or the posting is removed, unless otherwise set forth on the following webpage. Please visit this link for information about anticipated application deadlines: https://pwc.to/us-application-deadlines<br/><br/>For positions in California, Colorado, District of Columbia, Hawaii, Maryland, Nevada, New York State, or Washington State, or for opportunities that will report to a supervisor, office or other work site in New York State, please visit the following link for pay range information: https://pwc.to/payrange-v1-advisoryseniorassociate<br/><br/>", "postedDate": "2 weeks ago", "qualifications": {"required": "Job Requirements and Preferences\n\nMinimum Degree Required\n\nBachelor Degree\n\nMinimum Years Of Experience\n\n3 year(s)", "preferred": "Certification(s) Preferred:\n\nITIL 4\nCOBIT\nISO 27001\nServiceNow Certification(s) \nBMC Helix Certification(s)\nFlexera Certification(s)\nJira Service Management (JSM)\nCertification(s) from a leading cloud service provider (AWS, Azure, GCP)\nFinOps Certified Practitioner\n\nPreferred Knowledge/Skills\n\nDemonstrates thorough level abilities and success with managing the identification and addressing of client needs and understanding at least one of the following areas:\n\nCloud platforms and the technologies that make them work (ie. AWS, Azure, Google Cloud Platform); and their key technologies, including: Observability, AIOPs, APM;\nServiceNow or similar tools IT Service Management modules and how they are implemented across different operating models (ITIL);\nDevSecOps transformations;\nKnowledge of industry leading discovery technologies (SCCM, Tanium, Armis, Intune) and how they integrate with ServiceNow;\nUnderstanding IT Asset and Configuration Management principles;\nKnowledge of Service Management and Operations processes in ServiceNow (Change Management, Incident Management, Problem Management, Request Management & Knowledge Management);\nDeveloping and re-engineering IT processes, capabilities, and controls in an effective and efficient way;\nImplementing and maturing governance frameworks, including operating models for skills and people to support operations on premise and in the cloud as well as reporting capabilities; and, \nIT Financial Management- cost asset management and optimization.\n\nDemonstrates thorough abilities and/or a proven record of success in the following areas:\n\nCollaborating on and delivering strategy and transformation projects - including leading small teams and workstreams, identifying roadblocks, and integrating feedback from clients and team members;\nStructuring and communicating your ideas logically;\nSeeking opportunities to build and maintain professional relationships;\nApproaching new projects with an open mind;\nBelieving empathy for coworkers and customers is key to your success;\nValuing learning from mistakes and ask for help when needed; \nPersevering through challenges; and, \nBelieving in the value created by diverse teams and can adapt to a variety of working styles.\n\nDemonstrates thorough abilities and/or a proven record of success in the following areas:\n\nServiceNow/BMC Helix/Jira Service Management (implementations, transformations, etc.); \nIT Service Management, ITIL 4, COBIT;\nIT Asset Management / IT Cloud Financial Management;\nCloud Platforms (Amazon Web Services (AWS), Azure, GCP);\nDevSecOps Transformation;\nCloud Discovery, including tagging integration and federated configuration;\nCloud Application Performance Monitoring (APM);\nCloud auto-scaling, ELB;\nCloud AI Ops / AI Monitoring; and, \nCloud Discovery."}, "skills": ["ITIL 4", "COBIT", "ISO 27001", "ServiceNow", "BMC Helix", "Flexera", "Jira Service Management", "AWS", "Azure", "GCP", "FinOps", "Observability", "AIOPs", "APM", "DevSecOps", "SCCM", "Tanium", "Armis", "Intune", "IT Asset Management", "Configuration Management", "Change Management", "Incident Management", "Problem Management", "Request Management", "Knowledge Management", "IT Financial Management", "Cloud Platforms", "Cloud Discovery", "Cloud Application Performance Monitoring", "Cloud auto-scaling", "ELB", "Cloud AI Ops", "AI Monitoring"], "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3994369201"}