{"jobTitle": "Executive Assistant", "company": {"name": "Randstad USA", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$26.00/hr - $28.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Randstad is looking for a business professional with a knowledge and proficiency working in Executive Assistant. We have a hybrid role that we are looking to fill for a contract position with a top tier company. If you are interested in becoming part of a team where you can contribute to drive both personal and organizational goals, this may be the right fit for you! For further information on the role, and job responsibilities, please read and apply below!<br/><br/>salary: $26 - $28 per hour<br/><br/>shift: First<br/><br/>work hours: 8 AM - 5 PM<br/><br/>education: Bachelors<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Handle all scheduling responsibilities in a proactive nature</li><li>Prepare and manage expense reports plus book occasional travel</li><li>Coordinate meetings with 10+ attendees: prepare agendas, secure and plan space, facilitate and follow up as appropriate</li><li>Attend meetings, take notes and track action items</li><li>Serve as a liaison between various teams and groups under Social and Experiential</li><li>Manage distribution lists and contact/assignment sheets</li><li>Provide additional office support such as organizing documents, ordering supplies, and processing purchase orders and billing related items<br/><br/></li></ul>Skills<br/><br/><ul><li>Organizational Skills</li><li>Administrative Duties</li><li>Microsoft Word<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Years of experience: 1 year</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.<br/><br/>Qualified applicants in San Francisco with criminal histories will be considered for employment in accordance with the San Francisco Fair Chance Ordinance.<br/><br/>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "<ul><li>Handle all scheduling responsibilities in a proactive nature</li><li>Prepare and manage expense reports plus book occasional travel</li><li>Coordinate meetings with 10+ attendees: prepare agendas, secure and plan space, facilitate and follow up as appropriate</li><li>Attend meetings, take notes and track action items</li><li>Serve as a liaison between various teams and groups under Social and Experiential</li><li>Manage distribution lists and contact/assignment sheets</li><li>Provide additional office support such as organizing documents, ordering supplies, and processing purchase orders and billing related items<br/><br/></li></ul>", "qualifications": {"required": "Years of experience: 1 year\nExperience level: Experienced", "preferred": ""}, "skills": ["Organizational Skills", "Administrative Duties", "Microsoft Word"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3994321864"}