{"jobTitle": "Supply Chain Manager", "company": {"name": "NewVac-LLC, an American Distributors LLC Company (ADI)", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "<strong>SUMMARY</strong>\n<p>The Supply Chain Manager will lead the team responsible for materials planning, purchasing and scheduling necessary to deliver our products to our customers on time and while meeting cost and inventory goals. Materials include direct materials used in products, indirect materials necessary to support proper functioning of Operations, Facilities, Engineering and Staff. </p><p><br/></p><p>This role will report to the General Manager.</p><p><br/></p><p><strong>ESSENTIAL JOB FUNCTIONS</strong></p><ul><li>Implementing material practices which ensure availability to meet customer demand, revenue requirements and controlled inventory levels</li><li>Negotiating terms and prices with suppliers, monitoring and assessing their performance</li><li> Identifying and minimizing risk by assessing future demand for products and adopting new approaches and new suppliers with no interruption to operations</li><li>Managing supplier relationships and, with Quality Assurance, supplier performance</li><li>Supervising and training of employees</li><li>Track and report on key performance metrics. Use process and business knowledge to recommend and implement improvements</li><li>Interact with customers and suppliers, answering questions and resolving issues</li><li>Assist with ordering/expediting as required</li><li>May be responsible for critical support functions including chemical supplies, tooling, etc.</li><li>Reviewing and updating supply chain practices in line with company policies, standards, laws and regulations</li><li>Maintain training and development plans and propose updates as needs are identified</li><li>Support internal and external audits</li></ul><p><br/></p><p><strong>QUALIFICATIONS </strong></p><p>To perform this job successfully, an individual must be able to perform each essential job function satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.</p><ul><li>Must have a practical business background including management principles in resource allocation, strategic   planning, management, production and leadership. </li><li>Bachelor’s or higher degree in Finance, Supply Chain/Operations Management, Engineering, or similar. Experience may qualify in lieu of a degree.</li><li> Demonstrated success in managing a complex supply chain and implementing improvements</li><li>7+ years of manufacturing experience, strong preference to a cabling/electronics background</li><li>5+ years of experience in aerospace and defense industry working within AS9100 regulations is strongly preferred, as is experience with Government customers (DFAS, DLA, etc.)</li><li>3+ years in a leadership role with direct reports</li><li><span>Understanding of Lean manufacturing techniques</span></li><li>Working knowledge of MS Office tools</li><li>Skilled in root cause analysis, 8D and continuous improvement</li><li> Working familiarity with ERP and configuration management tools</li></ul><p><br/></p><p><strong>SUPERVISORY RESPONSIBILITIES </strong></p><ul><li>Direct leadership of supply chain, planning, and stockroom personnel</li></ul><p><br/></p><p><strong>PHYSICAL DEMANDS</strong></p><ul><li>Combined sitting, standing, and walking throughout the day to accomplish tasks.</li><li> Occasional lifting up to 25 pounds.</li><li>Ability to use computer for extended periods of time.</li></ul><p><br/></p><p><strong>LANGUAGE SKILLS</strong></p><p>Ability to read, write, speak and understand English.</p><p><br/></p><p><strong>TRAVEL</strong></p><p>Minimal</p><p><br/></p><p><strong>ELIGIBILITY</strong></p><p>NewVac LLC. is an Equal Opportunity Employer. To conform to U.S. Government regulations applicant must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3). </p><p><strong>NewVac LLC. Uses E-Verify to confirm applicants’ eligibility. </strong></p><p><br/></p><p><strong>SALARY AND BENEFITS</strong></p><p>Available at https://www.newvac-llc.com/careers</p>", "responsibilities": "Implementing material practices which ensure availability to meet customer demand, revenue requirements and controlled inventory levelsNegotiating terms and prices with suppliers, monitoring and assessing their performance Identifying and minimizing risk by assessing future demand for products and adopting new approaches and new suppliers with no interruption to operationsManaging supplier relationships and, with Quality Assurance, supplier performanceSupervising and training of employeesTrack and report on key performance metrics. Use process and business knowledge to recommend and implement improvementsInteract with customers and suppliers, answering questions and resolving issuesAssist with ordering/expediting as requiredMay be responsible for critical support functions including chemical supplies, tooling, etc.Reviewing and updating supply chain practices in line with company policies, standards, laws and regulationsMaintain training and development plans and propose updates as needs are identifiedSupport internal and external audits", "qualifications": {"required": "Must have a practical business background including management principles in resource allocation, strategic   planning, management, production and leadership.", "preferred": "Bachelor’s or higher degree in Finance, Supply Chain/Operations Management, Engineering, or similar. Experience may qualify in lieu of a degree. Demonstrated success in managing a complex supply chain and implementing improvements7+ years of manufacturing experience, strong preference to a cabling/electronics background5+ years of experience in aerospace and defense industry working within AS9100 regulations is strongly preferred, as is experience with Government customers (DFAS, DLA, etc.)3+ years in a leadership role with direct reports<span>Understanding of Lean manufacturing techniques</span>Working knowledge of MS Office toolsSkilled in root cause analysis, 8D and continuous improvement Working familiarity with ERP and configuration management tools"}, "skills": ["Lean Manufacturing", "ERP", "Supply Chain Management", "Manufacturing", "Management", "Leadership", "Negotiation", "Supplier Management", "Root Cause Analysis", "Continuous Improvement", "MS Office"], "postedDate": "2 weeks ago", "benefits": "Available at https://www.newvac-llc.com/careers", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994731536"}