{"jobTitle": "Dispatcher - FT", "company": {"name": "Lynch Ambulance dba Lynch EMS", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "Lynch EMS is seeking qualified candidates for Dispatch positions. Experienced is preferred, but not required.<br/><br/><strong>Full-time / Part-time Positions Available</strong> **Some shifts may include nights, weekends, and holidays as needed for coverage**<br/><br/><strong>Primary Function<br/><br/></strong><ul><li>Reports directly to the Communications Supervisor. Under the direction of the Communications Supervisor, performs as a dispatcher coordinating the timely responses to requests for medical assessment and transportation.<br/><br/></li></ul><strong>Principle Duties And Responsibilities<br/><br/></strong><ul><li>Dispatching appropriate resources to requests for medical transportation in a timely manner.</li><li>Determining the correct level of service and equipment needed for patients depending on condition at time service is requested and verifying all information input by Call Taking Representative presents as accurate.</li><li>Responding to field crew members via radio, telephone and push-to-talk technologies.</li><li>Keeps an accurate record of location and status of all staffed ambulances in the CAD system.</li><li>Assist field crews with determining addresses, closest ambulance receiving hospitals and routing options as necessary.</li><li>Maintains customer relationships by reporting any instance of change from originally scheduled transportation to the caller. This includes running late to scheduled calls, reroutes/ destination changes due to saturated Emergency Rooms or patient condition, etc.</li><li>Serve as a back-up Call Taking Representative and follow all outlined principle duties and responsibilities of the Call Taking Representative.</li><li>Report all customer complaints and unusual occurrences to the Communications Supervisor immediately, as well as follow the appropriate process for Management Team notification.</li><li>Abides by all company and department policies, procedures and processes and reports any instances of deviation from policies, procedures, and processes to the Communications Supervisor as appropriate.</li><li>Shall at all times act in a highly professional manner. The Dispatcher is an important representative of the organization and should at all times display the highest of quality skills, abilities, and attitude.</li><li>Assist and/or participate in the job orientation of all newly hired Operations and Communications personnel.</li><li>Work continually with all departments to create harmony and improve morale within the organization.</li><li>Shall perform other duties and tasks as directed by the Communications Supervisor and/ or Director of Operations.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>High School Graduate or equivalent</li><li>Current California Driver’s License</li><li>CPR for the Healthcare Provider certification (Training provided as needed)</li><li>Emergency Telecommunicator certification or EMT or Paramedic (ETC training provided as needed)</li><li>Excellent customer service interpersonal, written and verbal communication skills</li><li>Strong ability to multi-task and maintain composure and decision making skills during times of great stress</li><li>Experience as an EMT is highly preferred.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel and talk or hear. The employee frequently is required to stand, walk, sit, and reach with hands and arms. The employee is occasionally required to climb or balance; kneel, crouch.<br/><br/></li></ul><strong>Affirmative Action/EEOC/ADA<br/><br/></strong><ul><li>Employment policies and decisions on employment and promotion are based on merit, qualifications, performance, and business needs. The decisions and criteria governing the employment relationship with all employees are made in a nondiscriminatory manner, without regard to race, religion, color, national origin, sex, age, physical or mental disability, sexual orientation, gender identity, veteran status, or any other factor determined to be unlawful by federal, state, or local statutes.</li></ul>", "postedDate": "3 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994534645"}