{"jobTitle": "Business Analyst", "company": {"name": "Chorus Innovations", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "130,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst and Product Management", "industry": "Hospitality, Real Estate, and Travel Arrangements", "description": "<strong>About the Role<br/><br/></strong>You will play a pivotal role in bridging the gap between business needs and technical solutions. Your responsibilities will include conducting analyses of business processes and systems to identify opportunities for improvement and optimization. You will map out system workflows, define data requirements, and ensure that solutions align with public behavioral health goals and regulatory standards. Collaborating with stakeholders, you will gather and document detailed requirements, create functional specifications, and facilitate communication between cross-functional teams. Your expertise in data analysis and healthcare systems will be crucial in designing and implementing solutions that enhance the efficiency and effectiveness of public health initiatives. Additionally, you will provide strategic insights and recommendations to drive innovation and support the company’s mission of improving public health outcomes through advanced technology solutions.<br/><br/><strong>What You’ll Do:<br/><br/></strong><ul><li>Collaborate with clients and stakeholders to gather and document data requirements for integrated behavioral and public health systems.</li><li>Analyze and map out similarities and differences in various workflow processes across the client ecosystem, ensuring comprehensive coverage.</li><li>Ensure meticulous attention to detail in documenting data fields and their relationships within complex systems.</li><li>Document process flows and propose future process flow improvements by conducting data collection and meetings with the subject matter experts to gain full understanding of system usability. </li><li>Assist in the creation of templates and frameworks that streamline the implementation of workflows across various clients.</li><li>Use data analysis to evaluate the effectiveness of workflow processes and tools, providing insights for continuous improvement.</li><li>Collaborate on post-implementation review to evaluate the implemented system solution against business needs and benefits in order to ensure the deployed software solution is optimized for business use and realizes the anticipated benefits.<br/><br/></li></ul><strong>The Experience You’ll Need:<br/><br/></strong><ul><li>5+ years of experience in business analysis or a related field, with a focus on gathering user requirements and documenting enterprise workflows.</li><li>2+ years of experience working with integrated systems, particularly in the behavioral healthcare domain.</li><li>Proven ability to analyze complex workflows and translate them into clear technical specifications and data requirements.</li><li>Ability to analyze complex healthcare processes and data to identify improvement opportunities.</li><li>Expertise in using data analytics tools and techniques to support evidence-based decision-making.</li><li>Excellent attention to detail and ability to work with large sets of data fields to ensure accuracy and completeness in documentation.</li><li>Effective communication skills, with the ability to engage with diverse stakeholders and synthesize their needs.</li><li>Strong collaborative skills to work in multidisciplinary teams.<br/><br/></li></ul><strong>Nice-to-have skills:<br/><br/></strong><ul><li>Understanding of interoperability standards such as HL7 and FHIR, and experience with EHR systems.</li><li>BS/BA in a relevant field such as Business Administration, Computer Science, Data Analysis, or a related discipline is nice to have but not required<br/><br/></li></ul><strong>Why You’ll Love Working with Us:<br/><br/></strong><ul><li>A mission-driven company – be part of a team that is helping to improve people’s lives by democratizing technology development in health!</li><li>Full medical, dental, vision and life insurance benefits</li><li>401K matching</li><li>Company stock options</li><li>Unlimited paid vacation</li><li>Performance bonuses</li><li>Company support for career and skill development</li><li>Fun company events and outings</li><li>Chorus is an equal opportunity employer with a commitment to diversity and inclusion<br/><br/></li></ul>The anticipated base salary for this position is $130,000 to $140,000<br/><br/>The base salary offered is determined by several factors, including but not limited to the applicant's qualifications, relevant experience, specific skills, level of education, certifications or professional licenses, and geographic location where the job will be performed. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include any bonus, equity, or benefits.<br/><br/>Total compensation package also includes performance bonus and stock options. Final compensation will vary based on experience and various other factors.", "responsibilities": "You will play a pivotal role in bridging the gap between business needs and technical solutions. Your responsibilities will include conducting analyses of business processes and systems to identify opportunities for improvement and optimization. You will map out system workflows, define data requirements, and ensure that solutions align with public behavioral health goals and regulatory standards. Collaborating with stakeholders, you will gather and document detailed requirements, create functional specifications, and facilitate communication between cross-functional teams. Your expertise in data analysis and healthcare systems will be crucial in designing and implementing solutions that enhance the efficiency and effectiveness of public health initiatives. Additionally, you will provide strategic insights and recommendations to drive innovation and support the company’s mission of improving public health outcomes through advanced technology solutions.", "qualifications": {"required": "5+ years of experience in business analysis or a related field, with a focus on gathering user requirements and documenting enterprise workflows.\n2+ years of experience working with integrated systems, particularly in the behavioral healthcare domain.\nProven ability to analyze complex workflows and translate them into clear technical specifications and data requirements.\nAbility to analyze complex healthcare processes and data to identify improvement opportunities.\nExpertise in using data analytics tools and techniques to support evidence-based decision-making.\nExcellent attention to detail and ability to work with large sets of data fields to ensure accuracy and completeness in documentation.\nEffective communication skills, with the ability to engage with diverse stakeholders and synthesize their needs.\nStrong collaborative skills to work in multidisciplinary teams.", "preferred": "Understanding of interoperability standards such as HL7 and FHIR, and experience with EHR systems.\nBS/BA in a relevant field such as Business Administration, Computer Science, Data Analysis, or a related discipline is nice to have but not required"}, "skills": ["Business Analysis", "Data Analysis", "Healthcare", "Workflow", "Requirements Gathering", "Technical Specifications", "Stakeholder Management", "Communication", "Collaboration", "HL7", "FHIR", "EHR"], "postedDate": "1 week ago", "benefits": "Full medical, dental, vision and life insurance benefits\n401K matching\nCompany stock options\nUnlimited paid vacation\nPerformance bonuses\nCompany support for career and skill development\nFun company events and outings", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994387357"}