{"jobTitle": "Human Resource Coordinator", "company": {"name": "Vaco", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Advertising Services", "description": "Vaco Los Angeles is working with a company in the Advertising space who is looking for a qualified HR Coordinator to come a support their HR team. Key responsibilities will include, onboarding efforts and new hire orientation, HRIS maintenance and management, and assisting with Payroll efforts. This opportunity is located in Sherman Oaks and is looking to pay between 50k-60k on a direct hire basis. <br/><br/>This opportunity provides an excellent company culture, fantastic benefits, and a flexible schedule. If you are interested, please apply today!<br/><br/><strong>Job Specifications: </strong><ul><li>Leading onboarding process and new hire orientation</li><li>Assisting with all payroll responsibilities</li><li> Maintain all employee information in HRIS system </li><li>Responsible for all employee relations and employee engagement</li><li>3-5 years of HR experience preferred for role </li><li>Experience assisting with payroll is required </li><li>Bachelors Degree preferred </li><li>Excellent written and verbal communication as well as detail oriented</li></ul>", "responsibilities": "Leading onboarding process and new hire orientation, Assisting with all payroll responsibilities, Maintain all employee information in HRIS system, Responsible for all employee relations and employee engagement", "qualifications": {"preferred": "3-5 years of HR experience, Experience assisting with payroll, Bachelors Degree", "required": "Excellent written and verbal communication as well as detail oriented"}, "skills": ["HRIS", "Payroll", "Onboarding", "Employee Relations", "Employee Engagement"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Excellent company culture, fantastic benefits, and a flexible schedule.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994377676"}