{"jobTitle": "Human Resources Director", "company": {"name": "Conexus Recruiting", "industry": "Financial Services", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "160-175K", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Financial Services", "description": "<strong>About the Company:</strong> Our client is a dynamic and rapidly growing organization in the professional services sector. With a team of 100 employees and a robust client base, they are committed to excellence in service delivery and sustained growth through both organic expansion and strategic mergers and acquisitions (M&A). Our client’s culture emphasizes collaboration, innovation, and client-centricity, making them a leader in their industry.\n<br/>\n<strong>About the Role:</strong> The Head of Human Resources will play a critical role in shaping the future of the organization, reporting directly to the CEO. This position will hold a seat at the leadership table and serve as a strategic partner in driving organizational growth, fostering a positive and inclusive workplace culture, and ensuring our team remains best in class.\n<br/>\n<strong>Responsibilities:</strong>\n<ul><li><strong>Strategic Leadership:</strong> Collaborate closely with the CEO and executive team to align HR initiatives with business objectives. Provide strategic guidance on talent management, organizational development, and workforce planning to support continued growth and scalability.</li><li><strong>Organizational Culture:</strong> Lead efforts to cultivate and reinforce a high-performance, inclusive culture that reflects our values and promotes employee engagement, retention, and development. Champion diversity, equity, and inclusion initiatives across all levels of the organization.</li><li><strong>Talent Acquisition and Retention:</strong> Develop and execute effective recruitment strategies to attract top talent. Implement best practices for onboarding, training, and career development to support employee growth and retention.</li><li><strong>Total Rewards and Benefits:</strong> Oversee the design and administration of competitive compensation, benefits, and reward programs that align with our strategic goals and enhance employee satisfaction and motivation.</li><li><strong>Performance Management:</strong> Establish and monitor performance evaluation systems and processes that drive accountability, reward achievement, and support professional growth and development.</li><li><strong>HR Operations and Compliance:</strong> Ensure HR policies, procedures, and practices comply with relevant employment laws and regulations. Implement efficient HR operations and systems to streamline processes and enhance employee experience.</li><li><strong>Change Management and M&A Integration:</strong> Play a key role in managing organizational change, particularly during periods of growth, restructuring, or integration following mergers and acquisitions. Lead integration efforts to align cultures, systems, and talent effectively.</li><li><strong>Employee Relations and Advocacy:</strong> Serve as a trusted advisor and resource for employees and managers on HR-related matters. Proactively address employee concerns, promote open communication, and foster a positive work environment.</li></ul>\n<br/>\n<strong>Qualifications:</strong>\n<ul><li>Proven experience as a senior HR leader with at least 10+ years in a strategic HR role, ideally within a similar sized environment where you are a hands-on leader.</li><li>Strong business acumen and demonstrated ability to align HR strategy with organizational goals and priorities.</li><li>Experience leading cultural transformation initiatives and driving organizational change.</li><li>Excellent communication and interpersonal skills, with the ability to build relationships and influence stakeholders at all levels.</li><li>Strategic thinker with analytical skills and a track record of implementing innovative HR solutions.</li><li>Bachelor’s degree in Human Resources, Business Administration, or a related field; advanced degree or HR certifications (e.g., SHRM-SCP, SPHR) preferred.</li></ul>\n<br/>\n<strong>Pay range and compensation package:</strong> $160-175K + Bonus 20%\n<br/>\n<strong>Equal Opportunity Statement:</strong> Include a statement on commitment to diversity and inclusivity.\n<br/>\nEmail your word document resume to HeatherS@ConexusRecruiting.com and reference the subject as Director of Human Resources.", "responsibilities": "Collaborate closely with the CEO and executive team to align HR initiatives with business objectives. Provide strategic guidance on talent management, organizational development, and workforce planning to support continued growth and scalability. Lead efforts to cultivate and reinforce a high-performance, inclusive culture that reflects our values and promotes employee engagement, retention, and development. Champion diversity, equity, and inclusion initiatives across all levels of the organization. Develop and execute effective recruitment strategies to attract top talent. Implement best practices for onboarding, training, and career development to support employee growth and retention. Oversee the design and administration of competitive compensation, benefits, and reward programs that align with our strategic goals and enhance employee satisfaction and motivation. Establish and monitor performance evaluation systems and processes that drive accountability, reward achievement, and support professional growth and development. Ensure HR policies, procedures, and practices comply with relevant employment laws and regulations. Implement efficient HR operations and systems to streamline processes and enhance employee experience. Play a key role in managing organizational change, particularly during periods of growth, restructuring, or integration following mergers and acquisitions. Lead integration efforts to align cultures, systems, and talent effectively. Serve as a trusted advisor and resource for employees and managers on HR-related matters. Proactively address employee concerns, promote open communication, and foster a positive work environment.", "qualifications": {"required": "Proven experience as a senior HR leader with at least 10+ years in a strategic HR role, ideally within a similar sized environment where you are a hands-on leader. Strong business acumen and demonstrated ability to align HR strategy with organizational goals and priorities. Experience leading cultural transformation initiatives and driving organizational change. Excellent communication and interpersonal skills, with the ability to build relationships and influence stakeholders at all levels. Strategic thinker with analytical skills and a track record of implementing innovative HR solutions.", "preferred": "Bachelor’s degree in Human Resources, Business Administration, or a related field; advanced degree or HR certifications (e.g., SHRM-SCP, SPHR) preferred."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3994311054"}