{"jobTitle": "Senior Designer (Corporate Studio) - Remote | WFH", "company": {"name": "Get It Recruit - Hospitality", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Human Resources Services", "description": "Welcome to our world of creativity and innovation. We are a team of passionate architects and designers dedicated to transforming spaces into extraordinary human experiences. Together, we drive every project forward with accountability, creativity, and a commitment to exceeding expectations.<br/><br/><strong>Role Overview<br/><br/></strong>As a Senior Designer in our Corporate Studio, you will lead design projects, manage documentation, and coordinate with consultants. You'll collaborate closely with our Design Principal and internal teams to deliver technically advanced and visually stunning corporate environments.<br/><br/><strong>What You Will Do<br/><br/></strong>Develop space plans, design concepts, and construction documents, ensuring adherence to codes and regulations.<br/><br/>Select colors, materials, and finishes that align with design concepts and functional requirements.<br/><br/>Create visualizations using 2D and 3D software like SketchUp and Photoshop.<br/><br/>Lead design presentations and mentor junior designers.<br/><br/>Coordinate with internal teams, clients, and external consultants to develop comprehensive design solutions.<br/><br/>Manage client expectations and ensure effective communication throughout projects.<br/><br/>Assist in preparing construction documents, including plans, elevations, details, and specifications.<br/><br/>Collaborate with allied professionals such as architects and engineers to resolve design issues.<br/><br/>Participate in presentations to secure new business opportunities.<br/><br/><strong>Your Qualifications<br/><br/></strong>Bachelor's or Master's Degree in Architecture or Interior Design.<br/><br/>10+ years of experience, with a strong track record in leading large-scale corporate, commercial, or hospitality projects.<br/><br/>Proficiency in AutoCAD &amp; REVIT is advantageous.<br/><br/>Skilled in SketchUp, Illustrator, and Photoshop.<br/><br/>Desired certifications: CID, LEED AP, NCIDQ.<br/><br/><strong>Life At Our Company<br/><br/></strong>We are an employee-owned company recognized as a top workplace in our community. Our ESOP program ensures every team member shares in our success. We foster a collaborative and supportive environment where creativity thrives.<br/><br/><strong>Join Our Team<br/><br/></strong>If you are passionate about design and eager to contribute to transformative projects, we invite you to apply. Come be part of a team that pushes boundaries and creates exceptional spaces.<br/><br/><strong>Apply Now<br/><br/></strong>Share your resume and portfolio to demonstrate your expertise and enthusiasm for this role.<br/><br/>Employment Type: Full-Time", "postedDate": "2 weeks ago", "skills": ["AutoCAD", "REVIT", "SketchUp", "Illustrator", "Photoshop", "Design", "Architecture", "Interior Design", "Leadership", "Project Management", "Communication", "Client Management", "Collaboration", "Visualization", "3D Modeling", "Construction Documents", "Space Planning", "Design Concepts", "Technical Design", "Corporate Design", "Commercial Design", "Hospitality Design"], "url": "https://www.linkedin.com/jobs/view/3994681452"}