{"jobTitle": "Supply Chain Planning Analyst II, Beverage RM (Hybrid)", "company": {"name": "Niagara Bottling", "location": "Diamond Bar, CA"}, "location": "Diamond Bar, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "77,796.00 - 112,805.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Food and Beverage Services", "description": "At Niagara, we’re looking for Team Members who want to be part of achieving our mission to provide our customers the highest quality most affordable bottled water.<br/><br/><strong>Consider Applying Here, If You Want To<br/><br/></strong><ul><li>Work in an entrepreneurial and dynamic environment with a chance to make an impact. </li><li>Develop lasting relationships with great people. </li><li>Have the opportunity to build a satisfying career.<br/><br/></li></ul>We offer competitive compensation and benefits packages for our Team Members.<br/><br/>Supply Chain Planning Analyst II, Beverage RM (Hybrid)<br/><br/>The Supply Chain Planning Analyst II, Beverage Raw Materials is a key member of the Supply Chain Planning organization supporting beverage manufacturing. The analyst is responsible for ensuring that the raw materials supply chain is continuously maintained, reducing spend and improving service. They are also responsible for driving efficiency and optimization in the raw material planning processes by analyzing and enhancing existing procedures, implementing best practices, and spearheading automation and cost optimization initiatives. These responsibilities go beyond traditional supply chain management to improve overall supply chain performance.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Evaluate network inventory and component demand to make purchasing decisions over a 90-day period</li><li>Collaborate with manufacturing, procurement, and supplier teams to address receiving issues and manage exceptions</li><li>Conduct root cause analysis to identify reasons for supply chain inefficiencies such as scrap, excess inventory, and supply failures, and recommend data-driven cost-effective solutions</li><li>Coordinate with IT teams to implement projects and establish EDI for suppliers to automate PO communications</li><li>Create supplier inventory plans and inventory policies to ensure a smooth supply, minimize overall costs, and manage risk</li><li>Ensure adherence to contractual requirements with vendors, inclusive of lead time, capacity, and volume</li><li>Build supplier relations through frequent interactions with supplier base, incorporating supplier feedback into processes as warranted. Act as liaison between internal teams and vendor teams</li><li>Work with Sales, Forecasting and FG planners to align on new item introductions, forecast opportunities, production updates, and other areas</li><li>Work with suppliers to establish VMI process and practices inclusive of IT infrastructure to support</li><li>Minimize corporate driven scrap by regularly assessing the age of raw materials and carrying out inventory rebalancing.</li><li>Partner with procurement to develop annual supplier-specific sourcing plan, including alignment and supplier inventory build plan</li><li>Make sure that all follow-ups are carried out promptly and that all communications are responded to within one business day.</li><li>Regularly monitor Raw Material-related metrics to evaluate compliance with targets and take necessary measures as required.<br/><br/></li></ul>Please note this job description is not designed to contain a comprehensive list of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without prior notice.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>Minimum Qualifications:</li><ul><li>2 Years – Experience in Purchasing, MRP, Procurement, Planning or similar function</li><li>2 Years – Experience in Position</li><li>0 Years – Experience managing people/projects<br/><br/></li></ul></ul><ul><li>experience may include a combination of work experience and education</li><li>Travels approximately 10%</li><li>Preferred Qualifications:</li><ul><li>4 Years – Experience in Purchasing, MRP, Procurement, Planning, or similar function</li><li>4 Years – Experience in Position</li><li>0 Years – Experience managing people/projects</li></ul><li>experience may include a combination of work experience and education<br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Proficiency in Microsoft Office suite, with strong grasp of Microsoft Excel</li><li>Strong attention to detail and organization</li><li>Track record of leadership</li><li>Data-driven approach to problem solving</li><li>Excellent verbal and written communication</li><li>Ability to collaborate with internal and external stakeholders</li><li>Knowing when face to face vs. phone vs. email vs. text communication is appropriate</li><li>Ability to tailor message to audience<br/><br/></li></ul>This position also embodies the values of Niagara’s LIFE competency model, focusing on the following key drivers of success:<br/><br/><ul><li>Lead Like an Owner</li><ul><li>Makes safety the number one priority</li><li>Keeps alert for safety issues and escalates immediately</li><li>Effectively prioritizes tasks based on department goals</li><li>Shows respect to others and confronts interpersonal issues directly</li><li>Prioritizes resolution of customer issues effectively</li><li>Responds promptly and honors commitments to internal and external customers</li></ul><li>InnovACT</li><ul><li>Makes recommendations to continuously improve policies, methods, procedures, and/or products</li><li>Demonstrates adaptability by reacting appropriately to unexpected changes in situations or circumstances</li><li>Increases performance through greater efficiency</li></ul><li>Find a Way</li><ul><li>Seeks to develop technical knowledge through learning from other experts</li><li>Understands interdepartmental impact of individual decisions and actions</li><li>Seeks solutions rather than placing blame</li></ul><li>Empowered to be Great</li><ul><li>Consistently looks for ways to improve one’s self through growth and development opportunities</li><li>Communicates clearly and promptly up, down, and across</li><li>Communicates effectively to manage expectations<br/></li></ul></ul><strong>Education<br/><br/></strong><ul><li>Minimum Required:</li><ul><li>Bachelor's Degree in Supply Chain, Industrial Engineering, Economics, Finance or Manufacturing<br/><br/></li></ul></ul><ul><li>Preferred:</li><ul><li>Bachelor's Degree in Supply Chain, Industrial Engineering, Economics, Finance or Manufacturing<br/></li></ul></ul><strong>Certification/License<br/><br/></strong><ul><li>Required: N/A</li><li>Preferred: Excel, database development, Six Sigma<br/><br/></li></ul><strong>Foreign Language <br/><br/></strong><ul><li>Required: None Required</li><li>Preferred: Elementary Proficiency in Spanish<br/><br/></li></ul><strong>Typical Compensation Range<br/><br/></strong>Pay Rate Type: Salary<br/><br/>$77,796.00 - $112,805.00 / Yearly<br/><br/><strong>Benefits<br/><br/></strong>https://careers.niagarawater.com/us/en/benefits<br/><br/><strong>Any employment agency, person or entity that submits a résumé into this career site or to a hiring manager does so with the understanding that the applicant's résumé will become the property of Niagara Bottling, LLC. Niagara Bottling, LLC will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity.<br/><br/></strong><strong>Employment agencies that have fee agreements with Niagara Bottling, LLC and have been engaged on a search shall submit résumé to the designated Niagara Bottling, LLC recruiter or, upon authorization, submit résumé into this career site to be eligible for placement fees.<br/><br/></strong>Niagara Plant Name<br/><br/>CORP-MAIN", "responsibilities": "The Supply Chain Planning Analyst II, Beverage Raw Materials is a key member of the Supply Chain Planning organization supporting beverage manufacturing. The analyst is responsible for ensuring that the raw materials supply chain is continuously maintained, reducing spend and improving service. They are also responsible for driving efficiency and optimization in the raw material planning processes by analyzing and enhancing existing procedures, implementing best practices, and spearheading automation and cost optimization initiatives. These responsibilities go beyond traditional supply chain management to improve overall supply chain performance.", "qualifications": {"required": "2 Years – Experience in Purchasing, MRP, Procurement, Planning or similar function\n2 Years – Experience in Position\n0 Years – Experience managing people/projects", "preferred": "4 Years – Experience in Purchasing, MRP, Procurement, Planning, or similar function\n4 Years – Experience in Position\n0 Years – Experience managing people/projects"}, "skills": ["Microsoft Office", "Microsoft Excel", "Leadership", "Problem Solving", "Communication", "Collaboration", "Spanish"], "postedDate": "2 weeks ago", "benefits": "https://careers.niagarawater.com/us/en/benefits", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3994785004"}