{"jobTitle": "Sales Operations Analyst", "company": {"name": "Express Employment Professionals - Columbus, OH - West", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "95,000.00/yr - 110,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst and Sales", "industry": "Manufacturing", "description": "Our client is the leading full-service provider of architectural metals and glass fittings. They are seeking a detail-oriented and proactive Sales Operations Analyst to join their dynamic team. The ideal candidate will be instrumental in driving sales performance by providing insightful reporting, proactive analysis, and business intelligence automation.", "responsibilities": "The Sales Operations Analyst will be responsible for developing and managing reporting systems, analyzing sales data, and automating business intelligence processes. This role involves integrating data across platforms, staying ahead of industry trends, and delivering actionable insights through pipeline reporting.", "qualifications": {"required": "Bachelor’s degree in Business Administration, Finance, Data Science, or a related field. Advanced degrees or certifications in analytics or business intelligence are a plus. Proven experience in a sales operations or analytical role, preferably within a sales-focused environment. Strong proficiency in data analysis and reporting tools (e.g., Excel, SQL, Tableau, Power BI). Experience with business intelligence and automation tools. Excellent analytical and problem-solving skills, with the ability to turn data into actionable insights. Strong communication skills, with the ability to present complex information clearly. Ability to work collaboratively across teams and manage multiple priorities effectively. Knowledge of CRM systems (e.g., Salesforce) and experience with data integration are advantageous.", "preferred": ""}, "skills": ["Sales Operations", "Business Intelligence", "Data Analysis", "Reporting", "Excel", "SQL", "Tableau", "Power BI", "CRM", "Salesforce", "Data Integration"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Competitive salary and benefits package. Opportunities for professional growth and development. A dynamic and supportive work environment.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994910286"}