{"jobTitle": "Executive Assistant", "company": {"name": "Hermeus", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Finance and Consulting", "industry": "Financial Services and Hospitals and Health Care", "description": "Hermeus is an aerospace and defense technology company founded to radically accelerate air travel by delivering hypersonic aircraft. The company aims to develop hypersonic aircraft quickly and cost-effectively by integrating hardware-rich, iterative development with modern computing and autonomy. This approach has been validated through design, build, and test of the company’s first combined turbojet-ramjet engine and is now being scaled through its first flight vehicle program, Quarterhorse. Hermeus is also developing Darkhorse — an uncrewed hypersonic aircraft designed to deliver unique asymmetric capabilities to the warfighter.<br/><br/>We need your help to effectively manage the wide range of time demands for a small group of senior executives at Hermeus. You’ll be empowered to own the executive’s calendar and help them more effectively manage when, where, and how they execute their duties. Your impact on the business is massive as you team with the business’ senior leaders to deliver the world’s fastest airplane.<br/><br/><strong>About the position:<br/><br/><br/></strong><ul><li>Manage daily calendars for :3 senior executives, including vetting, prioritization, and recommendations </li><li>Respond to internal and external meeting requests </li><li>Arrange travel, accommodations, itineraries, and all correspondence related to arrangements as needed </li><li>Act as point of contact for external guests </li><li>Plan and host external meetings </li><li>Establish the standard for all future EA hires at Hermeus. This includes building out any processes/standards <br/><br/><br/><br/></li></ul><strong>Requirements:<br/><br/><br/></strong><ul><li>A minimum of 4+ years administrative experience supporting senior level executives in a corporate environment preferred </li><li>Excellent written, verbal, and interpersonal communication skills. Approachable style and ability to effectively and professionally interface with high level executives, clients, employees and business associates both internal and external </li><li>Demonstrated ability to prioritize leaders’ calendar, making judgment calls based on quickly shifting priorities </li><li>Strong organizational and time management skills. Proven excelenceexcellence in multi-tasking and working with multiple people and priorities, while delivering on high quality results and follow through </li><li>Demonstrates curiosity and a desire to understand the company goals </li><li>Ability to handle constant change </li><li>Proven ability to handle confidential and sensitive information in a professional manner </li><li>Excellent attention to detail and accuracy </li><li>Strong Microsoft Office Suite skills </li><li>Proficient in scheduling meetings in multiple time zones </li><li>Experience planning and booking international travel </li><li>Handling exec's monthly expense reports </li><li>Bachelor’s degree or equivalent practical experience <br/><br/><br/><br/></li></ul><em>We encourage you to apply even if you have skillsets and experience outside of our current needs as we're always open to connect and discuss future opportunities.</em>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994728830"}