{"jobTitle": "Men's Merchant", "company": {"name": "Outerknown", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "At Outerknown, we're making every decision with the highest regard for the hands that build our clothes and the world we call home. From seed to suppliers to circular design, our mission is to protect our natural resources, empower the people crafting our clothes, and inspire change within the industry and beyond. We believe you shouldn't have to sacrifice style for sustainability - the two should be synonymous.<br/><br/>A place for community and product discovery, both paying homage to those that came before and continuing the legacy. Outerknown is looking to find a Merchandiser to support the Director of Merchandising in being the strategic link between the product and marketing team. The Merchandiser will leverage their organizational and analytical skills, as their eye for relevant trends, to support the Outerknown brand and the achievement of financial goals. The ideal candidate will be flexible, passionate, detail oriented, results driven, proactive, and demonstrate strong communication skills.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Participate in merchandising strategies and creation of seasonal assortment plans to build profitable assortments that will meet internal margin goals</li><li>Assist in monitoring weekly sales, analyzing style performance and market trends to better understand channel specific needs and opportunities</li><ul><li>Learn to understand target customers by shopping retail stores and providing competitive analysis to enhance brand strategies and opportunities </li><li>Assist in the development of inventory and markdown strategies that fuel company sales objectives</li></ul><li>Partner with Director of Merchandising on seasonal style line plan creation and maintenance including but not limited to style number creation, color codes, and product variable data coding for PLM system</li><li>Facilitate communication with internal teams on additions and cancellations to the line plan and ensure the line sheets remain accurate and updated</li><li>Assistant the Director of Merchandising in maintaining the design calendar and development process to ensure timely completion</li><li>Participate in development Milestone Meeting preparation, including sketch reviews, line assortment reviews, proto reviews, pricing and margin reviews, and internal sales presentations </li><li>Accountable for all aspects of sample management:</li><ul><li>Work closely with product development to manage incoming photo samples</li><li>Organize, maintain, and prepare samples for merchant presentations and requests from business partners</li><li>Manage and organize the sample archive </li></ul><li>Assist in the seasonal e-commerce asset creation:</li><ul><li>Collaborate with the creative team on product descriptions</li><li>Create shot list for seasonal photo assets and work closely with in-house photographer to ensure completion</li><li>Work with Director of Merchandising on styling of both mens collections, and assist on photoshoots </li><li>Review photo assets and ensure they meet Outerknown standards</li></ul><li>Interface with all functional areas of the business including design, e-commerce, production, marketing and PR to maintain successful workflow <br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s Degree or equivalent experience in design, business, or marketing</li><li>Apparel merchandising/buying background required; contemporary womens and menswear experience a plus, planning experience a plus</li><li>An understanding of the Outerknown brand and mission and how they translate to the collections at the e-commerce level</li><li>Demonstrated ability to set initiatives and deliver results while maintaining a positive attitude</li><li>Self-motivated and organized with a strong work ethic and ability to excel in a team environment</li><li>Excellent communication skills, both written and interpersonal</li><li>A keen eye for fashion and style and great attention to detail</li><li>Strong skills in Microsoft Outlook, Word, and Excel</li><li>Skills in Adobe Suite (Illustrator, In Design, Photoshop) a plus<br/><br/></li></ul>COVID-19 Vaccinations: Outerknown requires all employees to demonstrate proof of receiving all COVID-19 vaccinations that they are eligible for, as a condition of their employment.<br/><br/>This hybrid position will be based in our corporate office in Culver City, CA.", "postedDate": "2 weeks ago", "skills": ["Microsoft Outlook", "Microsoft Word", "Microsoft Excel", "Adobe Illustrator", "Adobe InDesign", "Adobe Photoshop"], "url": "https://www.linkedin.com/jobs/view/3994512615"}