{"jobTitle": "PACE Program Vice President", "company": {"name": "Goodwin Recruiting", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Project Management and Information Technology", "industry": "Staffing and Recruiting", "description": "<strong>To Apply for this Job Click Here<br/><br/></strong>Our esteemed senior healthcare organization is looking for a Vice President to lead our expanding PACE program. Review the qualifications below, and if they match your experience, click APPLY today!<br/><br/><strong>PACE Vice President Responsibilities<br/><br/></strong><ul><li>Work closely with executive leadership to continue current growth trajectory</li><li>Lead PACE Program operations for existing centers and oversee the launch of new sites</li><li>Collaborate with and support the President of the PACE program in advancing initiatives and ensuring program compliance</li><li>Ensure effective staffing for the smooth operation of each center.<br/><br/></li></ul><strong>PACE Vice President Requirements<br/><br/></strong><ul><li>5-7 years of VP Level or Regional Leadership and/or Business Development in Non-Profit Senior Living/Senior Care</li><li>Knowledge of PACE program preferred</li><li>Demonstrated collaborative leadership style and a proven track record of sustained portfolio growth within a region</li><li>Experience in launching and supporting senior care facilities in new territories.<br/><br/></li></ul><strong>PACE Vice President Benefits<br/><br/></strong><ul><li>Competitive salary, with bonus opportunities</li><li>Comprehensive benefits package</li><li>Great work environment with opportunity for growth</li><li>Hybrid work model<br/><br/></li></ul>At Goodwin Recruiting we are committed to our core values. We take our value, Dedicated to Diversity &amp; Inclusion, very seriously and will never discriminate against a candidate or client based on any protected classes. Our clients seek qualified candidates, and that is what we deliver. A person's age, gender, race, sexual orientation, gender identity, national origin, veteran or disability status, or arrest or conviction record has no bearing on whether he, she, or they are able to do the job. We evaluate the knowledge, skills, and abilities that meet the requirements of the position and aim to open doors and change lives. We value all people, understanding that uniqueness and diversity foster a stronger team that is innovative and brings varying perspectives to the table. We put our money where our mouth is and are proud of our efforts to identify a broad slate of candidates, with many hiring success stories to share. <strong>JOB ID</strong>: 141637 #post<br/><br/>Samantha McDermott<br/><br/><strong>To Apply for this Job Click Here<br/><br/></strong>, $250,000 - $300,000,<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994408222"}