{"jobTitle": "Operations Coordinator - Hollywood", "company": {"name": "Sunset Studios", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "26.00 to 31.00 an hour USD", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "At Hudson Pacific Properties, we provide best-in-class office space to the biggest names in tech (Netflix and Amazon). We're seeking an Operations Coordinator to support our Sunset Studios property in Hollywood. This successful candidate will assist in all aspects of property management for assigned Studio properties, including, but not limited to, tenant relations, operations, financial and administrative duties.\n\nWhat You'll Do\n\n* Help administer the collection of account receivables.\n* Review account payable invoices and process them as necessary.\n* Assist in processing purchase orders for operations, construction, and engineering.\n* Prepare accurate tenant bill-backs and internal re-bills promptly, providing supporting materials.\n* Respond promptly to tenant requests for engineering, security, production services, maintenance, janitorial services, etc., and manage the work order system for appropriate personnel.\n* Assist in updating tenant and emergency contact lists and other necessary formal tenant communications.\n* Assist with tenant move-in and move-out procedures, communication, and processes.\n* Assist with managing maintenance and janitorial vendors to maintain a high level of presentation throughout the assigned Studio, i.e., lobby, sound stages, elevators, corridor, restroom, vacant spaces, etc.\n* Manage Certificates of Insurance for vendors through 3rd party auditing system.\n* Assist Operations Manager with receiving documentation for annual Operational Audit.\n* Regularly inspect property's appearance, including signs, directories, elevators, corridors, restrooms, and vacant spaces, prepare punch lists, and work with contractors on repairs.\n* Collection of other necessary documents for tenant files (i.e., leases, amendments, build-out, sign plans, estoppel letters, etc.).\n* Assist with meeting minutes in recurring Operational meetings.\n* Oversee general office duties, including ordering daily staff lunches, kitchen inventory and restock, office supply inventory and restock, collecting mail and maintaining mail room, and ensuring office presentation is clean.\n* Answer front desk phone line for Studio.\n* Assist across the studio operations team, including administrative support as needed.\n* Miscellaneous projects as assigned.\n\nWhat You'll Need\n\n* Preferred of two years in commercial real estate or property management.\n* Prior experience in production or studio operations is a plus.\n* Excellent computer skills and demonstrated working knowledge of computers and software, including MS Windows, Word, Excel, and PowerPoint.\n* Knowledge of basic accounting.\n* Polished professional demeanor with strong communication, presentation, and interpersonal skills to interact with tenants, vendors, and other contacts.\n* Ability to work under pressure and manage competing priorities while staying focused and meeting deadlines without sacrificing accuracy.\n* Ability to multi-task and work independently with a keen eye for detail.\n\nSalary Range: $26.00 to $31.00 an hour USD (subject to relevant experience)\n\nAbout Us\n\nHudson Pacific Properties (NYSE: HPP) is a real estate investment trust serving dynamic tech and media tenants in global epicenters for these synergistic, converging, and secular growth industries. Hudson Pacific's unique and high-barrier tech and media focus leverages a full-service, end-to-end value creation platform forged through deep strategic relationships and niche expertise across identifying, acquiring, transforming, and developing properties into world-class amenitized, collaborative, and sustainable office and studio space.\n\nHudson Pacific Properties is proud to be an Equal Opportunity/Affirmative Action employer. Individuals seeking employment are considered without regards to race, ethnicity, color, creed, religion, sex, sexual orientation, marital status, age, disability, gender identity or expression, genetic information, national origin, protected veteran status or any other classification protected by law.", "responsibilities": "Help administer the collection of account receivables.\nReview account payable invoices and process them as necessary.\nAssist in processing purchase orders for operations, construction, and engineering.\nPrepare accurate tenant bill-backs and internal re-bills promptly, providing supporting materials.\nRespond promptly to tenant requests for engineering, security, production services, maintenance, janitorial services, etc., and manage the work order system for appropriate personnel.\nAssist in updating tenant and emergency contact lists and other necessary formal tenant communications.\nAssist with tenant move-in and move-out procedures, communication, and processes.\nAssist with managing maintenance and janitorial vendors to maintain a high level of presentation throughout the assigned Studio, i.e., lobby, sound stages, elevators, corridor, restroom, vacant spaces, etc.\nManage Certificates of Insurance for vendors through 3rd party auditing system.\nAssist Operations Manager with receiving documentation for annual Operational Audit.\nRegularly inspect property's appearance, including signs, directories, elevators, corridors, restrooms, and vacant spaces, prepare punch lists, and work with contractors on repairs.\nCollection of other necessary documents for tenant files (i.e., leases, amendments, build-out, sign plans, estoppel letters, etc.).\nAssist with meeting minutes in recurring Operational meetings.\nOversee general office duties, including ordering daily staff lunches, kitchen inventory and restock, office supply inventory and restock, collecting mail and maintaining mail room, and ensuring office presentation is clean.\nAnswer front desk phone line for Studio.\nAssist across the studio operations team, including administrative support as needed.\nMiscellaneous projects as assigned.", "qualifications": {"preferred": "Two years in commercial real estate or property management.\nPrior experience in production or studio operations is a plus.", "required": "Excellent computer skills and demonstrated working knowledge of computers and software, including MS Windows, Word, Excel, and PowerPoint.\nKnowledge of basic accounting.\nPolished professional demeanor with strong communication, presentation, and interpersonal skills to interact with tenants, vendors, and other contacts.\nAbility to work under pressure and manage competing priorities while staying focused and meeting deadlines without sacrificing accuracy.\nAbility to multi-task and work independently with a keen eye for detail."}, "skills": ["Property Management", "Commercial Real Estate", "Production", "Studio Operations", "MS Windows", "Word", "Excel", "PowerPoint", "Accounting", "Communication", "Presentation", "Interpersonal Skills", "Multi-tasking", "Detail-oriented"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994802562"}