{"jobTitle": "Purchasing Coordinator", "company": {"name": "Staffing Ninja", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Manufacturing, Art/Creative, and Management", "industry": "Packaging and Containers Manufacturing and Manufacturing", "description": "<strong>Role Description:</strong>\n<p>The Purchasing Coordinator is responsible for managing orders, including project tracking and support, to ensure a seamless and reliable experience for our customers. This role involves working closely with customers and internal overseas offices to ensure successful project orders, providing updates throughout the project lifecycle, and meeting key milestones. Success in this role depends on effective communication with customers and the ability to coordinate and deliver projects on time, engaging with beauty brands, factories, and other stakeholders.</p>\n<p><br/></p>\n<p><strong>Duties and Responsibilities:</strong></p>\n<ul>\n<li>Independently manage projects through their lifecycle, including order confirmation, issuance, checking in, and shipping.</li>\n<li>Review incoming purchase orders, confirm pricing, lead times, and estimated completion dates with customers and manufacturing factories.</li>\n<li>Coordinate purchase orders across departments: Accounting, Logistics, Sales, and Management.</li>\n<li>Handle minor changes to orders and review customer artwork, suggesting necessary modifications.</li>\n<li>Cultivate and manage relationships by briefing factories and providing feedback to customers.</li>\n<li>Maintain and organize component and inspection specifications.</li>\n<li>Troubleshoot and address customer issues promptly.</li>\n<li>Complete internal and external communications and administrative tasks in a timely manner.</li>\n<li>Review weekly open order reports and update on the status of completion dates.</li>\n<li>Address any order delays with factories and customers.</li>\n<li>Inspect final packaging and quality/aesthetic with the QC team before shipment.</li>\n<li>Confirm final shipment details with customers.</li>\n</ul>\n<p><br/></p>\n<p><strong>Job Requirements:</strong></p>\n<ul>\n<li>Strong interest and passion for the beauty industry, beauty products, skin health, and artistry.</li>\n<li>Experience with time tracking is strongly desired.</li>\n<li>Proficiency in Microsoft Office (Word, PowerPoint, Excel, Outlook).</li>\n</ul>", "postedDate": "2 weeks ago", "skills": ["Microsoft Office", "Excel", "Outlook", "Word", "PowerPoint", "Time Tracking", "Beauty Industry", "Customer Service", "Project Management", "Communication", "Coordination", "Problem Solving", "Relationship Management", "Administrative Tasks", "Order Management", "Project Tracking", "Artwork Review", "Quality Control", "Packaging Inspection", "Shipment Confirmation"], "url": "https://www.linkedin.com/jobs/view/3994351055"}