{"jobTitle": "Assistant Clinic Manager II", "company": {"name": "El Proyecto del Barrio, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Medical Practices", "description": "<strong>POSITION:</strong> ASSISTANT CLINIC MANAGER II<br/><br/><strong>Position Status:</strong> Exempt<br/><br/><strong>RESPONSIBILITIES:</strong> The Assistant Clinic Manager II reports directly to the Clinic Manager III. S/he is responsible for assisting in the administration and operational coordination of clinic services and programs. S/he will monitor and keep Clinic Manager informed of progress and compliance with goals and objectives for the clinic and other related programs. S/he will assist in ensuring that all applicable clinic licenses and certifications are renewed annually. S/he will participate in the annual updates of clinic policies and procedures; assist in the development of a comprehensive continuum of care for patients using Patient Centered Medical Home (PCMH) principles and objectives. Assist in ensuring that the monthly productivity report is prepared accurately and timely; assist in reporting and resolving staff and patient complaints; Respond to grievances and assist in meeting productivity goals, CQM and HEDIS measures. Assist in staff compliance with BLS, Relias, Ninjio, eCW trainings. Assist in conducting planning meetings with Clinic Manager; assist the Clinic Manager with program audits; assist in the supervision of staff, performance evaluations, review and approve, time-off and punch requests, timecards. Submit Personnel Action Forms (PAF) for personnel changes. Attends assigned meetings. Carry-out Clinic Manager functions in their absence. S/he will perform other job duties as assigned by the Clinic Manager.<br/><br/><strong>REQUIREMENTS:</strong> Excellent written and oral skills required. Bilingual (Spanish/English) preferred, but not required. Mature judgment, tact, discretion and confidentiality are mandatory. Must be proficient in Microsoft applications, i.e. Word, Excel, PowerPoint. Electronic Health Record (EHR) knowledge and experience referred.<br/><br/><strong>OTHER REQUIREMENTS:</strong> Must possess a dependable automobile with insurance and a valid California Driver’s License. Must submit to and pass a drug test and a Criminal Background Check as a pre-condition for employment. TB test, Hepatitis B, Flu and COVID-19 Vaccines and Boosters required. BLS/CPR certification is required.<br/><br/><strong>QUALIFICATIONS:</strong> Possession of a valid license to practice as a Registered Nurse in the State of California. Must have a minimum two (2) years’ experience in the medical/health industry <strong>OR</strong> equivalent combination of education and experience.<br/><br/><ul><li> AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER –</li></ul>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994155526"}