{"jobTitle": "Director of Business Development, Pet Supplements", "company": {"name": "Kalon Executive Search for Health and Wellness", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$180,000 + Commission", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Animal Feed Manufacturing and Wellness and Fitness Services", "description": "Our client, a leading global functional ingredient company is seeking a Director of Business Development, Pet Supplements that will direct the development of new ingredients, products and processes by collaborating with sales, operations, and conferring with customers, leading direct reports, and providing support for process changes and corrective action. This role is pivotal in promoting our client’s bioactive ingredients portfolio, primarily targeting Animal Nutrition customers, including pet supplement companies. The Director will be responsible for taking our client's innovative ingredients to these companies, helping them develop and market high-quality pet supplements. This global role involves strategic prioritization and collaboration with regional teams to execute commercial strategies.", "responsibilities": "Develop a 5-year Strategic Growth Plan based on market analysis, consumer trends, and competitive landscape, focusing on customer segmentation and cross-selling opportunities.\nAchieve revenue and gross margin targets aligned with the Strategic Growth Plan.\nRecommend and develop product portfolios tailored to regional needs in collaboration with R&D.\nCreate short and medium-term commercial plans to expand the customer pipeline in the Animal Nutrition market segment, including livestock, aquaculture, and pet supplements.\nWork with customers’ R&D teams and our client’s CD&D teams to integrate bioactive solutions into final product matrices.\nProvide technical service support to customers in coordination with our client’s microbiome R&D and CD&D teams globally.\nAlign go-to-market activities with our client's Animal Nutrition teams and coordinate messaging with the marketing team.", "qualifications": {"required": "A Bachelor’s degree in biochemistry, microbiology, chemistry, or a related life sciences field is preferred.\nMust have prior experience in the Pet Supplement or Food industry.\nMinimum of 5 years of successful leadership in business development/sales or product management within the probiotics industry, focusing on companion animals.\nPrevious experience in market development, introduction, and commercialization of new probiotic-based Animal Nutrition products, including project management.\nProven ability to collaborate across a matrix organization, preferably at a global level.\nKey metrics include Revenue, Gross Margin, and Operational Profit.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "401(k) matching\nCell phone reimbursement\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nVision insurance", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994935119"}