{"jobTitle": "Sr. Human Resources Business Partner", "company": {"name": "Vaco", "location": "Chatsworth, CA"}, "location": "Chatsworth, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$125,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Vaco LA is working with a client in the Aerospace manufacturing industry who is looking for an experience Sr. HR Business Partner to come and join their HR team. As a HR Business Partner key responsibilities will include providing strategic leadership and managing day to day HR operations. This opportunity will be located in Chatsworth CA is fully in office, and is looking to pay between 125k-150k on a direct hire basis.<strong> Experience working in the Manufacturing industry and for a smaller company, 100 or less, highly preferred. <br/><br/></strong>This opportunity provides an amazing company culture with great opportunity for growth and development, great team collaboration, and bi-weekly Fridays off. If you are interested, please apply today! <br/> <strong>Key Responsibilities:</strong><ul><li>Develop and implement HR strategies aligned with business objectives.</li><li>Manage the full employment lifecycle, including recruitment, onboarding, and performance management.</li><li>Partner closely with hiring managers to streamline HR processes and support business needs.</li><li>Lead change management initiatives within the HR function.</li><li>Administer benefits programs and ensure compliance with policies.</li><li>Foster cross-functional collaboration to optimize HR strategies across departments.</li><li>Conduct new hire orientation and 30-60-90 day check-ins.</li><li>Maintain stability in employment practices and ensure adherence to legal regulations.<br/><br/></li></ul><strong>Qualifications:</strong><ul><li>Bachelor's degree (BA/BS) in Human Resources or related field.</li><li><strong>8-10 years of HR Business Partner experience required for role </strong></li><li><strong>Experience working in the Aerospace, Defense, or Manufacturing a must </strong></li><li><strong>Experience working for a smaller company 100 or less highly preferred</strong></li><li>Strong expertise in managing employee engagement and driving HR initiatives.</li><li>Excellent written and verbal communication skills.</li><li>Proven ability to thrive in a fast-paced, dynamic environment.</li><li>Hands-on experience with benefits administration and employment law compliance.</li></ul>", "responsibilities": "Develop and implement HR strategies aligned with business objectives. Manage the full employment lifecycle, including recruitment, onboarding, and performance management. Partner closely with hiring managers to streamline HR processes and support business needs. Lead change management initiatives within the HR function. Administer benefits programs and ensure compliance with policies. Foster cross-functional collaboration to optimize HR strategies across departments. Conduct new hire orientation and 30-60-90 day check-ins. Maintain stability in employment practices and ensure adherence to legal regulations.", "qualifications": {"required": "Bachelor's degree (BA/BS) in Human Resources or related field. 8-10 years of HR Business Partner experience required for role  Experience working in the Aerospace, Defense, or Manufacturing a must  Experience working for a smaller company 100 or less highly preferred Strong expertise in managing employee engagement and driving HR initiatives. Excellent written and verbal communication skills. Proven ability to thrive in a fast-paced, dynamic environment. Hands-on experience with benefits administration and employment law compliance.", "preferred": ""}, "skills": ["HR", "HR Business Partner", "Aerospace", "Defense", "Manufacturing"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994371958"}