{"jobTitle": "Senior Logistics Manager", "company": {"name": "Ethik Brands", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "description": "We are looking for a reliable Logistics Manager to be responsible for the overall supply chain management and Ecom for a denim company. Logistics Manager responsibilities include organizing and monitoring storage and distribution of goods. The goal is to manage the entire order cycle so as to enhance business development and ensure sustainability and customer satisfaction. Customers includes – Nordstrom, Fashion Nova, Ross, Burlington, TJ Maxx, Marshalls among others.Duties &amp; responsibilities include but not limited to:Monitoring shipments departing from China until arrival in our San Fernando warehouse.Oversee all outgoing and incoming goods.Leading warehouse team is preparing orders in timely fashion according to each customer’s compliance/guidelines. Repairing &amp; replacing cartons and labels as needed.Routing of purchase orders in timely manner according to ship out deadlines.EDI – Creation of UPC codes to GXS catalogue. Follow-up and checking of received EDI orders before forwarding to China team.EDI – Creation if UCC labels as needed, China team is responsible for sending out all EDI orders with UCC pre-attachedCoordinate with Accounting Dept with all shipped goods – BOL’s, Packing Lists, etc.Coordinate with QC team to inform them of received orders that will require inspection", "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "responsibilities": "Monitoring shipments departing from China until arrival in our San Fernando warehouse. Oversee all outgoing and incoming goods. Leading warehouse team is preparing orders in timely fashion according to each customer’s compliance/guidelines. Repairing &amp; replacing cartons and labels as needed. Routing of purchase orders in timely manner according to ship out deadlines. EDI – Creation of UPC codes to GXS catalogue. Follow-up and checking of received EDI orders before forwarding to China team. EDI – Creation if UCC labels as needed, China team is responsible for sending out all EDI orders with UCC pre-attached Coordinate with Accounting Dept with all shipped goods – BOL’s, Packing Lists, etc. Coordinate with QC team to inform them of received orders that will require inspection", "qualifications": {"required": "", "preferred": ""}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3994376467"}