{"jobTitle": "Executive Operations Coordinator", "company": {"name": "Association Of South Bay Surgeons", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Medical Practices", "description": "Join Our Team as a Senior Administrative Assistant!<br/><br/><strong>About The Team<br/><br/></strong>Join a dynamic team supporting a VP, 2 Sr. Directors, and the Experience Design department. We are seeking a highly organized and flexible team player to thrive in a fast-paced environment.<br/><br/><strong>About The Role<br/><br/></strong>As a Senior Administrative Assistant, you will manage complex schedules, events, and projects while providing essential support to our leadership team. The ideal candidate will possess excellent communication skills, attention to detail, and the ability to work independently across different time zones.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Manage schedules and calendars for multiple leaders</li><li> Prioritize tasks effectively with a sense of urgency</li><li> Coordinate travel and prepare expense reports</li><li> Assist with meeting planning and logistics</li><li> Support with administrative tasks and projects</li><li> Foster relationships across all departments<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Minimum 4 years of executive support experience</li><li> Ability to handle ambiguity and maintain confidentiality</li><li> Strong problem-solving skills and proactive attitude</li><li> Excellent organization and multitasking abilities</li><li> Proficiency in Microsoft Office, Slack, and G Suite</li><li> Flexibility to adapt to last-minute changes</li><li> Availability between 8am - 3pm PDT<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> Dental and health insurance</li><li> Paid time off</li><li> Parental leave</li><li> Vision insurance<br/><br/></li></ul><strong>Get To Know Us<br/><br/></strong>At the Association of South Bay Surgeons, we provide compassionate surgical care to our community. Join our team of dedicated professionals committed to delivering high-quality patient-centered care.<br/><br/>Apply now to be a key player in our team as a Senior Administrative Assistant!<br/><br/>Employment Type: Part-Time", "responsibilities": "Manage schedules and calendars for multiple leaders, Prioritize tasks effectively with a sense of urgency, Coordinate travel and prepare expense reports, Assist with meeting planning and logistics, Support with administrative tasks and projects, Foster relationships across all departments", "qualifications": {"required": "Minimum 4 years of executive support experience, Ability to handle ambiguity and maintain confidentiality, Strong problem-solving skills and proactive attitude, Excellent organization and multitasking abilities, Proficiency in Microsoft Office, Slack, and G Suite, Flexibility to adapt to last-minute changes, Availability between 8am - 3pm PDT", "preferred": ""}, "skills": ["Microsoft Office", "Slack", "G Suite"], "postedDate": "2 weeks ago", "benefits": "Dental and health insurance, Paid time off, Parental leave, Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994679681"}