{"jobTitle": "Public Relations Customer Success Lead", "company": {"name": "PR Volt", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "PR Volt is seeking a dynamic and experienced professional to join our team as a PR Customer Success Lead, a role crucial to our goal of delivering top-notch public relations solutions to our diverse portfolio of clients. As pioneers in automation and AI-driven public relations, we have consistently garnered impactful media coverage for our clients in various industries including B2C, B2B, lifestyle, and technology.<br/><br/>In this role, you will lead a dynamic team of Campaign Managers, responsible for delivering innovative and effective PR strategies for our clients. You will not just ensure that our clients' business objectives are translated into result-oriented PR tactics, but also focus on monitoring account health, driving customer renewals, and guiding account expansions. Collaborating with the product team for new feature adoption and hiring and training new Campaign Managers will also fall under your purview.<br/><br/>As an ideal candidate, you will bring not only significant PR and Customer Success experience but also a genuine passion for startups, technology, and the ambition to disrupt the PR industry with groundbreaking approaches.<br/><br/>Join PR Volt and play a pivotal role in shaping the future of public relations and driving exceptional PR results for our clients.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Working as part of a global business with a diverse team</li><li>Opportunity to grow from the ground up with an early-stage start-up</li><li>Health insurance tax-free reimbursement monthly stipend</li><li>15 days PTO + 6 paid US holidays, which do not count against PTO days</li><li>Flexible work hours and location (we are a remote 1st company and this is a remote role)</li><li>Yearly $1,500 allowance for technical equipment/work accessories</li><li>Annual holiday party<br/><br/></li></ul>Employment Type: Full-Time", "postedDate": "2 weeks ago", "skills": ["Public Relations", "Customer Success", "PR", "Campaign Management", "Media Relations", "Media Coverage", "Client Management", "Account Management", "Business Development", "Product Development", "Team Leadership", "Hiring", "Training", "Startups", "Technology"], "url": "https://www.linkedin.com/jobs/view/3994677916"}