{"jobTitle": "Vice President Operations", "company": {"name": "Hygiena", "industry": "Biotechnology Research and Manufacturing", "size": "Not specified", "location": "Camarillo, CA"}, "location": "Camarillo, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$200,000 - $230,000 DOE", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Biotechnology Research and Manufacturing", "description": "Hygiena provides rapid microbiology diagnostic tests and solutions for mission-critical, time-sensitive processes around the world. Hygiena’s proprietary diagnostic technologies enable customers to; prevent illness and save lives, comply with regulations, protect products and brands, run businesses more effectively. Solutions are sold in a wide range of industries globally, but the core focus is food safety. Headquartered in Camarillo, California and with offices around the world, we are actively looking for talented individuals to help grow the business!", "responsibilities": "Successfully lead and supervise the Managers of all manufacturing operations and functions to include planning, purchasing, manufacturing, engineering/equipment maintenance and facilities, shipping, receiving, inventory control, quality and documentation functions. Lead Managers to consistently focus on continuous improvement. This will include monitoring and analyzing performance data (including order fulfillment, machine capacities and output, budget variances, schedule attainment, inventory turns, pricing of raw materials, etc.) to identify business plan variances using established MRP data, established in-house systems and ad-hoc problem solving. Create action plans to respond to data analysis and improve/support existing systems. Collaboration with the COO and respective Managers on the accurate preparation of appropriate annual capital and expense budgets. Must be able to monitor and ensure compliance of approved annual budgets. Responsible for company growth trajectory and profit plan expectations. Must develop and maintain innovative and effective cost reduction programs wherever possible. Provide oversight of the various Ops Managers and act as a mentor to all. This includes review of the personnel requirements and the performance of their respective staff. Regular weekly meetings will provide opportunities to analyze any need for additional personnel support, review of training requirements/documentation, communication of expectations, and/or address disciplinary issues. Ensures compliance with and/or follows all organizational systems, programs, training, policies, and procedures as required and complies with relevant legal mandates. Seeks guidance as necessary. Actively supports and participates in the safety program, both for self-protection and the protection of other employees, by reading and abiding by all requirements in the Safety Manual and Injury Illness Prevention Program (IIPP). Carries out all responsibilities in an honest, ethical and professional manner. Must be able to fulfill essential job function in a consistent state of alertness and safe manner. Handles various other duties as delegated by the COO.", "qualifications": {"required": "Bachelor’s Degree in Business Management or Engineering Sciences or a related field required. Minimum of ten (10) years of Operations or Manufacturing experience required that includes the following: Five (5) years as a Plant Manager or Director of Operations in an ISO Certified manufacturing environment. Minimum of Five (5) years of supervisory experience managing direct reports required. Knowledge of MRP system functionality, preferably NAVISION. Excellent computer skills and solid working knowledge of Microsoft Office (Outlook, Word, Excel, Visio, PowerPoint) and Adobe Acrobat required. Knowledge and experience in production, planning, purchasing, quality/regulatory issues, and lean principles necessary.", "preferred": "Not specified"}, "skills": ["Must be able to multi-task with attention to detail.", "Excellent verbal and written communication will be necessary to perform this job.", "Discretion and independent judgement skills are vital.", "Ability to lead teams.", "Must have financial acumen.", "Flexibility within a changing environment.", "Proficiency in coaching and developing others.", "Must have strong time management, planning and organization.", "Must be able to drive innovation."], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "15 days of PTO & 9 paid company holidays, Medical with HSA employer contribution, Dental, Vision available 1st of the month after start date, Company paid Life Insurance, Short and Long-Term Disability and an Employee Assistance Program, 401(k) with Safe Harbor and Profit-Sharing employer contributions, Tuition Reimbursement program, Charitable Contribution matching, Employee Referral bonus opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3994381302"}