{"jobTitle": "Supply Chain Assistant Manager", "company": {"name": "Randstad USA", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Experienced", "salary": {"amount": "$90,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Are you ready to take your supply chain expertise to the next level? Join our dynamic team as a Supply Chain Assistant Manager in Los Angeles, where you will play a pivotal role in shaping our logistics and customer service operations in the fast-paced food retail industry. Reporting directly to the SVP of Supply Chain, you will be responsible for overseeing order management, supply and demand forecasting, and 3PL management. This is an exciting opportunity to drive forecast and inventory accuracy, enhance order fulfillment, and contribute to our key performance indicators. If you’re passionate about optimizing supply chain processes and delivering exceptional results, we want to hear from you! Please share your updated resume with me at jiaojiao.hine@randstadusa.com. Let's connect today!<br/><br/>salary: $90,000 - $100,000 per year<br/><br/>shift: First<br/><br/>work hours: 8 AM - 4 PM<br/><br/>education: Bachelors<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Key Responsibilities:<br/><br/></strong>Demand &amp; Supply Planning<br/><br/><ul><li>Manage demand and supply planning, including inventory control activities.</li><li>Collaborate with the HQ Supply Chain Team for replenishment orders and shipments.</li><li>Develop and maintain effective supply and distribution plans, ensuring optimal product inventory levels.</li><li>Execute allocation and fulfillment processes to achieve perfect customer order fulfillment.</li><li>Forecast demand in coordination with Sales and proactively communicate potential issues.<br/><br/></li></ul>Customer Service &amp; Logistics<br/><br/><ul><li>Process and manage all customer orders, ensuring timely delivery.</li><li>Coordinate with freight carriers and 3PL warehouses for logistics management.</li><li>Track inbound and outbound shipments to ensure on-time delivery.</li><li>Ensure compliance with export documentation and regulatory requirements.</li><li>Handle customer inquiries and complaints related to product deliveries.<br/><br/></li></ul>Skills<br/><br/><ul><li>Supply Chain</li><li>Demand and Supply Planning (5 years of experience is preferred)</li><li>3 PL Management</li><li>Food Retail</li><li>Analytical Skills</li><li> Order fulfillment processes<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Years of experience: 7 years</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.<br/><br/>Qualified applicants in San Francisco with criminal histories will be considered for employment in accordance with the San Francisco Fair Chance Ordinance.<br/><br/>We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.", "responsibilities": "Key Responsibilities:\n\nDemand & Supply Planning\n\n* Manage demand and supply planning, including inventory control activities.\n* Collaborate with the HQ Supply Chain Team for replenishment orders and shipments.\n* Develop and maintain effective supply and distribution plans, ensuring optimal product inventory levels.\n* Execute allocation and fulfillment processes to achieve perfect customer order fulfillment.\n* Forecast demand in coordination with Sales and proactively communicate potential issues.\n\nCustomer Service & Logistics\n\n* Process and manage all customer orders, ensuring timely delivery.\n* Coordinate with freight carriers and 3PL warehouses for logistics management.\n* Track inbound and outbound shipments to ensure on-time delivery.\n* Ensure compliance with export documentation and regulatory requirements.\n* Handle customer inquiries and complaints related to product deliveries.", "qualifications": {"required": "Years of experience: 7 years\nExperience level: Experienced", "preferred": "Demand and Supply Planning (5 years of experience is preferred)"}, "skills": ["Supply Chain", "Demand and Supply Planning", "3 PL Management", "Food Retail", "Analytical Skills", "Order fulfillment processes"], "postedDate": "2 weeks ago", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994322190"}