{"jobTitle": "Event Sales Manager/Representative", "company": {"name": "Private Equity Insights", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Do you thrive in a fast-paced environment, where you gain a tremendous amount of responsibility? Do you want to be part of an exceptional entrepreneurial team with young, motivated and extremely driven people? And are you curious or passionate about sales? If so, you might be our next Event Sales Manager/Representative.<br/><br/><strong>About us<br/><br/></strong>\"Private Equity Insights is the world's leading Private Equity community. We connect and develop more than 240,000 investment professionals across the world, through our platforms, which include conferences, webinars, magazines and news reports.<br/><br/>For more than 10 years, PEI has helped Investors, Fund Managers and CXOs rethink what it takes to fundraise, invest, operate and exit in Private Equity, and does so via online engagement and cutting edge conferences in Singapore, UK, France, Poland &amp; CEE, Benelux, Switzerland, Iberia, Germany, Italy, Nordics and DACH.\"<br/><br/>Private Equity Insights is part of United Media which focuses on building large scale industry media and conferences products in sectors such as insurance, HR, private equity, retail, etc. As of today, we have organically launched 8 media companies and acquired one.<br/><br/><strong>What we offer you<br/><br/></strong>As our Event Sales Manager/Representative you'll have the unique opportunity to be part of building and scaling a company. By providing you with the ownership of our telemarketing, we want to constantly push you out of your comfort zone. You'll be working out of our HQ in London and to ensure a never-ending growth curve, we provide you with:<br/><br/><ul><li>An opportunity for getting operational experience in a start-up where both your work and the results are highly tangible and matters to the business</li><li>A chance to work closely together with the CEO on our sales execution</li><li>Unlimited growth potential in our company - we strongly believe in and have a track record of promoting internally<br/><br/></li></ul><strong>Your Responsibilities<br/><br/></strong>Given our global expansion, the Event Sales Manager/Representative role is strategically important to place us as the market leader in the industry. As we start to amass a large client base which needs an extra touch of care and nurture, this will give you an opportunity to build relationships with C-Level execs and SME business owners in the financial and technology sectors.<br/><br/><strong>What we expect from you<br/><br/></strong>You possess an unparalleled work ethic with a high sense of urgency. You have a relentless drive and desire to be the very best at what you do. You take ownership of everything you do, are proactive and follow through on commitments. Moreover, you're humble and you share our passion for building and executing new businesses. Furthermore, we expect that you:<br/><br/><ul><li>Can display excellent inter-personal skills such as charisma, listening and understanding</li><li>Have a natural ability to build rapport with other people</li><li>Are an excellent communicator, especially verbally</li><li>Love to build and nurture relations</li><li>Are comfortable being inquisitive and able to close for new business</li><li>Have a natural ability to make people feel comfortable around you<br/><br/></li></ul>If this sounds like you, then we need to hear from you today.<br/><br/><strong>Start date<br/><br/></strong>Flexible<br/><br/>Monday - Friday we work from our office (next to Victoria Station) and do not offer remote work.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3994908267"}