{"jobTitle": "Retail Talent Acquisition Manager (Remote to CA, WA, AZ)", "company": {"name": "The Guitar Center Company", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Manufacturing", "description": "Position Overview:As a Regional Talent Acquisition Manager for  Retail, you will be responsible for attracting, sourcing, recruiting, and hiring top talent for our retail locations. You will collaborate closely with Regional, District, and Store Leadership and stakeholders to understand staffing needs, develop effective recruitment strategies, and ensure a seamless hiring process. This role requires a deep understanding of the retail industry, exceptional communication skills, and the ability to build strong relationships with candidates and internal teams.You will be a culture champion in our Stores through hiring exceptional candidates that meet and/or exceed the cultural standards of our Stores and enterprise overall.  You will also play a part in supporting Human Resources and Organizational Development with onboarding, engagement, and retention of Associates through talent management, training, and professional development programs.Responsibilities will include, but will not be limited to the following:Talent Acquisition Strategy Development:Think globally, act locally. Develop and implement recruitment strategies tailored to the specific needs of Retail Stores, considering factors such as community, location, seasonality, and business objectives.Get excited to know your business inside-out. This gives you the edge in connecting with top talent who will drive the company strategy and goals.Recruitment Marketing, Sourcing, and Attraction:Utilize various channels including job boards, paid media, social media, in-market networking, and employee referrals to attract a diverse pool of qualified candidates.Partner with Director, Talent Acquisition to develop recruitment marketing strategies to ensure we connect with the right talent at the right time. Talent Community:Lead partnerships in the local community and colleges to build great relationships with talent ensuring we build our network and pipeline of top talent across all Stores functions.Help plan and support culture-related events that drive retention while also using external-facing culture events as a recruiting tool. Candidate Screening and Assessment:Review resumes, conduct interviews, and coordinate interviews with Retail Leadership to evaluate candidates' qualifications, skills, and fit with company culture. Collaboration with Hiring Managers:Be the consultative TA leader with hiring managers, HR, and OD to understand staffing needs, define job requirements, and hire to our success profile. Provide guidance and support throughout the selection process.Candidate Experience:Ensure a positive and impactful candidate experience at every stage of the recruitment process, from initial contact to onboarding.Act as a brand ambassador, promoting our company culture and values to prospective candidates.Offer Management and Onboarding:In partnership with Retail Leadership, extend offers to successful candidates, negotiate terms as necessary.Develop and facilitate the onboarding process in collaboration with Retail Leadership, HR, OD, and other relevant departments.Data Analysis and Reporting:Track recruitment metrics and analyze data to measure the effectiveness of TA efforts.Identify areas for improvement and implement solutions to enhance recruiting outcomes.Compliance and Best Practices:Stay informed about relevant employment laws and regulations, ensuring compliance with legal requirements throughout the recruitment process.Stay updated on industry trends and best practices in Talent Acquisition.To join our band, you'll need the following experience:Bachelor's degree in Human Resources, Business Administration, or a related field; or a combination of relevant experience and education.5+ years of experience in Talent Acquisition as a leader, preferably in the retail industry.Strong understanding of the fast-paced approach to retail operations and the specific requirements of retail roles. Experience working with retail store managers and frontline staff.Highly organized with keen attention to detail.Excellent communication and interpersonal skills, with the ability to build rapport with candidates and internal stakeholders.Demonstrated ability to manage multiple priorities and meet deadlines in a fast-paced environment.Proficiency in applicant tracking systems and other recruitment software.Knowledge of employment laws and regulations, particularly those relevant to hiring practices.Certification in HR or Talent Acquisition (e.g., SHRM-CP, PHR, LinkedIn Recruiter).Familiarity with behavioral interviewing techniques and other assessment methods.Why Guitar Center Company? Here’s just some of the rewards:For our employees who are musicians we offer the unique opportunity of gig leave—take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick/holiday/vacation time, employee discount program, and tuition reimbursement options.Pay Rate: $110,000.00 - $125,000.00 annually depending on background and experience. This position is eligible to participate in the Guitar Center Company bonus program based on Company performance.The job posting is not necessarily reflective of actual compensation that may be earned, nor a promise of any specific pay for any specific employee, which is always dependent on actual experience, education, and other factors. The pay range(s) listed are provided in compliance with state specific laws. Pay ranges may be different in other locations.Love this gig and want to apply? Send your resume today along with salary expectations!Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status, or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job‐related requirements.If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request a reasonable accommodation by sending an email to recruiting@guitarcenter.com.", "responsibilities": "Talent Acquisition Strategy Development:Think globally, act locally. Develop and implement recruitment strategies tailored to the specific needs of Retail Stores, considering factors such as community, location, seasonality, and business objectives.Get excited to know your business inside-out. This gives you the edge in connecting with top talent who will drive the company strategy and goals.Recruitment Marketing, Sourcing, and Attraction:Utilize various channels including job boards, paid media, social media, in-market networking, and employee referrals to attract a diverse pool of qualified candidates.Partner with Director, Talent Acquisition to develop recruitment marketing strategies to ensure we connect with the right talent at the right time. Talent Community:Lead partnerships in the local community and colleges to build great relationships with talent ensuring we build our network and pipeline of top talent across all Stores functions.Help plan and support culture-related events that drive retention while also using external-facing culture events as a recruiting tool. Candidate Screening and Assessment:Review resumes, conduct interviews, and coordinate interviews with Retail Leadership to evaluate candidates' qualifications, skills, and fit with company culture. Collaboration with Hiring Managers:Be the consultative TA leader with hiring managers, HR, and OD to understand staffing needs, define job requirements, and hire to our success profile. Provide guidance and support throughout the selection process.Candidate Experience:Ensure a positive and impactful candidate experience at every stage of the recruitment process, from initial contact to onboarding.Act as a brand ambassador, promoting our company culture and values to prospective candidates.Offer Management and Onboarding:In partnership with Retail Leadership, extend offers to successful candidates, negotiate terms as necessary.Develop and facilitate the onboarding process in collaboration with Retail Leadership, HR, OD, and other relevant departments.Data Analysis and Reporting:Track recruitment metrics and analyze data to measure the effectiveness of TA efforts.Identify areas for improvement and implement solutions to enhance recruiting outcomes.Compliance and Best Practices:Stay informed about relevant employment laws and regulations, ensuring compliance with legal requirements throughout the recruitment process.Stay updated on industry trends and best practices in Talent Acquisition.", "qualifications": {"required": "Bachelor's degree in Human Resources, Business Administration, or a related field; or a combination of relevant experience and education.5+ years of experience in Talent Acquisition as a leader, preferably in the retail industry.Strong understanding of the fast-paced approach to retail operations and the specific requirements of retail roles. Experience working with retail store managers and frontline staff.Highly organized with keen attention to detail.Excellent communication and interpersonal skills, with the ability to build rapport with candidates and internal stakeholders.Demonstrated ability to manage multiple priorities and meet deadlines in a fast-paced environment.Proficiency in applicant tracking systems and other recruitment software.Knowledge of employment laws and regulations, particularly those relevant to hiring practices.Certification in HR or Talent Acquisition (e.g., SHRM-CP, PHR, LinkedIn Recruiter).Familiarity with behavioral interviewing techniques and other assessment methods.", "preferred": ""}, "skills": ["Talent Acquisition", "Retail", "Recruitment", "Sourcing", "Hiring", "Communication", "Relationship Building", "Culture Champion", "Onboarding", "Engagement", "Retention", "Talent Management", "Training", "Professional Development", "Strategy Development", "Recruitment Marketing", "Social Media", "Networking", "Employee Referrals", "Talent Community", "Community Outreach", "College Relations", "Candidate Screening", "Assessment", "Interviewing", "Collaboration", "Hiring Managers", "Candidate Experience", "Offer Management", "Data Analysis", "Reporting", "Compliance", "Employment Laws", "Industry Trends", "Best Practices", "Applicant Tracking Systems", "Behavioral Interviewing"], "postedDate": "2 weeks ago", "benefits": "For our employees who are musicians we offer the unique opportunity of gig leave—take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick/holiday/vacation time, employee discount program, and tuition reimbursement options.", "remoteWork": "Yes", "salary": {"amount": "110,000.00 - 125,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3994047794"}