{"jobTitle": "New Business Account Strategist, Onboarding, Google Customer Solutions", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "81,000.00/yr - 119,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.<br/><br/>The Onboarding team plays a critical role in Google’s Acquisitions organization and is responsible for a substantial portion of Google’s advertising business growth across the globe.<br/><br/>As a New Business Account Strategist, you will be a critical member of our Onboarding team, managing the onboarding of new advertising customers for Google throughout the region. You will be engaging with customers and supporting them in learning how to utilize Google solutions for their business, while also developing digital advertising solutions that meet their growth goals and business objectives. You will manage the relationship with our acquisitions and business team for customers. You'll work with an engaged team and grow/transform the business, while also understanding our advertisers needs and delivering measurable solutions.<br/><br/>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.<br/><br/>The US base salary range for this full-time position is $81,000-$119,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Deliver against assigned customer goals, while prioritizing and delivering an outstanding onboarding experience to Google's advertisers.</li><li>Work closely with colleagues in New Business Sales (NBS) and Google Customer Solutions (GCS) sales to deliver seamless customer handovers and to ensure customer experience.</li><li>Implement creative ways to improve our customer relationships. Tailor and share performance enhancing suggestions and promote other Google products.</li><li>Communicate proactively with customers, via phone and email.</li><li>Provide strategic advice and help our advertisers get the best return on their advertising investment by working closely with them in a consultative role.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "Deliver against assigned customer goals, while prioritizing and delivering an outstanding onboarding experience to Google's advertisers. Work closely with colleagues in New Business Sales (NBS) and Google Customer Solutions (GCS) sales to deliver seamless customer handovers and to ensure customer experience. Implement creative ways to improve our customer relationships. Tailor and share performance enhancing suggestions and promote other Google products. Communicate proactively with customers, via phone and email. Provide strategic advice and help our advertisers get the best return on their advertising investment by working closely with them in a consultative role.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 2 years of experience in media account management or the advertising industry. Experience in a customer-facing role working with digital advertising products (e.g., Google Ads, Google Shopping, Google Analytics, etc.).", "preferred": "Experience managing and customizing for a customer base. Ability to multi-task and manage multiple projects at a time while paying attention to detail. Ability to take initiative, work with minimal guidance, lead, motivate, and work with others. Ability to reach out to customers, and assist them in adding value to their business. Excellent creative thinking and problem-solving skills. Excellent written and verbal communication skills."}, "skills": ["Media Account Management", "Advertising", "Customer Service", "Digital Advertising", "Google Ads", "Google Shopping", "Google Analytics", "Relationship Building", "Client Service", "Research", "Market Analysis", "Communication", "Problem Solving", "Creative Thinking"], "postedDate": "1 week ago", "benefits": "The US base salary range for this full-time position is $81,000-$119,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3994381254"}