{"jobTitle": "Senior Director/ Vice President  Entertainment and Talent Buyer", "company": {"name": "Hunter", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "130,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Advertising", "industry": "Public Relations and Communications Services", "description": "There’s a reason HUNTER is recognized as one of America’s Most Loved Workplaces and has been named PRovoke “Consumer Agency of the Year” not once, but twice: At HUNTER, we EARN IT — consumer attention, the trust and loyalty of clients, and the dedication of our staff, currently 260+ strong and counting.\n<br/>\nHUNTER is seeking a highly skilled professional to join our dynamic team as a Vice President or Senior Director of Entertainment. This team member will play a pivotal role in driving effective talent strategy and procurement for Entertainment focused programs and campaigns for Agency clients across various industries, including but not limited to, Food & CPG, Wine & Spirits, Health & Wellness, Beauty, Personal Care & Fashion, Home & Lifestyle, Technology & E-Commerce, and more. \n<br/>\nThis multifaceted position involves collaborating with internal and client stakeholders, managing talent casting needs, overseeing talent outreach and negotiations, and serving as the point of contact for talent and talent representation throughout campaigns. Additionally, you will be responsible for managing and executing all aspects of talent services, including logistics, communication, and compliance with industry regulations.\n<br/>\nThis is a senior position within the agency’s Entertainment practice, which includes being responsible for supervising, managing, and motivating a direct report and helping drive continued departmental growth and development alongside senior colleagues. \n<br/>\nThis role will report into the Chief Entertainment and Media Officer, and work in collaboration with VPs across our Earned Media team to successfully execute workflow across the joint Entertainment and Media department.\n<br/>\n<strong><u>Qualifications Required:</u></strong>\nEight (8) - Ten (10) years or more of experience in talent buying, entertainment partnerships and client servicing.\nPrevious public relations, marketing or advertising agency, talent agency experience \nExpert understanding of the entertainment landscape and pop-culture, including celebrities, athletes, musicians, personalities, experts, tentpole cultural moments and events, etc.\nProficiency in Microsoft Office (Word, Excel, PowerPoint)\nLocated in New York City, NY or Los Angeles, CA\nB.A. in Public Relations, Journalism, Communications, or the like\n<br/>\n<strong><u>Essential Job Functions & Responsibilities: </u></strong>\n<br/>\n<strong><em>Talent Procurement</em></strong>: \nDrive effective talent strategy and procurement for Agency clients’ entertainment and/or sports-focused programs and campaigns.\nParticipate in internal and client dialogue and ongoing meetings and brainstorms about client’s talent campaign needs and devise strategies to move projects forward, including ongoing collaboration with partner agencies and IAT planning. \nAssist in talent casting needs for the agency, including vetting, researching, and creating client-facing talent casting documents.\nManage talent outreach and negotiations on behalf of Agency clients; assignments include drafting talent SOW, conducting outreach to talent representatives, drafting and sending talent Formal Offer and consulting on, managing revisions for, and negotiating Long Form Agreement in conjunction with legal counsel.\nServe as point of contact for talent and talent representation, including but not limited to coordinating all communication and scheduling with appropriate parties throughout Campaign.\nCounseling on and routing all materials (creative, social media calendars, run of shows, messaging, etc.) and assets for talent review/input and approval.\nServe as a representative of the client and Agency on-site at client events, media interviews, service days, etc.\nOversee the management and execution (scheduling, approval process, briefing materials, etc.) of all talent services.\nOversee the management and coordination of logistics for talent services including, but not limited to:\nTalent travel and transportation\nTalent glam squad’s travel and transportation \nAll logistics related to remote or on-site service days\nManage necessary communication with SAG-AFTRA signatory to fulfil Agency client’s obligation to SAG-AFTRA regulations.\n<br/>\n<strong>Additional Department Services:</strong>\nPotential to support on celebrity seeding, brand broadcast integration opportunities as well as entertainment event sponsorship + partnership requests. \n<br/>\n<strong>Ability to:</strong>\nUnderstand relevant entertainment and sports industry trends and use the information to develop strategic recommendations, programs and/or campaigns for clients\nManage multiple client projects and campaigns; effectively delegate work among the department members and to account team members\nMaintain strong relationships with talent agents, managers and publicists\nTravel to client and event locations; meet with clients at their office locations/headquarters\nDemonstrate strong writing, editing, presentation and interpersonal communications skills\nShow integrity and good judgment when working with colleagues and clients\n<ul><li>Display and encourage creativity and innovation in self and others. Actively participate in brainstorms, connect with creative resources, inspire, and motivate team members </li><li>Develop and mentor junior and mid-level staff; identify and anticipate issues and assist in finding resolutions</li><li>Facilitate management of the performance review process, identifying growth opportunities for direct report and constructively providing feedback on areas for improvement</li><li>Demonstrate an interest in the long-range health of the Agency and collaborate with leadership to establish a growth plan </li></ul>\n<br/>\n<strong><u>Position Expectations/Success Factors:</u></strong>\nInvestment in client programs\nDeep knowledge of and connections in the entertainment and sports media industry\nRespect and collaboration with the account team; develop and retain Agency talent by providing informal/formal feedback and coaching\n<br/>\n<strong><u>Performance Standards:</u></strong>\nAnnual evaluation by supervisor\nAttainment of goals set by supervisor during the annual evaluation\n<br/>\n<em>In order to comply with equal pay and salary transparency laws in various locations, the Company believes the target range of base compensation for this role is $130K - 150K. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, and location.</em>\n<br/>\nAt HUNTER, we work hard and play hard, and while we have all the benefits you’d expect —competitive health and dental insurance plans, a 401K company match and generous PTO — we also provide:\n<ul><li>a hybrid work model;</li><li>a “work from anywhere in the US” policy (up to four weeks a year);</li><li>a year-round staff training and development curriculum; and</li><li>a staff-led Action Group dedicated to DEI excellence in the agency and industry (read our DEI statement here: https://hunterpr.com/dei/)</li></ul>\n<br/>\nPerks? We have perks. When you work at HUNTER, you can expect Bring Your Parents (And Kids) to Work Days, regular volunteer Days of Service, mid-day Cupcakes and Cocktails mixers and epic Halloween and holiday parties.\n<br/>\nFounded in 1989, HUNTER has grown into one of the most respected mid-size marketing communications firms in the country, creating work that matters in strategic planning, earned media relations, social and digital media, talent and influencer engagement, experiential marketing, multicultural outreach and content creation and distribution. And we do it all for esteemed companies and brands across every sector you can imagine:\n<ul><li>Food + Beverage</li><li>Wine + Spirits</li><li>Health + Wellness</li><li>Beauty + Personal Care + Fashion</li><li>Home + Lifestyle + Travel</li><li>Retail + E-commerce</li></ul>\nSee us in action here: https://hunterpr.com", "responsibilities": "Drive effective talent strategy and procurement for Agency clients’ entertainment and/or sports-focused programs and campaigns.\nParticipate in internal and client dialogue and ongoing meetings and brainstorms about client’s talent campaign needs and devise strategies to move projects forward, including ongoing collaboration with partner agencies and IAT planning. \nAssist in talent casting needs for the agency, including vetting, researching, and creating client-facing talent casting documents.\nManage talent outreach and negotiations on behalf of Agency clients; assignments include drafting talent SOW, conducting outreach to talent representatives, drafting and sending talent Formal Offer and consulting on, managing revisions for, and negotiating Long Form Agreement in conjunction with legal counsel.\nServe as point of contact for talent and talent representation, including but not limited to coordinating all communication and scheduling with appropriate parties throughout Campaign.\nCounseling on and routing all materials (creative, social media calendars, run of shows, messaging, etc.) and assets for talent review/input and approval.\nServe as a representative of the client and Agency on-site at client events, media interviews, service days, etc.\nOversee the management and execution (scheduling, approval process, briefing materials, etc.) of all talent services.\nOversee the management and coordination of logistics for talent services including, but not limited to:\nTalent travel and transportation\nTalent glam squad’s travel and transportation \nAll logistics related to remote or on-site service days\nManage necessary communication with SAG-AFTRA signatory to fulfil Agency client’s obligation to SAG-AFTRA regulations.\nPotential to support on celebrity seeding, brand broadcast integration opportunities as well as entertainment event sponsorship + partnership requests.", "qualifications": {"required": "Eight (8) - Ten (10) years or more of experience in talent buying, entertainment partnerships and client servicing.\nPrevious public relations, marketing or advertising agency, talent agency experience \nExpert understanding of the entertainment landscape and pop-culture, including celebrities, athletes, musicians, personalities, experts, tentpole cultural moments and events, etc.\nProficiency in Microsoft Office (Word, Excel, PowerPoint)\nLocated in New York City, NY or Los Angeles, CA\nB.A. in Public Relations, Journalism, Communications, or the like", "preferred": ""}, "skills": ["Talent Buying", "Entertainment Partnerships", "Client Servicing", "Public Relations", "Marketing", "Advertising", "Talent Agency", "Entertainment Landscape", "Pop Culture", "Microsoft Office", "Word", "Excel", "PowerPoint"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "competitive health and dental insurance plans, a 401K company match and generous PTO, a hybrid work model, a “work from anywhere in the US” policy (up to four weeks a year), a year-round staff training and development curriculum, a staff-led Action Group dedicated to DEI excellence in the agency and industry", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994343157"}