{"jobTitle": "General Warehouse Associate - 4am", "company": {"name": "HD Supply", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.75-$21.60", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale", "description": "<strong>Preferred Qualifications<br/><br/></strong><ul><li>Prior experience working in multiple departments in a distribution center.</li><li>Previous experience operating material handling equipment.</li><li>Ability to understand written material.<br/><br/></li></ul><strong>Job Summary<br/><br/></strong>Works in multiple departments within a distribution center, including case pick, shipping, receiving, returns, loading, order processing, and replenishment. Operates material handling equipment to move inventory within the facility.<br/><br/><strong>Major Tasks, Responsibilities, And Key Accountabilities<br/><br/></strong><ul><li>Uses material handling equipment to locate and deliver products, supplies, and equipment to designated areas.</li><li>Assists with staging and loading orders into trucks for customer delivery.</li><li>Verifies quantity and quality of incoming products from vendors and distribution centers.</li><li>Uses packing list information to collect items for customer orders, including building and wrapping pallets of products.</li><li>Examines and inspects stock items for wear and defects and notifies management of inventory issues.</li><li>Returns misplaced products to proper storage areas.</li><li>Maintains a clean working environment in accordance with company safety policies.</li><li>Performs inventory control functions as needed. <br/><br/></li></ul><strong>Nature and Scope<br/><br/></strong><ul><li>Refers complex, unusual problems to supervisor.</li><li>Under general supervision, exercises some judgment in accordance with well-defined policies, procedures, and techniques. Work typically involves regular review of output by a senior coworker or supervisor.<br/><br/></li></ul><strong>Work Environment<br/><br/></strong><ul><li>Typically located in a comfortable environment but with regular exposure to factors that may cause noticeable discomfort or a moderate risk of accident or illness, such as temperature extremes, moving machinery, loud noises, and fumes.</li><li>Ability to lift and carry up to 50 pounds in a physical environment. Ability to stand for periods of time up to and exceeding 60 minutes. Ability to make repetitive movements, such as using a 10-key or calculator, bending, or squatting.</li><li>No travel required.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>HS Diploma or GED strongly preferred. Specialized skills training/certification may be required. Generally 2-5 years of experience in area of responsibility.<br/><br/></li></ul><em>For CA, CO, CT, MD, NJ, NV, NY, OH, RI, WA Job Seekers</em><strong>:<br/><br/></strong><strong>Pay Range<br/><br/></strong>$18.75-$21.60 Hourly<br/><br/>HDS provides the following benefits to all permanent full-time associates:<br/><br/><ul><li>Medical (with Prescription drug coverage), dental, and vision plans</li><li>Health care and Dependent Care FSA (as applicable)</li><li>401(K) with company match</li><li>Paid Holiday, Vacation, Personal Time, and Wellness Day</li><li>Paid Sick Time</li><li>Life and Accidental Death &amp; Dismemberment Insurance</li><li>Short and Long-term Disability Insurance</li><li>Critical Illness Insurance</li><li>Accident Insurance</li><li>Whole Life insurance</li><li>Commuter Benefits</li><li>Tuition Reimbursement</li><li>Employee Assistance Program</li><li>Adoption and Surrogacy Assistance<br/><br/></li></ul>CA, CO, CT, MD, NJ, NV, NY, OH, RI, WA law requires the posting of the potential salary range for advertised jobs. Individual base pay is determined based on a variety of elements including market data, experience, skills, internal equity and other factors.<br/><br/><strong>Our Goals for Diversity, Equity, and Inclusion<br/><br/></strong>We are committed to creating a culture that promotes equity, respect, and advocacy for every HD Supply associate. We value the diversity of our people.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>HD Supply is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.", "responsibilities": "Works in multiple departments within a distribution center, including case pick, shipping, receiving, returns, loading, order processing, and replenishment. Operates material handling equipment to move inventory within the facility.", "qualifications": {"required": "Prior experience working in multiple departments in a distribution center. Previous experience operating material handling equipment. Ability to understand written material.", "preferred": "HS Diploma or GED strongly preferred. Specialized skills training/certification may be required. Generally 2-5 years of experience in area of responsibility."}, "skills": ["Material Handling", "Inventory Control", "Order Processing", "Shipping", "Receiving"], "postedDate": "2 weeks ago", "benefits": "Medical (with Prescription drug coverage), dental, and vision plans, Health care and Dependent Care FSA (as applicable), 401(K) with company match, Paid Holiday, Vacation, Personal Time, and Wellness Day, Paid Sick Time, Life and Accidental Death & Dismemberment Insurance, Short and Long-term Disability Insurance, Critical Illness Insurance, Accident Insurance, Whole Life insurance, Commuter Benefits, Tuition Reimbursement, Employee Assistance Program, Adoption and Surrogacy Assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994862286"}