{"jobTitle": "Enterprise Feed Coordinator - Remote | WFH", "company": {"name": "Get It Recruit - Hospitality", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Human Resources Services", "description": "Full-Time<br/><br/>Benefits Offered: Dental, Life, Medical, Paid Time Off, Retirement, Vision<br/><br/><strong>About The Role<br/><br/></strong>Have you ever wondered how companies list their products on Amazon? Or how Google knows which products are in stock in a store near you? How about how your order gets to your door when you buy from a third-party merchant on Amazon? That's where our company comes in!<br/><br/>As a leading product feed management platform, we work with agencies, brands, and retailers to optimize and list products on the top ecommerce shopping destinations around the world.<br/><br/>What makes us different? We manage everything from onboarding to ongoing feed maintenance for our clients, enabling them to expand their ecommerce business more efficiently.<br/><br/>The Global Operations team<br/><br/>The Global Operations team is an incredible group who work to ensure our clients have the best possible experience. The support side of the team handles both inbound reactive customer support and outbound proactive client success with a focus on quality. As part of our Global Operations team is the Advertising team, which is a client-centric team supporting a fully managed solution that streamlines feed optimization, product listing, and data synchronization for hundreds of paid search, social media, and affiliate channels. Our stellar global operations team and support specialists are available 24/7, enabling us to create a full-service feed management experience for advertisers.<br/><br/>The Enterprise Feed Coordinator Role<br/><br/>The Enterprise Feed Coordinator will be responsible for setting up, analyzing, and defining optimizations to be made on product data feeds for our clients. You will be responsible for all elements of integrating client data feeds, ensuring adherence to best practices and documented methodology to deliver a high level of service. You will meet with clients, discuss feed optimizations, and create a detailed data review to guide the feed build team as they transform raw data into an optimized product feed, tuned for performance in each unique channel, including Google Shopping, Facebook, Pinterest, and other advertising channels. This position reports to the Onboarding Manager, Integrations.<br/><br/>Key Responsibilities<br/><br/><ul><li> Import data from various sources like Shopify, BigCommerce, Salesforce, Magento, Netsuite, and Oracle via SFTP, FTP, URL, and Custom APIs</li><li> Perform advanced platform troubleshooting and meet Integrations Service Level Agreements</li><li> Assist feed build team with questions regarding data review and client technical data ingestion requirements</li><li> Meet with clients to confirm feed optimizations and set up onboarding client integration plans</li><li> Analyze big data sets up to 1M+ SKUs</li><li> Collaborate productively with Enterprise Feed Managers, Sales &amp; Customer Success Managers<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> 3+ years of e-commerce business-to-business client experience</li><li> Excellent client relationship-building skills</li><li> Ability to understand and interpret client requests for intended outcomes</li><li> Strong time management and prioritization skills to work within compressed timeframes and embrace a sense of urgency</li><li> Bachelor's Degree in Computer Science preferred or equivalent work experience<br/><br/></li></ul><strong>Nice-to-Haves<br/><br/></strong><ul><li> Hands-on experience with PPC, Display, and Social</li><li> Certifications such as AdWords, Bing, Analytics, etc.</li><li> Basic HTML or SQL</li><li> Fluent in Spanish<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li> Remote work set-up</li><li> Competitive pay</li><li> Unlimited PTO for salaried positions and up to three weeks for hourly employees</li><li> Comprehensive benefits package including medical, dental, vision, HSA, FSA, life insurance, and more</li><li> Monthly half-day Fridays</li><li> 401K retirement plans</li><li> Family benefits such as parental leave, transition benefit for new parents, newborn sick leave, adoption assistance, pet insurance, and more</li><li> Internal skill certifications</li><li> Virtual and in-person team events</li><li> Employee Resource Groups (ERG)</li><li> Referral bonus program</li><li> Philanthropic events and volunteer days<br/><br/></li></ul>Employment Type: Full-Time", "responsibilities": "<ul><li> Import data from various sources like Shopify, BigCommerce, Salesforce, Magento, Netsuite, and Oracle via SFTP, FTP, URL, and Custom APIs</li><li> Perform advanced platform troubleshooting and meet Integrations Service Level Agreements</li><li> Assist feed build team with questions regarding data review and client technical data ingestion requirements</li><li> Meet with clients to confirm feed optimizations and set up onboarding client integration plans</li><li> Analyze big data sets up to 1M+ SKUs</li><li> Collaborate productively with Enterprise Feed Managers, Sales &amp; Customer Success Managers<br/><br/></li></ul>", "qualifications": {"required": "3+ years of e-commerce business-to-business client experience, Excellent client relationship-building skills, Ability to understand and interpret client requests for intended outcomes, Strong time management and prioritization skills to work within compressed timeframes and embrace a sense of urgency, Bachelor's Degree in Computer Science preferred or equivalent work experience", "preferred": "Hands-on experience with PPC, Display, and Social, Certifications such as AdWords, Bing, Analytics, etc., Basic HTML or SQL, Fluent in Spanish"}, "skills": ["Shopify", "BigCommerce", "Salesforce", "Magento", "Netsuite", "Oracle", "SFTP", "FTP", "URL", "APIs", "PPC", "Display", "Social", "AdWords", "Bing", "Analytics", "HTML", "SQL", "Spanish"], "postedDate": "2 weeks ago", "benefits": "Remote work set-up, Competitive pay, Unlimited PTO for salaried positions and up to three weeks for hourly employees, Comprehensive benefits package including medical, dental, vision, HSA, FSA, life insurance, and more, Monthly half-day Fridays, 401K retirement plans, Family benefits such as parental leave, transition benefit for new parents, newborn sick leave, adoption assistance, pet insurance, and more, Internal skill certifications, Virtual and in-person team events, Employee Resource Groups (ERG), Referral bonus program, Philanthropic events and volunteer days", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3994678715"}