{"jobTitle": "Executive Assistant and Office Manager (Senior Experience)", "company": {"name": "Oxford Road", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Marketing Services and Administrative and Support Services", "description": "Oxford Road is the world’s premier ad agency for podcast and other forms of audio. We help companies we truly believe in grow through the proper planning, buying, creative, measurement, and optimization of campaigns. If you’re passionate, tenacious, precise and want to join a purpose driven company,, we want to talk to you.\n<br/>\n<strong>Location: Sherman Oaks, CA <em>(hybrid)</em></strong>\n<em>This position is a hybrid role, combining responsibilities in executive support and office management, with an option to work remotely depending on office needs.</em>\n<br/>\n<strong>The role in a nutshell:</strong>\n<ul><li>As the Executive Assistant and Office Manager, you will play a pivotal role in supporting our CEO and other senior leadership members in managing their daily tasks and ensuring the smooth operation of our office. This role demands a proactive and organized individual who can thrive in a fast-paced environment while maintaining confidentiality and meticulous attention to detail. Works independently of the executive on routine administrative matters. Given complex calendaring and heavy travel planning, you are expected to be a masterful problem-solver and an organizational force. Additionally, you will have exceptional communication skills and be resourceful in building relationships across the organization - this entails being personable and approaching others with humility while driving action and having relentless follow-up and follow through</li></ul>\n<br/>\n<strong>Your Skills/Preferred Qualifications</strong>\n<ul><li><strong>5+ </strong>years of experience in executive support, event planning, and office management.</li><li>Bachelor's degree or equivalent experience</li><li>Excellent organizational and multitasking skills</li><li>Strong communication and interpersonal abilities</li><li>Proficiency in Google Drive, Zoom, and calendar management tools</li><li>Ability to handle confidential information with discretion</li><li>Flexibility to adapt to changing priorities</li><li>Resourceful and efficient problem-solver</li></ul>\n<br/>\n<strong>What your day looks like:</strong>\n<p><em>Executive Support:</em></p><ul><li>Manage calendars for the CEO, professional and personal, as needed</li><li>Coordinate all stakeholders for onsite and offsite executive meetings</li><li>Prepare CEO for upcoming meetings and help with follow up items</li><li>Organize CEO’s to-do list, providing daily and weekly updates</li><li>Screen communication in and out of CEOs' offices</li><li>Managing tight deadlines and daily communication with high-level clients</li><li>Coordinate travel arrangements and provide detailed itineraries</li><li>Prepare expense reports, manage recurring company expenses as directed by CEO</li><li>Assist with professional and personal errands and tasks, including client gifts and selecting meeting venues</li><li>Make sure documents and totals are up to date and accurate</li><li>Think and plan several steps ahead</li><li>Save CEO time in any and every way possible</li></ul>\n<br/>\n<p><em>Office Management &amp; Operations Support:</em></p><ul><li>Manage office supplies and ensure proper stock levels</li><li>Maintain common areas and ensure office decor and foliage upkeep</li><li>Manage food service requests for meetings</li><li>Handle building requests and liaise with vendors</li><li>Greet guests professionally and oversee parking access</li><li>Receive and ship packages</li><li>Manage office access permissions and desk-booking software</li><li>Plan, execute and oversee logistics of company-wide meetings (Mission, Town Hall, Anniversary, Holiday, team-building events, birthdays and office celebrations)</li></ul>\n<br/>\n<p><em>Company Culture and Cross-Departmental Support:</em></p><ul><li>Assist with special projects and presentations, including research</li><li>Collaborate with HR to assess and improve cultural practices</li><li>Support event planning efforts and conduct research project</li><li>Coordinate team’s travel for offsites and organize RSVP lists</li><li>Work in conjunction with HR to maintain the company calendar</li><li>Coordinate communications on people changes with HR and management</li><li>Manage company perks</li></ul>\n<br/>\n<p><em>Special Projects, and Internal and External Events Support:</em></p><ul><li>Lead Koala Corps activities (our Community Initiative with Children’s Hospital)</li><li>Provide support for marketing and social media-related activities -</li><li>Assist with company communications such as The Influencer and PR-related efforts</li><li>Take on special projects as needed, including creating presentations, proofreading, editing, and overseeing design work</li><li>Manage event budgets, including forecasting and negotiating with vendors</li><li>Coordinate photography and videography needs for all official company events, evaluate when professional vs. in-house resources are needed, and review and file photos</li><li>Conceptualize and execute routine team bonding events, including holiday parties, virtual parties, and other company events</li><li>Source and manage event planners</li><li>Plan and produce successful Annual Anniversary celebration</li></ul>\n<br/>\nJoin us in our mission to re-imagine our industry through the work we do for clients. If you're a proactive and detail-oriented professional looking for a challenging yet rewarding opportunity, we'd love to hear from you.\n<br/>\n<strong>Benefits</strong>\n<ul><li>Unlimited PTO. We go out of our way to take care of our people</li><li>Health, Dental, and Vision Insurance on Day 1</li><li>Competitive 401k Matching Program</li><li>Remote-first company with full remote equipment setups</li><li>Exclusive discounts with clients</li></ul>\n<br/>\n<em>Oxford Road is proud to be an Equal Opportunity Employer. It is our commitment to provide equal employment opportunities to all employees and applicants and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex (including pregnancy, childbirth, or related medical conditions), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</em>\n<br/>\n", "responsibilities": "As the Executive Assistant and Office Manager, you will play a pivotal role in supporting our CEO and other senior leadership members in managing their daily tasks and ensuring the smooth operation of our office. This role demands a proactive and organized individual who can thrive in a fast-paced environment while maintaining confidentiality and meticulous attention to detail. Works independently of the executive on routine administrative matters. Given complex calendaring and heavy travel planning, you are expected to be a masterful problem-solver and an organizational force. Additionally, you will have exceptional communication skills and be resourceful in building relationships across the organization - this entails being personable and approaching others with humility while driving action and having relentless follow-up and follow through", "qualifications": {"required": "5+ years of experience in executive support, event planning, and office management.", "preferred": "Bachelor's degree or equivalent experience, Excellent organizational and multitasking skills, Strong communication and interpersonal abilities, Proficiency in Google Drive, Zoom, and calendar management tools, Ability to handle confidential information with discretion, Flexibility to adapt to changing priorities, Resourceful and efficient problem-solver"}, "skills": ["Executive Support", "Event Planning", "Office Management", "Google Drive", "Zoom", "Calendar Management", "Communication", "Interpersonal Skills", "Problem Solving"], "postedDate": "1 week ago", "benefits": "Unlimited PTO. We go out of our way to take care of our people, Health, Dental, and Vision Insurance on Day 1, Competitive 401k Matching Program, Remote-first company with full remote equipment setups, Exclusive discounts with clients", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995429722"}