{"jobTitle": "Material Planning & Logistics Specialist", "company": {"name": "Xometry", "industry": "Software Development", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Xometry (NASDAQ: XMTR) powers the industries of today and tomorrow by connecting the people with big ideas to the manufacturers who can bring them to life. Xometry’s digital marketplace gives manufacturers the critical resources they need to grow their business while also making it easy for buyers at Fortune 1000 companies to tap into global manufacturing capacity.\n\nXometry is a fast growing digital technology company that is disrupting the manufacturing industry. We are hiring a Material Planning and Logistics Specialist to support our rapid customer growth. Do you thrive on working on the edge? Do you want to transform an industry? This job is for you if your true strength is the ability to prioritize and communicate effectively to get you through even the most demanding of situations. As a MP&L Specialist, you will be part of a fast moving team of technical professionals who solve supply chain problems for customized parts.\n\nPosition Overview:\n\nThe Material Planner and Logistics Specialist is responsible for ensuring the efficient planning, procurement, and management of materials and logistics to support production and operational needs. This role involves coordinating with suppliers and customers, managing inventory levels, and optimizing the supply chain to meet production schedules and customer demands.", "responsibilities": "Material Planning: Develop and maintain material plans to ensure timely availability of raw materials and components for production. Analyze demand forecasts, production schedules, and inventory levels to create accurate material requirements. \nSupplier Coordination: Collaborate with suppliers and customers to manage procurement processes, negotiate terms, and ensure the timely delivery of materials. Monitor supplier performance and address any issues that may impact the supply chain. \nInventory Management: Oversee inventory levels, track material usage, and implement strategies to optimize stock levels while minimizing excess inventory and stockouts. Conduct regular inventory audits and manage inventory discrepancies. \nLogistics Coordination: Plan and coordinate logistics activities, including transportation, warehousing, and distribution. Ensure that materials are delivered to the correct locations on time and in good condition. \nData Analysis and Reporting: Analyze data related to material usage, inventory levels, and supply chain performance. Prepare reports and presentations to communicate findings and recommendations to management. \nProcess Improvement: Identify and implement process improvements to enhance efficiency and effectiveness in material planning and logistics operations. Stay informed about industry best practices and emerging trends. \nCross-Functional Collaboration: Work closely with production, procurement, and quality assurance teams to align material planning and logistics activities with overall business objectives. \nCompliance and Documentation: Ensure compliance with relevant regulations, standards, and company policies. Maintain accurate and up-to-date records of material transactions, inventory levels, and logistics activities.", "qualifications": {"required": "Bachelor’s degree in Supply Chain Management, Logistics, Business Administration, or a related field. 7+ years of experience in material planning, logistics, or supply chain management, preferably in manufacturing. Strong understanding of inventory management principles and practices. Proficiency in ERP systems (e.g., SAP, Oracle, Microsoft 365 or equivalent) and Microsoft Office Suite (Excel, Word, PowerPoint). Excellent analytical and problem-solving skills. Strong organizational and time-management abilities. Effective communication and interpersonal skills, with the ability to collaborate with cross-functional teams. Ability to work under pressure and adapt to changing priorities.", "preferred": ""}, "skills": ["Material Planning", "Logistics Coordination", "Inventory Management", "Data Analysis", "Process Improvement", "Cross-Functional Collaboration", "Compliance and Documentation"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Diversity, equity, inclusion and belonging. Equal opportunity employer. E-Verify participation.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995430692"}