{"jobTitle": "Retail Sales Assistant", "company": {"name": "Moon Moments", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Join Our client's Team as a Retail Sales Assistant!<br/><br/>On-Site role with weekly pay<br/><br/>Immediate start available!<br/><br/>Looking for a fulfilling career where you can grow and develop your skills? Look no further!<br/><br/>Our client is seeking passionate individuals to join their team as Retail Sales Assistants in CA. As a crucial part of the sales team, you'll guide customers through their purchasing journey, ensuring they receive top-notch service from start to finish. If you're someone who loves engaging with people, resolving their queries, and creating lasting relationships, this role is perfect for you!<br/><br/>Responsibilities:<br/><br/><ul><li>Provide exceptional customer service by demonstrating thorough product knowledge and collaborating with colleagues to meet sales targets</li><li>Create eye-catching promotional displays to showcase our products effectively</li><li>Meet and exceed sales goals while delivering outstanding customer experiences</li><li>Maintain personal and team productivity targets</li><li>Conduct product demonstrations to highlight key features and benefits, driving customer interest and sales</li><li>Connect with customers through meaningful conversations to understand their needs and preferences</li><li>Stay updated on product knowledge and industry trends to better assist customers</li><li>Foster a positive and inclusive work environment<br/><br/></li></ul>Benefits:<br/><br/><ul><li>Receive comprehensive training in sales, retail skills, and customer service</li><li>Thrive in a dynamic and fast-paced work environment with daily challenges</li><li>Enjoy structured training and opportunities for career advancement<br/><br/></li></ul>Who We're Looking For:<br/><br/>Our client is on the look-out for enthusiastic individuals who:<br/><br/><ul><li>Possess strong communication and interpersonal skills</li><li>Have a self-motivated and ambitious mindset</li><li>Demonstrate a friendly demeanor and a commitment to exceptional customer service</li><li>Excel in a collaborative team environment</li><li>Exhibit excellent attention to detail and multitasking abilities</li><li>Are eager to learn and adapt to new sales techniques</li><li>Are comfortable using digital tools for sales presentations<br/><br/></li></ul>Don't miss this chance to be part of a fantastic team! Interviews are conducted via Zoom. Apply now to learn more!<br/><br/>Powered by JazzHR<br/><br/>GN8byRLn2m", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995129783"}