{"jobTitle": "Strategy Coordinator", "company": {"name": "TubeScience", "industry": "Advertising Services", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "salary": {"amount": "$25.00/hr - $35.00/hr", "currency": "USD"}, "jobFunction": "Advertising and Marketing", "industry": "Advertising Services", "description": "The Strategy Team Coordinator reports to the Senior Manager of Creative Operations and is responsible for managing project timelines and providing operational support to the Creative Strategy Team. They are also responsible for optimizing workflows, rolling out processes, and helping to onboard new employees. This person should be comfortable working in a fast-paced environment.", "responsibilities": "Assemble weekly project plans and schedule tasks to ensure creative deliverable deadlines are met. Coordinate and communicate with team members to identify and mitigate challenges that could alter project timelines. Monitor project statuses and communicate progress to team leads, advising on any project roadblocks. Coordinate and communicate with external stakeholders to secure project assets. Update and maintain shared team reference documents. Support the onboarding of new team members. Book freelance Digital QC workers. Work with the Creative Operations Team to implement, refine, and document workflow processes to ensure both creative and technical excellence.", "qualifications": {"required": "Experience coordinating creative projects for a fast-paced, high-volume operation. Experience working in project management tools such as Monday.com, Teamwork, Float, Google Calendar, Slack, etc. Excellent communication skills, both written and verbal. Ability to solve problems with a service-oriented mindset. Strong time management skills. Flexible and able to adapt to shifting priorities. Emphasis on organization and attention to detail. Knowledge of social media and digital platforms. Experience in Performance Marketing industry.", "preferred": ""}, "skills": ["Project Management", "Communication", "Problem Solving", "Time Management", "Organization", "Social Media Knowledge", "Performance Marketing"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Remote/flexible work options available. TubeScience is an equal opportunity employer.", "remoteWork": "Hybrid", "url": "https://www.linkedin.com/jobs/view/3995413787"}