{"jobTitle": "Executive Assistant & Communications Coordinator", "company": {"name": "The California Wellness Foundation", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00/yr - 115,100.00/yr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Philanthropic Fundraising Services", "description": "THE OPPORTUNITY<br/><br/>The California Wellness Foundation is seeking a skillful and savvy Executive Assistant &amp; Communications Coordinator to support strategic communications, media relations, and the full range of communications tools and tactics that advance the mission of the Foundation. The Executive Assistant &amp; Communications Coordinator will be a skillful project manager, strategic thought partner, and serve as a hub of information and bridge for complex projects and campaigns. In addition to supporting the communications team, the Executive Assistant &amp; Communications Coordinator will also provide executive support to the Vice President of Public Affairs, to whom the role reports, to allow the executive to focus on department- and enterprise-wide priorities.<br/><br/>The Executive Assistant &amp; Communications Coordinator will serve as a core member of the communications team within the Public Affairs Department. The Public Affairs Department merges communications, government relations and public policy, and community engagement with leadership from the Vice-President of Public Affairs and in close collaboration with department colleagues and other Cal Wellness departments.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>STRATEGIC COMMUNICATIONS COORDINATION<br/><br/><ul><li>Serve as the lead project manager for the communications team. This includes, but is not limited to the following:</li><li>Working with the Director of Communications and communications staff to manage and triage the pipeline of communications-related requests; track all tasks and deliverables from intake through final implementation; serve as a key point of contact on all internal and external communications-related requests. </li><li>Manage and regularly update a communications calendar that comprehensively incorporates all the key foundation communications priorities, including e-newsletters, blogs and other content, social media content, public events, announcements etc. </li><li>Work with the Director of Communications, Communications Officers, and Digital Communications Manager to create communications plans, develop communications campaigns, and support the implementation of tactics to effectively communicate the Foundation’s vision, mission, and key messages, including but not limited to presentation decks and marketing of external foundation events as needed. </li><li>Implement them effectively by providing strong project management support. </li><li>Serve as the liaison between all foundation departments and the communications team to ensure the proper flow of information, timelines, tasks, and deliverables.</li><li>Manage and facilitate the general Public Affairs inbox and email communications that come from the website.</li><li>Stay up to date on best practices in communications. Develop a comprehensive awareness of the Foundation’s core activities and priorities to maximize effectiveness.</li><li>Actively research advancements, tools and innovations in technology and the communications field to reach new and existing audiences.</li><li>Participate in all communications team meetings. <br/><br/><br/></li></ul>MEDIA RELATIONS SUPPORT<br/><br/><ul><li>Regularly monitor media hits, handle media inbox, and under the direction of the Director of Communications, facilitate requests for interviews with Cal Wellness staff and media outlets.</li><li>Build media lists aligned with all programmatic priorities and key issue areas.</li><li>With direction from the Director of Communications, develop initial drafts of media advisories, press releases, and other media-facing materials as needed.<br/><br/><br/></li></ul>EXECUTIVE &amp; ADMINSTRATIVE SUPPORT:<br/><br/><ul><li>Maintain Vice-President of Public Affairs (VPPA) calendar, scheduling meetings and coordinating related arrangements; manage VPPA’s expense reporting, ensuring timely submission of materials through Concur.</li><li>Provide all administrative support to the Communications team, including managing contracts, invoices and other team expenses, working closely with vendors and the Finance/Operations team to ensure all information is submitted accurately and quickly. Support the VPPA and Director of Communications in managing the communications budget. </li><li>Coordinate communications team meetings. Manage materials and documentation, including agenda planning, note taking, synthesizing outcomes, and distribution of advance materials as well as follow-on action items for regular communications team meetings. Follow up with task owners to ensure awareness of deliverables and timely completion of activities.</li><li>Develop and track all Public Affairs contracts and consulting agreements to support department work, coordinating with project leads in the department as well as Operations and Finance.</li><li>Design, implement and maintain efficient processes to manage administrative work within the department.<br/><br/><br/></li></ul>CANDIDATE PROFILE<br/><br/>The Executive Assistant &amp; Communications Coordinator position requires deep proficiency in a broad range of strategic communications, project management, and administrative operational activities. The ideal candidate has superb organizational and project management sills, excellent interpersonal skills, a positive attitude, the ability to anticipate needs as well as adapt and respond thoughtfully to emerging issues, and the ability to work quickly and effectively in a dynamic environment.<br/><br/>The position requires clear, effective verbal and written communications skills; excellent attention to detail; a high level of discretion, critical thinking, and judgement in handling sensitive and confidential information; and advanced organizational and prioritization skills necessary for multitasking and keeping the communications team on-track.<br/><br/><strong>Requirements, Qualifications And Relevant Experience<br/><br/></strong><ul><li>Experience in an administrative and/or project management capacity. </li><li>Prior experience in communications or public relations is strongly preferred. </li><li>Excellent oral and written communication skills.</li><li>Experience developing content or managing digital communications (e.g., websites, social media channels, electronic newsletters) for a professional organization is a plus.</li><li>Strong proficiency with MS Office, including Outlook, Excel, Word and PowerPoint, with ability to create high-level presentations.</li><li>Ability to proactively problem solve, identify, and implement effective solutions, even when there is a lack of clear process or standards.</li><li>Strong interpersonal skills with the ability to interact with a diverse population.</li><li>Strong organizational skills with high attention to detail and accuracy.</li><li>Ability to multitask, prioritize and follow through to effectively manage workflow.</li><li>Ability to plan ahead and work within deadlines.</li><li>Strong time management skills, effectively managing one's own time and the time of others.</li><li>Ability to use discretion and maintain confidentiality when handling sensitive materials and issues.</li><li>Experience with or knowledge of project management systems (e.g. Asana) and cloud based CRMs (e.g. Salesforce) is a plus. </li><li>Interest and ability to quickly learn the operations of the public affairs team at a philanthropic organization. <br/><br/><br/></li></ul>CORE COMPETENCIES<br/><br/>The ideal candidate will embody Cal Wellness’ core competencies:<br/><br/><ul><li>Commitment to Justice, Equity, Diversity &amp; Inclusion </li><li>Communication</li><li>Innovation</li><li>Leadership</li><li>Teamwork and Collaboration<br/><br/><br/></li></ul><strong>THE CALIFORNIA WELLNESS FOUNDATION<br/><br/></strong>The California Wellness Foundation (Cal Wellness) is a private, independent foundation established in 1992 with a mission to protect and improve the health and wellness of the people of California. As one of the largest health-focused foundations in California, with over $1 billion in assets, Cal Wellness is a nationally recognized leader for its strategic core operating support for grantees; public policy grantmaking; and a focus on violence as a public health issue. It is Cal Wellness’ desire to promote equity and level the playing field so that everyone has access to good-paying jobs; healthy and safe neighborhoods; and quality health care services.<br/><br/>The foundation’s current Advancing Wellness grantmaking strategy includes four interrelated portfolios. Since its founding, Cal Wellness has awarded nearly 12,400 grants totaling more than $1.3 billion. In addition to its grantmaking, the foundation has committed to using its voice, influence, and endowment dollars to advance its mission.<br/><br/>Cal Wellness has a diverse staff of approximately 47 located in its Los Angeles and Oakland offices and a diverse 13-member Board located throughout the state of California. The foundation’s work underscores a belief that wellness requires social justice, a deep commitment to diversity, equity, and inclusion (DEI), and sustained efforts to eliminate systemic barriers that prevent access to health care, education, employment, and safety.<br/><br/>Please visit http://www.calwellness.org for more information.<br/><br/>LOCATION &amp; TRAVEL<br/><br/>This position is based at either our Los Angeles or Oakland office, with a strong preference for Los Angeles. Cal Wellness operates with a hybrid work model that includes both in-office and remote work. In-office attendance will typically be required Tuesdays and Wednesdays. Travel is estimated at up to 10% to engage with the team and have a periodic presence at our Oakland office and to attend meetings and convenings across the state.<br/><br/><strong>Salary &amp; Benefits<br/><br/></strong>The target starting salary for the newly hired Executive Assistant &amp; Communications Coordinator is $95,000 per year (non-exempt, $45.67/hour). The full salary grade for the role is $85,000 to $115,100 per year.<br/><br/>Highlights from our benefit package include: a variety of medical, dental and vision plans, a generous 401(k) retirement savings plan with a 16% employer contribution, flexible paid time off, tuition reimbursement, professional development opportunities, 3:1 matching gifts, and the opportunity to work at a mission and values driven organization.<br/><br/>TO APPLY<br/><br/>Please apply here and upload a cover letter and resume ASAP and no later than September 8, 2024. We anticipate a target start date October 2024.<br/><br/>Resume review begins immediately, and candidates will be considered on a rolling basis. Those selected for advancement will be asked to participate in several rounds of interviews (virtual and in-person), complete a writing assignment, and provide a list of professional references. If you require a reasonable accommodation to participate in our application process, please let us know.<br/><br/><strong>The California Wellness Foundation is an equal opportunity employer and welcomes a diverse candidate pool. Additionally, we are a fair chance employer and welcome candidates with lived experience with the criminal justice system.<br/><br/></strong><em>The above job description is intended to describe the general nature and level of work performed and is not intended to limit the scope of potential work assignments. This is only a summary of the typical functions of the job and duties may differ from those as outlined above.</em>", "responsibilities": "STRATEGIC COMMUNICATIONS COORDINATION<br/><br/><ul><li>Serve as the lead project manager for the communications team. This includes, but is not limited to the following:</li><li>Working with the Director of Communications and communications staff to manage and triage the pipeline of communications-related requests; track all tasks and deliverables from intake through final implementation; serve as a key point of contact on all internal and external communications-related requests. </li><li>Manage and regularly update a communications calendar that comprehensively incorporates all the key foundation communications priorities, including e-newsletters, blogs and other content, social media content, public events, announcements etc. </li><li>Work with the Director of Communications, Communications Officers, and Digital Communications Manager to create communications plans, develop communications campaigns, and support the implementation of tactics to effectively communicate the Foundation’s vision, mission, and key messages, including but not limited to presentation decks and marketing of external foundation events as needed. </li><li>Implement them effectively by providing strong project management support. </li><li>Serve as the liaison between all foundation departments and the communications team to ensure the proper flow of information, timelines, tasks, and deliverables.</li><li>Manage and facilitate the general Public Affairs inbox and email communications that come from the website.</li><li>Stay up to date on best practices in communications. Develop a comprehensive awareness of the Foundation’s core activities and priorities to maximize effectiveness.</li><li>Actively research advancements, tools and innovations in technology and the communications field to reach new and existing audiences.</li><li>Participate in all communications team meetings. <br/><br/><br/></li></ul>MEDIA RELATIONS SUPPORT<br/><br/><ul><li>Regularly monitor media hits, handle media inbox, and under the direction of the Director of Communications, facilitate requests for interviews with Cal Wellness staff and media outlets.</li><li>Build media lists aligned with all programmatic priorities and key issue areas.</li><li>With direction from the Director of Communications, develop initial drafts of media advisories, press releases, and other media-facing materials as needed.<br/><br/><br/></li></ul>EXECUTIVE &amp; ADMINSTRATIVE SUPPORT:<br/><br/><ul><li>Maintain Vice-President of Public Affairs (VPPA) calendar, scheduling meetings and coordinating related arrangements; manage VPPA’s expense reporting, ensuring timely submission of materials through Concur.</li><li>Provide all administrative support to the Communications team, including managing contracts, invoices and other team expenses, working closely with vendors and the Finance/Operations team to ensure all information is submitted accurately and quickly. Support the VPPA and Director of Communications in managing the communications budget. </li><li>Coordinate communications team meetings. Manage materials and documentation, including agenda planning, note taking, synthesizing outcomes, and distribution of advance materials as well as follow-on action items for regular communications team meetings. Follow up with task owners to ensure awareness of deliverables and timely completion of activities.</li><li>Develop and track all Public Affairs contracts and consulting agreements to support department work, coordinating with project leads in the department as well as Operations and Finance.</li><li>Design, implement and maintain efficient processes to manage administrative work within the department.<br/><br/><br/></li></ul>", "qualifications": {"required": "Experience in an administrative and/or project management capacity.  Prior experience in communications or public relations is strongly preferred.  Excellent oral and written communication skills. Experience developing content or managing digital communications (e.g., websites, social media channels, electronic newsletters) for a professional organization is a plus. Strong proficiency with MS Office, including Outlook, Excel, Word and PowerPoint, with ability to create high-level presentations. Ability to proactively problem solve, identify, and implement effective solutions, even when there is a lack of clear process or standards. Strong interpersonal skills with the ability to interact with a diverse population. Strong organizational skills with high attention to detail and accuracy. Ability to multitask, prioritize and follow through to effectively manage workflow. Ability to plan ahead and work within deadlines. Strong time management skills, effectively managing one's own time and the time of others. Ability to use discretion and maintain confidentiality when handling sensitive materials and issues. Experience with or knowledge of project management systems (e.g. Asana) and cloud based CRMs (e.g. Salesforce) is a plus.  Interest and ability to quickly learn the operations of the public affairs team at a philanthropic organization. ", "preferred": "Commitment to Justice, Equity, Diversity &amp; Inclusion  Communication Innovation Leadership Teamwork and Collaboration"}, "skills": ["Project Management", "Strategic Communications", "Media Relations", "Communications", "Public Relations", "MS Office", "Outlook", "Excel", "Word", "PowerPoint", "Problem Solving", "Interpersonal Skills", "Organizational Skills", "Time Management", "Discretion", "Confidentiality", "Project Management Systems", "Cloud Based CRMs", "Philanthropic Organization"], "postedDate": "2 weeks ago", "benefits": "Highlights from our benefit package include: a variety of medical, dental and vision plans, a generous 401(k) retirement savings plan with a 16% employer contribution, flexible paid time off, tuition reimbursement, professional development opportunities, 3:1 matching gifts, and the opportunity to work at a mission and values driven organization.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995447677"}