{"jobTitle": "Director of Social Media & Content", "company": {"name": "Pixi Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Marketing", "industry": "Personal Care Product Manufacturing", "description": "<strong><u>Our Company</u></strong>\n<p>At Pixi, we're dedicated to redefining beauty standards and empowering individuals to express themselves through makeup and skincare. As a leading beauty brand in the industry, we've gained global recognition for our innovative products and commitment to inclusivity. To continue our journey of growth and creativity, we are seeking an exceptional Director of Social Media &amp; Content to join our team.</p><p><br/></p><p><strong><u>Role Overview:</u></strong></p><p>As the Director of Social Media &amp; Content, you will play a pivotal role in shaping our brand's digital presence and driving engagement across various social media platforms. You will lead a team of creative professionals and collaborate closely with marketing, creative, and product development teams to develop and execute impactful social media and content strategies. Your creativity, strategic thinking, and passion for beauty will be essential in building brand awareness and fostering meaningful connections with our audience.</p><p><br/></p><p><strong><u>Responsibilities / Accountabilities</u></strong></p><p><br/></p><ol><li><strong>Social Media Strategy:</strong> Develop and oversee a comprehensive social media strategy (including Live Content) that aligns with our brand’s values and objectives. Continuously evaluate and adapt the strategy to stay ahead in the ever-evolving digital landscape.</li><li><strong>Content Creation:</strong> Lead the creation of visually stunning and compelling content, including photos, videos, graphics, live streams, and written copy, for use across our social media channels, website, and other digital platforms.</li><li><strong>Team Leadership:</strong> Manage and inspire a team of social media and content creators, providing guidance, feedback, and mentoring to ensure the highest quality of work.</li><li><strong>Platform Management:</strong> Manage and optimize our presence on various social media platforms, including but not limited to Instagram, Facebook, TikTok, YouTube, and Twitter. Stay up to date with platform updates and trends to maximize engagement.</li><li><strong>Audience Engagement:</strong> Foster and nurture relationships with our online community by responding to comments, messages, and feedback promptly. Encourage user-generated content and meaningful interactions.</li><li><strong>Brand:</strong> Ensure that all content is consistent with the Pixi brand in terms of style, quality, and tone of voice.</li><li><strong>Analytics and Reporting:</strong> Utilize analytics tools to track and analyze social media performance metrics. Provide regular reports and insights to the executive team, highlighting successes and opportunities for improvement.</li><li><strong>Content Calendar:</strong> Develop and maintain a content calendar that ensures a consistent and cohesive brand presence across all digital platforms.</li><li><strong>Trend Spotting:</strong> Stay current with beauty and social media trends to identify opportunities for innovative content and marketing strategies.</li><li><strong>Budget Management:</strong> Responsible for the budget allocated to social media and content creation, ensuring efficient allocation of resources.</li><li><strong>Compliance:</strong> Ensure all content adheres to industry regulations and best practices for transparency and authenticity.</li></ol><p><br/></p><p><strong><u>Requirements</u></strong></p><ul><li>Bachelor's degree in Marketing, Communications, or a related field (Master's preferred).</li><li>Proven experience in a senior-level social media and content role within the beauty industry.</li><li>Strong understanding of social media algorithms, advertising, and digital marketing trends.</li><li>Exceptional creative and storytelling skills.</li><li>Proficiency in social media management tools and analytics platforms.</li><li>Strong leadership and team management abilities.</li><li>Excellent communication and interpersonal skills.</li><li>Passion for beauty, makeup, and skincare trends.</li><li>Ability to adapt to a fast-paced and dynamic environment.</li></ul><p></p>", "postedDate": "1 week ago", "skills": ["Social Media", "Content Creation", "Marketing", "Digital Marketing", "Social Media Strategy", "Team Management", "Analytics", "Content Calendar", "Beauty", "Makeup", "Skincare"], "url": "https://www.linkedin.com/jobs/view/3995436534"}