{"jobTitle": "Coordinator, Film Publicity", "company": {"name": "Netflix", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$60,000 - $234,000"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>It’s the chance to work with a publicity team transforming entertainment on an innovative platform that enables viewers to watch any time, on any device. With more exciting entertainment titles on the way and a publicity team eager to try new methods beyond the “traditional”, it’s a great time to join Netflix.<br/><br/><strong>The Opportunity<br/><br/></strong>The Film Coordinator will be key in supporting team members and campaign publicity work across multiple films and projects. Ideal candidates will have a base knowledge of the entertainment landscape and a strong passion and interest in entertainment publicity. The Film Coordinator is a collaborative team player, exercises sound judgment, is self-motivated, passionate, proactive, resourceful, flexible, and can juggle multiple and diverse responsibilities across many different initiatives simultaneously. They have an exemplary eye for organization, attention to detail and the ability to make quick, wise decisions even when faced with ambiguity. This demanding and fast-moving position requires someone who has a positive attitude, takes initiative, effectively prioritizes work, and is a very strong and clear communicator.<br/><br/>The publicity coordinator is responsible for the majority of the daily logistical functions of the team, including, but not limited to: the upkeep of team documents, the booking of travel and glam for talent, working with personal talent reps, generating and maintaining talent schedules, compiling coverage reports and campaign recaps, day-to-day budget maintenance and invoice processing, assigning screeners/booking screenings, working events/screenings, as well as communication with reps, talent and showrunners/filmmakers where needed.<br/><br/>The job is based in New York and reports to the Director of Publicity.<br/><br/><strong>Specific Tasks Will Include But Are Not Limited To<br/><br/></strong><ul><li>Update and maintain various lists, documents and charts on the department’s google drive</li><li>Create and manage talent itineraries, and book and oversee all aspects of talent travel to ensure all goes smoothly including troubleshooting as needed.</li><li>Track and update information related to our titles in a timely way including news announcement calendar, timelines, press coverage, and press notes.</li><li>Negotiate glam rates and work with agencies to ensure timely payment.</li><li>Support junket, premiere, and press day activities including car and glam coordination, day of logistics, screenings and select talent handling duties. </li><li>Day-to-day maintenance of title budgets, track and submit payments, balancing title funds and submit POs</li><li>Coordinate with outside agencies and vendors to track contracts and ensure timely payment, create and submit SOWs and contracts and PO schedule for payment, onboard new vendors as needed</li><li>Service campaign assets and publicity materials to press and talent</li><li>Assign early access screeners on PIX &amp; Media Center and troubleshoot as needed</li><li>Update film information across various internal databases and external facing Media Center</li><li>Assist with scheduling and facilitation of meetings, including securing of conference rooms, assist in putting together agendas and presentations, and coordinating audio/visual needs. </li><li>Collate and distribute press breaks to communicate with showrunners/filmmakers and talent about breaking press beats.</li><li>Branch outside of campaign-specific work to help innovate internal workflows.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>The successful candidate(s) for these teams will have:<br/><br/><ul><li>At least 1-2 years of publicity/communications-related entertainment experience in a studio, network, agency, brand, or similar organization. </li><li>Passionate and knowledgeable about the entertainment landscape and enthusiastic to learn about the business.</li><li>A clear and concise communicator with a point of view. Must be collaborative and willing to offer their unique perspective and voice and effectively convey complex ideas written and verbally</li><li>Must possess solid organizational skills and be able to manage time effectively.</li><li>Resourceful and relentless in trying to find a solution and make wise decisions, even when faced with ambiguity. </li><li>Able to pivot and adapt to shifting priorities without missing a beat</li><li>Experienced in managing competing priorities, while knowing how to raise their hand for help if needed.</li><li>Curious and eager to learn and improve</li><li>Poised, not scared to voice complex ideas to peers and leaders and are ‘cool under fire’ while managing a multitude of simultaneous tasks. </li><li>Self-aware and not afraid to share what they could have done better. </li><li>Able to take action on constructive feedback and does not avoid giving feedback to the rest of the team, including their manager.</li><li>Looking to develop their skill set and learn the fundamentals of what makes a stellar publicity campaign.</li><li>Proactive and embody &amp; promote our company values every day. </li><li>Based in New York or Los Angeles with the ability to be in office at least 3 times a week, will travel and work nights/weekends as needed. <br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $60,000 - $234,000.<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "The Film Coordinator will be key in supporting team members and campaign publicity work across multiple films and projects. Ideal candidates will have a base knowledge of the entertainment landscape and a strong passion and interest in entertainment publicity. The Film Coordinator is a collaborative team player, exercises sound judgment, is self-motivated, passionate, proactive, resourceful, flexible, and can juggle multiple and diverse responsibilities across many different initiatives simultaneously. They have an exemplary eye for organization, attention to detail and the ability to make quick, wise decisions even when faced with ambiguity. This demanding and fast-moving position requires someone who has a positive attitude, takes initiative, effectively prioritizes work, and is a very strong and clear communicator.<br/><br/>The publicity coordinator is responsible for the majority of the daily logistical functions of the team, including, but not limited to: the upkeep of team documents, the booking of travel and glam for talent, working with personal talent reps, generating and maintaining talent schedules, compiling coverage reports and campaign recaps, day-to-day budget maintenance and invoice processing, assigning screeners/booking screenings, working events/screenings, as well as communication with reps, talent and showrunners/filmmakers where needed.", "qualifications": {"required": "At least 1-2 years of publicity/communications-related entertainment experience in a studio, network, agency, brand, or similar organization. <br/>Passionate and knowledgeable about the entertainment landscape and enthusiastic to learn about the business.<br/>A clear and concise communicator with a point of view. Must be collaborative and willing to offer their unique perspective and voice and effectively convey complex ideas written and verbally<br/>Must possess solid organizational skills and be able to manage time effectively.<br/>Resourceful and relentless in trying to find a solution and make wise decisions, even when faced with ambiguity. <br/>Able to pivot and adapt to shifting priorities without missing a beat<br/>Experienced in managing competing priorities, while knowing how to raise their hand for help if needed.<br/>Curious and eager to learn and improve<br/>Poised, not scared to voice complex ideas to peers and leaders and are ‘cool under fire’ while managing a multitude of simultaneous tasks. <br/>Self-aware and not afraid to share what they could have done better. <br/>Able to take action on constructive feedback and does not avoid giving feedback to the rest of the team, including their manager.<br/>Looking to develop their skill set and learn the fundamentals of what makes a stellar publicity campaign.<br/>Proactive and embody &amp; promote our company values every day. <br/>Based in New York or Los Angeles with the ability to be in office at least 3 times a week, will travel and work nights/weekends as needed. ", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3995331535"}