{"jobTitle": "PR Agency - EVP of Earned Media Strategy", "company": {"name": "TalentNow Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$200,000.00/yr - $250,000.00/yr", "currency": "USD"}, "jobFunction": "Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Our Client is a a fast-paced consumer PR agency hiring a dynamic and visionary EVP of Media Strategy to join the agency's centralized earned Media Team.<br/><br/>The EVP will lead a team of 10+ bi-coastal earned media specialists, who provide counsel and expertise on media strategy and outreach for all agency clients across the following verticals: Food &amp; CPG, Wine &amp; Spirits, Health &amp; Wellness, Beauty, Personal Care &amp; Fashion, Home &amp; Lifestyle, Technology &amp; E-Commerce, and more. The EVP will report to the Chief Entertainment + Media Officer.<br/><br/>In this role, the EVP will be responsible first and foremost for the management and growth of the team of bi-coastal specialists and must effectively oversee a large volume of both short and long-term assignments across all agency clients. In addition to the day-to-day management of Media Team members, this role is also one that provides strategic guidance to internal agency account team members (of all levels, Account Coordinators - C suite) as well as clients.<br/><br/>The EVP will inspire innovation and results across client campaigns, with attention to crafting story ideas, developing the team's strong relationships with national, broadcast, trade, regional and local media and, of course, earning journalists' attention. The ideal candidate has experience with consumer, entertainment and business + corporate storytelling.<br/><br/>This is a key leadership position within the agency's Specialty Services Teams and will drive continued departmental growth and development. We are seeking a media enthusiast with relentless curiosity and a deep understanding of the evolving media landscape. This role will focus on evolving department expertise to match the changing media landscape and act as a center of excellence resource for the agency's earned media needs. The EVP must deep industry experience and understanding in order to effectively work to counsel and partner with colleagues (account team, digital/social, creative, entertainment, etc.) and agency partners in order to develop media strategies that fit within the larger marketing mix<br/><br/>The ideal candidate will steer the agency's point of view and work, counsel clients, participate in new business development, mentor talent, and provide thought leadership to keep the agency ahead in a connected media world.<br/><br/><em><strong>Media Strategy/Specialty Management <br/><br/></strong></em><ul><li> Counsel in earned-centric strategy development and narrative creation for proactive and reactive media outreach to drive results and media placements</li><li> Play an integral role in overseeing the teams' efforts across media outreach, from strategy to execution, including planning, pitching, and recapping</li><li> Anticipate issues; recognize potential challenges and act early to remedy them</li><li> Stay ahead of industry trends and consumer insights, identifying opportunities to align tactics with client objectives</li><li> Partner with agency leaders to establish and track key performance indicators (KPIs) for media strategies and campaigns</li><li> Assist Managing Directors in problem-solving for clients, or teams. Make recommendations for ways to meet the needs</li><li> Cultivate and maintain relationships with top-tier media contacts to secure high-impact placements and coverage<br/><br/></li></ul><em><strong>Talent Leadership <br/><br/></strong></em><ul><li> Lead a team of 10+ media specialists, fostering a collaborative, engaged, and positive work environment</li><li> Drive professional development and growth within the team through mentorship, coaching and training</li><li> Foster a culture of curiosity, encouraging the team to explore new media channels and technologies</li><li> Be a positive role model and mentor for others across the agency, specifically in the areas of people management and client service<br/><br/></li></ul><em><strong>Agency + Department Growth <br/><br/></strong></em><ul><li> Build and maintain strong cross departmental relationships, offering expert counsel on media strategy and outreach</li><li> Participate in new business pitches and presentations, showcasing agency's media strategy expertise</li><li> Represent the agency in industry forums, white papers, and speaking engagements, when applicable</li><li> Provide regular reports and updates to senior leadership on media performance and impact</li><li> Continuously seek opportunities to improve process and delivery exceptional results for clients</li><li> Demonstrate an interest in the long-range health of the Agency and collaborate with leadership to establish a growth plan<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong>Bachelor's degree in communications, Public Relations, Marketing, or related field<br/><br/>This is a hybrid role that can be based in NY or LA. The agency is on a 3/2 schedule.<br/><br/><ul><li> Minimum of 15 years of experience in media relations, public relations, or communications, with a proven track record of driving innovation and achieving impactful results</li><li> Strong network of media contacts across diverse industries and platforms</li><li> Exceptional strategic thinking and problem-solving skills, with a passion for pushing boundaries and exploring new approaches</li><li> Demonstrated leadership experience, with the ability to inspire and mentor a team to achieve excellence</li><li> Proficiency in media monitoring and analytics tools to measure campaign performance and ROI</li><li> Excellent communication and presentation skills, with the ability to effectively convey complex ideas and strategies to internal teams and clients<br/><br/></li></ul><em>In order to comply with equal pay and salary transparency laws in various locations, the Company believes the target base compensation for this role is $200,000-250,000. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, and location</em>", "responsibilities": "Counsel in earned-centric strategy development and narrative creation for proactive and reactive media outreach to drive results and media placements\nPlay an integral role in overseeing the teams' efforts across media outreach, from strategy to execution, including planning, pitching, and recapping\nAnticipate issues; recognize potential challenges and act early to remedy them\nStay ahead of industry trends and consumer insights, identifying opportunities to align tactics with client objectives\nPartner with agency leaders to establish and track key performance indicators (KPIs) for media strategies and campaigns\nAssist Managing Directors in problem-solving for clients, or teams. Make recommendations for ways to meet the needs\nCultivate and maintain relationships with top-tier media contacts to secure high-impact placements and coverage\nLead a team of 10+ media specialists, fostering a collaborative, engaged, and positive work environment\nDrive professional development and growth within the team through mentorship, coaching and training\nFoster a culture of curiosity, encouraging the team to explore new media channels and technologies\nBe a positive role model and mentor for others across the agency, specifically in the areas of people management and client service\nBuild and maintain strong cross departmental relationships, offering expert counsel on media strategy and outreach\nParticipate in new business pitches and presentations, showcasing agency's media strategy expertise\nRepresent the agency in industry forums, white papers, and speaking engagements, when applicable\nProvide regular reports and updates to senior leadership on media performance and impact\nContinuously seek opportunities to improve process and delivery exceptional results for clients\nDemonstrate an interest in the long-range health of the Agency and collaborate with leadership to establish a growth plan", "qualifications": {"required": "Bachelor's degree in communications, Public Relations, Marketing, or related field\nMinimum of 15 years of experience in media relations, public relations, or communications, with a proven track record of driving innovation and achieving impactful results\nStrong network of media contacts across diverse industries and platforms\nExceptional strategic thinking and problem-solving skills, with a passion for pushing boundaries and exploring new approaches\nDemonstrated leadership experience, with the ability to inspire and mentor a team to achieve excellence\nProficiency in media monitoring and analytics tools to measure campaign performance and ROI\nExcellent communication and presentation skills, with the ability to effectively convey complex ideas and strategies to internal teams and clients"}, "skills": ["Media Relations", "Public Relations", "Communications", "Media Strategy", "Media Outreach", "Storytelling", "Consumer Insights", "Media Monitoring", "Analytics", "Leadership", "Mentorship", "Team Management", "Client Service", "New Business Development", "Thought Leadership"], "postedDate": "2 weeks ago", "url": "https://www.linkedin.com/jobs/view/3995758047"}