{"jobTitle": "Oracle SCM Cloud Manufacturing Lead - Senior Manager", "company": {"name": "PwC", "industry": "Accounting, Financial Services, and Business Consulting and Services", "size": "Not Applicable", "location": "Little Rock, AR"}, "location": "Little Rock, AR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$130,000 - $256,000", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Accounting, Financial Services, and Business Consulting and Services", "description": "A career in our Oracle Supply Chain and Operations team, within our Oracle consulting practice, will provide you with the opportunity to help organizations use enterprise technology to achieve their digital technology goals and capitalise on business opportunities. We help our clients implement and effectively use Oracle offerings to solve their business problems and fuel success in the areas of Planning, Sourcing, Manufacturing, and Logistics. As part of our supply chain and operations team, you will utilize Oracle applications to help our clients address a variety of strategic operations challenges and create sustainable change and continuous process improvement to maximise opportunities and create value throughout the enterprise.", "responsibilities": "As a Senior Manager, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to: Encourage everyone to have a voice and invite opinion from all, including quieter members of the team. Deal effectively with ambiguous and unstructured problems and situations. Initiate open and candid coaching conversations at all levels. Move easily between big picture thinking and managing relevant detail. Anticipate stakeholder needs, and develop and discuss potential solutions, even before the stakeholder realises they are required. Contribute technical knowledge in area of specialism. Contribute to an environment where people and technology thrive together to accomplish more than they could apart. Navigate the complexities of cross-border and/or diverse teams and engagements. Initiate and lead open conversations with teams, clients and stakeholders to build trust. Uphold the firm's code of ethics and business conduct.", "qualifications": {"required": "Demonstrating proven intimate level knowledge and understanding of Oracle Cloud, emphasizing an Oracle consulting and/or production support background assisting clients in the implementation and support of Oracle packaged solutions; Demonstrating proven intimate knowledge and considerable exposure to the common issues facing health industries, technology media and telecom, and industrial products and services clients who run Oracle applications; Demonstrating experience leading successful and Oracle Cloud implementations in healthcare, technology media and telecommunication and industrial products and services with focus on building new business capabilities and transforming operations; Leveraging next generation technology to enable and sustain business outcomes including intelligent automation, block chain, mobile, social media, and artificial intelligence; Improving business processes enabled by Oracle Cloud solutions, including but not limited to Human Capital Management, Finance Operations, and Supply Chain Management; Demonstrating a track record of success as engagement leader on numerous Oracle Cloud implementations, with various Oracle Cloud Applications, including prioritizing strategy, program/project plans and establishing successful delivery; Understanding the importance of a structured, controlled production systems environment, possessing the ability to handle and prioritize multiple tasks in a fast-paced team environment; Demonstrating ability to quickly identify and address client needs by actively participating in client discussions and meetings, communicating a broad range of Firm services, managing engagements including preparing concise, accurate documents and balancing project economics management with the occurrence of unanticipated issues; Identifying and addressing client needs by building relationships with clients, developing an awareness of Firm services, communicating with the client in an organized and knowledgeable manner, delivering clear requests for information, demonstrating flexibility in leading engagement team to prioritize and complete tasks, and communicating potential conflicts; Understanding personal and team roles (both client facing and offshore); Contributing to a positive working environment by building relationships with team members; Seeking guidance, clarification and feedback proactively, and providing guidance, clarification and feedback to project staff; Participating in the development of thought leadership, for example white papers, and conference presentations; Supporting the reinvestment activities within the practice, for example, model systems, digital accelerators, recruiting, and methodology; and, Leading, mentoring, coaching staff, including providing timely meaningful written and verbal feedback.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation and more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995822224"}