{"jobTitle": "Accounting & Data Analyst", "company": {"name": "FSTONE Technologies", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "jobFunction": "Information Technology", "industry": "Internet Publishing", "description": "This role will perform, monitor and reconcile intermediate operating functions within a high-volume environment related to cash accounting, specialized asset accounting, fee and revenue accounting, client report generation and regulatory and management reporting. Utilize prescribed policies, procedures and task lists to efficiently execute upon responsibilities, promote necessary controls, mitigate operational risk and identify production issues that must be escalated for review and remediation.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Process all assigned transactional responsibilities within defined Service Level Agreement SLA</li><li>Generate assigned reporting and monitor system activity to ensure transactional workflows are completed as prescribed</li><li>Participate in prescribed rotations of assigned responsibilities to ensure proper level of cross training is obtained</li><li>Serve as a point of escalation to evaluate and remediate complex system account transactional discrepancies</li><li>Establish effective relationships with direct teammates as well as teammates that are both upstream and downstream of assigned responsibilities</li><li>Provide constructive guidance to teammates in order to effectively complete assigned team functions</li><li>Assist in the creation of desk procedures, checklists, etc. to ensure team functions are executed correctly</li><li>Participate in system testing, business continuity testing or other activities as identified that impact or rely upon the completion of assigned responsibilities<br/><br/></li></ul><strong>Basic Qualifications:<br/><br/></strong><ul><li>Minimum of 1 year of accounting experience<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Associates degree or higher. College level accounting courses will be helpful</li><li>Experience with FIS and or SEI accounting applications</li><li>Strong communication, time management and interpersonal skills</li><li>Established accounting knowledge with an emphasis on cash flow and accrual accounting and reconciliation concepts</li><li>Effective communication, time management and interpersonal skills</li><li>Intermediate PC skills with an emphasis on Microsoft Office, common banking systems and trust service platforms<br/><br/></li></ul><strong>Professional Qualifications:<br/><br/></strong><ul><li>Strong organizational skills and attention to detail</li><li>Self-starter and highly motivated</li><li>Ability to monitor work received, prioritize, research, and identify missing information</li><li>Ability to work independently</li><li>Ability to grasp complex concepts and develop abstract ideas within a short timeframe</li><li>Flexibility to adjust to increase work volumes</li><li>Strong technical skills in Microsoft Word, Excel, and Access. Advanced Excel skills (building and maintaining complex spreadsheets)<br/><br/></li></ul>Powered by JazzHR<br/><br/>eYvPkMkyzU", "postedDate": "2 weeks ago", "skills": ["FIS", "SEI", "Microsoft Office", "Excel", "Access"], "url": "https://www.linkedin.com/jobs/view/3995132412"}