{"jobTitle": "Administrative Assistant", "company": {"name": "Cynet Systems", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "22.00/hr - 27.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Information Technology & Services", "description": "Job Description:\n\nPay Range: $22hr -$27hr\n\nResponsibilities:\n\nThis seasonal position will provide support to the VP, Global Publicity & Awards and Sr. Publicist Awards on the Awards Team. \n\nAdministrative and logistical support related to events such as FYC screenings, receptions/events and ceremonies. \n\nThis person will need to be organized, extremely efficient, and able to anticipate the needs of a fast-paced office. \n\nIn addition to being a proactive team member, they will need to be an excellent communicator who is tech-savvy. \n\nIn addition to weekday office hours, they will also need to be available to help work events some nights and weekends.\n\nProvide logistical support including managing communication with vendors regarding payments, helping organize finance documents to support the awards office with their processing of invoices and helping ensure that vendors are paid on time.\n\nAssisting with creating presentation decks, updating awards documents and circulating to the awards team.\n\nSetting awards meetings, collecting agenda items and distributing pertinent documents for each meeting in a timely manner.\n\nProviding logistical support including creating print requests, trafficking DCPs, managing RSVPs, ticketing, seating, and check-in for events such as the FYC screenings, awards tastemakers.\n\nSupport the execution of ad hoc duties and special projects as assigned.\n\nPosition Requirements:\n\nBachelor’s degree preferred in Communications.\n\nDesire for administrative experience, preferably in the Awards and Publicity film industry.\n\nThe ability to work discreetly and professionally with high level executives, VIPs, Academy members, and the public.\n\nHighly professional verbal and written communication skills with special attention to detail and accuracy.\n\nAbility to work cooperatively with voting members, colleagues in the publicity team and other departments, and outside companies.\n\nProficiency in Microsoft Office Suite applications (Outlook, Word, Excel, PowerPoint and SharePoint).\n\nAbility to work and meet deadlines under pressure and change tasks as needed.\n\nEfficient means to travel to off-site events in LA and surrounding areas.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995928724"}