{"jobTitle": "Retail, General Store Manager", "company": {"name": "Crocs", "industry": "Retail Apparel and Fashion", "size": "201-500 employees", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$34.00/hr - $40.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "As the General Manager, you will lead a dedicated team of store associates & leaders every day, to create an exceptional consumer experience. Your focus will be on driving sales, providing excellent customer service, maintaining visual presentations, and developing talent within the store. This role offers the opportunity to grow and collaborate with industry-leading teammates and partners.", "responsibilities": "Deliver outstanding service to our consumers using our C.H.A.R.M service model. Leads the store team in surpassing performance metrics including sales, consumer service, and charms. Apply analytical thinking & company reporting to find opportunities within the store, empowering the team to make strategic decisions. Lead visual presentation, product flow, replenishment, and operational standards throughout the store. Build Foster a welcoming, inclusive environment that engages promotes internal growth, and builds an external network of talent. Coordinate, delegate, prioritize, and meet store deadlines while ensuring effective follow-up on daily activities. Contribute to crafting a team environment that encourages sharing of suggestions, ideas, and concerns while upholding Crocs Inc. values. Learn & assist in various departments including consumer service, product knowledge, visual presentation, and stock room management. Support team members in the daily execution of retail operations i.e., POS system management and use, stock replenishment, assisting in pricing and markdown processes seasonally, promoting loyalty programs, maintaining cleanliness and recovery standards, etc. Adhere to Crocs Asset Protection policies and procedures, including shortage prevention, inventory control, and compliance procedures.", "qualifications": {"required": "Must be 18 years or older, 4+ years of total retail experience, preferably with previous Store Manager experience, Proven leadership skills with the ability to challenge, empower, and drive team results, Strong communication skills (written and verbal) to successfully connect with store team members, operations managers, district managers, and corporate partners, A valid driver’s license and clean driving record may be required, Desire to succeed in a high-growth, fast-paced retail environment, Flexibility in work schedule including availability for nights, weekends, holidays, and extended hours.", "preferred": ""}, "skills": ["Leadership", "Customer Service", "Sales Management", "Retail Operations", "Team Development"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "This position is eligible for company benefits including but not limited to medical, dental, and vision coverage, life and AD&D, short and long-term disability coverage, paid time off, employee assistance, participation in a 401k program that includes company match, and many other additional voluntary benefits.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995660524"}