{"jobTitle": "Total Rewards Director", "company": {"name": "LA Family Housing", "location": "Los Angeles, CA", "industry": "Non-profit Organizations"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Other", "industry": "Non-profit Organizations", "description": "<strong>POSITION: </strong>Total Rewards Director<br/><br/><strong> DIVISION: </strong>People &amp; Culture- Human Resources<br/><br/><strong>Why Join Us<br/><br/></strong>You believe that every person deserves a place to call home. You see that homelessness is a systemic issue and want to be a part of the solution. You are ready to utilize your talent, experience, and creativity towards purpose-driven work. You want to work alongside industry leaders to learn, implement, and pioneer best practices.<br/><br/>LA Family Housing is a leading non-profit agency in Homeless Services and Real Estate Development. With 40 years of experience and 13,000+ people’s lives changed each year, we know what it takes to end homelessness. We take tremendous pride in the emergence of our staff as national leaders in innovation, best practices, and policy within housing production and homeless services. Join the fight to end homelessness and make a difference in people’s lives at LA Family Housing!<br/><br/><strong>The Position<br/><br/></strong>The Total Rewards Director is responsible for developing and managing comprehensive compensation and benefits strategies aligned with organizational goals. Key responsibilities include creating and maintaining competitive pay structures, overseeing salary and benefits administration, ensuring compliance with relevant laws, and conducting regular market analysis. This role also involves designing incentive programs, leading the annual open enrollment process, managing vendor relationships, and providing employee support. Additionally, the position integrates total rewards strategies, develops and manages related policies, and ensures financial sustainability through budget oversight and cost analysis. Effective leadership, cross-functional collaboration, change management, and employee engagement are critical components of this role, along with the management of HR systems and regular reporting to executive leadership.<br/><br/><strong>What You'll Do<br/><br/></strong><em>Compensation Management<br/><br/></em><ul><li>Develop &amp; Implement Compensation Strategy: Create and maintain a comprehensive compensation strategy aligned with the organization’s mission and financial objectives.</li><li>Conduct Market Analysis: Regularly benchmark compensation practices against industry standards to ensure competitive pay structures.</li><li>Salary Structure Management: Oversee the design and administration of salary structures, including job evaluations, salary ranges, and pay adjustments.</li><li>Compensation Compliance: Ensure all compensation practices comply with applicable laws and regulations.</li><li>Manage Compensation Reviews: Coordinate annual compensation reviews, including COLA/merit increases, promotions, and market adjustments.</li><li>Incentive Programs: Design and manage incentive and bonus programs to drive employee performance and retention.</li><li>Job Descriptions: Conduct job analysis and collaborate with hiring managers to develop job descriptions.<br/><br/></li></ul><em>Benefits Administration<br/><br/></em><ul><li>Benefit Plan Design: Oversee the development, implementation, and administration of employee benefit programs, including health, dental, vision, retirement plans, and wellness initiatives.</li><li>Vendor Management: Manage relationships with benefit providers, ensuring the best value and service for employees and the organization.</li><li>Open Enrollment: Lead the annual open enrollment process, including plan selection, employee communication, and system updates.</li><li>Benefits Compliance: Ensure all benefits programs comply with ERISA, ACA, HIPAA, and other relevant regulations.</li><li>Employee Support: Provide guidance and support to employees regarding benefits issues, claims, and plan options.<br/><br/></li></ul><em>Total Rewards Strategy<br/><br/></em><ul><li>Integration of Total Rewards: Develop a holistic total rewards strategy that integrates compensation, benefits, recognition, and work-life balance programs.</li><li>Data-Driven Decisions: Use data analytics to inform total rewards strategies and make adjustments based on organizational needs and employee feedback.</li><li>Communicate Value Proposition: Effectively communicate the value of the total rewards package to employees to enhance understanding and appreciation. Create and distribute annual total rewards statements.<br/><br/></li></ul><em>Policy Development &amp; Administration<br/><br/></em><ul><li>Policy Development: Develop, implement, and manage policies related to compensation and benefits.</li><li>Compliance Monitoring: Ensure all compensation and benefits policies are compliant with federal, state, and local laws.<br/><br/></li></ul><em>Financial Management<br/><br/></em><ul><li>Budget Oversight: Develop and manage the compensation and benefits budget, ensuring alignment with organizational financial goals.</li><li>Cost Analysis: Analyze the cost implications of various compensation and benefits plans to ensure financial sustainability.<br/><br/></li></ul><em>Leadership &amp; Collaboration<br/><br/></em><ul><li>Team Leadership: Lead, mentor, and develop the compensation and benefits team, providing direction and support.</li><li>Cross-Functional Collaboration: Work closely with HR, finance, and executive leadership to align total rewards strategies with organizational goals.</li><li>Change Management: Lead change initiatives related to compensation and benefits, ensuring smooth transitions and effective communication.<br/><br/></li></ul><em>Employee Engagement &amp; Communication<br/><br/></em><ul><li>Education &amp; Training: Develop educational materials and training programs to help employees understand their compensation and benefits.</li><li>Feedback Mechanisms: Implement feedback mechanisms to gauge employee satisfaction with total rewards and identify areas for improvement.<br/><br/></li></ul><em>Technology &amp; Systems Management<br/><br/></em><ul><li>Systems Oversight: Oversee HRIS module and other technology systems used for compensation and benefits administration.</li><li>Process Improvements: Identify and implement process improvements to enhance efficiency and accuracy in compensation and benefits administration.<br/><br/></li></ul><em>Reporting &amp; Analysis<br/><br/></em><ul><li>Regular Reporting: Provide regular reports and analysis to executive leadership on total rewards metrics and trends.</li><li>Benchmarking: Conduct periodic reviews of compensation and benefits to benchmark against industry standards and make recommendations for adjustments.<br/><br/></li></ul><strong>What You're Skilled At<br/><br/></strong><ul><li>Compensation and Benefits Expertise: Deep understanding of compensation and benefits principles, market analysis, and incentive program design.</li><li>Regulatory Compliance: Knowledge of Federal and State laws and regulations related to compensation and benefits, ensuring compliance with ERISA, ACA, HIPAA, etc.</li><li>Analytical Skills: Proficiency in data analysis, cost analysis, and budget management.</li><li>Effective Communication: Strong skills in explaining complex concepts and developing educational materials.</li><li>Policy Development: Experience in creating and managing compensation and benefits policies.</li><li>Project and Process Management: Ability to manage multiple initiatives and maintain attention to detail.</li><li>Leadership and Collaboration: Proven leadership skills, mentoring abilities, and experience in cross-functional collaboration.</li><li>Technology Proficiency: Expertise in HRIS and other systems for compensation and benefits administration, with a focus on process improvement. UKG experience a plus. <br/><br/></li></ul><strong>Other<br/><br/></strong><ul><li>Maintain and execute confidential information according to HIPPA standards</li><li>Obtain and maintain CPR/First Aid Certification</li><li>Ability to pass post offer Tuberculosis (TB) clearances</li><li>Travel is a regular duty for this position and is required 5% of time </li><li>Must have and maintain a valid California Driver License and auto insurance in good standing </li><li>Ability to work a 9/80 work schedule</li><li>Ability to work a hybrid work schedule <br/><br/></li></ul><strong>What You've Accomplished<br/><br/></strong><ul><li>Bachelor's degree in Human Resources, Business Management, Public Administration or related field. Years of experience may substitute for educational requirement. </li><li>Minimum of 7-10 years of progressive experience in compensation and benefits management.</li><li>Proven track record of developing and implementing compensation and benefits strategies in a complex organizational environment.</li><li>Management and team supervisory experience required. </li><li>Society of Human Resources Management (SHRM) Certification is a plus. </li><li>Experience in the nonprofit sector is a plus.</li><li>Strong background in policy development and regulatory compliance.</li><li>Demonstrated experience in managing vendor relationships and overseeing open enrollment processes.<br/><br/></li></ul><strong>PHYSICAL DEMANDS, ENVIRONMENTAL CONDITIONS, EQUIPMENT<br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Potential physical demands include but are not limited to: walking, climbing stairs, handling, finger/grasp/feel objects and equipment, reaching, communicating, being mobile, repetitive motions, visual activity, driving, and entering buildings. If an accommodation is needed, please inform the Human Resources Department.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/></strong>LAFH is committed and proud to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex, sexual orientation, national or ethnic origin, age, disability or status as a veteran.<br/><br/><strong>FAIR CHANCE ACT<br/><br/></strong>LA Family Housing will consider qualified applicants with a criminal history pursuant to the California Fair Chance Act. You do not need to disclose your criminal history or participate in a background check until a conditional job offer is made to you. After making a conditional offer and running a background check, if LA Family Housing is concerned about conviction that is directly related to the job, you will be given the chance to explain the circumstances surrounding the conviction, provide mitigating evidence, or challenge the accuracy of the background report. Find out more about the Fair Chance Act by visiting the California Department of Fair Employment and Housing’s Fair Chance Act webpage.", "responsibilities": "The Total Rewards Director is responsible for developing and managing comprehensive compensation and benefits strategies aligned with organizational goals. Key responsibilities include creating and maintaining competitive pay structures, overseeing salary and benefits administration, ensuring compliance with relevant laws, and conducting regular market analysis. This role also involves designing incentive programs, leading the annual open enrollment process, managing vendor relationships, and providing employee support. Additionally, the position integrates total rewards strategies, develops and manages related policies, and ensures financial sustainability through budget oversight and cost analysis. Effective leadership, cross-functional collaboration, change management, and employee engagement are critical components of this role, along with the management of HR systems and regular reporting to executive leadership.", "qualifications": {"required": "Bachelor's degree in Human Resources, Business Management, Public Administration or related field. Years of experience may substitute for educational requirement. \nMinimum of 7-10 years of progressive experience in compensation and benefits management.\nProven track record of developing and implementing compensation and benefits strategies in a complex organizational environment.\nManagement and team supervisory experience required. ", "preferred": "Society of Human Resources Management (SHRM) Certification is a plus. \nExperience in the nonprofit sector is a plus.\nStrong background in policy development and regulatory compliance.\nDemonstrated experience in managing vendor relationships and overseeing open enrollment processes."}, "skills": ["Compensation and Benefits", "Regulatory Compliance", "Data Analysis", "Cost Analysis", "Budget Management", "Policy Development", "Project Management", "Process Management", "Leadership", "Collaboration", "HRIS", "UKG"], "postedDate": "1 day ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3995431743"}