{"jobTitle": "CEO", "company": {"name": "Shareland", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Business Development and Sales", "industry": "Real Estate", "description": "<strong>Job Overview<br/><br/></strong><strong>Seeking a Dynamic Leader</strong>: Shareland is on the lookout for a CEO who embodies visionary thinking, unwavering passion, and true grit. If you're fueled by the transformative potential of DeFi in reshaping finance, we invite you to join us on this groundbreaking journey.<br/><br/><strong>Company Overview:<br/><br/></strong>Shareland is revolutionizing residential real estate investing by democratizing access to real-time investments in cities and neighborhoods across the country. This groundbreaking DeFi platform, brought to life by the innovative collaboration between Share Ventures and distinguished real estate econometricians from Wharton School of Business, presents an exciting new way to engage with the real estate market.<br/><br/><strong>Position Overview:<br/><br/></strong>We're looking for a full-time CEO who brings a visionary perspective, a deep passion for DeFi, and a solid track record of leadership within recognized entities in TradFi, Digital Assets, or DeFi sectors. The CEO will be responsible for driving Shareland's strategic vision, overseeing day-to-day operations, and leading our team to achieve our mission of democratizing real estate. You will work closely with our investors to build an all-star team, GTM strategy, and roadmap for Shareland's growth.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Strategic Leadership: Develop and execute a strategy to help Shareland scale its user base. Lead the company in identifying growth opportunities and driving innovation within the DeFi/real estate investment space. </li><li>Growth: Identify customer profiles, markets, partnerships, and opportunities to build Shareland's presence and user adoption. </li><li>Team Leadership: Recruit and manage a high-performing startup team, fostering a culture of collaboration, innovation, and accountability. Provide leadership and mentorship to the team members. </li><li>Financial Management: Oversee the financial health of the company, including budgeting, fundraising, and financial planning. </li><li>Market Expansion: Drive expansion strategies, identifying new markets and ideal customers to onboard into Shareland's platform. </li><li>Regulatory Compliance: Stay informed about and ensure compliance with all relevant regulations and legal requirements in the real estate and fintech industries. </li><li>Customer Focus: Champion the needs and interests of Shareland's users. Continuously improve the platform's user experience and functionality in tandem with Product, Customer Experience, and UX. </li><li>Investor Relations: Maintain positive relationships with investors, stakeholders, and partners. Communicate effectively with the board of directors and external stakeholders. </li><li>Brand and Reputation: Build Shareland's reputation as a trusted and innovative leader in the DeFi/real estate investment industry. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Proven experience as a CEO or leadership role managing a P&amp;L at a TradFi, fintech, DeFi, or marketplace company. </li><li>Startup experience is a plus</li><li>Relevant industry knowledge and experience applicable to blockchain and decentralized finance</li><li>Excellent leadership and team-building skills, with a track record of leading diverse teams to success. </li><li>Financial acumen and experience managing budgets and financial strategy. </li><li>Knowledge of the real estate investment landscape and emerging trends. </li><li>Entrepreneurial mindset with a passion for democratizing access to real estate investments. </li><li>Bachelor's degree in a relevant field; MBA or other advanced degree preferred.</li></ul>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995213436"}