{"jobTitle": "Sales Coordinator", "company": {"name": "The LINE Hotels", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "Hospitality", "description": "<strong>About Our Company<br/><br/></strong>More than a group of hotels, The LINE is a creative community built around a sense of discovery — an exploration of a building, a neighborhood, and a culture. From Koreatown in LA to Adams Morgan in DC to downtown Austin, each property is architecturally interesting and chosen for its location in emerging neighborhoods in compelling cities. LINE hotels are both reflective and responsive— shaped by the communities they are part of while also contributing something new to those places. LINE properties are a collaboration of the best local and out-of-town talent in design, food and beverage, arts and culture.<br/><br/>In the heart of New York City, The Ned NoMad embodies timeless elegance and modern luxury within the historical Johnston building at the bustling intersection of 28th and Broadway. Expect experiences that transcend accommodation, becoming journeys through time and style. The building also houses Ned's Club NoMad New York, a private membership club with a global community of like-minded professionals seeking connection and inspiration in exclusive spaces. Coming soon is Ned's Club Washington DC, offering even more opportunities for meaningful connections and enriching experiences.<br/><br/>That colorful hotel in the desert, The Saguaro is a good time. It’s not that complicated. There’s plenty of sunshine, a buzzing pool scene and lots of local flavor.<br/><br/>We are seeking a dynamic Sales Office Administrative Assistant. A successful candidate will have a genuine passion for the hospitality industry and an entrepreneurial spirit.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Establish and maintain good communication and teamwork with fellow colleagues and other departments within the hotel</li><li>Collect and capture data for report and document preparation</li><li>Maintain current information in database sources</li><li>Lead distribution thru websites, emails, faxes or telephone</li><li>Answer all incoming calls and direct to appropriate sales manager</li><li>Maintain electronic file system</li><li>Responsible for checkbook accounting</li><li>Complete expense tracking and individual expense reports</li><li>Maintain office inventories, supplies and equipment</li><li>Preparation of sales kits – hard copy and electronically</li><li>Create forms, flyers, newsletters, coupons, etc.</li><li>Maintain the sales office schedule and ensure all coverage is in place at all times</li><li>Gather and submit all weekly reports</li><li>Assist sales managers with any needs; VIP amenities, gift certificates, check request, proposals, contracts, faxes, direct mail pieces.</li><li>Assist sales managers with lead entry, turndown entry and documentation, history requests.</li><li>Assist the restaurant with internal marketing needs</li><li>Process monthly TA Commissions and Rebates as part of month end and forecasting</li><li>Collect data on definite bookings for reporting</li><li>Participate in scheduled departmental and administrative meetings as requested<br/><br/><br/></li></ul><strong>Compensation &amp; Benefits<br/><br/></strong>We offer competitive wages and benefits while fostering a diverse and inclusive work experience.<br/><br/>We thrive in being a diverse work environment. Consideration for employment will be based upon personal capabilities and qualifications without discrimination based on race, color, religion, sex, gender identity, age, national origin, disability, sexual orientation, or any other protected characteristic as established by law.<br/><br/><strong>About Our Brand<br/><br/></strong>More than a group of hotels, The LINE is a creative community built around a sense of discovery — an exploration of a building, a neighborhood, and a culture. From Koreatown in LA to Adams Morgan in DC to downtown Austin, each property is architecturally interesting and chosen for its location in emerging neighborhoods in compelling cities. LINE hotels are both reflective and responsive— shaped by the communities they are part of while also contributing something new to those places. LINE properties are a collaboration of the best local and out-of-town talent in design, food and beverage, arts and culture.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995903277"}