{"jobTitle": "Lead Designer", "company": {"name": "Book of the Month", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Advertising", "industry": "Technology, Information and Media, Retail Books and Printed News, and Entertainment Providers", "description": "<strong>Summary: </strong><p>Book of the Month is seeking a Lead Designer to conceptualize, design and produce effective creative deliverables. You will work alongside a talented team of creatives from brief through execution. A successful candidate will have a high impact on executing brand identity, is highly iterative and adaptable, and is as fluent in storytelling through animation and motion graphics.</p><p><br/></p><p><strong>What You'll Do:</strong></p><ul><li>Conceptualize, design and make creative assets to produce excellent and high-performing creative. </li><li>Collaborate with creatives and marketers to ideate and brainstorm impactful social, digital, and traditional content that reflects BOTM’s brand aesthetic and goals. </li><li>Produce high quality content that adheres to our brand’s style guidelines and maintains graphic consistency across all channels, such as our mobile app, web, email, organic and paid social media and print. </li><li>Manage multiple projects with tight deadlines, while gathering learnings and insights from previous work to make relevant recommendations moving forward.</li></ul><p><br/></p><p><strong>About You:</strong></p><ul><li>4+ years of experience in design and creative execution at a consumer-facing brand (preferably DTC) and/or agency.</li><li>Strong skill-set in conceptualizing, brainstorming, illustration, design, animation, and collaboration to create compelling, brand aligned creative.</li><li>Experience designing for consumer facing brands across a range of platforms.</li><li>The ability to effectively collaborate with various teams, providing guidance in your subject matter expertise and a willingness to incorporate industry best practices.</li><li>Proficient in Adobe Creative Suite, After Effects, Figma, and relevant creative tools.</li><li>The ability to understand, absorb and execute on direction and creative feedback or criticism.</li><li>An aptitude for time management, organization, collaboration and direct communication.</li></ul><p><br/></p><p><br/></p><p><br/></p><p>Salary Range: $90,000 - $130,000</p>", "postedDate": "2 weeks ago", "skills": ["Design", "Creative", "Animation", "Adobe Creative Suite", "After Effects", "Figma", "Collaboration", "Communication", "Time Management", "Organization"], "url": "https://www.linkedin.com/jobs/view/3995273324"}