{"jobTitle": "Retail Associate", "company": {"name": "Pressed Juicery", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Food & Beverages", "description": "<strong>About Pressed<br/><br/></strong>Pressed is the leading cold-pressed juice and plant-based treats brand dedicated to making plant-forward living as convenient and delicious as possible. The company's mission is to pave the way for plant-forward living by making real healthy food accessible to everyone. To that end, Pressed operates over 100+ retail stores in eight states, is available in nearly 3,000 locations through its wholesale partners and can be purchased directly from their website to any location within the U.S. For a complete list of locations where Pressed is available, please visit www.pressed.com and follow Pressed on Facebook &amp; @pressedjuicery on Instagram &amp; Twitter.<br/><br/><strong>Job Purpose<br/><br/></strong>Are you passionate about health &amp; wellness? Do you thrive on sharing that passion with those around you? Pressed Retail Associates are subject matter experts, who love to influence others, and make an impact on their daily lives through health &amp; nutrition. Our teams are eager to learn about our customers’ lifestyles, match their needs with the benefits of our products, and guide customers to reach their goals. They are relationship builders, entrepreneurial, product experts, have a keen ability to lead &amp; influence others, and are outstanding sellers. They are self-starters, take initiative to learn about the newest trends in the health &amp; wellness to better serve their audience. They embrace &amp; lead through change. They are inspired by growth. They possess a relentless commitment to excellence and achieving results.<br/><br/>Key Responsibilities<br/><br/><ul><li> Drive company sales growth and profitability through customer-centric selling, teamwork, superior product knowledge, and impeccable customer experience. </li><li> Achieve established sales goals. </li><li> Ability to give and positively receive feedback. </li><li> Freeze stores: cutting, preparing, and serving product. Clean equipment and following proper food handling procedures. </li><li> Heat stores: preparing hot beverages, following proper food handling procedures, and cleaning equipment. </li><li> Ask open-ended questions to learn about your customer's lifestyle and wellness goals; identify the right products to help them achieve those goals and match their needs with the features &amp; benefits of our products. </li><li> Enroll all customers in our Membership Program. </li><li> Active &amp; engaged product sampling throughout all daily parts. </li><li> Maintain sales floor coverage and follow posted schedules. </li><li> Share customer feedback with a store manager regarding product requests, concerns, and suggestions. </li><li> Promote a strong sense of teamwork by working together collaboratively to achieve goals. </li><li> Maintain store appearance and cleanliness standards. </li><li> Utilize the Point of Sale and other computer systems to operate the store at maximum efficiency. </li><li> Other job-related duties as requested. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Passion, knowledge, interest in health, fitness and/or wellness. </li><li> Ability to build customer relationships and deliver exceptional service. </li><li> Possess a relentless commitment to achieving results. </li><li> Ability to quickly learn new procedures, processes, and product knowledge. </li><li> Proven success in achieving goals through customer-centric selling. </li><li> Excellent team player with the ability to work independently. </li><li> Strong verbal &amp; written communication skills with proficiency in English. </li><li> Basic understanding of sales principles and customer service practices. </li><li> Previous retail, restaurant, or hospitality experience preferred, but not required. </li><li> Previous cash-handling and POS experience preferred, but not required. </li><li> Must have a valid Food Handler Card or applicable state required certification at time of hire. <br/><br/></li></ul>COVID-19 Vaccination Policy:<br/><br/>Where permitted by applicable law, all candidates must have received the COVID-19 vaccination by the date of hire to be considered for employment with Pressed. Proof of vaccination will be required during the time of hire.<br/><br/>Apply Now", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995417103"}