{"jobTitle": "10663 – Sr. Business Process Analyst", "company": {"name": "Hyundai AutoEver America", "location": "Fountain Valley, CA"}, "location": "Fountain Valley, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "98,060 to $151,008", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "<strong>10663 - Sr. Business Process Analyst <br/><br/></strong><strong>Purpose:<br/><br/></strong>The Sr. Business Process Analyst is responsible for facilitating business process improvement through analysis, review, and documentation of functional business specifications. This role will involve a range of tasks, including developing business action plans, budgeting, tracking project milestones, and providing executive reporting.<br/><br/><strong>Essential Functions:<br/><br/></strong><ul><li>Develop and implement business action plans for the Shared Services team, forecasting operational support needs to keep pace with business demands. </li><li>Oversee infrastructure hardware and software lifecycle budgets management to mitigate technology debt risks. </li><li>Manage OpEx and CapEx budgets, including expenditures, renewals, services, leases, etc. </li><li>Report and publish KPIs, Service Level Agreements (SLAs), and Objectives and Key Results (OKRs) at regular intervals. </li><li>Prepare and review internal/external statements of work (SOWs) for the procurement of goods and services. </li><li>Initiate, track, and facilitate project milestones to ensure project progress and completion. </li><li>Prepare executive summaries and weekly performance reports to support decision-making for Executive Management. </li><li>Develop and maintain organizational charts and process flows using tools like MS PowerPoint for clear visualization. </li><li>Provide direct supervision to a unit or group of employees, assigning tasks, monitoring work progress, and maintaining schedules. </li><li>Coordinate with onshore/offshore SMEs and managed service providers for optimal team composition. </li><li>Handle complex issues requiring in-depth evaluation of multiple factors. <br/><br/></li></ul><strong>Basic Requirements:<br/><br/></strong><ul><li>Bachelor’s degree or equivalent combination of education and experience in the field of business, finance, or economics (8+years). </li><li>Proven experience in business analysis and process optimization. </li><li>Strong analytical and problem-solving skills. </li><li>Proficiency in Microsoft Office Suite, especially PowerPoint and Excel. </li><li>Excellent communication and presentation skills. </li><li>Ability to work collaboratively with cross-functional teams. </li><li>Strong project management skills. <br/><br/></li></ul>Salary range - $98,060 to $151,008", "postedDate": "2 weeks ago", "skills": ["PowerPoint", "Excel", "Business Analysis", "Project Management", "Communication"], "url": "https://www.linkedin.com/jobs/view/3995443569"}