{"jobTitle": "Private Partnership Solutions (PPS) - Tax Senior Associate", "company": {"name": "PwC", "industry": "Accounting, Financial Services, and Business Consulting and Services", "size": "Not Applicable", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$83,000 - $208,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Accounting, Financial Services, and Business Consulting and Services", "description": "A career within PwC Private will provide the opportunity to help private companies with a range of business advisory needs such as audit, tax compliance, and planning to help improve their operational efficiency and to free up time that can be spent focusing on business strategy. You’ll have the opportunity to experience the entire business life cycle of a private company from inception to growth, maturity and transition. Our team helps our clients design and implement personal and customised service plans that are unique to privately owned entities, entrepreneurs, and high net worth individuals. You’ll be assisting the team focus on key issues like wealth management, compliance, cash flow management, equity expansion, divestiture and exit strategies. Our PwC Private teams help entrepreneurs, private business owners and family enterprises manage their ownership and growth at every stage, in a way that fits the needs of their business in today's changing global landscape.", "responsibilities": "As a Senior Associate, you'll work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution. PwC Professional skills and responsibilities for this management level include but are not limited to: Use feedback and reflection to develop self awareness, personal strengths and address development areas. Delegate to others to provide stretch opportunities, coaching them to deliver results. Demonstrate critical thinking and the ability to bring order to unstructured problems. Use a broad range of tools and techniques to extract insights from current industry or sector trends. Review your work and that of others for quality, accuracy and relevance. Know how and when to use tools available for a given situation and can explain the reasons for this choice. Seek and embrace opportunities which give exposure to different situations, environments and perspectives. Use straightforward communication, in a structured way, when influencing and connecting with others. Able to read situations and modify behavior to build quality relationships. Uphold the firm's code of ethics and business conduct.", "qualifications": {"required": "Bachelor Degree in Accounting, 2 years of experience, Must be committed to obtain certification before being promoted to Manager (CPA, Enrolled Agent, or Member of the Bar).", "preferred": "CPA or Member of the Bar, Demonstrates thorough knowledge of tax-related intricacies of partnership structures and related transactions."}, "skills": ["Accounting", "Tax Compliance", "Business Advisory", "Wealth Management", "Cash Flow Management", "Equity Expansion", "Divestiture", "Exit Strategies"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "PwC offers a wide range of benefits, including medical, dental, vision, 401k, holiday pay, vacation and more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995822361"}