{"jobTitle": "Project Manager", "company": {"name": "HCT by kdc/one", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Project Management", "industry": "Cosmetics", "description": "<strong>Location: </strong>Santa Monica, CA (Hybrid: 3 days in the office, 2 days remote. Must be Local!!)<p><br/></p><p><strong>Position Overview:</strong></p><p>As a Project Manager at HCT, you will be a key liaison between our customers, factories, and internal cross-functional teams. Your role will involve managing customer relationships, overseeing projects, and ensuring the successful execution of packaging and product development. This is a chance to contribute to the vibrant cosmetic packaging industry while collaborating with a diverse and skilled team.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Cultivate strong customer relationships and act as a primary point of contact for clients throughout the project lifecycle.</li><li>Collaborate with sales staff, clients, and internal teams to define project scopes, objectives, and technical feasibility.</li><li>Utilize your knowledge of packaging development practices to tailor solutions that best suit client requirements.</li><li>Negotiate with existing suppliers, considering factors such as capability, costing, and quality assurance.</li><li>Develop packaging standards and defect ranges, ensuring flawless production execution.</li><li>Manage administrative tasks, including issuing program quotations, creating timelines, maintaining customer files, and processing Purchase Orders.</li><li>Establish pricing agreements with customers and accurately quote transit costs.</li><li>Employ problem-solving skills to address customer inquiries and resolve quality issues.</li><li>Effectively manage changes in project scope, schedule, and costs using appropriate verification techniques.</li><li>Independently hold meetings with customers and salespeople, as well as collaborative sessions with designers and engineers.</li><li>Oversee end-to-end turnkey projects, from packaging development to formula execution and product delivery.</li><li>Enforce project timelines for formula and packaging development, ensuring client adherence.</li><li>Provide insightful commentary and feedback on product and packaging submissions to guide clients toward optimal outcomes.</li><li>Review development samples, QA pieces, and production samples for quality control.</li><li>Adapt to a fast-paced environment and excel under evolving conditions.</li><li>Contribute to a collaborative team environment with excellent communication skills.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Minimum of 3 years of experience in a Project Management role.</li><li>Bachelor's Degree preferred.</li><li>Strong organizational skills to manage multiple projects simultaneously, ranging from 5 to 10 main projects to auxiliary projects exceeding 20 to 30.</li><li>A friendly and communicative personality that thrives in team interactions and customer interactions.</li><li>Proficiency in Outlook, Excel, and Word is essential.</li><li>Adaptability to succeed in a dynamic, fast-paced setting.</li><li>Knowledge of cosmetics/skincare is advantageous but not mandatory.</li><li>Knowledge of plastics manufacturing is beneficial but not required.</li><li>Ability to take direction, critically evaluate solutions, and make informed decisions.</li><li>Exceptional verbal and written communication skills are crucial.</li></ul><p><br/></p><p><strong>Benefits:</strong></p><ul><li>Competitive pay and benefits package.</li><li>Opportunity to excel in a hybrid work environment (3 days in the office, 2 days remote).</li><li>Contribute to impactful projects within the dynamic cosmetics packaging industry.</li><li>Collaborate with a skilled team in an innovative setting.</li><li>Professional growth and development prospects.</li></ul><p><br/></p><p>If you are an experienced Project Manager with a passion for collaborative success in the cosmetic packaging sector, we encourage you to apply. Join HCT and help shape the future of cosmetic packaging solutions through effective project management.</p>", "responsibilities": "Cultivate strong customer relationships and act as a primary point of contact for clients throughout the project lifecycle. Collaborate with sales staff, clients, and internal teams to define project scopes, objectives, and technical feasibility. Utilize your knowledge of packaging development practices to tailor solutions that best suit client requirements. Negotiate with existing suppliers, considering factors such as capability, costing, and quality assurance. Develop packaging standards and defect ranges, ensuring flawless production execution. Manage administrative tasks, including issuing program quotations, creating timelines, maintaining customer files, and processing Purchase Orders. Establish pricing agreements with customers and accurately quote transit costs. Employ problem-solving skills to address customer inquiries and resolve quality issues. Effectively manage changes in project scope, schedule, and costs using appropriate verification techniques. Independently hold meetings with customers and salespeople, as well as collaborative sessions with designers and engineers. Oversee end-to-end turnkey projects, from packaging development to formula execution and product delivery. Enforce project timelines for formula and packaging development, ensuring client adherence. Provide insightful commentary and feedback on product and packaging submissions to guide clients toward optimal outcomes. Review development samples, QA pieces, and production samples for quality control. Adapt to a fast-paced environment and excel under evolving conditions. Contribute to a collaborative team environment with excellent communication skills.", "qualifications": {"required": "Minimum of 3 years of experience in a Project Management role. Strong organizational skills to manage multiple projects simultaneously, ranging from 5 to 10 main projects to auxiliary projects exceeding 20 to 30. A friendly and communicative personality that thrives in team interactions and customer interactions. Proficiency in Outlook, Excel, and Word is essential. Adaptability to succeed in a dynamic, fast-paced setting. Ability to take direction, critically evaluate solutions, and make informed decisions. Exceptional verbal and written communication skills are crucial.", "preferred": "Bachelor's Degree"}, "skills": ["Outlook", "Excel", "Word", "Project Management", "Customer Relationship Management", "Packaging Development", "Quality Assurance", "Negotiation", "Problem Solving", "Communication"], "postedDate": "2 weeks ago", "benefits": "Competitive pay and benefits package. Opportunity to excel in a hybrid work environment (3 days in the office, 2 days remote). Contribute to impactful projects within the dynamic cosmetics packaging industry. Collaborate with a skilled team in an innovative setting. Professional growth and development prospects.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995244548"}