{"jobTitle": "Project Manager II", "company": {"name": "Hill International, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $117,000.00/yr", "currency": "USD"}, "jobFunction": "Project Management and Information Technology", "industry": "Civil Engineering, Construction, and Business Consulting and Services", "description": "<strong>Job Description<br/><br/></strong><strong>Hill International is seeking a Project Manager II in Catalina Island, California<br/><br/></strong><strong>Responsibilities<br/><br/></strong><ul><li>Manage activities for 1-2 projects with responsibility for results in terms of scope, costs, and schedule.</li><li>Direct involvement in tasks necessary for successful project execution. </li><li>Identifies problems and solutions. </li><li>Collaborates to establish project objectives, timelines, risk analysis, milestones, deliverables and budgets.</li><li>Resolves issues and ensures task completion by establishing priorities and resolving conflicts with team members and functional managers.</li><li>Understands Project Management core concepts; interested in learning SCE processes.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in applicable profession, business, or technical discipline or an equivalent combination of education, training, and experience.</li><li>Seven or more years of project management experience.</li><li>Hybrid work schedule; on Catalina Island or Rosemead office 2 times a week.</li><li>Skilled in Microsoft Office Suite, especially PowerPoint, Excel, Teams, and Microsoft Projects.</li><li>Knowledgeable of Primavera P6 and SAP.</li><li>Utility experience preferred.</li><li>Construction management experience preferred.</li><li>Environmental and Permitting experience preferred.<br/><br/></li></ul>The salary range for this position is $100,000-$117,000. The offered salary will be based on the applicants qualifications, education, experience and work location.<br/><br/>Depending upon your employment status, Hill’s comprehensive benefits may include, Medical, Dental, Vision, Employer Paid Life and Accidental Death &amp; Dismemberment Insurances, Business Travel Accident Insurance, Short-Term Disability, Long Term Disability, Flexible Spending Account, Health Savings Account, Dependent Care Flexible Spending Account, Commuter Benefits, Legal Assistance, Identity Theft Protection, Pet Insurance, Auto &amp; Home Insurance, Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Voluntary Life &amp; Accidental Death &amp; Dismemberment Insurance. Paid Time Off (PTO), Holidays, 401(K) Retirement Savings Plan, Employee Referral Program, Professional Certification Incentive Program, Hill University Learning and Development, Tuition Reimbursement, EAP, Years of Service Awards Program.<br/><br/><strong>About Us<br/><br/></strong>Hill International, with more than 3,200 professionals in over 100 offices worldwide, provides program management, project management, construction management, project management oversight, dispute resolution, advisory, facilities management, and other consulting services to clients in a variety of market sectors. <em>Engineering News-Record</em> magazine recently ranked Hill as one of the largest construction management firms in the United States. For more information on Hill, please visit our website at www.hillintl.com .<br/><br/>Hill is exclusively a program, project, and construction management provider, meaning we have one focus as a company: protecting client interests. Free of any potential conflicts, our entire business is geared towards helping clients achieve their desired outcomes. We are dedicated to exceeding expectations throughout the entire construction project lifecycle and adapt to the needs of each assignment to develop tailored approaches and solutions to meet those needs.<br/><br/>Hill is a proud member of the Global Infrastructure Solutions, Inc. family of companies. Learn more about GISI at www.gisi.com .<br/><br/><strong>Hill International is an Equal Opportunity Employer/Minority/Female/Veteran/Disabled<br/><br/></strong>Note: <em>This job description is intended to provide an indication of the nature and levels of work, knowledge, skills, abilities and other essential functions to be carried out as part of fulfilling the role mentioned in the job title. Various other duties as required.</em>", "responsibilities": "<ul><li>Manage activities for 1-2 projects with responsibility for results in terms of scope, costs, and schedule.</li><li>Direct involvement in tasks necessary for successful project execution. </li><li>Identifies problems and solutions. </li><li>Collaborates to establish project objectives, timelines, risk analysis, milestones, deliverables and budgets.</li><li>Resolves issues and ensures task completion by establishing priorities and resolving conflicts with team members and functional managers.</li><li>Understands Project Management core concepts; interested in learning SCE processes.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor’s degree in applicable profession, business, or technical discipline or an equivalent combination of education, training, and experience.\nSeven or more years of project management experience.\nHybrid work schedule; on Catalina Island or Rosemead office 2 times a week.\nSkilled in Microsoft Office Suite, especially PowerPoint, Excel, Teams, and Microsoft Projects.\nKnowledgeable of Primavera P6 and SAP.", "preferred": "Utility experience preferred.\nConstruction management experience preferred.\nEnvironmental and Permitting experience preferred.<br/><br/>"}, "skills": ["PowerPoint", "Excel", "Teams", "Microsoft Projects", "Primavera P6", "SAP"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision, Employer Paid Life and Accidental Death &amp; Dismemberment Insurances, Business Travel Accident Insurance, Short-Term Disability, Long Term Disability, Flexible Spending Account, Health Savings Account, Dependent Care Flexible Spending Account, Commuter Benefits, Legal Assistance, Identity Theft Protection, Pet Insurance, Auto &amp; Home Insurance, Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Voluntary Life &amp; Accidental Death &amp; Dismemberment Insurance. Paid Time Off (PTO), Holidays, 401(K) Retirement Savings Plan, Employee Referral Program, Professional Certification Incentive Program, Hill University Learning and Development, Tuition Reimbursement, EAP, Years of Service Awards Program.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995404119"}