{"jobTitle": "Production Assistant/Runner", "company": {"name": "NBCUniversal", "location": "Universal City, CA"}, "location": "Universal City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Production", "industry": "Broadcast Media Production and Distribution, Entertainment Providers, and Media Production", "description": "We create world-class content, which we distribute across our portfolio of film, television, and streaming, and bring to life through our theme parks and consumer experiences. We own and operate leading entertainment and news brands, including NBC, NBC News, MSNBC, CNBC, NBC Sports, Telemundo, NBC Local Stations, Bravo, USA Network, and Peacock, our premium ad-supported streaming service. We produce and distribute premier filmed entertainment and programming through Universal Filmed Entertainment Group and Universal Studio Group, and have world-renowned theme parks and attractions through Universal Destinations & Experiences. NBCUniversal is a subsidiary of Comcast Corporation.<br/><br/>Here you can be your authentic self. As a company uniquely positioned to educate, entertain and empower through our platforms, Comcast NBCUniversal stands for including everyone. Our Diversity, Equity and Inclusion initiatives, coupled with our Corporate Social Responsibility work, is informed by our employees, audiences, park guests and the communities in which we live. We strive to foster a diverse, equitable and inclusive culture where our employees feel supported, embraced and heard. Together, we’ll continue to create and deliver content that reflects the current and ever-changing face of the world.<br/><br/>The Production Assistant for Terrace Studios is responsible for supporting all departments of the show as assigned.<br/><br/>This position requires the ability to work collaboratively within a small team to ensure all needs and production tasks are executed flawlessly within strict deadlines. This position will report to the Production Manager.<br/><br/>Essential Responsibilities:<br/><br/><ul><li>Sort and Distribute mail, magazines, Fed-Ex and packages to all show employees</li><li>Make off-lot and on-lot runs to pick up various items for the show. (i.e. camera cards, food, magazines, props, accounting runs, wardrobe runs, etc.</li><li>Maintain the upkeep and stock the kitchen.</li><li>Maintain the upkeep and stock of the copy room, printers, and faxes throughout the office.</li><li>Assist Producers and ENG crews on shoots.</li><li>Escort live show guests onto secured stage.</li><li>Other various duties as assigned by Supervisor.<br/><br/></li></ul>Basic Requirements<br/><br/><ul><li>Minimum 1 year of experience working with Microsoft Suite (Word, Excel, Outlook, etc).</li><li>Minimum 1 year of experience in Television Production.<br/><br/></li></ul>Desired Characteristics<br/><br/><ul><li>College degree preferred.</li><li>Strong organizational skills, with great attention to detail.</li><li>Ability to deliver high-quality accurate work, quickly and under strict deadlines.</li><li>Strong communication skills and ability to build relationships.<br/><br/></li></ul>Additional Requirements<br/><br/><ul><li>Willingness to work overtime, and on weekends with short notice.</li><li>Must be willing to work in Universal City, California.</li><li>Must have authorization to work in the United States.</li><li>Must be covered by Solutions, NBCU’s Alternative Dispute Resolution Program.<br/><br/></li></ul>Required On-Site:  This position is required to be performed full-time from an NBCUniversal-designated worksite.<br/><br/>This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $20-$25/hour<br/><br/>NBCUniversal's policy is to provide equal employment opportunities to all applicants<br/><br/>and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation,<br/><br/>marital status, pregnancy, veteran status, membership in the uniformed services,<br/><br/>genetic information, or any other basis protected by applicable law.<br/><br/>NBCUniversal will consider for employment qualified applicants with criminal histories,<br/><br/>or arrest or conviction records, in a manner consistent with relevant legal<br/><br/>requirements, including the City of Los Angeles' Fair Chance Initiative For Hiring<br/><br/>Ordinance, the Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act, where applicable.<br/><br/>If you are a qualified individual with a disability or a disabled veteran, you have the<br/><br/>right to request a reasonable accommodation if you are unable or limited in your<br/><br/>ability to use or access nbcunicareers.com as a result of your disability. You can<br/><br/>request reasonable accommodations by emailing AccessibilitySupport@nbcuni.com.", "responsibilities": "The Production Assistant for Terrace Studios is responsible for supporting all departments of the show as assigned.<br/><br/>This position requires the ability to work collaboratively within a small team to ensure all needs and production tasks are executed flawlessly within strict deadlines. This position will report to the Production Manager.<br/><br/>Essential Responsibilities:<br/><br/><ul><li>Sort and Distribute mail, magazines, Fed-Ex and packages to all show employees</li><li>Make off-lot and on-lot runs to pick up various items for the show. (i.e. camera cards, food, magazines, props, accounting runs, wardrobe runs, etc.</li><li>Maintain the upkeep and stock the kitchen.</li><li>Maintain the upkeep and stock of the copy room, printers, and faxes throughout the office.</li><li>Assist Producers and ENG crews on shoots.</li><li>Escort live show guests onto secured stage.</li><li>Other various duties as assigned by Supervisor.<br/><br/></li></ul>", "qualifications": {"required": "Minimum 1 year of experience working with Microsoft Suite (Word, Excel, Outlook, etc).\nMinimum 1 year of experience in Television Production.", "preferred": "College degree preferred.\nStrong organizational skills, with great attention to detail.\nAbility to deliver high-quality accurate work, quickly and under strict deadlines.\nStrong communication skills and ability to build relationships."}, "skills": ["Microsoft Suite", "Television Production"], "postedDate": "2 weeks ago", "benefits": "This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website.", "salary": {"amount": "20-25", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995310714"}