{"jobTitle": "Payroll Assistant", "company": {"name": "KB Home", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "18-21/hour", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Real Estate", "description": "About KB Home<br/><br/>KB Home is one of the largest and most recognized homebuilders in the United States and has built over 650,000 quality homes in our more than 60-year history. Today, KB Home operates in 45 markets from coast to coast. What sets KB Home apart is the exceptional personalization we offer our homebuyers from those buying their first home to experienced buyers allowing them to make their home uniquely their own, at a price that fits their budget. As the leader in energy-efficient homebuilding, KB Home was the first builder to make every home it builds ENERGY STARï¿½ certified, a standard of energy performance achieved by fewer than 10% of new homes in America, and has built more ENERGY STAR certified homes than any other builder. An energy-efficient KB home helps lower the cost of ownership and is designed to be healthier, more comfortable and better for the environment than new homes without certification. We build strong, personal relationships with our customers so they have a real partner in the homebuying process. As a result, we have the distinction of being the #1 customer-ranked national homebuilder in third-party buyer satisfaction surveys. Build your career with KB Home. Learn more.<br/><br/>JOB SUMMARY:  The Payroll Assistant will coordinate the filing, storage, and organizational efforts of the department will help in data entry, as required.<br/><br/>Essential Duties And Responsibilities<br/><br/>Filing<br/><br/><ul><li>File and retrieve current and past employee records.</li><li>File and organize department’s backlog of personnel records.</li><li>Organize and label records and schedule pickup for offsite storage with Company’s storage vendor.</li><li>Pull personnel files for Legal department, as requested.</li><li>File miscellaneous employee documents in the appropriate personnel file.</li><li>Maintain reliable and consistent filing method for the department’s ease of use.<br/><br/></li></ul>Data Entry<br/><br/><ul><li>Enter employee information into HRIS system including new hire data, as needed.</li><li>Ad hoc data entry, as needed.<br/><br/></li></ul>Education/Experience/Minimum Requirements<br/><br/>Education/Certifications/Licenses <br/><br/><ul><li>High School Diploma or equivalent is required.<br/><br/></li></ul>Experience<br/><br/><ul><li>Prior experience in an office setting<br/><br/></li></ul>Knowledge, Skills &amp; Abilities<br/><br/><ul><li>Exceptional attention to detail and accuracy</li><li>Highly organized and strong project and time management skills</li><li>Ability to take direction and prioritize and complete work in a timely manner</li><li>Tech/computer savviness and desire and abliity to learn new systems<br/><br/></li></ul>Work Requirements<br/><br/><ul><li>Conduct business in a professional and ethical manner to potential buyers, trade partners, and coworkers to reinforce goodwill and profitability for the company</li><li>Position will be onsite in Westwood, Los Angeles 3-4 days per week and for 8-hour shifts (with potential flexibility noted below); Part-time employee 24-32 hours per week; Currently the assignment will be 4-6 months with a possibility for extension beyond that based on the Company’s needs. </li><li>There is flexibility for the timing of the shifts within the hours of 8:00am-6:00pm depending on if the candidate is a student with a class schedule to work around<br/><br/></li></ul>Compensation<br/><br/><ul><li>$18-21/hour<br/><br/></li></ul>Find out why KB Home is attracting and retaining the best employees! If you are interested and qualified, please apply now. KB Home provides above average compensation packages and earnings potential, full benefits, an outstanding 401K matching program, bonus plans and amazing promotional opportunities. KB Home is an equal opportunity employer committed to hiring a diverse work team. Diversity is important to KB Home!<br/><br/>KB Home and its affiliates do not accept unsolicited resumes from individual recruiters or third party recruiting agencies (collectively, “Recruiters”) in response to job postings. If Recruiters nevertheless submit one or more unsolicited resumes to any employee at KB Home or its affiliates without a valid written agreement in place for recruiting services, such resumes will be deemed the sole property of KB Home and its affiliates. No fee will be owing or paid to Recruiters who submit unsolicited candidate resumes, in the event any such candidate is hired by KB Home or its affiliates as a result of the submittal, without a valid written agreement between the Recruiter and KB Home.", "responsibilities": "The Payroll Assistant will coordinate the filing, storage, and organizational efforts of the department will help in data entry, as required.", "qualifications": {"required": "High School Diploma or equivalent is required.", "preferred": "Prior experience in an office setting"}, "skills": ["Filing", "Data Entry", "HRIS", "Organization", "Time Management", "Computer Skills"], "postedDate": "2 weeks ago", "benefits": "KB Home provides above average compensation packages and earnings potential, full benefits, an outstanding 401K matching program, bonus plans and amazing promotional opportunities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995266485"}