{"jobTitle": "Project Coordinator 2 (1056450)", "company": {"name": "The Judge Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "25.00 USD Hourly - 34.00 USD Hourly", "currency": "USD"}, "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "<strong>Location: </strong> CANOGA PARK, CA, USA<br/><br/><strong>Salary: </strong> $25.00 USD Hourly - $34.00 USD Hourly<br/><br/><strong>Description: </strong> Our client is currently seeking a Project Coordinator 2<br/><br/>Join our dynamic workplace design and architecture practice. We are seeking a proactive and resourceful Project Coordinator to support our Project Management Teams across various project types.<br/><br/><strong>This Job Will Have The Following Responsibilities<br/><br/></strong><ul><li>Lead initial project setup for diverse project types and sizes.</li><li>Provide ongoing financial, operational, and administrative support for 20+ projects monthly, valued at approximately $250-300K in revenue.</li><li>Develop trust with internal teams and clients through attention to detail, proactive problem-solving, and sound judgment.<br/><br/></li></ul><strong>Key Duties<br/><br/></strong><ul><li>Support proposal development.</li><li>Set up projects in internal management systems for finance and operations.</li><li>Manage client and vendor setup.</li><li>Issue purchase orders and contract agreements.</li><li>Organize project teams using shared online folders.</li><li>Complete project charters at kickoff.</li><li>Track actual and forecasted monthly revenue.</li><li>Assist with monthly invoicing.</li><li>Monitor monthly utilization and realization reporting.</li><li>Ensure smooth information flow for all project phases.</li><li>Manage multiple projects simultaneously.</li><li>Develop project authorization forms, proposals, and contract amendments.</li><li>Identify efficiencies and establish best practices.</li><li>Troubleshoot and resolve issues proactively.</li><li>Review draft deliverables for quality and accuracy.</li><li>Utilize project management software for data input and reporting.</li><li>Attend client meetings, take notes, and follow up on action items.</li><li>Contribute to case studies and thought leadership.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Experience in business, finance, or operations.</li><li>Excellent communication skills.</li><li>Driven, proactive, and resourceful.<br/><br/></li></ul><strong>Contact:</strong> valonzo@judge.com<br/><br/><em>This job and many more are available through The Judge Group. Find us on the web at www.judge.com</em>", "responsibilities": "Lead initial project setup for diverse project types and sizes. Provide ongoing financial, operational, and administrative support for 20+ projects monthly, valued at approximately $250-300K in revenue. Develop trust with internal teams and clients through attention to detail, proactive problem-solving, and sound judgment. Support proposal development. Set up projects in internal management systems for finance and operations. Manage client and vendor setup. Issue purchase orders and contract agreements. Organize project teams using shared online folders. Complete project charters at kickoff. Track actual and forecasted monthly revenue. Assist with monthly invoicing. Monitor monthly utilization and realization reporting. Ensure smooth information flow for all project phases. Manage multiple projects simultaneously. Develop project authorization forms, proposals, and contract amendments. Identify efficiencies and establish best practices. Troubleshoot and resolve issues proactively. Review draft deliverables for quality and accuracy. Utilize project management software for data input and reporting. Attend client meetings, take notes, and follow up on action items. Contribute to case studies and thought leadership.", "qualifications": {"required": "Experience in business, finance, or operations. Excellent communication skills. Driven, proactive, and resourceful."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3995995423"}