{"jobTitle": "Junior Marketing Assistant", "company": {"name": "Moon Moments", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "Junior Marketing Assistant!<br/><br/>Full-time | Onsite position<br/><br/>(<strong><em>Only Candidates legally authorized to work in the US and can commute to the job location will be considered for this position)<br/><br/></em></strong>Pay: <strong>Weekly<br/><br/></strong>We are thrilled to present a fantastic opportunity with our client who is currently seeking junior Marketing Assistants to join their dynamic team, preferably for an immediate start.<br/><br/>This entry-level position provides comprehensive training, making it accessible to candidates with no prior experience. However, if you have previous experience in marketing, promotions, customer engagement, events, client relations, and customer satisfaction, we encourage you to apply.<br/><br/>Role &amp; Responsibilities:<br/><br/>As a Marketing Assistant, you will represent our brand and engage with potential customers to promote our products and services. Your responsibilities will include:<br/><br/><ul><li>Being the face of our client, interacting with potential customers to promote their brands' offerings</li><li>Building relationships with customers and understanding their specific needs</li><li>Conducting presentations and demonstrations, depending on the client's requirements</li><li>Developing a deep understanding of the brand's products, services, and competitor offerings</li><li>Addressing customer queries promptly and professionally</li><li>Completing new customer registrations</li><li>Tracking interactions and compiling daily reports to provide feedback to clients<br/><br/></li></ul>Benefits:<br/><br/>This opportunity offers a range of benefits to the Marketing Assistants, including:<br/><br/><ul><li>Competitive pay and regular performance bonuses</li><li>A dynamic, team-oriented work environment with a positive atmosphere</li><li>Frequent opportunities for personal and professional development</li><li>The potential to transition into other departments</li><li>A supportive and nurturing work environment that encourages you to achieve your professional goals</li><li>Travel opportunities, both nationally and internationally</li><li>A culture of recognition, ensuring your hard work is acknowledged<br/><br/></li></ul>How to Apply:<br/><br/>Please submit your resume through our online application process. We will contact successful candidates within one week to arrange a virtual interview.<br/><br/>Powered by JazzHR<br/><br/>hzu0hHTmAm", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995548386"}