{"jobTitle": "Financial Analyst", "company": {"name": "eTeam", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "30.00/hr - 33.00/hr", "currency": "USD"}, "jobFunction": "Accounting/Auditing, Administrative, and Analyst", "industry": "IT Services and IT Consulting", "description": "<strong>Title: Finance Assistant</strong>\n<p><strong>Duration: 06+ Months (With Possible extension)</strong></p>\n<p><strong>Location: Culver City, CA 90232 (Remote)</strong></p>\n<p><br/></p>\n<p><strong>Job Description</strong></p>\n<p><br/></p>\n<p>This position is supporting Client’s new original video subscription service, Client TV+, featuring original shows, movies and documentaries from the world’s most creative storytellers</p>\n<p><br/></p>\n<p><strong>Description</strong></p>\n<ul><li>Provide broad invoicing support to the financial management of the budgeting, reporting, forecasting, purchase orders and daily invoices across global Publicity, Studio Communications, Talent Relations, Awards and Events.</li><li>Manage timely billing, invoices, reporting and analyze actuals vs budgets cost reports to ensure accuracy and quickly resolve any issues.</li><li>Specialize setup of vendors and other external partners in collaboration with Procurement</li><li>Determine ideal line of spend across multiple options and</li><li>Other duties as assigned.</li></ul>\n<p><strong>Qualifications</strong></p>\n<ul><li><strong>2 years +</strong> experience in <strong>purchase order development</strong>, execution, and tracking, from invoice through payment</li><li>Proven track record of tracking and processing invoices, comparing commitments versus actuals, and general budgeting</li><li>Ability to determine resources, track costs and establish partnerships with across <strong>Client TV+, Client Original Films and Client Studios</strong></li><li>Proactive thinker who can prioritize and manage multiple projects and meet deadlines</li><li>Detail-oriented with strong organizational, collaboration, problem-solving and communication skills</li></ul>\n<p><br/></p>\n<p><strong>Education</strong></p>\n<ul><li>Bachelor's degree is required.</li></ul><p></p>", "responsibilities": "Provide broad invoicing support to the financial management of the budgeting, reporting, forecasting, purchase orders and daily invoices across global Publicity, Studio Communications, Talent Relations, Awards and Events. Manage timely billing, invoices, reporting and analyze actuals vs budgets cost reports to ensure accuracy and quickly resolve any issues. Specialize setup of vendors and other external partners in collaboration with Procurement. Determine ideal line of spend across multiple options and Other duties as assigned.", "qualifications": {"required": "2 years + experience in purchase order development, execution, and tracking, from invoice through payment, Proven track record of tracking and processing invoices, comparing commitments versus actuals, and general budgeting, Ability to determine resources, track costs and establish partnerships with across Client TV+, Client Original Films and Client Studios, Proactive thinker who can prioritize and manage multiple projects and meet deadlines, Detail-oriented with strong organizational, collaboration, problem-solving and communication skills", "preferred": "Bachelor's degree is required."}, "skills": ["purchase order development", "invoice processing", "budgeting", "Client TV+", "Client Original Films", "Client Studios"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995932129"}