{"jobTitle": "Buying Assistant", "company": {"name": "San Bernardino County", "location": "San Bernardino County, CA", "industry": "Government Administration"}, "location": "San Bernardino County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Government Administration", "description": "<strong>The Job<br/><br/></strong><strong>San Bernardino County </strong>is recruiting for <strong>Buying Assistants</strong> who provide technical and clerical support for Purchasing or a large department with specialized purchasing needs. Buying Assistants perform procurement related activities under the direction of a Purchasing Department lead relating to the procurement of goods, materials, supplies and equipment; carry out related processing, research and record keeping functions; perform related duties as required.<br/><br/><strong> Current vacancy exists at the Department of Public Works. </strong>The list established from this recruitment may be used to fill the current vacancies and any future vacancies as they occur throughout the county.<br/><br/>For more detailed information, refer to the Buying Assistant job description.<br/><br/><strong> CONDITIONS OF EMPLOYMENT<br/><br/></strong>Travel throughout the County may be required. A valid California Class C driver license is required at time of appointment. Employees in this class may be required to use personal vehicles and show proof of automobile liability insurance.<br/><br/><strong>Sponsorship:</strong> San Bernardino County is not able to consider candidates who will require visa sponsorship at the time of application or in the future.<br/><br/><strong>Minimum Requirements<br/><br/></strong><strong> REQUIRED: <br/><br/></strong><strong>Experience<br/><br/></strong>Two (2) years of (full-time equivalent) experience in procurement or supply chain activities, as it relates to Purchasing, that includes performing <strong>technical </strong>duties involving: solicitation templates, vendor support, supply/material orders, storage, shipments, and/or bids.<br/><br/><strong> SUBSTITUTION <br/><br/></strong>Twenty-four (24) semester (36 quarter) units in purchasing/supply management, business/public administration, finance, management, or a closely related field may substitute for one (1) year of the required experience.<br/><br/><strong> REQUIRED DOCUMENTATION (Must be attached): <br/><br/></strong><strong>SUBSTITUTION<br/><br/></strong>A copy of legible transcripts (unofficial are acceptable) must be submitted if utilizing substitution.<br/><br/>Required documentation <strong>MUST be attached to your application or submitted</strong> via fax to (909) 387-5819 Attn: Buying Assistant or email to employment@hr.sbcounty.gov Subject: Buying Assistant. Failure to provide the requested documents by the application deadline date may result in disqualification of the application.<br/><br/><strong> IMPORTANT NOTES: <br/><br/></strong><strong> General clerical office supply orders is not considered qualifying experience. <br/><br/></strong><strong>EDUCATION<br/><br/></strong>Qualifying degrees or coursework must be completed at a college or university accredited by any accrediting association recognized by the United States Department of Education. Degrees or coursework completed outside the U.S. must be accompanied with an evaluation report from a reputable credential evaluation service showing equivalency to degrees or coursework completed at a college or university accredited by any accrediting association recognized by the United States Department of Education. <strong><strong> (Must be attached if applicable.) </strong></strong> Click <strong><strong><strong> <strong> <strong>here</strong> </strong> </strong></strong></strong> for more information on evaluation services.<br/><br/><strong>Desired Qualifications<br/><br/></strong>The ideal candidate will have experience in a government/public agency and/or in a healthcare or hospital environment; knowledge of purchasing principles, procedures, and terminology; utilizing purchasing and/or spreadsheet software and SAP SRM. Possession of a Certified Public Purchasing Buyer (CPPB) or Certified Professional in Supply Management (CPSM) is highly desired.<br/><br/><strong>Selection Process<br/><br/></strong><strong>Examination Procedure</strong><strong>:<br/><br/></strong>There will be a <strong>competitive evaluation of qualifications</strong> based on a review of the Application and Supplemental Questionnaire; therefore, <strong>it is to your advantage to</strong> <strong>provide as much relevant and detailed work experience</strong> as possible, as <strong>resumes will not be reviewed </strong>in lieu of the application materials.<br/><br/><strong>Application Procedure: <br/><br/></strong>Please complete and submit the online employment application and supplemental questionnaire by <strong>5:00 pm, Friday, August 23, 2024</strong>.<br/><br/>To ensure timely and successful submission of your online application, please allow ample time to complete and submit your application as soon as possible. Applicants will be automatically logged-out if they have not submitted the application and all required materials prior to the posted deadline. Once your application has been successfully submitted, you will receive an onscreen confirmation and an email. We recommend that you save and/or print these for your records. Please note, if you do not receive an onscreen confirmation and an email acknowledging our receipt of your application, we have not received your application.<br/><br/>If you require <strong>technical assistance</strong>, please click HERE to review the Government Jobs online application guide or contact their Toll-Free Applicant Support line at (855) 524-5627. Please note that Human Resources is not responsible for any issues or delays caused by the internet connection, computer or browser used to submit the application.<br/><br/><strong>EEO/ADA: </strong>San Bernardino County is an Equal Employment Opportunity (EEO) and Americans with Disabilities Act (ADA) compliant employer, committed to providing equal employment opportunity to all employees and applicants.<br/><br/><strong> ADA Accommodation: </strong> If you have a disability and require accommodations in the testing process, submit the Special Testing Accommodations Request Form within one week of a recruitment filing deadline.<br/><br/><strong> Veterans’ Preference: </strong> Eligible veterans and their spouse or widow(er) <strong> who are not current County employees </strong> may be awarded additional Veterans’ Preference points. Click here for information and instructions to request Veteran's Preference points.<br/><br/><strong> For important information on employment processes and submitting job applications, see links below: <br/><br/></strong><strong> Guide to Completing a County Job Application <br/><br/></strong><strong>Applicant Information and the County Employment Process</strong>", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995826715"}