{"jobTitle": "Influencer Marketing Intern", "company": {"name": "Bloom Nutrition", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Internship", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Marketing", "industry": "Retail", "description": "<strong>Influencer Marketing Intern</strong><p>Bloom Nutrition</p><p>IG @Bloomsupps</p><p>TikTok @bloomnu</p><p>Bloomnu.com</p><p><br/></p><p>Bloom Nutrition, founded by renowned fitness influencer and successful entrepreneur Mari Llewellyn, is a rapidly expanding wellness brand dedicated to providing premium supplements, vitamins, and beauty essentials that promote women's health holistically. Our products feature a meticulously crafted blend of high-quality ingredients, ensuring both exceptional taste and nutritional value to fuel a vibrant lifestyle.</p><p><br/></p><p>At Bloom, we foster a tight-knit, creative, and high-performing team environment, where collaboration thrives. Our work environment is an inspiring space where you can thrive as a result. As a young company, there is a huge opportunity for career growth as Bloom continues to expand at a fast pace.</p><p><br/></p><p><strong>Overview:</strong></p><p>We are seeking a highly motivated and proactive part-time Influencer Marketing Intern to join our growing in-office Los Angeles-based team!</p><p><br/></p><p>The part-time Influencer Marketing Intern will be reporting to the Head of Influencer Marketing and Influencer Team. You will be pivotal in driving influencer awareness, traffic, engagement and conversion. You should have prior experience with influencer marketing, especially scouting and outreach, preferably on TikTok. This position requires strong organization skills, initiative, excellent communication, and analytical skills with a strong knowledge of the social media landscape. The ideal candidate has a background in influencer marketing on TikTok, and has a passion for finding the perfect influencers to represent a brand.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Scout and communicate with influencers alongside Head of Influencer Marketing and Influencer Team</li><li>Maintain relationship with influencers</li><li>Facilitate execution of planned influencer marketing campaigns</li><li>Organize and assimilate influencer insights/data</li><li>Analyze insights/data to refine future influencer relationships</li><li>Assist Head of Influencer Marketing and Influencer Team in weekly reports</li></ul><p><br/></p><p><strong>Ideal Attributes:</strong></p><ul><li>Previous experience in influencer marketing</li><li>Natural interest in social media trends and platforms</li><li>Thoroughly engaged with TikTok and familiar with trending sounds, hashtags, etc.</li></ul><p><br/></p><p><strong>Benefits:</strong></p><ul><li>Fun and inclusive work environment with a super collaborative team</li><li>Team events, like team dinners, paint nights, Top Golf outings, etc.</li><li>Catered lunches</li><li>Access to Bloom supplements and super cool Bloom swag so you can Bloom into your best self!</li></ul>", "responsibilities": "Scout and communicate with influencers alongside Head of Influencer Marketing and Influencer Team\nMaintain relationship with influencers\nFacilitate execution of planned influencer marketing campaigns\nOrganize and assimilate influencer insights/data\nAnalyze insights/data to refine future influencer relationships\nAssist Head of Influencer Marketing and Influencer Team in weekly reports", "skills": ["Influencer Marketing", "TikTok", "Social Media", "Communication", "Analytics"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/3995413758"}