{"jobTitle": "Analytics Engineer (L4) - Finance", "company": {"name": "Netflix", "location": "Los Gatos, CA", "industry": "Entertainment Providers"}, "location": "Los Gatos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$170,000.00/yr - $720,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong><strong>About<br/><br/></strong>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. As Netflix's business grows, financial data is becoming increasingly mission-critical. Netflix’s financial footprint is expanding with complexity due to its global scale, product innovations and business model evolvements. The Finance Data Science and Engineering team is part of the centralized Data and Insights organization, supporting the office of our Chief Financial Officer. The team’s core mission is to enable our business partners to access key financial data efficiently and provide insights to improve monetization and optimize cost. The team is looking to add an Analytics Engineer (L4) who will collaborate with cross-functional partners, including Finance, FP&amp;A, Data Engineering, Product, and Engineering teams, to build insights and tools that help the company make better data-driven decisions. To learn more about analytics engineering at Netflix, read here. In this role, you will:<br/><br/><ul><li>Embed yourself with business stakeholders to help influence decision-making using data.</li><li>Uncover meaningful patterns and insights by doing proactive data analysis and sharing results with the business.</li><li>Develop and drive the adoption of self-service data product tools and solutions. Identify gaps and look for opportunities to innovate and lead the way.</li><li>Build visually appealing, high-performing, and impactful reporting/dashboard products using tools like Tableau across large data sets.</li><li>Partner with data engineers to help design &amp; develop data structures to enable richer analysis.</li><li>Continually explore better data methods to improve precision, accuracy, and visualizations through tools or code.</li><li>Improve and maintain analytical tools related to critical month-end close processes by providing digestible and scalable solutions to the business.<br/><br/></li></ul>To be successful in this role, you are/have:<br/><br/><ul><li>Advanced degree in a quantitative field (e.g. math, statistics, or similar), and 3 years or more experience working in data science and analytics.</li><li>A solid foundation in gathering data using complex SQL in a relational database environment.</li><li>Proficient in Python (or another scripting language used for data science &amp; analysis).</li><li>Experience working with one or more data visualization platforms (i.e., Tableau, PowerBI, Looker, etc.).</li><li>Experience with a broad range of analysis methods: descriptive, statistical, or machine learning.</li><li>Strong at articulating metric definitions, data insights, and project roadmaps in verbal and written form.</li><li>Strong at developing and deepening relationships with various stakeholders.</li><li>A self-starter and passionate learner, who thrives under ambiguity and autonomy.</li><li>Experience partnering with finance and accounting teams and familiarity with related business concepts preferred.</li><li>Experience at one or more e-commerce or subscription-oriented businesses preferred.<br/><br/></li></ul>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000. Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.", "responsibilities": "In this role, you will:<br/><br/><ul><li>Embed yourself with business stakeholders to help influence decision-making using data.</li><li>Uncover meaningful patterns and insights by doing proactive data analysis and sharing results with the business.</li><li>Develop and drive the adoption of self-service data product tools and solutions. Identify gaps and look for opportunities to innovate and lead the way.</li><li>Build visually appealing, high-performing, and impactful reporting/dashboard products using tools like Tableau across large data sets.</li><li>Partner with data engineers to help design &amp; develop data structures to enable richer analysis.</li><li>Continually explore better data methods to improve precision, accuracy, and visualizations through tools or code.</li><li>Improve and maintain analytical tools related to critical month-end close processes by providing digestible and scalable solutions to the business.<br/><br/></li></ul>", "qualifications": {"required": "Advanced degree in a quantitative field (e.g. math, statistics, or similar), and 3 years or more experience working in data science and analytics.\nA solid foundation in gathering data using complex SQL in a relational database environment.\nProficient in Python (or another scripting language used for data science &amp; analysis).\nExperience working with one or more data visualization platforms (i.e., Tableau, PowerBI, Looker, etc.).\nExperience with a broad range of analysis methods: descriptive, statistical, or machine learning.\nStrong at articulating metric definitions, data insights, and project roadmaps in verbal and written form.\nStrong at developing and deepening relationships with various stakeholders.\nA self-starter and passionate learner, who thrives under ambiguity and autonomy.", "preferred": "Experience partnering with finance and accounting teams and familiarity with related business concepts preferred.\nExperience at one or more e-commerce or subscription-oriented businesses preferred.<br/><br/>"}, "skills": ["SQL", "Python", "Tableau", "Data Visualization", "Data Analysis", "Machine Learning", "Data Science", "Analytics Engineering"], "postedDate": "2 weeks ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here. Netflix is a unique culture and environment. Learn more here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995995594"}