{"jobTitle": "Development Director", "company": {"name": "The Posse Foundation", "industry": "Non-profit Organizations", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Non-profit Organizations", "description": "The Development Director is an essential part of the Posse Los Angeles development effort. The development director is responsible for working with the site director and development officer/associate along with Posse’s national development team to meet annual revenue goals. The development director, in coordination with the site director and national development team will plan, manage, and coordinate the site’s development efforts including building new strategies for expanded funding, identifying, cultivating and soliciting donors and overseeing and at times collaborating with the development officer/associate on writing proposals and reports with accompanying budgets, thank you letters and other correspondence, planning events, soliciting corporate donations for events, and ensuring all necessary documents for grants management and audit purposes are properly filed.", "responsibilities": "Work with site director and development officer/associate to create and implement annual development plan and strategy to raise an annual budget of approximately $3 million. Develop a pipeline of prospects for cultivation and solicitation and arrange meetings for site director and self with prospects. Cultivate and steward relationships with select corporate & foundation staff, and individual donors. Maintain portfolios of fundraising prospects and donors. At site director’s discretion, act as a surrogate regarding fundraising matters. Assist site director with advisory board meetings and other related activities. Manage the development officer/associate. Write grant proposals, reports and budgets with development officer/associate or on own. Compose thank you letters and other correspondence of own and at times for site director. Working as a team with the site director, development officer/associate, and national development team to plan fundraising events and develop strategy for soliciting corporate donations for events. Ensure site is properly filing all required documents for grants management and audit purposes.", "qualifications": {"required": "Bachelor’s degree, Seven years minimum of work experience as a development professional, Motivated and able to work independently as well as with a team, Willingness to take initiative, Ability to meet deadlines and multi-task, manage concurrent processes/projects, and focus on the small but important details in all projects while keeping the bigger picture in mind, Excellent written and verbal communications skills, including grant writing, Excellent office and computer skills, Proficient in Word, Excel and experience working with a fundraising database, Able to establish and maintain cooperative professional relationships with colleagues, donors, volunteers and the public, Strong public speaking and presentation skills, Demonstrated belief in Posse's mission and values.", "preferred": "Not specified"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995531792"}