{"jobTitle": "Senior Designer, Men's (Hybrid, WA)", "company": {"name": "Nordstrom", "location": "Seattle, WA"}, "location": "Seattle, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $175,000.00/yr", "currency": "USD"}, "jobFunction": "Art/Creative, Design, and Management", "industry": "Retail and Retail Apparel and Fashion", "description": "NOTE: This position is offered as a hybrid role in the Seattle, WA area. You must be willing to work in office at the Nordstrom Seattle office a minimum of 3 days/week in order to be considered for this position.\n\nApplication Note: In addition to your resume, please include a PDF or link to a portfolio of your work to be considered for this position. \n\n<br/>\n\nAs a Senior Designer of Men’s for one of our Nordstrom Product Group (NPG) brands, you will own the category - conceptualizing, sketching and executing collection ideas that represent the *Brand Ethos* and fashion trends that appeal to the Nordstrom customer. The ideal candidate has experience across different apparel categories, knows how to drive design development, and has an elevated design eye. Experience in contemporary or luxury markets is a plus.\n\n<br/>\n\n<br/>\n\n**A day in the life… **\n\n<br/>\n\n<ul>\n<li>Conceptualize, accurately sketch and execute collection ideas that represents target customer</li>\n<li>Design original and commercially viable product</li>\n<li>Act as fashion authority to drive brand designs and point of view</li>\n<li>Manage calendar across design team to ensure all milestones and due dates are met</li>\n<li>Research materials and components</li>\n<li>Manage product fit sessions</li>\n<li>Collaborate with Design Director on color and pattern selection each season</li>\n<li>Prioritize workload and complex work streams across design team</li>\n<li>Effectively collaborate with leadership and cross-divisional partners to ensure alignment on priorities and direction</li>\n<li>Research and analyze trends and competitive brands</li>\n<li>Manage and develop an efficient and effective design team through performance feedback, goal-setting and development plans</li>\n</ul>\n\n<br/>\n\n**You own this if you have…**\n\n<br/>\n\n<ul>\n<li>Bachelor’s degree in Design, preferred</li>\n<li>7+ years' experience in design industry</li>\n<li>2+ years of experience managing a design team, a plus</li>\n<li>Strong ability to hand-sketch</li>\n<li>Strong presentation skills</li>\n<li>Strong understanding of industry and trends along with a keen eye for fabric development and selection</li>\n<li>Ability to handle high volume of styles</li>\n<li>Highly organized and detail oriented with strong time management and multi-tasking skills</li>\n<li>Ability to think strategically and deliver the right level of detail appropriate to the audience</li>\n<li>Clear and effective written and verbal communication and strong interpersonal skills with ability to work independently or as a team</li>\n<li>Proficiency in MS Office suite and Adobe CS</li>\n<li>Ability to manage and develop skills of direct reports</li>\n</ul>\n\n<br/>\n\n#LI-Hybrid\n\n#LI-CH1\n\n<br/>\n\n**We’ve got you covered…**\n\n<br/>\n\nOur employees are our most important asset and that’s reflected in our benefits. Nordstrom is proud to offer a variety of benefits to support employees and their families, including:\n\n<ul>\n<li>Medical/Vision, Dental, Retirement and Paid Time Away</li>\n<li>Life Insurance and Disability</li>\n<li>Merchandise Discount and EAP Resources</li>\n</ul>\n\n<br/>\n\nA few more important points...\n\n<br/>\n\nThe job posting highlights the most critical responsibilities and requirements of the job. It’s not all-inclusive. There may be additional duties, responsibilities and qualifications for this job.\n\n<br/>\n\nNordstrom will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.\n\n<br/>\n\nApplicants with disabilities who require assistance or accommodation should contact the nearest Nordstrom location, which can be identified at www.nordstrom.com. \n\n<br/>\n\n© 2022 Nordstrom, Inc \n\n<br/>\n\nCurrent Nordstrom employees: To apply, log into Workday, click the Careers button and then click Find Jobs.\n\n<br/>\n\n**Pay Range Details**\n\n<br/>\n\nThe pay range(s) below are provided in compliance with state specific laws. Pay ranges may be different in other locations.\n\n<br/>\n\nWashington: $90,000 - $175,000 annually\n\n<br/>\n\n<br/>\n\nThis position may be eligible for performance-based incentives/bonuses. Benefits include 401k, medical/vision/dental/life/disability insurance options, PTO accruals, Holidays, and more. Eligibility requirements may apply based on location, job level, classification, and length of employment. Learn more in the Nordstrom Benefits Overview by copying and pasting the following URL into your browser: https://careers.nordstrom.com/pdfs/Ben_Overview_17-19.pdf\n\n", "responsibilities": "As a Senior Designer of Men’s for one of our Nordstrom Product Group (NPG) brands, you will own the category - conceptualizing, sketching and executing collection ideas that represent the *Brand Ethos* and fashion trends that appeal to the Nordstrom customer. The ideal candidate has experience across different apparel categories, knows how to drive design development, and has an elevated design eye. Experience in contemporary or luxury markets is a plus.", "qualifications": {"required": "Bachelor’s degree in Design, preferred, 7+ years' experience in design industry, 2+ years of experience managing a design team, a plus, Strong ability to hand-sketch, Strong presentation skills, Strong understanding of industry and trends along with a keen eye for fabric development and selection, Ability to handle high volume of styles, Highly organized and detail oriented with strong time management and multi-tasking skills, Ability to think strategically and deliver the right level of detail appropriate to the audience, Clear and effective written and verbal communication and strong interpersonal skills with ability to work independently or as a team, Proficiency in MS Office suite and Adobe CS, Ability to manage and develop skills of direct reports", "preferred": "Bachelor’s degree in Design"}, "skills": ["Design", "Fashion", "Sketching", "Presentation Skills", "Trend Analysis", "Fabric Development", "Time Management", "Multitasking", "Strategic Thinking", "Communication", "Adobe Creative Suite", "Microsoft Office", "Teamwork"], "postedDate": "2 weeks ago", "benefits": "Medical/Vision, Dental, Retirement and Paid Time Off, Life Insurance and Disability, Merchandise Discount and EAP Resources", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995438643"}