{"jobTitle": "Litigation Legal Assistant - Personal Injury Firm - El Segundo", "company": {"name": "Adams & Martin Group", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Legal", "industry": "Legal Services", "description": "A reputable personal injury law firm based in El Segundo are looking for a Litigation Legal Assistant to join their team on a temporary basis (likely 5-6 months). The Litigation Legal Assistant will assist with state/federal e-filing, preparing TOAs/TOCs, calendaring, and have had significant experience with trials. The ideal candidate will have 5 plus years of experience, have excellent communication skills, and be comfortable working in a fast-paced environment. This role is fully onsite (El Segundo) and paying between $35 to $40 hr. DOE. This position has a strong possibility of going temp-to-perm for the right candidate. <br/><em><span class=\"TextRun SCXW202920741 BCX0\"><span class=\"NormalTextRun SCXW202920741 BCX0\">All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the California Fair Chance Act, City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, and Los Angeles County Fair Chance Ordinance. To the extent our customers </span><span class=\"NormalTextRun SCXW202920741 BCX0\">require</span><span class=\"NormalTextRun SCXW202920741 BCX0\"> a background check for certain positions, the Company faces a significant risk to its business operations and business reputation unless a review of criminal history is conducted for those specific job positions.</span></span></em>", "postedDate": "2 weeks ago", "salary": {"amount": "35 to 40 hr", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995429458"}