{"jobTitle": "Export Specialist", "company": {"name": "JobsInLogistics.com", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00 - 30.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Job Description<br/><br/><br/></strong><strong> Why </strong> this role is special..<br/><br/>Join Green's team of experts and fall in love with forwarding all over again.At Green, you are more than just a clerk - here, as a specialist you will own the consignment from start to finish, managing airfreight and ocean export related decision-making; negotiating with steamship lines, domestic carriers and airlines to win your client an exceptional shipping experience.Clear communication and passion for the industry is essential for this key, relationship-building position.<br/><br/><br/><strong> How </strong> you will be successful<br/><br/><ul><li> Evaluate market opportunities to provide each customer with best-in-class transport solutions. </li><li> Enjoy rate negotiations that maximize profitability and bring value to your customers. </li><li> Prepare and coordinate the necessary documentation for efficient, cost-effective and lawful execution of export activities. </li><li> Provide outstanding service to clients, agents, vendors, and colleagues. </li><li> Clear communication is a must when providing shipping instructions to overseas partners and clients. </li><li> The perfect candidate will enjoy crossing their t's and dotting their i's, bringing attention to detail and delegate effectively. </li><li> Green freight experts are fanatics about response time, and you should be too. </li><li> Our Green freight experts are encouraged to develop their industry expertise to embrace change and growth. <br/><br/><br/></li></ul><strong> What </strong> you will bring .<br/><br/><ul><li> 1-3 years of experience in exports, shipping, transportation or other like experience. </li><li> Knowledge of ocean (FCL &amp; LCL) exports handling a must. </li><li> Knowledge of export Customs laws, practices and procedures. </li><li> Deep understanding of the shipping industry and rate negotiation opportunities. </li><li> Excellent organizational and time management skills. </li><li> Must be self-motivated, able to work in a team as well as be independent. </li><li> Detail oriented, have the ability to multi-task and meet deadlines. </li><li> Excellent verbal and written communication skills. </li><li> Proficient in Windows and Microsoft Office Suite, especially with Excel. </li><li> Aptitude, creativity, and a preference for working in small, collaborative teams. </li><li> Knowledge of Cargo Wise operating system a plus. </li><li> Perform other duties as assigned by Management <br/><br/><br/></li></ul><strong> What </strong> we offer<br/><br/><ul><li> The target hourly range for this position is between $20.00 and $30.00 per hour. </li><li> Employee High Deductible Health Plan (HDHP) currently paid for 100% by Green.</li><li> $1,800 contributed to employee HSA Account, if on HDHP.</li><li> Employee Dental provided by Green.</li><li> Option to purchase disability insurance.</li><li> Paid life insurance and option to buy-up.</li><li> 401(K) and company match.</li><li> Parental Leave Program.</li><li> Monthly recognition points to give/receive, which can be converted to gift cards.</li><li> Tuition Reimbursement Program.</li><li> Weekly fruit baskets in office locations</li><li> A tree planted for every new employee to Trees.org</li><li> Hybrid work schedule.</li><li> Wellbeing Program.</li><li> Training and Development.</li><li> Access to Mentorship Program.<br/><br/></li></ul>Green Worldwide Shipping, LLC (Green) is committed to the full inclusion of all qualified individuals. As part of this commitment, Green will ensure that persons with disabilities are provided reasonable accommodations. If reasonable accommodation is needed to participate in the job application or interview process and/or to perform essential job functions, please contact Faye Hughes, Head of People and Culture at faye.hughes@greenworldwide.com .<br/><br/>Green is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.<br/><br/>CHQ-DOC-036 Version 1 7/26/2023", "responsibilities": "Evaluate market opportunities to provide each customer with best-in-class transport solutions. Enjoy rate negotiations that maximize profitability and bring value to your customers. Prepare and coordinate the necessary documentation for efficient, cost-effective and lawful execution of export activities. Provide outstanding service to clients, agents, vendors, and colleagues. Clear communication is a must when providing shipping instructions to overseas partners and clients. The perfect candidate will enjoy crossing their t's and dotting their i's, bringing attention to detail and delegate effectively. Green freight experts are fanatics about response time, and you should be too. Our Green freight experts are encouraged to develop their industry expertise to embrace change and growth.", "qualifications": {"required": "1-3 years of experience in exports, shipping, transportation or other like experience. Knowledge of ocean (FCL &amp; LCL) exports handling a must. Knowledge of export Customs laws, practices and procedures. Deep understanding of the shipping industry and rate negotiation opportunities. Excellent organizational and time management skills. Must be self-motivated, able to work in a team as well as be independent. Detail oriented, have the ability to multi-task and meet deadlines. Excellent verbal and written communication skills. Proficient in Windows and Microsoft Office Suite, especially with Excel. Aptitude, creativity, and a preference for working in small, collaborative teams. Knowledge of Cargo Wise operating system a plus. Perform other duties as assigned by Management"}, "skills": ["Exports", "Shipping", "Transportation", "Ocean Exports", "Customs Laws", "Rate Negotiation", "Organizational Skills", "Time Management", "Teamwork", "Communication", "Excel", "Cargo Wise"], "postedDate": "2 weeks ago", "benefits": "The target hourly range for this position is between $20.00 and $30.00 per hour. Employee High Deductible Health Plan (HDHP) currently paid for 100% by Green. $1,800 contributed to employee HSA Account, if on HDHP. Employee Dental provided by Green. Option to purchase disability insurance. Paid life insurance and option to buy-up. 401(K) and company match. Parental Leave Program. Monthly recognition points to give/receive, which can be converted to gift cards. Tuition Reimbursement Program. Weekly fruit baskets in office locations A tree planted for every new employee to Trees.org Hybrid work schedule. Wellbeing Program. Training and Development. Access to Mentorship Program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995181221"}