{"jobTitle": "92A Automated Logistical Specialist - Supply Chain", "company": {"name": "Army National Guard", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Internship", "jobFunction": "Training, Distribution, and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage, Warehousing and Storage, and Freight and Package Transportation", "description": "Keeping the back of house in order is a key factor in successful mission planning. As an Automated Logistical Specialist in the Army National Guard, you will maximize your organizational skills and learn the ins and outs of supply chain management. From storage and distribution to warehouse management, your primary responsibility will be to supervise and perform specific functions in order to maintain equipment records and parts.<br/><br/>Major duties include: establishing and maintaining records (stock lists, inventory, material control, etc.), maintaining stock locator system and administering document control procedures, processing requests and turn-in documents, performing prescribed load-list and shop-stock list duties in manual and automated supply applications, and operating material-handling equipment.<br/><br/><strong>Job Duties<br/><br/></strong><ul><li> Construct bins, shelving and other storage aids</li><li> Simplify and standardize the collection and use of maintenance data</li><li> Raise the quality and accuracy of performance, cost, and parts data through improved maintenance management<br/><br/></li></ul><strong>Some Of The Skills You’ll Learn<br/><br/></strong><ul><li> Stock control and accounting procedures</li><li> Procedures for shipping, receiving, storing and issuing stock</li><li> Movement, storage and maintenance of ammunition</li><li> Procedures for handling medical and food supplies<br/><br/></li></ul><strong>Helpful Skills<br/><br/></strong><ul><li> Interest in mathematics, bookkeeping, accounting, business administration, and/or typing</li><li> Preference for physical work</li><li> Interest in operating forklifts and other warehouse equipment<br/><br/></li></ul>Through your training, you will develop the skills and experience to enjoy a civilian career as a stock control clerk, parts clerk, or storekeeper in civilian factories, repair shops, department stores, or government warehouses and stockrooms.<br/><br/><strong>Earn While You Learn<br/><br/></strong>Get paid to learn! Join the Army National Guard and you will learn valuable job skills while earning a regular paycheck and qualifying for tuition assistance.<br/><br/>Automated Logistical Specialist job training requires 10 weeks of Basic Training, where you'll learn basic Soldiering skills, and 12 weeks of Advanced Individual Training (AIT), which includes practice in handling and storing stock. Part of this time is spent in the classroom and part in the field.", "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995509525"}