{"jobTitle": "Assistant Store Manager - Santa Monica", "company": {"name": "Herschel Supply Company", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales, Customer Service, and Management", "industry": "Retail Apparel and Fashion", "description": "Welcome to Herschel Supply, where we make quality products for a lifetime of better journeys. Designed with timeless form and intuitive function in Vancouver, Canada, every piece is backed by our signature warranty for wherever you’re going next.<br/><br/>Since 2009, we’ve never stopped taking risks. We’re constantly innovating, growing our community, reducing our impact on the environment and heading on new journeys. We’ve gotten lost in new cities, made lifelong friends all over the world, road tripped with no GPS, and explored a ton of creative pursuits along the way.<br/><br/>Putting yourself out there isn’t easy. It means stepping outside of your comfort zone and trying something new. It might be scary at first, but it also leads to the best parts of life. Inspiring others to take that leap is what we live for. Wherever you’re headed, we’re here to help you pack your future with possibilities.<br/><br/>So, come along for the ride, get inspired and Put Yourself Out There.<br/><br/>As Assistant Store Manager and a leader of the Herschel Supply Co. store team, you will be responsible for working in conjuction with the Store Manager to drive a whole new level of service and sales excellence, executing marketing and visual campaigns, generating customer loyalty, and pushing to achieve and exceed all retail KPI’s. Your new role requires a high degree of desire to look beyond current retail models, and be a part of a team that is redefining retail as we know it. With a forward-thinking and innovative mindset, you will work well with a changing scope, and environment where quick decisions and challenging the norm are expected.<br/><br/>Our workplace is dynamic, supportive and entrepreneurial in spirit, and we pride ourselves in being a collaborative, open-minded and imaginative team.<br/><br/>On a day-to-day basis, the Assistant Store Manager will:<br/><br/>Lead<br/><br/><ul><li>Foster a positive work environment with a focus on teamwork, productivity and employee engagement.</li><li>Recruit, develops and nurture talented individuals for advancement and growth by providing coaching and mentorship.</li><li>Establish and manage staff schedules, in conjunction with Store Manager.</li><li>Uphold company and store standards, policies and procedures.</li><li>Lead by example and model high performance and behaviors aligned with the Herschel values and standards.</li><li>Assist with reporting and management-related administrative tasks.</li><li>Monitor team members’ work performance, deliver positive or constructive feedback in a timely manner and proactively partner with Store Manager on team member challenges.</li><li>Participate in the performance review process led by Store Manager and provide input as required.</li><li>Assist Store Manager with payroll duties, comple and maintain team member employment-related records and files.<br/><br/><br/></li></ul>Product, Sales and Service<br/><br/><ul><li>Act as a coach to Sales Associates &amp; Holders, lead by example and play a hands-on roll in their personal and professional development.</li><li>Help oversee effective product and visual merchandising to drive sales and create a positive customer experience.</li><li>Acquire, teach and utilize in-depth knowledge of Herschel products each season, including the features, advantages and benefits of each product. </li><li>Proactively lead and manage store loss prevention, inventory control and all other policies and procedures.<br/><br/><br/></li></ul>Store Environment and Marketing<br/><br/><ul><li>Assist in execution of tactical components of store marketing strategy and plans in areas including, but not limited to events, social media and visual merchandising to drive customer acquisition and sales.</li><li>Oversee and ensure all aspects of organization and cleanliness of store.</li><li>Assist and support in developing creative and innovative solutions to adapt seasonal direction to the store space in an inspiring way, while also rolling up sleeves and supporting timely merchandising execution.<br/><br/><br/></li></ul>Experience in a retail leadership role (established Key Holder or Assistant Store Manager) is essential.<br/><br/>Able to connect to the customer through excellent service, strong visual presentation and business ownership.<br/><br/>Strong record of encouraging, developing, and promoting talented team members towards their career goals.<br/><br/>Ability to analyze retail KPI’s and on-floor behaviors then troubleshoot – this skillset needs to cascade through the entire team.<br/><br/>Strong, organizational and analytical skills; ability to work effectively under time constraints and deliver results by critical deadlines.<br/><br/>Merchandising and inventory management experience.<br/><br/>Ability to multi-task and coordinate ongoing projects, plans and people development.<br/><br/>Love of brainstorming, problem-solving, being creative and resourceful.<br/><br/>Must be highly detail oriented with the ability to fulfill responsibilities with minimal supervision.<br/><br/>Ability to work in a collaborative, team-based environment.<br/><br/>We’re committed to creating a workspace that is safe, secure, inclusive and enjoyable for all. Stemming from our core values and initiating dialogue around our programs, we aim to empower everyone to share their individual voices and experiences. It’s with this openness that we are able to expand our view of who we are as individuals, and what we can do in our careers at Herschel.<br/><br/>At Herschel Supply, we are committed to fostering, cultivating, and preserving a culture of diversity, equity, and inclusion. Our goal is to build an inclusive culture that connects us to our customers and the communities around us while embracing and encouraging diversity in our employees’ age, colour, disability, ethnicity, gender identity or expression, sexual orientation, race, religion and other characteristics that make our employees unique.", "responsibilities": "As Assistant Store Manager and a leader of the Herschel Supply Co. store team, you will be responsible for working in conjuction with the Store Manager to drive a whole new level of service and sales excellence, executing marketing and visual campaigns, generating customer loyalty, and pushing to achieve and exceed all retail KPI’s. Your new role requires a high degree of desire to look beyond current retail models, and be a part of a team that is redefining retail as we know it. With a forward-thinking and innovative mindset, you will work well with a changing scope, and environment where quick decisions and challenging the norm are expected.<br/><br/>Our workplace is dynamic, supportive and entrepreneurial in spirit, and we pride ourselves in being a collaborative, open-minded and imaginative team.<br/><br/>On a day-to-day basis, the Assistant Store Manager will:<br/><br/>Lead<br/><br/><ul><li>Foster a positive work environment with a focus on teamwork, productivity and employee engagement.</li><li>Recruit, develops and nurture talented individuals for advancement and growth by providing coaching and mentorship.</li><li>Establish and manage staff schedules, in conjunction with Store Manager.</li><li>Uphold company and store standards, policies and procedures.</li><li>Lead by example and model high performance and behaviors aligned with the Herschel values and standards.</li><li>Assist with reporting and management-related administrative tasks.</li><li>Monitor team members’ work performance, deliver positive or constructive feedback in a timely manner and proactively partner with Store Manager on team member challenges.</li><li>Participate in the performance review process led by Store Manager and provide input as required.</li><li>Assist Store Manager with payroll duties, comple and maintain team member employment-related records and files.<br/><br/><br/></li></ul>Product, Sales and Service<br/><br/><ul><li>Act as a coach to Sales Associates &amp; Holders, lead by example and play a hands-on roll in their personal and professional development.</li><li>Help oversee effective product and visual merchandising to drive sales and create a positive customer experience.</li><li>Acquire, teach and utilize in-depth knowledge of Herschel products each season, including the features, advantages and benefits of each product. </li><li>Proactively lead and manage store loss prevention, inventory control and all other policies and procedures.<br/><br/><br/></li></ul>Store Environment and Marketing<br/><br/><ul><li>Assist in execution of tactical components of store marketing strategy and plans in areas including, but not limited to events, social media and visual merchandising to drive customer acquisition and sales.</li><li>Oversee and ensure all aspects of organization and cleanliness of store.</li><li>Assist and support in developing creative and innovative solutions to adapt seasonal direction to the store space in an inspiring way, while also rolling up sleeves and supporting timely merchandising execution.<br/><br/><br/></li></ul>", "qualifications": {"required": "Experience in a retail leadership role (established Key Holder or Assistant Store Manager) is essential.<br/><br/>Able to connect to the customer through excellent service, strong visual presentation and business ownership.<br/><br/>Strong record of encouraging, developing, and promoting talented team members towards their career goals.<br/><br/>Ability to analyze retail KPI’s and on-floor behaviors then troubleshoot – this skillset needs to cascade through the entire team.<br/><br/>Strong, organizational and analytical skills; ability to work effectively under time constraints and deliver results by critical deadlines.<br/><br/>Merchandising and inventory management experience.<br/><br/>Ability to multi-task and coordinate ongoing projects, plans and people development.<br/><br/>Love of brainstorming, problem-solving, being creative and resourceful.<br/><br/>Must be highly detail oriented with the ability to fulfill responsibilities with minimal supervision.<br/><br/>Ability to work in a collaborative, team-based environment.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "benefits": "Competitive pay, comprehensive benefit plans, Generous Paid Time Off, 401(K) with company match and tuition reimbursement.", "remoteWork": "No", "salary": {"amount": "$21-28", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3995424639"}