{"jobTitle": "Data and Insights Manager", "company": {"name": "Moonbug Entertainment", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Technology, Information and Internet", "description": "Thank you for considering the Data and Insights Manager role with Moonbug Entertainment, an award-winning global entertainment company inspiring kids everywhere to laugh, learn and grow. The company is behind some of the biggest kids' entertainment brands in the world including CoComelon and Blippi. Moonbug believes every child should have access to our entertaining and enriching content, which is why our shows are available on more than 150 video platforms globally including Netflix, Disney+, BBC iPlayer and YouTube Kids. Moonbug is also a global leader in pre-school music and audio experiences, available on 100+ audio platforms globally. Moonbug brands extend far beyond the screen to include streaming music, toys, games, books, live events, and even theme park exhibits. Moonbug is part of Candle Media, an independent, creator-friendly home for cutting-edge, high-quality, category-defining brands and franchises.<br/><br/><em><strong>This role will report full-time ON-SITE at our Los Angeles Office.<br/><br/></strong></em><strong>About You<br/><br/></strong>Are you passionate about data and its potential to drive business success? Does your curiosity and enthusiasm inspire others, and are you dedicated to continuous learning and innovation? Do you excel at turning data into actionable insights and thrive in a collaborative environment?<br/><br/><em>Join our team and help us unlock the full potential of our data to drive strategic decision-making and business growth.<br/><br/></em><strong>The Role<br/><br/></strong>Moonbug is a data-driven company, and our Data &amp; Insights team supports various teams and business areas. These include financial and business forecasting, commercial deal analysis, content performance, and creative strategy input. Learn more about us at www.moonbug.com.<br/><br/>This role will report directly to the Senior Manager, Data &amp; Insights. The Data &amp; Insights Manager will partner with senior stakeholders to provide strategic insights and thought leadership. Key collaborators include our <em><strong>Managing Director, Consumer Products, Chief Creative Officer, and Managing Director, Americas</strong></em>. This role represents the BI team in the Pacific time zone and manages an on-site analyst, ensuring the completion of small-scope tasks and overseeing larger projects.<br/><br/><strong>Key Responsibilities<br/><br/></strong><strong>Strategic Partnership and Thought Leadership<br/><br/></strong><ul><li>Collaborate with senior stakeholders across the business to identify issues and leverage data for effective decision-making. </li><li>Act as a thought leader, using data to propose innovative solutions. <br/><br/><br/></li></ul><strong>Data Analysis and Experimentation<br/><br/></strong><ul><li>Design and execute experiments to merge, manage, interrogate, and extract data. </li><li>Utilize advanced statistical techniques to develop and implement solutions to complex problems. </li><li>Test and refine statistical models, selecting the most appropriate for each project. <br/><br/><br/></li></ul><strong>Communication and Reporting<br/><br/></strong><ul><li>Maintain clear and coherent communication, both verbal and written, to understand data needs and report results to both technical and non-technical stakeholders. </li><li>Create compelling reports that effectively convey insights about our content and brands. </li><li>Follow up with stakeholders after a project has closed to determine the impact on the business the BI team had. <br/><br/><br/></li></ul><strong>Continuous Improvement and Innovation<br/><br/></strong><ul><li>Stay updated with the latest technology, techniques, and advances in data analysis. </li><li>Identify opportunities to use data holistically across the organization to drive improvements and innovation. </li><li>Foster a culture of curiosity and enthusiasm for data-driven problem-solving and promote the benefits of data insights. <br/><br/><br/></li></ul><strong>Team Management<br/><br/></strong><ul><li>Manage an on-site analyst, delegating small-scope tasks and providing guidance on project work as needed. <br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>5+ years in a data-driven role, with a strong track record of providing strategic insights. </li><li>Expertise in advanced statistical techniques and data modeling. </li><li>Experience with SQL is required, Python and R are nice to have. </li><li>Experience working within GCP systems is preferred but not essential - ability to query datasets from Google BigQuery or similar product (e.g. Amazon Redshift, Snowflake or Azure Datalake etc) required. </li><li>Experience in dashboarding tools required (Looker Studio, Power BI, Tableau etc)</li><li>Exceptional communication skills, with the ability to convey complex data insights to senior stakeholders. </li><li>Strong analytical and problem-solving skills, with a keen eye for detail. </li><li>A critical thinker, who does not take stats at face value and can evaluate the reliability of certain methodologies. </li><li>Up-to-date knowledge of the latest trends and technologies in data analysis. </li><li>Demonstrated ability to work collaboratively with senior stakeholders and across different parts of the business. </li><li>Leadership experience, with the ability to manage and mentor team members. <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>Retirement Plan (401k)</li><li>Life Insurance (Basic, Voluntary &amp; AD&amp;D)</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li><li>Family Leave (Maternity, Paternity)</li><li>Short Term &amp; Long Term Disability</li><li>Training &amp; Development</li><li>Free Food &amp; Snacks</li><li>Wellness Resources</li><li>and more!<br/><br/><br/></li></ul><em>Salary: $120,000-130,000<br/><br/></em><em>At Moonbug Entertainment, we are committed to creating an inclusive and diverse work environment. We believe that diversity enriches our workplace and enhances our ability to innovate and connect with audiences around the world. We provide equal employment opportunities to all employees and applicants without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.<br/><br/></em><em>Moonbug Entertainment is dedicated to fostering a culture where everyone feels valued, respected, and empowered to bring their unique perspectives and talents to the table. We are committed to providing reasonable accommodations for qualified individuals with disabilities in our job application and interview processes.<br/><br/></em><em>Join us and be a part of a team that celebrates creativity, collaboration, and the power of diverse voices.</em>", "responsibilities": "Moonbug is a data-driven company, and our Data &amp; Insights team supports various teams and business areas. These include financial and business forecasting, commercial deal analysis, content performance, and creative strategy input. Learn more about us at www.moonbug.com.<br/><br/>This role will report directly to the Senior Manager, Data &amp; Insights. The Data &amp; Insights Manager will partner with senior stakeholders to provide strategic insights and thought leadership. Key collaborators include our <em><strong>Managing Director, Consumer Products, Chief Creative Officer, and Managing Director, Americas</strong></em>. This role represents the BI team in the Pacific time zone and manages an on-site analyst, ensuring the completion of small-scope tasks and overseeing larger projects.<br/><br/><strong>Key Responsibilities<br/><br/></strong><strong>Strategic Partnership and Thought Leadership<br/><br/></strong><ul><li>Collaborate with senior stakeholders across the business to identify issues and leverage data for effective decision-making. </li><li>Act as a thought leader, using data to propose innovative solutions. <br/><br/><br/></li></ul><strong>Data Analysis and Experimentation<br/><br/></strong><ul><li>Design and execute experiments to merge, manage, interrogate, and extract data. </li><li>Utilize advanced statistical techniques to develop and implement solutions to complex problems. </li><li>Test and refine statistical models, selecting the most appropriate for each project. <br/><br/><br/></li></ul><strong>Communication and Reporting<br/><br/></strong><ul><li>Maintain clear and coherent communication, both verbal and written, to understand data needs and report results to both technical and non-technical stakeholders. </li><li>Create compelling reports that effectively convey insights about our content and brands. </li><li>Follow up with stakeholders after a project has closed to determine the impact on the business the BI team had. <br/><br/><br/></li></ul><strong>Continuous Improvement and Innovation<br/><br/></strong><ul><li>Stay updated with the latest technology, techniques, and advances in data analysis. </li><li>Identify opportunities to use data holistically across the organization to drive improvements and innovation. </li><li>Foster a culture of curiosity and enthusiasm for data-driven problem-solving and promote the benefits of data insights. <br/><br/><br/></li></ul><strong>Team Management<br/><br/></strong><ul><li>Manage an on-site analyst, delegating small-scope tasks and providing guidance on project work as needed. <br/><br/><br/></li></ul>", "qualifications": {"required": "5+ years in a data-driven role, with a strong track record of providing strategic insights. Expertise in advanced statistical techniques and data modeling. Experience with SQL is required, Python and R are nice to have. Experience working within GCP systems is preferred but not essential - ability to query datasets from Google BigQuery or similar product (e.g. Amazon Redshift, Snowflake or Azure Datalake etc) required. Experience in dashboarding tools required (Looker Studio, Power BI, Tableau etc) Exceptional communication skills, with the ability to convey complex data insights to senior stakeholders. Strong analytical and problem-solving skills, with a keen eye for detail. A critical thinker, who does not take stats at face value and can evaluate the reliability of certain methodologies. Up-to-date knowledge of the latest trends and technologies in data analysis. Demonstrated ability to work collaboratively with senior stakeholders and across different parts of the business. Leadership experience, with the ability to manage and mentor team members.", "preferred": ""}, "skills": ["Data Analysis", "SQL", "Python", "R", "Google BigQuery", "Amazon Redshift", "Snowflake", "Azure Datalake", "Looker Studio", "Power BI", "Tableau", "Communication", "Problem Solving"], "postedDate": "2 weeks ago", "benefits": "Health Care Plan (Medical, Dental &amp; Vision) Retirement Plan (401k) Life Insurance (Basic, Voluntary &amp; AD&amp;D) Paid Time Off (Vacation, Sick &amp; Public Holidays) Family Leave (Maternity, Paternity) Short Term &amp; Long Term Disability Training &amp; Development Free Food &amp; Snacks Wellness Resources and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995515606"}