{"jobTitle": "Assistant Maintenance Supervisor", "company": {"name": "Onni Group of Companies", "industry": "Real Estate", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Real Estate", "description": "The Assistant Residential Maintenance Supervisor is responsible for providing mentorship to others and to lead by example. The Assistant Residential Maintenance Supervisor is also responsible for supervising day-to-day duties of a team of Maintenance Technicians and janitorial and ensures all facets of asset integrity are met through careful execution of daily, weekly, monthly, and annual responsibilities. Perks & Benefits When you feel good, you do good. At Onni we put your health at the forefront and give you the choice to select a benefits package that best represents you. From no cost to $11, $44, or $103 per pay our PPO, HSA, and HMO have you covered. In addition, we offer: 3 weeks PTO, Annual education allowance of up to $1,000, Referral program, Residential housing discount after 1 year of continuous employment, Friends and family rates for our Hotel Properties throughout the company. What You Will Do Complete assignments as assigned from beginning to completion - daily, weekly, and monthly with ease. Diagnose problems and repairs in the areas of HVAC, electrical, plumbing, swimming pool, carpentry, dry walling, exterior structural, and appliances as needed. Promote and utilizes the mobile maintenance programs as put in place by property management. Train team members as needed to fully function and complete tasks assigned to them. Ensure resident maintenance issues and repairs are being responded to promptly and professionally and handle escalated maintenance issues. Includes follow up with residents verbally, email as well as via our property management systems. Inspect apartments before and after move-in and move-outs, as well as after the apartment has been turned. Assess damages & the needs of each unit during the turnover process. Delegate unit turn tasks to team members and provide updates to the supervisor and other team members as needed. Inspect buildings and grounds to ensure safety and cleanliness, and alert Maintenance team to items that need to be given attention and/or cleaned/repaired. Assist with quality assurance by inspecting the work performed by team members and vendors. Support the Maintenance Manager by addressing concerns with all parties. Escalate to the Maintenance Manager as necessary. Obtain bids or job walks from outside contractors as well as oversees contractor work for completeness as needed. This includes inspecting the work completed & ensuring supervisor is aware of any concerns and/or updated that work is satisfactory. Support the Maintenance Manager with monitoring the maintenance budgetary spending by inspecting the use of supplies & the storage inventories of those supplies to operate efficiently. When necessary, work within planned property budget and order supplies, manage PO process and schedule vendors as needed with supervisor approval. Communicate with supervisor regarding the job performance, any obstacles faced, and offer solutions for overall maintenance functions at the property. Promote a quality living experience for all residents. Complete service requests in a timely manner and respond to on-call emergencies according to company protocol. Work closely with various hotel and residential departments in effort to achieve the best resident and guest experience possible. Participate in company-provided training such as fair housing, safety, non-discrimination, and harassment prevention. Comply with all Company National Standards, applicable health and safety rules and regulations, as well as applicable local, state, and federal laws. Performs other duties as required.", "responsibilities": "Complete assignments as assigned from beginning to completion - daily, weekly, and monthly with ease. Diagnose problems and repairs in the areas of HVAC, electrical, plumbing, swimming pool, carpentry, dry walling, exterior structural, and appliances as needed. Promote and utilizes the mobile maintenance programs as put in place by property management. Train team members as needed to fully function and complete tasks assigned to them. Ensure resident maintenance issues and repairs are being responded to promptly and professionally and handle escalated maintenance issues. Includes follow up with residents verbally, email as well as via our property management systems. Inspect apartments before and after move-in and move-outs, as well as after the apartment has been turned. Assess damages & the needs of each unit during the turnover process. Delegate unit turn tasks to team members and provide updates to the supervisor and other team members as needed. Inspect buildings and grounds to ensure safety and cleanliness, and alert Maintenance team to items that need to be given attention and/or cleaned/repaired. Assist with quality assurance by inspecting the work performed by team members and vendors. Support the Maintenance Manager by addressing concerns with all parties. Escalate to the Maintenance Manager as necessary. Obtain bids or job walks from outside contractors as well as oversees contractor work for completeness as needed. This includes inspecting the work completed & ensuring supervisor is aware of any concerns and/or updated that work is satisfactory. Support the Maintenance Manager with monitoring the maintenance budgetary spending by inspecting the use of supplies & the storage inventories of those supplies to operate efficiently. When necessary, work within planned property budget and order supplies, manage PO process and schedule vendors as needed with supervisor approval. Communicate with supervisor regarding the job performance, any obstacles faced, and offer solutions for overall maintenance functions at the property. Promote a quality living experience for all residents. Complete service requests in a timely manner and respond to on-call emergencies according to company protocol. Work closely with various hotel and residential departments in effort to achieve the best resident and guest experience possible. Participate in company-provided training such as fair housing, safety, non-discrimination, and harassment prevention. Comply with all Company National Standards, applicable health and safety rules and regulations, as well as applicable local, state, and federal laws. Performs other duties as required.", "qualifications": {"required": "Associates degree or equivalent technical training in residential property maintenance. Minimum of 3 years of progressive experience and responsibility in a maintenance field, two of which were holding a supervisory position directing a multi-functional maintenance staff. Strong mechanical aptitudes, and a working knowledge of electrical, and mechanical systems. Excellent trouble shooting and diagnostic skills. Ability to define problems and resolve them quickly, familiarity with local building codes and OSHA regulations. Familiarity with all current health and safety regulations. Requires excellent oral and written communication skills. Ability to work well with ever changing priorities and or situations. Must be a self-starter who can work well with people at all levels both in and out of the community. High rise experience is a plus. Experience with work order tracking system such as Yardi Software, a plus. Able to work an On-call rotation and weekends required.", "preferred": "Not specified"}, "skills": ["HVAC", "Electrical", "Plumbing", "Carpentry", "Dry Walling", "Exterior Structural", "Appliances", "Troubleshooting", "Diagnostic Skills", "Communication", "Team Leadership"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "3 weeks PTO, Annual education allowance of up to $1,000, Referral program, Residential housing discount after 1 year of continuous employment, Friends and family rates for our Hotel Properties throughout the company.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995355517"}