{"jobTitle": "Social Brand Creative, Brand Studio", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$135,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Marketing", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>The application window will be open until at least August 16, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.<br/><br/>Note: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:<br/><br/><strong>In-office locations: San Francisco, CA, USA; New York, NY, USA; Portland, OR, USA; Los Angeles, CA, USA.<br/><br/></strong><strong>Remote location(s): United States.</strong><strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>5 years of experience working in a creative discipline (e.g., writing, filmmaking, video editing, design, art direction, photography, etc.).</li><li>A portfolio of creative work. <br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience working with in-house brand creative team and creative agency creating breakthrough social media content.</li><li>Ability to produce, film, and edit.</li><li>Excellent graphic design and motion graphics skills.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>As a Social Creative in Brand Studio, you will help bring the brand to life across the entire social media ecosystem, setting the gold standard for social content for the company.<br/><br/>You will write and develop social-first organic and paid content (particularly short-form videos like YouTube Shorts and Reels). You voraciously study and deeply understand Internet and pop culture from esoteric memes to man-on-the-street interviews and can marry it with a Google POV. We don’t just hop on trends for the cultural clout, we find relevant ways to add value to the cultural conversation. Just as importantly, you understand how purpose-built social content can complement and maximize traditional advertising campaigns.<br/><br/>In this role, you will proactively generate culturally relevant and social-first ideas, develop concepts, write scripts, and work with other creatives (designers, editors, strategists, agencies, etc.) to create breakthrough social content.<br/><br/>The US base salary range for this full-time position is $135,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop, script, pitch, and rapidly prototype organic and paid social content concepts rooted in platform best practices.</li><li>Collaborate with agency partners, marketers, producers, designers, editors, and legal teams to rapidly prototype concepts and produce finished content.</li><li>Help model a collaborative partnership between brand creative, insights lab, brand social, product teams, and other functional stakeholders (e.g., communication, media lab, etc.).</li><li>Seek out opportunities for Google to add substantive value to the cultural conversation by bringing a high volume of on-brand social content ideas on a regular basis.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Develop, script, pitch, and rapidly prototype organic and paid social content concepts rooted in platform best practices.</li><li>Collaborate with agency partners, marketers, producers, designers, editors, and legal teams to rapidly prototype concepts and produce finished content.</li><li>Help model a collaborative partnership between brand creative, insights lab, brand social, product teams, and other functional stakeholders (e.g., communication, media lab, etc.).</li><li>Seek out opportunities for Google to add substantive value to the cultural conversation by bringing a high volume of on-brand social content ideas on a regular basis.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience. 5 years of experience working in a creative discipline (e.g., writing, filmmaking, video editing, design, art direction, photography, etc.). A portfolio of creative work.", "preferred": "Experience working with in-house brand creative team and creative agency creating breakthrough social media content. Ability to produce, film, and edit. Excellent graphic design and motion graphics skills."}, "skills": ["Social Media", "Content Creation", "Video Editing", "Graphic Design", "Motion Graphics", "Creative Strategy", "Brand Management", "Marketing", "Advertising", "Digital Marketing", "Social Media Marketing", "YouTube", "Reels", "Pop Culture", "Cultural Trends", "Content Development", "Scriptwriting", "Collaboration", "Agency Management", "Stakeholder Management", "Communication", "Idea Generation", "Innovation"], "postedDate": "1 week ago", "benefits": "The US base salary range for this full-time position is $135,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995443381"}