{"jobTitle": "Legal Associate Counsel $150,000 - $185,000 Annual", "company": {"name": "Commerce Casino", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Gambling Facilities and Casinos", "description": "6131 Telegraph Rd, Commerce, CA 90040, USA Req #2632<br/><br/>Tuesday, August 6, 2024<br/><br/>Commerce Casino is the world’s largest card casino offering more than 200 tables. Established in 1983, the casino values its staff of over 2,500 employees and is proud to be known as “Where the World Comes to Play.” Commerce Casino offers a comprehensive benefits package to include medical, dental, vision, life, flexible spending accounts, 401(k), vacation time, and much more!<br/><br/><strong>Overview<br/><br/></strong>The Associate Counsel provides support to the General Counsel and various Casino departments on multiple aspects of the business with a focus on Human Resources Labor/Employment advice and counsel, with secondary responsibility for other legal and compliance matters. The Associate Counsel collaborates with senior leadership in the pursuit of developing simple solutions to complex issues.<br/><br/><strong>Primary Duties<br/><br/></strong><ul><li>Support Commerce Casino’s operational organization by providing sound and reasonable legal advice in all areas of the company;</li><li>Serve as a subject matter expert in all areas of employment and labor law, and provide legal advice and guidance to Human Resources and other business partners regarding a wide-range of employment law matters, including performance management, terminations, wage and hour, leaves and reasonable accommodations, EEO and FEHA matters, staff reductions</li><li>Provide comprehensive expert legal advice and counseling to management and human resources business partners on employment issues, including recruiting, hiring, employee relations, discipline, terminations, reductions-in-force, leaves of absence, accommodations, wage and hour compliance, and immigration;</li><li>Assist in the management of employment related litigation to achieve optimal efficiencies, outcomes, and value for the company</li><li>Collaborate with executive and senior team members to provide advice and professional guidance on risks and suitability of employment related actions and programs in furtherance of departmental and company goals;</li><li>Consult with human resources and other business partners regarding the formulation and revision of internal policies, programs, procedures and guidelines, and make recommendations to ensure compliance with applicable laws and internal standards and to guide team members on best practices</li><li>Draft and revise model standard employment templates and clauses;</li><li>Provide support to the legal department and leadership team with advice and counsel related to all aspects of the business;</li><li>Provide support as necessary to other functions of the Legal Department, such as privacy/cybersecurity, policies and procedures, document retention, claims, litigation, compliance, and special projects, as assigned by the General Counsel.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum of 7 years of legal experience preferred.</li><li>Law degree from accredited legal program and member of the California bar in good standing.</li><li>Must obtain and maintain a Key Employee License from the Bureau of Gambling Control.</li><li>Demonstrated ability to exercise good judgment in knowing when and how to raise issues to the appropriate level and propose solutions.</li><li>Outstanding writing, editing, negotiation and analytical skills; strong organizational abilities and ability to work in a fast-paced, agile environment, with a wide variety of legal issues.</li><li>Excellent communication skills, ability to build positive relationships across a wide variety of departments and levels.</li><li>Ability to dive into details, understand business processes, and document procedures, policies and guidelines.<br/><br/></li></ul>Other details<br/><br/><ul><li>Job Family Regular</li><li>Pay Type Salary</li><li>Required Education Bachelor’s Degree<br/><br/></li></ul>Apply Now", "postedDate": "2 weeks ago", "qualifications": {"required": "Minimum of 7 years of legal experience preferred.\nLaw degree from accredited legal program and member of the California bar in good standing.\nMust obtain and maintain a Key Employee License from the Bureau of Gambling Control.\nDemonstrated ability to exercise good judgment in knowing when and how to raise issues to the appropriate level and propose solutions.\nOutstanding writing, editing, negotiation and analytical skills; strong organizational abilities and ability to work in a fast-paced, agile environment, with a wide variety of legal issues.\nExcellent communication skills, ability to build positive relationships across a wide variety of departments and levels.\nAbility to dive into details, understand business processes, and document procedures, policies and guidelines."}, "skills": [], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995564146"}