{"jobTitle": "Oliver Wyman – Actuarial Analyst (2025) – P&C", "company": {"name": "Oliver Wyman", "industry": "Insurance and Business Consulting and Services", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "66,000.00 - 90,000.00", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Insurance and Business Consulting and Services", "description": "Oliver Wyman is a global leader in management consulting. With offices in 70 cities across 30 countries, Oliver Wyman combines deep industry knowledge with specialized expertise in strategy, operations, risk management, and organization transformation. The firm has more than 7,000 professionals around the world who work with clients to optimize their business, improve their operations and risk profile, and accelerate their organizational performance to seize the most attractive opportunities. Oliver Wyman is a business of Marsh McLennan [NYSE: MMC]. For more information, visit www.oliverwyman.com. Follow Oliver Wyman on X @OliverWyman.<br/><br/>The Actuarial Practice of Oliver Wyman provides customized actuarial services and strategic insight, supporting clients as they strive to exceed their business objectives. Our exceptional client and employee retention exemplify our commitment to relationships built on trust, responsiveness, and clear communication.<br/><br/>The <strong>Property and Casualty Consulting</strong> <strong>Practice</strong> assists insurance companies, self-insured corporations, government entities and other organizations with all aspects of managing property and casualty insurance exposures. We guide clients on their qualitative and quantification of risk and loss exposures, and offer advice on a range of issues, from external business strategy and internal risk management to economic capital modeling and new product development.<br/><br/><strong>Job Description<br/><br/></strong><strong>Job Title: </strong>P&amp;C – Analyst - 2025<br/><br/><strong>Office/Regions available: </strong>Atlanta, Charlotte, Chicago, Dallas, Houston, Los Angeles, San Francisco, Nashville, Princeton, Melville, New York, St. Louis<br/><br/>Oliver Wyman is seeking <strong>P&amp;C Analyst(s)</strong> to support our growing Property &amp; Casualty Actuarial Consulting Practice. This position requires the candidate to work closely with our consultants to independently analyze complex problems and develop workable solutions for our clients, which include large corporations, captive insurance companies, state regulators, and healthcare provider systems. The candidate will eventually have significant interaction and visibility with Oliver Wyman’s exciting and diverse client portfolios.<br/><br/>Potential projects may include:<br/><br/><ul><li>Assist in a wide range of actuarial projects. Focus will be on loss reserving but additional projects include pricing/ratemaking, predictive modeling, economic capital modeling, and loyalty rewards programs.</li><li>Compile and verify client data</li><li>Setup spreadsheet analysis, templates, and exhibits</li><li>Prepare production exhibits and written reports to present findings</li><li>Attend client meetings as required</li><li>Assist in the preparation of proposals and presentations for prospects</li><li>Attend marketing/sales presentations as required<br/><br/></li></ul><strong>Skills And Attributes<br/><br/></strong><ul><li>Bachelor’s or Master’s degree, preferably in Actuarial Science, Mathematics, Statistics, Finance, or a related field</li><li>Actively pursuing actuarial credentials</li><li>Strong organizational skills with an ability to prioritize and handle multiple tasks</li><li>Excellent interpersonal skills; strong oral and written communications skills</li><li>Ability to manage in a fast-paced environment</li><li>Ability to undertake instructions for project tasks and produce quality and timely results</li><li>Self-starter, strong initiative, confidence and ability to work with little guidance, but still being a collaborative teammate</li><li>Any property &amp; casualty experience will receive strong consideration</li><li>Strong command of Microsoft Office, Excel, Word, and PowerPoint, etc.</li><li>R, SAS, SQL, or VBA experience a plus<br/><br/></li></ul>Oliver Wyman seeks to invest in its people by fostering a safe and inclusive environment, respecting and welcoming different perspectives, promoting an ownership culture, providing opportunities for individuals to develop their personal brand, and celebrating successes and rewarding performance.<br/><br/>We provide a competitive compensation and benefits package, including a performance-based bonus, an Actuarial Study Program and a supportive and flexible work environment. Explore all the benefits offered at US Benefits | Marsh McLennan.<br/><br/>For more information, please visit our website at www.oliverwyman.com/actuaries.<br/><br/><strong>About Marsh McLennan<br/><br/></strong>Marsh McLennan (NYSE: MMC) is the world’s leading professional services firm in the areas of risk, strategy and people. The Company’s 83,000 colleagues advise clients in 130 countries. With annual revenue of nearly $20 billion, Marsh McLennan helps clients navigate an increasingly dynamic and complex environment through four market-leading businesses. Marsh provides data driven risk advisory services and insurance solutions to commercial and consumer clients. Guy Carpenter develops advanced risk, reinsurance and capital strategies that help clients grow profitably and pursue emerging opportunities. Mercer delivers advice and technology-driven solutions that help organizations redefine the world of work, reshape retirement and investment outcomes, and unlock health and wellbeing for a changing workforce. Oliver Wyman serves as a critical strategic, economic and brand advisor to private sector and governmental clients. For more information, visit marshmclennan.com, follow us on LinkedIn and Twitter or subscribe to <em>BRINK</em>.<br/><br/>Marsh McLennan is committed to embracing a diverse, inclusive and flexible work environment. We aim to attract and retain the best people and embrace diversity of age background, disability, ethnic origin, family duties, gender orientation or expression, marital status, nationality, parental status, personal or social status, political affiliation, race, religion and beliefs, sex/gender, sexual orientation or expression, skin color, veteran status (including protected veterans), or any other characteristic protected by applicable law. If you have a need that requires accommodation, please let us know by contacting TANA@mmc.com.<br/><br/>Unrestricted U.S. work authorization is required. Oliver Wyman does not offer sponsorship for this position. (Please note that CPT and OPT are restricted forms of work authorization.)<br/><br/><em>The applicable base salary range for this role is $66,000 - $90,000.<br/><br/></em><em>The base pay offered will be determined on factors such as experience, skills, training, location, certifications, education, exams, and any applicable minimum wage requirements. Decisions will be determined on a case-by-case basis. In addition to the base salary, this position may be eligible for performance-based incentives.<br/><br/></em><strong>R_278047</strong>", "responsibilities": "Assist in a wide range of actuarial projects. Focus will be on loss reserving but additional projects include pricing/ratemaking, predictive modeling, economic capital modeling, and loyalty rewards programs. Compile and verify client data. Setup spreadsheet analysis, templates, and exhibits. Prepare production exhibits and written reports to present findings. Attend client meetings as required. Assist in the preparation of proposals and presentations for prospects. Attend marketing/sales presentations as required.", "qualifications": {"required": "Bachelor’s or Master’s degree, preferably in Actuarial Science, Mathematics, Statistics, Finance, or a related field. Actively pursuing actuarial credentials. Strong organizational skills with an ability to prioritize and handle multiple tasks. Excellent interpersonal skills; strong oral and written communications skills. Ability to manage in a fast-paced environment. Ability to undertake instructions for project tasks and produce quality and timely results. Self-starter, strong initiative, confidence and ability to work with little guidance, but still being a collaborative teammate. Any property & casualty experience will receive strong consideration. Strong command of Microsoft Office, Excel, Word, and PowerPoint, etc.", "preferred": "R, SAS, SQL, or VBA experience a plus"}, "skills": ["Actuarial Science", "Mathematics", "Statistics", "Finance", "Microsoft Office", "Excel", "Word", "PowerPoint", "R", "SAS", "SQL", "VBA"], "postedDate": "2 weeks ago", "benefits": "We provide a competitive compensation and benefits package, including a performance-based bonus, an Actuarial Study Program and a supportive and flexible work environment. Explore all the benefits offered at US Benefits | Marsh McLennan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995736716"}