{"jobTitle": "Human Resources Business Partner", "company": {"name": "Comrise", "industry": "Consumer Electronics Manufacturing", "location": "Arcadia, CA", "size": ""}, "location": "Arcadia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$105,000.00/yr - $115,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Computers and Electronics Manufacturing", "description": "<strong>Job Title:</strong> HR Business Partner (HRBP)\n<p><strong>Location:</strong> Arcadia, CA (5 days onsite)</p><p><strong>Travel: </strong>Maybe 25-40% to other Branches – WA, AZ, CO, MI, Hercules, CA, and NJ</p><p><strong>Company:</strong> Confidential Search </p><p><strong>Industry: </strong>Consumer Electronics Manufacturing</p><p><strong>Report to:</strong> VP of Finance</p><p><strong>Term:</strong> Perm/Full-Time/Direct Hire</p><p><strong>Salary: </strong>$105,000 to $115,000 per year (base salary) + 15% annual bonus</p><p><strong>Benefits include:</strong></p><ul><li>Eligible for medical, dental, and vision benefits 1st of the month after 60 days of employment.</li><li>Eligible for vacation time after 6 months of employment.</li><li>Eligible to use sick time after 90 days of employment.</li><li>7 paid holidays per year.</li><li>Eligible for the company's matching 401k plan after 90 days of employment.</li></ul><p><br/></p><p><strong>Overview:</strong></p><p>We are seeking an HR Business Partner (HRBP) who will collaborate closely with leadership and employees to foster a positive workplace culture while contributing to the achievement of strategic business objectives. In this multifaceted role, the HRBP will play a crucial role in aligning people strategies with the organization's overall business objectives. Responsibilities extend beyond traditional HR functions, encompassing strategic, consultative, and advisory roles. </p><p><br/></p><p>This position has no direct supervisory responsibilities but serves as a coach and mentor for other positions in the department.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li><strong>Trusted Advisor:</strong> Act as a business partner and trusted advisor to senior leaders and people managers within multiple client groups. Provide strategic HR leadership and consultation focused on creating innovative HR strategies.</li><li><strong>Strategic HR Planning:</strong> Work closely with senior management to align HR strategies with overall business objectives. Develop and implement HR plans supporting company growth.</li><li><strong>Employee Relations:</strong> Serve as a trusted advisor to address and resolve employee concerns, conflicts, and performance issues. Promote a positive and inclusive work culture.</li><li><strong>Talent Acquisition:</strong> Execute the Talent Management process, identifying current and forecasted talent needs. Develop action plans to mitigate associated risks.</li><li><strong>Performance Management:</strong> Partner with leaders for the performance management processes, including goal setting, feedback, and career pathing.</li><li><strong>Training and Development:</strong> Collaborate with the learning and development team to identify training needs and create development programs.</li><li><strong>HR Policies and Compliance:</strong> Stay up to date with federal and state employment laws. Ensure company policies and practices are compliant.</li><li><strong>Employee Onboarding and Offboarding Management:</strong> Drive the onboarding process and monitor offboarding management.</li><li><strong>Change Management:</strong> Support the organization through periods of change and growth.</li><li><strong>Recruitment:</strong> Lead improvements in recruitment processes and facilitate interviewing.</li><li><strong>HR Metrics and Reporting:</strong> Prepare regular reports and presentations for senior management.</li><li><strong>Other Duties:</strong> Perform other duties as requested or directed by management.</li></ul><p><br/></p><p><strong>Required Skills/Abilities:</strong></p><ul><li>7+ years of experience in human resources, organization development, or related field.</li><li>Proven advising and change management experience.</li><li>Demonstrated knowledge of HR industry practices.</li><li>Strong integration and strategic planning skills.</li><li>Strong written and verbal communication skills.</li><li>Strong facilitation and presentation skills.</li><li>Strong problem-solving and decision-making skills.</li><li>Business sense with an ability to quickly assimilate new information.</li><li>Mandarin speaking is preferred.</li></ul><p><br/></p><p><strong>Education and Experience:</strong></p><ul><li>Minimum of 3-5 years of experience resolving complex employee relations issues.</li><li>Working knowledge of multiple human resource disciplines.</li><li>Bachelor’s degree is required.</li><li>SHRM Certified Professional (SHRM-CP) or SHRM Senior Certified Professional (SHRM-SCP) or PHR credential is a plus.</li></ul>", "responsibilities": "Act as a business partner and trusted advisor to senior leaders and people managers within multiple client groups. Provide strategic HR leadership and consultation focused on creating innovative HR strategies. Work closely with senior management to align HR strategies with overall business objectives. Develop and implement HR plans supporting company growth. Serve as a trusted advisor to address and resolve employee concerns, conflicts, and performance issues. Promote a positive and inclusive work culture. Execute the Talent Management process, identifying current and forecasted talent needs. Develop action plans to mitigate associated risks. Partner with leaders for the performance management processes, including goal setting, feedback, and career pathing. Collaborate with the learning and development team to identify training needs and create development programs. Stay up to date with federal and state employment laws. Ensure company policies and practices are compliant. Drive the onboarding process and monitor offboarding management. Support the organization through periods of change and growth. Lead improvements in recruitment processes and facilitate interviewing. Prepare regular reports and presentations for senior management. Perform other duties as requested or directed by management.", "qualifications": {"required": "7+ years of experience in human resources, organization development, or related field. Proven advising and change management experience. Demonstrated knowledge of HR industry practices. Strong integration and strategic planning skills. Strong written and verbal communication skills. Strong facilitation and presentation skills. Strong problem-solving and decision-making skills. Business sense with an ability to quickly assimilate new information. Mandarin speaking is preferred.", "preferred": "Minimum of 3-5 years of experience resolving complex employee relations issues. Working knowledge of multiple human resource disciplines. Bachelor’s degree is required. SHRM Certified Professional (SHRM-CP) or SHRM Senior Certified Professional (SHRM-SCP) or PHR credential is a plus."}, "skills": ["Human Resources", "Employee Relations", "Talent Acquisition", "Performance Management", "Training and Development", "HR Policies and Compliance", "Onboarding", "Change Management", "Recruitment", "HR Metrics and Reporting", "Strategic Planning", "Communication", "Facilitation", "Presentation", "Problem Solving", "Decision Making", "Business Sense", "Mandarin"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Eligible for medical, dental, and vision benefits 1st of the month after 60 days of employment. Eligible for vacation time after 6 months of employment. Eligible to use sick time after 90 days of employment. 7 paid holidays per year. Eligible for the company's matching 401k plan after 90 days of employment.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995436902"}