{"jobTitle": "Metal Fabrication Supervisor", "company": {"name": "Coast Sign Incorporated", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "Major Sign Manufacturer is seeking an experienced Metal Fabrication Supervisor for its manufacturing location in Anaheim, CA.<br/><br/><strong>Job Summary:<br/><br/></strong>Implements production activities, meets production goals, and supervises a team of over 40 employees. Oversee aluminum and steel Fabrication, Welding, Waterjet, Sheers, and Break Press machinery. Must have Excellent verbal and written communication skills with excellent follow-through. Computer Skills are a must.<br/><br/><strong>Responsibilities:<br/><br/></strong>Review and prioritize production schedules with the team leaders and production scheduler.<br/><br/>Read and analyze work orders, production schedules, and reports determining production requirements to evaluate current production estimates and outputs.<br/><br/>Communicate with other teams and employees to coordinate operations and activities between departments to ensure products are built and assembled.<br/><br/>Maintain employees’ weekly timecards.<br/><br/>Maintain a safe work environment.<br/><br/>Conduct monthly safety training for all employees.<br/><br/>Must have 5 to 10 years of supervisory experience in a manufacturing environment. We are an Equal Opportunity Employer.<br/><br/><strong>Company Description<br/><br/></strong>Since 1964, Coast Sign has engineered placemaking, identity and discovery on behalf of companies across all major industries. Through a mission founded in providing quality products, services, and customer service, we’ve evolved to become a trusted industry leader and partner to the world’s biggest brands. Our industry-recognized success is a product of strong partners, supplier relationships, and a firm commitment to innovative, sustainable practices.<br/><br/>We offer full-service nationwide signage solutions in various industries, custom-fit to each client’s needs and specifications.<br/><br/>Since 1964, Coast Sign has engineered placemaking, identity and discovery on behalf of companies across all major industries. Through a mission founded in providing quality products, services, and customer service, we’ve evolved to become a trusted industry leader and partner to the world’s biggest brands. Our industry-recognized success is a product of strong partners, supplier relationships, and a firm commitment to innovative, sustainable practices. We offer full-service nationwide signage solutions in various industries, custom-fit to each client’s needs and specifications.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995645358"}