{"jobTitle": "Buyer", "company": {"name": "AppleOne Employment Services", "location": "Perris, CA"}, "location": "Perris, CA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Manufacturing", "industry": "Public Policy Offices", "description": "The successful candidate will handle a broad range of procurement responsibilities, including the review, sourcing, negotiation, and management of goods and services in alignment with District procurement policies. Key tasks involve selecting appropriate procurement methods, conducting product research, and identifying suppliers for specialized and technical needs.<br/><br/>The role also includes developing and maintaining accurate reports on contract management and cost evaluations, managing comprehensive procurement records, tracking funding, and consulting with management on funding limits.<br/><br/>Responsibilities extend to creating and managing bids, Requests for Qualifications (RFQs), and Requests for Proposals (RFPs). The candidate will assist departments in finalizing specifications, post and respond to bids, evaluate proposals, support contract negotiations, and draft legal agreements and award letters.<br/><br/>The role demands addressing inquiries and issues from internal staff, contract service providers, and the public, reviewing scopes of work, recommending contract modifications, and ensuring compliance with District and state regulations. Quarterly and annual contract reviews, problem resolution, and administration of dispute procedures are also required.<br/><br/>Additionally, the role involves processing contract and purchase change orders, verifying requisitions and budget information, ensuring compliance with District policies, and adjusting purchase orders as needed. The incumbent will respond to procurement inquiries, provide technical support for the purchasing system, and prepare financial analyses to evaluate the cost-effectiveness of products and services.<br/><br/>Special projects and assignments will be part of the role, with strict adherence to District safety rules and regulations. This position offers significant opportunities for professional growth and development.<br/><br/><ul><li>Experience: Any combination of experience and education that provides the required knowledge and abilities is qualifying as outlined below:<br/><br/><br/></li></ul>Two (2) years of progressively responsible professional experience supporting a comprehensive purchasing program, or one (1) year of experience as an Assistant Buyer with the District.<br/><br/>Education:<br/><br/>Equivalent to a bachelor’s degree with major coursework in purchasing, finance, or management.<br/><br/>If interested and qualified, APPLY TODAY!<br/><br/>#1066<br/><br/>EEO/AA Employer/Vet/Disabled.<br/><br/>For temporary assignments lasting 13 weeks or longer, the Company is pleased to offer major medical, dental, vision, 401k and any statutory sick pay where required.<br/><br/>If you believe you need a reasonable accommodation due to a disability or health condition in order to search for a job opening or to apply for a position, please contact your staffing representative who will reach out to our HR team.<br/><br/>AppleOne participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program. https://e-verify.uscis.gov/web/media/resourcesContents/E-Verify_Participation_Poster_ES.pdf]]&gt;", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995243949"}