{"jobTitle": "Senior Business Analyst", "company": {"name": "Sidecar Health", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "120,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst and Information Technology", "industry": "Insurance", "description": "Sidecar Health is redefining health insurance. Our mission is to make excellent healthcare affordable and attainable for everyone. We know that to accomplish this lofty mission, we need driven people who will make things happen.\n\nThe passionate people who make up Sidecar Health’s team come from all over, with backgrounds as tech leaders, policy makers, healthcare professionals, and beyond. And they all have one thing in common—the desire to fix a broken system and make it more personalized, affordable, and transparent.\n\nIf you want to use your talents to transform healthcare in the United States, come join us!\n\nAbout the Role\n\nReporting to the Head of Business Analytics, the Senior Business Analyst will be responsible for building and supporting emerging analytics needs throughout the business. This role requires a blend of technical expertise and strategic thinking to drive impactful business decisions.\n\nWhat You'll Do \n\n* Build and deploy cutting edge analytical solutions to strengthen our strategy across Marketing, Sales, Operations, Finance, and Product in a fast-paced healthcare tech startup\n* Effectively partner across teams, within and outside of analytics, to translate raw data into business impact\n* Create self-service dashboards and automated data reporting solutions\n* Define and monitor critical metrics and KPIs to track success, outcomes, and impact\n* Present insights and strategize with leadership on the direction of the business and areas of opportunity\n* Own solutions from start to finish\n* Be a part of a cutting-edge, fast-growing team\n\nWhat You'll Bring \n\n* 3+ years of quantitative analytics experience with experience in SQL, dbt, and Python-based analytical libraries\n* 3+ years professional experience in building and maintaining Tableau dashboards\n* Bachelor’s degree in Mathematics, Statistics, Computer Science, Engineering, Economics or a related discipline. Master’s degree is a plus\n* Experience with Snowflake, Salesforce, and NetSuite is a plus\n* Strong problem-solving skills and ability to work in a fast-paced dynamic startup environment\n* Excellent communication and presentation skills\n* Experience in health insurance regulatory reporting is a plus\n* Passionate about transforming the US health insurance industry through transparency\n\nWhat You'll Get\n\n* Competitive salary, bonus opportunity, and equity package\n* Comprehensive Medical, Dental, and Vision benefits\n* A 401k retirement plan\n* Paid vacation and company holidays\n* Opportunity to make an impact at a rapidly growing mission-driven company transforming healthcare in the U.S.\n\nSidecar Health adopts a market-based approach to compensation, where base pay varies depending on location and is further influenced by job-related skills and experience. The current expected salary range for this position is $120,000 - $130,000.\n\nSidecar Health is an Equal Opportunity employer committed to building a diverse team. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.", "responsibilities": "Build and deploy cutting edge analytical solutions to strengthen our strategy across Marketing, Sales, Operations, Finance, and Product in a fast-paced healthcare tech startup\nEffectively partner across teams, within and outside of analytics, to translate raw data into business impact\nCreate self-service dashboards and automated data reporting solutions\nDefine and monitor critical metrics and KPIs to track success, outcomes, and impact\nPresent insights and strategize with leadership on the direction of the business and areas of opportunity\nOwn solutions from start to finish\nBe a part of a cutting-edge, fast-growing team", "qualifications": {"required": "3+ years of quantitative analytics experience with experience in SQL, dbt, and Python-based analytical libraries\n3+ years professional experience in building and maintaining Tableau dashboards\nBachelor’s degree in Mathematics, Statistics, Computer Science, Engineering, Economics or a related discipline. Master’s degree is a plus\nStrong problem-solving skills and ability to work in a fast-paced dynamic startup environment\nExcellent communication and presentation skills\nPassionate about transforming the US health insurance industry through transparency", "preferred": "Experience with Snowflake, Salesforce, and NetSuite is a plus\nExperience in health insurance regulatory reporting is a plus"}, "skills": ["SQL", "dbt", "Python", "Tableau", "Snowflake", "Salesforce", "NetSuite"], "postedDate": "2 weeks ago", "benefits": "Competitive salary, bonus opportunity, and equity package\nComprehensive Medical, Dental, and Vision benefits\nA 401k retirement plan\nPaid vacation and company holidays\nOpportunity to make an impact at a rapidly growing mission-driven company transforming healthcare in the U.S.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3995320704"}