{"jobTitle": "Export Specialist, Customs Bonded Warehouse", "company": {"name": "ExecuSource", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "85k - $100k", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Accounting and Financial Services", "description": "Export Specialist,<br/><br/>Customs Bonded Warehouse<br/><br/><strong>Location: Los Angeles, CA<br/><br/></strong><strong>Pay: $85k - $100k + bonuses<br/><br/></strong><strong>Schedule: On-site Monday to Friday, 9am to 6pm, with some flexibility<br/><br/></strong>Our client is a global supply chain provider with multiple locations. Due to growth, they are looking for you, an experienced Export Specialist, Customs Bonded Warehouse. This administrative professional role requires a clear understanding of US customs regulations and documentation required for importing goods into a ** Bonded ** Warehouse facility and managing the bonded inventory levels and any associated transactions.<br/><br/><strong>What You Get To Do<br/><br/></strong><ul><li>Plan and oversee the daily operations of a Customs and Border Protection (CBP) monitored Bonded Warehouse to ensure goals and objectives are achieved. </li><li>Design, implement and maintain processes for the flow of inventory into and out of the Bonded Warehouse, following all applicable laws and regulations. </li><li>Design a program to market Bonded Warehouse services to potential customers and grow the bonded business operation. <br/><br/></li></ul><strong>What you need to succeed:<br/><br/></strong><ul><li>Bachelor’s degree </li><li>Extensive knowledge of Bonded operations and supply chain management </li><li>Import/Export Compliance knowledge </li><li>Knowledge of freight forwarding drayage and customs clearance <br/><br/></li></ul><strong>What’s in it for you:<br/><br/></strong><ul><li>Outstanding benefits package includes: health, dental, vision insurance, 401K with automatic company contribution, pension plan, 3 weeks of PTO + additional time with tenure, tuition reimbursement and more! </li><li>Outstanding culture includes: Entrepreneurial spirit! Family values! Collaboration! Vision! Leadership! Agility! Growth! <br/><br/></li></ul><strong>Apply now! One of our recruiters will review your profile and we will be in contact if you qualify!<br/><br/></strong>#MISC123", "responsibilities": "Plan and oversee the daily operations of a Customs and Border Protection (CBP) monitored Bonded Warehouse to ensure goals and objectives are achieved. Design, implement and maintain processes for the flow of inventory into and out of the Bonded Warehouse, following all applicable laws and regulations. Design a program to market Bonded Warehouse services to potential customers and grow the bonded business operation.", "qualifications": {"required": "Bachelor’s degree Extensive knowledge of Bonded operations and supply chain management Import/Export Compliance knowledge Knowledge of freight forwarding drayage and customs clearance"}, "skills": ["Supply Chain Management", "Customs", "Import/Export", "Freight Forwarding", "Bonded Warehouse"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995990918"}