{"jobTitle": "Director, Human Resources Business Partner", "company": {"name": "Kaiser Permanente", "location": "Los Angeles, CA", "industry": "Hospitals and Health Care"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources", "industry": "Hospitals and Health Care", "description": "<strong>Job Summary<br/><br/></strong>This director level position is primarily responsible for serving as a strategic partner with executive/senior leaders to influence and guide the development and deployment of strategies, programs, policies, and procedures, ensuring human resources support activities are aligned with the overall business strategy, and overseeing the implementation of organizational change efforts.<br/><br/>This position directs and/or partners in the oversight of employee and/or labor relations activities, directs and/or partners on complex HR investigations based on standard KP or negotiated labor practices, oversees complex reporting of Company employee information and external benchmarks, and directs activities and initiatives to ensure continued regulatory compliance for multiple business functions.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><ul><li>Demonstrates continuous learning and maintains a highly skilled and engaged workforce by aligning resource plans with business objectives; overseeing the recruitment, selection, and development of talent; motivating teams; preparing individuals for growth opportunities and advancement; staying current with industry trends, benchmarks, and best practices; providing guidance when difficult decisions need to be made; and ensuring performance management guidelines and expectations drive business needs. </li><li>Oversees the operation of multiple units and/or departments by identifying customer and operational needs; analyzing resources, costs, and forecasts and incorporating them into business plans; gaining cross-functional support for business plans and priorities; translating business strategy into actionable business requirements; obtaining and distributing resources; setting standards and measuring progress; removing obstacles that impact performance; guiding performance and developing contingency plans accordingly; and ensuring products and/or services meet customer requirements and expectations while aligning with organizational strategies. </li><li>Serves as a strategic partner with executive/senior leaders to influence and guide the development and deployment of strategies, programs, policies, and procedures by reviewing organizational data and processes to identify impact of trends, root causes, and potential solutions to HR issues; delivering data driven recommendations on HR efforts; partnering with leaders to ensure solutions are aligned with both HR and business objectives; evaluating HR impact in consideration of changing business strategies; and overseeing relationships between HR Centers of Excellence and business stakeholders. </li><li>Ensures human resources support activities are aligned with the overall business strategy by overseeing the execution of support to internal and external stakeholders on diverse HR specialties (e.g., equal opportunity/affirmative action, disability management, recruitment and hiring options, compensation, employee benefits, training); reviewing and approving human resources activities; identifying and leveraging additional resources and expertise; and ensuring human resources activities are fully documented. </li><li>Oversees the implementation of organizational change efforts by identifying requirements; assessing information to identify solutions to obstacles and mitigating risks; consulting with and communicating change management strategy to internal and external stakeholders and vendors; providing input in the creation or revision of change management plans; developing communications; communicating regional differences at a national level; and monitoring ongoing impact of organizational changes or efforts on employees. </li><li>Directs and/or partners in the oversight of employee and/or labor relations activities by ensuring team members provide specialized consultation on employee relations (e.g., performance management, employee discipline issues); analyzing and reviewing research and providing recommendations and assistance on employment related regulations both at the State and Federal level; serving as a point of advice, problem resolution, and facilitation for escalated employee relations issues; advising employees and management regarding employee relations policies, procedures, and documentation; managing the research, identification and analysis of employee relations concerns; managing arbitration and negotiation efforts; and defining problem resolution strategies. </li><li>Directs and/or partners on complex HR investigations based on standard KP or negotiated labor practices by overseeing the collection and analysis of quantitative and qualitative data; conducting interviews on escalated issues; reviewing and evaluating research on key business issues; ensuring the creation of appropriate documentation; and evaluating and recommending corrective action plans for substantiated allegations. </li><li>Oversees complex reporting of Company employee information and external benchmarks by reviewing, and interpreting reports and analyses; identifying key insights to develop solutions for diverse HR issues; and partnering in the design and implementation of new metrics or reports. </li><li>Directs activities and initiatives to ensure continued regulatory compliance for multiple business functions by staying abreast of, interpreting, and designing strategy around regulatory changes; determining the impact of changes to the business; providing direction on implementation of changes throughout the business; and providing regulatory input before and during inspections to minimize the risks of future non-compliance. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Minimum five (5) years experience in a leadership role with or without direct reports, including at least 2 years formal supervisory experience. </li><li>Bachelors degree in Human Resources, Business, Social Science, Public Administration or related field and Minimum ten (10) years experience in human resources or business operations. Additional equivalent work experience in a directly related field may be substituted for the degree requirement.</li></ul>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995845503"}