{"jobTitle": "REMOTE - Accountant", "company": {"name": "Platinum Resource Group", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "<strong>REMOTE – Sr. Accountant<br/><br/></strong>Location; Remote, US<br/><br/><strong>Job Description<br/><br/></strong><ul><li> Execution of daily, monthly and quarterly operational tasks, including system to system reconciliations, review of system errors and manual intervention to resolve. </li><li> Process journal entries. </li><li> Prepare wire payments. </li><li> Record cash transactions. </li><li> Process cash receipts, disbursements, and wires. </li><li> User acceptance testing of accounting transactions to push new system features into production. </li><li> Coordination and business partner of operational and technology teams. </li><li> System reconciliations, review of system errors, and manual intervention to resolve. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Strong operational experience. </li><li> Insurance accounting background or knowledge a plus. </li><li> Prior use of PeopleSoft general ledger a plus. </li><li> Strong excel skills required. </li><li> Must have: Essbase / Smartview query, OAC queries, Narrative reporting. </li><li> Accounting degree a plus. <br/><br/></li></ul><em> Platinum Resource Group is a professional level consulting firm, providing resources to Fortune 1000 client companies in the areas of technology, human resources, accounting, finance, business systems and supply chain, on a contract and interim basis. PRG has operations in Orange County, San Diego, Los Angeles, and San Francisco. As a W-2 employer we offer our consultants direct deposit bi-weekly payroll, health, dental, vision benefits, paid holidays, and referral bonuses.</em>", "responsibilities": "Execution of daily, monthly and quarterly operational tasks, including system to system reconciliations, review of system errors and manual intervention to resolve. Process journal entries. Prepare wire payments. Record cash transactions. Process cash receipts, disbursements, and wires. User acceptance testing of accounting transactions to push new system features into production. Coordination and business partner of operational and technology teams. System reconciliations, review of system errors, and manual intervention to resolve.", "qualifications": {"required": "Strong operational experience.", "preferred": "Insurance accounting background or knowledge a plus. Prior use of PeopleSoft general ledger a plus. Strong excel skills required. Must have: Essbase / Smartview query, OAC queries, Narrative reporting. Accounting degree a plus."}, "skills": ["Essbase", "Smartview", "OAC", "PeopleSoft", "Excel"], "postedDate": "2 weeks ago", "benefits": "As a W-2 employer we offer our consultants direct deposit bi-weekly payroll, health, dental, vision benefits, paid holidays, and referral bonuses.", "remoteWork": "Yes", "salary": {"amount": "102.11/hr - 116.20/hr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3995985733"}