{"jobTitle": "Distribution Center Supervisor", "company": {"name": "Goodwill Southern California", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$68,000.00/yr - $70,000.00/yr", "currency": "USD"}, "jobFunction": "Distribution, Product Management, and Purchasing", "industry": "Retail", "description": "The Supervisor at Goodwill SoCal's Riverside Distribution Center oversees new merchandise and corporate donations. This role supervises the daily operations of the purchased product distribution center team, ensuring accurate receiving and shipping records. The Supervisor monitors productivity and inventory levels to control expenses, minimizes losses, and maximizes revenue and collaborates closely with distribution supervisors and leads team to maintain a safe and efficient facility.", "responsibilities": "Oversee daily receiving, sorting, storage, picking and packing of purchased product and corporate donations, ensuring efficient output for product demand\nEstablish and monitor daily department and individual goals for purchased products and corporate donations, ensuring targets are consistently met.\nContinuously identify and share ideas for process improvements with the Buyer/Planner to enhance overall efficiency and effectiveness.\nMaintain accurate inventory levels through regular physical counts, reconciling discrepancies with the Buyer/Planner.\nEnsure all pricing labels on purchased products are accurate and up to date before distribution to store locations.\nMonitor department supplies and inform Buyer/Planner when replenishments are needed.\nInspect inbound purchased product/corporate donations shipments for accuracy and product defects, reporting findings to the Buyer/Planner.\nEnforce safety standards, maintaining a safe, clean, and organized area that adheres to standard operational procedures.\nLead by example, ensuring procedures and best practices are consistently followed to optimize operations and reduce errors.\nLead department activities, including palletizing, wrapping, and routine cycle counting. \nDrive a motivated and efficient team by providing effective coaching, feedback, and encouragement.\nMaintain open communication with center supervisors and leads to ensure company programs and initiatives are supported and concerns communicated in a collaborative way.\nLocal travel (25%); maintain a valid driver’s license and state-required auto insurance, with driving records that meet the company’s insurance standards.", "qualifications": {"required": "5+ years of warehouse or distribution center experience.\n2 - 3 years of supervisory experience in a warehouse or distribution center environment preferred.\nHigh school diploma or general education degree (GED) required.\nExperience with inventory control, inventory reconciliation, and cycle counting and familiar with a variety of the distribution concepts, practices, and procedures.\nExperience operating manual and electric pallet jacks, and walkie, standard and high reach forklifts.\nStrong, data driven decision making and proactive approach to problem-solving and creating solutions.\nStrong communication, interpersonal skill, leadership, and conflict resolution.\nStrong knowledge of modern warehousing practices and methods.\nDemonstrated ability to motivate a team, plan & accomplish goals.\nAbility to stand, swoop, bend, and lift up to 50 lbs.\nBi-lingual in Spanish preferred.\nHigh degree of ethics and integrity.\nBackground, Drug Screen, MVR required.", "preferred": ""}, "skills": ["Warehouse", "Distribution Center", "Inventory Control", "Inventory Reconciliation", "Cycle Counting", "Pallet Jack", "Forklift", "Decision Making", "Problem Solving", "Communication", "Interpersonal Skills", "Leadership", "Conflict Resolution", "Warehousing Practices", "Team Motivation", "Goal Planning", "Spanish"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Tuition assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995415560"}