{"jobTitle": "Coordinator, Operations and Player Relations (Japan)", "company": {"name": "Wasserman", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "Wasserman is forever committed to serving our clients, colleagues and community with exceptional insight, influence and creativity, while making a positive and lasting impact. We support our employees’ professional aspirations, with a rich internal culture where curiosity is rewarded. We offer our people multiple learning and development programs throughout the world. What we do is fast-paced, exciting and rewarding which is why we love it and why you’ll love life at Wasserman.<br/><br/><strong>Join our team today!<br/><br/></strong><strong>Job Description<br/><br/></strong>Wasserman operates at the epicenter of sports, music, entertainment and culture, serving talent, brands and properties on a global scale. Wasserman works with iconic sports and media figures across the world in every major sport, utilizing our extensive influence to maximize negotiations and create meaningful opportunities for our clients across teams, leagues, brands, content and live events.<br/><br/>Headquartered in Los Angeles, Wasserman's presence spans 27 countries and more than 66 cities, including New York, London, Abu Dhabi, Amsterdam, Hong Kong, Madrid, Mexico City, Toronto, Paris and Sydney. For more information, please visit www.teamwass.com.<br/><br/>Job Purpose: This bilingual position is responsible for supporting the day-to-day needs of clients, senior-level agents, and talent marketing leadership, helping to accomplish client related sales, media, and marketing efforts. This includes talent sales, branding, public relations, digital marketing, social media, and content development, as well as participating in new business development efforts. This position also recruits and retains top baseball talent and acts as a representative for professional athletes in various types of work including but not limited to, advice and representation concerning team contracts, endorsement deals, charitable endeavors, camps, and public appearances. This position may represent clients, but this position typically does not manage clients directly without the involvement and supervision of an Executive Vice President or division COO or other senior-level agent with more extensive experience. This position will offer assistance to these agents with negotiations but is generally not the lead on such actions.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Recruits professional athletes generally under the supervision of a senior-level agent by projecting the athlete’s eventual value in the marketplace, creating design materials to present to the athlete/coach/family, determining the strategy to contact the relevant parties of the athlete, and cultivating relationships with the goal of signing the client for the agency.</li><li>Assists with securing playing and commercial endorsement opportunities to aid in client’s personal and professional development.</li><li>Works with internal team to assist with the negotiation of contracts between a player and a team to include duration and salary requirements. Summarizes the athlete’s salary and benefit requirements when negotiating contracts and finding endorsements; has a clear vision of the athlete’s future and how any given contract might affect it. Analyzes contracts to determine if there are any risks with the contract, such as loss of salary if the athlete gets injured.</li><li>Performs constant networking, recruiting, socializing, and marketing through contacts, resources, advertisers, and various key stakeholders.</li><li>Handles many aspects of the athlete’s personal and commercial life, on a daily basis, so that the athlete may stay focused on achieving top performance in the sport.</li><li>Assist marketing leadership with managing relationships with existing partners; ensures the client’s contracts are fulfilled; approves marketing and advertising materials.</li><li>Handle logistics leading up to and throughout major events, including drafts, Pro Bowls, and Super Bowls</li><li>Prepare invoices, reports, memos, letters, financial statements and other documents, using Word, Excel spreadsheets, or presentation software. Maintain department databases and generate reports as required.</li><li>Perform administrative tasks including file management, sponsorship invoicing, player equipment, etc.</li><li>Travels, both domestically and internationally, to spend face time with clients to support “off field” business affairs and build genuine relationships to assist in client retention.</li><li>Other duties as needed, which are miscellaneous and geared to keep the client satisfied and convinced that the agent has only the client’s best interests in mind.</li><li>Plan travel itineraries, coordinate related arrangements, gather information and determine and negotiate complex scheduling issues; prepare expense reports.</li><li>Handle company, staff, and client personal matters with discretion.<br/><br/></li></ul><strong>Skills And Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in related field</li><li>Must be bilingual in Japanese/English</li><li>Must have valid passport to facilitate international travel requirements</li><li>Must have advanced knowledge of developments in social media, corporate communications, and trends in the sports industry</li><li>Possess persuasiveness skills to successfully negotiate on behalf of the client’s interests</li><li>Position requires considerable flexibility in scheduling and the willingness to travel, work nights, weekends and holidays</li><li>Demonstrable competency in sales and business development</li><li>Thorough knowledge of sports industry principles</li><li>Outstanding organizational and leadership abilities</li><li>Excellent interpersonal and communication skills and ability to speak naturally to talent, teams and executives alike</li><li>Aptitude in decision-making and problem-solving</li><li>Entrepreneurial approach with ability to be a team player on all levels of the organization</li><li>Self-starter with the need and resolve to succeed in a highly competitive market</li><li>Works well under pressure and in a fast-paced environment</li><li>Highly motivated with extensive skills in prospecting and developing new clients, angles and leads</li><li>Advanced computer application skills</li><li>Proven ability to interact with all types of people and demographics</li><li>Displays indications of being loyal and trustworthy with the organization and clients</li><li>Demonstrates project management skills and ability to manage multiple priorities<br/><br/></li></ul><em>Wasserman does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.</em>", "responsibilities": "Recruits professional athletes generally under the supervision of a senior-level agent by projecting the athlete’s eventual value in the marketplace, creating design materials to present to the athlete/coach/family, determining the strategy to contact the relevant parties of the athlete, and cultivating relationships with the goal of signing the client for the agency.\nAssists with securing playing and commercial endorsement opportunities to aid in client’s personal and professional development.\nWorks with internal team to assist with the negotiation of contracts between a player and a team to include duration and salary requirements. Summarizes the athlete’s salary and benefit requirements when negotiating contracts and finding endorsements; has a clear vision of the athlete’s future and how any given contract might affect it. Analyzes contracts to determine if there are any risks with the contract, such as loss of salary if the athlete gets injured.\nPerforms constant networking, recruiting, socializing, and marketing through contacts, resources, advertisers, and various key stakeholders.\nHandles many aspects of the athlete’s personal and commercial life, on a daily basis, so that the athlete may stay focused on achieving top performance in the sport.\nAssist marketing leadership with managing relationships with existing partners; ensures the client’s contracts are fulfilled; approves marketing and advertising materials.\nHandle logistics leading up to and throughout major events, including drafts, Pro Bowls, and Super Bowls\nPrepare invoices, reports, memos, letters, financial statements and other documents, using Word, Excel spreadsheets, or presentation software. Maintain department databases and generate reports as required.\nPerform administrative tasks including file management, sponsorship invoicing, player equipment, etc.\nTravels, both domestically and internationally, to spend face time with clients to support “off field” business affairs and build genuine relationships to assist in client retention.\nOther duties as needed, which are miscellaneous and geared to keep the client satisfied and convinced that the agent has only the client’s best interests in mind.\nPlan travel itineraries, coordinate related arrangements, gather information and determine and negotiate complex scheduling issues; prepare expense reports.\nHandle company, staff, and client personal matters with discretion.", "qualifications": {"required": "Must be bilingual in Japanese/English\nMust have valid passport to facilitate international travel requirements\nMust have advanced knowledge of developments in social media, corporate communications, and trends in the sports industry\nPossess persuasiveness skills to successfully negotiate on behalf of the client’s interests\nPosition requires considerable flexibility in scheduling and the willingness to travel, work nights, weekends and holidays\nDemonstrable competency in sales and business development\nThorough knowledge of sports industry principles\nOutstanding organizational and leadership abilities\nExcellent interpersonal and communication skills and ability to speak naturally to talent, teams and executives alike\nAptitude in decision-making and problem-solving\nEntrepreneurial approach with ability to be a team player on all levels of the organization\nSelf-starter with the need and resolve to succeed in a highly competitive market\nWorks well under pressure and in a fast-paced environment\nHighly motivated with extensive skills in prospecting and developing new clients, angles and leads\nAdvanced computer application skills\nProven ability to interact with all types of people and demographics\nDisplays indications of being loyal and trustworthy with the organization and clients\nDemonstrates project management skills and ability to manage multiple priorities", "preferred": "Bachelor’s degree in related field"}, "skills": ["Social Media", "Corporate Communications", "Sports Industry", "Sales", "Business Development", "Leadership", "Communication", "Decision Making", "Problem Solving", "Project Management"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995527664"}