{"jobTitle": "Aircraft Detailing Supervisor - Van Nuys, CA", "company": {"name": "Immaculate Flight", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$66,560", "currency": "USD"}, "jobFunction": "Other", "industry": "Internet Publishing", "description": "Type - Full Time<br/><br/>Pay - $66,560 per year<br/><br/>Shift - Open/flexible availability is desired (Monday to Sunday)<br/><br/>Location - Van Nuys <strong>Airport (VNY)</strong> as your base location and travel to surrounding Immaculate Flight locations with the use of a company vehicle<br/><br/><strong>Company Overview -<br/><br/></strong>Immaculate Flight is the nation's largest privately-owned aircraft detailing company. We take pride in developing our people into the leaders of tomorrow. It truly is our culture. It truly is who we are! We are certainly in business to grow and consistently create the standard in aircraft detailing, but we get our most immense pleasure from seeing our people grow and improve their quality of life. We get to know our teammates as people, not employees! We train you to be part of a strong bench for tomorrow's growth. If you are looking for an excellent job with career opportunities and want to work with a great leader/coach, continue reading. We would truly enjoy having you on our team! Growth, development, and advancement are available to any motivated teammate!<br/><br/><strong>Job Summary -<br/><br/></strong>As an aircraft detailer, you will be tasked with detailing high-end luxury aircraft as well as face-to-face interaction with Immaculate Flight’s various clients. Your job duties will require you to perform cleaning tasks on/in/around corporate and/or commercial aircraft. Executed labor includes polishing of brightwork, paint polishes, and sealants, as well as duties involving the cleaning of passenger cabins, lavatories, cockpits, and aircraft exteriors. You must be comfortable and physically able to work in various climates, weather conditions, on ladders, and work stands at various heights. As a Supervisor, you will assist with the overall day-to-day operations in your location, ensuring safety compliance, quality control, execution of standard operating procedures and implementation of the organization’s mission and talent strategy for your location. Partners with the Operations Manager to ensure successful and efficient daily execution of company-wide operations to deliver best-in-class service to our clients.<br/><br/>Responsibilities -<br/><br/><ul><li>Detail interior and exterior of aircraft</li><li>Complete all training modules and assignments</li><li>Ensure quality control through pre and post checklists</li><li>Collaborates to ensure work environments are adequate and safe</li><li>Train and coach teammates based on company SOPs</li><li>Assist Operations Manager with administrative duties and tasks</li><li>Be the point of contact for quality control</li><li>Daily audit of employee’s time sheets</li><li>Monitor staffing levels</li><li>Communicate work orders, messages, and emails from your Operations Manager, Scheduling Department, and Office Personnel</li><li>Oversee inventory and supplies to assist with product ordering</li><li>Ensure Feet Maintenance, Inspections, WEX are all up to standard</li><li>Conduct weekly and monthly audits as assigned in KPA</li><li>Report to Operations Manager</li><li>Job duties may expand as experience grows!<br/><br/></li></ul>Education &amp; Experience -Immaculate Flight has a training and development program that sets you up for success. While detailing experience is good, we will give anyone the knowledge and confidence needed to perform the job. *1 + years of internal experience preferred *2 - 5 years of supervisory experience preferred<br/><br/><strong>Required Skills &amp; Abilities -<br/><br/></strong><ul><li>Must be able to work well with other and maintain professionalism with our clients</li><li>High level of interpersonal and verbal communication skills</li><li>Pass a background check</li><li>Pass pre-employment drug screen</li><li>Pass random drug screens throughout employment</li><li>Legally eligible for US employment through E-Verify</li><li>Maintain a valid driver's license</li><li>Reliable transportation 24/7</li><li>Maintain a great attendance record, as well as being punctual</li><li>Ability to work physical labor in a fast-paced environment</li><li>High attention to detail</li><li>Ability to work on ladders and various heights</li><li>Ability to physically bend, lift and crouch often</li><li>Ability to stand on your feet for extended periods of time</li><li>To comply with the ADA, you have been informed that this position will require some repetitive, circular arm motions and will not be required to lift more than 50 pounds without the use of equipment aid<br/><br/></li></ul>Benefits -<br/><br/><ul><li>The first of the month following 30 days of employment, all full time employees will be eligible for a benefits package that will include Health, Dental, and Vision care</li><li>All full time employees receive $25,000 in Life Insurance on day one at no cost</li><li>All full time employees are offered short and long term disability insurance at no cost</li><li>Paid Time Off (PTO) will begin accruing at hire and can be used starting the first day of hire</li><li>Paid Sick Leave will be available in accordance to state law</li><li>Company matched 401K plan (available after 1 full year of employment)<br/><br/></li></ul>EQUAL EMPLOYMENT OPPORTUNITY STATEMENT<br/><br/>Immaculate Flight provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Immaculate Flight complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has locations. This policy applies to all terms and conditions of employment, including, but not limited to: the hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. Immaculate Flight expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.<br/><br/>Powered by JazzHR<br/><br/>v7dfFfGOPH", "responsibilities": "<ul><li>Detail interior and exterior of aircraft</li><li>Complete all training modules and assignments</li><li>Ensure quality control through pre and post checklists</li><li>Collaborates to ensure work environments are adequate and safe</li><li>Train and coach teammates based on company SOPs</li><li>Assist Operations Manager with administrative duties and tasks</li><li>Be the point of contact for quality control</li><li>Daily audit of employee’s time sheets</li><li>Monitor staffing levels</li><li>Communicate work orders, messages, and emails from your Operations Manager, Scheduling Department, and Office Personnel</li><li>Oversee inventory and supplies to assist with product ordering</li><li>Ensure Feet Maintenance, Inspections, WEX are all up to standard</li><li>Conduct weekly and monthly audits as assigned in KPA</li><li>Report to Operations Manager</li><li>Job duties may expand as experience grows!<br/><br/></li></ul>", "qualifications": {"required": "Must be able to work well with other and maintain professionalism with our clients\nHigh level of interpersonal and verbal communication skills\nPass a background check\nPass pre-employment drug screen\nPass random drug screens throughout employment\nLegally eligible for US employment through E-Verify\nMaintain a valid driver's license\nReliable transportation 24/7\nMaintain a great attendance record, as well as being punctual\nAbility to work physical labor in a fast-paced environment\nHigh attention to detail\nAbility to work on ladders and various heights\nAbility to physically bend, lift and crouch often\nAbility to stand on your feet for extended periods of time\nTo comply with the ADA, you have been informed that this position will require some repetitive, circular arm motions and will not be required to lift more than 50 pounds without the use of equipment aid<br/><br/>", "preferred": "1 + years of internal experience preferred\n2 - 5 years of supervisory experience preferred"}, "skills": ["Communication", "Quality Control", "Training", "Inventory Management", "Teamwork", "Customer Service", "Detailing", "Supervisory Experience"], "postedDate": "2 weeks ago", "benefits": "<ul><li>The first of the month following 30 days of employment, all full time employees will be eligible for a benefits package that will include Health, Dental, and Vision care</li><li>All full time employees receive $25,000 in Life Insurance on day one at no cost</li><li>All full time employees are offered short and long term disability insurance at no cost</li><li>Paid Time Off (PTO) will begin accruing at hire and can be used starting the first day of hire</li><li>Paid Sick Leave will be available in accordance to state law</li><li>Company matched 401K plan (available after 1 full year of employment)<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995127555"}