{"jobTitle": "Principal Buyer", "company": {"name": "City of Santa Monica", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Strategy/Planning, Purchasing, and Distribution", "industry": "Architecture and Planning and Warehousing and Storage", "description": "<strong>Job Summary<br/><br/></strong>Under general supervision, supervises, organizes, reviews, evaluates, and participates in the work of assigned staff involved in procuring materials, supplies, services, and equipment; develops, reviews, and evaluates complex bids, requests for proposals, and contracts for City departments; and provides highly-responsible and complex assistance to the Procurement Manager.<br/><br/><strong>Representative Duties<br/><br/></strong>Supervises and mentors an assigned team of purchasing professionals, including assigning, planning, coordinating, and reviewing work; evaluating work performance and completing performance evaluations; maintaining work standards; assisting in new employee selection and hiring; recommending and implementing employee discipline; and providing training and assistance on tools and processes as needed.<br/><br/>Recommends and assists in the implementation of division goals and objectives; participates in the development of Citywide purchasing policies and procedures; and provides highly-responsible and complex assistance to the manager.<br/><br/>Provides professional procurement consultation, assistance, and training to City employees at all organizational levels.<br/><br/>Assigns requisitions to other buyers and approves routine requisitions and purchase orders in the absence of the manager; and establishes schedules and methods for the performance of professional procurement duties including a system of metrics.<br/><br/>Implements policies and procedures related to procurement systems.<br/><br/>Evaluates operations, activities, and assigned responsibilities and recommends improvements.<br/><br/>Prepares various reports on operations and activities.<br/><br/>Implements a strategic and comprehensive procurement plan.<br/><br/>Prepares Request for Proposals (RFPs), advertising, and posting requirements.<br/><br/>Processes complex procurement activities in compliance with established laws, ordinances, policies, and ethical principles.<br/><br/>Determines appropriate methods of procurement.<br/><br/>Assists end users with the development of specifications and develops terms and conditions.<br/><br/>Solicits competitive bids; identifies and selects suppliers and monitors supplier performance; evaluates and analyzes bids and proposals; and negotiates and develops contracts.<br/><br/>Manages bid distribution including plan holder lists, addenda, and other contract modifications.<br/><br/>Oversees and conducts bid openings, job walk-throughs, and pre-bid/proposal conferences; and meets with consultants, vendors, and end users.<br/><br/>Prepares detailed and complex written reports and makes recommendations to management and City Council.<br/><br/>Arranges vendor demonstrations and/or interviews for products or services offered to the City.<br/><br/>Serves as the division representative at various meetings; and may assume the duties of the Procurement Manager in his/her absence.<br/><br/>Supports contract negotiation and the development of contract strategy.<br/><br/><strong>Requirements<br/><br/></strong>Performs other duties as required.<br/><br/><strong>Knowledge Of<br/><br/></strong><strong> KNOWLEDGE, SKILLS, AND ABILITIES <br/><br/></strong>Principles and practices of supervision, training, and performance evaluation<br/><br/>Principles and practices of safety management<br/><br/>Pertinent local, State and federal laws, ordinances, and rules<br/><br/>Grant funding requirements at the federal, State and local level as they apply to procurement<br/><br/>Public works bidding requirements in the State of California<br/><br/>Accounts payable procedures and practices<br/><br/>Principles and practices of customer service<br/><br/>Methods of developing contracts and/or service agreements, leases, or other written legal agreements<br/><br/>Market and economic trends and conditions that affect procurements<br/><br/>Industry standards and practices for delivering products and services<br/><br/>Contract development and administration practices<br/><br/>Office methods, procedures, software, and equipment<br/><br/>Purchasing methods and procedures, contract development, and sources of supply.<br/><br/>Principles and practices of bid review<br/><br/>City policies and procedures related to the procurement of supplies, materials, and professional and contractual services<br/><br/><strong>Ability To<br/><br/></strong>Select, motivate, and train staff<br/><br/>Plan, coordinate, and evaluate staff work<br/><br/>Organize, implement, and direct procurement activities<br/><br/>Interpret and explain pertinent City and department policies and procedures<br/><br/>Prepare a variety of technical and administrative reports and correspondence<br/><br/>Write complex bid documents, specifications, contracts, and reports<br/><br/>Analyze and compare complex or detailed quotations, bids, and proposals<br/><br/>Identify applicable contract elements based on product/service being purchased<br/><br/>Negotiate contracts for the acquisition of supplies, materials, equipment, and services<br/><br/>Develop objectives and measures to evaluate supplier performance<br/><br/>Understand and comply with all legal requirements for the advertisement of bids<br/><br/>Prepare draft reports to Council recommending bid and contract awards<br/><br/>Apply good judgment and make sound purchasing decisions<br/><br/>Understand and comply with all federal, State and local laws, policies, procedures and regulations relevant to each purchase<br/><br/>Maintain records, logs, and databases<br/><br/>Operate a computer using word processing and business software and other office equipment<br/><br/>Establish, maintain, and promote positive and effective working relationships with employees, other agencies, and the public<br/><br/>Communicate effectively, orally and in writing<br/><br/>Work independently and as a team member; recognize and set priorities; and meet deadlines<br/><br/>Observe safety principles and work in a safe manner<br/><br/><strong>Requirements<br/><br/></strong><strong>Minimum Qualifications:<br/><br/></strong><strong>Option A<br/><br/></strong>Graduation from an accredited college or university with a bachelor's degree in purchasing, accounting, marketing, public administration, business administration, or related field; AND<br/><br/>Four years of increasingly responsible purchasing experience involving the preparation of bid solicitation documents, specifications, and reports for highly complex purchases, including two years of supervisory and/or lead supervisory experience. One year of supervisory and/or lead experience and successful completion of the City of Santa Monica's Pre-Supervisory Academy may substitute for the required two years of supervisory or lead experience.<br/><br/><strong>Option B<br/><br/></strong>Graduation from an accredited college or university with any bachelor's degree; AND<br/><br/>Five years of increasingly responsible purchasing experience involving the preparation of bid solicitation documents, specifications, and reports for highly complex purchases, including two years of supervisory and/or lead supervisory experience. One year of supervisory and/or lead experience and successful completion of the City of Santa Monica's Pre-Supervisory Academy may substitute for the required two years of supervisory or lead experience.<br/><br/><strong>Licenses And Certificates<br/><br/></strong>Possession of or the ability to obtain and maintain a valid Class C driver license or the ability to utilize an alternative method of transportation when needed to carry out job-related essential functions.<br/><br/>Certification as a Public Purchasing Buyer (CPPB), Accredited Purchasing Practitioner (APP), Certified Professional Purchaser (CPP), or equivalent certification is desirable but not required.<br/><br/><strong>Supplemental Information<br/><br/></strong><strong>How To Apply<br/><br/></strong>Applicants must submit a clear, concise, completed on-line City Application along with any required supplemental application materials with the Human Resources Department by the filing deadline. If you do not submit your on-line application by the filing deadline, you will not be considered for this position. Please note, applications may be rejected if incomplete. Resumes, CVs and cover letters are not reviewed as part of the application screening process.<br/><br/>If you would like for your education to be considered, you must attach a copy of your college level transcripts or diploma to your online application. Applicants who indicate receipt of college level coursework or degree from a foreign institution must provide United States credential equivalency verification along with a copy of your college diploma/transcripts. All materials must be received in the Human Resources Department no later than the filing deadline. Failure to do so may result in your application being evaluated without the education being considered.<br/><br/><strong>Selection Process<br/><br/></strong>All applicants must submit clear, concise and complete information regarding your work history and qualifications for the position. All applicants will be reviewed and only those applicants determined to be most qualified on the basis of experience, training and education, as submitted, will be invited to participate further in the selection process.<br/><br/>Testing may consist of a combination of any of the following and is subject to change as needs dictate:<br/><br/>Training and Experience Evaluation<br/><br/>Writing Project<br/><br/>Oral Interview<br/><br/>If three or more qualified City employees apply and pass the examination, a promotional list will be established in addition to an open-competitive list. If fewer than three qualified City employees pass the examination, the appointing authority, in accordance with the City's civil service rules and regulations, can decline to use a promotional list, in which case a promotional list will not be established for this position.<br/><br/><strong>Background Investigation<br/><br/></strong>Candidates who have successfully completed all prior phases of the selection process will be subject to a thorough background investigation.<br/><br/><strong> Inclusion &amp; Diversity Statement <br/><br/></strong>The City of Santa Monica is a progressive, inclusive and culturally rich community. As leaders in public service, we strive to be an employer of choice by attracting and retaining a highly talented workforce where people of diverse races, religions, cultures and lifestyles thrive. Our goal is to create a welcoming and inclusive environment where our staff are empowered to perform at their highest level and where their differences make a positive impact.<br/><br/>The City is an equal opportunity employer and strives to build balanced teams from all walks of life without regard to race, color, ethnicity, religion, national origin, age, sex, sexual orientation, gender identity, marital status, ancestry, disability, genetic information, veteran status, or any other status protected under federal, state and/or local law. We aim to create a workplace that celebrates and embraces the diversity of our employees. Join us!<br/><br/>Special assistance with the application and examination process is available, upon request, for persons with disabilities. Call (310) 458-8246, TDD (310) 458-8696 (Hearing Impaired Only).<br/><br/>Please note the request for reasonable accommodations must be made to Human Resources at least three work days prior to the examination.<br/><br/><strong>Working Conditions<br/><br/></strong>Work is performed primarily indoors in a home or work office setting, in accordance with the City’s Telework/Flexible Workplace Policy, with frequent interruptions, requiring frequent sitting for prolonged periods and use of a keyboard and screen. Work involves frequently changing work priorities and the ability to meet deadlines. There will be off-site assignments and meetings. On occasion, work will be required in the evening and on weekends.<br/><br/>The City's liberal fringe benefits for full-time employment include sick leave, holiday and vacation pay, the Public Employees Retirement System, medical, dental and vision insurance, credit union, deferred compensation, tuition reimbursement, Dependent Care Assistance Plan and Marine Park Childcare Center.<br/><br/>Closing Date/Time: 8/22/2024 5:30 PM Pacific", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995527637"}