{"jobTitle": "Road Supervisor", "company": {"name": "MV Transportation", "industry": "Ground Passenger Transportation", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$33/hour", "currency": "USD"}, "jobFunction": "Other", "industry": "Ground Passenger Transportation", "description": "MV Transportation is seeking a Road Supervisor. The Road Supervisor will monitor street operations according to client, operations, and safety department requirements. Responsibilities include conducting site checks, monitoring street operations, providing customer information, responding to incidents, and ensuring compliance with safety standards.", "responsibilities": "Conduct site checks and road observations according to client and local policy. Document findings accordingly and provide necessary reports to project staff. Conduct wheelchair securement and vehicle cleanliness checks on in service vehicles. Monitor street operations for on-time performance and schedule and route adherence. Provide customer information for site personnel and at key locations. Respond to accidents and incidents assisting to manage the situation as well as collecting all required information, assist dispatch and operations staff in resuming service levels according to contract specifications and minimizing passenger disruptions. Accompany operators to medical facilities as required after accident or injury, ensure proper administration of post-accident drug and alcohol testing. Fill vacant shifts as necessary to ensure full service delivery. Conduct gate checks at pull-out or pull-in times ensuring on-time service and proper completion of necessary paperwork including manifests and pre- and post-trip inspections. Identify potential rerouting required as a result of traffic, construction or accident situations. Ensure that all operators are fit for duty, meet uniform and equipment standards and are in possession of proper licensing and certifications. Assist operators with service or passenger problems. Assist dispatch and maintenance staff with vehicle change outs that occur in the field. Provide feedback to safety and operations departments on service items that affect safety and performance, identify potential safety hazards and provide feedback to be incorporated into daily operations procedures. Assist in determination of preventability of accidents and incidents and make recommendations for future training based on individual events or on system trends. Accurately document all field observations and ensure file maintenance.", "qualifications": {"required": "High School diploma or equivalent. Certifications according to local contract requirements. Previous passenger transportation in current project or similar environment required. Excellent safety and service record. Knowledge of local training program and local operations. Familiarization with service area. Knowledge of client and service performance requirements. Ability to manage emergency situations. Knowledge of project specific vehicles, components and data/communications systems. Knowledge of State and Federal regulations and corporate safety programs and policies. Ability to read, write and speak English. Ability to communicate effectively and work with all departments. Ability to work independently and objectively.", "preferred": "Previous training and/or field supervision experience preferred but not required."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995436544"}