{"jobTitle": "Human Resources Coordinator", "company": {"name": "The California Wellness Foundation", "industry": "Philanthropic Fundraising Services", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Philanthropic Fundraising Services", "description": "THE OPPORTUNITY<br/><br/>The California Wellness Foundation is seeking a skillful and savvy HR Coordinator to support the Senior Director of Human Resources (SDHR), and HR team activities. The HR Coordinator will seamlessly move between a wide variety of HR team operations support, executive support, special projects, cross-departmental workgroups, and be a hub of information for and on behalf of the HR team. They will quickly come up to speed on essential HR knowledge and continually build their HR expertise, along with a strong professional acumen, superb communication and organizational skills, and a proactive and enthusiastic approach to their work.<br/><br/>This is a great opportunity for a talented administrative professional interested in learning more about the full spectrum of HR activities at a mission driven organization that values its staff! The HR Coordinator will proactively take on any administrative or project-related tasks in order to allow the SDHR to focus on department- and enterprise-wide priorities.<br/><br/>THE HUMAN RESOURCES DEPARTMENT<br/><br/>The HR team at Cal Wellness provides innovative and best-in-class programming and resources to our amazing staff. We build and support a diverse culture of trust, integrity and excellence by hiring talented people and supporting staff development.<br/><br/>The three members of the HR team include a Sr. Director of HR, HR Manager and HR Coordinator. This close-knit team will back each other up, collaborate seamlessly, and share responsibility for our collective accomplishments. The ideal candidate will be an exceptional team player who will work collaboratively across the team and ensure no issues slip between the cracks.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>HR TEAM SUPPORT<br/><br/><ul><li>Set up new hires in various HR systems, and routine maintenance/administration of systems (PEO, performance management, attendance, etc).</li><li>Partner with finance on payroll to ensure employee information, rates of pay, and other details are appropriately documented and reflected in bi-weekly payroll. </li><li>Support the maintenance of data in key HR systems, and participate in projects to streamline systems and workflows. </li><li>Administer annual health plan open enrollment and be a resources to staff regarding benefit plan options. </li><li>Support background administration of the 401k &amp; 457b retirement plans, including processing employee changes, organization 401k committee activities, and ensuring the all transactions and changes are documented and in compliance with plan requirements. </li><li>Administer the retiree health care system.</li><li>Administer workers comp claims and policy administration. </li><li>Support and administer leaves of absence. </li><li>Support administrative aspects of searches, hiring and onboarding. </li><li>Administer and support the completion of HR checklists related to new hires, departures, and other changes. </li><li>Complete compensation surveys and data requests on behalf of the HR team. </li><li>Support or track HR projects such as periodic trainings, audits, etc. </li><li>Support the maintenance and creation of various HR policies and procedures. <br/><br/><br/></li></ul>EXECUTIVE SUPPORT<br/><br/><ul><li>Provide executive administrative support to the Senior Director of HR including… </li><li>Maintain SD HR’s calendar, scheduling meetings, and coordinate related arrangements.</li><li>Manage SD HR’s travel logistics, making reservations and coordinating related needs.</li><li>Manage expense reporting, ensuring timely submission of materials through Concur.</li><li>Prepare agendas and other materials as needed in preparation for HR led meetings. Take notes and synthesize summaries and follow-ups tasks following meetings. </li><li>Support the SD HR in providing exemplary “customer service” to all employees and other stakeholders by being accessible and supporting communications. </li><li>Represent the SD HR, and the department, in internal and external engagements. </li><li>Maintains confidential information on behalf of the SD HR and HR department. </li><li>Research and submission of discretionary grants as directed by SD HR. <br/><br/><br/></li></ul>PROJECT MANAGEMENT &amp; CROSS-TEAM COLLABORATION<br/><br/><ul><li>Work closely with key administrative staff across the foundation to coordinate meeting logistics and project work for foundation executives and enterprise-wide initiatives.</li><li>Plan and manage logistics for meetings and events, including vendor and venue selection, catering and coordination of logistics, while working within a budget.</li><li>Develop and track contracts, consulting agreements and purchase orders to support department work, coordinating with project leads in the department as well as Operations and Finance.</li><li>Design, implement and maintain efficient processes to manage administrative work within the department.</li><li>Manage meeting materials and documentation, including agenda planning, note taking, synthesizing outcomes, and distribution of advance materials as well as follow-on action items.</li><li>Follow up with task owners to ensure completion.</li><li>Develop a comprehensive knowledge of operational practices, policies, and procedures.<br/><br/><br/></li></ul>CANDIDATE PROFILE<br/><br/>The HR Coordinator position requires deep proficiency in a broad range of administrative, human resources and operational activities. The ideal candidate has superb interpersonal skills, a positive attitude, the ability to anticipate needs as well as adapt and respond thoughtfully to emerging issues, and the ability to work quickly and effectively in a dynamic environment.<br/><br/>The position requires clear, effective communications skills; a high level of discretion, critical thinking, and judgement in handling sensitive and confidential information; and advanced organizational and prioritization skills necessary for multitasking and keeping the supervising executive on track, on time and informed.<br/><br/><strong>Requirements, Qualifications And Relevant Experience<br/><br/></strong><ul><li>Experience in a professional, administrative and/or executive assistant capacity. </li><li>Some knowledge and/or experience of HR operations including HR systems, benefits, payroll, policies and procedures, wage and hour law, leaves of absence, etc. </li><li>Prior experience in a sophisticated organization with a professional workforce. Prior organizations may have been in the non-profit industry, philanthropy, government, finance, executive search, corporate, entertainment, start-ups, or other industries. </li><li>Excellent oral and written communication skills.</li><li>Strong proficiency with MS Office, including Outlook, Excel, Word and PowerPoint, with ability to create high-level presentations.</li><li>Ability to proactively problem solve, identify, and implement effective solutions, even when there is a lack of clear process or standards.</li><li>Strong interpersonal skills with the ability to interact with a diverse population.</li><li>Strong organizational skills with high attention to detail and accuracy.</li><li>Ability to multitask, prioritize and follow through to effectively manage workflow.</li><li>Ability to plan ahead and work within deadlines.</li><li>Strong time management skills, effectively managing one's own time and the time of others.</li><li>Ability to use discretion and maintain confidentiality when handling sensitive materials and issues.</li><li>Experience with or knowledge of project management systems (e.g. Asana) and cloud based CRMs (e.g. Salesforce) is a plus. </li><li>Ability to learn our organizational structure and dynamics, and to understand the philanthropic landscape. </li><li>Strong cultural awareness and knowledge of DEI issues. Commitment and proven ability to create a just, equitable, diverse and inclusive work environment. </li><li>Interest and ability to quickly learn the operations of the HR team at a philanthropic organization. <br/><br/><br/></li></ul>CORE COMPETENCIES<br/><br/>The ideal candidate will embody Cal Wellness’ core competencies:<br/><br/>Commitment to Justice, Equity, Diversity &amp; Inclusion<br/><br/>Communication<br/><br/>Innovation<br/><br/>Leadership<br/><br/>Teamwork and Collaboration<br/><br/>THE CALIFORNIA WELLNESS FOUNDATION<br/><br/>The California Wellness Foundation (Cal Wellness) is a private, independent foundation established in 1992 with a mission to protect and improve the health and wellness of the people of California. As one of the largest health-focused foundations in California, with over $1 billion in assets, Cal Wellness is a nationally recognized leader for its strategic core operating support for grantees; public policy grantmaking; and a focus on violence as a public health issue. It is Cal Wellness’ desire to promote equity and level the playing field so that everyone has access to good-paying jobs; healthy and safe neighborhoods; and quality health care services.<br/><br/>The foundation’s current Advancing Wellness grantmaking strategy includes four interrelated portfolios. Since its founding, Cal Wellness has awarded nearly 12,400 grants totaling more than $1.3 billion. In addition to its grantmaking, the foundation has committed to using its voice, influence, and endowment dollars to advance its mission.<br/><br/>Cal Wellness has a diverse staff of approximately 45 located in its Los Angeles and Oakland offices and a diverse 13-member Board located throughout the state of California. The foundation’s work underscores a belief that wellness requires social justice, a deep commitment to diversity, equity, and inclusion (DEI), and sustained efforts to eliminate systemic barriers that prevent access to health care, education, employment, and safety.<br/><br/>Please visit http://www.calwellness.org for more information.<br/><br/>LOCATION &amp; TRAVEL<br/><br/>This position may be based at our Los Angeles or Oakland office. Cal Wellness operates with a hybrid work model that includes both in-office and remote work. In-office attendance will typically be required Tuesdays and Wednesdays. Travel is estimated at up to 10% to have a periodic presence in both offices and to attend meetings and convenings across the State.<br/><br/><strong>Compensation &amp; Benefits<br/><br/></strong>The target starting salary for the newly hired Human Resources Coordinator is $95,000 per year (non-exempt, $45.67/hour). The full salary grade for the role is $85,000 to $115,100 per year.<br/><br/>Highlights from our benefit package include: a variety of medical, dental and vision plans, a generous 401(k) retirement savings plan with a 16% employer contribution, flexible paid time off, tuition reimbursement, professional development opportunities, 3:1 matching gifts, and the opportunity to work at a mission and values driven organization.<br/><br/>TO APPLY<br/><br/>Please apply here and upload a cover letter and resume by September 6, 2024!<br/><br/>Resume review begins immediately, and candidates will be considered on a rolling basis. Those selected for advancement will be asked to participate in several rounds of interviews (virtual and in-person), complete a writing assignment, and provide a list of professional references. If you require a reasonable accommodation to participate in our application process, please let us know.<br/><br/><strong>The California Wellness Foundation is an equal opportunity employer and welcomes a diverse candidate pool. Additionally, we are a fair chance employer and welcome candidates with lived experience with the criminal justice system.<br/><br/></strong><em>The above job description is intended to describe the general nature and level of work performed and is not intended to limit the scope of potential work assignments. This is only a summary of the typical functions of the job and duties that may differ from those as outlined above.</em>", "responsibilities": "HR TEAM SUPPORT<br/><br/><ul><li>Set up new hires in various HR systems, and routine maintenance/administration of systems (PEO, performance management, attendance, etc).</li><li>Partner with finance on payroll to ensure employee information, rates of pay, and other details are appropriately documented and reflected in bi-weekly payroll. </li><li>Support the maintenance of data in key HR systems, and participate in projects to streamline systems and workflows. </li><li>Administer annual health plan open enrollment and be a resources to staff regarding benefit plan options. </li><li>Support background administration of the 401k &amp; 457b retirement plans, including processing employee changes, organization 401k committee activities, and ensuring the all transactions and changes are documented and in compliance with plan requirements. </li><li>Administer the retiree health care system.</li><li>Administer workers comp claims and policy administration. </li><li>Support and administer leaves of absence. </li><li>Support administrative aspects of searches, hiring and onboarding. </li><li>Administer and support the completion of HR checklists related to new hires, departures, and other changes. </li><li>Complete compensation surveys and data requests on behalf of the HR team. </li><li>Support or track HR projects such as periodic trainings, audits, etc. </li><li>Support the maintenance and creation of various HR policies and procedures. <br/><br/><br/></li></ul>EXECUTIVE SUPPORT<br/><br/><ul><li>Provide executive administrative support to the Senior Director of HR including… </li><li>Maintain SD HR’s calendar, scheduling meetings, and coordinate related arrangements.</li><li>Manage SD HR’s travel logistics, making reservations and coordinating related needs.</li><li>Manage expense reporting, ensuring timely submission of materials through Concur.</li><li>Prepare agendas and other materials as needed in preparation for HR led meetings. Take notes and synthesize summaries and follow-ups tasks following meetings. </li><li>Support the SD HR in providing exemplary “customer service” to all employees and other stakeholders by being accessible and supporting communications. </li><li>Represent the SD HR, and the department, in internal and external engagements. </li><li>Maintains confidential information on behalf of the SD HR and HR department. </li><li>Research and submission of discretionary grants as directed by SD HR. <br/><br/><br/></li></ul>PROJECT MANAGEMENT &amp; CROSS-TEAM COLLABORATION<br/><br/><ul><li>Work closely with key administrative staff across the foundation to coordinate meeting logistics and project work for foundation executives and enterprise-wide initiatives.</li><li>Plan and manage logistics for meetings and events, including vendor and venue selection, catering and coordination of logistics, while working within a budget.</li><li>Develop and track contracts, consulting agreements and purchase orders to support department work, coordinating with project leads in the department as well as Operations and Finance.</li><li>Design, implement and maintain efficient processes to manage administrative work within the department.</li><li>Manage meeting materials and documentation, including agenda planning, note taking, synthesizing outcomes, and distribution of advance materials as well as follow-on action items.</li><li>Follow up with task owners to ensure completion.</li><li>Develop a comprehensive knowledge of operational practices, policies, and procedures.<br/><br/><br/></li></ul>", "qualifications": {"required": "Experience in a professional, administrative and/or executive assistant capacity. \nSome knowledge and/or experience of HR operations including HR systems, benefits, payroll, policies and procedures, wage and hour law, leaves of absence, etc. \nPrior experience in a sophisticated organization with a professional workforce. Prior organizations may have been in the non-profit industry, philanthropy, government, finance, executive search, corporate, entertainment, start-ups, or other industries. \nExcellent oral and written communication skills.\nStrong proficiency with MS Office, including Outlook, Excel, Word and PowerPoint, with ability to create high-level presentations.\nAbility to proactively problem solve, identify, and implement effective solutions, even when there is a lack of clear process or standards.\nStrong interpersonal skills with the ability to interact with a diverse population.\nStrong organizational skills with high attention to detail and accuracy.\nAbility to multitask, prioritize and follow through to effectively manage workflow.\nAbility to plan ahead and work within deadlines.\nStrong time management skills, effectively managing one's own time and the time of others.\nAbility to use discretion and maintain confidentiality when handling sensitive materials and issues.\nExperience with or knowledge of project management systems (e.g. Asana) and cloud based CRMs (e.g. Salesforce) is a plus. \nAbility to learn our organizational structure and dynamics, and to understand the philanthropic landscape. \nStrong cultural awareness and knowledge of DEI issues. Commitment and proven ability to create a just, equitable, diverse and inclusive work environment. \nInterest and ability to quickly learn the operations of the HR team at a philanthropic organization. <br/><br/><br/>", "preferred": null}, "skills": ["HR Systems", "Benefits Administration", "Payroll", "Policies and Procedures", "Wage and Hour Law", "Leaves of Absence", "MS Office", "Outlook", "Excel", "Word", "PowerPoint", "Project Management", "Asana", "CRM", "Salesforce", "DEI", "Philanthropy"], "postedDate": "1 week ago", "applicationDeadline": "September 6, 2024", "benefits": "a variety of medical, dental and vision plans, a generous 401(k) retirement savings plan with a 16% employer contribution, flexible paid time off, tuition reimbursement, professional development opportunities, 3:1 matching gifts, and the opportunity to work at a mission and values driven organization.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995447676"}