{"jobTitle": "Human Resources Business Partner", "company": {"name": "Riveron", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000 - $110,000 a year", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Business Consulting and Services", "description": "The Human Resources Business Partner (HRBP) partners closely with firm leaders to deliver people-related programs and initiatives and provide strategic direction and consultation. The HRBP is responsible for collaborating closely with other HR specialists and Leadership to understand business needs and priorities to ensure that HR talent delivery needs are effectively met within the business.<br/><br/>This role is responsible for collaborating with the broader operational and functional areas to design and deliver a high-performing, business-aligned people agenda. The HRBP is responsible for providing distinctive service to firm colleagues and business leaders within service lines and geographies and advising on people-related issues towards outcomes that align with the firm culture, values, and DE&amp;I initiatives.<br/><br/>The HRBP is also responsible for “high touch” people experiences, such as performance management, retention practices, and general talent programs. This role is critical in executing colleague initiatives, providing exceptional internal support, and fostering a high-performance environment within the Firm.<br/><br/><strong>Who You Are<br/><br/></strong><ul><li>A business-minded people leader with several years of increasingly responsible HR/Talent positions with a demonstrated ability to thrive in a culture that is collaborative, client-service-oriented, and consultative. </li><li>Self-starter who enjoys working in a continually evolving, fast-paced environment requiring flexibility and innovation, while maintaining a positive attitude and calm demeanor. </li><li>Confident with strong personal initiative as someone who is willing to roll up their sleeves and do what it takes to get the job done. </li><li>A natural coach and mentor with an engaging and approachable personality. </li><li>Experience in prioritization and negotiation with demonstrated ability to be effective in supporting multiple business leaders/partners working across different business areas of focus. Highly collaborative and action-oriented, with strong influencing skills; a change agent who can build collaborative relationships across a matrixed organization. Will have experience of working successfully with all levels of staff, from front-line to senior executive. </li><li>Operationally focused with the ability to think strategically and deliver tactically. </li><li>An ability to work with highly confidential, complex, and sensitive HR matters in an objective manner while using the lens of the firm’s culture, values, and DE&amp;I perspective. <br/><br/></li></ul><strong>What You’ll Do<br/><br/></strong><ul><li>Delivery of people-related programs and initiatives to service lines using a client service mindset. </li><li>Establish and maintain strong partnerships with service line leaders and staff to understand their strategic objectives, challenges, and unique talent needs. </li><li>Work with Managing Directors and business leaders in identifying opportunities to mitigate risk and drive consistency across business lines. </li><li>Oversee the practice line execution of all HR programs, proactively providing guidance and support on items like organization design, performance management, employee relations, compliance, and change management initiatives. </li><li>Use data and metrics to make critical decisions; identify and report patterns and trends, making recommendations as appropriate. </li><li>Drive and improve HR policies, procedures, and practices and ensure they are implemented successfully at all levels. </li><li>Become knowledgeable and supportive of the strategy of the firm, service line and geography practices, and business priorities. <br/><br/></li></ul>$85,000 - $110,000 a year<br/><br/>The expected pay range for this position is $85,000 - $110,000 (exclusive of bonus, equity, or benefits for which this role may be eligible). This range takes into account a variety of factors that are considered in making individual compensation decisions including but not limited to experience and training; skill sets; licensure and certifications; location and other business and organizational needs; and applicable laws.<br/><br/>", "responsibilities": "The Human Resources Business Partner (HRBP) partners closely with firm leaders to deliver people-related programs and initiatives and provide strategic direction and consultation. The HRBP is responsible for collaborating closely with other HR specialists and Leadership to understand business needs and priorities to ensure that HR talent delivery needs are effectively met within the business.<br/><br/>This role is responsible for collaborating with the broader operational and functional areas to design and deliver a high-performing, business-aligned people agenda. The HRBP is responsible for providing distinctive service to firm colleagues and business leaders within service lines and geographies and advising on people-related issues towards outcomes that align with the firm culture, values, and DE&amp;I initiatives.<br/><br/>The HRBP is also responsible for “high touch” people experiences, such as performance management, retention practices, and general talent programs. This role is critical in executing colleague initiatives, providing exceptional internal support, and fostering a high-performance environment within the Firm.", "postedDate": "2 weeks ago", "skills": ["HR", "Talent", "Client Service", "Business Needs", "People Agenda", "DE&I", "Performance Management", "Retention", "Talent Programs", "Internal Support", "High-Performance Environment", "Strategic Objectives", "Talent Needs", "Risk Mitigation", "Consistency", "Organization Design", "Employee Relations", "Compliance", "Change Management", "Data Analysis", "Metrics", "HR Policies", "Procedures", "Practices", "Business Strategy", "Service Line", "Geography", "Business Priorities"], "url": "https://www.linkedin.com/jobs/view/3995328098"}