{"jobTitle": "Merchandise Planner", "company": {"name": "The Guitar Center Company", "location": "Westlake Village, CA"}, "location": "Westlake Village, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$72,625- $103.400", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Manufacturing", "description": "<strong>Job Description</strong>\n<p>The Merchandise Planner leads the financial and inventory strategy for a category or set of subcategories, in collaboration with the category managers, across all channels and brands. The Planner ensures that item level forecasts and supply strategies drive sales, margin and turn to meet financial goals. The Planner manages an inventory analyst and builds entry level talent to become future leaders. They will be a student of their business looking to maximize opportunities, manage product life cycle in conjunction with merchants to avoid aging and liable product. They will ensure best in class in-stocks online and in store and will perform regular sku rationalization. They will monitor order flow to stay on time and on budget. They will be critical to the Open to Buy process.</p>\n<p><strong>Responsibilities will include, but will not be limited to the following:</strong></p>\n<ul>\n<li> Reviews item level forecasts and order proposals to drive sales and GMROI</li>\n<li> Control purchase order activity to maximize sales and stay on budget</li>\n<li> Collaborate with merchants to drive key market share events and promotions across channels with accurate sales and supply forecasts.</li>\n<li> Provides roll up of forecasts and purchases to contribute to in season planning process and the open to buy.</li>\n<li> Creates Omni channel strategy to drive sales, margin and turn for a complex retailer with stores, multiple websites and call centers for subcategories and key items.</li>\n<li> Maintains the planning system with accurate parameters to improve forecast accuracy, receipt flow and performance of algorithms. </li>\n<li> Manages and develops Inventory Analyst to resolve purchase order dates, shortages, overages and problem shipment resolution and e-commerce backorders. Prepares them for future career at GC.</li>\n<li> Supports Director of planning in building assortment parameters for a subcategory to balance customer needs by segment, price point and ensuring powerful presentations.</li>\n<li> Additional duties as assigned.</li>\n</ul>\n<p><strong>About Guitar Center</strong></p>\n<p>Guitar Center embodies the world of creativity and music by encouraging our teammates to find their own individual sound. We strive to craft lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the almost indescribable happiness that comes from playing an instrument. We believe in putting our customers first, engaging with respect and integrity and fulfilling our mission with passion.</p>\n<p><strong>Why</strong> <strong>join</strong> <strong>us?</strong></p>\n<p>With a career at Guitar Center, you become part of the world's largest multichannel musical instrument retailer. Whether at our Stores, Contact Centers, Distribution Centers, or Support Center, Guitar Center employees have a common goal: to help people find their sound and fill the world with more music.</p>\n<p><strong>Love</strong> <strong>this</strong> <strong>gig</strong> <strong>and</strong> <strong>want</strong> <strong>to</strong> <strong>apply?</strong></p>\n<p>Send your resume and cover letter today along with salary expectations!</p>\n<p> </p>\n<p><strong>To</strong> <strong>join</strong> <strong>our</strong> <strong>band,</strong> <strong>you'll</strong> <strong>need</strong> <strong>the</strong> <strong>following</strong> <strong>experience:</strong></p>\n<ul>\n<li> Bachelor's Degree preferably in Business, Merchandising/ Supply Chain OR 4 years of relevant work experience.</li>\n<li> 4 years of relevant work experience </li>\n<li> 3 years of experience leading others.</li>\n</ul>\n<p><strong>Pay Rate: $72,625- $103.400</strong> / annually depending on background and experience.</p>\n<p>The job posting is not necessarily reflective of actual compensation that may be earned, nor a promise of any specific pay for any specific employee, which is always dependent on actual experience, education, and other factors. The pay range(s) listed are provided in compliance with state specific laws. Pay ranges may be different in other locations</p>\n<p>Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job‐related requirements.</p>\n<p>If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1‐818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com</p>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3995868088"}