{"jobTitle": "Senior Director, Clinical Data Management", "company": {"name": "ImmPACT Bio", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "255,160—$283,439 USD", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Technology, Information and Internet", "description": "ImmPACT Bio USA, Inc., is a clinical-stage company dedicated to the discovery of transformative chimeric antigen receptor (CAR) T-cell therapies that address key biological challenges in treating cancer and autoimmune diseases. The company's logic-gate-based CAR T-cell platforms, licensed from University of California, Los Angeles (UCLA) Technology Development Group, are specifically designed to deplete B cells, prevent antigen escape, and overcome the immunosuppressive tumor microenvironment. The company's technology is based on the work of pioneering scientists Yvonne Chen, Ph.D., and Antoni Ribas, M.D., Ph.D., both from UCLA.<br/><br/>ImmPACT Bio is seeking an exceptional individual to join our growing team as Senior Director, Clinical Data Management. This position will report directly to the Vice President, Clinical Operations, and be responsible for all data management deliverables from ImmPACT clinical trials.  The Senior Director, Clinical Data Management will oversee CRO data managers and, as the portfolio grows, will manage a group of data managers and programmers to provide expertise and leadership through the planning and execution of CDM activities across the product portfolio.<br/><br/><strong>Primary Responsibilities: <br/><br/></strong><ul><li>Delivery of all data management deliverables from ImmPACT clinical trials</li><li>Oversee CRO data managers and as the portfolio grows, manage a group of data managers and programmers to provide expertise and leadership through the planning and execution of CDM activities across the product portfolio </li><li>In concert with the Clinical Operations team is accountable for achieving successful delivery of clinical trial data from protocol development and CRF design through final data lock and finalization of the Clinical Study Report (CSR). </li><li>Development and implementation of a strategic vision for the CDM team </li><li>Oversee day-to-day data management project activities including, but not limited to timelines, budgets, staff, project scope, reports, and communication for the lifecycle of the project(s) </li><li>Development and maintenance of CDM SOPs </li><li>Electronic Data Capture (EDC) with Medidata Rave </li><li>Identify clinical data trends; provide trends and escalate questions to the Clinical lead </li><li>Present study updates, interim and final study data metrics, and reports </li><li>Must demonstrate expertise in influencing teams during the design, conduct, and  completion of trials </li><li>Includes other duties and responsibilities as assigned. Duties and responsibilities may be modified or changed at any time based on the needs of the business. <br/><br/></li></ul><strong>Basic Qualifications:<br/><br/></strong><ul><li>Bachelor of Science with at least thirteen (13) years of experience, or Master of Science with at least ten (10) years of experience, or Ph.D. with at least six (6) years of experience or equivalent amount of education and experience</li><li>At least 8 years of managerial experience or equivalent </li><li>Strong knowledge and experience in study start-up, database locks, analysis time points, data finalization, and clinical database lock </li><li>Excellent organizational and project management skills </li><li>Knowledgeable in GCP standards, CDISC standards (CDASH, CDISC, SDTM, ADaM), FDA and ICH guidelines, and recommended CDM Best Practices </li><li>Electronic Data Capture (EDC) experience with Medidata Rave required </li><li>Outstanding verbal, writing, and presentation skills with a strong ability to influence and communicate effectively throughout all levels of the organization and externally </li><li>Ability to work in a fast-paced flexible environment  <br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Strong CRO oversight experience</li><li>CAR-T/Gene and Cellular product experience</li><li>Multidisciplinary across therapeutics <br/><br/></li></ul><strong>Location:  <br/><br/></strong><ul><li>West Hills, CA (or hybrid)  <br/><br/></li></ul><strong>Travel Requirements: <br/><br/></strong><ul><li>Willingness to travel domestically and internationally up to 15% (or more) of the time.  <br/><br/></li></ul>At ImmPACT Bio we embrace transparency in our total rewards pay and benefits program and philosophy. We believe in offering and maintaining competitive compensation and benefits programs for our employees to attract and retain a talented, highly engaged workforce. Our compensation programs are focused on fair and equitable pay practices including market based and data supported base pay, an annual performance-based bonus plan, and equity grants (ISO) for new employees.<br/><br/>Compensation for the role will depend on several factors, including a candidate's qualifications, skills, competencies, and experience.<br/><br/>Salary Range<br/><br/>$255,160—$283,439 USD<br/><br/>ImmPACT Bio provides a generous Total Rewards package, to include a competitive base salary, bonus, and equity package as well as generous benefits and paid time off programs. ImmPACT Bio is an Equal Opportunity Employer and will review all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status. All information will be kept confidential according to EEO guidelines.", "responsibilities": "Delivery of all data management deliverables from ImmPACT clinical trials\nOversee CRO data managers and as the portfolio grows, manage a group of data managers and programmers to provide expertise and leadership through the planning and execution of CDM activities across the product portfolio\nIn concert with the Clinical Operations team is accountable for achieving successful delivery of clinical trial data from protocol development and CRF design through final data lock and finalization of the Clinical Study Report (CSR).\nDevelopment and implementation of a strategic vision for the CDM team\nOversee day-to-day data management project activities including, but not limited to timelines, budgets, staff, project scope, reports, and communication for the lifecycle of the project(s)\nDevelopment and maintenance of CDM SOPs\nElectronic Data Capture (EDC) with Medidata Rave\nIdentify clinical data trends; provide trends and escalate questions to the Clinical lead\nPresent study updates, interim and final study data metrics, and reports\nMust demonstrate expertise in influencing teams during the design, conduct, and completion of trials\nIncludes other duties and responsibilities as assigned. Duties and responsibilities may be modified or changed at any time based on the needs of the business.", "qualifications": {"required": "Bachelor of Science with at least thirteen (13) years of experience, or Master of Science with at least ten (10) years of experience, or Ph.D. with at least six (6) years of experience or equivalent amount of education and experience\nAt least 8 years of managerial experience or equivalent\nStrong knowledge and experience in study start-up, database locks, analysis time points, data finalization, and clinical database lock\nExcellent organizational and project management skills\nKnowledgeable in GCP standards, CDISC standards (CDASH, CDISC, SDTM, ADaM), FDA and ICH guidelines, and recommended CDM Best Practices\nElectronic Data Capture (EDC) experience with Medidata Rave required\nOutstanding verbal, writing, and presentation skills with a strong ability to influence and communicate effectively throughout all levels of the organization and externally\nAbility to work in a fast-paced flexible environment", "preferred": "Strong CRO oversight experience\nCAR-T/Gene and Cellular product experience\nMultidisciplinary across therapeutics"}, "skills": ["Clinical Data Management", "Clinical Trials", "Data Management", "Clinical Operations", "CDM", "GCP", "CDISC", "FDA", "ICH", "Medidata Rave", "CRO", "CAR-T", "Gene and Cellular Therapy", "Multidisciplinary"], "postedDate": "2 weeks ago", "benefits": "ImmPACT Bio provides a generous Total Rewards package, to include a competitive base salary, bonus, and equity package as well as generous benefits and paid time off programs.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995532932"}