{"jobTitle": "Retail Sales Manager", "company": {"name": "Longchamp", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "From $65,000.00", "currency": "USD"}, "jobFunction": "Sales and Customer Service", "industry": "Retail Apparel and Fashion and Retail Luxury Goods and Jewelry", "description": "<strong>Job description</strong><p><strong>La Maison Longchamp:</strong></p><p>Based in Paris, Longchamp stands as an optimistic and independent family business with an international reputation. Joining Longchamp’s team means contributing to the creation and distribution of fashion and leather goods that are both fair and beautiful, showcasing superior craftsmanship. With a presence in over 25 countries and employing 3,500 individuals, “la Maison” is now looking for innovative, passionate, and committed talent to continue its development in France and abroad in a demanding and caring working environment.</p><p><br/></p><p>Exciting chance to become part of our esteemed Luxury Brand! We are in search of a skilled Retail Concession Manager to take charge of our concession at Nordstrom Los Cerritos Center, Cerritos, CA. This role involves overseeing all facets of operating a lucrative store and establishing the atmosphere, leading the store’s culture to ensure success in customer service, profitability, operations, personnel development, and the presentation and assortment of merchandise.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Assume leadership and development role.</li><li>Effective total store communication, morale awareness, and staff development.</li><li>Emphasis on employee retention and career development</li><li>Interviewing, hiring, and training employees.</li><li>New hire paperwork, orientation, and collaboration with HR.</li><li>Planning, assigning, and directing work.</li><li>Performance reviews, rewards, and discipline</li><li>Complaint resolution and continual performance issue evaluation</li><li>Time sheet review and payroll management Sales team task assignment and goal monitoring</li><li>Merchandising oversight and inventory control</li><li>Shrink and expenses control.</li><li>Maintenance of total store standards</li><li>Identification of price changes/errors and communication to corporate</li><li>Review of department/store trends Participation in opening and closing the store.</li><li>Management of office tasks, funds, and shipments</li><li>Monitoring of sales performance through analysis</li><li>Adherence to company policies and procedures</li><li>Other duties as assigned by the Director of Retail</li></ul><p><br/></p><p><strong>Requirements</strong></p><ul><li>High School Diploma (or GED)</li><li>Degree in Fashion or related field OR equivalent work experience and education</li><li>5 years of experience in high-end retail, boutique, or sales, with proven expertise in retail management, covering P&amp;L, staff supervision, scheduling, training, merchandising, inventory, shrink control, and payroll.</li><li>Proficient in POS transactions (sales, returns, exchanges, CRM)</li><li>Familiar with UPS System</li><li>Working knowledge of Microsoft Excel, Outlook, and Word</li><li>Independent judgment and discretionary powers</li><li>Familiarity with store operations</li><li>Strong communication and leadership skills</li><li>Organized, self-starter with multitasking ability in a fast-paced environment.</li><li>Varied work hours/days as needed.</li><li>Experience in researching and exploring market trends.</li><li>Ability to establish cross-functional relationships for business growth.</li><li>Understanding of the French language is a plus</li></ul><p><br/></p><p><strong>Job Type: Full-time</strong></p><p>Pay: From $65,000.00 per year</p><p>Benefits:</p><ul><li>401(k)</li><li>401(k) matching</li><li>Dental insurance</li><li>Employee discount</li><li>Flexible schedule</li><li>Health insurance</li><li>Paid time off</li><li>Vision insurance</li></ul><p><br/></p><p><strong>Experience level:</strong></p><ul><li>4 years</li></ul><p><br/></p><p><strong>Shift:</strong></p><ul><li>10 hour shift</li><li>12 hour shift</li><li>Day shift</li><li>Morning shift</li></ul><p></p>", "responsibilities": "Assume leadership and development role. Effective total store communication, morale awareness, and staff development. Emphasis on employee retention and career development Interviewing, hiring, and training employees. New hire paperwork, orientation, and collaboration with HR. Planning, assigning, and directing work. Performance reviews, rewards, and discipline Complaint resolution and continual performance issue evaluation Time sheet review and payroll management Sales team task assignment and goal monitoring Merchandising oversight and inventory control Shrink and expenses control. Maintenance of total store standards Identification of price changes/errors and communication to corporate Review of department/store trends Participation in opening and closing the store. Management of office tasks, funds, and shipments Monitoring of sales performance through analysis Adherence to company policies and procedures Other duties as assigned by the Director of Retail", "qualifications": {"required": "High School Diploma (or GED) Degree in Fashion or related field OR equivalent work experience and education 5 years of experience in high-end retail, boutique, or sales, with proven expertise in retail management, covering P&L, staff supervision, scheduling, training, merchandising, inventory, shrink control, and payroll. Proficient in POS transactions (sales, returns, exchanges, CRM) Familiar with UPS System Working knowledge of Microsoft Excel, Outlook, and Word Independent judgment and discretionary powers Familiarity with store operations Strong communication and leadership skills Organized, self-starter with multitasking ability in a fast-paced environment. Varied work hours/days as needed. Experience in researching and exploring market trends. Ability to establish cross-functional relationships for business growth. Understanding of the French language is a plus", "preferred": ""}, "skills": ["POS", "UPS", "Microsoft Excel", "Outlook", "Word", "Communication", "Leadership"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "401(k) 401(k) matching Dental insurance Employee discount Flexible schedule Health insurance Paid time off Vision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995430349"}