{"jobTitle": "Senior / Manager, Facility Operations", "company": {"name": "Appia Bio", "location": "Culver City, CA", "industry": "Biotechnology Research"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "92,700.00/yr - 132,561.00/yr", "currency": "USD"}, "jobFunction": "Science and Research", "industry": "Biotechnology Research", "description": "Appia Bio is a preclinical stage biotech company focused on the research and development of innovative off-the-shelf cell therapies for patients with severe autoimmune diseases and cancer. Our ACUA technology platform generates CAR-engineered NKT and gamma delta T cells from cord blood derived hematopoietic stem cells. Our mission is to discover and develop allogeneic cell therapies for the treatment of a broad array of cancer and autoimmune indications with a scalability that increases access for patients.\n\nInnovation, collaboration, and dedication are at the heart of Appia’s culture. The scientific foundation of Appia Bio is underpinned by groundbreaking research led by Lili Yang (UCLA), David Baltimore (Caltech), and Pin Wang (USC). The management team brings decades of experience in R&D and business in the biotech industry.\n\n. \n\nAbout the Role\n\nAppia is seeking a highly qualified biotech facility manager with experience in life sciences labs, scientific equipment, and operations personnel management. The role includes hands on day-to-day facility management, proactive maintenance and metrology, and management of vendors.\n\nThe successful candidate will have strong communication skills, effective tactical and strategic judgement in their domain, negotiation and relationship management skills with vendors, and work productively and collaboratively with internal and external stakeholders. This role collaborates significantly with other departments for planning and operations.\n\n\nResponsibilities and Duties\n\n* Maintain facility, including equipment, repairs, utilities, and HVAC to support operational continuity\n* Work with the landlord on facility maintenance and tenant improvements\n* Partner with laboratory operations including oversight of EH&S and emergency response planning\n* Manage office space, maintenance, and security systems\n* Partner with Finance and R&D to support lab equipment purchase, installation, and maintenance on budget\n* Scope may include oversight of general office management and support company’s IT infrastructure and the outsourced Vendor\n\n\nMinimum Requirements:\n\n* A minimum of 6+ years of relevant work experience in facilities for a life science, biotech, or medical facility\n* Bachelor’s degree in Facilities Management, Engineering, or related field\n* Knowledge of equipment metrology, controls, automation maintenance, and technical disciplines of HVAC, electrical and plumbing.\n* Ability to read and interpret blueprints, schematic drawings and technical manuals.\n* Experience with utilities, engineering, maintenance, computerized systems and validation activities, in a cGMP environment preferred\n* Excellent interpersonal rapport, effective project management, verbal and written communication skills, and negotiation skills are essential as this job has many stakeholders\n* High energy self-starter with a strong sense of ownership in areas of responsibility\n\n\nPreferred Requirements:\n\n* Experience with AV/IT vendor management\n* cGMP Facilities Professional certification\n\n\nEqual Opportunity \n\nAppia Bio is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.", "responsibilities": "Maintain facility, including equipment, repairs, utilities, and HVAC to support operational continuity\nWork with the landlord on facility maintenance and tenant improvements\nPartner with laboratory operations including oversight of EH&S and emergency response planning\nManage office space, maintenance, and security systems\nPartner with Finance and R&D to support lab equipment purchase, installation, and maintenance on budget\nScope may include oversight of general office management and support company’s IT infrastructure and the outsourced Vendor", "qualifications": {"required": "A minimum of 6+ years of relevant work experience in facilities for a life science, biotech, or medical facility\nBachelor’s degree in Facilities Management, Engineering, or related field\nKnowledge of equipment metrology, controls, automation maintenance, and technical disciplines of HVAC, electrical and plumbing.\nAbility to read and interpret blueprints, schematic drawings and technical manuals.\nExperience with utilities, engineering, maintenance, computerized systems and validation activities, in a cGMP environment preferred\nExcellent interpersonal rapport, effective project management, verbal and written communication skills, and negotiation skills are essential as this job has many stakeholders\nHigh energy self-starter with a strong sense of ownership in areas of responsibility", "preferred": "Experience with AV/IT vendor management\ncGMP Facilities Professional certification"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3995793381"}