{"jobTitle": "IT Operations Manager", "company": {"name": "Munger, Tolles & Olson LLP", "location": "Los Angeles County, CA", "industry": "Law Practice and Legal Services"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$145,840.00 - $218,760.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Law Practice and Legal Services", "description": "<strong><u>IT Operations Manager</u></strong><p><strong>Position Type: Full Time</strong></p><p><strong> Exempt</strong></p><p><strong> Hybrid Flexible (1 to 3 Days Onsite)</strong></p><p><strong>Location: Los Angeles</strong></p><p><strong>Salary Range: $145,840.00 - $218,760.00*</strong></p><p><strong><em>*</em></strong><em>The salary range is the one that Munger, Tolles &amp; Olson LLP reasonably expects to pay for this position. The salary range does not guarantee, obligate, nor set expectations of an applicant’s wage in the event of hire. The posted range is only one component of Munger, Tolles &amp; Olson LLP’s Total Rewards package.</em></p><p><em>-------------</em></p><p><br/></p><p><strong>** Lead Our IT Operations to New Heights! **</strong></p><p><br/></p><p>Are you a tech-savvy leader with a passion for innovation?</p><p><br/></p><p>Under the direction of our IT Director, the <strong>IT Operations Manager</strong> will spearhead a talented team of engineers and analysts, ensuring seamless day-to-day operations across all Firm locations and datacenters.</p><p><br/></p><p>If you have a deep understanding of cloud infrastructure, network systems, storage solutions, back-end servers, and legal applications, we want you!</p><p><br/></p><p>Join us and drive the future of our IT landscape.</p><p><br/></p><p><strong>Job Functions &amp; Responsibilities</strong></p><p><br/></p><ul><li>Oversees and manages the daily activities of the Operations team, ensuring smooth and efficient technical operations across the Firm.</li><li>Ensures systems availability and optimal performance of the Firm’s operational technologies.</li><li>Identifies emerging trends, develops long-term strategies for service improvement, and recommends appropriate solutions.</li><li>Assists in the preparation, and management of the Firm’s annual IT budget, including staffing, hardware, software, and cloud services.</li><li>Regularly collaborates with the other Information Technology and Services management on projects and initiatives.</li><li>Works with Firm leadership and department managers on technology projects, ensuring successful implementation and maintenance.</li><li>Analyzes, develops, and recommends solutions for operational business processes, cloud infrastructure, applications, telecommunications, and datacenters.</li></ul><p><br/></p><p><br/></p><p><strong>Skills </strong></p><p><br/></p><ul><li>Understanding of Microsoft SQL Server in DAG configuration</li><li>Understanding of network and firewall configurations, management, and knowledge of routing protocols</li><li>Knowledge of networked storage systems and solutions</li><li>Knowledge of M365 solutions (SharePoint Online, Exchange Online, Office 365)</li><li>Knowledge of Microsoft Power Platform, Fabric, Dynamics and Azure Information Protection</li><li>Knowledge of Microsoft Azure and Entra ID, and cloud collaboration and infrastructure</li></ul><p><br/></p><p><strong>Tools</strong></p><p><strong> </strong></p><ul><li>Cisco Routers and Switches</li><li>Palo Alto Firewalls</li><li>SMB, NFS, DFS Storage Solutions (Example; NetApp)</li><li>VOIP Telephony (RingCentral, MS Teams)</li><li>iManage Work 10</li><li>Microsoft Exchange Online</li><li>Microsoft Office 365</li><li>Microsoft Power Platform, Fabric, Dynamics and Azure Information Protection</li><li>Microsoft SharePoint Online</li><li>Microsoft SQL Server</li><li>Microsoft Azure and Entra ID</li><li>Microsoft Windows operating systems</li><li>Cloud collaboration technologies</li><li>Accounting systems</li><li>Litigation support applications</li><li>Citrix and other remote technologies</li><li>HP and Dell servers</li><li>Mobile device management systems</li><li>Multi-factor authentication and Privileged Access Management solutions</li><li>Replication, Disaster Recovery and Backup Systems</li><li>Monitoring Software (Examples; Splunk, PRTG, Enow, Exoprise)</li><li>PowerShell</li></ul><p><br/></p><p><strong>Minimum Job Qualifications </strong></p><p><br/></p><ul><li>High school diploma or GED. Bachelor’s degree preferred.</li><li>Minimum 3 years of experience managing a technical group of 5 or more operations engineers and analysts in a medium to large enterprise (300+ users).</li><li>Project management experience handling small to mid-sized projects.</li><li>Excellent interpersonal skills with the ability to interact effectively and professionally with all levels of management, employees, vendors, and various external entities, including clients and prospective clients of the Firm.</li><li>Availability and willingness to travel up to 10% of the time, as needed.</li><li>Availability and willingness to work extended hours, nights, and weekends, as needed.</li></ul><p><br/></p><p><br/></p><p><strong>Why Choose Munger Tolles?</strong></p><ul><li><strong>Precedent-Setting Cases</strong>: Clients turn to us for groundbreaking cases that demand creative thinking.</li><li><strong>Resourceful Deployment</strong>: When the stakes are high, we can mobilize an “army of trial lawyers”.</li><li><strong>High-Profile Representation</strong>: We represent major entities such as Bank of America, Edison International, Oaktree Capital Management, PG&amp;E, and Berkshire Hathaway.</li></ul><p><br/></p><p><br/></p><p><strong>Our Exceptional Attorneys:</strong></p><ul><li><strong>Clerkship Experience</strong>: Nearly 75% of our lawyers and over 80% of our litigators have clerked for federal or state judges.</li><li><strong>Diverse Backgrounds</strong>: Our attorneys bring additional dimensions to client service. Some honed their skills as assistant U.S. attorneys, while others hold advanced degrees in fields like physics, engineering, and medicine.</li></ul><p><br/></p><p><br/></p><p>The <strong>IT Operations Manager</strong> role is an amazing opportunity available on our team of professionals at Munger, Tolles &amp; Olson, LLP! We offer competitive pay, benefits and an opportunity to make an impact in today’s world.</p><p><br/></p><p><br/></p><p>For <strong>full details of the position</strong> and for information on other job opportunities, please visit our website at www.mto.com</p><p><br/></p><p><br/></p><p><em>-------------</em></p><p><em>We are a talent-first Firm and are always looking for great people. We encourage you to apply even if the level of this position is not an exact match to your qualifications. This may not guarantee your placement into the opening; however, it is always worth exploring if there is an opportunity for the future. </em></p><p><em>-------------</em></p><p><strong><em>About Munger, Tolles &amp; Olson</em></strong></p><p><em>Munger, Tolles &amp; Olson has been consistently ranked on The American Lawyer’s A-List since its inception in 2004, including nine years in the top spot. We strive to hire only the most qualified and creative lawyers. We believe that clerkships provide valuable experience. In this regard, about 80% of our attorneys served as law clerks to federal or state judges and sixteen attorneys were clerks to U.S. Supreme Court Justices. We recruit and retain the best professional talent to support our Attorneys with a focus on service and excellence. We have a full spectrum of functional positions including Information Technology, Information Security, Accounting, Human Resources, Legal Support, and Marketing.</em></p><p>----------</p><p><em>MTO is an equal opportunity employer and does not discriminate in employment on the basis of race, including but not limited to hair texture and protective hairstyles (for example, braids, locks, and twists), color, ethnicity, religion, gender, gender identity or expression, pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth and breastfeeding, marital or domestic partner status, parental or family care status, national origin, ancestry, age, sexual orientation, disability or medical condition, genetic characteristic, political affiliation, military or veteran status, or any other characteristic protected by federal, state or local law. It is the policy of Munger, Tolles &amp; Olson LLP to prohibit discrimination, unlawful harassment (including sexual harassment), and retaliation. This commitment prohibits such conduct by any individual involved in MTO’s operations and by anyone doing business with or on behalf of Munger, Tolles &amp; Olson LLP.</em></p><p><em>-------------</em></p><p>Munger, Tolles &amp; Olson LLP (MTO) does not accept unsolicited resumes from 3rd parties or agencies. Any unsolicited resumes and profiles received from 3rd parties or agencies will be considered property of MTO and no fees will be due or paid. If you wish to become an approved Agency with MTO, please contact a member of the MTO Talent Acquisition Team.</p>", "responsibilities": "Under the direction of our IT Director, the IT Operations Manager will spearhead a talented team of engineers and analysts, ensuring seamless day-to-day operations across all Firm locations and datacenters.", "qualifications": {"required": "High school diploma or GED. Bachelor’s degree preferred.\nMinimum 3 years of experience managing a technical group of 5 or more operations engineers and analysts in a medium to large enterprise (300+ users).\nProject management experience handling small to mid-sized projects.\nExcellent interpersonal skills with the ability to interact effectively and professionally with all levels of management, employees, vendors, and various external entities, including clients and prospective clients of the Firm.\nAvailability and willingness to travel up to 10% of the time, as needed.\nAvailability and willingness to work extended hours, nights, and weekends, as needed.", "preferred": null}, "skills": ["Microsoft SQL Server", "network and firewall configurations", "networked storage systems", "M365 solutions", "Microsoft Power Platform", "Microsoft Azure", "Cisco Routers and Switches", "Palo Alto Firewalls", "SMB", "NFS", "DFS Storage Solutions", "VOIP Telephony", "iManage Work 10", "Microsoft Exchange Online", "Microsoft Office 365", "Microsoft SharePoint Online", "Microsoft Windows operating systems", "Cloud collaboration technologies", "Accounting systems", "Litigation support applications", "Citrix", "HP and Dell servers", "Mobile device management systems", "Multi-factor authentication", "Privileged Access Management solutions", "Replication", "Disaster Recovery", "Backup Systems", "Monitoring Software", "PowerShell"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "competitive pay, benefits and an opportunity to make an impact in today’s world.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995426651"}