{"jobTitle": "Director of SSP Operations", "company": {"name": "Senior Aerospace SSP", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Who is Senior plc?<br/><br/></strong>Senior plc is an international, market-leading, engineering solutions provider with 30 operating businesses in 13 countries. Senior designs, manufactures and markets high-technology components and systems for the principal original equipment producers in the worldwide aerospace, defense, and land vehicle and power &amp; energy markets. The Group is split into two divisions, Aerospace and Flexonics, servicing five key sectors.<br/><br/>Our global values underpin what we do, and how we do it …<br/><br/><strong><em>Safety – Integrity – Customer Focus – Respect &amp; Trust – Accountability – Excellence<br/><br/></em></strong><strong>Who is SSP?<br/><br/></strong>Senior Aerospace SSP, specializes in designing, manufacturing, and qualifying complex ducting systems for aerospace applications. Since its humble roots in 1945, the campus has now expanded to include a 59,000 sq. ft high-volume production facility, in addition to its legacy 131,000 ft2 main buildings which combined, accommodate over 500 employees. Vertically integrated with its own foundry, fabrication shop, and ISO certified engineering lab, Senior Aerospace SSP was acquired by Senior PLC in 1995 and has continued its expansion into new programs and technologies.<br/><br/><strong>Why join SSP?<br/><br/></strong>Senior Aerospace SSP is the leader of innovative design and manufacturing methods in the area of complex aerospace systems. Joining our team will provide you with a rewarding career with a tight-knit and collaborative team. You will also enjoy a competitive compensation package that includes a market-led base salary, a comprehensive benefits package along with wellness benefits, a matching 401K plan and paid time off. Apply today for an opportunity to join our team!<br/><br/><em>If an offer of employment is made it will be contingent upon passing all of the following: Drug Test, Background Check, ITAR, and U.S. Export Compliance Screening.<br/><br/></em><strong>Director of SSP Operations<br/><br/></strong><strong>What does the job involve?<br/><br/></strong><strong>Summary:</strong> Responsible for directing the functions and activities of our operations organization to include manufacturing, production control, supply chain, continuous improvement, facilities, and tooling. The Director of SSP Operations will develop strategies to achieve operational objectives for daily, weekly, monthly, quarterly, and annual metrics. Duties involve directing the Operations organization on a daily basis to ensure the execution of the company business plan while simultaneously implementing Continuous Improvement initiatives that will deliver long term benefits.<br/><br/><strong>Essential Duties and Responsibilities:<br/><br/></strong>Under general supervision, must be able to perform a variety of job duties including, but not limited to:<br/><br/><ul><li>Ensure the Operations organization accomplishes Safety, Quality, Schedule, and Cost performance objectives. When misses occur, develop a credible recovery plan with the team.</li><li>Manage Key Performance Indicators and Reporting on daily performance.</li><li>Champion and initiate Continuous Improvement projects to increase Revenue per Square Foot and Revenue per Employee.</li><li>Implement Lean Manufacturing principles.</li><li>Identify new opportunities to impact business and operations goals positively. Manages these projects to rapid completion.</li><li>Direct and coordinate manufacturing activities based on policies, objectives, and programs spanning manufacturing functions.</li><li>Determine performance and product quality and direct accountability for that performance.</li><li>Brief and communicate with customers, suppliers, and corporate executives with high intensity and professionalism.</li><li>Follow all Senior policies and procedures.</li><li>Other duties with the work as assigned.<br/><br/></li></ul>In addition to the above, the Director is to maintain an organized, clean, and safe work area using safety standards and expectations while adhering to all quality practices. Senior is an Equal Opportunity Employer. Reasonable accommodation may be made to enable individuals with disabilities to perform essential functions.<br/><br/><strong>Education and/or Experience:<br/><br/></strong><ul><li>Bachelor’s degree in business or an engineering discipline. MS or MBA degree is highly desirable</li><li>More than 10 years of progressive manufacturing leadership experience and responsibility.</li><li>Experience leading people and obtaining results through others, with excellent verbal and written communication skills.</li><li>Proven track record of driving results in an Assembly or Machining (3, 4, and 5 axis) environment.<br/><br/></li></ul><strong>Required Skills:<br/><br/></strong><ul><li>Proven analytical, problem solving, and process improvement ability.</li><li>Working knowledge of general aerospace quality requirements.</li><li>Ability to understand and apply the production planning processes.</li><li>Ability to apply lean manufacturing methodology and problem-solving skills to drive business improvements in a metric-driven environment.</li><li>Demonstrated ability to develop a strategic plan to meet key business objectives/metrics in the areas of Safety, Quality, Delivery, Inventory, and Cost.</li><li>Demonstrated ability to manage multiple tasks and priorities and easily adapt to changing situations and priorities.</li><li>Must be computer literate, particularly in spreadsheet; financial; inventory and production planning and tracking applications.</li><li>Demonstrated ability to develop, execute and deliver results in conformance with action plans.</li><li>Proven ability to lead large organization in a fast-paced short cycle manufacturing environment.<br/><br/></li></ul><strong>ITAR Compliance:<br/><br/></strong><ul><li>Access to our facility (and, therefore, employment) is restricted under the International Traffic in Arms Regulations (ITAR) and, or Export Administration Regulations (EAR) to U.S. Citizens, lawful permanent residents, U.S. refugees, asylees or temporary residents under amnesty provisions [as defined in 8 USC 1324b(a)(3)] and properly licensed foreign persons. Applicants receiving a conditional offer of employment will be required to provide information to determine whether they are subject to these regulations and, if so, to assess their country of chargeability for export control purposes. Additionally, potential employee’s names will be screened against the Consolidated Screening List (maintained by the United States government) to determine eligibility to receive technical data.</li></ul>", "responsibilities": "Responsible for directing the functions and activities of our operations organization to include manufacturing, production control, supply chain, continuous improvement, facilities, and tooling. The Director of SSP Operations will develop strategies to achieve operational objectives for daily, weekly, monthly, quarterly, and annual metrics. Duties involve directing the Operations organization on a daily basis to ensure the execution of the company business plan while simultaneously implementing Continuous Improvement initiatives that will deliver long term benefits.", "qualifications": {"required": "Bachelor’s degree in business or an engineering discipline. MS or MBA degree is highly desirable\nMore than 10 years of progressive manufacturing leadership experience and responsibility.\nExperience leading people and obtaining results through others, with excellent verbal and written communication skills.\nProven track record of driving results in an Assembly or Machining (3, 4, and 5 axis) environment.", "preferred": "Proven analytical, problem solving, and process improvement ability.\nWorking knowledge of general aerospace quality requirements.\nAbility to understand and apply the production planning processes.\nAbility to apply lean manufacturing methodology and problem-solving skills to drive business improvements in a metric-driven environment.\nDemonstrated ability to develop a strategic plan to meet key business objectives/metrics in the areas of Safety, Quality, Delivery, Inventory, and Cost.\nDemonstrated ability to manage multiple tasks and priorities and easily adapt to changing situations and priorities.\nMust be computer literate, particularly in spreadsheet; financial; inventory and production planning and tracking applications.\nDemonstrated ability to develop, execute and deliver results in conformance with action plans.\nProven ability to lead large organization in a fast-paced short cycle manufacturing environment."}, "skills": ["Manufacturing", "Production Control", "Supply Chain", "Continuous Improvement", "Lean Manufacturing", "Problem Solving", "Strategic Planning", "Leadership", "Communication", "Computer Skills"], "postedDate": "2 weeks ago", "url": "https://www.linkedin.com/jobs/view/3995499156"}