{"jobTitle": "Field Operations Manager", "company": {"name": "V3 Electric, Inc", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Renewable Energy Semiconductor Manufacturing", "description": "<strong>Job Title: </strong>Field Operations Manager<br/><br/><strong>Salary Range:</strong> $80,000 - $90,000 Annual Salary<br/><br/><ul><li>In-Office Required Position, Remote Work is not an option<br/><br/></li></ul><strong><em>About Us:<br/><br/></em></strong>At V3, we have a young, hungry spirit to work hard and do what is right. We are disrupting the energy industry, and that is our driving purpose. We believe in freedom of choice. Americans should be able to choose where and how we buy our energy, the same way we choose to buy everything else. Without the driving force of competition, utility providers have become slow, overpriced monopolies. Introducing competition to the energy energy market will bring innovation, a better customer experience, and lower prices. Join us in revolutionizing the energy industry and taking back the power of choice with solar power. This is the future of energy.<br/><br/><strong>Position Overview:<br/><br/></strong>As the Field Operations Manager, you will play a crucial role in overseeing and optimizing the day-to-day operations of our field teams. You will be responsible for managing a team of field managers and ensuring the successful execution of solar projects from inception to completion. This role requires a blend of project management expertise, leadership skills, and a deep understanding of solar energy systems.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Lead and manage a team of field operations managers, providing guidance, support, and mentorship to ensure high performance and achievement of goals.</li><li>Oversee the planning, scheduling, and execution of solar projects, ensuring adherence to timelines, budgets, and quality standards.</li><li>Develop and implement operational policies, procedures, and best practices to enhance efficiency and effectiveness.</li><li>Conduct regular site visits to assess project progress, address challenges, and identify opportunities for improvement.</li><li>Monitor and analyze key performance indicators (KPIs) to track operational performance and implement corrective actions as needed.</li><li>Foster a culture of safety, quality, and continuous improvement within the field operations team.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Knowledge of solar energy systems and installation practices is needed</li><li>Proven experience managing and leading teams, with a strong focus on accountability, performance management, and employee development.</li><li>Excellent communication skills, with the ability to effectively collaborate with internal and external stakeholders at all levels.</li><li>Strong analytical and problem-solving skills, with the ability to make data-driven decisions.</li><li>Demonstrated ability to manage multiple projects simultaneously in a fast-paced environment.</li><li>High level of responsibility, integrity, and professionalism.</li><li>Strong leadership qualities with a proactive and results-driven approach.<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Comprehensive health, dental, and vision insurance </li><li>401(k)</li><li>PTO + Holidays </li><li>Ongoing training and professional development opportunities </li><li>Opportunities for career advancement within a growing company</li></ul>", "responsibilities": "Lead and manage a team of field operations managers, providing guidance, support, and mentorship to ensure high performance and achievement of goals. Oversee the planning, scheduling, and execution of solar projects, ensuring adherence to timelines, budgets, and quality standards. Develop and implement operational policies, procedures, and best practices to enhance efficiency and effectiveness. Conduct regular site visits to assess project progress, address challenges, and identify opportunities for improvement. Monitor and analyze key performance indicators (KPIs) to track operational performance and implement corrective actions as needed. Foster a culture of safety, quality, and continuous improvement within the field operations team.", "qualifications": {"required": "Knowledge of solar energy systems and installation practices is needed Proven experience managing and leading teams, with a strong focus on accountability, performance management, and employee development. Excellent communication skills, with the ability to effectively collaborate with internal and external stakeholders at all levels. Strong analytical and problem-solving skills, with the ability to make data-driven decisions. Demonstrated ability to manage multiple projects simultaneously in a fast-paced environment. High level of responsibility, integrity, and professionalism. Strong leadership qualities with a proactive and results-driven approach.", "preferred": null}, "skills": ["Solar Energy", "Project Management", "Leadership", "Team Management", "Operations Management", "Solar Installation", "Safety", "Quality Management", "Continuous Improvement"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "Comprehensive health, dental, and vision insurance 401(k) PTO + Holidays Ongoing training and professional development opportunities Opportunities for career advancement within a growing company", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995400953"}