{"jobTitle": "Production and Line Plan Coordinator", "company": {"name": "Globe International Ltd.", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Wholesale", "description": "<strong>Production and Line Plan Coordinator</strong><p>Globe International, we are the home of Globe Shoes, Skateboards and Apparel, Salty Crew Apparel, Impala Roller Skates, It’s Now Cool Swimwear, Szade Eyewear, and FXD Workwear.</p><p><br/></p><p>Globe International is looking for a smart, motivated, and data-driven Production and Line Plan Coordinator to join our operations team. </p><p><br/></p><p>We are looking for a meticulous, self-starter, who enjoys collaborating, is looking to continuously learn and grow, and is not afraid of getting their hands dirty in Excel. </p><p><br/></p><p>The Production Coordinator will work as part of our operations team and will perform all of the below functions across all brands in our Multi Brand Division (Globe, Impala, FXD, Szade, and It’s Now Cool). The ability to consider multiple variables, critically think, and trouble shoot will be key to the success of this role. </p><p>The ideal candidate is initiative-taking, competent in prioritizing, and works with little supervision. Excellent typing skills and proficient knowledge of Excel, including writing basic macros and VLookups, is REQUIRED for this position.</p><p><br/></p><p><strong>Line Plan:</strong></p><ul><li>Maintain and set up all Line Plans</li><li>Ensure Line Plan data is updated and accurate at all times with ongoing maintenance throughout the season(s)</li><li>Work with the different product teams to gather necessary info and confirm accuracy, as well as create and maintain a calendar of key dates for production/sales meetings/samples</li><li>Maintain data integrity in line plan formulas</li><li>Work with the sales managers to determine wholesale and retail prices across all currencies</li><li>Review costing and margin</li></ul><p><strong>ERP:</strong></p><ul><li>Seasonal line plan uploads or manual update, when data transferred from another region’s database</li><li>Ensure ERP data is updated and accurate at all times with ongoing maintenance throughout the season(s)</li><li>Costing Updates: Maintain FOB, Wholesale and Retail prices</li><li>Create and Issue UPCs, as needed</li><li>BOM setup and maintenance: US, Canada, Asia</li><li>Seasonal Audit of the BOMs and Wholesale prices, at the start and at the end of the prebook season, to ensure accuracy of the BOM and the margin</li><li>Review and validate all data needed for export to NuOrder, our B2B Platform</li></ul><p><strong>Production:</strong></p><p>To be the key contact with factories for all product brands and categories from the purchase order stage. Liaise with factories to communicate information related to production volume and necessary lead-time.</p><ul><li>Issue POs in the system and to the suppliers</li><li>Constantly update the WIP, using PSR when available</li><li>Effectively communicate with sales, logistics, and other departments, in case of production delays</li><li>Work closely with the logistics department and advise EXF dates</li><li>Cost management: advi<strong>s</strong>e finance and production teams if pricing issues arise</li><li>Price ticket management</li><li>Vendor compliance management (packing &amp; ticketing by factory as required by key customers)</li><li>Salesman Samples coordination</li></ul><p>          Compile and maintain a complete list of samples ordered for upcoming sales seasons</p><p>          Create all Purchase Orders</p><p>          Work with suppliers, warehouse, logistics, and sales management to ensure a timely delivery of inbound</p><p>          samples</p><p><strong>Cash outflow management:</strong></p><ul><li>Weekly Vendor payment request</li><li>3 months payment plan</li></ul><p><strong>Perform any other duties assigned by Manager</strong></p><p><strong> </strong></p><p><strong>Qualifications and Experience:</strong></p><ul><li>Bachelor’s degree preferred</li><li>Excellent typing skills required</li><li>1-3 years of industry experience</li><li>Excellent communication skills</li><li>Elevated level of proficiency with Microsoft Excel and aptitude to learn new tools and applications quickly, including a basic understanding of Excel macros and VLookups</li><li>Curious and inquisitive with an interest in learning more about Excel and data analysis</li><li>Excellent organizational and collaboration skills</li><li>Ability to work in a rapidly changing environment</li><li>Able to lift 25 lbs.</li><li>Hours: 8:00am to 5:00pm</li><li>Where: Carson, CA</li><li>Typing &amp; Excel proficiency tests required</li><li>Compensation: Hourly – TBD based on experience</li></ul>", "postedDate": "1 week ago", "skills": ["Excel", "Data Analysis", "Communication", "Organization", "Collaboration"], "url": "https://www.linkedin.com/jobs/view/3995439454"}