{"jobTitle": "Accountant II", "company": {"name": "City of Santa Monica", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "<strong>Job Summary<br/><br/></strong>Performs professional accounting activities of increasing responsibility in support of the financial operations of City departments. Reviews routine accounting work performed by technical and clerical support staff, as assigned.<br/><br/><strong><strong> SUPERVISION </strong> <br/><br/></strong>Works under the administrative supervision of the Financial Reporting Supervisor and/or designee who outlines work, and reviews work in progress and upon completion. May exercise technical supervision over technical and clerical support staff making detailed work assignments, and frequently reviewing work in progress, and carefully reviewing completed work.<br/><br/><strong><strong>Note: The current vacancy is in the Department of Transportation. The eligibility list that is established from this recruitment will be used to fill </strong></strong> <strong> any vacancies in other departments. <br/><br/></strong><strong>Representative Duties<br/><br/></strong>Prepares and maintains financial statements, schedules and reports, including the City’s Comprehensive Annual Financial Report (CAFR); City’s Budget; grant and project reports; financial reports related to governmental, proprietary, capital and fiduciary funds; and federal and state mandated financial reports.<br/><br/>Reviews and coordinates the work of staff engaged in the preparation, maintenance and distribution of financial reports.<br/><br/>Performs and monitors a variety of complex accounting activities, including reconciliation and analysis of fiscal transactions to ensure compliance with Generally Accepted Accounting Principles (GAAP), municipal codes and policies, and federal and states laws, rules and regulations, including redevelopment laws, transit-related reporting requirements and Securities and Exchange Commission filing requirements.<br/><br/>Prepares and reviews general and subsidiary ledger journal entries. Corrects errors and/or recommends adjustments to accounts receivable, reclassification of expenditures and proposed journal entry changes.<br/><br/>Performs grant and project accounting analysis and prepares necessary documentation for funding requests, grants and subsidy drawdowns. Communicates and coordinates grant and project accounting activities with applicable funding agencies.<br/><br/>Participates in financial management reporting activities related to capital projects and fixed asset accounting.<br/><br/>Prepares, records and reviews health and retirement cost allocations.<br/><br/>Assists in the preparation of annual audit work papers, audit schedules and the Single Audit Report.<br/><br/>Researches and makes recommendations to update and/or implement new accounting procedures and to improve the efficiency and effectiveness of work processes.<br/><br/>Collects, interprets and updates statistical data for use in financial reporting, benchmarking, and performance measurement.<br/><br/>Assists City departments in the preparation of various reports having fiscal and/or budgetary impacts and financial reporting requirements. Provides assistance to City staff in the effective use of the City’s automated financial system, as necessary.<br/><br/>Responds to various inquiries, including information request regarding financial policies and procedures and municipal codes, rules and regulations. Makes referrals to appropriate source(s), as necessary.<br/><br/>Trains, coordinates and reviews the work of staff, as assigned.<br/><br/>Performs other related duties, as assigned.<br/><br/><strong>Requirements<br/><br/></strong><strong> Knowledge, Abilities, and Skills </strong><strong>:<br/><br/></strong><strong>Knowledge Of<br/><br/></strong>Principles, practices and procedures of accounting.<br/><br/>Principles of financial administration, including recordkeeping, budgeting, reporting and auditing.<br/><br/>Generally Accepted Accounting Principles (GAAP).<br/><br/>Applicable federal, state and local laws and regulations.<br/><br/>Research and report writing techniques.<br/><br/>Principles of mathematics and basic statistics.<br/><br/>Computer word processing, spreadsheet and database applications used with modern accounting systems.<br/><br/>Modern office procedures, practices and systems.<br/><br/>Effective customer service techniques.<br/><br/><strong>Ability To<br/><br/></strong>Analyze data and prepare clear, concise and accurate financial statements and reports.<br/><br/>Conduct complex financial analysis.<br/><br/>Prepare and maintain comprehensive spreadsheets, schedules and reports.<br/><br/>Understand and apply Generally Accepted Auditing Standards (GAAS).<br/><br/>Analyze and develop effective solutions to fiscal and accounting problems.<br/><br/>Interpret and explain financial policies and procedures, including municipal codes, rules and regulations.<br/><br/>Lead, train and coordinate the work of staff.<br/><br/>Communicate effectively, both orally and in writing.<br/><br/>Establish and maintain effective and cooperative working relationships with City employees, various business and agencies, and the general public.<br/><br/>Provide effective customer service.<br/><br/><strong>Skill In<br/><br/></strong>Using a personal computer and applicable software applications.<br/><br/><strong>Education, Training, And Experience<br/><br/></strong>Graduation from an accredited college or university with a Bachelor’s degree in Accounting, Business Administration, or a closely related field.<br/><br/>Two years of recent, paid work experience performing increasingly responsible accounting duties including analysis, preparation and maintenance of financial reports. Governmental accounting experience is desirable.<br/><br/><strong>Licenses And Certificates<br/><br/></strong>None.<br/><br/><strong>Supplemental Information<br/><br/></strong>The City of Santa Monica is a progressive, inclusive and culturally-rich community. As leaders in public service, we strive to be an employer of choice by attracting and retaining a workforce where people of diverse races, religions, cultures and lifestyles thrive. Our goal is to create a welcoming and inclusive environment where our employees are empowered to perform at their highest level and where their differences make a positive impact.<br/><br/>The City is an equal opportunity employer and strives to build balanced teams from all walks of life without regard to race, color, ethnicity, religion, national origin, age, sex, sexual orientation, gender identity, marital status, ancestry, disability, genetic information, veteran status, or any other status protected under federal, state and/or local law. We aim to create a workplace that celebrates and embraces the diversity of our employees. Join us!<br/><br/><strong>Special assistance with the application and examination process is available, upon request, for persons with disabilities. Call (310) 458-8246, TDD (310) 458-8696 (Hearing Impaired Only).<br/><br/></strong><strong>Please note the request for reasonable accommodations must be made to Human Resources at least three work days prior to the examination.<br/><br/></strong><strong> HOW TO APPLY : </strong>All applicants must submit an online City application and required supplemental questions to be considered for this position. Please note, applications may be rejected if incomplete. Resumes, CVs and cover letters are not reviewed as part of the application screening process and should not be submitted.<br/><br/><strong> NOTE : You must submit a copy of your college level transcripts or diploma with your application. Applicants who indicate receipt of college level coursework or degree from a foreign institution must provide United States credential equivalency verification along with a copy of your college diploma/transcripts. All materials must be received in the Human Resources Department no later than close of business on the application closing date. Failure to do so will result in your application being disqualified. You must upload and attach a scanned copy of your transcripts or diploma to your on-line application.<br/><br/></strong><strong> SELECTION PROCESS :</strong> All applicants will be reviewed and only those candidates determined to be <strong>most qualified </strong>on the basis of experience, training and education, as submitted, will be invited to participate further in the selection process. Testing may consist of a combination of any of the following and is subject to change as needs dictate:<br/><br/><strong>Testing May Consist Of The Following<br/><br/></strong><strong>Training &amp; Experience Evaluation - Qualifying <br/><br/></strong><strong><strong>Oral Interview - 100%<br/><br/></strong></strong><strong>Working Conditions<br/><br/></strong>Work is performed primarily indoors in a busy office environment with a consistent need to meet strict deadlines. Routine work assignments are performed with minimal supervision. Office work requires sitting for prolonged periods of time and using a computer keyboard and screen. Physical demands include standing, kneeling, bending, reaching and grasping. May be required to work evenings and/or weekends.<br/><br/>The City's liberal fringe benefits for full-time employment include sick leave, holiday and vacation pay, the Public Employees Retirement System, medical, dental and vision insurance, credit union, deferred compensation, tuition reimbursement, Dependent Care Assistance Plan and Marine Park Childcare Center.<br/><br/>Closing Date/Time: 8/27/2024 5:30 PM Pacific", "responsibilities": "Prepares and maintains financial statements, schedules and reports, including the City’s Comprehensive Annual Financial Report (CAFR); City’s Budget; grant and project reports; financial reports related to governmental, proprietary, capital and fiduciary funds; and federal and state mandated financial reports.<br/><br/>Reviews and coordinates the work of staff engaged in the preparation, maintenance and distribution of financial reports.<br/><br/>Performs and monitors a variety of complex accounting activities, including reconciliation and analysis of fiscal transactions to ensure compliance with Generally Accepted Accounting Principles (GAAP), municipal codes and policies, and federal and states laws, rules and regulations, including redevelopment laws, transit-related reporting requirements and Securities and Exchange Commission filing requirements.<br/><br/>Prepares and reviews general and subsidiary ledger journal entries. Corrects errors and/or recommends adjustments to accounts receivable, reclassification of expenditures and proposed journal entry changes.<br/><br/>Performs grant and project accounting analysis and prepares necessary documentation for funding requests, grants and subsidy drawdowns. Communicates and coordinates grant and project accounting activities with applicable funding agencies.<br/><br/>Participates in financial management reporting activities related to capital projects and fixed asset accounting.<br/><br/>Prepares, records and reviews health and retirement cost allocations.<br/><br/>Assists in the preparation of annual audit work papers, audit schedules and the Single Audit Report.<br/><br/>Researches and makes recommendations to update and/or implement new accounting procedures and to improve the efficiency and effectiveness of work processes.<br/><br/>Collects, interprets and updates statistical data for use in financial reporting, benchmarking, and performance measurement.<br/><br/>Assists City departments in the preparation of various reports having fiscal and/or budgetary impacts and financial reporting requirements. Provides assistance to City staff in the effective use of the City’s automated financial system, as necessary.<br/><br/>Responds to various inquiries, including information request regarding financial policies and procedures and municipal codes, rules and regulations. Makes referrals to appropriate source(s), as necessary.<br/><br/>Trains, coordinates and reviews the work of staff, as assigned.<br/><br/>Performs other related duties, as assigned.", "qualifications": {"required": "Graduation from an accredited college or university with a Bachelor’s degree in Accounting, Business Administration, or a closely related field.<br/><br/>Two years of recent, paid work experience performing increasingly responsible accounting duties including analysis, preparation and maintenance of financial reports. Governmental accounting experience is desirable.", "preferred": "None"}, "skills": ["Accounting", "Financial Administration", "GAAP", "Federal, State and Local Laws and Regulations", "Research and Report Writing", "Mathematics and Basic Statistics", "Computer Word Processing", "Spreadsheet and Database Applications", "Modern Office Procedures", "Customer Service"], "postedDate": "2 weeks ago", "benefits": "The City's liberal fringe benefits for full-time employment include sick leave, holiday and vacation pay, the Public Employees Retirement System, medical, dental and vision insurance, credit union, deferred compensation, tuition reimbursement, Dependent Care Assistance Plan and Marine Park Childcare Center.", "url": "https://www.linkedin.com/jobs/view/3995531155"}