{"jobTitle": "Assistant Store Manager", "company": {"name": "Confidential", "industry": "Retail Luxury Goods and Jewelry", "size": "Not specified", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$24.00/hr - $24.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Sales, and Business Development", "industry": "Retail Luxury Goods and Jewelry and Wholesale Luxury Goods and Jewelry", "description": "Join a prestigious luxury brand known for exceptional craftsmanship and customer service. We seek a dynamic Assistant Store Manager to enhance our retail operations and customer experience. Support the Store Manager in daily operations, customer service excellence, and achieving sales targets. Lead the team, maintain high standards, and drive business growth.", "responsibilities": "Operational Management: Assist in store operations, inventory, and visual merchandising. Ensure compliance with company policies and procedures. Analyze sales performance and recommend improvements. Customer Service: Deliver exceptional customer service. Resolve customer complaints professionally. Implement initiatives to boost client satisfaction. Sales and Business Development: Execute sales strategies with the Store Manager. Identify opportunities for sales growth. Monitor market trends and competitor activities. Visual Merchandising: Maintain visual presentation to brand standards. Ensure a luxurious store environment. Represent the brand professionally.", "qualifications": {"required": "Not specified", "preferred": "Bachelor's degree preferred. At least 3 years in retail management, luxury sector preferred. Leadership, communication, sales, customer service, retail software proficiency. Passion for luxury retail, integrity, attention to detail, adaptability."}, "skills": ["Leadership", "Communication", "Sales", "Customer Service", "Retail Software Proficiency"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive salary and performance-based bonuses. Comprehensive benefits, including health, dental, and retirement plans. Professional growth opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3995971353"}