{"jobTitle": "YOUTUBE COORDINATOR", "company": {"name": "Little Dot Studios Americas", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "40,000.00/yr - 50,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Media Production", "description": "We are recruiting for a YouTube Coordinator to join the team to work on optimizing video content for YouTube and social platforms across a range of verticals, specifically for weekday evening and weekend shifts. We are looking for a multi-skilled coordinator who is enthusiastic and passionate and can become a key member of the Little Dot Studios team. They’ll need to be proactive and enthusiastic with a range of skills and interests.<br/><br/>The role will require being available:<br/><br/><ul><li> Friday - Sunday between 9am - 6pm PT </li><li> Monday - Tuesday between 4pm - 12am PT <br/><br/></li></ul>The day-to-day role will include video optimization, graphic design, copywriting, YouTube channel maintenance, content logging, channel uploads and other general support to the Channel Management team.<br/><br/>We are a digital content studio and broadcaster, specializing in distribution and monetization of video content across YouTube and all social platforms, as well as production of original and brand-funded video content. We manage YouTube channels and social video for over 100 global TV brands, from Gordon Ramsay to Formula E. We also produce original and branded video content, and have launched several award-winning branded campaigns. We have offices in London, Munich, Berlin and Los Angeles.<br/><br/><strong>How You Will Spend Your Time<br/><br/></strong><ul><li>Helping to build and maintain YouTube channels: Optimizing video assets with Photoshop designer thumbnails and well written titles/descriptions, utilizing all YouTube products, creative ideation and uploading to a schedule agreed with the channel management team</li><li>Growing a YouTube audience, and understanding the types of content that keeps them engaged</li><li>Managing community features on YouTube, including creation of images, GIFs and social posts</li><li>Writing copy for posts on YouTube, understanding the importance of editorial voice and tone</li><li>Using YouTube analytics to help inform strategic channel decisions</li><li>Managing a materials library, following existing edit processes and naming conventions<br/><br/></li></ul><strong>What You Need To Succeed<br/><br/></strong>Skills matter, experience is useful, attitude is everything.<br/><br/><ul><li>Excellent knowledge of YouTube and social media platforms and an interest in the differences between them</li><li>An understanding of YouTube analytics</li><li>Good working knowledge of Photoshop to create YouTube thumbnails</li><li>Excellent attention to detail and ability to proof-check your own work</li><li>Excellent knowledge of different videos formats, video compression, sound/video synchronization</li><li>Team player with a hard-working flexible attitude, a good sense of humor and an interest in working in a dynamic start-up environment</li><li>Some knowledge of the YouTube and Facebook content management system and other video platforms (bonus)</li><li>Proficiency in other languages (bonus)<br/><br/></li></ul><strong>DIVERSITY &amp; INCLUSION<br/><br/></strong>We are committed to building a diverse and inclusive workforce at all levels at Little Dot Studios, which reflect our varied digital audiences and communities we work and live in. We aim to ensure every staff member and freelancer, in particular those from underrepresented groups, experience Little Dot in a way that allows them to realize their full potential.<br/><br/><strong>AT LITTLE DOT STUDIOS YOU CAN...<br/><br/></strong>🍏 <strong>Stay healthy</strong> with a monthly health &amp; wellness stipend and free access to counseling sessions<br/><br/>🍻 <strong>Enjoy r</strong><strong>egular Happy Hours</strong>, treats and events with your team<br/><br/>⏱ <strong>Plan ahead</strong> with a 401K retirement fund<br/><br/>🌳 <strong>Support your family</strong> with medical, dental &amp; vision insurance<br/><br/>📚 <strong>Invest in your growth </strong>both personally &amp; professionally with our Learning &amp; Development Program<br/><br/>🏡 <strong>Work f</strong><strong>ully remote </strong>from anywhere, with access to co-working locations and monthly reimbursement for home tech expenses<br/><br/>✈️ <strong>Take u</strong><strong>nlimited PTO</strong> for vacations, family time, or mental health days<br/><br/>🌞 <strong>Enjoy long summer weekends </strong>by working half days on Friday<br/><br/>Must have unrestricted work authorization to work in the United States.<br/><br/><strong><em>Little Dot Studios </em></strong><em>is committed to a policy of Equal Employment Opportunity and does not unlawfully discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin, ancestry, sex, gender, pregnancy, age over 40, physical or mental disability, veteran or military status, genetic information, sexual orientation, gender identity, gender expression, marital status, registered domestic partner status or any other basis prohibited by applicable law. Applicants with disabilities may be entitled to reasonable accommodation. Please inform LDS if you need assistance to complete any forms or to otherwise participate in the application process. LDS will consider for employment qualified applicants with a criminal history consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring Ordinance.<br/><br/></em>Not accepting submissions from search firms or recruiters.", "responsibilities": "The role will require being available:<br/><br/><ul><li> Friday - Sunday between 9am - 6pm PT </li><li> Monday - Tuesday between 4pm - 12am PT <br/><br/></li></ul>The day-to-day role will include video optimization, graphic design, copywriting, YouTube channel maintenance, content logging, channel uploads and other general support to the Channel Management team.", "qualifications": {"required": "Excellent knowledge of YouTube and social media platforms and an interest in the differences between them\nAn understanding of YouTube analytics\nGood working knowledge of Photoshop to create YouTube thumbnails\nExcellent attention to detail and ability to proof-check your own work\nExcellent knowledge of different videos formats, video compression, sound/video synchronization\nTeam player with a hard-working flexible attitude, a good sense of humor and an interest in working in a dynamic start-up environment\nSome knowledge of the YouTube and Facebook content management system and other video platforms (bonus)\nProficiency in other languages (bonus)", "preferred": ""}, "skills": ["YouTube", "Social Media", "Photoshop", "Video Editing", "Content Management"], "postedDate": "2 weeks ago", "benefits": "🍏 Stay healthy with a monthly health &amp; wellness stipend and free access to counseling sessions<br/><br/>🍻 Enjoy r<strong>egular Happy Hours</strong>, treats and events with your team<br/><br/>⏱ Plan ahead with a 401K retirement fund<br/><br/>🌳 Support your family with medical, dental &amp; vision insurance<br/><br/>📚 Invest in your growth both personally &amp; professionally with our Learning &amp; Development Program<br/><br/>🏡 Work fully remote from anywhere, with access to co-working locations and monthly reimbursement for home tech expenses<br/><br/>✈️ Take unlimited PTO for vacations, family time, or mental health days<br/><br/>🌞 Enjoy long summer weekends by working half days on Friday", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995408647"}