{"jobTitle": "Director, Clinical Site", "company": {"name": "Velocity Clinical Research, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Health Care Provider", "industry": "Biotechnology Research", "description": "Velocity Clinical Research is an owned and integrated research site organization, providing excellence in patient care, high quality data and fully integrated research sites. At Velocity, we align our values and behaviors to give our employees the best chance of delivering on our brand promise to bring innovative medical treatments to patients. We are committed to making clinical trials succeed by generating high quality data from as many patients as possible, as quickly as possible while providing exemplary patient care at every step.<br/><br/>As an employee of Velocity, you are the most integral part of our mission. For talented candidates who perform at a high level, Velocity will invest to support career advancement and reward performance. Whether you are new to clinical research or are an industry veteran, we invite you to apply to Velocity.<br/><br/>Benefits include medical, dental and vision insurance, paid time off and company holidays, 401(k) retirement plan with company-match, and an annual incentive program.<br/><br/><strong>Summary<br/><br/></strong>The Clinical Site Director is responsible for managing the overall business and clinical operations of the site to ensure that appropriate targets are met. The Clinical Site Director is responsible for managing the site’s annual and forecast operating budgets and for the efficient coordination, organization and conduct of clinical trials. The Clinical Site Director oversees and manages all aspects of the clinical trial process including study feasibility, clinic staffing, patient recruitment, study conduct and regulatory compliance. The Clinical Site Director is responsible for ensuring the health and safety of study patients and staff.<br/><br/>Duties/Responsibilities<br/><br/><ul><li>Work with the Senior Director of Clinical Operations to manage the operational budget and meet/exceed the site’s financial, operational, and study-specific targets.</li><li>Maintain complete (24/7) control over the overall operations and management of clinical research trials at the site</li><li>Identify and implement strategies to expand the research capabilities at the site - in line with the overall site business and growth plans</li><li>Oversee the implementation and maintenance of Velocity quality standards at the site ensuring that the conduct of clinical studies and the collection of patient data is in accordance with ICH GCPs and Velocity SOPs</li><li>Work with the Medical Director to address any study and/or clinical quality related </li><li>Ensure timely and appropriate communications occur with Sponsors, CROs and IRBs as necessary </li><li>Develop site staffing plans to ensure the successful and efficient conduct of research studies. Identify and fulfil any site resource needs which are necessary to successfully conduct and/or recruit research studies.</li><li>Oversee the development of the patient recruitment plan and patient outreach process. Make ongoing adjustments/modifications to recruitment strategies based upon the timely review of results to ensure financial and study-specific targets. Closely collaborate with any external vendors to facilitate successful patient enrollment strategies.</li><li>Manage the performance of site staff members, delegating appropriate and challenging assignments to encourage growth, development and responsibility. Responsible for ensuring the ongoing training needs of site staff members are met.</li><li>Responsible for the assurance of all site staff complete required trainings.</li><li>Establish and communicate performance expectations and guidelines to site staff </li><li>Facilitate annual performance evaluation process with site staff. </li><li>Identify and manage issues, concerns and problems related to staff conduct and </li><li>Identify and build relationships with outside medical practices, pharmacies, and other health care professionals/organizations to aid in the patient recruitment process.</li><li>Conduct business development activities on behalf of the site and Velocity with sponsors, CROs, CRAs and any third-party study vendors, as appropriate.</li><li>Responsible for overseeing the proper reporting of site revenues, preparation of financial projections, invoicing to sponsors/CROs, and A/R collections.</li><li>Share best practices with other Velocity site locations with the goal of raising the overall level of operational competencies at Velocity.</li><li>Ensure completeness, accuracy and timeliness of Feasibility Questionnaires, CDAs, CVs and essential regulatory documents from study start-up phase until site initiation<br/><br/><br/></li></ul>Required Skills/Abilities<br/><br/><ul><li>Expertise in project management demonstrated ability to successfully manage people/projects. Proactive problem-solving abilities and follow-through</li><li>Knowledge of field organizational strategies - The ability to adapt to a rapidly changing work environment. Successful decentralized team management and situational responsive decision- </li><li>Extensive knowledge of clinical research - Understands the drug development </li><li>Knowledgeable about the critical elements for success in clinical trials; participation in and contribution to these activities. Ability to review protocols, programs, and assess the success of a project.</li><li>Strong communication and presentation skills - Demonstrates strong written and verbal communication skills. Ability to establish and maintain positive Sponsor, team members and internal relationships. Ability to conduct effective presentations.</li><li>Computer skills - Working knowledge of MS Office suite, Clinical Conductor CTMS and relevant CRM Able to generate business correspondence, create forms and generate reports as required.</li><li>Practices professionalism and integrity in all actions – Demonstrated ability to foster concepts of teamwork, cooperation, self- control, and flexibility to get the work done</li><li>Ability to communicate effectively in English (both verbal and written).</li><li>Up to 10% travel, as needed, for project team meetings, client presentations and other professional meetings/conferences as needed.</li><li>Other duties as assigned<br/><br/><br/></li></ul>Education and Experience<br/><br/><ul><li>Bachelor’s degree preferred; Advanced degree suggested or equivalent clinical research </li><li>5+ years of clinical management experience or equivalent applicable experience in clinical research industry<br/><br/><br/></li></ul>Physical Requirements<br/><br/><ul><li>Prolonged periods of sitting at a desk and working on a </li><li>Must be able to lift up to 15 pounds at <br/><br/><br/></li></ul>NOTE The above Job Description is intended to communicate the general function of the mentioned position and by no means should be considered an exhaustive or complete outline of the specific tasks and functions that will be required. Additionally, specific tasks and duties of the position are subject to change as the Company, the department and circumstances change. All employees are expected to perform their duties within their ability as required by the job and/or as requested by management.", "responsibilities": "The Clinical Site Director is responsible for managing the overall business and clinical operations of the site to ensure that appropriate targets are met. The Clinical Site Director is responsible for managing the site’s annual and forecast operating budgets and for the efficient coordination, organization and conduct of clinical trials. The Clinical Site Director oversees and manages all aspects of the clinical trial process including study feasibility, clinic staffing, patient recruitment, study conduct and regulatory compliance. The Clinical Site Director is responsible for ensuring the health and safety of study patients and staff.", "qualifications": {"required": "Expertise in project management demonstrated ability to successfully manage people/projects. Proactive problem-solving abilities and follow-through\nKnowledge of field organizational strategies - The ability to adapt to a rapidly changing work environment. Successful decentralized team management and situational responsive decision- \nExtensive knowledge of clinical research - Understands the drug development \nKnowledgeable about the critical elements for success in clinical trials; participation in and contribution to these activities. Ability to review protocols, programs, and assess the success of a project.\nStrong communication and presentation skills - Demonstrates strong written and verbal communication skills. Ability to establish and maintain positive Sponsor, team members and internal relationships. Ability to conduct effective presentations.\nComputer skills - Working knowledge of MS Office suite, Clinical Conductor CTMS and relevant CRM Able to generate business correspondence, create forms and generate reports as required.\nPractices professionalism and integrity in all actions – Demonstrated ability to foster concepts of teamwork, cooperation, self- control, and flexibility to get the work done\nAbility to communicate effectively in English (both verbal and written).\nUp to 10% travel, as needed, for project team meetings, client presentations and other professional meetings/conferences as needed.\nOther duties as assigned", "preferred": "Bachelor’s degree preferred; Advanced degree suggested or equivalent clinical research \n5+ years of clinical management experience or equivalent applicable experience in clinical research industry"}, "skills": ["Project Management", "Clinical Research", "Communication", "Presentation Skills", "Computer Skills", "MS Office", "CTMS", "CRM", "Teamwork", "English"], "postedDate": "2 weeks ago", "benefits": "Benefits include medical, dental and vision insurance, paid time off and company holidays, 401(k) retirement plan with company-match, and an annual incentive program.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996836602"}