{"jobTitle": "SHIFT SUPERVISOR (FULL TIME)", "company": {"name": "Bon Appétit Management Company", "location": "Santa Clarita, CA"}, "location": "Santa Clarita, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "Bon Appetit<br/><br/><ul><li> We are hiring immediately for a full time SHIFT SUPERVISOR position. </li><li> Location: California Institute of the Arts - 24700 Mcbean Parkway, Valencia, CA 91355 Note: online applications accepted only. </li><li> Schedule: Full time schedule. Midday and closing shifts are available, days may vary; weekends are required. More details upon interview. </li><li> Requirement: Previous supervisory experience is required. </li><li> Pay Rate: $23.00 per hour </li><li>Internal Employee Referral Bonus Available<br/><br/></li></ul><strong>We Make Applying Easy! </strong>Want to apply to this job via text messaging? Text <strong>JOB</strong> to <strong>75000 </strong>and search <strong>requisition ID number</strong><strong> 1339657. <br/><br/></strong>The advertised program is a conversational recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions: http://olivia.paradox.ai/moSkg<br/><br/>Diversity of thought and inclusion for all is what drives our success - we invite you to start your journey with us today!<br/><br/>Are you looking for a job with competitive wages and benefits, one in which you can learn and grow while making a difference in the world? We’re hiring! Bon Appétit Management Company operates more than 1,000 cafés around the country for corporations, universities, and museums, as well as a few dozen public restaurants. We’ve led the industry in socially and environmentally responsible sourcing, from sustainable seafood to cage-free eggs. We cook everything from scratch using fresh, local ingredients.<br/><br/>Learn more about careers with Bon Appétit: http://www.bamco.com/careers/<br/><br/><strong>Job Summary<br/><br/></strong><strong>Summary: </strong> Direct the activities of associates during a specific shift and oversee that assigned job expectations are completed while policy and procedure is maintained.<br/><br/><strong>Essential Duties and Responsibilities: <br/><br/></strong><ul><li>Responsible for providing training and creating work schedules.</li><li>Evaluating the performance of workers, rewarding high performers and disciplining employees who fail to meet reasonable standards of work performance.</li><li>Prepare production or sales reports for management and ensure their unit meets the expectations for quality, productivity and safety.</li><li>Acts as the contact person for employees with complaints or requests for time off.</li><li>May act as a mentor, develop employees and encourage workers to set goals and strive for advancement within the organization.</li><li>Perform other duties as assigned.<br/><br/></li></ul><strong>Associates at Bon Appétit are offered many fantastic benefits.<br/><br/></strong><strong>Full-time and part-time positions offer the following benefits</strong> to associates: Retirement Plan, Associate Shopping Program, Health and Wellness Programs, Discount Marketplace, Identity Theft Protection, Pet Insurance, Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program<br/><br/><strong>Full-time positions also offer the following benefits</strong> to associates: Medical, Dental, Vision, Life Insurance/AD, Disability Insurance, Commuter Benefits, Employee Assistance Program, Flexible Spending Accounts (FSAs)<br/><br/><strong>About Compass Group: Achieving leadership in the foodservice industry<br/><br/></strong>Compass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.<br/><br/>Qualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. We will consider for employment all qualified applicants, including those with a criminal history (including relevant driving history), in a manner consistent with all applicable federal, state, and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York Fair Chance Act.<br/><br/>Applications are accepted on an ongoing basis.<br/><br/>Bon Appetit maintains a drug-free workplace.<br/><br/>[[filter4]]", "responsibilities": "<ul><li>Responsible for providing training and creating work schedules.</li><li>Evaluating the performance of workers, rewarding high performers and disciplining employees who fail to meet reasonable standards of work performance.</li><li>Prepare production or sales reports for management and ensure their unit meets the expectations for quality, productivity and safety.</li><li>Acts as the contact person for employees with complaints or requests for time off.</li><li>May act as a mentor, develop employees and encourage workers to set goals and strive for advancement within the organization.</li><li>Perform other duties as assigned.<br/><br/></li></ul>", "postedDate": "2 weeks ago", "benefits": "Retirement Plan, Associate Shopping Program, Health and Wellness Programs, Discount Marketplace, Identity Theft Protection, Pet Insurance, Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program<br/><br/>Full-time positions also offer the following benefits to associates: Medical, Dental, Vision, Life Insurance/AD, Disability Insurance, Commuter Benefits, Employee Assistance Program, Flexible Spending Accounts (FSAs)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996011467"}