{"jobTitle": "Materials Coordinator", "company": {"name": "Thales", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "32,130.00 - 59,670.00", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "Location: Irvine, United States of America<br/><br/>Thales people architect solutions that enable two-thirds of planes to take off and land safely. We create in-flight entertainment systems that engross 50 million fliers every year and we develop the avionics that control the world’s largest commercial aircrafts. Our simulators train the next generation of pilots for fighter jets, transporters and search and rescue helicopters. And, together, each and every member of our aerospace team makes a difference.<br/><br/><strong>Materials Coordinator<br/><br/></strong>Irvine, CA (Onsite)<br/><br/><strong>Position Summary<br/><br/></strong>Thales is looking for a <strong>Materials Coordinator</strong> to perform physical and administrative tasks involved in Centralized Discrepant Material Area (CDMA); examine material to ensure the physical count matches the Quality Notification (QN) quantity; distribute materials to inventory, production work orders, material reservation, or conducts scrapping process; prepare and maintains records of items processed internally and externally.<br/><br/>In this position you will also conduct cycle counts in CDMA area to ensure inventory is accurate; create and process Quality Notifications. Individual will need to create CDMA report and distribute to all parties that are associated with department and action QN’s to proper buyer, quality or engineer personnel.<br/><br/><strong>Tier 1 - Referral Bonus Payout - $2,500<br/><br/></strong><strong>Key Areas of Responsibility<br/><br/></strong><ul><li>Analyze SAP data in support of Distribution Operations Process shipments, validate inventory movements, and make recommendations to management on optimal processing methods; Maintain relationships with internal customers, ensuring inventory accuracy and integrity are upheld.</li><li>Develop continuous process improvement plans and initiatives; maintain operational plans to support customer shipments and production needs (will involve working Saturdays and some Sundays).</li><li>Maintain and promote a safe work environment for all employees; create and sustain a culture to support lean initiatives and promote lean values.</li><li>Interfaces with other functional areas such as receiving inspection, production control and shipping department in order to complete QN task.</li><li>Create Quality Notification Reports using Excel.<br/><br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>HS Diploma with a minimum of 2 years of related experience and training.</li><li>Ability to read, analyze, and interpret general business workflows related to a warehouse distribution center; ability to write reports, business correspondence, and other communications related to the warehouse distribution center. </li><li>Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.</li><li>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists.</li><li>SAP or other ERP system experience; proficiency with MS Excel (V-lookup, pivot tables, etc.).</li><li>Utilize project management experience to communicate and coordinate teams to complete identified projects (scrapping project.)<br/><br/><br/></li></ul>If you’re excited about working with Thales, but not meeting the requirements for this position, we encourage you to join our Talent Community!<br/><br/><strong>Special Position Requirements<br/><br/></strong><ul><li>Schedule: Core Business Hours Monday-Friday and will occasionally involve working some Saturdays and Sundays.</li><li>Physical Environment: Warehouse Environment.</li><li>Physical Demands: Must be able to lift a minimum of 50 pounds.</li><li>Regulatory Compliance Requirements: None.<br/><br/><br/></li></ul><strong>What We Offer<br/><br/></strong>The anticipated TTC range for this role is $32,130.00 - $59,670.00 USD Annual. The Company reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation, depending on circumstances not related to an applicant’s status protected by local, state, or federal law.<br/><br/>Thales provides an extensive benefits program for all full-time employees working 30 or more hours per week and their eligible dependents, including the following:<br/><br/><ul><li>Elective Health and Dental plans. </li><li>Retirement Savings Plan with a company contribution and a match, and without vesting period. </li><li>Company paid holidays, vacation days, and paid sick leave. </li><li>Company provided Life Insurance.<br/><br/><br/></li></ul><strong>Why Join Us?<br/><br/></strong>Say HI and learn more about working at Thales <em>click here</em><em>.<br/><br/></em>This position will require successfully completing a post-offer background check. Qualified candidates with [a] criminal history will be considered and are not automatically disqualified, consistent with federal law, state law, and local ordinances.<br/><br/>Successful applicant must comply with federal contractor vaccine mandate requirements.<br/><br/>Thales champions inclusion and we believe diversity strengthens the fabric of our culture. We are an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br/><br/>If you need an accommodation or assistance in order to apply for a position with Thales, please contact us at talentacquisition@us.thalesgroup.com.<br/><br/>", "responsibilities": "<ul><li>Analyze SAP data in support of Distribution Operations Process shipments, validate inventory movements, and make recommendations to management on optimal processing methods; Maintain relationships with internal customers, ensuring inventory accuracy and integrity are upheld.</li><li>Develop continuous process improvement plans and initiatives; maintain operational plans to support customer shipments and production needs (will involve working Saturdays and some Sundays).</li><li>Maintain and promote a safe work environment for all employees; create and sustain a culture to support lean initiatives and promote lean values.</li><li>Interfaces with other functional areas such as receiving inspection, production control and shipping department in order to complete QN task.</li><li>Create Quality Notification Reports using Excel.<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>HS Diploma with a minimum of 2 years of related experience and training.</li><li>Ability to read, analyze, and interpret general business workflows related to a warehouse distribution center; ability to write reports, business correspondence, and other communications related to the warehouse distribution center. </li><li>Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public.</li><li>Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists.</li><li>SAP or other ERP system experience; proficiency with MS Excel (V-lookup, pivot tables, etc.).</li><li>Utilize project management experience to communicate and coordinate teams to complete identified projects (scrapping project.)<br/><br/><br/></li></ul>", "preferred": null}, "skills": ["SAP", "MS Excel", "Project Management"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "The anticipated TTC range for this role is $32,130.00 - $59,670.00 USD Annual. The Company reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation, depending on circumstances not related to an applicant’s status protected by local, state, or federal law.<br/><br/>Thales provides an extensive benefits program for all full-time employees working 30 or more hours per week and their eligible dependents, including the following:<br/><br/><ul><li>Elective Health and Dental plans. </li><li>Retirement Savings Plan with a company contribution and a match, and without vesting period. </li><li>Company paid holidays, vacation days, and paid sick leave. </li><li>Company provided Life Insurance.<br/><br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996797149"}