{"jobTitle": "Warehouse", "company": {"name": "AC Pro", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.00- $20.00 per hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Wholesale", "description": "<strong>Title: Warehouse Associate<br/><br/></strong><strong>Reports to: Branch Manager<br/><br/></strong><strong>About The Company<br/><br/></strong>AC Pro, a family-owned business, has been providing heating and air conditioning products since 1986. Our locations in California, Nevada, Arizona, and Utah offer the best products and services in the industry. Our company CULTURE is of first and foremost importance to us. Ever since the inception of AC Pro, we have striven to provide a work atmosphere that balances finding innovative ways to exceed customer expectations with providing a fulfilling lifelong career for our associates. We have strong core values that are unquestionably right and on the side that benefits our consumers, dealers, associates, and suppliers – not ourselves. The culture at AC Pro has and always will be heavily focused on our team. We want every one of our associates to look forward to coming to work each and every day.<br/><br/><strong>About The Position<br/><br/></strong>We're seeking warehouse workers to join our team who would like to work in an active, fast-paced area, learn about our products, enjoy a positive workplace with fair benefits, and help us build this company into a place where both you and your family will be proud to have you work.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Fill customer orders accurately by locating and pulling items from inventory.</li><li>Unload transfer trucks and place items into inventory.</li><li>Assist customers by retrieving orders and loading materials onto vehicles.</li><li>Complete order paperwork in order to maintain accurate records for inventory and backorders.</li><li>Work with team to ensure product targets and deadlines are met.<br/><br/></li></ul><strong>Desired Skills &amp; Experience<br/><br/></strong><ul><li>Have the ability to follow specific verbal and written instructions.</li><li>Are looking for overtime potential.</li><li>Have a strong tolerance for bending, standing, lifting, and overall hard work.</li><li>Experience with forklift is preferred<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Ability to frequently stand, walk, twist, bend, reach, stoop, kneel, and crouch for prolonged periods of time (8 hours or more a day)</li><li>Must be able to consistently lift 50 lbs. anything over 50lbs must be assisted</li><li>Ability to reach, feel, grasp, grip, carry, push, and pull</li><li>Must be able to work in various conditions that exist in a warehouse environment: cold, heat, wind, dusty, etc. wet, noisy<br/><br/></li></ul><strong>As a Member Of Our Team, You Will Enjoy<br/><br/></strong><ul><li>Competitive pay</li><li>Medical: HMO and PPO options</li><li>Dental: HMO and PPO In-Network</li><li>Vision Plan</li><li>Company-Paid Life Insurance</li><li>401(k) Retirement Plan</li><li>Weekly pay periods (every Friday)</li><li>Employee Assistance Program (EAP)</li><li>Vacation &amp; Sick Pay</li><li>Paid Holidays</li><li>Veteran’s day off with pay for associates who served in the military</li><li>Career Advancement and Development Opportunities.</li><li>Years of Service (YOS): We value and appreciate everyone's hard work and dedication. Our associates are recognized and awarded for years of service<br/><br/></li></ul><strong>Schedule: Morning shift, plus overtime and Saturdays as needed.<br/><br/></strong><strong>Pay Range: $18.00- $20.00 per hour (DOE)<br/><br/></strong>All candidates are required to pass a pre-employment drug screen following an offer of employment, as well as provide documentation of eligibility to work in the U.S.<br/><br/>Equal Opportunity Employer/ Veterans encouraged to apply", "responsibilities": "Fill customer orders accurately by locating and pulling items from inventory. Unload transfer trucks and place items into inventory. Assist customers by retrieving orders and loading materials onto vehicles. Complete order paperwork in order to maintain accurate records for inventory and backorders. Work with team to ensure product targets and deadlines are met.", "qualifications": {"required": "Have the ability to follow specific verbal and written instructions. Are looking for overtime potential. Have a strong tolerance for bending, standing, lifting, and overall hard work. Experience with forklift is preferred", "preferred": ""}, "skills": ["Forklift"], "postedDate": "2 weeks ago", "benefits": "Competitive pay, Medical: HMO and PPO options, Dental: HMO and PPO In-Network, Vision Plan, Company-Paid Life Insurance, 401(k) Retirement Plan, Weekly pay periods (every Friday), Employee Assistance Program (EAP), Vacation & Sick Pay, Paid Holidays, Veteran’s day off with pay for associates who served in the military, Career Advancement and Development Opportunities. Years of Service (YOS): We value and appreciate everyone's hard work and dedication. Our associates are recognized and awarded for years of service", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996039801"}