{"jobTitle": "Customer Growth Associate, Google Customer Solutions (English)", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "66,500-99,000", "currency": "USD"}, "jobFunction": "Sales, Advertising, and Customer Service", "industry": "Information Services and Technology, Information and Internet", "description": "<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience in a B2B sales or business development role.</li><li>Experience in advertising, consultative sales or business development through full time roles, internships, projects or academic classes.</li><li>Ability to travel to the office for client meetings and trainings as required.</li><li>Ability to communicate in English fluently in order to interact in this customer-facing sales role.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience with Google Ads and online advertising or Google Ads certified.</li><li>Experience in digital sales, client management, customer service, business development, customer outreach, marketing, consulting, or similar fields.</li><li>Familiarity with managing a portfolio or working against assigned customer goals (e.g., business growth, customer success metrics, outreach goals, etc.).</li><li>Ability to think strategically.</li><li>Excellent communication and problem-solving skills.</li><li>Interest in business and technology with a passion for helping businesses grow online.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>In this role, you will work with companies across industries to understand their needs and develop digital marketing solutions that directly impact their success. Each quarter, you will work with a collection of diverse small and medium-sized businesses that shape the communities they serve, and empower them to grow their business and reach their goals. You will learn, grow, and receive continuous training and mentorship alongside a tight-knit cohort of talented, driven, and diverse peers. You’ll work directly with leaders in business and with professionals in the world to build the knowledge of the online advertising industry and develop professional network.<br/><br/>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.<br/><br/>The US base salary range for this full-time position is $66,500-$99,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Serve as a trusted advisor to Small and Medium Business (SMB) customers and their agency partners, by building relationships with key decision-makers to understand their business goals and digital marketing plans, and help empower their business with Google advertising.</li><li>Manage a diverse set of accounts and identify opportunities where Google Ads can impact growth while tracking account growth and product adoption quarterly goals. Communicate with a high volume of customers via phone and email.</li><li>Evaluate campaign performance, make account recommendations, and mentor/influence business owners on digital marketing strategy.</li><li>Engage in essential activities to drive customer relationship growth (e.g., proactive engagement, campaign performance review, client meetings, pitches, research, internal strategy building/execution, etc.).</li><li>Deliver against business goals, while prioritizing and delivering an outstanding customer business experience to Google's advertisers.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Serve as a trusted advisor to Small and Medium Business (SMB) customers and their agency partners, by building relationships with key decision-makers to understand their business goals and digital marketing plans, and help empower their business with Google advertising.</li><li>Manage a diverse set of accounts and identify opportunities where Google Ads can impact growth while tracking account growth and product adoption quarterly goals. Communicate with a high volume of customers via phone and email.</li><li>Evaluate campaign performance, make account recommendations, and mentor/influence business owners on digital marketing strategy.</li><li>Engage in essential activities to drive customer relationship growth (e.g., proactive engagement, campaign performance review, client meetings, pitches, research, internal strategy building/execution, etc.).</li><li>Deliver against business goals, while prioritizing and delivering an outstanding customer business experience to Google's advertisers.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience in a B2B sales or business development role.\nExperience in advertising, consultative sales or business development through full time roles, internships, projects or academic classes.\nAbility to travel to the office for client meetings and trainings as required.\nAbility to communicate in English fluently in order to interact in this customer-facing sales role.", "preferred": "Experience with Google Ads and online advertising or Google Ads certified.\nExperience in digital sales, client management, customer service, business development, customer outreach, marketing, consulting, or similar fields.\nFamiliarity with managing a portfolio or working against assigned customer goals (e.g., business growth, customer success metrics, outreach goals, etc.).\nAbility to think strategically.\nExcellent communication and problem-solving skills.\nInterest in business and technology with a passion for helping businesses grow online."}, "skills": ["Google Ads", "Digital Marketing", "Sales", "Business Development", "Customer Service", "Client Management", "Communication", "Problem Solving", "Strategic Thinking"], "postedDate": "1 week ago", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996439038"}