{"jobTitle": "Executive Assistant", "company": {"name": "CyberCoders", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Retail Apparel and Fashion", "description": "<strong>Company Overview<br/><br/></strong>We are a growing manufacturing company in the fashion industry that serves some of the largest brands in the apparel space. We are expanding and continuing to grow significantly. We have a friendly, welcoming environment that embraces calloboration and continued growth.<br/><br/><strong>Position Overview<br/><br/></strong>The Executive Assistant will be responsible for providing administrative support to the CEO. The primary objective is to ensure the smooth running of the office and to assist the executives in their day-to-day activities.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Manage the executive's calendar and schedule appointments, meetings, and other events</li><li>Organize and prioritize emails, telephone calls, and mail, ensuring all correspondence is responded to in a timely and efficient manner</li><li>Prepare and review reports, presentations, and other documents for the executive team</li><li>Coordinate travel arrangements and itineraries for the executives and ensure all travel-related logistics are organized</li><li>Maintain confidentiality and handle sensitive information with discretion</li><li>Act as a liaison between the executive team and internal/external stakeholders</li><li>Handle ad-hoc projects and tasks as assigned<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in business administration or related field preferred</li><li>Proven experience as an Executive Assistant or similar administrative role</li><li>Excellent communication and interpersonal skills</li><li>Strong organizational skills and attention to detail</li><li>Ability to work under pressure and prioritize tasks effectively</li><li>Proficiency in Microsoft Office and other relevant software applications</li><li>Ability to maintain a high level of confidentiality and discretion</li><li>Flexibility to work outside of regular business hours if required<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>PTO<br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>matt.bailey@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : MB6-1814857 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Matt Bailey - Recruiting Manager<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.<br/><br/>", "responsibilities": "The Executive Assistant will be responsible for providing administrative support to the CEO. The primary objective is to ensure the smooth running of the office and to assist the executives in their day-to-day activities.", "qualifications": {"required": "Proven experience as an Executive Assistant or similar administrative role, Excellent communication and interpersonal skills, Strong organizational skills and attention to detail, Ability to work under pressure and prioritize tasks effectively, Proficiency in Microsoft Office and other relevant software applications, Ability to maintain a high level of confidentiality and discretion, Flexibility to work outside of regular business hours if required", "preferred": "Bachelor's degree in business administration or related field"}, "skills": ["Microsoft Office"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision, PTO", "remoteWork": "No", "salary": {"amount": "75,000.00/yr - 95,000.00/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3996928346"}