{"jobTitle": "Assistant Store Manager - Design, Full Time, Beverly Blvd.- West Elm", "company": {"name": "West Elm", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "We hope you're interested in building a home with us. Even if you don't feel that you meet every requirement listed in this job description, we still encourage you to apply.\n\nAbout The Team\n\nOur mission is to enhance the quality of our customers’ lives at home. We put the customer at the center of everything we do, every day. Our corporate values that guide our actions and decisions are our People First culture, customers, quality, shareholders, integrity, and corporate responsibility.\n\nOverview of the Assistant Manager of Sales and Service role\n\nYou will support the management team in achieving goals by providing World-Class service. You will serve as a role model for building relationships with customers. You will maintain presence through store supervision to ensure appropriate staff coverage in all areas of the store.\n\nResponsibilities\n\n\n\n<ul><li> Leads the store team to create an exceptional experience for customers and exceed sales goals</li><li> Ensure the sales floor is adequately staffed from a sales and tactical perspective while serving as a role model for sales associates in sales generation and service by prioritizing the customer experience</li><li> Reinforce customer service principles by coaching staff on their successes and challenges</li><li> Utilize Selling Essentials and training resources to educate team on product, improve selling skills and achieving business goals</li><li> Create and ensure a positive environment where all associates are treated fairly and with dignity in accordance with our People-First Philosophy</li><li> Ensure timely resolution of client service issues including delivery/pick-up and outstanding issues through effective use and management of client information reporting system<br/><br/><br/></li></ul>Criteria\n\n\n\n<ul><li> Excellent communication, organization and leadership skills</li><li> Superior critical thinking skills to creatively identify challenges and develop action plans in a timely manner</li><li> Great time management skills and ability to execute multiple tasks and appropriately manage competing priorities</li><li> 2-3 years of previous retail sales experience or management experience in a customer service related field<br/><br/><br/></li></ul>Physical Requirements\n\n\n\n<ul><li> Must be able to be mobile on the sales floor for extended periods of time</li><li> Must be able to lift and mobilize medium to large items, up to 75 lbs., while utilizing appropriate equipment and safety techniques</li><li> Full time associates are expected to have open availability to meet the needs of the business.</li><li> Part-Time Flex associates must be available to work a minimum of two regularly scheduled shifts on the weekend** (Friday, Saturday and/or Sunday) and two during the week (Monday to Thursday). For an associate to be scheduled 20 hours or more weekly, greater availability (beyond the minimum required above) that meets the needs of the business will be required. **Weekend availability cannot fall on the same day; an associate must be available on two separate days (Friday and Saturday, Friday and Sunday or Saturday and Sunday).<br/><br/><br/></li></ul>Our Mission Around Diversity, Equity &amp; Inclusion\n\nWe firmly believe that working in a culture focused on diversity, equity, and inclusion spurs innovation, creates healthy and high-performing teams, and delivers superior customer experiences. We will create and nurture a global company culture where we confidently bring our authentic selves to work every day: where the only criteria for advancement are the quality of our work, the contributions we make to our teams and the business, and our ability to lead; and where our individual differences—whatever they may be—are valued, explored and appreciated.\n\nBenefits Just For You\n\nThis role offers a competitive compensation package including pay and benefits. Pay is based on several factors including but not limited to education, work experience, certifications, geographic location etc. The anticipated pay range for this role will be: $26.00 - $28.00 per hour.\n\nDepending on your position and your location, here are a few highlights of what you might be eligible for:\n\n\n\n<ul><li> A generous discount on all Williams-Sonoma, Inc. brands</li><li> A 401(k) plan and other investment opportunities</li><li> A wellness program that supports your physical, financial and emotional health</li><li> Paid vacations and holidays (full-time)</li><li> Health benefits, dental and vision insurance, including same-sex domestic partner benefits (full-time)<br/><br/><br/></li></ul>Your Journey in Continued Learning\n\n\n\n<ul><li> Individual development plans and career pathing conversations</li><li> Annual performance appraisals</li><li> Cross-brand and cross-functional career opportunities</li><li> Online learning opportunities through brand specific resources and WSI University</li><li> Leadership development opportunities<br/><br/><br/></li></ul><em>WSI will not now or in the future commence an immigration case or “sponsor” an individual for this position (for example, H-1B or other employment-based immigration<br/><br/></em><em>This role is not eligible for relocation assistance.<br/><br/></em><em>Williams-Sonoma, Inc. is an Equal Opportunity Employer.<br/><br/></em><em><strong>San Francisco Locations:<br/><br/></strong></em><em>Williams-Sonoma, Inc. is an Equal Opportunity Employer. Williams-Sonoma, Inc. will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance, or other applicable state or local laws and ordinances.<br/><br/></em>About Us\n\nOur Company\n\nFounded in 1956, Williams-Sonoma, Inc. is the premier specialty retailer of high-quality products for the kitchen and home in the United States. Our family of brands are Williams Sonoma, Williams Sonoma Home, Pottery Barn, Pottery Barn teen, pottery barn kids, Rejuvenation, Mark &amp; Graham, west elm, or Outward. These brands are among the best known and most respected in the industry. We offer beautifully-designed, stylish and functional products for every area of the home, including the kitchen, living room, bedroom, home office, closet, laundry room and even outdoor spaces. We've seen some big changes since our first brick-and-mortar store opened more than half of a century ago. What hasn't changed is our passion for high-quality products, functional design, outstanding customer service, and enhancing the lives of our customers and the communities where we operate. Today, we're a multi-brand, multi-channel, global enterprise supported by state-of-the-art technology and some of the most talented teams in retailing - and we're always looking for new energy and ideas.", "responsibilities": "Leads the store team to create an exceptional experience for customers and exceed sales goals\nEnsure the sales floor is adequately staffed from a sales and tactical perspective while serving as a role model for sales associates in sales generation and service by prioritizing the customer experience\nReinforce customer service principles by coaching staff on their successes and challenges\nUtilize Selling Essentials and training resources to educate team on product, improve selling skills and achieving business goals\nCreate and ensure a positive environment where all associates are treated fairly and with dignity in accordance with our People-First Philosophy\nEnsure timely resolution of client service issues including delivery/pick-up and outstanding issues through effective use and management of client information reporting system", "qualifications": {"required": "Excellent communication, organization and leadership skills\nSuperior critical thinking skills to creatively identify challenges and develop action plans in a timely manner\nGreat time management skills and ability to execute multiple tasks and appropriately manage competing priorities\n2-3 years of previous retail sales experience or management experience in a customer service related field"}, "skills": ["Customer Service", "Sales", "Leadership", "Retail"], "postedDate": "2 weeks ago", "benefits": "A generous discount on all Williams-Sonoma, Inc. brands\nA 401(k) plan and other investment opportunities\nA wellness program that supports your physical, financial and emotional health\nPaid vacations and holidays (full-time)\nHealth benefits, dental and vision insurance, including same-sex domestic partner benefits (full-time)", "salary": {"amount": "26.00 - 28.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3996064167"}