{"jobTitle": "Senior Supply Chain Manager", "company": {"name": "Stellant Systems, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$140,000.00/yr - $160,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing, Aviation and Aerospace Component Manufacturing, and Appliances, Electrical, and Electronics Manufacturing", "description": "<strong>Overview<br/><br/></strong><strong> Job Title: Senior Supply Chain Manager <br/><br/></strong><strong> Job Location: Torrance, CA <br/><br/></strong><strong> Salary: $140,000-$160,000/yr <br/><br/></strong>Stellant Systems, a premier manufacturer of critical power amplification products where our technologies and products are unparalleled in the industry. We specialize in the manufacture of microwave devices for ground-based, airborne and satellite communications, industrial and medical equipment, and radar; we are the only U.S. supplier of space-qualified Traveling Wave Tube and Traveling Wave Tube Amplifiers. We combine cutting-edge technology with world-class engineering teams to deliver innovative solutions. Together, we form an invincible company.<br/><br/>As an employer of choice, our goal is to deliver an exceptional employee experience - we recruit diverse, high-performing talent to help our customers exceed their mission needs, which drives our employees to achieve their full potential.<br/><br/>Fundamental to our culture is our focus on core values, inclusivity in the work environment, and a unified dedication to continuous innovation and improvement. In order to serve our vast customer base ranging from the defense industry leaders, to the U.S. and allied militaries, and medical communities, we need the world’s most dedicated and talented people. If these types of projects excite you, we’d love for you to join our team and help us detect, protect, and connect.<br/><br/>This is a key position that oversees the Supply Chain operations for The Stellant Torrance, CA facility focusing on creating/increasing standard work and efficiency in core areas including: SIOP, Material Sales Forecasting, Training, Material Planning, Production Planning and Logistics and Warehouse Operations. This position is responsible for establishing holistic Supply Chain processes, KPIs, and driving operational excellence and discipline within the team. This position will be a key liaison to Finance, Program Management, Site Leadership and other Supply Chain department leads to communicate and roll out new and updated processes, tools and standard work.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Develop and implement Site Materials Planning strategies to support business goals and ensure efficient materials flow. </li><li> Align supply plans with sales forecasts, proposal/capture activity and production schedules. </li><li> Provides sound leadership to the team and ensures excellence in performance. </li><li> Develops and maintains Materials Planning KPIs that are aligned to Business KPIs and measure Materials Planning performance. </li><li> Develops and maintains excellent relationships with Supply Chain peers and other internal stakeholders. </li><li> Identify opportunities for process improvements and cost reductions within the material planning organization through use of lean tools, standard work and training. </li><li> Develop and enforce material planning policies and procedures. </li><li> Work with the procurement team to ensure timely and cost-effective supply of materials and components. </li><li> Lead regular material planning meetings to review plans, performance, and address any issues. </li><li> Communicate material plans, forecasts, and strategies to senior management and key stakeholders. </li><li> Track Key Performance Indicators (KPIs) related to material planning. </li><li> Manage and mentor a team of material planners. </li><li> Foster a collaborative and high-performing team culture. </li><li> Provide training and development opportunities to enhance team skills. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor’s Degree in purchasing &amp; supply chain management, procurement, logistics, or a related field </li><li> Minimum 10 years of experience in SCM, with at least 5 years managing a team </li><li> Proficiency in material planning software (e.g. Infor LN, SAP, Oracle) ERP and MRP systems </li><li> Knowledge of production planning and inventory management principles. </li><li> High level of attention to detail and excellent time management skills </li><li> Excellent verbal and written communication skills, with the ability to present complex information clearly and concisely. </li><li> Strong analytical and problem-solving abilities. <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> (CIP) Chartered Institute of Purchasing and Supply American Production and Inventory Control Society (APICS) or the Institute for Supply Management (ISM) </li><li> Expert knowledge of Microsoft Power BI </li><li> Infor/LN ERP System knowledge/experience <br/><br/></li></ul><strong>Stellant Systems is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status or membership in any other group protected by federal, state or local law.<br/><br/></strong><strong>To conform to U.S. Government export regulations, the applicant must be a U.S. citizen, lawful permanent resident of the U.S. (e.g. Green Card holder), or a protected individual as defined by the International Traffic in Arm Regulations (ITAR).</strong>", "responsibilities": "This is a key position that oversees the Supply Chain operations for The Stellant Torrance, CA facility focusing on creating/increasing standard work and efficiency in core areas including: SIOP, Material Sales Forecasting, Training, Material Planning, Production Planning and Logistics and Warehouse Operations. This position is responsible for establishing holistic Supply Chain processes, KPIs, and driving operational excellence and discipline within the team. This position will be a key liaison to Finance, Program Management, Site Leadership and other Supply Chain department leads to communicate and roll out new and updated processes, tools and standard work.", "qualifications": {"required": "Bachelor’s Degree in purchasing &amp; supply chain management, procurement, logistics, or a related field\nMinimum 10 years of experience in SCM, with at least 5 years managing a team\nProficiency in material planning software (e.g. Infor LN, SAP, Oracle) ERP and MRP systems\nKnowledge of production planning and inventory management principles.\nHigh level of attention to detail and excellent time management skills\nExcellent verbal and written communication skills, with the ability to present complex information clearly and concisely.\nStrong analytical and problem-solving abilities.", "preferred": "(CIP) Chartered Institute of Purchasing and Supply American Production and Inventory Control Society (APICS) or the Institute for Supply Management (ISM)\nExpert knowledge of Microsoft Power BI\nInfor/LN ERP System knowledge/experience"}, "skills": ["Supply Chain Management", "Materials Planning", "ERP", "MRP", "Production Planning", "Inventory Management", "Microsoft Power BI", "Infor LN"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996908275"}