{"jobTitle": "Clinical Patient Access Rep - Patient Access Contact Center (Full-Time, 8 Hour, Day Shift) - Remote Eligible", "company": {"name": "Cedars-Sinai", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "21.02/hr - 31.53/hr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care, IT Services and IT Consulting, and Research Services", "description": "<strong>Job Description<br/><br/></strong><strong>**This position is remote eligible after successful completion of on-site training**</strong><br/><br/><strong>Do you love helping people every single day? Are you passionate about providing outstanding and high-quality service to patients and their family members?</strong> <strong>Join our world-class team!<br/><br/></strong>The Clinical Patient Access Representative is the primary clinical point of contact for patients accessing Cedars-Sinai Health System for appointments and care related questions. The Clinical Patient Access Representative answers phone calls for both primary care and assigned specialties within the Health System. They will schedule appointments, address patient clinical inquiries, issues, and complaints, as well as route and escalate calls as needed. As a clinical member of the team, they are expected to independently perform all job responsibilities based on the standard work for the department with minimal supervision.<br/><br/><strong>Primary Duties &amp; Responsibilities<br/><br/></strong><ul><li>Addresses and resolves a minimum of 60 calls per day and functions as the primary patient contact for their assigned specialties within the Medical Network with minimal supervision</li><li>Directs, routes and refers patients to appropriate multi-specialty areas with minimal disturbance to the patient.</li><li>Schedules patient appointments by utilizing scheduling system/application</li><li>Determines effective resolutions to complaints/disputes and handles all concerns with etiquette and professionalism.</li><li>Escalates patient calls when appropriate according to applicable guidelines.</li><li>Provides outstanding service based on an effective intake, diligence and expertise with every call.</li><li>Assists department Lead in reporting updates to staff and distributes pertinent materials</li><li>Assist in training and cross-training new hire and existing staff.</li><li>Coordinates administrative support activities including facilities management, patient billing, utilization management, quality management, and risk management<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Education, Experience &amp; License/Certification Requirements:<br/><br/></strong><ul><li>High School Diploma / GED required</li><li>One (1) year of experience working as a Medical Assistant or work experience or related experience required</li><li>One (1) year of experience answering multi-line and high-volume telephone calls in a healthcare setting or related field preferred</li><li>Medical Assistant Certification required<br/><br/></li></ul><strong>About Us<br/><br/></strong>Cedars-Sinai is a leader in providing high-quality healthcare encompassing primary care, specialized medicine and research. Since 1902, Cedars-Sinai has evolved to meet the needs of one of the most diverse regions in the nation, setting standards in quality and innovative patient care, research, teaching and community service. Today, Cedars- Sinai is known for its national leadership in transforming healthcare for the benefit of patients. Cedars-Sinai impacts the future of healthcare by developing new approaches to treatment and educating tomorrow's health professionals. Additionally, Cedars-Sinai demonstrates a commitment to the community through programs that improve the health of its most vulnerable residents.<br/><br/><strong>About The Team<br/><br/></strong>Cedars-Sinai is one of the largest nonprofit academic medical centers in the U.S., with 886 licensed beds, 2,100 physicians, 2,800 nurses and thousands of other healthcare professionals and staff. Choose this if you want to work in a fast-paced environment that offers the highest level of care to people in the Los Angeles that need our care the most.<br/><br/><strong>Req ID</strong> : 4507<br/><br/><strong>Working Title</strong> : Clinical Patient Access Rep - Patient Access Contact Center (Full-Time, 8 Hour, Day Shift) - Remote Eligible<br/><br/><strong>Department</strong> : CSRC Sched Reg Patient Access<br/><br/><strong>Business Entity</strong> : Cedars-Sinai Medical Center<br/><br/><strong>Job Category</strong> : Administrative<br/><br/><strong>Job Specialty</strong> : Admissions/Registration<br/><br/><strong>Overtime Status</strong> : NONEXEMPT<br/><br/><strong>Primary Shift</strong> : Day<br/><br/><strong>Shift Duration</strong> : 8 hour<br/><br/><strong>Base Pay</strong> : $21.02 - $31.53", "responsibilities": "The Clinical Patient Access Representative is the primary clinical point of contact for patients accessing Cedars-Sinai Health System for appointments and care related questions. The Clinical Patient Access Representative answers phone calls for both primary care and assigned specialties within the Health System. They will schedule appointments, address patient clinical inquiries, issues, and complaints, as well as route and escalate calls as needed. As a clinical member of the team, they are expected to independently perform all job responsibilities based on the standard work for the department with minimal supervision.", "qualifications": {"required": "High School Diploma / GED required\nOne (1) year of experience working as a Medical Assistant or work experience or related experience required\nOne (1) year of experience answering multi-line and high-volume telephone calls in a healthcare setting or related field preferred\nMedical Assistant Certification required", "preferred": null}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3996379234"}