{"jobTitle": "Warehouse Associate: Anaheim", "company": {"name": "Eastman", "industry": "Chemical Manufacturing", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Chemical Manufacturing", "description": "Founded in 1920, Eastman is a global specialty materials company that produces a broad range of products found in items people use every day. With the purpose of enhancing the quality of life in a material way, Eastman works with customers to deliver innovative products and solutions while maintaining a commitment to safety and sustainability. The company’s innovation-driven growth model takes advantage of world-class technology platforms, deep customer engagement, and differentiated application development to grow its leading positions in attractive end markets such as transportation, building and construction, and consumables. As a globally inclusive and diverse company, Eastman employs approximately 14,000 people around the world and serves customers in more than 100 countries. The company had 2023 revenue of approximately $9.2 billion and is headquartered in Kingsport, Tennessee, USA. For more information, visit  www.eastman.com .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Ensure accurate fulfillment of daily film orders. Pull and cut film according to order specifications. Label product and prepare for shipping </li><li> Being Dependable and showing up to work on time </li><li> Maintain organization and cleanliness of Distribution Center </li><li> Monitor Inventory and communicate results to lead, supervisor or manager. </li><li> Operate Machinery safely and be able to train on proper use of machinery </li><li> Shipping and receiving duties include unloading, loading, and monitoring returns </li><li> Assemble boxes and packaging items <br/><br/></li></ul><strong>Skillsets<br/><br/></strong><ul><li> Ability to fully understand and follow oral and written instructions </li><li> Ability to communicate effectively </li><li> Ability to operate basic office equipment like printers, computers, plotters, facsimile machines, copy machines, and telephone systems </li><li> Ability to lift up to 50 lbs. regularly throughout the day </li><li> Ability to do material handling, including use of pallet jacks, ladders, transport carts and or forklifts </li><li> Ability to work independently with minimal supervision </li><li> Ability to work in a team-oriented environment and possess a team-oriented mentality <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> High School Diploma or equivalency is required </li><li> Valid driver's license is required </li><li> Candidate must be at least 18 years of age </li><li> Minimum of 1 year of warehouse experience is preferred </li><li> Proficiency in the use of a computer, including internet browsers and email </li><li> Forklift Experience a plus </li><li> Experience with UPS Worldship and/or FedEx Connect Ship a plus </li><li> Experience with SAP a plus </li><li> Experience with RF Scanner a plus <br/><br/></li></ul>Eastman Chemical Company is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, disability, pregnancy, veteran status or any other protected classes as designated by law.<br/><br/>Eastman is committed to creating a powerfully diverse workforce and a broadly inclusive workplace, where everyone can contribute to their fullest potential each day.", "postedDate": "1 week ago", "skills": ["UPS Worldship", "FedEx Connect Ship", "SAP", "RF Scanner", "Forklift", "Material Handling", "Communication", "Computer", "Email", "Inventory Management", "Order Fulfillment", "Shipping", "Receiving", "Packaging", "Teamwork", "Organization", "Cleanliness", "Safety"], "url": "https://www.linkedin.com/jobs/view/3996491191"}