{"jobTitle": "Marketing Assistant", "company": {"name": "CULT GAIA", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing", "industry": "Retail Apparel and Fashion", "description": "<strong>POSITION: </strong>Marketing Assistant<p><br/></p><p><strong>Company: </strong>Born in Los Angeles, Cult Gaia is known for beautiful heirloom pieces that will live in your closet forever. The cornerstone of Cult Gaia's DNA is creating objects d'art that makes you look twice. Since its inception, CG has grown from accessories into a lifestyle brand, selling everything from ready-to-wear to shoes, a world of Gaia.</p><p><br/></p><p>Reporting to the Senior Director of Digital, the Marketing Assistant will support all projects related to brand and digital marketing. Specifically, the Marketing Assistant will assist across all marketing channels in an effort to support in the growth of Cult Gaia’s brand presence and growth of its DTC and Wholesale business efforts. </p><p> </p><p> </p><p><strong>KEY RESPONSIBILITIES:</strong></p><ul><li>Assist cross-functionally across Marketing Team members in an effort to support all projects related to marketing. </li><li>Responsible for ongoing and weekly updates to Marketing Calendar and Asana Calendar, keeping in mind Omni Business Marketing requests as well. </li><li>Assist in creative research and project management involving global business growth for DTC and Wholesale businesses. </li><li>Schedule daily emails and texts, under direction of Director of Ecommerce, utilizing audience segmentation and in-platform performance metrics to inform sends.</li><li>Assist Director of Ecommerce and Content Manager with photoshoot planning responsibilities, including but not limited to sample requests, styling decks and audit of pre-shoot samples and looks. </li><li>Provide on-set support for Ecommerce and Campaign shoots with attention to sample accuracy and styling. </li><li>Assist PR Team in preparation of brand and large-scale events. </li><li>Liase with Content &amp; PR Team on creation of lookbooks that are best representation of brand. </li><li>Assist PR Team in influencer gifting, stylist and celebrity requests. </li><li>Work with Social Media Manager to assist in creation of compelling content for Cult Gaia’s social channels to drive growth and engagement.</li><li>Assist in analyzing weekly and monthly organic marketing performance. </li></ul><p><br/></p><p><strong>To Be Successful:</strong></p><ul><li>Positive attitude, detail oriented with strong multitasking and organizational skills.</li><li>Strong time management skills; ability to juggle priorities and multiple projects.</li><li>Experienced in all aspects of marketing and social media.</li><li>Exceptional written and verbal communication skills. </li><li>Proficient in word processing applications, spreadsheets, presentation software and business analytic tools.</li><li>Good judgment and quick problem-solving skills.</li></ul><p><br/></p><p><strong>What We Offer:</strong></p><ul><li>Medical, Dental, Vision &amp; Dependent Coverage</li><li>401K with company match</li><li>Life Insurance</li><li>Pet Insurance</li><li>PTO</li><li>Paid Sick Leave</li><li>Clothing Allowance</li><li>Referral Program</li></ul><p></p>", "responsibilities": "Assist cross-functionally across Marketing Team members in an effort to support all projects related to marketing. Responsible for ongoing and weekly updates to Marketing Calendar and Asana Calendar, keeping in mind Omni Business Marketing requests as well. Assist in creative research and project management involving global business growth for DTC and Wholesale businesses. Schedule daily emails and texts, under direction of Director of Ecommerce, utilizing audience segmentation and in-platform performance metrics to inform sends. Assist Director of Ecommerce and Content Manager with photoshoot planning responsibilities, including but not limited to sample requests, styling decks and audit of pre-shoot samples and looks. Provide on-set support for Ecommerce and Campaign shoots with attention to sample accuracy and styling. Assist PR Team in preparation of brand and large-scale events. Liase with Content & PR Team on creation of lookbooks that are best representation of brand. Assist PR Team in influencer gifting, stylist and celebrity requests. Work with Social Media Manager to assist in creation of compelling content for Cult Gaia’s social channels to drive growth and engagement. Assist in analyzing weekly and monthly organic marketing performance.", "qualifications": {"required": "Positive attitude, detail oriented with strong multitasking and organizational skills. Strong time management skills; ability to juggle priorities and multiple projects. Experienced in all aspects of marketing and social media. Exceptional written and verbal communication skills. Proficient in word processing applications, spreadsheets, presentation software and business analytic tools. Good judgment and quick problem-solving skills."}, "skills": ["Marketing", "Social Media", "Project Management", "Communication", "Time Management"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision & Dependent Coverage, 401K with company match, Life Insurance, Pet Insurance, PTO, Paid Sick Leave, Clothing Allowance, Referral Program", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996477975"}