{"jobTitle": "Supply Chain Analyst", "company": {"name": "Top Quality Recruitment (TQR)", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Analyst, Supply Chain, and Distribution", "industry": "Food and Beverage Manufacturing, Beverage Manufacturing, and Baked Goods Manufacturing", "description": "<strong>Employment Type: </strong>Full-time <p><strong>Available Positions:</strong> 1 </p><p><strong>Location</strong>: On-Site</p><p> <strong>Application Deadline:</strong> August 29th, 2024</p><p> </p><p><strong>Summary</strong> </p><p> </p><p>The Supply Chain Analyst will be responsible for purchasing and sales department and documents data entry &amp; filing for the Import department.</p><p><br/></p><p> <strong>Key Activities</strong></p><p><br/></p><ul><li>Analyze sku’s inventories by warehouse locations and re-balance inventories if needed throughout the warehouse network via over the road transfers.</li><li>Send over the road transfers request to customer service with all the necessary information required like quantities to be shipped by item and shipping and receiving warehouses.</li><li>Analyze sku’s sales trends and seasonality to come up with purchasing recommendations from overseas.</li><li>Recommend repacking sku’s if product is not available from overseas or if product will run out before containers arrive.</li><li>Communicate to sales, customer service and purchasing the expected timing of incoming product and shortages, if any.</li><li>Follow up with suppliers on open purchase orders scheduled to be shipped two weeks prior to shipment date to assure on time departures. Delays will be communicated to purchasing and sales so that an alternative plan can be devised.</li><li>Identifies overstock inventory and communicates to purchasing and sales so a plan can be developed to sell the excess inventory.</li><li>Daily entry and filing of import documents such as ISF’s, Delivery Orders and Shipping documents.</li><li>Receive and post inventory in our ERP system as containers are delivered to the multiple warehouses.</li></ul><p><br/></p><p><strong>Preferred Skills </strong></p><p><br/></p><ul><li>4-year degree (supply chain preferred).</li><li>Excellent analytical skills.</li></ul><p><br/></p><p><strong>Educations &amp; Experience</strong></p><ul><li>3-5 years of related work experience.</li><li>Advanced Microsoft Excel.</li></ul><p><strong>Are you looking for your next opportunity? We can help. </strong> </p><p> </p><p>Finding a great opportunity that fosters growth, a great culture, and leadership opportunities can be difficult. Top Quality Recruitment (TQR) connects professionals with leadership opportunities across the Packaging, Food and Beverage, Medical Devices, and Biotechnology industries. With 50+ years of experience, we believe in one-to-one communication and finding the best candidate/employer match possible. </p><p>TQR is an equal-opportunity employer that encourages diversity. We will consider all applications. </p><p> </p><p>Accommodation for applicants with disabilities is available upon request. </p><p> </p><p>Are you looking to hire? Get started here: https://www.topqualityrecruitment.com/fill-a-position/ </p><p> </p><p>See hiring advice: https://www.topqualityrecruitment.com/blog/ </p><p> </p><p>See all available opportunities: https://www.topqualityrecruitment.com/jobs/ </p><p> </p><p><em>We thank all applicants for their interest and appreciate the time and effort involved; however, due to the large volume of resumes received only those candidates selected for an interview will be contacted. Please attached your resume to your application. </em></p><p> </p><p> Job ID: 7375</p>", "responsibilities": "The Supply Chain Analyst will be responsible for purchasing and sales department and documents data entry &amp; filing for the Import department.", "qualifications": {"required": "3-5 years of related work experience.", "preferred": "4-year degree (supply chain preferred)."}, "skills": ["Supply Chain", "Purchasing", "Sales", "Data Entry", "Filing", "Inventory Management", "Warehouse Management", "Sales Forecasting", "Supplier Management", "ERP Systems", "Microsoft Excel"], "postedDate": "1 week ago", "applicationDeadline": "August 29th, 2024", "url": "https://www.linkedin.com/jobs/view/3996631287"}