{"jobTitle": "PT News Anchor/Host", "company": {"name": "Audacy, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Advertising Services, Online Audio and Video Media, and Technology, Information and Internet", "description": "<strong>Overview<br/><br/></strong>KNX News 97.1 FM, Southern Calfornia’s leading multimedia newsroom, is looking for an experienced news anchor and host who can tell relevant, compelling stories with a credible, conversational, and empathetic style. The ideal candidate is able to thrive in a fast-paced all-news environment, generate story ideas daily, and cover every type of story including breaking news. Must have excellent writing and presentation skills, and the ability to conduct interviews and ad-lib on the fly is critical. This person will also be proficient in editing and packaging news, audio and interviews. Our next anchor will also have experience and enthusiasm for social media and digital news consumption. A working knowledge of Los Angeles and the Southern California region is key. Must have a minimum of 3+ years’ experience anchoring or reporting news. A 4 year degree is preferred, preferably in Broadcast Journalism or Communications. <strong> An audio demo must be submitted with the application. <br/><br/></strong><strong>Responsibilities<br/><br/></strong><strong> What You'll Do: <br/><br/></strong><ul><li> Host a multi-hour news shift </li><li> Gather, write, record, edit and deliver news content inclusive of providing live coverage when breaking news occurs. </li><li> Conduct multiple live and recorded interviews with newsmakers daily </li><li> Collaborate with editors, producers, reporters, and digital team to create multi-platform journalism <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> Required and Preferred: <br/><br/></strong><ul><li> Ability to interpret and simplify complex copy </li><li> Ability to update copy and ad-lib on the fly as news warrants </li><li> A conversational, engaging delivery with or without a script </li><li> Knowledgeable and up-to-date with local and national trends and/or specialized knowledge of subjects/events related to on-air topics/stories </li><li> Excellent writing and editing skills </li><li> Ability to plan, organize and multi task in a fast-paced environment </li><li> Experience and proficiency interviewing newsmakers </li><li> Knowledge of proper grammar and usage </li><li> Strong attention to detail </li><li> Understanding how to integrate on air content into all social and digital media platforms and create digital-first content </li><li> Ability to work both independently and collaboratively in a team environment </li><li> Proficient in media production and broadcast systems </li><li> Ability to work flexible and irregular hours including holidays </li><li> Knowledge of requirements around protecting the station’s FCC license. </li><li> Other duties as required by management </li><li> A valid driver’s license, satisfactory completion of a motor vehicle record check, and, if the position requires use of the applicant's own vehicle, proof of insurance, is required. <br/><br/></li></ul>PHYSICAL REQUIREMENTS: While performing the duties of this job, the employee is frequently required to stand; walk; sit; use hands to finger, handle, or feel objects, tools or controls; reach with hands and arms; climb stairs and/or ladders; balance; stoop, kneel, crouch or crawl; talk, hear or smell. The employee must occasionally lift and/or move up to 35 pounds and be able to set up event tents. Specific vision abilities required by the job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.<br/><br/>NOTE: The statements herein are intended to describe the general nature and level of work performed by the employee, but are not a complete list of responsibilities, duties, and skills required. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the employer.<br/><br/><strong>Additional Information<br/><br/></strong>The anticipated starting salary range for California-based individuals expressing interest in this position is $38.96/Hr.-$41.41/Hr.<br/><br/>Salary to be determined by the education, experience, knowledge, skills, abilities and location of the applicant, as well as internal and external equity.<br/><br/>Audacy offers full time employees with a comprehensive benefits package to include: health care coordinator, medical, dental, vision, telemedicine, flexible spending accounts, health savings account, disability, life insurance, critical illness, hospital indemnity, accident insurance, paid time off (sick, vacation, personal, parental, volunteer), 401(k) retirement plan, discounted employee stock purchase, student loan payment assistance program, legal assistance, life assistance program, identity theft protection, discounted home and auto insurance, and pet insurance.<br/><br/><strong>Important Notes<br/><br/></strong>Please be aware that Audacy <strong>will never</strong> ask you to send money at any point during the hiring process. Communication from legitimate Audacy representatives <strong>will only come from email addresses ending in @audacy.com.</strong> If you receive any suspicious requests or communications, please verify their authenticity before responding.<br/><br/><strong>About Us<br/><br/></strong>Audacy, Inc. (NYSE: AUD; OTC: AUDA) is a leading multi-platform audio content and entertainment company with the country’s best collection of local music, news and sports brands, a premium podcast creator, major event producer, and digital innovator. Audacy engages 200 million consumers each month, bringing people together around content that matters to them. Learn more at www.audacyinc.com , Facebook (Audacy Corp), X (@AudacyCorp), LinkedIn (@Audacy-Inc), Instagram (@lifeataudacy) and Threads (@Audacy_Corp).<br/><br/><strong> EEO <br/><br/></strong>Audacy is an Equal Opportunity and Affirmative Action Employer. Audacy affords equal employment opportunity to qualified individuals regardless of their race, color, religion or religious creed, sex/ gender (including pregnancy, childbirth, breastfeeding, or related medical conditions), sexual orientation, gender identity, gender expression, national origin, ancestry, age (over 40), physical or mental disability, medical condition, genetic information, marital status, military or veteran status, or other classification protected by applicable federal, state, or local law, and to comply with all applicable laws and regulations. Consistent with our commitment to equal employment opportunity, we provide reasonable accommodations to qualified individuals with disabilities who need assistance in applying electronically for a position with Audacy, unless doing so would impose an undue hardship. To request a reasonable accommodation for this purpose, please call 1-610-660-5614. Please note that this phone number is to be used solely to request an accommodation with respect to the online application process. Calls for any other reason will not be returned. Reasonable accommodation requests are considered on a case-by-case basis.", "responsibilities": "What You'll Do: <br/><br/>\n<ul><li> Host a multi-hour news shift </li><li> Gather, write, record, edit and deliver news content inclusive of providing live coverage when breaking news occurs. </li><li> Conduct multiple live and recorded interviews with newsmakers daily </li><li> Collaborate with editors, producers, reporters, and digital team to create multi-platform journalism <br/><br/></li></ul>", "qualifications": {"required": "Ability to interpret and simplify complex copy, Ability to update copy and ad-lib on the fly as news warrants, A conversational, engaging delivery with or without a script, Knowledgeable and up-to-date with local and national trends and/or specialized knowledge of subjects/events related to on-air topics/stories, Excellent writing and editing skills, Ability to plan, organize and multi task in a fast-paced environment, Experience and proficiency interviewing newsmakers, Knowledge of proper grammar and usage, Strong attention to detail, Understanding how to integrate on air content into all social and digital media platforms and create digital-first content, Ability to work both independently and collaboratively in a team environment, Proficient in media production and broadcast systems, Ability to work flexible and irregular hours including holidays, Knowledge of requirements around protecting the station’s FCC license., Other duties as required by management, A valid driver’s license, satisfactory completion of a motor vehicle record check, and, if the position requires use of the applicant's own vehicle, proof of insurance, is required.", "preferred": "A 4 year degree is preferred, preferably in Broadcast Journalism or Communications."}, "skills": ["Broadcast Journalism", "Communications", "News Anchor", "News Reporting", "Social Media", "Digital News", "Interviewing", "Writing", "Editing", "Audio Production", "Multi-Platform Journalism"], "postedDate": "2 weeks ago", "benefits": "Audacy offers full time employees with a comprehensive benefits package to include: health care coordinator, medical, dental, vision, telemedicine, flexible spending accounts, health savings account, disability, life insurance, critical illness, hospital indemnity, accident insurance, paid time off (sick, vacation, personal, parental, volunteer), 401(k) retirement plan, discounted employee stock purchase, student loan payment assistance program, legal assistance, life assistance program, identity theft protection, discounted home and auto insurance, and pet insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996035972"}