{"jobTitle": "Influencer & Partnerships Manager", "company": {"name": "BIGO", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Sales, and Business Development", "industry": "Technology, Information and Media, Software Development, and Entertainment Providers", "description": "<strong>Influencer &amp; Partnerships Manager</strong><p>Location: 10250 Constellation Blvd, Century City, Los Angeles, US (3 days hybrid in the office)</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Cultivate impactful partnerships for business growth and heightened user acquisition.</li><li>Manage influencers aligning with the platform for brand growth and user engagement.</li><li>Lead partnership-driven marketing campaigns within budget and deadlines, focusing on KPIs like new user acquisition and ROI.</li><li>Develop and manage marketing calendars, ensuring the success of each partnership campaign.</li><li>Plan and execute events to enhance partnerships and brand visibility.</li><li>Craft company overviews, presentations, and deliver product training to partners and influencers.</li><li>Stay informed on market trends, emerging influencers, and competitor performance for strategic partnership activities.</li><li>Liaise between the Partnerships and Content Teams, collaborating with cross-functional teams for joint marketing plans.</li><li>This position may require travel, both domestically and internationally, as necessary to fulfill job responsibilities. Travel frequency and destinations will vary based on business needs and specific job duties. All travel arrangements will be coordinated in accordance with company policies.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Bachelor’s degree or above in Marketing, Business, or related fields.</li><li>Minimum 7 years in marketing or user growth roles within tech or entertainment.</li><li>Expertise in partnership development, management, influencer marketing, and event planning.</li><li>Strategic thinker proficient in 360 marketing strategies and online acquisition tools.</li><li>Proven track record of managing the health of sales funnels to meet or exceed targets</li><li>Proactive self-starter with strong organizational and time management skills.</li><li>Ability to derive actionable insights from campaign metrics and marketing data.</li><li>Strong attention to detail and organizational skills while working within tight deadlines and resource constraints</li><li>Comfortable working in a fast-paced, dynamic environment and ability to pivot quickly based on strategic business needs</li></ul><p><br/></p><p><strong>Benefits:</strong></p><ul><li>Competitive pay package that includes a base salary and performance-related bonus.</li><li>Generous paid time off starting at 4 weeks + 10 sick days and 9 Holidays per year.</li><li>Free medical, dental, and vision insurance</li><li>401k</li><li>Free gym membership and meal allowance</li></ul><p><br/></p><p><br/></p><p><strong>About BIGO</strong></p><p><strong>WHO WE ARE</strong></p><p>BIGO is a fast-growing Singapore technology company established in 2014.</p><p>Dedicated to creating a better-connected world for everyone, BIGO provides a portfolio of video broadcast and VoIP related products and services powered by advanced Artificial Intelligence (AI) technology. The major products include BIGO LIVE, Likee (Formerly LIKE video), and imo, and the company now has over 300 million monthly active users in over 150 countries.</p><p>To enable people to showcase, discover, and stay connected, BIGO is devoted to continuously innovating its AI capabilities, allowing our users to enjoy a positive, healthy, and creative online environment.</p><p>At present, BIGO has 5 R&amp;D centres, in Singapore, U.S.A., Middle East, India, and China, and over 20 offices around the globe.</p><p>For more information, please visit our website: www.bigo.sg</p><p><strong>OUR MISSION</strong></p><p>Connect the world and share beautiful moments.</p><p><strong>OUR VISION</strong></p><p>To be a content platform inspiring one billion people's lives.</p><p><strong>OUR KEY TO SUCCESS</strong></p><p>BIGO is dedicated to technology innovation. We own over 40 patents in VoIP/Video related technology, and over 60 patents are under the process of application.</p><p><br/></p><p><strong>About Our Product - BIGO LIVE</strong></p><p>BIGO LIVE is founded in March 2016. BIGO LIVE is a leading mobile live stream APP where users live broadcast their life moments, show their talents, interact and send virtual gifts in real time, and enjoy fun live sessions with people worldwide.</p><p>BIGO LIVE has over 200 million users globally in over 80 countries and regions and is currently the market leader in the industry.</p>", "postedDate": "1 week ago", "qualifications": {"required": "Bachelor’s degree or above in Marketing, Business, or related fields. Minimum 7 years in marketing or user growth roles within tech or entertainment. Expertise in partnership development, management, influencer marketing, and event planning. Strategic thinker proficient in 360 marketing strategies and online acquisition tools. Proven track record of managing the health of sales funnels to meet or exceed targets Proactive self-starter with strong organizational and time management skills. Ability to derive actionable insights from campaign metrics and marketing data. Strong attention to detail and organizational skills while working within tight deadlines and resource constraints Comfortable working in a fast-paced, dynamic environment and ability to pivot quickly based on strategic business needs", "preferred": ""}, "skills": [], "benefits": "Competitive pay package that includes a base salary and performance-related bonus. Generous paid time off starting at 4 weeks + 10 sick days and 9 Holidays per year. Free medical, dental, and vision insurance 401k Free gym membership and meal allowance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996169876"}