{"jobTitle": "Logistics Executive", "company": {"name": "JM Eagle", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Management and Manufacturing", "industry": "Plastics Manufacturing", "description": "We are seeking a Logistics Executive to join our team. The ideal candidate will have extensive experience in the transportation and logistics industry and a proven track record of building and leading successful teams. The Logistics Executive will be responsible for developing and executing short-term and long-term strategies to meet the company's goals and objectives.<br/><br/>Essential Duties and Responsibilities:<br/><br/><ul><li>Develop strategic short-term and long-term vision for all aspects of transportation operations and logistics. </li><li>Lead and advance business strategies to meet established goals of the Company. </li><li>Select and develop managers for key positions. Provide guidance and motivation to support maximum performance. </li><li>Maintain current knowledge of federal, state, and local regulations affecting operations. </li><li>Ensure company policies and legal guidelines are communicated from the top down and followed at all times. </li><li>Oversee analysis of industry and market dynamics to evaluate transportation costs and trends. </li><li>Manage operation and maintenance activities of trucking and automotive equipment. </li><li>Review operations on a regular basis to sustain established levels of efficiency and staffing. </li><li>Communicate and maintain trust relationships with stakeholders, business partners, and regulators/authorities. </li><li>Maintain awareness and knowledge of budgets and financial reports. </li><li>Exercise discretion and maintain a high degree of confidentiality. <br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Bachelor's degree in business administration, logistics, or a related field. </li><li>10+ years of experience in transportation operations and logistics. </li><li>Proven track record of developing and executing successful business strategies. </li><li>Excellent leadership and communication skills. </li><li>Strong knowledge of federal, state, and local regulations affecting operations. </li><li>Knowledge of industry trends, market dynamics, and transportation costs. </li><li>Ability to maintain trust relationships with stakeholders, business partners, and regulators/authorities. </li><li>Strong analytical and problem-solving skills. </li><li>Ability to exercise discretion and maintain a high degree of confidentiality. <br/><br/></li></ul><strong>Company Description<br/><br/></strong>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage.<br/><br/>JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach. JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.<br/><br/>With 22 manufacturing plants throughout North America, JM Eagle manufactures the widest array of high-grade, high-performance polyvinyl chloride and high-density polyethylene pipe across a variety of industries and applications including utility, solvent weld, electrical conduit, natural gas, irrigation, potable water and sewage. JM Eagle is the world’s largest plastic pipe manufacturer—an innovative leader that combines advanced technology with superior customer service to create the industry’s most sophisticated and diverse products. JM Eagle gives its customers a significant competitive advantage in the marketplace with the greatest capacity and geographic reach. JM Eagle joins the strengths of two industry-leading plastic pipe producers, including complementary product lines as well as specialty pipe and unique product innovations. We’re committed to serving each and every customer in the best way possible. Through this merger, we look forward to strengthening our existing relationships, and developing new ones in the future. JM EagleTM remains committed to our core value of delivering life’s essentials through the most eco-friendly plastic pipe products on the market. We pride ourselves on being able to illustrate the vital role our products play in improving and maintaining the health and quality of life throughout the world. We will continue to manufacture plastic pipe to serve the world’s growing needs.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996393813"}