{"jobTitle": "TREAD & Field Operations Analyst", "company": {"name": "Kia America", "industry": "Motor Vehicle Manufacturing", "size": "Large", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$65,630.00 - $88,065.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing", "description": "At Kia, we’re creating award-winning products and redefining what value means in the automotive industry. It takes a special group of individuals to do what we do, and we do it together. Our culture is fast-paced, collaborative, and innovative. Our people thrive on thinking differently and challenging the status quo. We are creating something special here, a culture of learning and opportunity, where you can help Kia achieve big things and most importantly, feel passionate and connected to your work every day.\n\nKia provides team members with competitive benefits including premium paid medical, dental and vision coverage for you and your dependents, 401(k) plan matching of 100% up to 6% of the salary deferral, and time off starting at 14 days per year. Kia also offers company lease and purchase programs, company-wide holiday shutdown, paid volunteer hours, and premium lifestyle amenities at our corporate campus in Irvine, California.", "responsibilities": "1st Priority - 30%\n- Track and share status (parts availability, completion of TSB, Warranty submission readiness, etc.) of upcoming field actions, which may include parts availability, completion of Technical Service Bulletins (TSB), warranty submission readiness.\n- Provide communicative support to the field by responding to inquiries related to field actions or providing updates to the field on the status of field actions.\n\n2nd Priority - 30%\n- Collect quarterly EWR TREAD reporting data from KUS business units.\n- Act as the EWR/TREAD Administrator for the Legal Department by pulling all legal cases from ONIT and the Customer Care (CC) database each quarter and present them to the Forensic Engineering and Investigations National Manager for his/her review of cases to determine eligibility for reporting under EWR/TREAD.\n- Proactively analyze TREAD data to provide the TREAD Analytics & Field Operations Manager with early identification of potential safety concern outliers prior to NHTSA inquiries.\n- Create and draft responses for EWR/TREAD inquiries by NHTSA for review by management. Coordinate with counsel on an annual basis to provide KUS business unit specific EWR training resources and perform an annual review of the Safety Office SOP, including the entire EWR/TREAD section, Sales & Distribution, Warranty, Customer Care, and, Field Reports.\n\n3rd Priority - 20%\n- Maintain, track, and review all cases/reports submitted to NHTSA under Standing General Orders (SGO) to provide management with potential updates to NHTSA per the guidelines of SGO (e.g., 10-Day Update, Monthly 15th Update, etc.). Perform an annual review of the Safety Office SOP (SGO section).\n\n4th Priority - 20%\n- Maintain and track customer VOQs posted to NHTSA’s site. This includes timely and accurate reporting of campaign related VOQs and case resolutions.\n- Analyze VOQ data to identify trends and proactively resolve potential campaign related issues such as documentation, part status, dealer compliance, etc.", "qualifications": {"required": "BA/BS degree or equivalent work experience is required. Minimum 2 years of experience required in automotive industry such as Sales, Product Quality, Customer Service, Training Center, Technical Specialists, Parts, or Warranty.", "preferred": "Experienced with vehicle technical compliance issues (i.e., TREAD, Recall and Federal Motor Vehicle Safety Standards). SQL knowledge is preferred, but not required."}, "skills": ["Automotive technical knowledge - body, chassis, power train, brakes, electrical, safety system", "Exceptional written and oral communication skills needed to prepare clear and concise documents and reports", "Professional manner required to represent the company to government agencies as well as other companies", "Strong PC Skills: Microsoft Office Tools: Word, Excel, Power Point and Office 365"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Kia provides team members with competitive benefits including premium paid medical, dental and vision coverage for you and your dependents, 401(k) plan matching of 100% up to 6% of the salary deferral, and time off starting at 14 days per year. Kia also offers company lease and purchase programs, company-wide holiday shutdown, paid volunteer hours, and premium lifestyle amenities at our corporate campus in Irvine, California.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996759926"}