{"jobTitle": "Production and Inventory Planner", "company": {"name": "The NVT Group", "industry": "Manufacturing", "size": "Not specified", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "The role will be planning the production schedule of Data Physics Test Systems in Riverside and procuring materials for Data Physics Instruments in Santa Clara. This position is required to be on site at the Riverside location with minimum travel.", "responsibilities": "On occasion this will be a customer-facing role which will require good and timely communication skills. Develop and maintain the production schedule based on material availability and labor resources. Ensure the production schedule will comply with the expectations set by the Executive Management Team. Host production meetings to communicate, review, and adjust schedules. Generate work orders based on sales orders in the system. Work closely with Purchasing to ensure the timely arrival of required materials. Communicate with Sales to identify priority shipments based on customers demands and DPAS ratings. Discuss daily with Production Supervisor on work status. Generate production and revenue reports for management review. Work with Purchasing and Engineering on NPI production schedule. Plan and procure materials required for the Instruments group, while working with Assembly and Accounting to minimize on hand inventory. Provide analysis of SLOB inventory and suggest inventory disposition as required.", "qualifications": {"required": "Bachelor of Science (B.S.) in Supply Chain or other relevant technical field. Minimum of 3 years’ experience in production scheduling and procurement. Ability to use statistical means to identify problems and provide direction. Knowledge and application of lean practices. Good verbal and written communication skills, with the ability to effectively interact with a variety of personnel and departments. Proficient computer skills in Microsoft Word, Excel, and Power Point. Ability to interpret complex engineering drawings and blueprints a plus.", "preferred": "Excellent troubleshooting and problem-solving skills. Willingness to travel up to 10%; some overseas travel may be required. Possess production planning, scheduling, and procurement knowledge. Have a working understanding of ERP’s. Possess the ability to work productively, efficiently & effectively with initiative and drive under tight timescales and pressure whilst maintaining attention to detail and quality. Ability to effectively communicate with employees, other managers and vendors, etc."}, "skills": ["Production Planning", "Scheduling", "Procurement", "ERP Systems", "Lean Practices", "Communication", "Problem Solving"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Medical insurance, Vision insurance, Dental insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996470717"}