{"jobTitle": "Senior Production Manager", "company": {"name": "Elwood Staffing Services, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Staffing and Recruiting", "description": "Great Opportunity<br/><br/><strong>What's in it for you?<br/><br/></strong>Eligible for a comprehensive and competitive benefits package including bonus, including: Medical/Vision/Dental/Rx plans, PTO, Holiday Pay, sick pay, matching 401k and More!<br/><br/><strong>Senior Production Manager Details<br/><br/></strong><ul><li> Direct Hire position</li><li>$ 140,000.00 / annually </li><li> First Shift ( Monday through Friday ) </li><li> Manage a team of Production Chemists and Technicians for peptide manufacturing and supervise all manufacturing stages which include synthesis, cleavage, purification, reconstitution and lyophilization</li><li> Supervise in-process analysis in all manufacturing stages and assign tasks for team members and follow up on completion</li><li> Ensure that written procedures (SOP, BPR) and cGMP guidelines are followed and review and complete cGMP documentation</li><li> Ensure efficient collaboration between Production department and other supporting departments such as Operations, Logistics, QC, and QA</li><li> Train Production team members to the required standard of operation and evaluate their performances</li><li> Adhere to manufacturing schedules and timelines</li><li> Propose technical and chemical improvements of the manufacturing process</li><li> Ensure safe, efficient and conscious use of the instruments, raw materials and other resources</li><li> Ensure manufacturing and personnel safety and security in the workplace</li><li> Write technical reports and summaries</li><li> Train new hires in peptide manufacturing<br/><br/></li></ul><strong>Senior Production Manager Qualifications<br/><br/></strong><ul><li> Bachelor's Degree in Biochemistry, Chemical Engineering or equivalent field and 5+ years laboratory experience with 8 – 10 years of experience as a production chemist in a cGMP environment</li><li> Familiar with scientific equipment and utilities including but not limited to production</li><li> Working experience with cGMP and safety regulations and with cGMP manufacturing and documentation standards</li><li> Advanced PC knowledge including planning tools</li><li> Ability to effectively organize, multitask, and work in a fast-paced, deadline driven work environment</li><li> Ability to communicate in a proactive and solution-focused manner, including keeping management aware of potential issues</li><li> Detail oriented with the ability to troubleshoot and resolve problems</li><li> Communicate effectively and ability to function well in a team environment</li><li> Experience with manufacturing equipment such as reactors for commercial scale (preferred)<br/><br/></li></ul>We are an Equal Opportunity Employer and celebrate diversity at all levels of our organization.<br/><br/>Our commitment to you: Real People. Fast job offers. No Robots.<br/><br/><strong>How To Apply<br/><br/></strong>Email, call, or text us today! Feel free to apply online at www.elwoodjobs.com !<br/><br/>Daniel Oliver<br/><br/>5230 Carroll Canyon Road<br/><br/>San Diego, CA 92121<br/><br/>(619) 894-8648 ext.<br/><br/>daniel.oliver@elwoodprofessional.com<br/><br/><ul><li>See above for qualifications<br/><br/></li></ul>#IJ #ENG1<br/><br/>OR", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996317312"}