{"jobTitle": "Floor Manager", "company": {"name": "Din Tai Fung North America", "industry": "Restaurants", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$38.00/hr - $40.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Restaurants", "description": "DIN TAI FUNG RESTAURANTS\n\nLOCATION: 10250 Santa Monica Blvd Ste 2400 (Level 2), Los Angeles, CA 90067 (Westfield Century City)\n\nPAY RATE FOR FLOOR MANAGER: $38.00 - 40.00 per hour\n\nThe base salary or hourly wage range for this role will vary based on multiple factors, including but not limited to prior experience, relevant expertise, current business needs, and market factors. Range is not inclusive of potential bonus or benefits. Your recruiter can share more information about the salary range and other factors during the hiring process.\n\nBENEFITS:\n\n- Competitive Pay & Benefits\n- Employer Contribution for individuals and eligible dependents' medical insurance\n- Dental, Vision, and Life Insurance \n- Health Savings Account (HSA)\n- Commuter Spending Accounts\n- 401(k) Plan with company match \n- Employee Assistance Program\n- Discounts through BenefitHub\n- Employee Meal Discounts \n- Opportunities for growth; we love promoting within!\n\nJOB PURPOSE:\n\nFloor Managers manage the restaurant on a day-to-day basis. Their focus is on the front-of-house operations, which consists of managing Din Tai Fung's brand standards, ensuring service meets expectations, managing inventories, and controlling costs as it relates to product and labor to ensure budgets are met.\n\nJOB REQUIREMENTS:\n\n- 1-2 years of relevant experience or education\n- Manager’s Food Handler’s Card\n- Flexible Work Schedule\n- Floor Managers are required to work a minimum of 40 hours per week\n- The schedule may vary based on business demands\n- Ability to efficiently operate in Microsoft Office Suite and Email\n- Positive and professional attitude\n- Strong communication and ability to work cohesively with all levels of management, all departments, and all co-workers in a team\n- Basic cooking skills \n- Ability to stand for long periods\n- Ability to perform job functions with minimal supervision, attention to detail, and speed\n\nNote:\nThis job description in no way states or implies that these are the only duties to be performed by the employee occupying the position. Employees will be required to perform any other job-related duties assigned by their supervisor.\n\nDin Tai Fung is an Equal Employment Opportunity Employer – M/F/D/V", "responsibilities": "Manage the restaurant on a day-to-day basis, focusing on front-of-house operations, managing brand standards, ensuring service meets expectations, managing inventories, and controlling costs.", "qualifications": {"required": "1-2 years of relevant experience or education, Manager’s Food Handler’s Card, Flexible Work Schedule, ability to operate in Microsoft Office Suite and Email, positive attitude, strong communication skills, basic cooking skills, ability to stand for long periods.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Competitive Pay & Benefits, Employer Contribution for individuals and eligible dependents' medical insurance, Dental, Vision, and Life Insurance, Health Savings Account (HSA), Commuter Spending Accounts, 401(k) Plan with company match, Employee Assistance Program, Discounts through BenefitHub, Employee Meal Discounts, Opportunities for growth; we love promoting within!", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996647081"}