{"jobTitle": "Investment Operations Associate", "company": {"name": "FAMILY OFFICE INVESTMENT SERVICES, LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Investment Banking", "description": "<strong>Family Office Investment Services, LLC</strong> (FOIS) provides investment management services to the Broad family and The Broad Foundations. Established and led by Eli Broad for 20 years, FOIS has a strong track record for performance and investment talent, including the Foundations’ Investment Committee which has deep expertise and long-standing tenure with the organizations. \n\n \n\n<strong>The Broad Foundations: </strong>With approximately $2 billion in assets, The Eli and Edythe Broad Foundation (TBF) and The Broad Art Foundation (TBAF) comprise The Broad Foundations (TBFs). \n\n<br/>\n\n<ul><li><strong>The Eli and Edythe Broad Foundation</strong> (www.broadfoundation.org) envisions a world where everyone can shape and participate in a sustainable, equitable economy that serves the public good and builds a brighter future. We see our community as a place of opportunity where all Angelenos, inclusive of their backgrounds, have pathways and tools to grow and thrive. <span>The Broad Foundation was established by philanthropists Eli and Edythe Broad and steadfastly stewards our groundbreaking institutions in education, science and the arts, while elevating organizations, initiatives and leaders that boldly address the challenges of our time and expand opportunity for Los Angeles’ historically marginalized communities. </span></li></ul>\n\n<br/>\n\n<ul><li><strong>The Broad Art Foundation</strong> is a lending library of the over 2,000 works of contemporary art in the Broad collections. TBAF’s mission is to increase public access to contemporary art through an enterprising art loan program based upon its growing art collection as well as the private art collection of the Broads, including lending art for exhibition at The Broad. <strong>The Broad</strong> (www.thebroad.org) is a contemporary art museum in downtown Los Angeles. The Broad’s mission is to make contemporary art accessible to the widest possible audience. The Broad exhibits the postwar and contemporary art collections acquired by Los Angeles philanthropists Eli and Edythe Broad and TBAF.</li></ul>\n\n \n\n<strong>Family Office Financial Services, LLC</strong> (FOFS) provides finance, accounting, tax, human resources, technology, communications and other professional services to the Broad family, FOIS, TBF, TBAF, and interim support to The Broad museum.\n\n \n\n<strong>Our Culture </strong>\n\nFOIS, TBF, and FOFS are co-located, operate with aligned values, and work collectively to steward our groundbreaking institutions and mission. Our team is agile, curious and unflappable. We are dedicated, hard-working, resilient and dynamic individuals who believe in each other and our collective responsibility toward the public good. \n\n \n\nWe believe in establishing an inclusive environment where team members feel comfortable sharing their ideas. We strive to create a workplace where we motivate, appreciate and learn from one another. In a world of rapid change and shifting conditions, we roll up our sleeves, pinch-hit for one another, and believe in each other to meet the extraordinary challenges in these exceptional times. \n\n \n\n<span>We believe that all team members should have a global understanding of the work we do, how the various components are interconnected</span> <span>and how their own work ties to the missions of The Broad Foundations. We believe communication and collaboration across teams are key to fostering trust and innovation across the organization.</span>\n\n \n\n<strong>The Position </strong>\n\nReporting to the Director of Investment Operations, the Investment Operations Associate supports the investment team in the tracking and oversight of the family and foundations’ investment portfolios. This position is responsible for the timely circulation of investment reports and cash flow notices, document management, settlement of investment transactions, completion of subscription documents, contributing to the investment committee materials, preparing reports for the annual audit and tax compliance, and providing some administrative support to the investment team. As part of a small team, this role requires a strong aptitude for multi-tasking, keen attention to detail, a problem-solving mindset, and demonstrated adaptability and resourcefulness. \n\n<span> </span>\n\n<strong>Responsibilities </strong>\n\nResponsibilities include but are not limited to:\n\n<u>Investment Tracking and Reporting</u>\n\n<ul><li>Complete, circulate and track subscription and other fund documents, account maintenance forms, and redemption requests in a timely manner. Ensure all KYC requirements are fully met </li><li>Promptly download and circulate notices for capital calls and cash or in-kind distributions</li><li>Accurately record investment activities in the performance reporting system for over 150 investments, and work directly with fund managers, custodians, and internal teams to obtain missing information </li><li>Reconcile investment cash flows </li><li>Work with custodians to confirm settlement of in-kind distributions, circulate transaction summaries internally post sales and purchases of the securities, and arrange cash sweeps to move sale proceeds from custodians to banking accounts</li><li>Cross train with the Director of Investment Operations and complete ad hoc investment projects</li></ul>\n\n<u>Investment Accounting Support</u>\n\n<ul><li>Support the completion of accounting and tax compliance by tracking and posting tax forms and preparing quarterly schedules including direct foreign investments and monthly FMV  </li><li>Annually assist with the Broad Foundations’ financial statement audit by providing back-up for year-end investment values, sending out investment confirms, and preparing investment roll-forward reports </li></ul>\n\n<u>Administration</u>\n\n<ul><li>Maintain a thorough and organized digital filing system for the investment team</li><li>Maintain contacts database and various investment-related schedules using Excel  </li><li>Prepare and deliver meeting materials for the Broad Foundations’ Investment Committee meetings and handle meeting logistics </li><li>Support the migration and implementation of new investment technology systems  </li><li>Provide administrative support including scheduling with multiple calendars while proactively identifying and resolving scheduling issues</li><li>Provide administrative support including guest arrivals, travel planning and expense reports</li><li>Handle clerical duties such as scanning, proofing and formatting documents and sorting and sending mail </li></ul>\n\n \n\n<strong>Qualifications</strong>\n\n<ul><li>3+ years of experience in an investment management or financial services firm, family office, foundation or endowment  </li><li>Bachelor’s degree from an accredited college or university </li><li>Proactive, keen attention to detail and accuracy, strong communication and follow-up skills, adaptability, and ability to efficiently and independently execute tasks and projects  </li><li>Strong proficiency in Word, Excel, PowerPoint and other Microsoft Office applications, and experience with performance reporting software a plus </li><li>Reliable work ethic, multi-tasking skills, and “can do” attitude </li><li>High degree of professionalism and ability to handle sensitive or confidential information with discretion </li><li>Ability to thrive in a highly collaborative and lean investment organization  </li></ul>\n\n \n\n<strong>Compensation and Benefits</strong>\n\n<span>Compensation and benefits are competitive and commensurate with skills and experience. </span>\n\n<strong> </strong>\n\n<strong>Location</strong>\n\nThis position is based in Los Angeles, California. We are currently a hybrid workplace.\n\n<strong> </strong>\n\n<strong>Our Values </strong>\n\n<span>Building on nearly two decades of lessons learned from active grantmaking, we have infused the following shared values within our organization to guide our work internally and externally. </span>\n\n<ul><li><strong>Unyielding commitment to the public good</strong><span>. We carry a sense of responsibility to help make the world a better place, approaching our work with a focus on results. </span></li><li><strong>Bold thinking</strong><span>. We encourage an entrepreneurial and risk-taking spirit that sparks creative and innovative approaches to our work. We need ambitious visions for the future to create lasting, transformative impact. </span></li><li><strong>Collective action</strong><span>. We listen and learn from others to inform our work. We aim to demonstrate humility, openness and respect for the expertise among our partners. We believe our organization must work collaboratively to find long-term solutions and create a brighter future. </span></li><li><strong>Integrity</strong><span>. We are responsible and honest stewards, calibrating resources with candor, trust and accountability. </span></li><li><strong>Diversity, equity, inclusion and justice</strong><span>. We strive to foster an inclusive and equitable culture that supports our team and reflects a rich diversity. We are committed to amplifying community-based voices and creating systemic change by sharing our power and influence. </span></li><li><strong>Continuous learning</strong><span>. Each day we bring our best thinking, a deep curiosity, flexibility and tireless efforts to our work. We are devoted to asking hard questions and learning from our partners. </span></li></ul>\n\n \n\n<strong>Equal Opportunity Employer</strong>\n\n<span>FOIS is an equal opportunity employer that is committed to providing employees with a work environment free of discrimination and harassment. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race (including traits historically associated with race), color, religion or religious creed (including religious dress), ethnic or national origin (including associational and perception-based harassment and discrimination based on national origin), ancestry, marital status, sex (including pregnancy, childbirth, breastfeeding, and related medical conditions), gender, gender identity, gender expression, age, medical condition (as defined by California law), genetic information, disability status, sexual orientation, military or veteran status, or any other status protected by applicable law with regard to employment opportunities.</span>", "responsibilities": "Responsibilities include but are not limited to:\n\n<u>Investment Tracking and Reporting</u>\n\n<ul><li>Complete, circulate and track subscription and other fund documents, account maintenance forms, and redemption requests in a timely manner. Ensure all KYC requirements are fully met </li><li>Promptly download and circulate notices for capital calls and cash or in-kind distributions</li><li>Accurately record investment activities in the performance reporting system for over 150 investments, and work directly with fund managers, custodians, and internal teams to obtain missing information </li><li>Reconcile investment cash flows </li><li>Work with custodians to confirm settlement of in-kind distributions, circulate transaction summaries internally post sales and purchases of the securities, and arrange cash sweeps to move sale proceeds from custodians to banking accounts</li><li>Cross train with the Director of Investment Operations and complete ad hoc investment projects</li></ul>\n\n<u>Investment Accounting Support</u>\n\n<ul><li>Support the completion of accounting and tax compliance by tracking and posting tax forms and preparing quarterly schedules including direct foreign investments and monthly FMV  </li><li>Annually assist with the Broad Foundations’ financial statement audit by providing back-up for year-end investment values, sending out investment confirms, and preparing investment roll-forward reports </li></ul>\n\n<u>Administration</u>\n\n<ul><li>Maintain a thorough and organized digital filing system for the investment team</li><li>Maintain contacts database and various investment-related schedules using Excel  </li><li>Prepare and deliver meeting materials for the Broad Foundations’ Investment Committee meetings and handle meeting logistics </li><li>Support the migration and implementation of new investment technology systems  </li><li>Provide administrative support including scheduling with multiple calendars while proactively identifying and resolving scheduling issues</li><li>Provide administrative support including guest arrivals, travel planning and expense reports</li><li>Handle clerical duties such as scanning, proofing and formatting documents and sorting and sending mail </li></ul>", "qualifications": {"required": "3+ years of experience in an investment management or financial services firm, family office, foundation or endowment  \n\nBachelor’s degree from an accredited college or university \n\nProactive, keen attention to detail and accuracy, strong communication and follow-up skills, adaptability, and ability to efficiently and independently execute tasks and projects  \n\nStrong proficiency in Word, Excel, PowerPoint and other Microsoft Office applications, and experience with performance reporting software a plus \n\nReliable work ethic, multi-tasking skills, and “can do” attitude \n\nHigh degree of professionalism and ability to handle sensitive or confidential information with discretion \n\nAbility to thrive in a highly collaborative and lean investment organization  ", "preferred": ""}, "skills": ["Word", "Excel", "PowerPoint", "Microsoft Office"], "postedDate": "1 week ago", "benefits": "Compensation and benefits are competitive and commensurate with skills and experience.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996451005"}