{"jobTitle": "Executive Operations Manager/ Executive Assistant to CEO", "company": {"name": "Friendly Franchisees Corporation/Silver Star Real Estate LLC", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative and Other", "industry": "Administrative and Support Services and Restaurants", "description": "Overview:\nFriendly Franchisees is a rapidly growing, privately-owned company recognized for its commitment to excellence in the restaurant and real estate industries. We are seeking a highly organized and experienced Executive Operations Manager / Executive Assistant to support our CEO. This pivotal role is essential for ensuring the seamless operation of our restaurant and real estate businesses. The ideal candidate will possess a strong background in restaurant management and the ability to deliver high-level administrative support. This is an outstanding opportunity for a motivated individual to contribute to the success of a dynamic, fast-paced organization.\n\nKey Responsibilities:\n1. Administrative Support:\n* Manage and maintain the CEO’s calendar, including scheduling meetings, appointments, and travel arrangements.\n* Screen and prioritize emails, phone calls, and other communications for the CEO.\n* Prepare and edit correspondence, reports, presentations, and other necessary documents.\n* Organize and maintain both electronic and paper-based files and records.\n2. Meeting Coordination:\n* Plan and coordinate meetings, conferences, and events, handling all logistical arrangements.\n* Prepare meeting materials and attend meetings to take minutes, ensuring accurate documentation and follow-up on action items.\n3. Travel Arrangements:\n* Arrange and manage complex domestic and international travel itineraries, including flights, accommodations, and transportation.\n* Prepare travel expense reports and ensure timely reimbursement.\n4. Operations Management:\n* Oversee the day-to-day operations of the CEO’s office, ensuring efficiency and effectiveness in all processes.\n* Assist in managing restaurant operations, ensuring compliance with company standards and optimizing performance.\n* Coordinate with internal and external stakeholders to achieve operational goals and meet project deadlines.\n* Provide the CEO with relevant data and insights to support informed decision-making.\n5. Project Management:\n* Assist the CEO with various projects, conducting research, compiling information, and ensuring timely execution.\n* Collaborate with teams across the organization to ensure that project deadlines and objectives are met.\n6. Restaurant Management:\n* Leverage your previous restaurant management experience to support the CEO in overseeing restaurant operations.\n* Provide insights and recommendations for improving operational efficiency within the restaurant division.\n* Ensure compliance with industry regulations and company policies across restaurant operations.\n\nSkills and Qualifications:\n* Education: Bachelor’s degree in Business Administration, Management, or a related field is preferred.\n* Experience: A minimum of 3 years of experience as a Personal Assistant, Executive Assistant, or in a similar role supporting senior executives, with a strong background in restaurant management.\n* Industry Experience: Prior experience in the restaurant or franchise industry is required, with a demonstrated progression from entry-level to managerial roles.\n* Skills:\n* Exceptional organizational and time-management abilities.\n* Excellent written and verbal communication skills.\n* Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n* Ability to work independently and manage multiple priorities in a fast-paced environment.\n* High level of discretion and confidentiality.\n* Strong problem-solving and decision-making skills.\n\nWork Setting:\n* Location: La Palma, CA / Newport Coast Drive, CA (Onsite as per business requirements)\n* Schedule: Full-time, Monday to Friday, with occasional extended hours and weekends as needed.\n\nEqual Employment Opportunity (EEO) Statement:\nFriendly Franchisees is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.", "responsibilities": "1. Administrative Support:\n* Manage and maintain the CEO’s calendar, including scheduling meetings, appointments, and travel arrangements.\n* Screen and prioritize emails, phone calls, and other communications for the CEO.\n* Prepare and edit correspondence, reports, presentations, and other necessary documents.\n* Organize and maintain both electronic and paper-based files and records.\n2. Meeting Coordination:\n* Plan and coordinate meetings, conferences, and events, handling all logistical arrangements.\n* Prepare meeting materials and attend meetings to take minutes, ensuring accurate documentation and follow-up on action items.\n3. Travel Arrangements:\n* Arrange and manage complex domestic and international travel itineraries, including flights, accommodations, and transportation.\n* Prepare travel expense reports and ensure timely reimbursement.\n4. Operations Management:\n* Oversee the day-to-day operations of the CEO’s office, ensuring efficiency and effectiveness in all processes.\n* Assist in managing restaurant operations, ensuring compliance with company standards and optimizing performance.\n* Coordinate with internal and external stakeholders to achieve operational goals and meet project deadlines.\n* Provide the CEO with relevant data and insights to support informed decision-making.\n5. Project Management:\n* Assist the CEO with various projects, conducting research, compiling information, and ensuring timely execution.\n* Collaborate with teams across the organization to ensure that project deadlines and objectives are met.\n6. Restaurant Management:\n* Leverage your previous restaurant management experience to support the CEO in overseeing restaurant operations.\n* Provide insights and recommendations for improving operational efficiency within the restaurant division.\n* Ensure compliance with industry regulations and company policies across restaurant operations.", "qualifications": {"required": "A minimum of 3 years of experience as a Personal Assistant, Executive Assistant, or in a similar role supporting senior executives, with a strong background in restaurant management.", "preferred": "Bachelor’s degree in Business Administration, Management, or a related field is preferred."}, "skills": ["Restaurant Management", "Administrative Support", "Meeting Coordination", "Travel Arrangements", "Operations Management", "Project Management", "Microsoft Office Suite", "Time Management", "Communication", "Problem Solving", "Decision Making"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996495645"}