{"jobTitle": "Operations Manager", "company": {"name": "Insight Global", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$55.00/hr - $60.00/hr", "currency": "USD"}, "jobFunction": "Project Management", "industry": "Marketing Services", "description": "<strong>Company: </strong>Walmart\n<p><strong>Title: </strong>Creative Operations Manager</p><p><strong>Location: </strong>Los Angeles or San Bruno (2-3 days/week) </p><p><strong>Duration: </strong>6 months</p><p><br/></p><p><strong>Must Haves:</strong></p><ul><li>3-5+ years of experience in operations documentation or a related field, preferably in a creative or marketing environment.</li><li>Experience with project management tools and software (e.g., AEM, Workfront, Airtable). </li><li>Familiarity with creative content management systems (CMS) or digital asset management (DAM) platforms.</li><li>Strong analytical skills with the ability to critically assess processes and propose strategic improvements.</li><li>Proficiency in slide design software (e.g., PowerPoint, Google Slides) and experience crafting compelling narratives.</li><li>Strong organizational skills with the ability to manage multiple projects simultaneously.</li><li>Excellent written and verbal communication skills, with a keen eye for detail.</li><li>Ability to work independently and collaboratively in a dynamic, fast-paced environment.</li><li>Solid understanding of creative production and operations.</li><li>General technical acumen for creative operations tooling and implementation, including familiarity with relevant software and systems used in creative workflows.</li></ul><p><strong> </strong></p><p><strong>Job Description: </strong></p><p>Insight Global is looking for a detail-oriented and proactive Creative Operations Manager to join our team. This role is crucial for documenting our operational procedures, optimizing workflows, and strategically enhancing our processes. The ideal candidate will excel in both documentation and critical process thinking, with strong capabilities in creating compelling presentations and a solid technical acumen for creative operations tooling and implementation.</p><p><em>Responsibilities:</em></p><ul><li>Document current operational workflows, processes, and procedures across various departments.</li><li>Develop and maintain standardized templates, guidelines, and documentation frameworks.</li><li>Analyze existing processes, identify bottlenecks, and recommend strategic improvements to enhance efficiency and effectiveness.</li><li>Create engaging and visually compelling presentations and slides for internal stakeholders and external partners.</li><li>Collaborate closely with cross-functional teams to gather information, ensure accuracy in documentation, and implement process improvements.</li><li>Support the implementation of new tools or systems to streamline operations and documentation processes, leveraging a strong technical understanding of creative operations tooling.</li></ul><p></p>", "responsibilities": "Document current operational workflows, processes, and procedures across various departments. Develop and maintain standardized templates, guidelines, and documentation frameworks. Analyze existing processes, identify bottlenecks, and recommend strategic improvements to enhance efficiency and effectiveness. Create engaging and visually compelling presentations and slides for internal stakeholders and external partners. Collaborate closely with cross-functional teams to gather information, ensure accuracy in documentation, and implement process improvements. Support the implementation of new tools or systems to streamline operations and documentation processes, leveraging a strong technical understanding of creative operations tooling.", "qualifications": {"required": "3-5+ years of experience in operations documentation or a related field, preferably in a creative or marketing environment. Experience with project management tools and software (e.g., AEM, Workfront, Airtable). Familiarity with creative content management systems (CMS) or digital asset management (DAM) platforms. Strong analytical skills with the ability to critically assess processes and propose strategic improvements. Proficiency in slide design software (e.g., PowerPoint, Google Slides) and experience crafting compelling narratives. Strong organizational skills with the ability to manage multiple projects simultaneously. Excellent written and verbal communication skills, with a keen eye for detail. Ability to work independently and collaboratively in a dynamic, fast-paced environment. Solid understanding of creative production and operations. General technical acumen for creative operations tooling and implementation, including familiarity with relevant software and systems used in creative workflows.", "preferred": ""}, "skills": ["Operations Documentation", "Project Management", "AEM", "Workfront", "Airtable", "Creative Content Management Systems", "Digital Asset Management", "Analytical Skills", "Process Improvement", "Slide Design", "PowerPoint", "Google Slides", "Narrative Crafting", "Organizational Skills", "Communication", "Detail-Oriented", "Collaboration", "Creative Production", "Creative Operations Tooling"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996467952"}