{"jobTitle": "Business System Analyst", "company": {"name": "Ampure", "industry": "Motor Vehicle Manufacturing", "location": "Monrovia, CA"}, "location": "Monrovia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing", "description": "<strong>Charge Forward: Powering the Future of Sustainable Mobility </strong>\n<p>More than just a leading provider of innovative charging solutions, Ampure isn't just building EV chargers, we're pioneering the sustainable mobility revolution. Since the world's first modern electric car, our tech has been at the forefront, and today we're a top 100 global automotive supplier with a commanding 41% market share.</p>\n<p>Our pioneering spirit continues to guide us as we develop charging solutions for a diverse range of applications. We offer a comprehensive portfolio of products for on-road electric vehicles, as well as industrial workhorses like forklifts to airport ground support equipment. Renowned for safety, efficiency, and extending battery life, our chargers pave the way for a climate-neutral mobility of the future.</p>\n<p><br/></p>\n<p><strong>Job Summary </strong></p>\n<p>Ampure seeks a Business Systems Analyst with a background in technology or a closely related field. The ideal candidate will have strong problem-solving skills and the ability to communicate effectively with team members and stakeholders. The Business Systems Analyst will analyze business requirements and design solutions to meet those requirements. They will also test, implement, and maintain software applications and systems to improve business processes.</p>\n<p><br/></p>\n<p><strong>What You'll Do</strong></p>\n<ul><li>Collaborate with business stakeholders to understand their requirements and identify opportunities for process improvement.</li><li>Conduct research to identify new technologies and methods to improve business processes.</li><li>Analyze and troubleshoot software issues, identify root causes, and implement solutions.</li><li>Develop and maintain documentation such as user manuals, training materials, and technical specifications.</li><li>Participate in software testing and quality assurance activities.</li><li>Communicate project status and progress to team members and stakeholders.</li><li>Provide support to end-users and resolve issues in a timely manner.</li><li>Prepare cost-benefit and return-on-investment analyses to aid in decisions on system and application implementation.</li><li>Work with the business to onboard new applications when required to meet business needs.</li><li>Work with application owners to develop compliance processes and complete compliance activities.</li><li>Work with business partners, development teams, and information security to address information security vulnerabilities.</li><li>Coordinate work with business and IT teams to drive IT projects to successful completion.</li><li>Support critical major cross-functional initiatives and projects for Finance, Sales, and Operations process areas including system implementations, operational improvements, and new product rollouts.</li><li>Partner with business stakeholders to document business requirements, and functional design documentation for process solutions using NetSuite, industry-leading CRM, and other business applications.</li><li>Refine IT process management framework, perform process assessments, and implement process improvements.</li><li>Partner with process owners to define and benchmark operational KPI and support the delivery of KPI dashboards.</li><li>Define and lead User Acceptance Testing.</li><li>Build and deliver training regarding the optimal use of business applications.</li></ul><p><br/></p>\n<p><strong> What You'll Need:</strong></p>\n<ul><li>8+ years of relevant professional experience</li><li>Experience with Netsuite ERP and various CRM applications</li><li>Solid understanding of global core financial processes (procure to pay, order to cash, financial close) and Sales Operations processes (lead management, sales forecasting)</li><li>Highly proactive and planful, with a proven track record of owning and delivering technology projects</li><li>Strong verbal and written communication skills to work effectively with senior cross-functional stakeholders</li><li>Ability to work effectively as part of a team yet function well with independent responsibilities</li><li>Attention to detail, organized and thorough with desire for continuous improvement Bonus Points:</li><li>Experience with B2B and B2C models</li><li>Experience working in a manufacturing environment a plus</li></ul><p><br/></p>\n<p><strong>Reporting to the IT Director </strong></p>\n<p><br/></p>\n<p><strong>Ampure is dedicated to fostering a supportive and dynamic work environment, offering a comprehensive benefits package designed to enhance the well-being and professional growth of our employees. Our benefits include:</strong></p>\n<ul><li>Health, Dental, and Vision insurance to ensure you and your family's health needs are met.</li><li>Short-Term and Long-Term Disability (STD, LTD) insurance.</li><li>Flexible Spending Accounts (FSA) and Health Savings Accounts (HSA) for additional financial flexibility.</li><li>401K Retirement Plan to help you plan for a secure future.</li><li>Employee Assistance Program (EAP) offering confidential support and resources for personal and professional challenges.</li><li>Generous Holiday Schedule and Vacation/PTO Policy, allowing you to recharge and spend time with loved ones.</li><li>IDEA Program encouraging innovation and continuous improvement.</li><li>Wellness Rooms to support your physical and mental well-being.</li><li>Hybrid Work Policy offering flexibility and promoting a healthy work-life balance.</li><li>Referral Bonus Program incentivizing employees to bring talented individuals into our organization.</li></ul><p>At Ampure, we believe that a supportive and inclusive workplace is key to success. Our extensive benefits, along with our commitment to employee well-being and professional development, make Ampure a great place to work and grow your career.</p>", "responsibilities": "Collaborate with business stakeholders to understand their requirements and identify opportunities for process improvement.Conduct research to identify new technologies and methods to improve business processes.Analyze and troubleshoot software issues, identify root causes, and implement solutions.Develop and maintain documentation such as user manuals, training materials, and technical specifications.Participate in software testing and quality assurance activities.Communicate project status and progress to team members and stakeholders.Provide support to end-users and resolve issues in a timely manner.Prepare cost-benefit and return-on-investment analyses to aid in decisions on system and application implementation.Work with the business to onboard new applications when required to meet business needs.Work with application owners to develop compliance processes and complete compliance activities.Work with business partners, development teams, and information security to address information security vulnerabilities.Coordinate work with business and IT teams to drive IT projects to successful completion.Support critical major cross-functional initiatives and projects for Finance, Sales, and Operations process areas including system implementations, operational improvements, and new product rollouts.Partner with business stakeholders to document business requirements, and functional design documentation for process solutions using NetSuite, industry-leading CRM, and other business applications.Refine IT process management framework, perform process assessments, and implement process improvements.Partner with process owners to define and benchmark operational KPI and support the delivery of KPI dashboards.Define and lead User Acceptance Testing.Build and deliver training regarding the optimal use of business applications.", "qualifications": {"required": "8+ years of relevant professional experienceExperience with Netsuite ERP and various CRM applicationsSolid understanding of global core financial processes (procure to pay, order to cash, financial close) and Sales Operations processes (lead management, sales forecasting)Highly proactive and planful, with a proven track record of owning and delivering technology projectsStrong verbal and written communication skills to work effectively with senior cross-functional stakeholdersAbility to work effectively as part of a team yet function well with independent responsibilitiesAttention to detail, organized and thorough with desire for continuous improvement", "preferred": "Experience with B2B and B2C modelsExperience working in a manufacturing environment a plus"}, "skills": ["Netsuite ERP", "CRM", "Financial Processes", "Sales Operations", "Project Management", "Communication", "Teamwork", "Continuous Improvement", "B2B", "B2C", "Manufacturing"], "postedDate": "2 weeks ago", "benefits": "Health, Dental, and Vision insurance to ensure you and your family's health needs are met.Short-Term and Long-Term Disability (STD, LTD) insurance.Flexible Spending Accounts (FSA) and Health Savings Accounts (HSA) for additional financial flexibility.401K Retirement Plan to help you plan for a secure future.Employee Assistance Program (EAP) offering confidential support and resources for personal and professional challenges.Generous Holiday Schedule and Vacation/PTO Policy, allowing you to recharge and spend time with loved ones.IDEA Program encouraging innovation and continuous improvement.Wellness Rooms to support your physical and mental well-being.Hybrid Work Policy offering flexibility and promoting a healthy work-life balance.Referral Bonus Program incentivizing employees to bring talented individuals into our organization.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996013497"}