{"jobTitle": "Digital Coordinator, Features Post Production", "company": {"name": "IMAX", "industry": "Entertainment Providers", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "20.18 - 25.00", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment Providers", "description": "IMAX is not your everyday entertainment experience. With over 50 years of history as a global innovator in entertainment technology, our employees and their careers have constantly gone beyond the ordinary at IMAX. We combine proprietary technology with industry-leading knowledge and relationships with top studios and filmmakers to create theatrical experiences that take audiences beyond the edge of their seats to a world they never imagined. IMAX has revolutionized the way people experience movies and continues to push the boundaries of entertainment experiences beyond blockbusters and into exciting new directions.\n\nCome explore IMAX – where innovation, creativity and passion come together. Get inspired, get involved, and ignite your future with IMAX!\n\nJob Description\n\nThis is a one-year contract position with IMAX. The working hours are Monday-Friday, 3:30pm – 12:30am.\n\nAbout The Role\n\nIMAX is looking for a Coordinator to join our growing Features Post Production team. You’ll work directly with internal and external stakeholders to run screenings, demos, and various quality-checking tasks. We’re looking for someone with strong organizational skills and a positive outlook for this highly customer service-orientated role with the flexibility for occasional weekend shifts.", "responsibilities": "Responsible for quality checking dub and subtitle DCPs to ensure all assets pass IMAX quality standards. Work directly with internal and external stakeholders to ensure client satisfaction. Schedule internal or external bookings for quality checks, screenings, or demos at our IMAX HQ theaters. Run screenings and demos with clients and executives for internal and external events. Organize subtitle scripts, checkers, and other tools to ensure successful quality checks. Collaborate with cross-functional teams to processes orders for DCP electronic and physical shipments. Handle the emergency phone and check email outside of normal business hours to help deliver emergency KDMs and/or handle corrupt hard drives or content issues with our IMAX theaters. Confer with team members to develop new methods to expedite production and maintain quality control.", "qualifications": {"required": "1+ years’ experience in a customer-facing role, preferably in a Post Production and/or Distribution environment. Proficient computer skills including Microsoft Excel, Word and Outlook required. Demonstrated customer service orientation with an approachable and personable outlook. Be willing to work outside of normal working hours if needed.", "preferred": ""}, "skills": ["Organizational skills", "Customer service orientation", "Proficient in Microsoft Excel", "Proficient in Microsoft Word", "Proficient in Microsoft Outlook"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996495461"}