{"jobTitle": "Human Resources Specialist", "company": {"name": "City of Downey", "location": "Downey, CA"}, "location": "Downey, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "About The Position<br/><br/><strong><strong> <strong> <strong> <strong> NOTE: </strong> </strong> </strong> </strong> </strong> <strong><strong> <strong> <strong> <strong> This recruitment is open on a continuous basis and may close without prior notice. First review of the applications will occur on Friday, August 16, 2024. Please thoroughly review the entire job flyer including the application instructions. Failure to submit a completed application and provide required documentation may result in an application being removed from further consideration. There is currently one (1) full-time and one (1) part-time vacancies. </strong> </strong> </strong> <br/><br/></strong></strong><strong>Under general supervision, this position provides responsible technical and administrative staff support; performs a variety of duties in all of the following core service areas in the Human Resources Division that include: general office administration and recordkeeping; recruitment and selection; classification and compensation; employee services and benefits administration, including workers' compensation; labor and employee relations, and, employee development and training. Prior municipal experience and NeoGov Insight, NeoGov Onboard, and HRIS database administration is highly desirable.<br/><br/><strong>Effective the start of the pay period that includes April 1, 2025, employees will receive a four percent (4.0%) across the board pay range increase. </strong> <br/><br/></strong><strong> <strong> This position is a \"Confidential\" position. The position is non-represented and serves in an \"at will\" capacity with no rights to employment. Salary and benefits are established by City Council Resolution for classifications designated as Executive, Mid-Management, Confidential/Exempt. </strong> <br/><br/></strong>An Eligible List of qualified applicants will be established from this recruitment. Eligible List may be utilized to fill other full and part-time vacancies as needed. Generally, a valid Eligible List is in effect for up to one year.<br/><br/><strong>Examples Of Essential Functions<br/><br/></strong>The following examples are intended to describe the general nature and level of work performed by persons assigned to this classification.<br/><br/><ul><li>Processes personnel status reports (PSRs) for employee status changes and payroll processing in a timely manner; tracks hours worked to determine benefit eligibility; implements personnel status changes resulting from new labor agreements; distribute monthly employee performance evaluation reports, processes benefit enrollment and changes for benefit programs including the California Public Employees' Retirement System (CalPERS) and other benefit providers.</li><li>Coordinates Human Resources programs including staffing, onboarding for regular and part-time, seasonal and temporary recruitments, merit and performance management programs and all other HR initiatives.</li><li>Conducts new hire onboarding including I-9 e-verifications, health authorizations for pre-employment physicals and drug screens, fingerprinting and manages Nixle and DMV Employer Pull-Notice Program enrollments, ensuring accurate and timely processing; assists with tracking and monitoring a number of logs and databases</li><li>Provides exceptional customer service at the public counter, including answering incoming phone calls for the division, responding to employee, retiree and public inquires relating to basic questions concerning Human Resources matters (i.e., employment verification and reference checks, employment opportunities, employee benefits, etc.) in a courteous and customer-focused manner; resolves complaints in an efficient and timely manner; and follows up with candidates and hiring managers as directed</li><li>Ensures the confidentiality of personnel information by following established procedures.</li><li>Plan and initiate recruitment selection activities including: composing job announcements and advertisements; reviewing job applications; scheduling, administering, and proctoring examinations; preparing and maintaining Eligibility Lists; and issuing offers of employment to candidates.</li><li>Process employee benefit applications and request for disability leave, FMLA, COBRA, over age dependents, retirement, death, and other qualifying events.</li><li>Coordinate activities of the Human Resources Office with other City departments and external support contacts or contracted vendors.</li><li>Participate in and conduct surveys on compensation, employee benefits, and other related areas in support of labor negotiations.</li><li>Process workers' compensation claims and maintains employee disability/leave status; serves as staff liaison with City's third party administrator for workers' compensation.</li><li>Prepare and maintain personnel records, and general file maintenance.</li><li>Perform office administration duties and other administrative tasks as assigned.</li><li>Research and gather information for various personnel related reports; prepare routine statistical reports and letters as assigned.</li><li>Proofread outgoing division correspondence and communications for completeness, spelling, grammatical, or punctuation accuracy.</li><li>Perform other related duties as assigned.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Any combination equivalent to experience and education that could likely provide the required skills, knowledge and abilities would be qualifying. A typical way to obtain the skills, knowledge and abilities would be:<br/><br/><strong>Education: </strong> High school diploma or equivalent, supplemented by some college level courses in personnel, business, public administration or a closely related field.<br/><br/><strong>Experience:</strong> Four (4) years of increasingly responsible administrative support work experience, of which includes at least two (2) full-time years (or equivalent) in a human resources office or related field. Municipal work experience preferred.<br/><br/><strong>Knowledge of:</strong> General understanding of human resources administration and the ability to provide support of recruitment and onboardingModern office equipment such as a personal computer, scanning equipment and related software; professional telephone etiquette and effective customer service techniques; personnel policies, practices, and procedures; modern records retention and recordkeeping practices; and, working knowledge of MS Word, Excel, Powerpoint, HRIS systems (Kronos, Eden, NeoGov, etc.).<br/><br/><strong>Ability to</strong>: Demonstrates a reliable and responsible work ethic during times of stress and changing priorities; has a proactive, can-do attitude; strong organizational skills while handling a heavy workload and organizing time and resources efficiently; proactive follow up with employees, managers, and other Human Resources staff to communicate status updates, keep stakeholders informed, and move processes forward; exceptional attention to detail and ability to maintain extensive and accurate records and ensure work is thorough and professional; exceptional customer service skills and the ability to effectively respond to and address public and employee questions, identify issues, and share ideas; strong computer skills and the ability to use Microsoft Excel to track information; Microsoft Word to prepare memos and letters; Microsoft Outlook to communicate with staff and manage deadlines; and third-party databases to accurately update information; strong interpersonal skills and the ability to develop and maintain effective working relationships with employees, managers, and the public; ability to maintain confidentiality of privileged and confidential information, exercise professional judgment, and conduct oneself ethically in all personnel matters; reliable team player and the ability to work independently as well as collaborate as part of a larger recruitment team and division; plan, coordinate, and effectively organize work to meet deadlines; prepare well-written routine correspondence demonstrating good English usage skills including spelling, vocabulary, grammar and punctuation; establish and maintain cooperative and effective working relationships with those contacted in the course of work; make decisions in procedural matters based on learned knowledge and directives; use common sense and reasonable judgment in difficult situations; work assigned scheduled demonstrating consistent attendance and reliability.<br/><br/><strong>Additional Information<br/><br/></strong><strong>License Requirement:</strong> In the event of field duties such as attending training workshops or conducting off-site testing, a valid California Driver's License and an acceptable driving record during the course of employment is required or the ability to utilize an alternative method of transportation to carry out an essential function of the position.<br/><br/><strong>California Department of Motor Vehicle (DMV) Pull Notice System: </strong>An incumbent appointed to this position is subject to enrollment in the California DMV Pull Notice Program. The Pull Notice program provides information on the incumbent's driving record and Driver's License status on a periodic basis to the City of Downey. An employee assigned a City vehicle must acknowledge receipt and understanding of City Administrative Regulations covering the use of City vehicles.<br/><br/><strong>PHYSICAL TASKS AND ENVIRONMENTAL CONDITIONS<br/><br/></strong>The duties and responsibilities of this position are performed in an office environment and involve sitting, standing, and walking for prolonged or intermittent periods of time, and include reaching, bending, and twisting at the waist to perform desk work and operate general office equipment including a personal computer with keyboard for prolonged or intermittent periods of time.<br/><br/>The operation of a personal computer requires finger and wrist dexterity and the ability to withstand exposure to vibration, pitch and glare from the computer. Employee must be able to safely lift and carry books, files and reports weighing up to 25 pounds.<br/><br/><strong>Selection/Testing Process<br/><br/></strong>All applications and supplemental information will be reviewed and evaluated on the basis of information submitted at the time of filing to determine the level and scope of the candidate's preparation for the position. All information supplied by applicants is subject to verification.<br/><br/>The acceptance of your application depends on whether or not you have clearly shown that you meet the Qualifications as stated above. Please fill out the application and supplemental questionnaire completely.<br/><br/>In the space provided for education, include the names and addresses of schools attended, dates completed, and number of credits, degree, and/or certificate(s) earned.<br/><br/>For each job held, provide the name and address of your employer, your job title, beginning and ending dates, description of work performed, salary earned, and reason for leaving. Failure to provide all the information may result in your application being removed from consideration. Resumes will not be accepted in lieu of the completed application.<br/><br/>Those applicants, who most closely match the desired qualifications, will be invited to participate in the examination process which will consist of an appraisal examination (weighted 100%) to assess the applicant's knowledge, education, experience, and general ability to perform the essential functions of the position.<br/><br/>Candidate(s) who complete testing with acceptable results will be considered by the Department hiring authority. Prior to an employment offer, a comprehensive background investigation is conducted, including fingerprinting. A pre-placement medical exam will be conducted upon issuance of a conditional offer of employment.", "responsibilities": "Under general supervision, this position provides responsible technical and administrative staff support; performs a variety of duties in all of the following core service areas in the Human Resources Division that include: general office administration and recordkeeping; recruitment and selection; classification and compensation; employee services and benefits administration, including workers' compensation; labor and employee relations, and, employee development and training. Prior municipal experience and NeoGov Insight, NeoGov Onboard, and HRIS database administration is highly desirable.<br/><br/><strong>Effective the start of the pay period that includes April 1, 2025, employees will receive a four percent (4.0%) across the board pay range increase. </strong> <br/><br/><strong> <strong> This position is a \"Confidential\" position. The position is non-represented and serves in an \"at will\" capacity with no rights to employment. Salary and benefits are established by City Council Resolution for classifications designated as Executive, Mid-Management, Confidential/Exempt. </strong> <br/><br/></strong>An Eligible List of qualified applicants will be established from this recruitment. Eligible List may be utilized to fill other full and part-time vacancies as needed. Generally, a valid Eligible List is in effect for up to one year.<br/><br/><strong>Examples Of Essential Functions<br/><br/></strong>The following examples are intended to describe the general nature and level of work performed by persons assigned to this classification.<br/><br/><ul><li>Processes personnel status reports (PSRs) for employee status changes and payroll processing in a timely manner; tracks hours worked to determine benefit eligibility; implements personnel status changes resulting from new labor agreements; distribute monthly employee performance evaluation reports, processes benefit enrollment and changes for benefit programs including the California Public Employees' Retirement System (CalPERS) and other benefit providers.</li><li>Coordinates Human Resources programs including staffing, onboarding for regular and part-time, seasonal and temporary recruitments, merit and performance management programs and all other HR initiatives.</li><li>Conducts new hire onboarding including I-9 e-verifications, health authorizations for pre-employment physicals and drug screens, fingerprinting and manages Nixle and DMV Employer Pull-Notice Program enrollments, ensuring accurate and timely processing; assists with tracking and monitoring a number of logs and databases</li><li>Provides exceptional customer service at the public counter, including answering incoming phone calls for the division, responding to employee, retiree and public inquires relating to basic questions concerning Human Resources matters (i.e., employment verification and reference checks, employment opportunities, employee benefits, etc.) in a courteous and customer-focused manner; resolves complaints in an efficient and timely manner; and follows up with candidates and hiring managers as directed</li><li>Ensures the confidentiality of personnel information by following established procedures.</li><li>Plan and initiate recruitment selection activities including: composing job announcements and advertisements; reviewing job applications; scheduling, administering, and proctoring examinations; preparing and maintaining Eligibility Lists; and issuing offers of employment to candidates.</li><li>Process employee benefit applications and request for disability leave, FMLA, COBRA, over age dependents, retirement, death, and other qualifying events.</li><li>Coordinate activities of the Human Resources Office with other City departments and external support contacts or contracted vendors.</li><li>Participate in and conduct surveys on compensation, employee benefits, and other related areas in support of labor negotiations.</li><li>Process workers' compensation claims and maintains employee disability/leave status; serves as staff liaison with City's third party administrator for workers' compensation.</li><li>Prepare and maintain personnel records, and general file maintenance.</li><li>Perform office administration duties and other administrative tasks as assigned.</li><li>Research and gather information for various personnel related reports; prepare routine statistical reports and letters as assigned.</li><li>Proofread outgoing division correspondence and communications for completeness, spelling, grammatical, or punctuation accuracy.</li><li>Perform other related duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Any combination equivalent to experience and education that could likely provide the required skills, knowledge and abilities would be qualifying. A typical way to obtain the skills, knowledge and abilities would be:<br/><br/><strong>Education: </strong> High school diploma or equivalent, supplemented by some college level courses in personnel, business, public administration or a closely related field.<br/><br/><strong>Experience:</strong> Four (4) years of increasingly responsible administrative support work experience, of which includes at least two (2) full-time years (or equivalent) in a human resources office or related field. Municipal work experience preferred.<br/><br/><strong>Knowledge of:</strong> General understanding of human resources administration and the ability to provide support of recruitment and onboardingModern office equipment such as a personal computer, scanning equipment and related software; professional telephone etiquette and effective customer service techniques; personnel policies, practices, and procedures; modern records retention and recordkeeping practices; and, working knowledge of MS Word, Excel, Powerpoint, HRIS systems (Kronos, Eden, NeoGov, etc.).<br/><br/><strong>Ability to</strong>: Demonstrates a reliable and responsible work ethic during times of stress and changing priorities; has a proactive, can-do attitude; strong organizational skills while handling a heavy workload and organizing time and resources efficiently; proactive follow up with employees, managers, and other Human Resources staff to communicate status updates, keep stakeholders informed, and move processes forward; exceptional attention to detail and ability to maintain extensive and accurate records and ensure work is thorough and professional; exceptional customer service skills and the ability to effectively respond to and address public and employee questions, identify issues, and share ideas; strong computer skills and the ability to use Microsoft Excel to track information; Microsoft Word to prepare memos and letters; Microsoft Outlook to communicate with staff and manage deadlines; and third-party databases to accurately update information; strong interpersonal skills and the ability to develop and maintain effective working relationships with employees, managers, and the public; ability to maintain confidentiality of privileged and confidential information, exercise professional judgment, and conduct oneself ethically in all personnel matters; reliable team player and the ability to work independently as well as collaborate as part of a larger recruitment team and division; plan, coordinate, and effectively organize work to meet deadlines; prepare well-written routine correspondence demonstrating good English usage skills including spelling, vocabulary, grammar and punctuation; establish and maintain cooperative and effective working relationships with those contacted in the course of work; make decisions in procedural matters based on learned knowledge and directives; use common sense and reasonable judgment in difficult situations; work assigned scheduled demonstrating consistent attendance and reliability.", "preferred": "In the event of field duties such as attending training workshops or conducting off-site testing, a valid California Driver's License and an acceptable driving record during the course of employment is required or the ability to utilize an alternative method of transportation to carry out an essential function of the position.<br/><br/><strong>California Department of Motor Vehicle (DMV) Pull Notice System: </strong>An incumbent appointed to this position is subject to enrollment in the California DMV Pull Notice Program. The Pull Notice program provides information on the incumbent's driving record and Driver's License status on a periodic basis to the City of Downey. An employee assigned a City vehicle must acknowledge receipt and understanding of City Administrative Regulations covering the use of City vehicles."}, "skills": ["HRIS", "Onboarding", "Customer Service", "Communication", "Microsoft Excel", "Microsoft Word", "Microsoft Outlook", "Teamwork", "Problem Solving", "Organization", "Time Management", "Attention to Detail", "Confidentiality", "Professional Judgment", "Ethics", "Records Management", "Recruitment", "Selection", "Compensation", "Benefits Administration", "Workers' Compensation", "Labor Relations", "Employee Development", "Training", "General Office Administration", "Recordkeeping", "Classification", "Employee Services", "Payroll Processing", "Performance Management", "Surveys", "Negotiations", "Statistical Reporting", "Correspondence", "Proofreading", "California Driver's License", "DMV Pull Notice Program"], "postedDate": "2 weeks ago", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996550308"}