{"jobTitle": "Chief of Staff", "company": {"name": "Inversion", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "150,000.00/yr - 250,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Defense and Space Manufacturing", "description": "Turning Space into a Transportation Layer for Earth<br/><br/><strong>Who We Are<br/><br/></strong>Eras of humanity can often be defined by a dominant transportation mode - horse drawn chariots, ocean going boats, or aircraft. These were spurred by a small group of people rigorously focused on building technology to achieve faster access to more of the world. We seek to usher in a new era of humanity defined by universal access to the whole globe free of borders and the presence of a routine way from space to Earth. To do this, we are building highly maneuverable re-entry vehicles that can loiter in orbit before precision landing back on Earth.<br/><br/><strong>What You’ll Do</strong> <br/><br/><ul><li>Work with the CEO to start projects, owning them through initial phase of development, and assist in transitioning them to dedicated teams.</li><ul><li>For example, we want to explore a dedicated landing site for our capsules. You would kick that project off and see it to a place that it makes sense for a dedicated team to own.</li><li>For example, you could manage the opening of a new manufacturing facility.</li><li>For example, you could work to get industrial design prototypes made of a new product from an external vendor.</li></ul><li>Work with the founders and leaders to roll out new employee initiatives.</li><li>Discuss and iterate strategy with the founders and leaders at Inversion.</li><li>Serve as an extension of the CEO, improving his ability to track and manage everything that's happening in the business, from day-to-day operations to long term strategic initiatives, with a strong focus on being a change agent.</li><li>Helping with slide decks and board meeting prep.</li><li>This is NOT an Executive Assistant role.</li><li>One thing we can promise is that each week will be a totally different set of problems to solve, ideas to generate, and goals to accomplish!<br/></li></ul><strong>Required Qualifications</strong> <br/><br/><ul><li>3+ years of project management experience.</li><li>Ability to organize oneself, multiple projects, and multiple people at the same time.</li><li>Honest, transparent, and frequent communication skills.</li><ul><li>Must have the courage to challenge and push back against senior leadership, including the CEO, when necessary.</li></ul><li>Experience in excelling in the chaos of a startup.</li><li>Ambition to achieve the previously thought impossible.<br/></li></ul><em>The California annual base salary for this role is currently <strong>$150,000-$250,000</strong>. Pay Grades are determined by role, level, location, and alignment with market data. Individual pay will be determined on a case-by-case basis and may vary based on the following considerations: interviews and an assessment of several factors that are unique to each candidate, job-related skills, relevant education and experience, certifications, abilities of the candidate and internal equity. <br/><br/></em><strong>ITAR Compliance<br/><br/></strong>To conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here.<br/><br/><strong>Equal Employment Opportunity<br/><br/></strong>Inversion provides equal employment opportunities to all employees and applicants without regard to race, color, religion, age, sex, gender identity, sexual orientation, national origin, veteran status, or disability.<br/><br/>Inversion collects and processes personal data in accordance with applicable data protection laws. If you are a US Job Applicant see the CCPA Privacy Policy Notice for further details.", "responsibilities": "Work with the CEO to start projects, owning them through initial phase of development, and assist in transitioning them to dedicated teams.\nFor example, we want to explore a dedicated landing site for our capsules. You would kick that project off and see it to a place that it makes sense for a dedicated team to own.\nFor example, you could manage the opening of a new manufacturing facility.\nFor example, you could work to get industrial design prototypes made of a new product from an external vendor.\nWork with the founders and leaders to roll out new employee initiatives.\nDiscuss and iterate strategy with the founders and leaders at Inversion.\nServe as an extension of the CEO, improving his ability to track and manage everything that's happening in the business, from day-to-day operations to long term strategic initiatives, with a strong focus on being a change agent.\nHelping with slide decks and board meeting prep.\nThis is NOT an Executive Assistant role.\nOne thing we can promise is that each week will be a totally different set of problems to solve, ideas to generate, and goals to accomplish!", "qualifications": {"required": "3+ years of project management experience.\nAbility to organize oneself, multiple projects, and multiple people at the same time.\nHonest, transparent, and frequent communication skills.\nMust have the courage to challenge and push back against senior leadership, including the CEO, when necessary.\nExperience in excelling in the chaos of a startup.\nAmbition to achieve the previously thought impossible."}, "skills": ["Project Management", "Communication", "Leadership"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996037577"}