{"jobTitle": "Employee Development Manager", "company": {"name": "CrowdStrike", "industry": "Computer and Network Security", "size": "1001-5000 employees", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$105,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Computer and Network Security", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\n\nAbout The Role\n\nAs the Employee Development Manager, you will lead end-to-end learning program solutions, primarily focused on managing global learning programs for individual contributors (IC) across the company, with audiences ranging from interns to early-mid career employees. Managing the IC programs involves virtual facilitation and delivery and program operations, including participant communications, production, and logistics. Using expert on-camera facilitation skills, you will be responsible for creating engaging and inclusive virtual experiences for IC employees worldwide. As a global company, the role requires scheduling flexibility for multiple time zones. You will report to the Director, Leadership Learning & Development (LLD), within Global HR.", "responsibilities": "Manage employee learning programs from end-to-end, including initial project scope definitions, delivery strategies, measuring success metrics and outcomes, and continuous program content updates and maintenance. Lead and manage the IC learning curriculum for the LLD team, including the design, development, and curation of facilitator-led courses as well as self-guided learning (i.e. e-learning, internal websites, learner guides, etc.). Use instructional design methods (i.e., ADDIE, Merrill’s Principles, Bloom’s Taxonomy) to create employee-centric individual contributor focused audiences. Incorporate adult learning theory to develop and build learning assets and solutions using authoring software and tools, such as Microsoft PowerPoint, Articulate 360, Captivate, Vyond, and graphic/video software (i.e. Adobe suite, iMovie). Collaborate with subject-matter experts (SMEs) and functional stakeholders to perform needs analysis, scope projects, and evaluate existing materials to identify the appropriate approach and content for CrowdStrike’s diverse audiences. Oversee learning program forecasting, scheduling, strategy, logistics and measurement in alignment with the overall LLD Roadmap. Provide learning admin support, including LMS administration, intranet communications, and content repository site management.", "qualifications": {"required": "4+ years of experience with facilitating, teaching, and presenting to a wide range of employee audiences of size varying sizes in both virtual and in-person formats. 3+ years of experience leading development learning programs with a specific learning curriculum. 3+ years of experience partnering, collaborating, and consulting with multiple internal business partners and stakeholders. 3+ years of experience in instructional, user-experience, training or process design. Bachelor's degree or equivalent years of professional experience.", "preferred": "MBA, Master’s degree, or certifications in adult learning or learning technologies. Work experience in a SaaS or technology-related industry. Toastmasters Club experience."}, "skills": ["Facilitation", "Instructional Design", "Project Management", "Communication", "Collaboration", "Adaptability"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Remote-first culture, Market leader in compensation and equity awards, Competitive vacation and flexible working arrangements, Comprehensive and inclusive health benefits, Physical and mental wellness programs, Paid parental leave, including adoption, A variety of professional development and mentorship opportunities, Offices with stocked kitchens when you need to fuel innovation and collaboration.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3996817618"}