{"jobTitle": "Assistant Manager - Distribution Field Operations", "company": {"name": "American Honda Motor Company, Inc.", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Motor Vehicle Manufacturing", "description": "<strong><u>What Makes a Honda, is Who makes a Honda</u></strong>\n<p>Honda has a clear vision for the future, and it’s a joyful one. We are looking for individuals with the skills, courage, persistence, and dreams that will help us reach our future-focused goals.</p><p><br/></p><p><br/></p><p>At our core is innovation. Honda is constantly innovating and developing solutions to drive our business with record success. We strive to be a company which serves as a source of “power” that supports people around the world who are trying to do things based on their own initiative and that helps people expand their own potential. To this end, Honda strives to realize “the joy and freedom of mobility” by developing new technologies and an innovative approach to achieve a “zero environmental footprint.”</p><p><br/></p><p><br/></p><p>We are looking for qualified individuals with diverse backgrounds, experiences, continuous improvement values, and a strong work ethic to join our team.</p><p><br/></p><p><br/></p><p>If your goals and values align with Honda’s, we want you to join our team to Bring the Future!</p><p><br/></p><p><br/></p><p><strong><u>About this Position: </u></strong></p><ul><li>Meet Post Production Options (PPO) sales objectives while maintaining high vehicle turn rates increasing American Honda's profitability.</li><li>Achieve monthly and yearly vehicle sales targets vs. KiPlan.</li><li>Lead the sales strategy with S&amp;PP department to balance production model mix between Dealer allocation, Zone business needs, company vehicle business, Fleet Management business, and Export business.</li><li>Conduct comprehensive regional market studies using available internal data, competitive information, and discussions with regional management to determine targeted strategies and countermeasures</li><li>Provide Honda executive management with in-depth analysis reviewing sales/market situation across the Honda model lineup and make recommendations regarding potential mid-cycle countermeasures. Provide analysis to be used in BIM, Seihan, and NAROB presentations</li><li>Lead regional program needs with zone management teams and implement small volume vehicle distribution strategy.</li><li>SP Presentation Support: Provide data and strategy to support launch of new vehicles, MMCs, and FMCs.</li><li>Assist with developing executive incentive proposals with a strong emphasis on efficient spending ($2B annual budget).</li></ul><p><br/></p><p><br/></p><p><strong><u>Responsibilities include:</u></strong></p><ul><li>Lead Honda Post Production Options (PPO) sales strategy and new model implementation.</li><li>Meet monthly Honda vehicle Sales Objectives and review monthly with executives on future countermeasures for any model short falls.</li><li>Manage APEX dealer allocation in coordination with S&amp;PP dept to distribute vehicles effectively and equitably to all regions to achieve sales objectives.</li><li>Manage market support distribution to assist Regional Sales management with low inventory and top performing dealers. Manage the distribution and allocation of small volume specialty vehicles.</li><li>Coordinate incentive, new business, CPO, and other departments to achieve combine AHM goals.</li><li>Business Planning &amp; Quarterly Progress/Budget Review: Work with senior Honda leaders to develop in-depth fiscal year plan for National Sales. Develop PDCAs on KPI shortfalls.</li><li>Cross training of rotational managers, ensuring the department consistency during turnover periods.</li></ul><p><br/></p><p><br/></p><p><br/></p><p><strong><u>Who we are seeking:</u></strong></p><p><strong>Required Work Experience:</strong></p><ul><li>7 years Automotive experience</li><li>5-7 years analytical role</li><li>5+ years Field Sales experience</li></ul><p><br/></p><p><strong>Required Education:</strong></p><ul><li>Bachelor’s degree</li></ul><p><br/></p><p><strong>Desired skills:</strong></p><ul><li>Strong analytical skills</li><li>Ability to manage project and lead strategy-based discussions</li><li>Strong excel and PowerPoint background</li><li>Strong presentation skills</li></ul><p><br/></p><p><strong><u>What differentiates Honda and makes us an employer of choice?</u></strong></p><p><strong>Total Rewards:</strong></p><ul><li>Competitive Base Salary: <em>Pay will be based on several variables that include, but not limited to, geographic location, work experience, education, etc.</em></li><li>Annual Bonus</li><li>Representative Lease Car Program (No Cost - Car, Maintenance, and Insurance included)</li><li>Industry leading Benefit Plans (Medical, Dental, Vision, Rx)</li><li>Paid time off, including vacation, paid holidays, sick time, personal days</li><li>401K Plan with company match + additional contribution</li><li>Lifestyle Bonus</li></ul><p><br/></p><p><strong>Career Growth:</strong></p><ul><li>Advancement opportunities</li><li>Career mobility</li><li>Education reimbursement for continued learning</li><li>Training and Development programs</li></ul><p><br/></p><p><strong>Additional Offerings:</strong></p><ul><li>Wellbeing program</li><li>Community service and engagement programs</li><li>Product programs</li><li>Free drinks onsite</li></ul><p><br/></p><p>Honda is an equal opportunity employer and considers qualified applicants for employment without regard to race, color, creed, religion, national origin, sex, sexual orientation, gender identity and expression, age, disability, veteran status, or any other protected factor.</p>", "responsibilities": "Lead Honda Post Production Options (PPO) sales strategy and new model implementation. Meet monthly Honda vehicle Sales Objectives and review monthly with executives on future countermeasures for any model short falls. Manage APEX dealer allocation in coordination with S&amp;PP dept to distribute vehicles effectively and equitably to all regions to achieve sales objectives. Manage market support distribution to assist Regional Sales management with low inventory and top performing dealers. Manage the distribution and allocation of small volume specialty vehicles. Coordinate incentive, new business, CPO, and other departments to achieve combine AHM goals. Business Planning &amp; Quarterly Progress/Budget Review: Work with senior Honda leaders to develop in-depth fiscal year plan for National Sales. Develop PDCAs on KPI shortfalls. Cross training of rotational managers, ensuring the department consistency during turnover periods.", "qualifications": {"required": "7 years Automotive experience\n5-7 years analytical role\n5+ years Field Sales experience\nBachelor’s degree", "preferred": "Strong analytical skills\nAbility to manage project and lead strategy-based discussions\nStrong excel and PowerPoint background\nStrong presentation skills"}, "skills": ["Analytical Skills", "Project Management", "Sales", "Excel", "PowerPoint", "Presentation Skills"], "postedDate": "1 week ago", "benefits": "Competitive Base Salary: Pay will be based on several variables that include, but not limited to, geographic location, work experience, education, etc.\nAnnual Bonus\nRepresentative Lease Car Program (No Cost - Car, Maintenance, and Insurance included)\nIndustry leading Benefit Plans (Medical, Dental, Vision, Rx)\nPaid time off, including vacation, paid holidays, sick time, personal days\n401K Plan with company match + additional contribution\nLifestyle Bonus\nAdvancement opportunities\nCareer mobility\nEducation reimbursement for continued learning\nTraining and Development programs\nWellbeing program\nCommunity service and engagement programs\nProduct programs\nFree drinks onsite", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996470915"}