{"jobTitle": "Minors Compliance Manager", "company": {"name": "The Walt Disney Company", "industry": "Entertainment Providers", "size": "Large", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$123,000.00 - $165,000.00", "currency": "USD"}, "jobFunction": "Strategy/Planning, Human Resources, and Other", "industry": "Entertainment Providers", "description": "At Disney, we’re storytellers. We make the impossible possible. We do this through developing and applying ground breaking technology and innovating to bring stories to life through our movies, products, interactive games, parks and resorts, and media networks. Now is your chance to join our talented team that delivers unparalleled creative content and experiences to audiences around the world. The Minors Compliance Manager role is an integral part of the Disney Legal Minors department and will work with the Assistant General Counsel advising the Enterprise on all minors matters under a center of excellence model with a proactive and client-centric approach. The Disney Legal Minors Department supports corporate clients, companies, business segments and all Disney’s productions, projects, and activities involving minors matters. We are looking for a thoughtful, driven, collaborative contributor who can effectively lead and partner with diverse corporate clients to help them work towards their goals. This role will be located in Burbank, California.", "responsibilities": "Collaborate with the Assistant General Counsel to define and implement a long-term strategy for minors' legal practice to meet the growing needs of the Enterprise. Identify areas of improvement, formulate recommendations, and develop infrastructure and internal tools to support minors' legal practice. Provide expertise across the enterprise and advise and train clients regarding compliance with minor’s laws. Partner with stakeholders (e.g., corporate clients, companies, business segments, union representatives, labor relations) regarding minors matters. Research and maintain current knowledge of applicable minor's laws, policies, and procedures; analyze how these might impact the Enterprise; and keep the Assistant General Counsel advised of relevant legal issues. Draft and review documents (e.g., contract-approval petitions, permit requests, advisory-opinion requests) to be submitted to courts and government agencies. Build partnerships with diverse corporate clients and productions teams, and collaborate with business and legal colleagues throughout the Enterprise to enhance minors legal practice. Partner with Assistant General Counsel on company-wide policy development, process enhancements, and continuous improvement practices and projects. Perform other duties and/or functions as assigned by the Assistant General Counsel.", "qualifications": {"required": "At least 7+ years of proven experience working on minors matters in the entertainment industry. Excellent research, writing, verbal and analytical skills. Ability to identify and analyze sophisticated and nuanced legal issues and explain them. Self-motivated and thrive in a fast-paced, high-volume environment. Outstanding judgment, work ethic, moral, and personal values. Team-oriented with excellent interpersonal skills and ability to collaborate effectively with co-workers, corporate clients and outside counsel, owning all parts of the process. Appetite for change and experience with change management. Skills for spotting, analyze, and mitigate legal risks; assess complex legal issues; and devise practical strategies and solutions.", "preferred": "Bachelor’s degree in law or a related field."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996252021"}