{"jobTitle": "Chief of Staff, Population Health Management", "company": {"name": "Dice", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "69,100.00 - 98,700.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Gainwell Technologies LLC, is seeking the following. Apply via Dice today!<br/><br/>Great companies need great teams to propel their operations. Join the group that solves business challenges and enhances the way we work and grow. Working at Gainwell carries its rewards. You'll have an incredible opportunity to grow your career in a company that values your contributions and puts a premium on work flexibility, learning, and career development.<br/><br/><strong>Summary<br/><br/></strong>This is a key role within the Population Health Management (PHM) project. The role will focus on supporting the development of the PHM Service, a groundbreaking data platform for Medicaid that Gainwell has been selected to deliver, sponsored by the state of California.<br/><br/><strong>Your role in our mission</strong> <br/><br/><ul><li> Support development of account road map</li><ul><li> Evaluate macro business architecture of DHCS and supporting agencies </li><li> Research policy requirements for each entity to identify synergies and overlap </li><li> Develop set of proposals to highlight opportunities for DHCS / PHM program </li><li> Support DHCS in developing relationship and integration points </li></ul><li> Synthesis of our Project Change Requests and Dependencies work. Support development of our internal service architecture by looking at critical dependencies (Policy, internal operations, etc.) the service has with DHCS and analyzing and developing options for DHCS to resolve dependency. </li><li> Support Product Management. As necessary apply learnings from Account Road map and internal dependencies to help product team articulate and design the service. </li><li> Other special projects (e.g. Executive Communications) as needed. <br/><br/></li></ul><strong>What We're Looking For<br/><br/></strong><ul><li> Bachelor's degree or equivalent combination of education and experience. </li><li> 2+ years of working experience in managing large-scale change or transformation initiatives. </li><li> Experience working with the interface of data and functional groups within an organization. </li><li> A collaborative approach to work, and the motivation to develop skills by taking ownership of new challenges. </li><li> Excellent presentation skills, and the ability to communicate complex technical concepts simply and effectively to all audiences. </li><li> Demonstrate the ability to conceptualize components of a business issue to aid in the analysis and definition of solutions. </li><li> Strong leadership skills and ability to work with a diverse audience. </li><li> Ability to take initiative and drive execution with minimal supervision. </li><li> Technical capabilities in business applications (Microsoft Office, Tableau) and healthcare applications. <br/><br/></li></ul><strong>What You Should Expect In This Role<br/><br/></strong><ul><li> Onsite work in Sacramento, CA, or willingness to travel to Sacramento, CA, 20-30% time is required. <br/><br/></li></ul>The deadline to submit applications for this posting is September 3 , 2024.<br/><br/>The pay range for this position is $69,100.00 - $98,700.00 per year, however, the base pay offered may vary depending on geographic region, internal equity, job-related knowledge, skills, and experience among other factors. Put your passion to work at Gainwell. You'll have the opportunity to grow your career in a company that values work flexibility, learning, and career development. All salaried, full-time candidates are eligible for our generous, flexible vacation policy, a 401(k) employer match, comprehensive health benefits , and educational assistance. We also have a variety of leadership and technical development academies to help build your skills and capabilities.<br/><br/>We believe nothing is impossible when you bring together people who care deeply about making healthcare work better for everyone. Build your career with Gainwell, an industry leader. You'll be joining a company where collaboration, innovation, and inclusion fuel our growth. Learn more about Gainwell at our company website and visit our Careers site for all available job role openings.<br/><br/>Gainwell Technologies is committed to a diverse, equitable, and inclusive workplace. We are proud to be an Equal Opportunity Employer, where all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We celebrate diversity and are dedicated to creating an inclusive environment for all employees. Chief of Staff, Population Health Management", "responsibilities": "<ul><li> Support development of account road map</li><ul><li> Evaluate macro business architecture of DHCS and supporting agencies </li><li> Research policy requirements for each entity to identify synergies and overlap </li><li> Develop set of proposals to highlight opportunities for DHCS / PHM program </li><li> Support DHCS in developing relationship and integration points </li></ul><li> Synthesis of our Project Change Requests and Dependencies work. Support development of our internal service architecture by looking at critical dependencies (Policy, internal operations, etc.) the service has with DHCS and analyzing and developing options for DHCS to resolve dependency. </li><li> Support Product Management. As necessary apply learnings from Account Road map and internal dependencies to help product team articulate and design the service. </li><li> Other special projects (e.g. Executive Communications) as needed. <br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent combination of education and experience.  2+ years of working experience in managing large-scale change or transformation initiatives.  Experience working with the interface of data and functional groups within an organization.  A collaborative approach to work, and the motivation to develop skills by taking ownership of new challenges.  Excellent presentation skills, and the ability to communicate complex technical concepts simply and effectively to all audiences.  Demonstrate the ability to conceptualize components of a business issue to aid in the analysis and definition of solutions.  Strong leadership skills and ability to work with a diverse audience.  Ability to take initiative and drive execution with minimal supervision.  Technical capabilities in business applications (Microsoft Office, Tableau) and healthcare applications. ", "preferred": ""}, "skills": ["Tableau", "Microsoft Office"], "postedDate": "5 days ago", "benefits": "All salaried, full-time candidates are eligible for our generous, flexible vacation policy, a 401(k) employer match, comprehensive health benefits , and educational assistance. We also have a variety of leadership and technical development academies to help build your skills and capabilities.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996934212"}