{"jobTitle": "Customer Service & E-Commerce Supervisor (Customer Service, In-Store Shopper Supervisor)", "company": {"name": "Whole Foods Market", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Retail", "description": "At Whole Foods Market, we are working to nourish people and the planet. In this role, you will support the Customer Service &amp; E-Commerce programs; this means you lead processes supporting the checkout experience and grocery delivery &amp; pickup at your assigned store. You will focus on driving safety, quality of outbound online orders, excellent pickup experience, team productivity, and program execution. You will monitor key performance indicator metrics and visual cues in-store to assess the Team’s performance in these areas. You are responsible for daily operations including managing capacity, labor utilization, adherence to pick processes, and drop of task execution (for E-Commerce); and, cash management, customer demand management, labor utilization, and execution of store processes (for Customer Service). As the Supervisor, you support the Team Leader in leading and developing Team Members. You must strive to support WFM core values, Leadership Principles, and goals, promote national, geographic-specific, store programs and initiatives, and ensure adherence to all applicable health and safety regulations.<br/><br/><strong>Job Responsibilities<br/><br/></strong><ul><li>Delivers outstanding customer experience; and holds all Team Members accountable for delivering outstanding customer service.</li><li>Establishes clear expectations for balancing in-store customer service and completing online orders.</li><li>Monitors in-store and online customer flow; assigns customer service-related and online order completion tasks balancing the needs of all customers.</li><li>Seeks awareness of relevant competitors and industry trends.</li><li>Ensures an effective and efficient response to customer questions, requests, and/or concerns.</li><li>Supports collaborative and productive relationships with departmental leaders, store leadership, and 1P/3P partners, e.g., Amazon delivery drivers.</li><li>Fosters and encourages a positive environment of outstanding teamwork, mutual respect, and exceptional morale.</li><li>Maintains Team Member safety and security standards.</li><li>Ensures compliance with relevant regulatory rules and standards.</li><li>Develops, coaches, mentors, and motivates Team Members in a manner that sustains a high performing Team and minimizes turnover.</li><li>Maintains cleanliness of workspaces including staging area and coolers.</li><li>Maintains security of equipment, e.g., MSRs, phones, currency counters.</li><li>Proactively identifies process improvement opportunities.</li><li>Consistently communicates and models WFM core values, leadership principles, and supports goals.<br/><br/></li></ul>Job Skills<br/><br/><ul><li>Ability to perform task management, balancing dynamic customer flows.</li><li>Strong analysis skills to root cause underperformance (either observed or demonstrated by metric performance).</li><li>Excellent interpersonal, motivational, team building and customer relationship skills.</li><li>Capable of teaching others in a positive and constructive manner.</li><li>Proficient with email, Microsoft Office, and operations-related applications.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>12+ months retail experience<br/><br/></li></ul>Physical Requirements/Working Conditions<br/><br/><ul><li>Must be able to lift 50 lbs.</li><li>In an 8-hour workday: standing/walking 6-8 hours.</li><li>Hand use: Single grasping, fine manipulation, pushing and pulling.</li><li>Work requires the following motions: bending, twisting, squatting, and reaching</li><li>Exposure to FDA approved cleaning chemicals</li><li>Exposure to temperatures 90 degrees Fahrenheit</li><li>Ability to work in a wet and cold environment.</li><li>Ability to work a flexible schedule including nights, weekends, and holidays as needed.</li><li>Ability to use tools and equipment, including box cutters, electric pallet jacks, and other heavy machinery.</li></ul>", "responsibilities": "Delivers outstanding customer experience; and holds all Team Members accountable for delivering outstanding customer service.\nEstablishes clear expectations for balancing in-store customer service and completing online orders.\nMonitors in-store and online customer flow; assigns customer service-related and online order completion tasks balancing the needs of all customers.\nSeeks awareness of relevant competitors and industry trends.\nEnsures an effective and efficient response to customer questions, requests, and/or concerns.\nSupports collaborative and productive relationships with departmental leaders, store leadership, and 1P/3P partners, e.g., Amazon delivery drivers.\nFosters and encourages a positive environment of outstanding teamwork, mutual respect, and exceptional morale.\nMaintains Team Member safety and security standards.\nEnsures compliance with relevant regulatory rules and standards.\nDevelops, coaches, mentors, and motivates Team Members in a manner that sustains a high performing Team and minimizes turnover.\nMaintains cleanliness of workspaces including staging area and coolers.\nMaintains security of equipment, e.g., MSRs, phones, currency counters.\nProactively identifies process improvement opportunities.\nConsistently communicates and models WFM core values, leadership principles, and supports goals.", "qualifications": {"required": "12+ months retail experience"}, "skills": ["Customer Service", "Teamwork", "Microsoft Office", "Email", "Operations"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996042282"}