{"jobTitle": "Global Product Lead, Google Customer Solutions", "company": {"name": "Google", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "115,000.00/yr - 169,000.00/yr", "currency": "USD"}, "jobFunction": "General Business, Strategy/Planning, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "This role may also be located in our Playa Vista, CA campus.<br/><br/>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <strong>Mountain View, CA, USA; New York, NY, USA; Los Angeles, CA, USA; San Francisco, CA, USA</strong>.<strong>Minimum qualifications:<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience.</li><li>4 years of experience in product management, marketing, management consulting, or project management in technology.</li><li>Experience working with Product Management or Engineering teams, executive leadership, and cross-functional stakeholders.</li><li>Experience developing business strategies or managing cross-functional initiatives.</li><li>Experience working cross-functionally with product teams to launch partner integrations or go-to-market strategies.<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>Experience partnering with clients on technical products (e.g., pitching solutions, consulting, project management, implementation, demonstrating products, or technical sales).</li><li>Experience working in a scaled environment in inside-sales, marketing or operations.</li><li>Excellent Project management skills, especially managing complex projects with stakeholders across multiple functions.</li><li>Strategic thinking and problem solving with demonstrated ability to lead complex operational and strategic initiatives.</li><li>Ability to structure a story line and build presentation decks/documents to support their position.</li><li>Excellent written and verbal communication skills in both practitioner and executive level contexts.<br/><br/></li></ul><strong>About The Job<br/><br/></strong>In this role, you will lead the design and execution of the go-to-market (GTM) strategy for GCS Google ads customers. You will leverage qualitative and quantitative customer and seller insights to uncover gaps and opportunity areas, design and GTM levers to capture the opportunities and implementation, in partnership with stakeholders. You will work on the purchase and sale agreement (PSA), business incentives, PSA seller enablement and support training and collateral as well as some innovative levers being experimented in GCS. You will also influence product strategy and road map based on insights from customers, sellers, and other stakeholders.<br/><br/>Also in this role, you will become a product and GTM expert and understand our customer needs and advertising goals. You will leverage your business and analytical skills to persistently explore and uncover the needs of our Scaled sellers and customers. You will lead collaboratively with cross-functional teams, and will rely on your influencing, relationship-building and communication skills to identify opportunities, drive alignment, and ensure execution. You will be held accountable to driving product adoption and seller and advertiser success.<br/><br/>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow. Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.<br/><br/>The US base salary range for this full-time position is $115,000-$169,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop and lead go-to-market and commercialization plans, leveraging the customer-centric journey based approach being deployed across GCS.</li><li>Provide structure, problem solving and operational management to enable success of priority customer segment, reflecting in higher value from and spend on Google Ads, for better outcomes.</li><li>Build exceptional partnerships across critical internal teams including Sales, business Strategy and Operations, Product, Strategy and Operations, Marketing and others to deliver results for ads customers and sellers.</li><li>Facilitate annual and quarterly product priorities and business planning process.</li><li>Become a segment and product GTM expert for GCS customers. Understand how Small and Midsize Business (SMB) customers engage with product offerings and influence the Product road map to better address customer needs.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Develop and lead go-to-market and commercialization plans, leveraging the customer-centric journey based approach being deployed across GCS.</li><li>Provide structure, problem solving and operational management to enable success of priority customer segment, reflecting in higher value from and spend on Google Ads, for better outcomes.</li><li>Build exceptional partnerships across critical internal teams including Sales, business Strategy and Operations, Product, Strategy and Operations, Marketing and others to deliver results for ads customers and sellers.</li><li>Facilitate annual and quarterly product priorities and business planning process.</li><li>Become a segment and product GTM expert for GCS customers. Understand how Small and Midsize Business (SMB) customers engage with product offerings and influence the Product road map to better address customer needs.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n4 years of experience in product management, marketing, management consulting, or project management in technology.\nExperience working with Product Management or Engineering teams, executive leadership, and cross-functional stakeholders.\nExperience developing business strategies or managing cross-functional initiatives.\nExperience working cross-functionally with product teams to launch partner integrations or go-to-market strategies.", "preferred": "Experience partnering with clients on technical products (e.g., pitching solutions, consulting, project management, implementation, demonstrating products, or technical sales).\nExperience working in a scaled environment in inside-sales, marketing or operations.\nExcellent Project management skills, especially managing complex projects with stakeholders across multiple functions.\nStrategic thinking and problem solving with demonstrated ability to lead complex operational and strategic initiatives.\nAbility to structure a story line and build presentation decks/documents to support their position.\nExcellent written and verbal communication skills in both practitioner and executive level contexts."}, "skills": [], "postedDate": "1 week ago", "benefits": "bonus + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996432728"}