{"jobTitle": "Materials Manager", "company": {"name": "Rain Bird Corporation", "location": "Azusa, CA"}, "location": "Azusa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "155,000.00/yr - 233,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "<strong>Overview<br/><br/></strong>The Materials Manager is responsible for all purchasing, production planning, and inventory planning for the Azusa Manufacturing Plant. Responsibilities include long and short-term production planning, BOM item and MRO purchasing, negotiating prices with suppliers, vendor selection/certification, international purchasing, warehousing, receiving operations, shipping operations, the cycle count program, and all systems related to materials inventory management. This position is part of the plant leadership team and participates in plant strategic planning.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Create production plans that meet customer requirements and support a level-loaded plant while continuously improving inventory turns </li><li> Participate in the corporate SIOP process </li><li> Develop min/max targets using the APICS methodology to balance inventory levels with market requirements; ensure that finished goods inventory levels are maintained within the min/max targets </li><li> Identify gaps between capacity and customer requirements; work with the Azusa management team to develop recovery and/or gap closure plans </li><li> Ensure that production requirements &amp; schedules are properly communicated to the production floor </li><li> Work with external suppliers to set up VMI (vendor managed inventory) programs, negotiate prices and payment terms, develop second sources, phase out poor performers, and ensure that our vendors can meet on time delivery, quality, and cost objectives </li><li> Work with internal and external suppliers to establish min/max targets for component inventory that meet production requirements and inventory turns goals; maintain component inventory within these targets </li><li> Drive continuous improvement projects to implement lean methodologies for warehouse management, inventory levels, and materials flow </li><li> Lead, develop, and mentor Azusa purchasing/planning, warehouse, cycle count, shipping, and receiving staff <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> BS in Planning &amp; Logistics, Manufacturing Engineering, or equivalent technical degree </li><li> 10 yrs of progressive experience in manufacturing to include 5+ years of supply chain or materials management experience </li><li> MRP and ERP experience </li><li> Ability to lead, train and develop others </li><li> Effective communication skills </li><li> Excellent team player with a positive attitude </li><li> Lean Manufacturing or Lean 6-Sigma Experience </li><li> Strong data analysis and problem-solving skills </li><li> Organized and detail-oriented mindset </li><li> Strong computer knowledge (MS Office, ERP/MRP systems) <br/><br/></li></ul><strong> DESIRED QUALIFICATIONS: <br/><br/></strong><ul><li> Bi-lingual English and Spanish </li><li> MBA </li><li> APICS Certified <br/><br/></li></ul>Salary range for candidates based in California: $155,000 - $233,000<br/><br/>Salary ranges include base salary and annual incentive bonus if applicable.<br/><br/>Exact compensation may vary based on skills, experience, and location.<br/><br/> Onsite<br/><br/><strong> Rain Bird Corporation is an Equal Opportunity Employer</strong>", "responsibilities": "The Materials Manager is responsible for all purchasing, production planning, and inventory planning for the Azusa Manufacturing Plant. Responsibilities include long and short-term production planning, BOM item and MRO purchasing, negotiating prices with suppliers, vendor selection/certification, international purchasing, warehousing, receiving operations, shipping operations, the cycle count program, and all systems related to materials inventory management. This position is part of the plant leadership team and participates in plant strategic planning.", "qualifications": {"required": "BS in Planning & Logistics, Manufacturing Engineering, or equivalent technical degree, 10 yrs of progressive experience in manufacturing to include 5+ years of supply chain or materials management experience, MRP and ERP experience, Ability to lead, train and develop others, Effective communication skills, Excellent team player with a positive attitude, Lean Manufacturing or Lean 6-Sigma Experience, Strong data analysis and problem-solving skills, Organized and detail-oriented mindset, Strong computer knowledge (MS Office, ERP/MRP systems)", "preferred": "Bi-lingual English and Spanish, MBA, APICS Certified"}, "skills": ["MRP", "ERP", "Lean Manufacturing", "Lean 6-Sigma", "Data Analysis", "Problem Solving", "MS Office"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996926030"}