{"jobTitle": "Administrative Support Coordinator - BOD (USU)", "company": {"name": "California State University, Northridge", "industry": "Higher Education", "location": "Northridge, CA"}, "location": "Northridge, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Higher Education", "description": "About The University Student Union<br/><br/>The University Student Union, as the heart of campus, uplifts and empowers students to achieve educational, personal and professional goals by providing leadership development, meaningful employment, and innovative programs, services and facilities. We promote equity, inclusion and well-being, while encouraging social justice advocacy to help Matadors feel heard, respected and connected to CSUN. Our facilities include a University Student Union and a 138,000 square foot Student Recreation Center (SRC). The SRC is a facility for exercise and leisure activity that promotes lifelong health and wellness.<br/><br/>About The University<br/><br/>One of the largest universities in the country, California State University, Northridge (CSUN) is an urban, comprehensive university that delivers award-winning undergraduate and graduate programs to nearly 40,000 students annually and counts more than 330,000 alumni who elevate Southern California and beyond. Since its founding in 1958, CSUN has made a significant and long-term economic impact on California, generating nearly $1.9 billion in economic impact and more than 11,700 jobs each year. The LAEDC recognized CSUN as its 2015 Eddy Award winner for its positive economic impact. Serving more students on Pell Grants than any other institution in California, CSUN is also a social elevator and one of the most diverse universities in the country. CSUN ranks 13th in awarding bachelor’s degrees to underrepresented minority students and seventh in bachelor’s degrees to Latino students, serves the 13th largest Jewish student population, and enrolls the largest number of students who are Deaf and hard-of-hearing of any U.S. state university. The journal Nature recently named CSUN a Rising Star for scientific research, and the NSF ranks CSUN in the top five nationally among similar institutions for graduates who go on to earn doctorates in the sciences. CSUN is where individuals rise. And through them, so does Greater Los Angeles and beyond.<br/><br/>Position Summary<br/><br/>Under general supervision from the Assistant Director, Programs and Leadership (ADPL), the Administrative Support Coordinator provides (1) administrative support of ranging complexity to the University Student Union Board of Directors (BOD); (2) assists in developing and presenting BOD-related trainings and retreats; and (3) assists in developing, administering and monitoring the BOD’s annual operating budget.<br/><br/>Essential Duties<br/><br/><ul><li>Provide clerical and administrative support to the BOD while handling a wide variety of projects with competing priorities;</li><li>Manage the BOD annual calendar and manage meeting logistics including but not limited to room reservations and technology support, facilitate online scheduling, and serve as note taker at BOD meetings;</li><li>Prepare and distribute items for the BOD and its committees, including but not limited to meeting agendas, minutes and information packets, monthly and annual reports;</li><li>Organize and maintain online and physical files such as legal documents and by-laws including file retention and intranet management;</li><li>Manage scheduling logistics for BOD member recruitment and on-boarding process and</li><li>facilitate BOD onboarding and separation processes including but not limited to key and name badge distribution and collection and email setup;</li><li>Assist with providing administrative oversight to the BOD’s annual operating budget;</li><li>Manage monthly scholarships for BOD and committee members and submit necessary paperwork to Financial Aid to ensure compliance of all BOD and committee members;</li><li>Submit invoice requests, monthly budget statements, and quarterly reports;</li><li>Assist in planning and facilitating various trainings for Board Members, including Orientation, Board Retreats, Committee Chair/Co-Chair/Executive Secretary Training, Committee trainings;</li><li>Assist with the implementation of the BOD Leadership Training program;</li><li>Assist with logistics for annual BOD elections;</li><li>Create and make BOD presentations as requested;</li><li>Participate in USU BOD meetings, trainings and retreats;</li><li>Provide administrative support to the Assistant Director, Programs and Leadership;</li><li>Serve as back-up to the BOD Leadership Supervisor;</li><li>Serve as back-up Executive Secretary for BOD Committees;</li><li>Participate fully in USU meetings, Equity, Programs and Leadership staff meetings, supervisor meetings, one on one meetings with ADPL, Reservation and Event Services meetings, and events and programs as required;</li><li>Perform other related duties as assigned.<br/><br/></li></ul>Qualifications<br/><br/><em>Education:<br/><br/></em>Equivalent to full-time college or university education or vocational school training in a job-related field may be substituted for up to two years of the required experience.<br/><br/>Experience<br/><br/>Equivalent to four (4) years of full-time, general office clerical and administrative support experience that has provided the applicant with the knowledge and abilities necessary to perform the essential duties of the position.<br/><br/>Special Requirements<br/><br/>Not Applicable.<br/><br/>Preferred Qualifications<br/><br/>Six months experience working with college-age students.<br/><br/>Knowledge, Skills And/or Abilities<br/><br/><ul><li>Ability to demonstrate a commitment to valuing diversity and contributing to an inclusive working and learning environment</li><li>Thorough mastery of office methods, process, and practices, and software packages, technology and systems</li><li>Thorough knowledge of correct English grammar, spelling, and punctuation</li><li>Knowledge of report composition</li><li>Ability to prepare letters, memos, and reports</li><li>Ability to take minutes</li><li>Ability to analyze operational and procedural problems and develop, recommend, and evaluate proposed solutions</li><li>Ability to apply judgment, discretion, and initiative in establishing priorities</li><li>Ability to provide follow-up and quality control</li><li>Ability to perform business math and analyze budgetary data</li><li>Ability to plan, organize, and lead or oversee the work of others</li><li>Ability to keep moderately complex records and files</li><li>Ability to communicate effectively both orally and in writing, as well as to speak in public for briefings, short presentations and/or tours</li><li>Ability to establish and maintain cooperative working relationships with a diverse community of students, staff, and administrators<br/><br/></li></ul>Working Conditions<br/><br/>Work is generally performed in a temperature-controlled on-site office environment or at an approved and appropriate workspace in the incumbent’s home. Must be able to work under pressure and adhere to deadlines. Contact with students, faculty, staff, administrators and the general public is required.<br/><br/>Supervision Exercised<br/><br/>Not Applicable.<br/><br/>Pay, Benefits And Work Schedule<br/><br/>This position is employed through University Student Union (USU). The USU offers an excellent benefits package including Medical, Dental &amp; Vision insurance, Life Insurance, Vacation, Sick Leave, 14 paid Holidays, company sponsored retirement program and more.<br/><br/>The anticipated hiring range will be as follows and is dependent on experience and qualifications:<br/><br/>Hourly: $22.30 - $25.00<br/><br/>Bi-Weekly: $1,783.85- $2,000.00<br/><br/>Annually: $46,380.00 - $52,00.00<br/><br/>HOURS: Full-Time 40 hours per week; FLSA Non-exempt; may include early mornings, late evenings and weekends.<br/><br/>APPLICATION PERIOD<br/><br/>Applications received through August 22, 2024 will be considered in the initial review and review of applications will continue until position is filled.<br/><br/>In order to be considered in the initial review, applications must be submitted prior to the date listed above. Application submissions received after the initial review date will be reviewed at the discretion of the USU.<br/><br/>How To Apply<br/><br/>Candidates should apply by completing the on-line application. To submit an application and for more detailed information on the application and hiring process, please visit this link: www.csun.edu/careers<br/><br/>BACKGROUND CHECK<br/><br/>A background check (including a criminal records check) must be completed satisfactorily. Failure to satisfactorily complete the background check may affect the status of candidates who apply for the position.", "responsibilities": "<ul><li>Provide clerical and administrative support to the BOD while handling a wide variety of projects with competing priorities;</li><li>Manage the BOD annual calendar and manage meeting logistics including but not limited to room reservations and technology support, facilitate online scheduling, and serve as note taker at BOD meetings;</li><li>Prepare and distribute items for the BOD and its committees, including but not limited to meeting agendas, minutes and information packets, monthly and annual reports;</li><li>Organize and maintain online and physical files such as legal documents and by-laws including file retention and intranet management;</li><li>Manage scheduling logistics for BOD member recruitment and on-boarding process and</li><li>facilitate BOD onboarding and separation processes including but not limited to key and name badge distribution and collection and email setup;</li><li>Assist with providing administrative oversight to the BOD’s annual operating budget;</li><li>Manage monthly scholarships for BOD and committee members and submit necessary paperwork to Financial Aid to ensure compliance of all BOD and committee members;</li><li>Submit invoice requests, monthly budget statements, and quarterly reports;</li><li>Assist in planning and facilitating various trainings for Board Members, including Orientation, Board Retreats, Committee Chair/Co-Chair/Executive Secretary Training, Committee trainings;</li><li>Assist with the implementation of the BOD Leadership Training program;</li><li>Assist with logistics for annual BOD elections;</li><li>Create and make BOD presentations as requested;</li><li>Participate in USU BOD meetings, trainings and retreats;</li><li>Provide administrative support to the Assistant Director, Programs and Leadership;</li><li>Serve as back-up to the BOD Leadership Supervisor;</li><li>Serve as back-up Executive Secretary for BOD Committees;</li><li>Participate fully in USU meetings, Equity, Programs and Leadership staff meetings, supervisor meetings, one on one meetings with ADPL, Reservation and Event Services meetings, and events and programs as required;</li><li>Perform other related duties as assigned.<br/><br/></li></ul>", "qualifications": {"required": "Equivalent to four (4) years of full-time, general office clerical and administrative support experience that has provided the applicant with the knowledge and abilities necessary to perform the essential duties of the position.", "preferred": "Six months experience working with college-age students."}, "skills": ["English", "Report Composition", "Minutes", "Budgetary Data", "Communication", "Public Speaking"], "postedDate": "1 week ago", "benefits": "The USU offers an excellent benefits package including Medical, Dental &amp; Vision insurance, Life Insurance, Vacation, Sick Leave, 14 paid Holidays, company sponsored retirement program and more.", "salary": {"amount": "46,380.00 - 52,00.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996895160"}