{"jobTitle": "Account Manager - Hybrid/Remote - California", "company": {"name": "SmartFinancial", "location": "Laguna Beach, CA"}, "location": "Laguna Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>Join SmartFinancial: Empowering Insurance Agents with Cutting-Edge Technology<br/><br/></strong>Welcome to SmartFinancial, where our mission is clear: to drive growth and success for insurance agencies through our industry-leading technology! Voted one of the Best Places to Work for four consecutive years, we are one of the fastest-growing tech companies.<br/><br/>We are a leading insurance marketplace, connecting millions of shoppers to our network of insurance partners.<br/><br/><strong>Why This Role Matters<br/><br/></strong>As an Account Manager at SmartFinancial, you'll be at the heart of our commitment to helping insurance agents thrive. Your role is essential in connecting insurers with clients, leveraging our advanced platform to deliver results that matter. This is an opportunity to build a meaningful career within a rapidly growing, results-driven environment where your work directly impacts the success of our insurance agency partners.<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li> Optimize: Build and strengthen relationships with clients, ensuring their needs are met and that they can maximize revenue through our platform</li><li> Customize: Recommend tailored product solutions that align with the specific goals of insurance agents, addressing their needs with precision</li><li> Lead: Conduct Client Account Reviews (CARs) to evaluate performance, manage budgets, and ensure that our insurance partners are fully satisfied with our services</li><li> Achieve: Meet and exceed revenue targets by focusing on client retention, cross-selling, and upselling—always with the success of our agency partners in mind</li><li> Own It: Serve as the primary point of contact for your clients, ensuring they have the support and resources needed to achieve their business goals with SmartFinancial</li><li> Excel: Provide an exceptional experience that helps insurance agents grow their business and achieve their objectives using our platform<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>2+ years of experience in sales or account management, with a focus on building strong relationships with clients</li><li>Proven ability to connect with insurance agents and understand their unique needs and challenges</li><li>Experience with high-volume calling</li><li>Insurance or marketplace experience is highly valued</li><li>Strong communication and negotiation skills, with the ability to clearly articulate the value of our platform to insurance agents</li><li>Impeccable attention to detail and a track record of success in sales</li><li>Adaptability, a quick learning curve, and a commitment to continuous improvement</li><li>Ability to thrive in a fast-paced, results-driven environment<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Why You'll Love It Here<br/><br/></strong><ul><li> Competitive Compensation: $66,560 annual base salary plus uncapped commissions and performance bonuses, designed to reward your success. Our Account Managers start with a competitive first-year OTE of $90k, with top performers earning $100k-$150k by their second year. </li><li> Comprehensive Benefits: 401k with company match, along with company-sponsored health, dental, and life insurance plans</li><li> Growth Opportunities: Accelerate your career with our employee referral bonus, extensive paid product training, and clear advancement prospects</li><li> Flexibility: Top performers enjoy Work From Home opportunities, recognizing your dedication and results</li><li> Unlimited Potential: Earn a competitive base salary, plus uncapped commission based on your performance, additionally opportunity to earn stock options<br/><br/></li></ul>We'd especially like to highlight our <strong>World Class Culture,</strong> which our employees say is the best thing about working at SmartFinancial. We have great SLACK channels for work and play, which keep you connected with your fellow employees throughout the day. Not to mention our top notch company events (like our Summer Beach Party with open bar, chili cook-off, annual holiday yacht party, fun office potlucks and more) that will keep you asking when the next event is.<br/><br/>We also have Penny, our company mascot. Like swag themed after a pink pig wearing glasses? Just. You. Wait.<br/><br/>Join SmartFinancial and become a key player in driving growth for insurance agencies. Apply now, and let's achieve success together!<br/><br/>SmartFinancial is an equal opportunity employer, and we celebrate diversity and are committed to creating an inclusive environment for all employees. To learn more about our results-focused culture and employee-focused perks, read more on our careers page.", "responsibilities": "Optimize: Build and strengthen relationships with clients, ensuring their needs are met and that they can maximize revenue through our platform\nCustomize: Recommend tailored product solutions that align with the specific goals of insurance agents, addressing their needs with precision\nLead: Conduct Client Account Reviews (CARs) to evaluate performance, manage budgets, and ensure that our insurance partners are fully satisfied with our services\nAchieve: Meet and exceed revenue targets by focusing on client retention, cross-selling, and upselling—always with the success of our agency partners in mind\nOwn It: Serve as the primary point of contact for your clients, ensuring they have the support and resources needed to achieve their business goals with SmartFinancial\nExcel: Provide an exceptional experience that helps insurance agents grow their business and achieve their objectives using our platform", "qualifications": {"required": "2+ years of experience in sales or account management, with a focus on building strong relationships with clients\nProven ability to connect with insurance agents and understand their unique needs and challenges\nExperience with high-volume calling\nInsurance or marketplace experience is highly valued\nStrong communication and negotiation skills, with the ability to clearly articulate the value of our platform to insurance agents\nImpeccable attention to detail and a track record of success in sales\nAdaptability, a quick learning curve, and a commitment to continuous improvement\nAbility to thrive in a fast-paced, results-driven environment"}, "skills": ["Sales", "Account Management", "Relationship Building", "Insurance", "Marketplace", "Communication", "Negotiation", "Adaptability", "Continuous Improvement", "Results-Driven"], "postedDate": "1 month ago", "benefits": "Competitive Compensation: $66,560 annual base salary plus uncapped commissions and performance bonuses, designed to reward your success. Our Account Managers start with a competitive first-year OTE of $90k, with top performers earning $100k-$150k by their second year. \nComprehensive Benefits: 401k with company match, along with company-sponsored health, dental, and life insurance plans\nGrowth Opportunities: Accelerate your career with our employee referral bonus, extensive paid product training, and clear advancement prospects\nFlexibility: Top performers enjoy Work From Home opportunities, recognizing your dedication and results\nUnlimited Potential: Earn a competitive base salary, plus uncapped commission based on your performance, additionally opportunity to earn stock options", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3996525420"}