{"jobTitle": "Procurement/Purchasing Manager", "company": {"name": "BBSI", "location": "Lomita, CA"}, "location": "Lomita, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing, Supply Chain, and Management", "industry": "Transportation, Logistics, Supply Chain and Storage and Warehousing and Storage", "description": "<strong>Job Category:</strong> Full Time - DIRECT HIRE EMPLOYMENT, Onsite position <p><strong>Compensation:</strong> $75,000 - $85,000/Year </p><p><br/></p><p>Are you ready to take the reins of a dynamic procurement operation that drives success in a leading company? We are seeking a detail-oriented and strategic Procurement Manager who is passionate about optimizing supply chain processes and building strong supplier relationships. With a focus on marble, stone, and tile products, this role offers the opportunity to make a significant impact while working in a collaborative environment.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Purchase Orders: Manage the entire process, ensuring accuracy and adherence to standards.</li><li>Monitor and ensure timely delivery, addressing any issues swiftly.</li><li>Oversee logistics, coordinate with warehouse teams, and maintain inventory organization.</li><li>Build strong supplier relationships, negotiate pricing, and secure favorable terms.</li><li>Problem Resolution &amp; Reporting: Tackle challenges head-on, maintain detailed records, and report on key procurement metrics.</li></ul><p><br/></p><p><strong>Qualifications/Experience:</strong></p><ul><li>Minimum of 5 years of experience in procurement, purchasing or supply chain management</li><li>Experience in marble, stone, and tile products preferred or carpentry, furniture or light fixture sales </li><li>Bachelor’s degree in business administration, Supply Chain Management, or a related field a plus</li><li>QuickBooks software experience a plus</li><li>Certifications like CPP or CPSM are a plus.</li><li>Skills: Strong negotiation, communication, and organizational skills, with proficiency in procurement software and Microsoft Office.</li></ul><p><br/></p><p><strong><u>Why You Should Apply:</u></strong></p><ul><li>Health Insurance, Vacation, Holiday Pay, Sick Pay</li><li>Flexible Schedule</li><li>Weekly Luncheons </li><li>Generous Bonus Potential: Earn an additional $25,000 annually, plus a monthly percentage of company sales.</li><li>Growth-Oriented Role: Contribute to a high-performing team and align procurement activities with our strategic goals.</li></ul><p></p>", "responsibilities": "Purchase Orders: Manage the entire process, ensuring accuracy and adherence to standards. Monitor and ensure timely delivery, addressing any issues swiftly. Oversee logistics, coordinate with warehouse teams, and maintain inventory organization. Build strong supplier relationships, negotiate pricing, and secure favorable terms. Problem Resolution & Reporting: Tackle challenges head-on, maintain detailed records, and report on key procurement metrics.", "qualifications": {"required": "Minimum of 5 years of experience in procurement, purchasing or supply chain management Experience in marble, stone, and tile products preferred or carpentry, furniture or light fixture sales  Skills: Strong negotiation, communication, and organizational skills, with proficiency in procurement software and Microsoft Office.", "preferred": "Bachelor’s degree in business administration, Supply Chain Management, or a related field a plus QuickBooks software experience a plus Certifications like CPP or CPSM are a plus."}, "skills": ["Procurement", "Purchasing", "Supply Chain Management", "Negotiation", "Communication", "Organizational Skills", "Procurement Software", "Microsoft Office", "QuickBooks"], "postedDate": "1 week ago", "benefits": "Health Insurance, Vacation, Holiday Pay, Sick Pay Flexible Schedule Weekly Luncheons  Generous Bonus Potential: Earn an additional $25,000 annually, plus a monthly percentage of company sales. Growth-Oriented Role: Contribute to a high-performing team and align procurement activities with our strategic goals.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996824799"}