{"jobTitle": "Demand Planning Specialist", "company": {"name": "Gold Star Foods", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>TITLE: </strong>Demand Planning Specialist <strong> DIVISION:</strong> Demand Planning<br/><br/><strong>REPORTS TO: </strong>Director of Demand Planning <strong> FLSA CLASSIFICATION: </strong>Exempt / Salary<br/><br/><strong>Gold Star Foods</strong> is the leading food distributor to K-12 schools in the United States. We are a company devoted to providing our customers with incredible customer service. We know that it is our employees who make the difference! Join our team and find out what it is like to work somewhere where you enjoy getting up for work every day!<br/><br/><strong>Position Overview<br/><br/></strong>The Demand Planning Specialist, under the direction of the Director of Demand Planning, is a key member of the supply chain team who is responsible for analyzing and forecasting customer demand for products or services. They will collaborate with various departments, such as sales, marketing, and operations, to develop accurate demand forecasts that drive efficient production, inventory management, and overall supply chain optimization. The Demand Planning Specialist plays a critical role in ensuring that the company meets customer demands, while minimizing inventory holding costs, and maximizing customer satisfaction.<br/><br/><strong>Principle Responsibilities<br/><br/></strong><ul><li>Utilize historical sales data, market trends, and other relevant factors to develop accurate demand forecasts.</li><li>Collaborate with sales, marketing, and operations teams to gather input and insights for demand planning.</li><li>Monitor and analyze demand patterns, market trends, and customer behavior to identify potential demand fluctuations or changes.</li><li>Continuously improve forecast accuracy through the use of statistical modeling, forecasting software, and other tools. Determine optimal inventory levels based on demand forecasts, lead times, production capacity, and service level targets.</li><li>Collaborate with procurement and production teams to ensure timely availability of materials and finished goods to meet demand requirements.</li><li>Monitor and analyze inventory levels, stock-outs, and excess inventory, taking appropriate actions to optimize inventory performance and minimize costs.</li><li>Foster effective collaboration and communication with sales, marketing, operations, and other stakeholders to ensure alignment on demand planning and forecasting.</li><li>Provide regular updates and reports on demand forecasts, inventory performance, and key supply chain metrics.</li><li>Collaborate with cross-functional teams to resolve any demand-supply imbalances, production constraints, or other supply chain issues.</li><li>Identify opportunities for process improvements and efficiency enhancements in demand planning and inventory management.</li><li>Implement and leverage advanced forecasting techniques, tools, and technologies to enhance demand planning accuracy and efficiency.</li><li>Stay updated on industry trends, best practices, and emerging technologies related to demand planning and supply chain management.</li><li>Other duties assigned as needed<br/><br/></li></ul><strong>Required Skills<br/><br/></strong><ul><li>Strong analytical and quantitative skills, with proficiency in statistical analysis and forecasting techniques.</li><li>Proficiency in demand planning software, ERP systems, and advanced Excel skills.</li><li>Excellent communication and collaboration skills to work effectively with cross-functional teams.</li><li>Detail-oriented mindset with the ability to manage multiple priorities and meet deadlines.</li><li>Knowledge of supply chain principles, inventory management, and logistics.</li><li>Familiarity with industry-specific demand patterns and trends (e.g., seasonal demand, market dynamics).</li><li>Continuous improvement mindset with a focus on driving process optimization and efficiency.<br/><br/></li></ul><strong>Education/Expierence<br/><br/></strong><ul><li>Bachelor's degree in supply chain management, business administration, or a related field; Master's degree is a plus.</li><li>Proven experience (2-5 years) in demand planning, forecasting, or related supply chain roles.<br/><br/></li></ul><strong>Working Conditions And Physical Demands<br/><br/></strong>Professional office environment. Primary office environment is ambient room temperatures, lighting and traditional office equipment as found in a typical office environment. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential duties of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Individuals may need to sit or stand as needed. May require walking primarily on a level surface for periods throughout the day. Reaching above shoulder heights, below the waist, or lifting as required to file documents or store materials throughout the workday. Proper lifting techniques are required. May include lifting up to 25 pounds on occasion.<br/><br/><strong>EOE M/W/Vet/Disabled<br/><br/></strong>The above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. This job description is not to be construed as an exhaustive statement of duties, responsibilities or requirements as the employee may be required to perform any other duties as assigned. In the event of an absence where the Buyer cannot perform these duties, the Manager will determine who shall perform these duties.<br/><br/><strong>Affirmative Action Statement<br/><br/></strong>Applicants must be currently authorized to work in the United States. We are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status, or any other protected factor under federal, state or local law.", "responsibilities": "The Demand Planning Specialist, under the direction of the Director of Demand Planning, is a key member of the supply chain team who is responsible for analyzing and forecasting customer demand for products or services. They will collaborate with various departments, such as sales, marketing, and operations, to develop accurate demand forecasts that drive efficient production, inventory management, and overall supply chain optimization. The Demand Planning Specialist plays a critical role in ensuring that the company meets customer demands, while minimizing inventory holding costs, and maximizing customer satisfaction.", "qualifications": {"required": "Strong analytical and quantitative skills, with proficiency in statistical analysis and forecasting techniques.\nProficiency in demand planning software, ERP systems, and advanced Excel skills.\nExcellent communication and collaboration skills to work effectively with cross-functional teams.\nDetail-oriented mindset with the ability to manage multiple priorities and meet deadlines.\nKnowledge of supply chain principles, inventory management, and logistics.\nFamiliarity with industry-specific demand patterns and trends (e.g., seasonal demand, market dynamics).\nContinuous improvement mindset with a focus on driving process optimization and efficiency.", "preferred": "Bachelor's degree in supply chain management, business administration, or a related field; Master's degree is a plus.\nProven experience (2-5 years) in demand planning, forecasting, or related supply chain roles."}, "skills": ["Demand Planning", "Supply Chain Management", "Forecasting", "Inventory Management", "Statistical Analysis", "ERP Systems", "Excel", "Communication", "Collaboration", "Problem Solving", "Process Improvement"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996816391"}