{"jobTitle": "Assistant Director, Facilities Operations", "company": {"name": "Systems Ltd", "industry": "Renewable Energy Semiconductor Manufacturing", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full Time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$76,517.81 - $90,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Renewable Energy Semiconductor Manufacturing", "description": "USC Recreational Sports is seeking a full-time Assistant Director, Facility Operations to manage the daily operations of Recreational Sports facilities including three fitness centers, outdoor fields, and other recreational facilities. Working under the supervision of the Director of Recreational Sports, the Assistant Director, Facility Operations, provides leadership for administrative and student staffing, facility maintenance, equipment upkeep and purchasing, risk management, strategic planning, scheduling, customer service, policy development, project management, and special event support. The Assistant Director, Facility Operations will serve as a key member of the department’s leadership team and will work closely with other Student Life and university partners in the area of space planning, capital projects, well-being, student success, and event planning.", "responsibilities": "Lead facility planning for Recreational Sports, including short and long-term projects in association with central USC space planning leaders, Facilities Planning and Management, Environmental Health & Safety, Capital Construction Development, and other partners. Coordinates directly with outside vendors and/or contractors for facilities operations and maintenance and construction and renovation projects. Prepares long and short range plans for the use of facilities. Maintains analysis of space and equipment requirements and allocates usage based on departmental priorities. Manage and oversee the day-to-day operation of three recreation centers and related fields and facilities. Specific responsibilities include oversight of weight rooms, informal recreation, special events, professional and student staff, emergency response procedures, equipment, and other pertinent operation support. Responsible for the professional development of both full time and student employees. Oversee a large staff that are responsible for hands-on operations including personnel supervision, guest services, facility and equipment operations and maintenance, sales, delivery of programs and services, safety, and risk management. Develop, implement, and maintain procedures for facility access and general security for all Recreational Sports facilities. Enforce safety and regulatory compliance throughout the spaces. Conduct daily walkthroughs of Lyon Center, USC Village Fitness Center, HSC Fitness Center, and related fields and facilities. Perform routine maintenance inspections of facility and equipment for deficiencies and safety hazards. Review status of regularly provided recreational programs and services and note issues or trends. Investigate incidents or problems through regular client contact and staff meetings. Follow up on shift reports and act to resolve problems or patron requests. Provide direct oversight of fitness and weight training equipment to include inventory, tracking of warranties, purchasing, and ordering parts as necessary. Work collaboratively with campus services departments to develop strategic and preventative maintenance, janitorial, and fire safety plans for assigned facilities. Oversee informal recreation programs and facilities, including facility enhancement and development. Assist with patron communications, including the department website, member alerts, program alerts, facility hours, and important department notifications. Provide support for departmental programs and events, including special events, intramural events, and club events/games. Research and develop new initiatives and technology to improve service, enhance revenue, and realize system wide opportunities. Develop training materials, organize trainings, and provide administrative oversight of staff assessment processes. Serve as a department staff member on duty for operations, which includes but is not limited to, serving as a first responder for emergencies, providing emergency care, handling conflicts, and making decisions/judgments regarding facility access. Perform additional duties as assigned in support of USC Recreational Sports and USC Student Life.", "qualifications": {"required": "Master’s degree, Combined experience/education as substitute for minimum education, 3 or more years of experience in recreational facility management, program supervision, or student personnel administration, Thorough knowledge of critical building/facility systems and experience working with specialist contractors (including electrical, HVAC, plumbing, lighting, flooring, etc.) to assess and address issues and repairs.", "preferred": "Doctorate degree, 5 or more years of management experience in fitness center, facility operations and equipment, Extensive experience with recreation facility maintenance and project management, including working with specialized vendors, equipment manufacturers, and contractors on large-scale space development projects, Knowledge of scheduling and asset management software, Strong oral and written communications skills, Prior supervision of professional and student staff, preferably in a campus recreation environment."}, "skills": ["Facility Management", "Project Management", "Customer Service", "Risk Management", "Strategic Planning", "Policy Development", "Team Leadership"], "postedDate": "08-Aug-24", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996336509"}