{"jobTitle": "Warehouse Supervisor", "company": {"name": "THUNDER INTERNATIONAL GROUP INC", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Company Description</strong><p> </p><p>Founded in City of Industry, California in 2010, THUNDER INTERNATIONAL GROUP INC (TIG) is an international Cross-Border logistics company that provides E-Commerce Fulfillment, International Express Shipping, and Product Refurbishment services. With over 10 years of experience in the U.S. market and 6 fulfillment centers, TIG offers high-quality, high-efficiency, and comprehensive logistics solutions. Learn more at thunderex.com.</p><p> <strong>Role Description</strong></p><p> </p><p>This is a full-time on-site role as a Warehouse Supervisor. The Warehouse Supervisor will be responsible for overseeing day-to-day tasks such as supervising shipping and receiving operations, managing inventory control, ensuring material handling efficiency, and operating forklifts. The role is located in the Los Angeles Metropolitan Area.</p><p> <strong>Qualifications</strong></p><p> </p><ul><li>Supervisory Skills</li><li>Experience in Shipping &amp; Receiving and Inventory Control</li><li>Proficient in Material Handling</li><li>Knowledge and experience in Forklift Operation</li><li>Excellent problem-solving and decision-making abilities</li><li>Strong communication and leadership skills</li><li>Attention to detail and ability to multitask</li><li>Ability to work in a fast-paced environment</li><li>Experience in logistics or warehouse management is a plus</li><li>Bachelor's degree in related field or equivalent experience</li></ul>", "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "responsibilities": "", "qualifications": {"required": "Supervisory Skills, Experience in Shipping & Receiving and Inventory Control, Proficient in Material Handling, Knowledge and experience in Forklift Operation, Excellent problem-solving and decision-making abilities, Strong communication and leadership skills, Attention to detail and ability to multitask, Ability to work in a fast-paced environment, Experience in logistics or warehouse management is a plus, Bachelor's degree in related field or equivalent experience", "preferred": ""}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3996153500"}