{"jobTitle": "Retail Store Teammate", "company": {"name": "LA Clippers", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Spectator Sports", "description": "We are seeking a highly motivated and experienced retail professional to support the new LA Clippers’ Retail Flagship store, in-arena retail locations, and concert/event retail operations. The ideal candidate will have a strong background in retail and a passion for live sports/concerts, as well as a focus on retail technology/innovation and experience growing a new business.<br/><br/>Retail Teammate will support all aspects of our new physical retail locations on-site at Intuit Dome, including fan experiences and concert/event operations. This teammate will be responsible for supporting revenue goals and identifying and acting upon areas of opportunities for in-store experience. The Retail Teammate will demonstrate excellent peer relationship skills and be able to work with many cross-functional partners.<br/><br/>To be considered, you should exhibit a successful experience in a fast-paced, high-volume, innovative retail landscape. You should also be a great teammate who is passionate, obsessed with continually elevating the brand, and most importantly making a lasting impact in sports retail and merchandise.<br/><br/>This is a part-time position based at the Intuit Dome located in Inglewood, CA. Due to the nature of this industry, the candidate must be available to work a flexible schedule including weeknights, weekends, and holidays to cover high profile concerts and NBA games.<br/><br/>What You Will Do<br/><br/><ul><li>Provide best-in-class customer service and experience to our fans.</li><li>Drives sales through the engagement of customers, suggestive selling, and sharing product knowledge.</li><li>Respond to fans' questions in a timely manner.</li><li>Directs fans by escorting them to specific locations throughout the store/arena.</li><li>Create and/or update fan profile records.</li><li>Keeps fans informed by notifying them of preferred customer sales and future merchandise of potential interest.</li><li>Assists with inventory, including receiving and stocking merchandise.</li><li>Support retail operations during all concerts/events.</li><li>Alert management of potential security issues.<br/><br/><br/></li></ul><strong>Your Background, Skills And Experience<br/><br/></strong><ul><li>Previous experience working in a fast-paced, high-volume, innovative retail environment</li><li>Excellent customer service skills</li><li>High School Diploma or equivalent</li><li>Ability to think strategically, problem solve, and multi-task are a must.</li><li>Ability to maintain a positive attitude, demonstrate professionalism and integrity, and excellent interpersonal skills.</li><li>Ability to complete work accurately and on time.</li><li>Ability to work independently &amp; in a group setting and demonstrate good judgment skills.</li><li>Ability to communicate effectively orally and in writing.</li><li>At least 18 years of age.<br/><br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>$20 per hour<br/><br/><br/></li></ul>Physical Requirements<br/><br/><ul><li>Able to lift or move equipment up to 50 pounds</li><li>Able to stand, sit or remain in a stationary position during shift</li><li>Able to bend at the waist, reach over head and horizontal</li><li>Comfortable working at various heights<br/><br/><br/></li></ul>Essential Physical Requirements:<br/><br/><ul><li>Both indoor and outdoor environments; indoor conditions are generally air-conditioned, while outdoor conditions may include inclement weather such as direct sunlight, heat, humidity, rain, sleet, and wind.</li><li>Exposure to high noise levels and high vibrations<br/><br/><br/></li></ul>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time.<br/><br/>The LA Clippers and Intuit Dome are a proud equal opportunity employer. It is our desire and intent that all employees enjoy a professional business working environment that is free from discrimination and harassment. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment.<br/><br/>To view our employment privacy policy, please visit https://www.nba.com/clippers/california-employment-privacy-policy", "responsibilities": "<ul><li>Provide best-in-class customer service and experience to our fans.</li><li>Drives sales through the engagement of customers, suggestive selling, and sharing product knowledge.</li><li>Respond to fans' questions in a timely manner.</li><li>Directs fans by escorting them to specific locations throughout the store/arena.</li><li>Create and/or update fan profile records.</li><li>Keeps fans informed by notifying them of preferred customer sales and future merchandise of potential interest.</li><li>Assists with inventory, including receiving and stocking merchandise.</li><li>Support retail operations during all concerts/events.</li><li>Alert management of potential security issues.<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>Previous experience working in a fast-paced, high-volume, innovative retail environment</li><li>Excellent customer service skills</li><li>High School Diploma or equivalent</li><li>Ability to think strategically, problem solve, and multi-task are a must.</li><li>Ability to maintain a positive attitude, demonstrate professionalism and integrity, and excellent interpersonal skills.</li><li>Ability to complete work accurately and on time.</li><li>Ability to work independently &amp; in a group setting and demonstrate good judgment skills.</li><li>Ability to communicate effectively orally and in writing.</li><li>At least 18 years of age.<br/><br/><br/></li></ul>"}, "skills": [], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996054457"}