{"jobTitle": "Vice President Sales, Supply Chain & Distribution", "company": {"name": "The Everest Search Group", "industry": "Transportation, Logistics, Supply Chain and Storage", "size": "50+ employees", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Supply Chain", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Our client, a 50+ year old privately held 3rd Party Logistics Provider, have established themselves as one of the premier logistics companies in the United States. Their service offerings include warehousing, drayage, brokerage, and other valued added transportation services with a focus on industrial and automotive clients.", "responsibilities": "· Maintain and establish a strong understanding of company's service offerings and capabilities.\n· Create a comprehensive sales strategy and business plan for the department with a heavy focus on providers new and existing clients.\n· Identify specific client accounts and opportunities as targets.\n· Evaluate business plan and implement short- and long-term strategies.\n· Plan, organize and build the sales and support team competencies necessary to sell, develop, and deliver full solution offerings.\n· Responsible for seeking out, targeting and contacting prospective customers within target verticals and industries.\n· Develop and maintain a robust network of contacts.\n· Build influential relationships with multiple contacts with key clients.\n· Build and maintain a strong working relationship with internal Operations, Finance and Supply chain solutions teams.\n· Participate and initiate customer visits, quarterly QBR’s and be a conduit for escalations and issues resolution.\n· Be knowledgeable of competitors and industry trends.\n· Develop goals, policies and procedures for the sales organization.\n· Develop KPI’s for sales targets within the sales organization.\n· Performs other position related duties as specified by management\n· Management of sales organizations CRM and its related inputs and outputs.\n· Ensure CRM health across sales teams.", "qualifications": {"required": "BA, BS, degree preferred and or higher degree of education\n10 + Years experience in the 3PL & Contract Logistic Industry\n15-20 plus years of progressive industry sales experience within transportation, warehouse operations and freight forwarding.\nSolution oriented sales approach\nThe ideal candidate will have an established book of business that align with client's industry vertical focus (Retail E-Commerce, CPG, Home Goods, FMCG, Consumer Electronics, Technology Sector, and Automotive, Industrials, Medical Device)\nInternational sales experience preferred.\n10+ Years’ experience with Sales Force, Dynamics, other technologies\nDeep experience with solutions-based sales, i.e Miller Heiman approach. Passionate about success and owning the customer experience from the beginning through contract execution. No Orbiters Please\n10+ Years of hands-on executive leadership experience", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996469578"}