{"jobTitle": "Buying Assistant", "company": {"name": "REVOLVE", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Retail Apparel and Fashion", "description": "Meet REVOLVE<br/><br/>REVOLVE is the next-generation fashion retailer for Millennial and Generation Z consumers. As a trusted, premium lifestyle brand, and a go-to online source for discovery and inspiration, we deliver an engaging customer experience from a vast yet curated offering totaling over 45,000 apparel, footwear, accessories and beauty styles. Our dynamic platform connects a deeply engaged community of millions of consumers, thousands of global fashion influencers, and more than 500 emerging, established and owned brands. Through 20 years of continued investment in technology, data analytics, and innovative marketing and merchandising strategies, we have built a powerful platform and brand that we believe is connecting with the next generation of consumers and is redefining fashion retail for the 21st century. For more information please visit www.revolve.com.<br/><br/>At REVOLVE the most successful team members have the thirst and creativity to redefine fashion retail for the 21st century, making REVOLVE the leading online retail destination targeted towards Millennial and Generation Z consumers seeking premium fashion. With a team of 1,000 strong, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment.<br/><br/>Some of the sweetest perks we offer aren’t in a typical benefit package like hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.<br/><br/>To take a behind the scenes look at the REVOLVE “corporate” lifestyle check out our Instagram @REVOLVEcareers or <br/><br/>Are you ready to set the standard for Premium apparel?<br/><br/>Main Purpose Of The Buying Assistant Role<br/><br/>This is a full time role for a candidate who assist Buyer in daily tasks.<br/><br/>Major Responsibilities<br/><br/>Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Email management</li><li> Running reports, budget tracking, tech packs, new vendor forms and fur docs</li><li> Attending and participating in buying appointments</li><li> Building strong relationships with buyers, sales analysts and vendors</li><li> Working with shipping approvals and accounts payable<br/><br/></li></ul>Required Competencies<br/><br/>To perform the job successfully, an individual should demonstrate the following competencies:<br/><br/><ul><li> Motivation</li><li> Ability to work well under strict deadlines</li><li> Ability to manage multiple assignments with competing deadlines</li><li> Attention to detail<br/><br/></li></ul>Minimum Qualifications<br/><br/><ul><li> College educated</li><li> Proficient in Gmail, excel, word and online navigation</li><li> Understanding of garment bodies and fashion trends</li><li> Basic understanding of retail metrics and terms<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li> Showroom experience</li><li> Office administrative, data entry, and assistant experience preferred</li><li> Quick and accurate typing skills</li><li> Showroom and/pr fashion retail experience preferred<br/><br/></li></ul>A successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch-in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day.<br/><br/>For individuals assigned and/or hired to work in California, Revolve includes a reasonable estimate of the salary or hourly rate range for this role. This takes into account the wide range of factors that are considered in making compensation decisions; including but not limited to business or organizational needs, skill sets, experience and training, licensure, and certifications.<br/><br/>A reasonable estimate of the current base hourly/salary range is $23.00 - $23.00/hr.<br/><br/>Attention<br/><br/>After submitting your application, please check your spam folder for emails on your application status. Emails are sent from an ADP email address.", "responsibilities": "Essential Duties and Responsibilities include the following. Other duties may be assigned.<br/><br/><ul><li> Email management</li><li> Running reports, budget tracking, tech packs, new vendor forms and fur docs</li><li> Attending and participating in buying appointments</li><li> Building strong relationships with buyers, sales analysts and vendors</li><li> Working with shipping approvals and accounts payable<br/><br/></li></ul>", "qualifications": {"required": "College educated, Proficient in Gmail, excel, word and online navigation, Understanding of garment bodies and fashion trends, Basic understanding of retail metrics and terms", "preferred": "Showroom experience, Office administrative, data entry, and assistant experience preferred, Quick and accurate typing skills, Showroom and/pr fashion retail experience preferred"}, "skills": ["Gmail", "Excel", "Word", "Online Navigation", "Retail Metrics"], "postedDate": "1 month ago", "benefits": "hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.", "url": "https://www.linkedin.com/jobs/view/3996583326"}