{"jobTitle": "Web Content Manager (Onsite/Hybrid/Remote)", "company": {"name": "University of Redlands", "industry": "Higher Education", "size": "Not specified", "location": "Redlands, CA"}, "location": "Redlands, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$66,560 - $75,000 Annually, Pro-rated", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Higher Education", "description": "The Web Content Manager is responsible for developing and maintaining the voice for the university's online web presence, ensuring a consistent, seamless, accessible, and unified user experience across all web properties managed by the Office of Strategic Marketing and Communications. This role involves maintaining the integrity of the site, writing, editing, and proofreading site content, conducting user research, and creating solutions based on user feedback and analytics. Reporting to the Director, Web Strategy, this position will uphold website governance and ensure the site does not get diluted by multiple voices. Additionally, the Web Content Manager collaborates with cross-functional teams and reports directly to the Director of Web Strategy. This position may require the flexibility to work evening and weekend hours as well as the ability to travel, as required.", "responsibilities": "Copies, edits, and proofreads all web content, ensuring updates align with site architecture and the university's voice. Crafts language for site campaigns, personalize website channels, and create content for all primary and secondary tier pages. Ensures compliance with content governance guidelines for the tone, style, and voice of all web content. Writes and revises content for web pages, including calls to action, meta titles, descriptions, image alt text, and user interface text. Conducts user research and usability testing and use feedback to inform content strategy and improve the user experience. Builds and presents analytics reports to inform strategic decision-making and optimize content to meet target KPIs. Manages SEO elements, such as metadata and image alt text, and update content to support marketing campaigns. Participates in the content quality assurance processes and workflows, collaborating with campus partners in content development reviews and meetings. Collaborates with creative and content teams to implement content strategy and maintain content governance guidelines. Ensures compliance with relevant policies, regulations, and legal requirements related to web content and accessibility. Stays abreast of SEO research, industry trends, emerging technologies, and advancements in web content development. Performs other related duties and special projects as assigned.", "qualifications": {"required": "Bachelor’s degree in English, creative writing, communications, or a related field from an accredited university or relevant work experience. Three (3) years of experience in UX writing, content editing, or a similar role within a higher education setting. Proven experience conducting user research and using analytics tools. Experience working with a content management system (CMS). A valid California Class C CA drivers’ license with a good driving record is required.", "preferred": "Master’s degree in English, creative writing, marketing, communications, or related fields. Certification in UX/UI writing. Proficiency in SEO, content management systems, and web accessibility. Experience with content testing, personalization, and experimentation processes. Experience working with SEM Rush, Site Improve, or other SEO tools. Familiarity with higher education environments and admissions recruiting."}, "skills": ["Strong writing capabilities, including experience with UX writing for websites and digital properties.", "Strong understanding of branding and web design principles.", "Knowledge of project management platforms like Asana.", "Excellent communication and interpersonal skills.", "Ability to collaborate effectively with diverse teams.", "Ability to work in a fast-paced environment, multitask, and adhere to deadlines.", "Strong organizational skills and attention to detail in managing projects and content.", "Proficiency in writing clear, concise, and engaging content tailored to various university audiences.", "Analytical skills to interpret data and inform content decisions.", "Strong understanding of user experience principles and content strategy.", "Ability to build and maintain relationships with key stakeholders across campus.", "Must be able to competently interact with a culturally and ethnically diverse population of students, faculty, and staff."], "postedDate": "August 6, 2024", "applicationDeadline": "Open Until Filled, Apply Immediately.", "benefits": "Not specified", "remoteWork": "100% remote work, hybrid, or onsite option.", "url": "https://www.linkedin.com/jobs/view/3996085086"}