{"jobTitle": "Customer Service Coordinator", "company": {"name": "Plastpro,Inc", "location": "Los Angeles, CA", "industry": "Wholesale Building Materials"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "<strong>Job Description<br/><br/></strong>We are looking for a Customer Service Coordinator to join Plastpro's HQ office.<br/><br/>Responsbilities<br/><br/><ul><li>Process orders in a timely fashion and communicate effectively with customers. Follow up with plant, vendors, and outside sales representatives. </li><li>Issue quotation to customers, and obtain proper pricing approval as needed. </li><li>Follow up on all quotations to secure the order with Outside Sales Representative. </li><li>Monitor and review all requests for price deviations to meet competitive bids whereas they comply with all legal regulations and company policies. </li><li>Responsible for sending samples, literatures, testing data, and necessary documentations to the customers and outside sales representatives. </li><li>Initiate and follow through the resolution of any dispute that involves an order. </li><li>Administer special projects and assignments as given by the Customer Service Supervisor. </li><li>Maintaining distributor files and update with each quotation issued or order processed stating all relevant information relating to the quotation or order. </li><li>Develop and maintain knowledge of all Plastpro products by attending regular sales training seminars and self-study. </li><li>Devote the entire productive time, ability and attention to the business of the Company, and shall perform all duties in a professional, ethical and businesslike manner. </li><li>The Inside Sales Coordinator shall not disclose to anyone – inside or outside of the Company – any Confidential Information. “Confidential Information” shall include any of the Company’s proprietary or trade secret information that is disclosed to the Sales Coordinator, or that the Sales Coordinator otherwise learns of in the course of employment, such as, but not limited to, business plans, customer lists, customer information, internal pricing information, financial statements, software diagrams or documentation, flow charts or other product plans. <br/><br/></li></ul><strong>Requirements<br/><br/></strong>College degree or equivalent experience in sales, telemarketing or customer service is required. Excellent communication skills, both verbal and written, must have the initiative and ability to work with minimum supervision.<br/><br/><strong>Company Description<br/><br/></strong>We choose a door for its aesthetic qualities, but doors offer so much more than aesthetics. Your front door is a warm familiar place where new guest arrive and a cheerful announcement when friends come. We live our lives through them. Our front door sees us when we start our day and are ready to take on new opportunities. It’s also a gentle embrace at the end of the day, welcoming us to our home and family. Doors aren’t just doors; they’re a reflection of us and our home. They help us and our families feel safe and protected. We know how important it is to choose a door that best represents you, makes you feel secure, and fits your needs.<br/><br/>Since 1994, Plastpro has always believed in providing a superior product with the best value, technology, and commitment to our customers. Our fiberglass doors offer the beauty and versatility of wood doors, but are strong like steel doors. Wood and steel doors have been preferred in the industry, but both come with problems such as: rotting, rusting, and weather damage. Our fiberglass doors are the best solution and are not susceptible to weather damage, require less maintenance, and offer higher performance ratings. We’ve introduced the first door with composite stiles and rails, HydroShield Technology, and composite Polyfiber (PF) Frames to the industry. Our doors feature a full length LVL block that provides stronger rigidity and a range of door locks and hardware to be installed for increased security. We carry a wide variety of designs, sizes, and styles that are bound to complement everyone’s home.<br/><br/>Since the beginning, we’ve not only been committed to providing superior products, but also in creating opportunities. Our goal is to create positive changes for not only our employees and customers, but also for our community. We believe in doing good for the world and making a difference. For us, success is only as good as the good it creates. We’ve continuously partnered with Habitat for Humanity in order to create affordable, green houses for low-income families across the nation. We’ve donated more than 500 doors to various chapters of Habitat for Humanity and other non-profit organizations. By having a Plastpro door, you not only acquire a beautiful door with the best quality, you become part of Plastpro and join us in giving back to others.<br/><br/>We choose a door for its aesthetic qualities, but doors offer so much more than aesthetics. Your front door is a warm familiar place where new guest arrive and a cheerful announcement when friends come. We live our lives through them. Our front door sees us when we start our day and are ready to take on new opportunities. It’s also a gentle embrace at the end of the day, welcoming us to our home and family. Doors aren’t just doors; they’re a reflection of us and our home. They help us and our families feel safe and protected. We know how important it is to choose a door that best represents you, makes you feel secure, and fits your needs. Since 1994, Plastpro has always believed in providing a superior product with the best value, technology, and commitment to our customers. Our fiberglass doors offer the beauty and versatility of wood doors, but are strong like steel doors. Wood and steel doors have been preferred in the industry, but both come with problems such as: rotting, rusting, and weather damage. Our fiberglass doors are the best solution and are not susceptible to weather damage, require less maintenance, and offer higher performance ratings. We’ve introduced the first door with composite stiles and rails, HydroShield Technology, and composite Polyfiber (PF) Frames to the industry. Our doors feature a full length LVL block that provides stronger rigidity and a range of door locks and hardware to be installed for increased security. We carry a wide variety of designs, sizes, and styles that are bound to complement everyone’s home. Since the beginning, we’ve not only been committed to providing superior products, but also in creating opportunities. Our goal is to create positive changes for not only our employees and customers, but also for our community. We believe in doing good for the world and making a difference. For us, success is only as good as the good it creates. We’ve continuously partnered with Habitat for Humanity in order to create affordable, green houses for low-income families across the nation. We’ve donated more than 500 doors to various chapters of Habitat for Humanity and other non-profit organizations. By having a Plastpro door, you not only acquire a beautiful door with the best quality, you become part of Plastpro and join us in giving back to others.", "jobFunction": "Other", "industry": "Wholesale Building Materials", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996898650"}