{"jobTitle": "Data Systems Analyst", "company": {"name": "SuperCare Health (USA)", "industry": "Hospitals and Health Care", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "“Improving the lives of those with chronic care diseases while providing solutions to our customers.\n<br/><br/>\nLooking for a new opportunity? At SuperCare Health you have the chance to reach your dreams by helping us in serving the healthcare needs of our ever-growing patient population. Matching passion with careers, here hard work has never been so satisfying.\n<br/><br/>\nEssential Duties\n<br/><br/>\nAs a Data Systems Analyst, you will play a pivotal role in designing, implementing, and maintaining data systems that support our organization’s data processing, storage, and analysis needs. You will work closely with data architects, software engineers, and business analysts to ensure that our data infrastructure is robust, scalable, and efficient. Your expertise will help optimize data flows, ensure data integrity, perform data ETLs (Extract Transform, Load) and enable data-driven decision-making across the organization.\n<br/><br/>\nThe Position Is Typically Expected To Consist Of\n<br/><br/>\n<ul><li>30% project data transfer, storage or integration,</li><li>30% proprietary RPA (remote process automation) related to input, and</li><li>20% scripting/ETL development,</li><li>20 % support functions,</li><li>10 % database administration,\n<br/><br/></li></ul>Although these allocations will frequently vary.\n<br/><br/>\nKey/Essential Functions:  Gather requirements, design, develop, maintain and support software related to data; create documentation necessary to support further development and use of the applications. Implement new software or upgrade existing software applications which store, migrate, and transform data. Create and maintain Remote Process Automation scripts. Perform routine data maintenance. Understand and adheres to all of SuperCare Health company policies.\n<br/><br/>\nOther General Responsibilities: General IT support is expected of all team members in IT when needed.\n<br/><br/>\nKnowledge / Skills / Abilities\n<br/><br/>\n<ul><li>Moderate command of elementary scripting languages such as javascript or python;</li><li>Solid diagramming skills using Visio, Pencil, Google Drawings, etc.;</li><li>Solid command of Microsoft SQL Server’s Transact SQL or comparative language;</li><li>Familiarity with database maintenance;</li><li>Preferably the ideal candidate will have some experience with AWS.\n<br/><br/></li></ul>Search Criteria / Keywords\n<br/><br/>\n<ul><li>SQL, RPA, ETL, Database Management, Scripting, AWS\n<br/><br/></li></ul>Minimum Qualifications\n<br/><br/>\n<ul><li>Education: Bachelor’s Degree</li><li>Experience: Preferred Minimum of 1 year in some technical role, either in IT or Accounting/Finance.</li><li>Training/License/Certification: Preferred: courses in SQL, Python</li><li>Location of Position: within 100 miles of Downey or Industry office locations</li><li>Must be able to communicate effectively\n<br/><br/></li></ul><em>Any employment proposal is contingent upon satisfactory completion of: Background Check, Reference Check(s), Driving Record (if applicable), Pre-employment Drug and TB Tests\n<br/><br/></em>\nWhat SuperCare Health Is About\n<br/><br/>\n<em>“SuperCare Health is a comprehensive, post- acute care, respiratory services company, focused on managing high-risk respiratory patients in their homes.\n<br/><br/>\nToday, SuperCare health manages millions of lives annually, with a growing team of more than 400 members, and has one of the highest-rated satisfaction scores from both our customers and patients.\n<br/><br/>\nOur goal is to be the most trusted and preferred resource to manage high-risk, post-acute respiratory patients through our high-touch clinical team and high-tech, innovative solutions. Our end-to- end care solutions, from the hospital to the home, close gaps in care, reduce costs of care and improve outcomes. Our in-home services include ventilation, oxygen, CPAP/BiPAP, enteral nutrition, pharmacy services, and an expanding population health program.\n<br/><br/>\nWe are uniquely structured to be a responsive and agile community provider, yet we also possess the stability and effectiveness of a large enterprise. As a thriving business, our chief focus is on what really matters: reducing hospital re-admissions, optimizing outcomes and improving the lives of patients with chronic care diseases, every day.”\n<br/><br/></em>\nConnect With Us!\n<br/><br/>\nCompany Website https://supercarehealth.com/\n<br/><br/>\nCompany Business Hours - 8:30 AM – 5:30 PM PST\n<br/><br/>\nLinkedIn https://www.linkedin.com/company/273667/admin/\n<br/><br/>\nTwitter https://twitter.com/SuperCareHealth\n<br/><br/>\nFacebook https://www.facebook.com/SuperCareHealth/\n<br/><br/>\nInstagram https://www.instagram.com/supercarehealth/\n<br/><br/>\nAraceli Richardson - Jr. Recruiter LinkedIn", "responsibilities": "As a Data Systems Analyst, you will play a pivotal role in designing, implementing, and maintaining data systems that support our organization’s data processing, storage, and analysis needs. You will work closely with data architects, software engineers, and business analysts to ensure that our data infrastructure is robust, scalable, and efficient. Your expertise will help optimize data flows, ensure data integrity, perform data ETLs (Extract Transform, Load) and enable data-driven decision-making across the organization.", "qualifications": {"required": "Education: Bachelor’s Degree\nExperience: Preferred Minimum of 1 year in some technical role, either in IT or Accounting/Finance.\nTraining/License/Certification: Preferred: courses in SQL, Python\nLocation of Position: within 100 miles of Downey or Industry office locations\nMust be able to communicate effectively", "preferred": "courses in SQL, Python"}, "skills": ["SQL", "RPA", "ETL", "Database Management", "Scripting", "AWS"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996962686"}