{"jobTitle": "International Operations Coordinator", "company": {"name": "Alchemy Global Talent Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$55,000.00/yr - $63,000.00/yr", "currency": "USD"}, "jobFunction": "Consulting, Distribution, and Customer Service", "industry": "Transportation, Logistics, Supply Chain and Storage and Freight and Package Transportation", "description": "Alchemy Global Talent Solutions is representing a well-respected international moving company in finding a skilled International Operations Coordinator to join their team in Los Angeles, CA.\n\nThis office-based role involves coordinating ocean and air freight bookings, ensuring timely processing, and providing exceptional customer support.\n\nRole and Responsibilities:\n\n* Coordinate and open new bookings with ocean and air carriers, entering information into software.\n* Coordinate drayage with local line haul companies.\n* Receive freight load plans from the warehouse manager, ensuring all data is correctly entered into software.\n* Review load plan discrepancy reports for actual load confirmations.\n* Process ACE for all export shipments via company software.\n* Produce and create Master and House Bills of Lading from software.\n* Generate Marine Insurance Policies if needed with correct information.\n* Inform sales personnel of delays, issues, or problems.\n* Send export documentation to consignees via email or courier as needed.\n* Send export documentation to destination agents via email or courier as needed.\n* Close and archive files.\n\nRequirements for the Position:\n\n* Previous experience in logistics or dispatch within the moving sector.\n* Basic school education with moderate to high results.\n* Good computer skills with experience in industry-specific software programs.\n* Ability to work effectively within a team environment.\n* Comprehensive understanding of how export files are handled, maintained, and updated.\n* Ability to manage client interactions calmly and professionally.\n* Clear and detailed communication skills for discussing file procedures and issues with colleagues and department managers.\n\nAlchemy Global Talent Solutions is committed to finding the right candidate who can excel in this role and contribute to the success of our client's operations.", "postedDate": "2 weeks ago", "skills": ["Logistics", "Dispatch", "Ocean Freight", "Air Freight", "Software", "Teamwork", "Client Management", "Communication"], "url": "https://www.linkedin.com/jobs/view/3996222951"}