{"jobTitle": "Retail General Manager", "company": {"name": "Pressed Juicery", "industry": "Retail, Food and Beverage Retail, and Restaurants", "size": "100+ employees", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$33.00/hr - $36.00/hr", "currency": "USD"}, "jobFunction": "Management", "industry": "Retail, Food and Beverage Retail, and Restaurants", "description": "Pressed Juicery is growing and expanding our teams in Orange County! We are hiring a Retail General Manager for our location in Los Cerritos. About Pressed Juicery Pressed Juicery is at the forefront of the wellness movement and is dedicated to making healthy living as convenient and delicious as possible. Pressed operates over 100 retail stores, is available in nearly 3,000 supermarkets, and can be delivered to any US location through the Pressed Juicery website or app. Our Mission Pressed Juicery’s mission is to empower your wellness journey. Our Workplace Culture We embrace diversity, equity, inclusion, and belongingness! We speak up with radically candid communication. We wholeheartedly support personal and professional growth. We believe mistakes can be valuable and lead to continuous improvement. Lastly, we value excellence and strive to achieve greatness in all we do! Our Values Community - as leaders, we celebrate differences, champion strengths, and compassionately aspire to be our most vibrant selves. Passion - curious and humble, we inspire people to make healthy choices. Growth - pursuing wellness with intention, we create and embrace good energy. Our Benefits 401k match, 10 paid holidays, Medical, dental, and vision insurance, Vacation time, Flexible Spending Account, Paid parental leave, Employee Referral Program.", "responsibilities": "The General Manager oversees the sales performance, guest experience, operations, hiring, and talent development of their stores. The General Manager will provide leadership and strategic direction to create an environment that exceeds guests’ in-store and digital expectations, with maximum productivity, profitability, and sales results. The General Manager will clearly understand company deliverables and processes and must demonstrate the ability to execute those duties. Key Areas of Responsibility include, but are not limited to: Exceeding the same stores' sales and plans. Focus on company sales growth and profitability through selling, teamwork, superior product knowledge, and impeccable guest experience. Implement active & engaged product selling and sampling in-store and at the sample carts throughout the day. When no guests are in the store, team members must be outside actively sampling at the cart. Foster a guest-obsessed culture that prioritizes the guest experience and delivers on sales goals. Oversee the mystery shop and NPS programs to deliver a memorable guest experience in each location. Manage teams of hourly team members, interviewing, developing, coaching, evaluating, and retaining talent. Conduct business reporting and guest insights to understand, troubleshoot, and follow -up on opportunity areas. Manage the store’s P&L, KPIs and inventory management. Manage and track labor costs (e.g., scheduling hours, overtime, etc.) for their store. Utilize financial tools & resources to identify and proactively address opportunities in in-store performance. Oversee the store's cleanliness, operational excellence, food safety and handling. Maintain a schedule that aligns with guest and business needs and maintains a presence in all dayparts. (This includes weekends, early mornings, and evenings) Ensure store adheres to federal and local safety standards, including, but not limited to, food safety, OSHA, CDC, ADA, wage, and hours laws.", "qualifications": {"required": "5+ years of progressive leadership experience in retail or restaurant, managing a team of at least 15 team members. Knowledge, and interest in health, fitness, and/or wellness. Ability to build guest relationships and deliver exceptional service. Adapt and embrace new procedures, processes, and shifts to priorities. Utilize sound judgment when making decisions, adapt to and champion change, and mediate conflict. Excellent verbal & written communication skills with proficiency in English. Proficiency in sales principles, KPI deliverables, and guest service practices. California Food Handler Card or applicable state-specific requirement at the time of hire is preferred. Success managing a profit and loss statement or comparable financial reporting. Basic knowledge of MS Office: Word, PowerPoint, and Excel.", "preferred": ""}, "skills": ["Leadership", "Sales Management", "Customer Service", "Team Development", "Financial Management", "Retail Operations"], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "401k match, 10 paid holidays, Medical, dental, and vision insurance, Vacation time, Flexible Spending Account, Paid parental leave, Employee Referral Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996470488"}