{"jobTitle": "Madrid Lifestyle Coordinator for English Teaching Academy", "company": {"name": "Canterbury English", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Higher Education", "description": "**Exciting Opportunities with Canterbury English Teaching Academy in Spain**<br/><br/><ul><li>Are You Ready for a New Adventure in Spain?**<br/><br/></li></ul>Are you a recent college graduate seeking a break before further studies or entering the corporate world? Perhaps you're tired of your current job and looking to embark on a new career path as an English teacher. Whether you already possess a TEFL or CELTA certificate or dream of starting your first job as an ESL teacher at 18, Canterbury English welcomes individuals from all backgrounds, including retirees and those economically independent seeking a new challenge in Spain.<br/><br/><ul><li>Why Choose Madrid for Your Experience?**<br/><br/></li></ul>Discover the vibrant capital of Spain with Canterbury English's Madrid Lifestyle &amp; TEFL Programs. Enjoy a low cost of living, state-of-the-art transportation system, diverse culture, and renowned nightlife. As one of the safest capitals in the world, Madrid boasts rich history, architectural beauty, and a warm Mediterranean climate, providing an ideal setting to live and work.<br/><br/>**Your Journey with Canterbury English**<br/><br/>Since 1991, Canterbury English has supported over 7,500 English speakers in teaching while experiencing life in a foreign country. We are committed to empowering individuals to create a fulfilling life through our programs, offering the security of a one-year student visa allowing you to work in Spain.<br/><br/>**Unlock Unbeatable Benefits**<br/><br/><ul><li> Access to a 120-hour TEFL course</li><li> Job placement with Canterbury English and partner schools</li><li> Student visa for legal residence and work authorization</li><li> 20-hour weekly Spanish program</li><li> Social, cultural, and excursion activities</li><li> Affordable tuition with future years being tuition-free<br/><br/></li></ul>**Set Yourself Up for Success in Spain**<br/><br/>Upon completion of the TEFL program or Madrid Lifestyle Work Orientation, you will begin teaching English classes with Canterbury English. We provide opportunities for additional income through private classes, online teaching, and assistant roles in schools. Enjoy financial security for the entire year while having the flexibility to explore and travel in Spain.<br/><br/>**Program Details and Pricing**<br/><br/><ul><li> One Year Study Abroad Program with TEFL &amp; Spanish: 2.780€</li><li> Madrid Lifestyle Program (for TEFL holders) with Spanish: 1.970€<br/><br/></li></ul>**Join our Expat Community in Spain**<br/><br/>Embark on a journey with Canterbury English Teaching Academy and embrace the opportunity to live and work in one of the most incredible countries in the world. Become part of our expat family and experience the thriving cities of Spain. Viva España!<br/><br/>Employment Type: Full-Time", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996663642"}