{"jobTitle": "Controller", "company": {"name": "Robert Half", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "La Mirada, CA"}, "location": "La Mirada, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$160,000.00 - $210,000.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Staffing and Recruiting", "description": "We are seeking a Controller to join our team in La Mirada, California, in the manufacturing industry. The Controller will be tasked with a broad range of financial responsibilities including the management of forecasting, budgeting, and cash flow. The role also includes overseeing month-end close processes, ensuring accurate and timely financial reporting, and leading a small accounting team.", "responsibilities": "Oversee month-end close processes, including General Ledger, Accounts Receivable, and Accounts Payable. Manage forecasting, budgeting, and cash flow to ensure financial stability and growth. Perform bank reconciliations, journal entries, and chargebacks to maintain accurate financial records. Handle light Human Resources and payroll duties as needed. Lead and develop a small accounting team, fostering a collaborative and efficient work environment. Ensure accurate and timely financial reporting, providing key data for business decision making. Collaborate with the General Manager and CFO to support financial decision-making. Manage occasional collection calls, maintaining professionalism and respect.", "qualifications": {"required": "Must possess a minimum of 5 years of experience in a Controller role or similar capacity. Proficient in Accounts Payable (AP) and Accounts Receivable (AR) management. Demonstrated experience with budget processes is essential. Proficiency in Microsoft Excel is required. Experience with QuickBooks is highly desirable. Bachelor's degree in Accounting, Finance or related field is preferred. Strong analytical, strategic planning and execution skills to drive organizational change. Excellent communication and leadership abilities. Knowledge of federal and state financial regulations. Certified Public Accountant (CPA) or Certified Management Accountant (CMA) certification is a plus.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3996659833"}