{"jobTitle": "Director of Beverage and Food", "company": {"name": "AC Hotel by Marriott Pasadena", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$95,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "<strong>About the job</strong><span> </span>\n<p><span> </span></p>\n<p><strong>The Brand-New Lifestyle AC Hotel by Marriott Pasadena is looking for a Director of Beverage and Food to open and operate this hotel! </strong><span>The Director of Beverage and Food will hire, lead, direct and guide the organization to an award-winning status from its inception. The AC Hotel Pasadena is </span><strong>scheduled to open in December 2024</strong><span> with 194 rooms complete with roof top bar and spectacular views. The Director of Beverage and Food’s key area of focus will be to hire and train cast members who will bring positive energy, high morale and be highly engaged in embracing Marriott’s vision of the brand to inspire guests to have fun. The Director of Beverage and Food will be required to replicate the culture where AC Hotel’s service is all about creating experiences that are fun, harmonious, discerning, and modern for guests looking for an oasis from the mundane. The Director of Beverage and Food is responsible for selecting talent for the AC Hotel Pasadena who are a cultural fit in delivering on this unique brand experience. The Director of Beverage and Food will leverage all team members to effectively promote and sell this one of a kind and first of its kind lifestyle brand hotel in the market to achieve number one ranking in the market in Trip Advisor, Rev Par index in Smith Travel and top 5% ranking of all AC Hotels within Marriott. If you are up for the challenge, then read on. </span></p>\n<p><span> </span></p>\n<p><span>Director of Beverage and Food functions as the strategic business leader of the property’s food and beverage/culinary operation, including Restaurants/Bars, and Banquets/Catering. Position oversees the development and implementation of departmental strategies and ensures implementation of the brand service strategy and brand initiatives. The position ensures the food and beverage/culinary operation meets the brand’s target customer needs, ensures employee satisfaction, and focuses on growing revenues and maximizing the financial performance of the department. Develops and implements property-wide strategies that deliver products and services to meet or exceed the needs and expectations of the brand’s target customer and property employees and provides a return on investment. </span></p>\n<p><span> </span></p>\n<p><span>The Director of Beverage and Food is responsible for producing the 30-60-90 day forecast for all outlets to ensure our profit goals are met. The Director of Beverage and Food will implement and enforce a weekly schedule program which will ensure payroll, (the number one controllable) is always within budget. </span></p>\n<p><span> </span></p>\n<p><span>AC Hotels are known for their B&amp;F, their beverage and food concept which offers a dynamic atmosphere, selective mix of beverages, and delectable small plates. The Director of Beverage and Food will direct our AC Lounge and roof top bar to become the perfect place for Breakfast, lunch and dinner, before the long commute or after an event. The AC Hotel Pasadena, residing within minutes of corporate neighbors like KP, AT&amp;T, Morgan Stanley and more, will be a prime area for the Director of Beverage and Food to make the B&amp;F concept thrive. This half leisure community, half corporate market provides a labor pool that is robust and generally very conscientious, concerned and genuinely engaged. </span></p>\n<p><span> </span></p>\n<p><span>The Director of B&amp;F will be working alongside a 3rd Party Concept Developer to execute the developers Rooftop Concept.  </span></p>\n<p><span> </span></p>\n<p><br/></p>\n<p><strong> CORE WORK ACTIVITIES</strong><span> </span></p>\n<p><strong> Developing and Maintaining Food and Beverage/Culinary Goals</strong><span> </span></p>\n<p><span>• </span><span>Sets</span><span> </span><span>expectations and holds food and beverage team accountable for demonstrating desired service behaviors. </span></p>\n<p><span>• Reviews financial reports and statements to determine how Food and Beverage is performing against budget. </span></p>\n<p><span>• Makes recommendations for CAPEX funding of food and beverage equipment and renovations in accordance with brand business strategy. </span></p>\n<p><span>• Works with food and beverage team to determine areas of concern and develops strategies to improve the department’s financial performance. </span></p>\n<p><span>• Establishes challenging, realistic and obtainable goals to guide operation and performance. </span></p>\n<p><span>• Strives to improve service performance. </span></p>\n<br/>\n<p><span> </span><strong>Developing and Maintaining Budgets</strong><span> </span></p>\n<p><span>• </span><span>Develops and manages Food and Beverage budget. </span></p>\n<p><span>• Monitors the department’s actual and projected sales to ensure revenue goals are met or exceeded and opportunities are identified and addressed. </span></p>\n<p><span>• Ensures cash control and liquor control policies are in place in food &amp; beverage areas and followed by all related employees. </span></p>\n<p><span>• Focuses on maintaining profit margins without compromising guest or employee satisfaction. </span></p>\n<p><span>• Develops and manages all financial, employee engagement and guest satisfaction plans and actions for Food and Beverage departments. </span></p>\n<span> </span>\n<p><strong>Leading Food and Beverage/Culinary Team</strong><span> </span></p>\n<p><span>• </span><span>Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example. </span></p>\n<p><span>• Encourages and builds mutual trust, respect, and cooperation among team members. </span></p>\n<p><span>• Achieves and exceeds goals including performance goals, budget goals, team goals, etc. </span></p>\n<p><span>• Serves as a role model to demonstrate appropriate behaviors. </span></p>\n<p><span>• Develops means to improve profit, including estimating cost and benefit, exploring new business opportunities, etc. </span></p>\n<p><span>• Identifies opportunities to increase profits and create value by challenging existing processes, encouraging innovation and driving necessary change. </span></p>\n<p><span>• Ensures that regular, on-going communication occurs in all areas of food and beverage (e.g., pre-meal briefings, staff meetings, culinary team). </span></p>\n<p><span>• Establishes and maintains open, collaborative relationships with direct reports and entire food &amp; beverage team. Ensures direct reports do the same for their team. </span></p>\n<p><span>• Develops a food and beverage operating strategy that is aligned with the brand’s business strategy and leads its execution. </span></p>\n<p><span>• Identifies the developmental needs of others and coaches, mentors, or otherwise helps others to improve their knowledge or skills. </span></p>\n<p><span>• Stays aware of market trends and introduces new food and beverage products to meet or exceed customer expectations, generate increased revenue and ensure a competitive position in the market. </span></p>\n<p><span>• Manages all day-to-day operations. Understands employee positions well enough to perform duties in employees' absence. </span></p>\n<p><span>• Order and purchase equipment and supplies. </span></p>\n<span>  </span>\n<p><strong>Ensuring Exceptional Customer Service</strong><span> </span></p>\n<p><span>• </span><span>Provides services that are above and beyond for customer satisfaction and retention. </span></p>\n<p><span>• Improves service by communicating and assisting individuals to understand guest needs, providing guidance, feedback, and individual coaching when needed. </span></p>\n<p><span>• Reviews findings from comment cards and guest satisfaction results with F&amp; B team and ensures appropriate corrective action is taken. </span></p>\n<p><span>• Reviews comment cards, guest satisfaction results and other data to identify areas of improvement. </span></p>\n<p><span>• Empowers employees to provide excellent guest service. </span></p>\n<p><span>• Estimates cost and benefit ratio, maintaining balance between profit and service satisfaction. </span></p>\n<p><span>• Shares plans to take corrective action based on comment cards and guest satisfaction results with property leadership. </span></p>\n<span>  </span>\n<p><strong>Managing and Conducting Human Resource Activities</strong><span> </span></p>\n<p><span>• </span><span>Provides guidance and direction to subordinates, including setting performance standards and monitoring performance. </span></p>\n<p><span>• Coaches and supports food &amp; beverage team to effectively manage wages, food &amp; beverage cost and controllable expenses (e.g., restaurant supplies, uniforms, etc.). </span></p>\n<p><span>• Hires food &amp; beverage team members who demonstrate strong functional expertise, creativity and entrepreneurial leadership to meet the business needs of the operation. </span></p>\n<p><span>• Sets goals and expectations for direct reports using the performance review process and holds staff accountable for successful performance. </span></p>\n<p><span>• Ensures that expectations and objectives are clearly communicated to subordinates; subordinates are also open to raise questions and/or concerns. </span></p>\n<p><span>• Brings issues to the attention of Human Resources as necessary. </span></p>\n<p><span>• Ensures employees are treated fairly and equitably. </span></p>\n<p><span>• Coaches team by providing specific feedback to improve performance. </span></p>\n<span>  </span>\n<p><span> </span></p>\n<p><strong>Prior Hotel or Resort Director of Beverage and Food Experience Required. </strong><span>Additional experience in having gone through an opening or flag change required. Must be able to work with limited direction and get excited about setting and achieving goals for themselves and their team. Must be willing to partner with a 3rd party concept developer and follow the design and vision for the rooftop concept. </span></p>\n<p><span> </span></p>\n<p><strong>Requirements:</strong><span> </span></p>\n<p><em>The Director of Beverage and Food for the AC Hotel in Pasadena is expected to:</em><span> </span></p>\n<ul>\n<li><span>3+ Years in Hotel / Resort Food and Beverage Director Level Role </span></li>\n<li><span>write and implement the annual budget </span></li>\n<li><span>achieve budgeted GOP dollars and percentage </span></li>\n<li><span>maintain costs within goal for areas such as food cost, labor cost, operating expenses </span></li>\n<li><span>produce and achieve 30-60-90 day forecast to be within 3% for all outlets </span></li>\n<li><span>review and enforce weekly schedule worksheet to be on budget </span></li>\n<li><span>institute programs to effectively reduce worker's compensation and general liability insurance costs </span></li>\n<li><span>reduce unemployment insurance costs through effective employee review process and progressive discipline program </span></li>\n<li><span>comply with and engage in all brand marketing and product initiatives </span></li>\n<li><span>ensure all employees receive and are compliant with all brand required training along with other industry training to cultivate future leaders </span></li>\n<li><span>achieve outstanding BSA inspections through high GSS scores, high cleanliness scores, high condition scores and high compliance with brand standards. </span></li>\n<li><span>maintain employee turnover at or below 50% through high degree of employee engagement </span></li>\n<li><span>engage team to be involved in community projects as prescribed by Marriott and local initiatives </span></li>\n<li><span>be aware of, and comply with local ordinances from agencies like the board of health, liquor authority, zoning officials </span></li>\n<li><span>Must be authorized to work in the United States </span></li>\n<li><span>Must be RBS certified </span></li>\n<li><span>Must be servsafe certified </span></li>\n<li><span>Knowledge of Microsoft Excel </span></li>\n<li><span>Previous experience with TOAST is a plus </span></li>\n</ul>\n<p><span> </span></p>\n<p><br/></p>", "responsibilities": "Director of Beverage and Food functions as the strategic business leader of the property’s food and beverage/culinary operation, including Restaurants/Bars, and Banquets/Catering. Position oversees the development and implementation of departmental strategies and ensures implementation of the brand service strategy and brand initiatives. The position ensures the food and beverage/culinary operation meets the brand’s target customer needs, ensures employee satisfaction, and focuses on growing revenues and maximizing the financial performance of the department. Develops and implements property-wide strategies that deliver products and services to meet or exceed the needs and expectations of the brand’s target customer and property employees and provides a return on investment.", "qualifications": {"required": "Prior Hotel or Resort Director of Beverage and Food Experience Required. Additional experience in having gone through an opening or flag change required. Must be able to work with limited direction and get excited about setting and achieving goals for themselves and their team. Must be willing to partner with a 3rd party concept developer and follow the design and vision for the rooftop concept.", "preferred": "Must be authorized to work in the United States, Must be RBS certified, Must be servsafe certified, Knowledge of Microsoft Excel, Previous experience with TOAST is a plus"}, "skills": ["Microsoft Excel", "TOAST"], "postedDate": "1 week ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996474915"}