{"jobTitle": "Partner Marketing Manager", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "salary": {"amount": "150,000.00/yr - 211,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "We are seeking an experienced Partner Marketing Manager to join our team. In this role, you will be responsible for leading the development and execution of key partner co-marketing strategies and programs across multiple solutions, building and maintaining strategic relationships with key revenue-driving partners, and driving growth and demand for our solutions.<br/><br/>Partner Marketing Manager Responsibilities:<br/><br/><ul><li>Develop and execute comprehensive co-marketing plans across key solutions to support business goals, in collaboration with cross-functional teams and external partners</li><li>Use data and measurement to track the impact of marketing initiatives and make data-driven decisions</li><li>Systemize marketing efforts and drive operational excellence and rigor</li><li>Develop and manage budgets for marketing initiatives and ensure ROI is met or exceeded</li><li>Stay up-to-date on industry trends and the competitive landscape to identify new opportunities for growt</li><li>Manage vendor relationships and ensure successful execution of marketing initiatives<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>10+ years of experience in B2B marketing, with a focus on partner marketing</li><li>Proven track record of developing and executing successful marketing programs</li><li>Project management skills and experience working effectively with cross-functional teams</li><li>Analytical skills and demonstrated use of data to inform marketing decisions</li><li>Experience managing external partners</li><li>Problem-solving skills and experience thinking creatively</li><li>Demonstrated communication and presentation skills<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Understanding of digital marketing channels and tactics<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$150,000/year to $211,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "postedDate": "1 week ago", "skills": ["Partner Marketing", "B2B Marketing", "Marketing Programs", "Project Management", "Cross-functional Teams", "Data Analysis", "Marketing Decisions", "External Partner Management", "Problem Solving", "Creative Thinking", "Communication", "Presentation Skills", "Digital Marketing", "Marketing Channels", "Marketing Tactics"], "url": "https://www.linkedin.com/jobs/view/3996380804"}