{"jobTitle": "Human Resources (HR) Manager #701", "company": {"name": "Keller Executive Search International", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00/yr - $100,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Are you a seasoned HR professional looking for an exciting opportunity to drive the human resources function in a dynamic organization? Look no further! Keller Executive Search is seeking a passionate and experienced individual to join our client as HR Manager.<br/><br/><strong>Your Role as HR Manager:<br/><br/></strong>As the HR Manager, you will play a critical role in developing and executing HR strategies that align with the company's goals and objectives. You will be responsible for managing all aspects of the HR function, including recruitment, employee relations, performance management, training and development, and compensation and benefits.<br/><br/><strong>Location: </strong>New York, NY<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Manage the full cycle of recruitment, from job posting to onboarding, ensuring a seamless and positive candidate experience</li><li>Develop and implement HR policies and procedures to ensure compliance with legal requirements and best practices</li><li>Provide guidance and support to managers and employees on employee relations issues, ensuring fair and consistent treatment</li><li>Oversee performance management processes, including goal setting, performance evaluations, and development planning</li><li>Design and deliver training programs to enhance employee skills and knowledge</li><li>Create and implement compensation and benefits programs that attract and retain top talent</li><li>Maintain accurate and up-to-date employee records and HR data</li><li>Stay informed about changes in HR laws and regulations, advising the organization accordingly<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Minimum of 5 years of experience in a similar HR role</li><li>Bachelor's Degree in Human Resources or related field</li><li>Strong knowledge of HR laws, regulations, and best practices</li><li>Excellent communication and interpersonal skills</li><li>Strong problem-solving and decision-making abilities</li><li>Demonstrated ability to handle sensitive employee relations issues with professionalism and confidentiality<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li> Competitive Salary: $85,000 - $100,000 per year, commensurate with experience and qualifications</li><li> Health Insurance: Comprehensive medical, dental, and vision insurance plans to keep you and your family healthy</li><li> Retirement Plans: 401(k) plan with company matching to help you save for the future</li><li> Paid Time Off: Generous PTO including vacation days, sick leave, and paid holidays to ensure you have time to recharge</li><li> Professional Development: Opportunities for continuous learning and career growth through training programs, workshops, and certifications</li><li> Work-Life Balance: Flexible work schedules and hybrid work options to support your personal and professional life</li><li> Wellness Programs: Access to wellness initiatives, including gym memberships, mental health resources, and employee assistance programs</li><li> Life and Disability Insurance: Company-paid life insurance and short-term/long-term disability coverage to provide financial security<br/><br/><br/></li></ul><strong>Equal Employment Opportunity and Non-Discrimination Policy<br/><br/></strong><strong>Equal Employment Opportunity Statement:</strong> Both Keller Executive Search and our clients are Equal Opportunity Employers. For all positions, whether with Keller Executive Search or our clients, qualified applicants will receive consideration for employment without regard to race, skin color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran status, disability, genetic information, or any other legally protected status.<br/><br/><strong>Reasonable Accommodations:</strong> Both Keller Executive Search and our clients are committed to providing reasonable accommodations to individuals with disabilities and pregnant individuals. We engage in an interactive process to determine effective, reasonable accommodations. If you need assistance or an accommodation, please contact us at assistance@kellerexecutivesearch.com.<br/><br/><strong>Compensation Information:</strong> For client positions, compensation information is available in the job post. If not provided, it will be shared during the interview process in accordance with applicable laws. When required by law, salary ranges will be included in job postings. Actual salary may depend on skills, experience, and comparison to current employees in similar roles. Salary ranges may vary based on role and location.<br/><br/><strong>Compliance with Laws:</strong> Both Keller Executive Search and our clients comply with federal, state, and local laws governing nondiscrimination in employment. This policy applies to all employment terms and conditions, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.<br/><br/><strong>Workplace Harassment:</strong> Both Keller Executive Search and our clients expressly prohibit any form of workplace harassment based on race, skin color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.<br/><br/><strong>E-Verify Participation:</strong> Keller Executive Search and/or our clients may participate in E-Verify. Information about E-Verify participation will be provided during the application process where applicable.<br/><br/><strong>Privacy and Pay Equity:<br/><br/></strong><ul><li>California Residents: For more information about the categories of personal information we collect for recruiting and employment purposes, please review our Privacy Policy at www.kellerexecutivesearch.com</li><li>Colorado, Nevada, New York City, California, and Washington Residents: Compensation information is available in the job post or will be provided during the interview process if not initially available</li><li>Both Keller Executive Search and our clients are committed to pay equity and conduct periodic pay equity analyses in accordance with applicable laws<br/><br/><br/></li></ul><strong>State-Specific Information:<br/><br/></strong><ul><li> Rhode Island: We do not request or require salary history from applicants</li><li> Connecticut: We provide wage range information upon request or before discussing compensation</li><li> New Jersey: We do not inquire about salary history unless voluntarily disclosed<br/><br/><br/></li></ul><strong>Veteran Status:</strong> Both Keller Executive Search and our clients provide equal employment opportunities to veterans and comply with applicable state laws regarding veteran preference in employment. If you are a veteran, please inform us during the application process.<br/><br/><strong>Genetic Information:</strong> In accordance with federal and state laws, both Keller Executive Search and our clients do not discriminate based on genetic information. We do not request or require genetic information from applicants or employees, except as permitted by law.<br/><br/><strong>Local Laws:</strong> Both Keller Executive Search and our clients comply with all applicable local laws and ordinances regarding employment practices in the areas where we operate.<br/><br/><strong>Additional Assistance:</strong> If you need further assistance to fully engage in our application process, please contact assistance@kellerexecutivesearch.com.<br/><br/><strong>Note:</strong> This job posting may be for a position with Keller Executive Search or one of our clients. The specific employer will be identified during the application and interview process. Employment laws and requirements may vary depending on the employer and location.", "responsibilities": "As the HR Manager, you will play a critical role in developing and executing HR strategies that align with the company's goals and objectives. You will be responsible for managing all aspects of the HR function, including recruitment, employee relations, performance management, training and development, and compensation and benefits.", "qualifications": {"required": "Minimum of 5 years of experience in a similar HR role, Bachelor's Degree in Human Resources or related field, Strong knowledge of HR laws, regulations, and best practices, Excellent communication and interpersonal skills, Strong problem-solving and decision-making abilities, Demonstrated ability to handle sensitive employee relations issues with professionalism and confidentiality"}, "skills": [], "postedDate": "4 weeks ago", "benefits": "Competitive Salary: $85,000 - $100,000 per year, commensurate with experience and qualifications, Health Insurance: Comprehensive medical, dental, and vision insurance plans to keep you and your family healthy, Retirement Plans: 401(k) plan with company matching to help you save for the future, Paid Time Off: Generous PTO including vacation days, sick leave, and paid holidays to ensure you have time to recharge, Professional Development: Opportunities for continuous learning and career growth through training programs, workshops, and certifications, Work-Life Balance: Flexible work schedules and hybrid work options to support your personal and professional life, Wellness Programs: Access to wellness initiatives, including gym memberships, mental health resources, and employee assistance programs, Life and Disability Insurance: Company-paid life insurance and short-term/long-term disability coverage to provide financial security", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996212524"}