{"jobTitle": "Senior Buyer - Machining", "company": {"name": "Rocket Lab", "industry": "Aviation and Aerospace Component Manufacturing", "size": "201-500 employees", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000 — $130,000", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Aviation and Aerospace Component Manufacturing", "description": "Rocket Lab is a global leader in launch and space systems. The rockets and satellites we build and launch enable some of the most ambitious and vital space missions globally, supporting scientific exploration, Earth observation and missions to combat climate change, national security, and exciting new technology demonstrations. Our Electron rocket has provided reliable access to orbit since 2018, becoming one of the most frequently launched rockets in the world. Neutron will be our next rocket on the launch pad, an advanced 13-tonne payload class, reusable rocket to launch the mega constellations of the future. Our space systems business includes our extensive line of satellites and components that have enabled more than 1,700 missions including the James Webb Space Telescope, NASA Psyche Mission, Artemis I, Mars Ingenuity helicopter, and more. Join our pioneering team and launch your career to new heights!", "responsibilities": "Accountable for sourcing materials after appropriately evaluating vendor capability, price, delivery needs, and vendor performance. Accountable for the on-time-delivery of material to Rocket Lab. Responsible for owning the business relationship with assigned suppliers. Responsible for managing the RFQ process to secure competitive bids and ensure we are achieving best price for goods and services. Tightly integrate with Engineering teams to meet their procurement requirements and act as primary point of contact for R&D order status. Provide status to material planners on purchase orders and expected delivery dates. Accountable for negotiating terms with suppliers to meet quality, cost and delivery requirements. Accountable for maintaining purchase order data within our ERP system.", "qualifications": {"required": "Bachelor’s degree in Engineering, Supply Chain, Business Management, or other relevant fields. 5+ years of related experience as Buyer, Manufacturing Engineer, or equivalent. Proven ability to source, onboard, and negotiate pricing with suppliers. Proven knowledge of purchasing processes. Ability to travel domestically and internationally up to 10% of time.", "preferred": "Proficient in MRP systems. Prior experience in aerospace, automotive, or other disruptive manufacturing industries. Prior experience in rapid growth environment. Ability to read and interpret engineering drawings. Experience with AS9100, US export controls. Strong organizational and problem-solving skills, with the ability to prioritize effectively and efficiently. Excellent verbal and written communication abilities. Team oriented, strong ability to multi-task and work in a fast-paced environment and to multiple deadlines."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Base salary is just one component of our total rewards package at Rocket Lab. Employees may also receive company equity and access to a robust benefits package including: top tier medical HMO, PPO & a 100% company-sponsored medical HSA plan option, dental and vision coverage, 3 weeks paid vacation and 5 days sick leave per year, 11 paid holidays per year, flexible spending and dependent care savings accounts, paid parental leave, disability insurance, life insurance, and access to a 401(k) retirement plan with company match. Other perks include: Discounted employee stock purchase program, subsidized EV charging stations, onsite gym, food and drinks, childcare concierge, and other discounts.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996929973"}