{"jobTitle": "Investment Operations Analyst / Associate ", "company": {"name": "Voy Ventures", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$90,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Finance and Consulting", "industry": "Venture Capital and Private Equity Principals, Investment Management, and Real Estate", "description": "Voy is partnering with a prestigious private markets investment firm to build out a newly created Investment Operations / Middle-Office Team.  \n\n**This position is fully remote with occasional travel to San Diego**\n\nThis team will support the firm’s investment activity, consolidating & analyzing data, streamlining transactional procedures, optimizing technology solutions and ultimately, ensuring the deals and transactions are closed correctly. Investment strategies include private equity, growth equity, venture capital, real estate and real assets.  \n\nThis is a fantastic opportunity to join a newly created team of a proven and reputable private investment firm with over $100b in AUM as one of the original members. You will play a significant role in shaping and growing the Investment Operations team.\n\nWe are looking for both *Investment Operations Analysts* (1-3 years of exp) and *Investment Operations Associates* (3-6 years of exp) Candidates.  \n\n**Responsibilities:**\n\n* **Update and Maintain Status:** Regularly update and maintain the latest information from deal, legal, tax, and treasury teams in the company's proprietary technology platform (PTP).\n* **Organize Legal Documents:** Speed up the collection and organization of final legal documents for completed transactions and capital markets facilities, and upload them to PTP.\n* **Communicate Funding Information:** Provide real-time updates to the treasury on estimated funding needs, including transaction size, cash required at closing, and funding timelines.\n* **Track Transaction Pipeline:** Carefully track the transaction pipeline and upload necessary documents to meet pre-investment regulatory requirements in Luxembourg.\n* **Support SPV Operations:** Assist with setting up Special Purpose Vehicles (SPVs) for transactions, including getting tax IDs (EINs), gathering formation documents, and opening bank accounts.\n* **Manage Fund Finance Pipeline:** Organize and manage the pipeline of all fund finance needs and any new financing facilities in progress.\n* **Assist with Special Projects:** Help with additional special projects as needed.\n\nRequirements:\n\n* Bachelor’s degree in Finance, Economics, Accounting or a related field \n* 1-5+ years of investment operations, middle-office or deal operations \n* Based in West Coast / PST Time Zones\n* Able to travel to San Diego occasionally and then infrequently\n* Acute attention to accuracy and detail \n* Elite communication and organization abilities", "responsibilities": "Update and Maintain Status: Regularly update and maintain the latest information from deal, legal, tax, and treasury teams in the company's proprietary technology platform (PTP).Organize Legal Documents: Speed up the collection and organization of final legal documents for completed transactions and capital markets facilities, and upload them to PTP.Communicate Funding Information: Provide real-time updates to the treasury on estimated funding needs, including transaction size, cash required at closing, and funding timelines.Track Transaction Pipeline: Carefully track the transaction pipeline and upload necessary documents to meet pre-investment regulatory requirements in Luxembourg.Support SPV Operations: Assist with setting up Special Purpose Vehicles (SPVs) for transactions, including getting tax IDs (EINs), gathering formation documents, and opening bank accounts.Manage Fund Finance Pipeline: Organize and manage the pipeline of all fund finance needs and any new financing facilities in progress.Assist with Special Projects: Help with additional special projects as needed.", "qualifications": {"required": "Bachelor’s degree in Finance, Economics, Accounting or a related field 1-5+ years of investment operations, middle-office or deal operations Based in West Coast / PST Time ZonesAble to travel to San Diego occasionally and then infrequentlyAcute attention to accuracy and detail Elite communication and organization abilities"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3996793852"}