{"jobTitle": "VP, Account Director", "company": {"name": "United Entertainment Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "95,000 - 156,000", "currency": "USD"}, "jobFunction": "Public Relations and Information Technology", "industry": "Public Relations and Communications Services and IT Services and IT Consulting", "description": "UEG is an award-winning global agency specializing in entertainment, sports and lifestyle marketing. We create breakthrough marketing partnering brands with the people, places and platforms that shape popular culture. Our suite of services includes celebrity/influencer programming, music-film-tv/digital-sports partnerships, communications, branded content and experiential.<br/><br/>The team at UEG is a dynamic group, bringing together best-in-class expertise across entertainment, sports and lifestyle, paired with a strong understanding of brand building and effective marketing communications. This is a work hard, play hard environment where we combine true passion for culture with the innate desire to create industry-changing work for our clients.<br/><br/>The VP, Account Director will oversee multiple mid-sized pop culture accounts inclusive of creative content development, account management and activation. The role requires a strong account lead who can deliver innovative thinking, author smart decks, troubleshoot client and team issues as well as oversee the financial health of the business from team utilization to client procurement management.<br/><br/>Candidates must have a passion for pop-culture and its infusion into the consumer brand ecosphere and have a strong background in social/digital marketing.<br/><br/><strong>RESPONSIBILITIES:<br/><br/></strong><ul><li>Create and maintain strong client relationships across the brand and with partner agencies. </li><li>Work alongside leads of the specialty practices (Influencer/Talent, Strategy, Branded Content, Entertainment, Sports and Experiential) to bring best-in-class thinking to every client assignment. </li><li>Develop and lead innovative thinking for each client/brand while infusing UEG’s marketplace POD delivering award-worthy programs and high-quality execution/management. </li><li>Be a leading and proactive voice during inter-agency meetings by representing UEG and leading all UEG-owned workstreams alongside client paid, PR and digital agencies </li><li>Oversight and management of the account’s financials alongside the team Business Manager including pricing, staffing (planning and utilization), SOW development and client procurement process. </li><li>Ongoing business development and growth within the portfolio based on key client relationships, opportunistic pitches, ideation and overall quality/health of the business. </li><li>Team management including the personal development of direct reports via career pathing, goal setting and ongoing mentorship. <br/><br/><br/></li></ul><strong>QUALIFICATIONS:<br/><br/></strong><ul><li>At least 8+ years of experience relevant to the role and industry with strong work examples and references demonstrating an exemplary account lead who can maintain positive client relationships, deliver strategic council, and successfully troubleshoots client and internal issues. </li><li>A deep knowledge of the social/digital space as well as influencer marketing including but not limited to influencer/talent search and acquisition, content development and management of social platform ins and outs. </li><li>A keen understanding of financial and operational performance of multiple sizable accounts to ensure quality work, deadline and budget adherence. </li><li>Ability to command a room as a dynamic speaker with strategic credibility fueled with analytical insights. </li><li>Superior written and verbal communications skills along with the proven ability to consistently make sound judgments and effectively motivate and manage teams. </li><li>Strong collaborator and mentor with the ability to bring out the best in agency talent to produce great work for clients. </li><li>Passion for pop-culture/insights and trends <br/><br/><br/></li></ul>$95,000 - $156,000 a year<br/><br/>An employee’s pay position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, travel requirements, revenue-based metrics, any contractual agreements, and business or organizational needs. The range listed is just one component of DJEH’s total compensation package for employees. Other rewards may include annual bonuses, a Paid Time Off policy, and region-specific benefits.", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996493676"}