{"jobTitle": "Business Systems Analyst II BI/Data", "company": {"name": "Proven Recruiting", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Cypress, CA"}, "location": "Cypress, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$101,000.00 - $120,000.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Staffing and Recruiting", "description": "BI and Data Business Systems Analyst II – $101K – $120K DOE + 10% discretionary bonus – Hybrid (Orange County)\n\nOrange County, LA, or San Diego Candidates Only!!\n\nOur industry-leading client is looking for your experience in BI and data business systems analysis. Our next BI and Data BSA II will be well-rounded with understanding, identifying, discovering, documenting, and analyzing functional requirements. If you are looking for a high-energy environment and are passionate about analytical techniques, practices, and problem-solving, this job is for you – apply now!!\n\nWho You Are:\n\n- Bachelor’s in Computer Science, Business, or related field experience \n- 5+ years of experience as a Business Systems Analyst \n- 1+ years of Metals industry experience preferred \n- Working Knowledge of BI tools, Platforms and trends required \n- Working knowledge of Master data management solution preferred \n- Experience with Cloud data architecture required \n- Ability to profile and analyze data, derive insights from data as well as experience working with many disparate data sets required.\n\nWhat You’ll Do:\n\n- Elicit, identify, and document business requirements and implement BI and Data solutions to business stakeholders \n- Will play a key role in the planning/analysis, profiling, design and testing phases of data projects, working closely with business stakeholders and data team members and the entire project team to ensure project success. \n- Works extensively on data analysis and validation of data ingested from disparate systems. \n- Champion ongoing releases of new and improved capabilities and adhere to and support project lifecycle methodologies \n- Incorporate usability and UI efficiencies into business solutions \n\nWhy Work Here:\n\n- Join a stable and leading global company that is continuously improving its systems \n- Work in a collaborative environment where a passion for owning your part of the process is present \n- A company culture with empowerment, teamwork, collaboration, and promotions from within \n- Complete benefits package, including medical, dental, vision, 401(k), and PTO \n\nWhat does this position pay?\n\nCompensation is determined by several factors, which may include skill set, experience level, and geographic location.\n\nThe expected range for this role is $101k to $120k per year, plus a 10% discretionary bonus and annual merit review. Please note this range is an estimate, and actual pay may vary based on qualifications and experience. Complete benefits package, including medical, dental, vision, 401(k), and PTO.\n\nThis company is looking for an experienced BI and Data Business Systems Analyst II who is eager to deliver a positive impact to business users throughout the organization. Please email your resume to Elissa Profant at eprofant@provenrecruiting.com if you’d like to grow your career in a nationwide industry-leading company while working alongside some of the finest IT personnel in Southern California.\n\nNote: We actively support and promote people of various backgrounds, from race, religion, and gender to geographical areas, university, lifestyle, and personality type. Proven Recruiting is minority-owned, majority women, and is a strong advocate for diversity and inclusion in the broader community. Apply today!", "responsibilities": "Elicit, identify, and document business requirements and implement BI and Data solutions to business stakeholders. Will play a key role in the planning/analysis, profiling, design and testing phases of data projects, working closely with business stakeholders and data team members and the entire project team to ensure project success. Works extensively on data analysis and validation of data ingested from disparate systems. Champion ongoing releases of new and improved capabilities and adhere to and support project lifecycle methodologies. Incorporate usability and UI efficiencies into business solutions.", "qualifications": {"required": "Bachelor’s in Computer Science, Business, or related field experience, 5+ years of experience as a Business Systems Analyst, Working Knowledge of BI tools, Platforms and trends required, Experience with Cloud data architecture required, Ability to profile and analyze data, derive insights from data as well as experience working with many disparate data sets required.", "preferred": "1+ years of Metals industry experience preferred, Working knowledge of Master data management solution preferred."}, "skills": ["Business Analysis", "Data Analysis", "BI Tools", "Cloud Data Architecture", "Master Data Management"], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Complete benefits package, including medical, dental, vision, 401(k), and PTO.", "remoteWork": "Hybrid (Orange County)", "url": "https://www.linkedin.com/jobs/view/3996316278"}