{"jobTitle": "Manufacturing Operations Manager", "company": {"name": "Movement Search & Delivery", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "150,000.00/yr - 160,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing", "description": "**This is a manufacturing environment and an on-site role**<br/>\n<u>Compensation Target:</u>\n-150-160K base\n-20% bonus\n<br/>\n<u>Keys to the role:</u>\n- Aerospace experience highly preferred\n- Metal Fabrication or machining experience preferred\n- 3+ years of prior plant responsibility (management or operations)\n- Lean Experience\n<br/>\n<strong><u>Job Description</u></strong> \nThe Business Unit Manager (Manufacturing Operations Manager), is responsible for directing the functions and activities of our Operations organization. The BUM, will develop strategies to achieve operational objectives for daily, weekly, monthly, quarterly and annual metrics. Duties involve directing the business unit operations on a daily basis to ensure execution of the company business plan while simultaneously implementing Continuous Improvement initiatives that will deliver long term benefits.\n\n<strong>Primary Duties &amp; Responsibilities:</strong>\n<ul><li>Champion of safety and compliance throughout organization.</li><li>Lead and manage the Operations organization by implementing profitable programs and processes to optimize manufacturing work flow.</li><li>Drives daily performance and high impact projects that meet or exceed Safety, Quality, Schedule and Cost performance objectives. When misses occur, develops a credible recovery plan with the team.</li><li>Responsible for: developing people; process improvement; cost controls, quality monitoring and improvements; new product development and implementation; and customer service optimization.</li><li>Manage Key Performance Indicators and Reporting on daily performance.</li><li>Champion and initiate Continuous Improvement projects to increase Revenue per Square Foot and Revenue per Employee.</li><li>Implement Lean Manufacturing principles</li><li>Identify new opportunities to impact business and operations goals positively. Manages these projects to rapid completion.</li><li>Direct and coordinate manufacturing activities based on policies, objectives and programs spanning manufacturing functions.</li><li>Ensure Company policies and procedures are understood and consistently followed by others.</li><li>Determine performance and product quality and direct accountability for that performance.</li><li>Brief and communicate with customers, suppliers and corporate executives with high intensity and professionalism.</li><li>Build, develop and manage manufacturing leadership team capable of carrying out needed manufacturing strategies and improving employee relations.</li><li>Implement effective problem resolution process to facilitate faster improvements and improved working relationships.</li><li>Establish strong partnering relationships with cross-functional management (EHS, Engineering, Sales, Quality, Finance, HR, etc.) to ensure alignment of company objectives and effective cross-functional processes.</li><li>Create and maintain a regular cadence of performance feedback with direct reports. Collaboratively create development plans and coach individuals in achieving them.</li><li>Create an energizing work environment that supports the Company’s high performance culture while ensuring an efficient and flexible organization.</li></ul>\n\n<strong>Required Skills:</strong>\n\n<strong> </strong>\n<ul><li>Proven analytical, problem solving, and process improvement ability</li><li>Working knowledge of general aerospace quality requirements</li><li>Ability to understand and apply the production planning processes.</li><li>Ability to apply lean manufacturing methodology, TOC, and problem solving skills to drive the business improvements in a metric-driven environment</li><li>Demonstrated ability to develop a strategic plan to meet key business objectives/metrics in the areas of Safety, Quality, Delivery, Inventory, and Cost.</li><li>Demonstrated ability to manage multiple tasks and priorities and easily adapt to changing situations and priorities.</li><li>Must be computer literate, particularly in spreadsheet; financial; inventory and production planning and tracking applications.</li><li>Demonstrated ability to develop, execute and deliver results in conformance with action plans.</li><li>Proven ability to lead large organization in a fast paced short cycle manufacturing environment.</li></ul>\n\n<strong>Desired Skills:</strong>\n\n<ul><li>Highly organized, self-motivated individual who can work independently as well as work effectively in a collaborative team environment.</li><li>Technical competence: Experience with CNC machines of all axis and types</li><li>Comprehensive knowledge of and ability to apply budgeting processes and financial management tools</li><li>Working knowledge of Six Sigma and Statistical Process Control</li><li>Strong oral and written communication skills</li><li>Strong interpersonal and leadership skills</li><li>Demonstrated ability to lead programs / projects</li><li>Ability to document, plan, market, and execute programs</li><li>Established project management skills</li><li>Proven leadership in Fasteners, Aerospace, or Automotive type Industry</li></ul>\n\n<strong>Experience &amp; Education</strong>\n\n<strong> </strong>\n<ul><li>Bachelor’s degree in business or an engineering discipline. MS or MBA degree is highly desirable</li><li>More than 7 years of progressive manufacturing leadership experience and responsibility.</li><li>Experience leading people and obtaining results through others, with excellent verbal and written communication skills.</li><li>Proven track record of driving results in Machining environment.</li></ul>", "responsibilities": "The Business Unit Manager (Manufacturing Operations Manager), is responsible for directing the functions and activities of our Operations organization. The BUM, will develop strategies to achieve operational objectives for daily, weekly, monthly, quarterly and annual metrics. Duties involve directing the business unit operations on a daily basis to ensure execution of the company business plan while simultaneously implementing Continuous Improvement initiatives that will deliver long term benefits.", "qualifications": {"required": "Proven analytical, problem solving, and process improvement ability, Working knowledge of general aerospace quality requirements, Ability to understand and apply the production planning processes., Ability to apply lean manufacturing methodology, TOC, and problem solving skills to drive the business improvements in a metric-driven environment, Demonstrated ability to develop a strategic plan to meet key business objectives/metrics in the areas of Safety, Quality, Delivery, Inventory, and Cost., Demonstrated ability to manage multiple tasks and priorities and easily adapt to changing situations and priorities., Must be computer literate, particularly in spreadsheet; financial; inventory and production planning and tracking applications., Demonstrated ability to develop, execute and deliver results in conformance with action plans., Proven ability to lead large organization in a fast paced short cycle manufacturing environment.", "preferred": "Highly organized, self-motivated individual who can work independently as well as work effectively in a collaborative team environment., Technical competence: Experience with CNC machines of all axis and types, Comprehensive knowledge of and ability to apply budgeting processes and financial management tools, Working knowledge of Six Sigma and Statistical Process Control, Strong oral and written communication skills, Strong interpersonal and leadership skills, Demonstrated ability to lead programs / projects, Ability to document, plan, market, and execute programs, Established project management skills, Proven leadership in Fasteners, Aerospace, or Automotive type Industry, Bachelor’s degree in business or an engineering discipline. MS or MBA degree is highly desirable, More than 7 years of progressive manufacturing leadership experience and responsibility., Experience leading people and obtaining results through others, with excellent verbal and written communication skills., Proven track record of driving results in Machining environment."}, "skills": ["Aerospace", "Lean Manufacturing", "CNC", "Six Sigma", "Project Management", "Manufacturing", "Operations", "Continuous Improvement", "Problem Solving", "Leadership", "Teamwork", "Communication", "Analytical Skills", "Process Improvement", "Production Planning", "Budgeting", "Financial Management", "Statistical Process Control"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Student loan assistance, Disability insurance, Tuition assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996442910"}