{"jobTitle": "Human Resources Manager", "company": {"name": "Henkel", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000.00 - $125,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Chemical Manufacturing", "description": "At Henkel, you can build on a strong legacy and leading positions in both industrial and consumer businesses to reimagine and improve life every day. If you love challenging the status quo, join our community of 47.000 pioneers around the globe. The teams in our corporate functions enable the best in our dynamic businesses and in our people to maximize our company’s potential. With our leading brands, our cutting-edge technologies and our disruptive solutions, you will have countless opportunities to explore new paths and develop your skills. Grow within our future-led businesses, our diverse and vibrant culture and find a place where you simply belong. All to leave your mark for more sustainable growth.<br/><br/><strong>Dare to make an impact?<br/><br/></strong><strong> Your Role <br/><br/></strong><ul><li> Work closely with Human Resources Director and senior leadership to align Human Resources strategies with business goals </li><li>Developing and executing Human Resources initiatives to optimize business operations, enhance workplace culture, and boost employee engagement </li><li> Managing and resolving employee relations issues by conducting thorough and objective investigations </li><li> Supporting and managing performance management and change initiatives within the organization </li><li>Partnering with leadership to implement and drive organization design efforts </li><li> Identifying training and development needs for employees </li><li> Managing recruitment efforts to fill job vacancies </li><li> Creating and managing a dashboard for tracking people metrics and delivering insights across the business based on people metrics dashboard</li><li> Managing and tracking employee development nominations </li><li> Conducting exit interviews and analyzing turnover data for improvement areas </li><li> Maintaining employee files, ensuring system updates Ensuring compliance with laws and company policies </li><li> Handling additional projects as assigned <br/><br/></li></ul><strong> YOUR SKILLS <br/><br/></strong><ul><li> Bachelor’s degree in human resources, Psychology, Business Management, or related field </li><li>Minimum of 5 years progressive experience in Human Resources </li><li>Strong analytical abilities for data interpretation and trend identification </li><li> Experience with data tools and statistical methods </li><li> Thorough knowledge of Human Resources policies, procedures, and current employment laws </li><li>Proficient in all Microsoft Office applications; SAP experience a plus PHR/SPHR certification a plus <br/><br/></li></ul>The salary for this role is $95,000.00 - $125,000.00. This is the range that we in good faith anticipate relying on when setting wages for this position. We may ultimately pay more or less than the posted range and this range. This salary range may also be modified in the future.<br/><br/>Henkel does not accept unsolicited resumes from search firms or employment agencies. Unsolicited referrals and resumes are considered Henkel property and therefore, Henkel will not pay a fee for any placement resulting from the receipt of an unsolicited referral. At Henkel's request only, preferred vendors may be invited to refer talent for specific open positions. In these cases, a fully-executed agreement with Henkel must be in place and current.<br/><br/>All employees applying for an internal position must have a discussion with his/her manager about their interest in a job posting opportunity. The discussion will not preclude the employee from interviewing if their skills meet the job requirements.<br/><br/>At Henkel, we come from a broad range of backgrounds, perspectives, and life experiences. We believe the uniqueness of all our employees is the power in us. Become part of the team and bring your uniqueness to us! We welcome all applications across different races, colors, religions, sexes, national origins, disabilities, veteran statuses, ages, sexual orientations, gender identities and expressions, and other legally protected characteristics.", "responsibilities": "Work closely with Human Resources Director and senior leadership to align Human Resources strategies with business goals Developing and executing Human Resources initiatives to optimize business operations, enhance workplace culture, and boost employee engagement Managing and resolving employee relations issues by conducting thorough and objective investigations Supporting and managing performance management and change initiatives within the organization Partnering with leadership to implement and drive organization design efforts Identifying training and development needs for employees Managing recruitment efforts to fill job vacancies Creating and managing a dashboard for tracking people metrics and delivering insights across the business based on people metrics dashboard Managing and tracking employee development nominations Conducting exit interviews and analyzing turnover data for improvement areas Maintaining employee files, ensuring system updates Ensuring compliance with laws and company policies Handling additional projects as assigned", "qualifications": {"required": "Bachelor’s degree in human resources, Psychology, Business Management, or related field Minimum of 5 years progressive experience in Human Resources Strong analytical abilities for data interpretation and trend identification Experience with data tools and statistical methods Thorough knowledge of Human Resources policies, procedures, and current employment laws Proficient in all Microsoft Office applications; SAP experience a plus PHR/SPHR certification a plus", "preferred": ""}, "skills": ["Human Resources", "Employee Relations", "Performance Management", "Talent Acquisition", "Training and Development", "Data Analysis", "Microsoft Office", "SAP", "PHR", "SPHR"], "postedDate": "2 weeks ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996510883"}