{"jobTitle": "Associate Mental Health Provider (Remote)", "company": {"name": "Serene Health", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$28.00/hr - $33.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "Empowering Wellness, Transforming Lives\n\nOptima Medical Management Group is dedicated to enhancing the quality of life by promoting wellness. At Optima MMG and all of its divisions: Serene Health, A Positive Choice, and PsycHealth, our mission is to provide comprehensive support and care that not only addresses immediate concerns but also fosters long-term well-being.\n\nAs pioneers in the field, we aspire to lead in member care outcomes and set new standards for excellence and innovation. We are committed to empowering our members to achieve self-sufficiency in health, creating a ripple effect that strengthens families and communities.\n\nOur work culture at Optima MMG is built on pride, passion, and a collective commitment to making a positive difference in people's lives. Our team members are dedicated problem-solvers who bring their unique skills and perspectives to the table. We believe that by fostering a collaborative and supportive environment, we can unlock the full potential of our team and, in turn, provide the best possible care to our members.\n\nA career at Optima MMG is an opportunity to be part of a dynamic and forward-thinking organization. We encourage continuous learning and professional growth, providing our employees with access to industry experts, cutting-edge technologies, and a supportive community that values each individual's contributions. Join us on this journey to not only advance your career but to be a driving force in transforming lives and communities through passionate and fulfilling work!", "responsibilities": "Conduct psychological assessments to evaluate clients' mental health conditions and needs. Develop and implement personalized treatment plans that incorporate both traditional and alternative therapeutic approaches. Provide a mix of in-person and remote counseling sessions to individuals, couples, families, or groups, as required. Utilize evidence-based practices such as Cognitive Behavioral Therapy (CBT), Dialectical Behavior Therapy (DBT), mindfulness practices, and other innovative methods tailored to client needs. Stay informed about the latest research and advancements in mental health treatments and integrate applicable findings into practice. Maintain confidentiality and adhere to all ethical guidelines and standards of practice. Collaborate with other healthcare professionals as needed to provide holistic care to clients. Participate in professional development opportunities to enhance therapeutic skills and knowledge. Keep accurate and up-to-date client records, documenting all therapy sessions, treatment plans, and progress notes. Perform other duties as needed.", "qualifications": {"required": "Master's or Doctorate degree in Psychology, Counseling, Social Work, or related field. Valid state license to practice as a therapist (e.g., ACSW, AMFT, APCC). Experience with a variety of therapeutic approaches and modalities. Proficiency in providing both in-person and remote therapy sessions. Excellent communication and interpersonal skills. Strong ethical framework and respect for client confidentiality.", "preferred": "Certification or specialized training in specific therapeutic techniques or modalities. Experience with electronic health records (EHR) and telehealth platforms. Ability to work with diverse populations and a wide range of mental health conditions. Bilingual or multilingual abilities."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "Not specified", "benefits": "Medical, Dental, & Vision Benefits: We have various insurance options for you and your family. Short & Long-Term Disability Benefits: Protection when you need it most. Voluntary Accident, Voluntary Critical Illness, and Voluntary Hospital Indemnity Plans: Added security for you and your loved ones. Flexible Spending Accounts: Manage your finances with flexibility. Employee Assistance Program (EAP): Support when life throws challenges your way. 401(K): Building your financial future with us. Effective after 1 year of employment. Paid Vacation and Sick Leave: Flexibility for the planned and unplanned. Paid Holidays: Quality time to enjoy celebrations. Employee Referral Program: Share the opportunities and reap the rewards. Company Discount Program: Enjoy savings on everyday expenses and memberships.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3996018029"}