{"jobTitle": "People Partner, YouTube Shopping", "company": {"name": "Google", "location": "San Bruno, CA"}, "location": "San Bruno, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "202,000-287,000", "currency": "USD"}, "jobFunction": "Business Development, Human Resources, and Consulting", "industry": "Information Services and Technology, Information and Internet", "description": "Minimum qualifications:<br/><br/>\n<ul><li>Bachelor's degree or equivalent practical experience.</li><li>12 years of experience as a HR business partner or generalist supporting leaders at global companies.</li><li>Experience with managing organization transformations across multiple regions and talent pools.</li><li>Experience in one or more of the following areas: Organizational design, succession planning, performance management, diversity and inclusion, business consulting, compensation and rewards, recognition programs, culture keeper, employee engagement, coaching and development, talent management, conflict resolution, talent acquisition, data analysis, and employee relations.<br/><br/></li></ul>Preferred qualifications:<br/><br/>\n<ul><li>MBA or Master's degree.</li><li>Ability to analyze data, understand trends, and develop recommendations for action based on the analysis.</li><li>Ability to be comfortable with ambiguity and being a part of strategy discussions.</li><li>Ability to work within constraints as well as to test the status quo.</li><li>Excellent problem solving skills.<br/><br/></li></ul>About The Job<br/><br/>\nIn this role, you will partner closely with Engineering, Vice Presidents (VPs) in Living Room/Infra and Data Science, as well as with the VP, General Manager (GM) for YouTube Shopping. You will work across a variety of functions - Engineering, Program Management, Data Science and with two of our biggest growth areas: Living Room and Shopping.<br/><br/>The role requires co-location with our anchor client in YouTube's San Bruno, CA Offices.<br/><br/>Great just isn't good enough for our People Operations team (known elsewhere as \"Human Resources\"). We bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next Googler, refining our core programs, developing talent, or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field. You’ll play an essential role advancing a more diverse, accessible, equitable, and inclusive Google through our hiring, promotion, retention, and inclusion practices.<br/><br/>The US base salary range for this full-time position is $202,000-$287,000. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br/><br/>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Offer thought leadership regarding organizational and people-related strategy and execution. Provide insightful data to guide decision making and provide proactive solutions. Partner with leaders on the define, design, launch, landing of change initiatives.</li><li>Consult with Google's leaders to create a comprehensive people plan to influence lasting change over large functions at Google.</li><li>Solve problems and get to the root cause of any issue, no matter how complex, and design and quickly implement solutions that cut across multiple disciplines, even those beyond people and organizational solutions.</li><li>Provide expertise in the following areas: talent and performance management, change management, leadership coaching, data analysis and insights, employee relations and strategic development.<br/><br/><br/></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .", "responsibilities": "<ul><li>Offer thought leadership regarding organizational and people-related strategy and execution. Provide insightful data to guide decision making and provide proactive solutions. Partner with leaders on the define, design, launch, landing of change initiatives.</li><li>Consult with Google's leaders to create a comprehensive people plan to influence lasting change over large functions at Google.</li><li>Solve problems and get to the root cause of any issue, no matter how complex, and design and quickly implement solutions that cut across multiple disciplines, even those beyond people and organizational solutions.</li><li>Provide expertise in the following areas: talent and performance management, change management, leadership coaching, data analysis and insights, employee relations and strategic development.<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree or equivalent practical experience.\n12 years of experience as a HR business partner or generalist supporting leaders at global companies.\nExperience with managing organization transformations across multiple regions and talent pools.\nExperience in one or more of the following areas: Organizational design, succession planning, performance management, diversity and inclusion, business consulting, compensation and rewards, recognition programs, culture keeper, employee engagement, coaching and development, talent management, conflict resolution, talent acquisition, data analysis, and employee relations.", "preferred": "MBA or Master's degree.\nAbility to analyze data, understand trends, and develop recommendations for action based on the analysis.\nAbility to be comfortable with ambiguity and being a part of strategy discussions.\nAbility to work within constraints as well as to test the status quo.\nExcellent problem solving skills."}, "skills": [], "postedDate": "1 week ago", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3996903891"}