{"jobTitle": "Country Sales Head", "company": {"name": "CORA Talent Solutions", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Business Consulting and Services", "description": "Our client, a comprehensive logistics service provider with modern service management capabilities, with more than 400 employees, is seeking a Country Manager in Los Angeles, CA to join their team. The company mainly engages in international sea, land and air freight forwarding business for various types of goods such as full containers, bulk cargo, oversized items and dangerous goods. At the same time, it also provides customers with value-added logistics services such as supplier management, LCL, customs declaration and inspection, fumigation, freight insurance, inland trailers, warehousing, transshipment and cargo distribution.\n\nCountry Manager, Los Angeles, USA\n\nLanguage Spoken: Chinese\n\nResponsibilities\n\n* Responsible for business startup from scratch, team building, talent development, goal management, and other related work in the US branch\n* Responsible for coordinating and managing the development of the regional market and customer maintenance work of the branch\n* Responsible for the development and maintenance of shipowner channel resources\n* Responsible for the integration and analysis of industry market information, providing suggestions for the development of company strategy and process optimization \n* Regularly submit reports to the head office on the status of the company's operations and achieve the performance targets set by the head office \n* Regularly assess the performance of employees in various positions, make recommendations on the appointment and dismissal of subordinates, and land the company's culture and other clinical work assigned by the leadership.\n\nRequirements\n\n* College degree or above in Logistics Management, International Trade, and other related majors, with a good\ncommand of English and Chinese\n* More than 5 years of working experience in International Freight Forwarding/Trade Logistics/Shipping Port/ Airline Shipping and other related industries\n* More than 3 years working in the same position and customer/channel resources are preferred\n* Overseas sales experience is preferred\n* Excellent business management skills\n* Excellent leadership and interpersonal/ social skills\n\nSalary & Benefits\n\n* Annual income: Negotiable\n* Annual Bonus: Based on the achievement of the current year's performance targets and the company's overall operating profit.\n* Benefits: Insurance, paid time off, annual travel, annual physical examination, annual holiday time off.\n\nOther Requirements\n\n* Have some overseas customers, and other channel resources\n* Language: Chinese, preferably proficient in English\n* Work address: specific location to be selected", "postedDate": "2 weeks ago", "skills": ["English", "Chinese", "Logistics Management", "International Trade", "International Freight Forwarding", "Trade Logistics", "Shipping Port", "Airline Shipping", "Business Management", "Leadership", "Interpersonal Skills", "Social Skills"], "url": "https://www.linkedin.com/jobs/view/3996269559"}