{"jobTitle": "General Manager Restaurant (Greater Los Angeles Region)", "company": {"name": "Sweetfin", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "<strong>Job Description<br/><br/></strong>FINANCIAL<br/><br/>Responsible for meeting the overall operational financial performance of the restaurant. Ensure and hold direct reports accountable for meeting and controlling operating expenses and established targets. You will also be responsible for managing your stores accounts payable, banking and deposits, and utilize the company provided budget templates. Manage operating P&amp;L budgets/metrics and understands how production expenditures/costs impact business margins for weekly, monthly and yearly time parameters. Responsible for budget and profit (forecast) responsibility and ensuring cost control through declining budgets and other methods.<br/><br/>RECRUITMENT &amp; TRAINING<br/><br/>Responsible for developing, managing and coaching all FOH and BOH staff to high-performance values. Assist in the recruitment, selection, training, and development of restaurant management and teams. Foster a positive, team-oriented environment with a healthy competitive spirit that ensures the sharing of best practices amongst different positions. Communicate and impart Sweetfin culture and core values to team members. Assist in Sweetfin corporate culture initiatives.<br/><br/>OPERATIONS<br/><br/>The General Manager may directly perform hands-on operational work as necessary to select and train new staff members, respond to immediate customer service needs, or to otherwise role-model appropriate skills and behaviors in the restaurant. Maintain Sweetfin standards in food safety, store safety, overall quality control. Provide guidance and leadership in the delivery of outstanding guest experience, culinary operations, labor scheduling, inventory management (spot check for food, beverage and supplies), restaurant marketing and restaurant P&amp;L. Identify maintenance needs and ensure maintenance log adherence. Process payroll, food/product orders, and complete weekly/monthly/quarterly/annual tasks and checklists in a timely manner and communicate any barriers to your direct report supervisor<br/><br/>MARKETING<br/><br/>Drive top-line sales performance by fostering customer connections through community marketing, throughput and technology initiatives, and new product launches. Follow the marketing schedule and guidelines set forth by our marketing department. A minimum of two (2) hours a week is to be dedicated to local store marketing (LSM).Monitor collateral assets to stay ‘in brand’<br/><br/>FACILITIES<br/><br/>Ensure that all equipment and fixtures are operating as they were designed. Communicate any deficient/broken equipment needs to your direct report supervisor. Ensure that pest control services are conducted on a monthly basis, and keep records of all services.<br/><br/><strong>Company Description<br/><br/></strong>OUR MISSION IS TO FUEL LIFE THROUGH FRESHNESS. WE STRIVE TO PROVIDE A CULINARY EXPERIENCE THAT IS FRESH, ACCESSIBLE, AND NATURALLY CRAVEABLE. PREMIUM-GRADE FRESHNESS IS OUR SWEET SPOT.<br/><br/>www.sweetfin.com<br/><br/>Sweetfin was created with the goal of providing healthy, nutritious and flavorful bowls with premium quality ingredients and with approachability. Our fine-casual restaurant concept takes all the familiar flavors of sushi and puts them in an easy to eat, portable, customizable, and affordable bowl.<br/><br/>Our culinary philosophy is centered in our “Pole to Bowl” ethos which means that in sourcing our fish we aim to use the highest-quality and most sustainable raw fish we can find while still maintaining a reasonable price point. Our menu is 100% gluten free and we are vegan and vegetarian friendly.<br/><br/>OUR MISSION IS TO FUEL LIFE THROUGH FRESHNESS. WE STRIVE TO PROVIDE A CULINARY EXPERIENCE THAT IS FRESH, ACCESSIBLE, AND NATURALLY CRAVEABLE. PREMIUM-GRADE FRESHNESS IS OUR SWEET SPOT. www.sweetfin.com Sweetfin was created with the goal of providing healthy, nutritious and flavorful bowls with premium quality ingredients and with approachability. Our fine-casual restaurant concept takes all the familiar flavors of sushi and puts them in an easy to eat, portable, customizable, and affordable bowl. Our culinary philosophy is centered in our “Pole to Bowl” ethos which means that in sourcing our fish we aim to use the highest-quality and most sustainable raw fish we can find while still maintaining a reasonable price point. Our menu is 100% gluten free and we are vegan and vegetarian friendly.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996398289"}