{"jobTitle": "Creative Project Manager", "company": {"name": "Subtropic Studios", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Contract-to-hire", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management, Art/Creative, and Design", "industry": "Design Services, Graphic Design, and Advertising Services", "description": "<strong>Creative Project Manager</strong>\n\n<strong>Location: Los Angeles</strong>\n\n<br/>\n\nSubtropic is a multidisciplinary creative studio helping brands transform their audience into steadfast fans through design, strategy and innovation. We are not your traditional creative agency – approaching projects of any size with the same focus and drive.\n\n<br/>\n\nWe’re looking for a Project Manager to join Team Subtropic. As a member of the team, you will work closely with our Strategists, Design and Business Teams as well as directly with external brands, agencies and production vendors. The role will oversee multiple creative projects in Augmented Reality, Visual Design and Video. The ideal candidate will demonstrate strong collaboration in working closely across multiple cross-functional teams at Subtropic, excellent communication skills in client management, and strategic thinking in proactively problem-solving against creative challenges and logistical hurdles during each project.\n\n<br/>\n\n<strong>Employment Type</strong>\n\nContract-to-hire\n\n<br/>\n\n<strong>What You’ll Do:</strong>\n\n· Manage the post-sale production process for various design projects from brief to final delivery\n\n· Intake projects and assess assets, ensure full understanding of the creative ask and communicate to cross functional teams\n\n· Serve as a direct point of contact for clients and vendors. Providing detailed quotes, timelines and managing expectations along the way\n\n· Coordinate people and processes to deliver projects on time, within budget and with the desired outcomes aligned to objectives\n\n· Secure final asset approval from client and agency partners\n\n· Work with Team Managers for resourcing \n\n<br/>\n\n<strong>Minimum qualifications:</strong>\n\n· 3-5 years experience in production / project management in an agency environment\n\n· Proficient in software such as Keynote and GSuite\n\n· Candidate should possess strong organizational, problem-solving, and interpersonal skills\n\n· Experience working independently with cross functional team of stakeholders and developers based on the project assignment\n\n· Ability to work under pressure in a fast paced environment and rise to creative challenges under tight deadlines\n\n· BS/BA degree or equivalent years of experience\n\n<br/>\n\n<strong>Preferred qualifications:</strong>\n\n· Familiarity of agile project management\n\n· Experience working on AR/VR executions\n\n· Proficient in Adobe Creative Cloud\n\n· Understanding of project management software such as Asana, Slack and Monday.com\n\n<br/>\n\n<em>At Subtropic, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Subtropic is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. If you have a disability or special need that requires accommodation, please don’t be shy and contact us at hello@subtropicstudios.com</em>\n\n<p></p>", "responsibilities": "· Manage the post-sale production process for various design projects from brief to final delivery\n\n· Intake projects and assess assets, ensure full understanding of the creative ask and communicate to cross functional teams\n\n· Serve as a direct point of contact for clients and vendors. Providing detailed quotes, timelines and managing expectations along the way\n\n· Coordinate people and processes to deliver projects on time, within budget and with the desired outcomes aligned to objectives\n\n· Secure final asset approval from client and agency partners\n\n· Work with Team Managers for resourcing ", "qualifications": {"required": "· 3-5 years experience in production / project management in an agency environment\n\n· Proficient in software such as Keynote and GSuite\n\n· Candidate should possess strong organizational, problem-solving, and interpersonal skills\n\n· Experience working independently with cross functional team of stakeholders and developers based on the project assignment\n\n· Ability to work under pressure in a fast paced environment and rise to creative challenges under tight deadlines\n\n· BS/BA degree or equivalent years of experience", "preferred": "· Familiarity of agile project management\n\n· Experience working on AR/VR executions\n\n· Proficient in Adobe Creative Cloud\n\n· Understanding of project management software such as Asana, Slack and Monday.com"}, "skills": ["Keynote", "GSuite", "Asana", "Slack", "Monday.com", "Adobe Creative Cloud"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3996483136"}