{"jobTitle": "Production Planner II", "company": {"name": "Paragon Laboratories", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$28.00 - $34.00", "currency": "USD"}, "jobFunction": "Manufacturing", "industry": "Wellness and Fitness Services", "description": "$28.00 - $34.00 per hour.<br/><br/>Full-Time<br/><br/>The Production Planner is responsible for preparing work schedules, tracking progress, updating critical path schedules, and communicating changes. This role tracks production activity to help ensure a smooth and controlled flow of materials, troubleshoot potential scheduling problems, assist with providing solutions, identify material deficiencies and remove blockers to ensure on-time product delivery.<br/><br/><strong>Essential Job Functions<br/><br/></strong><ul><li>Responsible for support and coordination in planning, and scheduling for daily, weekly, and monthly plant production material and material requirements.</li><li>Create and maintain daily, weekly, and monthly production schedule.</li><li>Generate daily, weekly, and monthly cases produced volume reports.</li><li>Addressing production issues and delays to minimize downtime.</li><li>Forecast production execution needs by coordinating raw material releases for production projections.</li><li>Communicate effectively and proactively with vendors to meet deliveries based on lead times.</li><li>Provide accurate information on material consumption for process orders, materials, quantities and lot numbers.</li><li>Initiates, updates, and confirmed daily production process order for work in progress and finished goods.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>5-7 years of experience in procurement, logistics, supply chain or similar role.</li><li>Experience with inventory management and capacity planning.</li><li>Exceptional detail and organizational skills, with the ability to manage multiple projects.</li><li>Strong interpersonal skills with the ability to collaborate effectively with cross-functional teams. </li><li>Knowledge of ERP/MRP systems.</li><li>Prefer advanced excel skills in creating spreadsheets, pivot tables and charts, formulas and functions, VLOOKUP and conditional formatting, etc.</li><li>Ability to solve practical problems and deal with a variety of changing situations under stress.</li><li>Familiarity with manufacturing process and equipment.</li><li>Strong organizational and scheduling skills.</li><li>Ability to analyze data and create reports which accurately reflect the state of business.</li><li>Ability to troubleshoot production issues and implement corrective actions.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in supply chain, Engineering or related discipline.</li><li>2 or more years of practical experience with ERP/MRP systems in a production environment.</li><li>Previous experience in supply chain/logistics with manufacturing.</li></ul>", "responsibilities": "The Production Planner is responsible for preparing work schedules, tracking progress, updating critical path schedules, and communicating changes. This role tracks production activity to help ensure a smooth and controlled flow of materials, troubleshoot potential scheduling problems, assist with providing solutions, identify material deficiencies and remove blockers to ensure on-time product delivery.", "qualifications": {"required": "5-7 years of experience in procurement, logistics, supply chain or similar role. Experience with inventory management and capacity planning. Exceptional detail and organizational skills, with the ability to manage multiple projects. Strong interpersonal skills with the ability to collaborate effectively with cross-functional teams.  Knowledge of ERP/MRP systems. Prefer advanced excel skills in creating spreadsheets, pivot tables and charts, formulas and functions, VLOOKUP and conditional formatting, etc. Ability to solve practical problems and deal with a variety of changing situations under stress. Familiarity with manufacturing process and equipment. Strong organizational and scheduling skills. Ability to analyze data and create reports which accurately reflect the state of business. Ability to troubleshoot production issues and implement corrective actions.", "preferred": "Bachelor’s degree in supply chain, Engineering or related discipline. 2 or more years of practical experience with ERP/MRP systems in a production environment. Previous experience in supply chain/logistics with manufacturing."}, "skills": ["Procurement", "Logistics", "Supply Chain", "Inventory Management", "Capacity Planning", "ERP", "MRP", "Excel", "Manufacturing"], "postedDate": "1 week ago", "url": "https://www.linkedin.com/jobs/view/3997070595"}